[
  {
    "job_id": "3887486398",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "CHARGER LOGISTICS IS A WORLD CLASS ASSET-BASED CARRIER. WE SPECIALIZE IN DELIVERING ASSETS, ON TIME AND ON BUDGET. WITH THE DIVERSE FLEET OF EQUIPMENT, WE CAN HANDLE A RANGE OF FREIGHT, INCLUDING DEDICATED LOADS, SPECIALIZED HAULS, TEMPERATURE-CONTROLLED GOODS AND HAZMAT CARGO.CHARGER LOGISTICS INVESTS TIME AND SUPPORT INTO ITS EMPLOYEES TO PROVIDE THEM WITH THE ROOM TO LEARN AND GROW THEIR EXPERTISE AND WORK THEIR WAY UP. WE ARE ENTREPRENEURIAL-MINDED ORGANIZATION THAT WELCOMES AND SUPPORT INDIVIDUAL IDEA AND STRATEGIES. WE ARE CURRENTLY LOOKING TO HIRE AN EXPERIENCED AND DYNAMIC BUSINESS DEVELOPMENT MANAGER, BASED OUT OF CHARLOTTE, NC. YOU MAY BE REQUIRED TO TRAVEL TO OUR CANADA OFFICE OCCASIONALLY.JOB DUTIES:THE BUSINESS DEVELOPMENT MANAGER WILL WORK CLOSELY WITH THE PRESIDENT AND DIRECTOR OF SALES TO DEVELOP TERRITORY AND ACCOUNT STRATEGIES TO SUPPORT SALES GROWTH.IDENTIFY NEW BUSINESS OPPORTUNITIES AND CONSTANTLY STRIVE TO MAINTAIN STRONG RELATIONSHIPS WITH EXISTING BUSINESS ACCOUNTS.YOU'RE READY TO TAKE ON COMPLICATED PROBLEMS AND GIVE BACK WELL THOUGHT OUT SOLUTIONS. YOU'RE NOT AFRAID TO BUILD A PROSPECT LIST AND MAKE A COLD CALLS. BUT YOU ALSO UNDERSTAND THE VALUE OF NETWORKING AND MAKING CONNECTIONS.YOU WILL ALSO BE RESPONSIBLE FOR MANAGING AND DEFINING FINANCIAL RESOURCES SUCH AS, MONITORING BUDGETS RELATED TO YOUR PROJECTS AND PROVIDING INPUT OR ANALYSIS FOR FINANCIAL DECISIONS THAT IMPACT YOUR PARTICULAR PROJECT.AS A BUSINESS DEVELOPMENT MANAGER AT CHARGER, YOU ARE WILLING TO LEARN THE BUSINESS AND GROW THE COMPANY OVER A LONG TERM. YOU ARE SOMEONE WHO INVESTS TIME INTO BUILDING AND FOSTERING RELATIONSHIPS TO TRULY EARN NEW ACCOUNTS. \n\nREQUIREMENTS\n\nPROVEN TRACK RECORD WITH A STRONG FOCUS ON NEW BUSINESS DEVELOPMENT INCLUDING COLD CALLING, SETTING APPOINTMENTS, PRESENTING AND MEETING WITH POTENTIAL CUSTOMERS, PRICING, PROPOSALS THROUGH TO 'CLOSING THE DEAL'.5+ YEARS OF SALES AND ACCOUNT MANAGEMENT EXPERIENCE IN TRANSPORTATION INDUSTRY, HIGHLY PREFERRED.EXPERIENCE WORKING B2B SALES INVOLVING COMPLEX DEALS.STRONG KNOWLEDGE AND UNDERSTANDING OF THE SALES PLANNING PROCESS.ABILITY TO INTERFACE WITH ALL REQUIRED LEVELS AT A CUSTOMER (ENTRY LEVEL TO SENIOR EXECUTIVE)STRONG VERBAL, WRITTEN, AND PRESENTATION SKILLS & STRONG INTERPERSONAL AND CUSTOMER RELATION SKILLS.STRONG NEGOTIATION SKILLS WITH PROVEN CLOSING ABILITY.HIGH ENERGY AND GENUINE PASSION FOR \"SELLING\".ABILITY TO FUNCTION INDEPENDENTLY WITH LITTLE OR NO SUPERVISION AS WELL AS FUNCTION IN A TEAM ENVIRONMENT.COLLEGE OR UNIVERSITY DEGREE IN A MARKETING OR BUSINESS-RELATED FIELD IS AN ASSET. \n\nBENEFITS\n\nCOMPETITIVE SALARYHEALTHCARE BENEFIT PACKAGECAREER GROWTH",
    "job_skill_set": [
      "business development",
      "sales",
      "account management",
      "cold calling",
      "sales planning",
      "B2B sales",
      "presentation skills",
      "customer relationship management",
      "budget monitoring",
      "communication",
      "interpersonal skills",
      "problem solving",
      "teamwork",
      "independence",
      "adaptability",
      "entrepreneurial mindset",
      "relationship building",
      "passion for selling",
      "negotiation",
      "financial analysis",
      "marketing knowledge"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "analysis",
      "b2b",
      "budget",
      "building",
      "business",
      "businessdevelopment",
      "calling",
      "cold",
      "communication",
      "customer",
      "development",
      "entrepreneurial",
      "financial",
      "for",
      "independence",
      "interpersonal",
      "knowledge",
      "management",
      "manager",
      "marketing",
      "mindset",
      "monitoring",
      "negotiation",
      "passion",
      "planning",
      "presentation",
      "problem",
      "relationship",
      "sales",
      "selling",
      "skills",
      "solving",
      "teamwork"
    ]
  },
  {
    "job_id": "3905305873",
    "job_title": "Business Development Coordinator",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "THOMPSON COBURN, A LARGE FULL-SERVICE LAW FIRM WITH OFFICES IN EIGHT (8) CITIES ACROSS THE U.S., IS IN SEARCH OF A FULL-TIME NON-EXEMPT BUSINESS DEVELOPMENT COORDINATOR TO JOIN ITS ST. LOUIS OFFICE. WITH OVER 400 ATTORNEYS AND EXPERIENCE IN 50 AREAS OF LAW, THOMPSON COBURN IS REGULARLY RECOGNIZED FOR PROVIDING CLIENTS WITH OUTSTANDING VALUE AND SERVICE. DRIVEN BY OUR CORE VALUES OF INTEGRITY, INNOVATION AND DIVERSITY, WE COLLABORATE AND WORK IN A WELCOMING, FAST-PACED, AND INCLUSIVE ENVIRONMENT.\n\nARE YOU READY TO KICK-START YOUR CAREER IN THE MARKETING AND BUSINESS DEVELOPMENT FIELD? OUR ST. LOUIS TEAM IS SEEKING A DETAIL-ORIENTED AND DRIVEN INDIVIDUAL TO JOIN US AS A BUSINESS DEVELOPMENT COORDINATOR. IF YOU POSSESS STRONG WRITING AND COMMUNICATION SKILLS AND A PASSION FOR LEARNING, THIS COULD BE THE PERFECT OPPORTUNITY FOR YOU! THIS POSITION REQUIRES IN-OFFICE SUPPORT AND AFTER AN INITIAL PERIOD OF TRAINING IS ELIGIBLE FOR A HYBRID-REMOTE WORK SCHEDULE.\n\nKEY RESPONSIBILITIES\n\n MAINTAINS CURRENT AND ACCURATE MATTER LISTS, DESCRIPTIONS, AND CASE STUDIES FOR USE IN MARKETING AND BUSINESS DEVELOPMENT EFFORTS.  CREATES PROPOSALS AND PITCHES ON AN AS-NEEDED BASIS WITH DIRECTION FROM BUSINESS DEVELOPMENT TEAM.  ASSISTS WITH THE DEVELOPMENT AND EXECUTION OF MARKETING/BUSINESS DEVELOPMENT STRATEGIES, PLANS, AND PROJECTS AS DIRECTED.  REVIEWS MARKETING MATERIALS CAREFULLY FOR QUALITY, CONTENT, FORMAT, ACCURACY, AND BRAND COMPLIANCE.  SCHEDULES ALL DEPARTMENT, CLIENT RELATIONS COMMITTEE, AND OTHER MEETINGS AS DIRECTED.  SUPPORTS CHIEF MARKETING AND BUSINESS DEVELOPMENT OFFICER AND OTHER SENIOR TEAM MEMBERS AS NEEDED. \n\nEXPERIENCE AND EDUCATION QUALIFICATIONS\n\n BACHELOR’S DEGREE IN COMMUNICATION, JOURNALISM, HISTORY OR ANOTHER WRITING-INTENSIVE DISCIPLINE OR EQUIVALENT EXPERIENCE REQUIRED.  AT LEAST ONE (1) YEAR OF EXPERIENCE IN A MARKETING SUPPORT OR EQUIVALENT POSITION IS PREFERRED. EXPERIENCE IN A PROFESSIONAL SERVICES FIELD IS DESIRED. \n\nTHOMPSON COBURN LLP IS A LARGE, FULL SERVICE, MULTI-STATE FIRM WITH OFFICES IN BIRMINGHAM, CHICAGO, DALLAS, LOS ANGELES, NEW YORK, ST. LOUIS, SOUTHERN ILLINOIS, AND WASHINGTON D.C. AT THOMPSON COBURN, OUR BEHAVIOR AND THE EXPECTATIONS WE HAVE OF OURSELVES ARE GUIDED BY THE VALUES THAT WE HOLD IN THE HIGHEST REGARD: INTEGRITY, A PASSION FOR EXCELLENCE, A FOCUS ON SERVING THE CLIENT, A VALUE OF DIVERSITY, INNOVATION, CREATIVITY, TRUST, AND LOYALTY. WITHIN THE FIRM, WE VALUE EACH OTHER AS PEOPLE AND COLLEAGUES. IN ADDITION TO THE EXCEPTIONAL WORKING ENVIRONMENT AND A COMPETITIVE SALARY, THOMPSON COBURN PROVIDES THE FOLLOWING BENEFIT OPTIONS TO QUALIFYING EMPLOYEES:\n\n MEDICAL INSURANCE  VISION INSURANCE  DENTAL INSURANCE  LIFE INSURANCE & ADD POLICIES  SHORT & LONG TERM DISABILITY INSURANCE  PAID PARENTAL LEAVE  401(K) PROFIT SHARING PLANS  PARKING/TRANSPORTATION STIPEND  SECTION 125 PLAN (PRE-TAX PREMIUMS, DEPENDENT CARE AND MEDICAL REIMBURSEMENT)  PAID HOLIDAYS  PAID VACATION TIME  EMPLOYEE ASSISTANCE PROGRAM (EAP)  EMPLOYEE WELLNESS PROGRAM  TUITION REIMBURSEMENT  COLLEGE SAVINGS PLAN DEDUCTIONS (529 PLANS)  LONG TERM CARE \n\nEQUAL OPPORTUNITY EMPLOYER M/F/D/V\n\n",
    "job_skill_set": [
      "communication",
      "marketing",
      "proposal creation",
      "project management",
      "attention to detail",
      "team collaboration",
      "adaptability",
      "initiative",
      "time management",
      "client relations",
      "problem solving",
      "writing",
      "data management",
      "brand compliance"
    ],
    "short_keywords": [
      "adaptability",
      "attention",
      "brand",
      "business",
      "businessdevelopment",
      "client",
      "collaboration",
      "communication",
      "compliance",
      "coordinator",
      "creation",
      "data",
      "detail",
      "development",
      "initiative",
      "management",
      "marketing",
      "problem",
      "project",
      "proposal",
      "relations",
      "solving",
      "team",
      "time",
      "to",
      "writing"
    ]
  },
  {
    "job_id": "3886878942",
    "job_title": "Director of Business Development",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "DIRECTOR OF BUSINESS DEVELOPMENT - DALLAS, FREIGHT FORWARDING MARKET\nLOCATION: DALLAS, TX\nRESPONSIBILITIES:\nPROSPECT AND ACQUIRE NEW CUSTOMERS WITHIN THE FREIGHT FORWARDING MARKET IN DALLAS, PRIORITIZING WINNING NEW LOGOS AND ENGAGING IN DOOR-TO-DOOR CANVASSING.UTILIZE A PROACTIVE APPROACH, INCLUDING COLD CALLING AND STRATEGIC NETWORKING, TO GENERATE LEADS AND SECURE NEW BUSINESS OPPORTUNITIES.DEVELOP AND MAINTAIN STRONG RELATIONSHIPS WITH KEY DECISION-MAKERS AND STAKEHOLDERS IN THE INDUSTRY.STAY UPDATED ON MARKET TRENDS, RATES, AND COMPETITIVE INTELLIGENCE TO IDENTIFY GROWTH OPPORTUNITIES AND MAXIMIZE REVENUE POTENTIAL.MANAGE THE SALES CYCLE INDEPENDENTLY FROM PROSPECTING TO CLOSING, DEMONSTRATING EXCEPTIONAL NEGOTIATION AND PERSUASION SKILLS.COLLABORATE CLOSELY WITH INTERNAL TEAMS TO ENSURE SEAMLESS EXECUTION OF CLIENT SOLUTIONS AND DELIVERABLES, CONTRIBUTING TO BUSINESS SUCCESS THROUGH EFFECTIVE SALES STRATEGIES AND CLIENT MANAGEMENT.\nREQUIREMENTS:\nMINIMUM OF 5 YEARS OF EXPERIENCE IN BUSINESS DEVELOPMENT OR SALES WITHIN THE INTERNATIONAL FREIGHT FORWARDING INDUSTRY.PROVEN TRACK RECORD OF PRODUCING OVER $300K GP PER YEAR, WITH SUCCESS IN WINNING NEW BUSINESS AND EXCEEDING SALES TARGETS.STRONG UNDERSTANDING OF FREIGHT RATES, MARKET DYNAMICS, AND INDUSTRY TRENDS.EXPERIENCE WORKING FOR AN INTERNATIONAL FREIGHT FORWARDING COMPANY WITH EXPERTISE IN SELLING AIR, OCEAN, IMPORT, AND EXPORT SERVICES.DEMONSTRATED ABILITY TO WORK INDEPENDENTLY AS A SOLO CONTRIBUTOR, WITH A SELF-DRIVEN AND PROACTIVE APPROACH TO ACHIEVING GOALS.EXISTING BOOK OF BUSINESS IN THE DALLAS MARKET IS PREFERRED.EXCELLENT COMMUNICATION, PRESENTATION, AND INTERPERSONAL SKILLS.\nCOMPENSATION:\nBASE SALARY: $120,000 PER YEARCOMMISSION: 10% ON ALL NEW BUSINESS GENERATED",
    "job_skill_set": [
      "business development",
      "sales",
      "negotiation",
      "persuasion",
      "market analysis",
      "cold calling",
      "strategic networking",
      "client management",
      "presentation skills",
      "communication",
      "relationship building",
      "self-driven",
      "proactive approach",
      "collaboration",
      "interpersonal skills",
      "goal-oriented",
      "freight forwarding",
      "understanding of freight rates",
      "international freight forwarding"
    ],
    "short_keywords": [
      "analysis",
      "approach",
      "building",
      "business",
      "businessdevelopment",
      "calling",
      "client",
      "cold",
      "collaboration",
      "communication",
      "development",
      "director",
      "forwarding",
      "freight",
      "goaloriented",
      "international",
      "interpersonal",
      "management",
      "market",
      "negotiation",
      "networking",
      "of",
      "persuasion",
      "presentation",
      "proactive",
      "rates",
      "relationship",
      "sales",
      "selfdriven",
      "skills",
      "strategic",
      "understanding"
    ]
  },
  {
    "job_id": "3899520962",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "OUR CLIENT, A LEADING PACKAGING SUPPLIER LOCATED IN NORTHERN IL IS EXPANDING ITS SALES TEAM AND IS SEEKING ESTABLISHED SALESPEOPLE TO JOIN THEIR TEAM. FOLLOWING INITIAL TRAINING, THIS ROLE OFFERS THE FLEXIBILITY TO WORK FROM HOME AND ON THE ROAD ESTABLISHING STRONG RELATIONSHIPS AND DRIVING SALES. THE POSITION OFFERS A COMPETITIVE BASE SALARY ALONGSIDE UNCAPPED COMMISSIONS.\nPRINCIPLE ACCOUNTABILITIES:\nACHIEVE SALES TARGETS WITHIN ASSIGNED TERRITORY.EMPLOY VARIOUS STRATEGIES, SUCH AS BUSINESS DEVELOPMENT CALLS, EMAILS, AND IN-PERSON VISITS, TO GENERATE NEW BUSINESS OPPORTUNITIES.MANAGE PRICING, NEGOTIATION, AND STAY ABREAST OF MARKET TRENDS WHILE FOSTERING LASTING CUSTOMER RELATIONSHIPS.COLLABORATE WITH TEAM MEMBERS TO ENHANCE PACKAGING SOLUTIONS FOR EXISTING AND POTENTIAL CUSTOMERS.\nREQUIREMENTS:\nPROVEN SUCCESS IN A PRIOR SALES POSITIONDEMONSTRATED ABILITY TO THRIVE UNDER PRESSURE AND EXHIBIT SELF-MOTIVATIONPACKAGING INDUSTRY EXPERIENCE IS A PLUS\nREACH OUT TO MATT BARTH TO LEARN MORE!262.748.8857 / MBARTH@QUICKSOURCERECRUITING.COM",
    "job_skill_set": [
      "business development",
      "customer relationship management",
      "self-motivation",
      "team collaboration",
      "communication",
      "sales",
      "negotiation",
      "market analysis",
      "packaging industry knowledge",
      "pressure management"
    ],
    "short_keywords": [
      "analysis",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "customer",
      "development",
      "industry",
      "knowledge",
      "management",
      "market",
      "negotiation",
      "packaging",
      "pressure",
      "relationship",
      "representative",
      "sales",
      "selfmotivation",
      "team"
    ]
  },
  {
    "job_id": "3889721091",
    "job_title": "100% Remote | Business Development Manager - B2B Sales | Commission-Based with High Earning Potential",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "JOIN THE LEOSOLVE GROUP AND DRIVE GLOBAL BUSINESS GROWTH\nREADY TO LEVERAGE YOUR SKILLS IN A ROLE WHERE YOUR EFFORT DIRECTLY TRANSLATES INTO YOUR EARNINGS? LEOSOLVE IS SEEKING DRIVEN BUSINESS DEVELOPMENT MANAGERS TO EMPOWER BUSINESSES ACROSS THE UK, USA, AND CHINA WITH SIGNIFICANT SAVINGS ON QUALITY PRODUCTS AND MATERIALS. THIS IS AN EXCEPTIONAL OPPORTUNITY FOR AMBITIOUS PROFESSIONALS TO THRIVE IN A DYNAMIC, GROWTH-ORIENTED ENVIRONMENT.\nYOUR ROLE:\nAS A BUSINESS DEVELOPMENT MANAGER, YOU WILL IDENTIFY AND ENGAGE POTENTIAL B2B CLIENTS, CONNECTING THEM WITH COST-EFFECTIVE PROCUREMENT SOLUTIONS. YOUR INITIATIVE TO FORGE NEW RELATIONSHIPS AND UNDERSTAND CLIENT NEEDS IS KEY TO DRIVING OUR MISSION FORWARD.\nWHAT WE OFFER:\nCOMPETITIVE COMMISSION: START WITH A REWARDING COMMISSION OF 5-7% ON SALES, DESIGNED TO REFLECT YOUR CONTRIBUTION AND DEDICATION.UNLIMITED EARNING POTENTIAL: THERE’S NO CAP ON WHAT YOU CAN ACHIEVE. THE MORE YOU SELL, THE MORE YOU EARN, WITH THE POTENTIAL TO SIGNIFICANTLY EXCEED YOUR INITIAL EXPECTATIONS BASED ON YOUR SUCCESS.REMOTE FLEXIBILITY: ENJOY THE FREEDOM TO WORK FROM ANYWHERE, SETTING YOUR SCHEDULE TO OPTIMIZE CLIENT ENGAGEMENT AND SALES ACTIVITIES.\nWHY LEOSOLVE?\nIMPACT: YOUR WORK DIRECTLY INFLUENCES THE SUCCESS OF SMES BY PROVIDING THEM WITH AFFORDABLE ACCESS TO ESSENTIAL PRODUCTS AND MATERIALS.SUPPORT: YOU’LL BE PART OF A FORWARD-THINKING GROUP, COMMITTED TO INNOVATION AND EXCELLENCE IN PROCUREMENT SOLUTIONS.GROWTH: EXCEL IN YOUR ROLE, AND THERE WILL BE OPPORTUNITIES FOR PROFESSIONAL DEVELOPMENT AND ADVANCEMENT WITHIN LEOSOLVE.\nWE'RE LOOKING FOR:\nSELF-MOTIVATED INDIVIDUALS WITH EXCEPTIONAL COMMUNICATION AND NEGOTIATION SKILLS.THOSE WITH A SOLID UNDERSTANDING OF B2B SALES, READY TO EMBRACE A COMMISSION-BASED MODEL.TEAM PLAYERS WHO ARE EXCITED ABOUT CONTRIBUTING TO THE COMPANY’S GROWTH WHILE REALIZING THEIR PROFESSIONAL AND FINANCIAL GOALS.\nTAKE THE NEXT STEP:\nIF THE PROSPECT OF JOINING A TEAM COMMITTED TO RESHAPING PROCUREMENT EXCITES YOU, AND YOU’RE EAGER TO BUILD A REWARDING CAREER ON YOUR OWN TERMS, WE’D LOVE TO HEAR FROM YOU.\nAPPLY NOW ON THIS PLATFORM OR BY SENDING YOUR RESUME TO INFO@LEOSOLVE.COM. LET’S EXPLORE HOW WE CAN ACHIEVE GREAT THINGS TOGETHER.",
    "job_skill_set": [
      "B2B Sales",
      "Negotiation",
      "Communication",
      "Client Engagement",
      "Self-Motivated",
      "Team Player",
      "Initiative",
      "Adaptability",
      "Problem Solving",
      "Procurement Solutions"
    ],
    "short_keywords": [
      "100",
      "adaptability",
      "b2b",
      "business",
      "businessdevelopment",
      "client",
      "commissionbased",
      "communication",
      "development",
      "earning",
      "engagement",
      "high",
      "initiative",
      "manager",
      "negotiation",
      "player",
      "potential",
      "problem",
      "procurement",
      "remote",
      "sales",
      "selfmotivated",
      "solutions",
      "solving",
      "team",
      "with"
    ]
  },
  {
    "job_id": "3903428762",
    "job_title": "Senior Business Development Associate",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "SUMMARY OF JOB PURPOSE:\nTHE DBI TEAM SPECIALIZES IN THE EVALUATION OF DAMAGED STRUCTURES. DBI’S CONSTRUCTION EXPERTS PROVIDE INDEPENDENT RECOMMENDATIONS AND ANALYSIS TO CLIENTS IN THE INSURANCE AND LEGAL INDUSTRY. HARD EVIDENCE, EXPERTISE, AND ACCURACY DRIVE WORK; COMMUNICATION AND CONNECTION ARE THE COMPANY’S TOP PRIORITIES. IN A COMPLEX INDUSTRY, THE COMPANY’S MISSION IS TO BRING CLARITY TO EVERY CLIENT SERVED BY DBI.\nTHE SENIOR BUSINESS DEVELOPMENT ASSOCIATE AT DBI WILL PLAY A CRUCIAL ROLE IN DRIVING BUSINESS GROWTH AND ACHIEVING ANNUAL GOALS. THIS INVOLVES IDENTIFYING AND PURSUING OPPORTUNITIES TO INCREASE THE ANNUAL PROJECT COUNT AND EXPAND OUR ACTIVE CLIENT BASE. THEY WILL LEVERAGE THEIR BUSINESS DEVELOPMENT SKILLS, MARKET KNOWLEDGE, AND INDUSTRY CONNECTIONS TO GENERATE LEADS, ENGAGE WITH POTENTIAL CLIENTS, AND CONVERT THEM INTO VALUABLE BUSINESS RELATIONSHIPS.THE IDEAL CANDIDATE SHOULD HAVE A COMPREHENSIVE UNDERSTANDING OF THE INSURANCE CLAIMS INDUSTRY AND THE ROLES OF DIFFERENT STAKEHOLDERS INVOLVED. THIS INCLUDES INSURANCE CARRIERS, ADJUSTERS, ATTORNEYS, APPRAISERS, INVESTIGATORS, AND THIRD-PARTY EXPERTS. THEY SHOULD UNDERSTAND HOW THESE ROLES INTERACT AND COLLABORATE THROUGHOUT THE PROPERTY CLAIMS PROCESS. \nTHE CANDIDATE SHOULD HAVE AN ESTABLISHED CLIENT BASE, WITH A TRACK RECORD FOR DELIVERING EXCEPTIONAL SERVICE AND EXCEEDING CLIENT EXPECTATIONS, WHILE DEVELOPING AND MAINTAINING LONG-TERM RELATIONSHIPS.\nTHE CANDIDATE WILL BE HIGHLY MOTIVATED WITH AN INNATE SENSE OF URGENCY TO PROVIDE THE BEST SERVICE TO DBI CLIENTS. THE ROLE REQUIRES A FRIENDLY, APPROACHABLE PERSONALITY THAT WILL REPRESENT DBI WITH INTEGRITY, AS WELL AS DEMONSTRATE ENTHUSIASM ABOUT DBI, AND THE WORK THAT IS CONDUCTED BY THE BUSINESS. THEY SHOULD BE ABLE TO EFFECTIVELY COMMUNICATE THE VALUES AND BENEFITS OF DBI'S SERVICES, GENERATING EXCITEMENT AND INTEREST AMONG CLIENTS AND PROSPECTS. THE CANDIDATE SHOULD HAVE A STRONG TEAM PLAYER MINDSET. THEY SHOULD BE COLLABORATIVE, SUPPORTIVE, AND WILLING TO GO THE EXTRA MILE TO ENSURE THE SUCCESS OF THEIR TEAM MEMBERS AT DBI.\n PRIMARY JOB RESPONSIBILITIES:STAY UP TO DATE ON INDUSTRY TRENDS AND CHANGES; IDENTIFY POTENTIAL DBI CLIENTS AND MARKETING OPPORTUNITIES NATIONALLY, AS WELL AS INTERNATIONALLY.BUILD AND NURTURE CLIENT RELATIONSHIPS THROUGH ATTENDANCE AT LARGE AND SMALL-SCALE MARKETING EVENTS, AS WELL AS MEETINGS AND PRESENTATIONS ACROSS THE UNITED STATES.ASSIST WITH THE PREPARATION OF THE BUSINESS DEVELOPMENT DIVISIONS ANNUAL PARTNER PRESENTATION.TRACK AND MAINTAIN BUSINESS DEVELOPMENT MEETINGS AND EVENTS.INITIATE AND COORDINATE INDUSTRY FUNCTIONS THAT ARE REPRESENTATIVE OF THE DBI BRAND.COORDINATE AND CONDUCT DATA ANALYSIS IN DBI’S INTERNAL PROPRIETARY SOFTWARE SYSTEM AS VALUE ADDED REPORTING TO KEY CLIENTS.EXPAND DBI SERVICES WITH THE PREFERRED VENDOR PANELS OF INSURANCE COMPANIES, WHILE MAINTAINING IDENTIFIED PREFERRED VENDOR AGREEMENTS, RELATIONSHIPS, AND ASSOCIATED REPORTING REQUIREMENTS.ASSIST WITH THE CREATION AND DISTRIBUTION OF CONTENT USED TO INCREASE THE INDUSTRY AWARENESS OF DBI, SUCH AS COMPANY ANNOUNCEMENTS, SERVICE EMAILS, AND INVITATIONS FOR NETWORKING EVENTS.MAINTAIN CURRENT BRAND AND GRAPHIC COLLATERAL FOR MARKETING MATERIALS.MONITOR AND MAINTAIN DATA QUALITY WITHIN THE MARKETING DATABASE.MAINTAIN AND UPDATE CURRENT WEBSITE CONTENT.BUILD AND MANAGE THE COMPANY’S SOCIAL MEDIA PROFILES AND PRESENCE, INCLUDING LINKEDIN, AS WELL AS ADDITIONAL CHANNELS THAT MAY BE DEEMED RELEVANT.UPHOLD THE VALUES OF DBI CONSULTANTS AND THE CULTURE ESPOUSED BY OUR FOUNDATION.CONSISTENTLY DEMONSTRATES PROFESSIONALISM, INTEGRITY AND THE HIGHEST STANDARDS OF ETHICAL BEHAVIOR AND PROFESSIONAL CONDUCT; CONDUCTS ONESELF IN A MANNER THAT REFLECTS FAVORABLY ON THE ORGANIZATION.MAINTAIN THE CONFIDENTIALITY OF PROPRIETARY AND SENSITIVE INFORMATION, EXERCISING SOUND JUDGMENT AND DISCRETION IN ANY DISCLOSURE OF INFORMATION RELATED TO DBI CONSULTANTS AND ITS ENDEAVORS.COMMITS TO CONTINUOUS IMPROVEMENT AND PROFESSIONAL DEVELOPMENT FOR SELF AND TEAM MEMBERS.PERFORM ALL OTHER DUTIES AS ASSIGNED.\nREQUIRED QUALIFICATIONS & ABILITIESA BACHELOR’S DEGREE IN BUSINESS ADMINISTRATION, MARKETING OR RELATED FIELD IS PREFERRED. HIGH SCHOOL DIPLOMA, OR EQUIVALENT IN COMBINATION WITH SIGNIFICANT PRACTICAL EXPERIENCE WILL BE CONSIDERED IN LIEU OF DEGREE. MINIMUM OF HIGH SCHOOL DIPLOMA OR EQUIVALENT IS REQUIRED.EIGHT TO TEN YEARS OF BUSINESS DEVELOPMENT, CLIENT SERVICE, OR RELATED EXPERIENCE IS REQUIRED.HIGHLY MOTIVATED AND TARGET DRIVEN INDIVIDUAL.DESIRE TO BUILD NEW RELATIONSHIPS AND DRIVE ACCOUNT GROWTH WITH EXISTING CLIENTS.EXCELLENT WRITTEN AND ORAL BUSINESS COMMUNICATION SKILLS; CAPABLE OF SUCCINCTLY PRESENTING THE DBI COMPETITIVE ADVANTAGE.FLEXIBLE AND PROFESSIONAL DEMEANOR.STRONG COMPUTER SKILLS INCLUDING KNOWLEDGE OF MICROSOFT OFFICE (WORD, EXCEL, AND POWERPOINT), AND ADOBE SUITE (INDESIGN, AND ILLUSTRATOR).FAMILIAR WITH CUSTOMER RELATIONSHIP MANAGEMENT (CRM) SYSTEMS.ABILITY TO WORK UNDER OCCASIONAL SUPERVISION.ANALYTICAL WITH STRONG INTERPERSONAL SKILLS.DEMONSTRATED BUSINESS ACUMEN AND ABILITY TO IMPACT/INFLUENCE KEY DECISION MAKERS, ALONG WITH EXCELLENT CRITICAL THINKING SKILLS.USES SOUND JUDGMENT AND IS ACCOUNTABLE. CONDITIONS:WORK IS CONDUCTED PRIMARILY IN AN INDOOR OFFICE ENVIRONMENT WITH PROTECTION FROM WEATHER CONDITIONS AND WITH EXPOSURE TO NOISE TYPICAL OF AN OFFICE OR ADMINISTRATIVE SETTING. PHYSICAL ACTIVITIES AND REQUIREMENTS:WORK REQUIRES LIGHT LIFTING (10 – 20 LBS.), STANDING, WALKING, STOOPING, KNEELING, REACHING, FINGERING (KEYBOARDING) AND REPETITIVE HAND MOTION, GRASPING, TALKING, AND HEARING AT NORMAL SPEAKING LEVELS. WORK REQUIRES VISUAL ACUITY TO READ AND PREPARE DATA AND FIGURES, TRANSCRIBE WORDS AND NUMBERS, VIEW INFORMATION ON A COMPUTER TERMINAL, READ, OPERATE OFFICE MACHINES, AND DETERMINE THE ACCURACY AND THOROUGHNESS OF WORK.\nTHE SENIOR BUSINESS DEVELOPMENT ASSOCIATE WILL WORK FROM DBI’S LOS ANGELES OFFICE TO ASSIST WITH THE EXPANSION OF THE COMPANY BUSINESS AND CLIENT BASE. THE POSITION REQUIRES A DEMANDING SCHEDULE BEYOND THE CORE BUSINESS HOURS OF 9:00AM - 6:00PM TO ACCOMMODATE MEETINGS AND WORK ACTIVITIES.\nTHIS POSITION WILL REQUIRE EXTENSIVE TRAVEL TO DBI OFFICES, BUT NOT LIMITED TO THE WEST REGION, IN ADDITION TO TRAVEL FOR BUSINESS DEVELOPMENT OPPORTUNITIES THROUGHOUT THE COUNTRY.SALARY RANGE: 95K-105K",
    "job_skill_set": [
      "business development",
      "client service",
      "market knowledge",
      "data analysis",
      "Microsoft Office",
      "presentation skills",
      "communication",
      "relationship building",
      "teamwork",
      "motivation",
      "integrity",
      "flexibility",
      "analytical thinking",
      "critical thinking",
      "professionalism",
      "sound judgment",
      "Adobe Suite",
      "CRM systems",
      "social media management",
      "project management"
    ],
    "short_keywords": [
      "adobe",
      "analysis",
      "analytical",
      "associate",
      "building",
      "business",
      "businessdevelopment",
      "client",
      "communication",
      "critical",
      "crm",
      "data",
      "development",
      "flexibility",
      "integrity",
      "judgment",
      "knowledge",
      "management",
      "market",
      "media",
      "microsoft",
      "motivation",
      "office",
      "presentation",
      "professionalism",
      "project",
      "relationship",
      "senior",
      "service",
      "skills",
      "social",
      "sound",
      "suite",
      "systems",
      "teamwork",
      "thinking"
    ]
  },
  {
    "job_id": "3901972059",
    "job_title": "Vice President of Business Development",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "SHINE SYSTEMS IS A HUBZONE SMALL BUSINESS FEDERAL CONTRACTOR, FOUNDED IN 2007 AND HEADQUARTERED IN CHARLOTTESVILLE, VA.THE VP OF BUSINESS DEVELOPMENT IS A MEMBER OF THE SHINE SYSTEMS LEADERSHIP TEAM AND WILL IDENTIFY FEDERAL AGENCY OPPORTUNITIES AND WIN NEW CONTRACTS (BOTH PRIME AND SUBCONTRACT) RELATED TO SHINE SYSTEMS' CORE COMPETENCIES AND FOUR LINES OF BUSINESS:DECISION AND MILITARY INTELLIGENCE ANALYTICSTECHNOLOGY INTEGRATION AND SOFTWARE/SYSTEMS ENGINEERINGMISSION SUPPORTCYBERSECURITYTHIS ROLE DEVELOPS AND EXECUTES STRATEGIES THAT EXPAND OUR GROWTH INTO EXISTING AGENCIES’ CONTRACT WORK AND INTO NEW FEDERAL MARKETS AND AGENCIES.DESIRED PERSONAL CHARACTERISTICS:SEASONED PROFESSIONAL WITH CREDIBILITY IN THE FEDERAL MARKETPLACEABLE TO ENGAGE OWN NETWORK OF AGENCIES’ AND PARTNER COMPANIES’ STAKEHOLDERS IMMEDIATELYPROACTIVE; ACTIVELY SEEKS OPPORTUNITIES WITH MINIMAL DIRECTIONSTRONG COMMUNICATOR, BOTH WRITTEN AND VERBAL; ABLE TO CONNECT, BUILD, AND MAINTAIN KEY RELATIONSHIPSORGANIZED AND DETAIL-ORIENTED; ABLE TO EFFECTIVELY MANAGE MULTIPLE OPPORTUNITIES AND TEAMSREQUIRED QUALIFICATIONS:BACHELOR’S DEGREE REQUIRED / MASTER’S DEGREE A PLUS10+ YEARS PRIOR MANAGEMENT, FUNCTIONAL OR BUSINESS DEVELOPMENT EXPERIENCE INSIDE FEDERAL AGENCIESMUST SHOW AT LEAST $10M OF CLOSED NEW BUSINESS WITHIN THE PRIOR 18 MONTHS (EXCLUDES IDIQ AWARDS)7+ YEARS EXPERIENCE IN BUSINESS DEVELOPMENT, CAPTURE, PROCUREMENT, AND CONTRACTING WITH FEDERAL AGENCIESEXPERIENCE ESTABLISHING AND ACTIVELY MAINTAINING RELATIONSHIPS WITH PRIME CONTRACTORS AND SUBCONTRACTORSEXPERIENCE ACTIVELY PARTICIPATING IN, AND SUPPORTING, PROPOSAL EFFORTSPREFERRED QUALIFICATIONS:AN ACTIVE TS/SCI SECURITY CLEARANCECLOSED NEW BUSINESS WITH FEDERAL CIVILIAN AGENCIES WITHIN THE PRIOR 2 YEARS6+ YEARS MILITARY EXPERIENCEMUST SHOW CURRENT OR FORMER EMPLOYERS’ UNRESTRICTED ACCESS TO ALL FEDERAL AGENCIES",
    "job_skill_set": [
      "business development",
      "relationship management",
      "procurement",
      "communication",
      "networking",
      "proactivity",
      "organization",
      "detail-oriented",
      "leadership",
      "team management",
      "federal contracting",
      "proposal writing",
      "cybersecurity",
      "software engineering",
      "systems engineering",
      "military intelligence analytics",
      "contracting",
      "TS/SCI security clearance"
    ],
    "short_keywords": [
      "analytics",
      "business",
      "businessdevelopment",
      "clearance",
      "communication",
      "contracting",
      "cybersecurity",
      "detailoriented",
      "development",
      "engineering",
      "federal",
      "intelligence",
      "leadership",
      "management",
      "military",
      "networking",
      "of",
      "organization",
      "president",
      "proactivity",
      "procurement",
      "proposal",
      "relationship",
      "security",
      "software",
      "systems",
      "team",
      "tssci",
      "vice",
      "writing"
    ]
  },
  {
    "job_id": "3894212255",
    "job_title": "Remote Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "READY TO DIVE INTO THE SALES REALM?\nJOIN OUR VIBRANT TEAM AS A REMOTE BUSINESS DEVELOPMENT REPRESENTATIVE ON A 1099 CONTRACT BASIS. THIS EXCITING OPPORTUNITY IS OPEN TO BOTH SEASONED SALES PROFESSIONALS AND THOSE ENTERING THE FIELD. SHAPE YOUR SALES CAREER WHILE ENJOYING THE FLEXIBILITY OF REMOTE WORK. PREPARE TO MAXIMIZE YOUR POTENTIAL EARNINGS WITH OUR UNWAVERING SUPPORT, CRAFTING A CAREER THAT'S NOT ONLY FULFILLING BUT ALSO REWARDING.\nRESPONSIBILITIES FOR THE REMOTE BUSINESS DEVELOPMENT REPRESENTATIVE ROLE:\n● DEVELOP AND MAINTAIN CLIENT RELATIONSHIPS THROUGH EFFECTIVE COMMUNICATION.● DELIVER IMPACTFUL AND INSIGHTFUL PRODUCT PRESENTATIONS.● CONDUCT VIRTUAL DEMONSTRATIONS, HIGHLIGHTING CRUCIAL FEATURES AND BENEFITS.● WORK TOWARDS INDIVIDUAL AND TEAM SALES OBJECTIVES.● ARTICULATE VALUE PROPOSITIONS TO POTENTIAL CUSTOMERS PERSUASIVELY.● ENGAGE WITH WARM LEADS, SKILLFULLY GUIDING THEM THROUGH THE SALES FUNNEL.● KEEP ACCURATE AND UP-TO-DATE RECORDS OF ALL SALES ACTIVITIES.\nWHAT'S WAITING FOR YOU AS A REMOTE BUSINESS DEVELOPMENT REPRESENTATIVE AT OUR ORGANIZATION?\n● WORK FROM THE CONVENIENCE OF YOUR HOME, ELIMINATING COMMUTE STRESSES AND CREATING A WORKSPACE TAILORED TO YOUR LIKING.● BENEFIT FROM AN UNCAPPED COMMISSION SYSTEM, DIRECTLY INFLUENCING YOUR EARNINGS BASED ON YOUR PERFORMANCE IN THIS 1099 POSITION.● NO PRIOR SALES EXPERIENCE IS REQUIRED; RECEIVE COMPREHENSIVE TRAINING ON OUR PRODUCTS/SERVICES, SALES TECHNIQUES, AND VIRTUAL COMMUNICATION TOOLS TO ENSURE SUCCESS IN YOUR ROLE.● BID FAREWELL TO COLD CALLING; GAIN ACCESS TO PREMIUM LEADS, ALLOWING YOU TO FOCUS ON CLOSING DEALS AND REALIZING YOUR FULL POTENTIAL.",
    "job_skill_set": [
      "sales techniques",
      "CRM software",
      "communication",
      "relationship building",
      "persuasion",
      "teamwork",
      "time management",
      "product presentations",
      "virtual communication tools",
      "record keeping"
    ],
    "short_keywords": [
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "crm",
      "development",
      "keeping",
      "management",
      "persuasion",
      "presentations",
      "product",
      "record",
      "relationship",
      "remote",
      "representative",
      "sales",
      "software",
      "teamwork",
      "techniques",
      "time",
      "tools",
      "virtual"
    ]
  },
  {
    "job_id": "3886884580",
    "job_title": "Business Development Specialist",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "JOB DESCRIPTION:• IDENTIFY AND BUILD RELATIONSHIPS WITH LOCAL KOLS/INFLUENCERS, COMMUNITIES, PROJECTS, AND OTHER POTENTIAL PARTNERS TO PROMOTE KCEX IN THE NORTH AMERICA MARKET IN ORDER TO ACHIEVE USER GROWTH.• AS A REPRESENTATIVE OF KCEX, TO MAINTAIN A GOOD RELATIONSHIP WITH KOLS AND MARKETING CHANNELS TO ACHIEVE LONG-TERM COOPERATION• BE RESPONSIBLE FOR THE EXECUTION AND PERFORMANCE OF KOL MARKETING STRATEGY, TRACK AND ANALYZE CHANNEL COOPERATION RESULTS, AND MAKE ADJUSTMENTS TO ENSURE OPTIMAL PERFORMANCE AND MAXIMUM ROI• KEEP ABREAST OF LOCAL INDUSTRY DEVELOPMENTS TRENDS AND COMPETITOR MOVEMENTS AND STRATEGIZE CORRESPONDING ACTIONS\nJOB REQUIREMENTS:• LOCATE IN NORTH AMERICA • UNDERSTANDING OF THE CRYPTO MARKET (NORTH AMERICA MARKET)• SPEAK ENGLISH NATIVELY. ADDITIONAL EUROPEAN LANGUAGES ARE PREFERRED. PROFICIENCY IN MANDARIN CHINESE IS A PLUS.• CURRENTLY ENROLLED IN OR GRADUATED FROM UNIVERSITIES IN THE UNITED STATES IS A PLUS",
    "job_skill_set": [
      "Market Analysis",
      "English Language Proficiency",
      "Relationship Building",
      "Communication",
      "Networking",
      "Adaptability",
      "Strategic Thinking",
      "Collaboration",
      "Problem Solving",
      "KOL Marketing Strategy",
      "User Growth Strategies",
      "Crypto Market Understanding",
      "Data Tracking and Analysis",
      "Mandarin Chinese Proficiency"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "and",
      "building",
      "business",
      "businessdevelopment",
      "chinese",
      "collaboration",
      "communication",
      "crypto",
      "data",
      "development",
      "english",
      "growth",
      "kol",
      "language",
      "mandarin",
      "market",
      "marketing",
      "networking",
      "problem",
      "proficiency",
      "relationship",
      "solving",
      "specialist",
      "strategic",
      "strategies",
      "strategy",
      "thinking",
      "tracking",
      "understanding",
      "user"
    ]
  },
  {
    "job_id": "3884444347",
    "job_title": "Business Development (Sales) Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ABOUT THIS OPPORTUNITY\n\nTHE BUSINESS DEVELOPMENT MANAGER MAINTAINS EXISTING CLIENT RELATIONSHIPS/ACCOUNTS AND PROSPECTS FOR NEW POTENTIAL CLIENTS FOR THE ASSIGNED TERRITORY TO ACHIEVE MARKET POSITION IN-LINE WITH THE NITTO AVECIA SALES BUDGET AND FINANCIAL GROWTH OBJECTIVES. AUTONOMOUSLY NEGOTIATE AND CLOSE BUSINESS DEALS. WORK WITH MARKET INTELLIGENCE TO MAINTAIN UP-TO-DATE KNOWLEDGE OF THE CURRENT MARKET CONDITIONS OF THE ASSIGNED TERRITORY. WORK WITH INTERNAL STAKEHOLDERS TO MANAGE CLIENT/PROSPECT REQUESTS AND IDENTIFY OPPORTUNITIES FOR IMPROVEMENT ACROSS THE ORGANIZATION TO INCREASE CLIENT SATISFACTION.\n\nKEY JOB RESPONSIBILITIES\n\n GROW AND RETAIN EXISTING CLIENT ACCOUNTS AND CONTINUOUSLY IMPROVE THE RELATIONSHIP PROSPECT FOR NEW POTENTIAL CLIENTS AND CONVERT THEM INTO ACCOUNTS WORK WITH THE INTERNAL STAKEHOLDERS TO DEVELOP AND DELIVER PROPOSALS THAT MEET CLIENT’S NEEDS, ADDRESS CONCERNS AND ACHIEVE OBJECTIVES UNDERSTAND NITTO AVECIA FINANCIAL GOALS AND PRICING MODELS TO PREPARE CLIENT PROPOSAL PRICING MAINTAIN CONSTANT TERRITORY DEMAND AND SALES DATA IN CRM AND OTHER DESIGNATED DATABASES UTILIZE MARKET AND COMPETITOR KNOWLEDGE TO IDENTIFY OPPORTUNITIES FOR NITTO AVECIA UNIQUE SELLING PROPOSITIONS AND KEY DIFFERENTIATORS PURSUE FACE-TO-FACE APPOINTMENTS WITH EXISTING AND PROSPECTIVE CLIENTS ON A REGULAR BASIS AND PRESENT INFORMATION AS NEEDED PARTICIPATE IN RELEVANT TRADE SHOWS, SYMPOSIA, CONFERENCES AND TRAININGS\n\n\nJOB KNOWLEDGE REQUIRED\n\n BACHELOR’S DEGREE IN CHEMISTRY, BIOLOGY, ENGINEERING OR OTHER RELATED FIELD MINIMUM 3 YEARS OF INDUSTRY EXPERIENCE OR RELEVANT BUSINESS DEVELOPMENT/SALES OR PROJECT MANAGEMENT EXPERIENCE EXPERIENCE WITH, AND DEMONSTRATED KNOWLEDGE OF CGMP API MANUFACTURING REQUIRED MUST POSSESS EXCELLENT PRESENTATION, WRITTEN AND VERBAL COMMUNICATION SKILLS ABLE TO TRAVEL WITHIN THE ASSIGNED TERRITORY AS REQUIRED MUST BE OUTGOING, ENERGETIC, SELF-MOTIVATING AND ABLE TO NETWORK WITH BUSINESS AND SCIENTIFIC STAFF OF CLIENTS/PROSPECTS.\n\n\nTHE STARTING SALARY FOR THIS POSITION IS BETWEEN $100,000 - $120,000 ANNUALLY.",
    "job_skill_set": [
      "CRM",
      "Communication",
      "Negotiation",
      "Networking",
      "Client Relationship Management",
      "Self-Motivation",
      "Presentation Skills",
      "Team Collaboration",
      "Market Intelligence",
      "Sales Data Analysis",
      "Proposal Development",
      "CGMP API Manufacturing",
      "Bachelor’s Degree in Chemistry/Biology/Engineering"
    ],
    "short_keywords": [
      "analysis",
      "api",
      "bachelors",
      "business",
      "businessdevelopment",
      "cgmp",
      "chemistrybiologyengineering",
      "client",
      "collaboration",
      "communication",
      "crm",
      "data",
      "degree",
      "development",
      "in",
      "intelligence",
      "management",
      "manager",
      "manufacturing",
      "market",
      "negotiation",
      "networking",
      "presentation",
      "proposal",
      "relationship",
      "sales",
      "selfmotivation",
      "skills",
      "team"
    ]
  },
  {
    "job_id": "3887496959",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "VISION HR INC. IS LOOKING FOR A TALENTED BUSINESS DEVELOPMENT MANAGER. THE SUCCESSFUL CANDIDATE WILL POSSESS THE MOST COMPLETE SET OF SKILLS/EXPERIENCE OF THE FOLLOWING:\n· PAYROLL/HR OUTSOURCING SALES· PROPERTY/CASUALTY LICENSE (220)· LIFE/HEALTH LICENSE (215)\nTHE IDEAL CANDIDATE WILL HAVE PAST SELLING EXPERIENCE IN THE PEO OR PAYROLL INDUSTRIES OR SUBSTANTIAL COMMERCIAL INSURANCE EXPERIENCE. KNOWLEDGE OF HUMAN RESOURCES, PAYROLL, WORKERS COMPENSATION AND HEALTH BENEFITS ARE A PLUS, BEING ABLE TO CONSULT AND BE AN EXPERT IN THOSE FIELDS IS CRITICAL TO LONG TERM SUCCESS. THIS IS A GREAT OPPORTUNITY FOR THE PERSON WHO HAS A SEASONED SALES MIND AND WANTS TO CONTROL THEIR OWN DESTINY IN THE SALES PROCESS. GREAT BASE SALARY, PLUS RESIDUAL COMMISSIONS, TRAVEL/CELL PHONE ALLOWANCE, PTO AND FULL BENEFITS PACKAGE WITH 401K.\nAS BUSINESS DEVELOPMENT MANAGER, YOU WILL BE RESPONSIBLE FOR:PROSPECTING AND CLOSING NEW CLIENTS.ACTIVE IN COMMUNITY ORGANIZATIONS AND NETWORKING EVENTS.MAKING SALES PRESENTATIONS.MAINTAINING YOUR CLIENT ACCOUNTS.ASSISTING IN THE ENROLLMENT OF NEW CLIENTS.PROPOSING LIFE, HEALTH, PROPERTY AND CASUALTY COMMERCIAL INSURANCE PRODUCTS.\nTHE SERVICES YOU WILL BE MARKETING ARE:PAYROLL OUTSOURCINGTIMEKEEPING SOLUTIONSHUMAN RESOURCE COMPLIANCE AND SUPPORTWORKERS COMP INSURANCECUSTOM GROUP BENEFITS PLANSCOMMERCIAL INSURANCE PACKAGES ( GL, PROP., UMBRELLA, AUTO, EPLI ETC.)401K\nCOLLEGE DEGREE PREFERRED. AT LEAST 5 YEARS’ EXPERIENCE IN BUSINESS TO BUSINESS SALES PREFERRED IN PAYROLL OUTSOURCING / PEO / HRO / ASO / COMMERCIAL INSURANCE SALES. 220 PROPERTY AND CASUALTY INSURANCE LICENSE PREFERRED. (HAVING A 215 LIFE AND HEALTH INSURANCE LICENSE IS A PLUS.)COMPENSATION IS BASE PLUS COMMISSION, EARNINGS UP TO $100,000 PER YEAR.\nPOSITION IS BASED OUT OF OUR CORPORATE LOCATION IN DAYTONA BEACH FL.\nJOB TYPE: FULL-TIME\nPAY: UP TO $100,000.00 PER YEAR\nBENEFITS:401(K)401(K) MATCHINGDENTAL INSURANCEEMPLOYEE ASSISTANCE PROGRAMHEALTH INSURANCEHEALTH SAVINGS ACCOUNTLIFE INSURANCEPAID TIME OFFRETIREMENT PLANSHORT TERM DISABILITYLONG TERM DISABILITYVISION INSURANCECAR ALLOWANCE\nSCHEDULE:8 HOUR SHIFTMONDAY TO FRIDAY\nSUPPLEMENTAL PAY TYPES:BASE + COMMISSION PAY (CAPLESS) \nEXPERIENCE:B2B SALES: 5 YEARS (REQUIRED)PAYROLL AND OUTSOURCING: 3 YEARS (REQUIRED)\nLICENSE/CERTIFICATION:LIFE & HEALTH INSURANCE LICENSE (PREFERRED)PROPERTY & CASUALTY LICENSE (PREFERRED)\nABILITY TO RELOCATE:DAYTONA BEACH, FL: RELOCATE BEFORE STARTING WORK (REQUIRED)\nWORK LOCATION: IN PERSON",
    "job_skill_set": [
      "B2B Sales",
      "Client Account Management",
      "Networking",
      "Communication",
      "Problem Solving",
      "Sales Mindset",
      "Time Management",
      "Team Collaboration",
      "Payroll Outsourcing Sales",
      "Property/Casualty License (220)",
      "Life/Health License (215)",
      "Commercial Insurance Sales",
      "Human Resources Knowledge",
      "Workers Compensation Knowledge",
      "Health Benefits Knowledge",
      "Sales Presentations",
      "Consulting Skills",
      "401K Knowledge",
      "Community Engagement"
    ],
    "short_keywords": [
      "215",
      "220",
      "401k",
      "account",
      "b2b",
      "benefits",
      "business",
      "businessdevelopment",
      "client",
      "collaboration",
      "commercial",
      "communication",
      "community",
      "compensation",
      "consulting",
      "development",
      "engagement",
      "health",
      "human",
      "insurance",
      "knowledge",
      "license",
      "lifehealth",
      "management",
      "manager",
      "mindset",
      "networking",
      "outsourcing",
      "payroll",
      "presentations",
      "problem",
      "propertycasualty",
      "resources",
      "sales",
      "skills",
      "solving",
      "team",
      "time",
      "workers"
    ]
  },
  {
    "job_id": "3905825078",
    "job_title": "Business Development Officer NY/NJ",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "MAKING TRADE HAPPEN\nCOFACE IS A TEAM OF 4,500 PEOPLE OF 78 NATIONALITIES ACROSS NEARLY 60 COUNTRIES, ALL SHARING A CORPORATE CULTURE ACROSS THE WORLD. TOGETHER, WE WORK TOWARDS ONE OBJECTIVE: FACILITATING TRADE BY HELPING OUR 50,000 CORPORATE CLIENTS DEVELOP THEIR BUSINESSES.WITH 75 YEARS OF EXPERIENCE, COFACE IS A LEADER IN THE CREDIT INSURANCE AND RISK MANAGEMENT MARKET. WE HAVE ALSO DEVELOPED A RANGE OF OTHER VALUE-ADDED SERVICES, INCLUDING FACTORING, DEBT COLLECTION, SINGLE RISK INSURANCE, BONDING, AND INFORMATION SERVICES.AS A CLOSE-KNIT, INTERNATIONAL ORGANIZATION AT THE CORE OF THE GLOBAL ECONOMY, COFACE OFFERS AN ENRICHING WORK EXPERIENCE ON SEVERAL LEVELS: RELATIONAL, PROFESSIONAL, AND CULTURAL.EVERY DAY, OUR TEAMS ARE MAKING TRADE HAPPEN. JOIN US!\n\nWE ARE SEEKING A HIGHLY MOTIVATED, CORPORATE BUSINESS DEVELOPMENT OFFICER TO HUNT FOR AND CLOSE NEW BUSINESS, AS WELL AS RETAIN AND GROW KEY CLIENTS. THIS IS AN EXCITING TIME TO JOIN OUR ORGANIZATION DUE TO A NEW LONG-TERM GROWTH STRATEGY WITHIN THE NORTH AMERICAN REGION. YOU WILL BE EXPECTED TO PERFORM THE FOLLOWING:\n• ACHIEVES ANNUAL REVENUE OBJECTIVES THROUGH CONSULTATIVE SALES TO NEW CLIENTS AND RENEWAL OF EXISTING POLICIES.• BUILDS A PORTFOLIO OF BUSINESS THAT WILL ALIGN WITH COFACE STRATEGIC GROWTH AND RETENTION GOALS• BUILDS AN ACTIVE PIPELINE OF QUALIFIED PROSPECTS, GENERATING LEADS FROM BANKS AND INSURANCE AGENCIES, AND FROM DIRECT COLD CALLING TO BUSINESS OWNERS AND CFO'S.• MARKETS AND SELLS A SPECIALIZED FINANCIAL PRODUCT (DOMESTIC AND EXPORT CREDIT INSURANCE AND OTHER CREDIT RELATED SERVICES) TO CORPORATIONS WITHIN ASSIGNED REGIONS.• SERVICES NEW AND EXISTING CLIENTS BY MONITORING THEIR PROGRAMS AND COVERAGE.• RESEARCH AND RECOMMEND PROSPECTS FOR NEW BUSINESS OPPORTUNITIES AS WELL AS RESEARCHING AND ANALYZING SALES OPTIONS.• ATTENDS WORKSHOPS TO LEARN MORE TECHNICAL AND PROFESSIONAL SKILLS FOR THE JOB.• STAYS CURRENT WITH TRENDS AND COMPETITORS TO IDENTIFY IMPROVEMENTS OR RECOMMEND NEW PRODUCTS.THE IDEAL CANDIDATE MUST POSSESS THE FOLLOWING:• BACHELOR’S DEGREE REQUIRED.• MINIMUM 3 YEARS’ PROVEN EXPERIENCE SELLING B2B; FINANCIAL, BANKING OR INSURANCE SOLUTIONS A PLUS.• PROVEN TRACK RECORD IN CLIENT ACQUISITION, AS WELL AS RETENTION.• STRONG COMMUNICATION SKILL, BOTH WRITTEN AND VERBAL.• ROBUST NETWORK IN DESIGNATED TERRITORY.• ABILITY TO TAKE INITIATIVE AND BE SELF-MOTIVATED, AS WELL AS WORK COLLABORATIVELY IN A TEAM ENVIRONMENT WHEN NEEDED.\nOUR COMPENSATION REFLECTS THE COST OF LABOR ACROSS MULTIPLE US GEOGRAPHIC MARKETS. THE BASE PAY FOR THIS POSITION RANGES FROM $80,000.00 IN OUR LOWEST GEOGRAPHIC MARKET UP TO $120,000.00 IN OUR HIGHEST MARKET. BASE PAY IS BASED ON MULTIPLE FACTORS INCLUDING MARKET LOCATION AND MAY VARY DEPENDING ON JOB RELATED KNOWLEDGE, SKILL SET, AND EXPERIENCE. WE ALSO OFFER A COMPREHENSIVE BENEFITS PACKAGE WHICH INCLUDES HEALTH CARE, 401(K) SAVINGS PLANS, PAID TIME OFF, AND MORE. THIS INFORMATION IS PROVIDED PER THE NEW YORK CITY HUMAN RIGHTS LAW. APPLICANTS SHOULD APPLY VIA COFACE’S INTERNAL OR EXTERNAL CAREERS SITE.",
    "job_skill_set": [
      "B2B Sales",
      "Client Acquisition",
      "Consultative Sales",
      "Lead Generation",
      "Market Research",
      "Networking",
      "Cold Calling",
      "Communication",
      "Self-Motivation",
      "Team Collaboration",
      "Initiative",
      "Problem Solving",
      "Adaptability",
      "Financial Solutions",
      "Insurance Solutions",
      "Sales Analysis"
    ],
    "short_keywords": [
      "acquisition",
      "adaptability",
      "analysis",
      "b2b",
      "business",
      "businessdevelopment",
      "calling",
      "client",
      "cold",
      "collaboration",
      "communication",
      "consultative",
      "development",
      "financial",
      "generation",
      "initiative",
      "insurance",
      "lead",
      "market",
      "networking",
      "nynj",
      "officer",
      "problem",
      "research",
      "sales",
      "selfmotivation",
      "solutions",
      "solving",
      "team"
    ]
  },
  {
    "job_id": "3905304339",
    "job_title": "Business Development Executive",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "COMPANY DESCRIPTIONNEW SOLUTION HEALTHCARE™ IS SEEKING A BUSINESS DEVELOPMENT EXECUTIVE TO JOIN OUR TEAM IN THE HEALTHCARE INDUSTRY. AS A NON-PROFIT ORGANIZATION, WE ELIMINATE THE NEED FOR STATE LICENSING, MAKING IT EASIER FOR YOU TO ENTER THIS DYNAMIC FIELD. OUR TAILORED HEALTH CARE SOLUTIONS ARE DESIGNED TO MEET DIVERSE NEEDS AND PROVIDE COST-EFFECTIVE OPTIONS FOR CLIENTS. WITH A FOCUS ON SMALL BUSINESSES, WE AIM TO ASSIST THEM IN PROVIDING HEALTHCARE TO EMPLOYEES, CREATING OPPORTUNITIES FOR MULTIPLE SIGN-UPS AND INCREASED EARNINGS.\nROLE DESCRIPTIONTHIS IS A FULL-TIME REMOTE ROLE FOR A BUSINESS DEVELOPMENT EXECUTIVE. THE BUSINESS DEVELOPMENT EXECUTIVE WILL BE RESPONSIBLE FOR NEW BUSINESS DEVELOPMENT, LEAD GENERATION, ACCOUNT MANAGEMENT, AND BUSINESS COMMUNICATION. THE ROLE INVOLVES BUILDING RELATIONSHIPS, DRIVING SALES GROWTH, AND PROMOTING OUR HEALTHCARE SOLUTIONS. THIS POSITION OFFERS FLEXIBLE OPPORTUNITIES, ALLOWING FOR EITHER FULL-TIME COMMITMENT OR PART-TIME FLEXIBILITY.\nQUALIFICATIONSNEW BUSINESS DEVELOPMENT AND LEAD GENERATION SKILLSSTRONG BUSINESS ACUMEN AND COMMUNICATION SKILLSACCOUNT MANAGEMENT EXPERIENCEABILITY TO BUILD AND MAINTAIN RELATIONSHIPSEXPERIENCE IN THE HEALTHCARE INDUSTRY IS A PLUSBACHELOR'S DEGREE IN BUSINESS, SALES, OR RELATED FIELD",
    "job_skill_set": [
      "new business development",
      "lead generation",
      "account management",
      "bachelor's degree in business or related field",
      "business acumen",
      "communication",
      "relationship building",
      "sales growth",
      "healthcare industry experience"
    ],
    "short_keywords": [
      "account",
      "acumen",
      "bachelors",
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "degree",
      "development",
      "executive",
      "experience",
      "field",
      "generation",
      "growth",
      "healthcare",
      "in",
      "industry",
      "lead",
      "management",
      "new",
      "or",
      "related",
      "relationship",
      "sales"
    ]
  },
  {
    "job_id": "3887711725",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "THIS IS AN EXCELLENT OPPORTUNITY FOR A DRIVEN INDIVIDUAL WHO IS LOOKING TO GENERATE AND ENGAGE WITH BUSINESSES TO FOSTER NEW BUSINESS FOR THE COMPANY. WITH A BASE PLUS COMMISSION STRUCTURE, PAID TRAINING, AMAZING BENEFITS, A GENEROUS BONUS STRUCTURE, AND A FLEXIBLE FULL-TIME SCHEDULE, YOUR POTENTIAL IS VIRTUALLY UNLIMITED. POSITION HIGHLIGHTS:STANDARD M-F, 8-5 SCHEDULE.INDUSTRY-LEADING TRAINING PROGRAMS THAT GIVE YOU THE KEYS TO SUCCESS! A MIX OF HANDS-ON TRAINING AND AN ONLINE TRAINING MODEL. AN OPPORTUNITY TO BE AN AUTONOMOUS SALES LEADER THAT CAPTURES NEW MARKET SHARE AND CREATES OPPORTUNITIES IN YOUR TERRITORY.A HIGHLY COMPETITIVE TOTAL REWARDS PACKAGE COMPRISES MONETARY AND NON-MONETARY REWARDS THAT ENRICH YOUR LIFE BY PROVIDING SOLUTIONS FOR YOUR HEALTH, WEALTH, WORK AND HOME AND SO MUCH MORE!JOB RESPONSIBILITIES:LEAD AND DRIVE BRANCH SALES EFFORTS TO DEVELOP A DIVERSE BOOK OF BUSINESS THAT PROMOTES PROFITABLE AND SUSTAINABLE GROWTH IN YOUR TERRITORY.DEVELOP, QUANTIFY, AND IMPLEMENT SUCCESSFUL STRATEGIES TO GENERATE NEW BUSINESS THROUGH OUTSIDE AND INSIDE SALES EFFORTS. BUILD AND MAINTAIN STRONG RELATIONSHIPS WITH NEW CLIENTS, UNDERSTANDING THEIR STAFFING NEEDS, AND ADHERING TO AGREED GUIDELINES AND EXPECTATIONS. WORK EFFICIENTLY AND EFFECTIVELY IN A COLLABORATIVE ENVIRONMENT WITH THE OPERATIONS TEAM TO MAINTAIN A STRONG CULTURE AND FOSTER BRANCH SUCCESS. PROACTIVELY GENERATING YOUR OWN LEADS WORKING THROUGH THE FULL SALES CYCLE. THE IDEAL CANDIDATE MIGHT HAVE:2 YEARS OF EXPERIENCE IN AN OUTSIDE SALES ROLE, PREFERABLY FROM THE STAFFING OR SERVICE INDUSTRYEXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS: ABILITY TO EFFECTIVELY COMMUNICATE WITH CANDIDATES AND CLIENTS AT ALL LEVELS. (IN-PERSON AND OVER THE PHONE)STRONG UNDERSTANDING OF THE LIGHT INDUSTRIAL SECTOR, INCLUDING MANUFACTURING, WAREHOUSING, AND LOGISTICS. EXCEPTIONAL INTERPERSONAL SKILLS: THE ABILITY TO BUILD, MAINTAIN, AND GROW STRONG CLIENT RELATIONSHIPS.WILLINGNESS TO ADAPT TO CHANGING MARKET CONDITIONS AND CLIENT NEEDS. WHY JOIN US?\nAT ŌNIN STAFFING, WE'RE DEDICATED TO FOSTERING OPPORTUNITY AND EMPOWERMENT! WE'VE RECENTLY LAUNCHED OUR EMPLOYEE STOCK OWNERSHIP PROGRAM (ESOP), TRANSFORMING OUR TEAM MEMBERS INTO PROUD ŌWNERS. OUR COMMITMENT GOES BEYOND BEING ŌNINITES; WE'RE NOW ŌWNERS WHO SHARE IN THE SUCCESS OF OUR COMPANY. WE OFFER A COMPETITIVE AND COMPREHENSIVE TOTAL REWARDS PACKAGE, ALONG WITH AMPLE OPPORTUNITIES FOR PROFESSIONAL DEVELOPMENT AND CAREER ADVANCEMENT. ADDITIONALLY, WE TAKE PRIDE IN NURTURING A DIVERSE AND INCLUSIVE WORK ENVIRONMENT WHERE EVERYONE'S CONTRIBUTIONS ARE VALUED AND RESPECTED.\nDISCOVER MORE ABOUT BECOMING A VALUED MEMBER OF OUR ŌNINITE COMMUNITY: LEARN MORE\nIF THIS RESONATES WITH YOU, TAKE THE FIRST STEP AND APPLY NOW TO SCHEDULE AN INTERVIEW. WE EAGERLY AWAIT THE OPPORTUNITY TO CONNECT WITH YOU AND EXPLORE THE POTENTIAL YOU BRING TO OUR TEAM!",
    "job_skill_set": [
      "business development",
      "client relationship management",
      "strategic planning",
      "staffing industry knowledge",
      "communication",
      "interpersonal skills",
      "collaboration",
      "adaptability",
      "problem solving",
      "autonomy",
      "time management",
      "sales",
      "market analysis",
      "light industrial sector knowledge",
      "lead generation"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "autonomy",
      "business",
      "businessdevelopment",
      "client",
      "collaboration",
      "communication",
      "development",
      "generation",
      "industrial",
      "industry",
      "interpersonal",
      "knowledge",
      "lead",
      "light",
      "management",
      "manager",
      "market",
      "planning",
      "problem",
      "relationship",
      "sales",
      "sector",
      "skills",
      "solving",
      "staffing",
      "strategic",
      "time"
    ]
  },
  {
    "job_id": "3891254356",
    "job_title": "Business Development Manager ($75k-$120k+)",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "COMPANY OVERVIEW: AT RESTOPROS, WE SPECIALIZE IN PROVIDING TOP-TIER WATER MITIGATION, MOLD REMEDIATION, AND FIRE/SMOKE RESTORATION SERVICES. WHETHER IT'S DEALING WITH FLOODING FROM A BUSTED PIPE OR RESTORING AN OFFICE SPACE AFTER FIRE DAMAGE, RESTOPROS IS DEDICATED TO GETTING OUR CUSTOMERS' HOMES OR BUSINESSES BACK TO PRE-LOSS CONDITIONS PROMPTLY. OUR COMMITMENT TO EXCELLENCE, EXCEPTIONAL CUSTOMER SERVICE, AND A SKILLED TEAM OF PROFESSIONALS SETS US APART IN THE INDUSTRY. JOIN OUR RAPIDLY EXPANDING COMPANY WITH A GREAT CULTURE AND TEAM ATMOSPHERE AS WE CONTINUE TO GROW AND MAKE A DIFFERENCE IN OUR CUSTOMERS' LIVES.\nPOSITION OVERVIEW: WE ARE SEEKING A HIGHLY MOTIVATED AND ENERGETIC BUSINESS DEVELOPMENT MANAGER TO JOIN OUR TEAM. IN THIS ROLE, YOU WILL BE RESPONSIBLE FOR GENERATING OPPORTUNITIES, ACQUIRING NEW CLIENTS, AND FOSTERING RELATIONSHIPS WITHIN YOUR DESIGNATED TERRITORY. YOU WILL PLAY A CRUCIAL ROLE IN DRIVING BUSINESS GROWTH, MEETING REVENUE TARGETS, AND EXPANDING OUR CUSTOMER BASE. THE IDEAL CANDIDATE IS OUTGOING, CUSTOMER-FOCUSED, POSSESSES STRONG INTERPERSONAL SKILLS, UNDERSTANDS TRADE WORK, AND IS DRIVEN TO ACHIEVE PERSONAL AND PROFESSIONAL GOALS. THIS POSITION WILL REQUIRE TRAVEL THROUGHOUT OAKLAND AND MACOMB COUNTIES DURING THE WEEK. \nRESPONSIBILITIES:IDENTIFY KEY CONTACTS AND BUILD AND MAINTAIN RELATIONSHIPS WITH EXISTING AND POTENTIAL CUSTOMERS TO DRIVE BUSINESS GROWTH.CONDUCT APPOINTMENTS AND MEETINGS WITH POTENTIAL AND EXISTING CUSTOMERS WITHIN THE TERRITORY.UTILIZE OUR CLIENT RELATIONSHIP MANAGEMENT (CRM) PROGRAM TO TRACK CLIENT PROGRESS AND MANAGE RELATIONSHIPS EFFECTIVELY.PROVIDE EXCELLENT CUSTOMER SERVICE TO UPHOLD THE POSITIVE REPUTATION OF THE BUSINESS.RESOLVE CUSTOMER COMPLAINTS PROMPTLY AND PROFESSIONALLY TO ENSURE CUSTOMER SATISFACTION.MEET OR EXCEED DESIGNATED DEVELOPMENT TARGETS. ASSIST IN RECRUITING ADDITIONAL TALENT TO SUPPORT BUSINESS EXPANSION.SET REVENUE TARGETS AND DEVELOP STRATEGIES TO ACHIEVE THEM EFFECTIVELY.\nQUALIFICATIONS:A PROACTIVE INDIVIDUAL WITH A STRONG WORK ETHIC AND A WILLINGNESS TO TACKLE CHALLENGES.3+ YEARS EXPERIENCE IN BUSINESS DEVELOPMENT OR SALES WITH A PROVEN TRACK RECORD OF SUCCESS.EXCELLENT NEGOTIATION AND CUSTOMER SERVICE SKILLS.STRONG WRITTEN AND VERBAL COMMUNICATION SKILLS.PROFICIENCY IN TECHNOLOGY AND COMPUTER LITERACY.HIGH SCHOOL DIPLOMA/GED REQUIRED, BACHELOR’S DEGREE PREFERRED.\nCOMPENSATION AND BENEFITS:COMPETITIVE PAY RANGING FROM $75,000 TO $120,000+ PER YEAR (SALARY & COMMISSION).BONUS PROGRAMS AND AGGRESSIVE COMPENSATION PLANS WITH UNCAPPED COMMISSION POTENTIAL.RAPIDLY EXPANDING COMPANY WITH OPPORTUNITIES FOR CAREER GROWTH.PAID TIME OFF, HOLIDAYS, AND A VEHICLE STIPEND.401(K) & 401(K) MATCHINGHEALTH, DENTAL, VISION INSURANCE AVAILABLE\nJOIN US: IF YOU ARE READY TO SEIZE NEW OPPORTUNITIES, BUILD LASTING RELATIONSHIPS, AND CONTRIBUTE TO OUR COMPANY'S SUCCESS, WE ENCOURAGE YOU TO APPLY. JOIN THE RESTOPROS TEAM AND BE PART OF A DYNAMIC ENVIRONMENT WHERE YOUR SKILLS AND DEDICATION ARE VALUED. APPLY NOW TO EMBARK ON A REWARDING CAREER JOURNEY WITH US!",
    "job_skill_set": [
      "business development",
      "sales",
      "customer service",
      "CRM software",
      "computer literacy",
      "revenue target setting",
      "relationship management",
      "interpersonal skills",
      "communication",
      "problem solving",
      "proactivity",
      "teamwork",
      "work ethic",
      "customer focus",
      "negotiation"
    ],
    "short_keywords": [
      "75k120k",
      "business",
      "businessdevelopment",
      "communication",
      "computer",
      "crm",
      "customer",
      "development",
      "ethic",
      "focus",
      "interpersonal",
      "literacy",
      "management",
      "manager",
      "negotiation",
      "proactivity",
      "problem",
      "relationship",
      "revenue",
      "sales",
      "service",
      "setting",
      "skills",
      "software",
      "solving",
      "target",
      "teamwork",
      "work"
    ]
  },
  {
    "job_id": "3906261531",
    "job_title": "Business Development Manager (Stability Storage)",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "YOU MATTER TO CAMBREX.CAMBREX IS A LEADING GLOBAL CONTRACT DEVELOPMENT AND MANUFACTURING ORGANIZATION (CDMO) THAT PROVIDES DRUG SUBSTANCE, DRUG PRODUCT, AND ANALYTICAL SERVICES ACROSS THE ENTIRE DRUG LIFECYCLE. WITH MORE THAN 40 YEARS OF EXPERIENCE AND A GROWING TEAM OF OVER 2,000 PROFESSIONALS SERVICING GLOBAL CLIENTS, CAMBREX IS A TRUSTED PARTNER IN BRANDED AND GENERIC MARKETS FOR API AND DOSAGE FORM DEVELOPMENT AND MANUFACTURING.YOUR WORK MATTERS.AT CAMBREX, WE STRIVE TO BUILD A CULTURE WHERE ALL COLLEAGUES HAVE THE OPPORTUNITY TO:ENGAGE IN WORK THAT MATTERS TO OUR CUSTOMERS AND THE PATIENTS THEY SERVELEARN NEW SKILLS AND ENJOY NEW EXPERIENCES IN AN ENGAGING AND SAFE ENVIRONMENTSTRENGTHEN CONNECTIONS WITH COWORKERS AND THE COMMUNITYWE’RE COMMITTED TO ATTRACTING AND NURTURING A PASSIONATE TEAM OF VALUED PROFESSIONALS IN OUR FAST-PACED AND GROWING COMPANY. WE OFFER A COMPETITIVE BENEFITS PACKAGE THAT INCLUDES HEALTHCARE, LIFE INSURANCE, PLANNING FOR RETIREMENT, AND MORE!YOUR FUTURE MATTERS.KNOWN FOR OUR CUSTOMER-FOCUSED SCIENTIFIC AND MANUFACTURING EXCELLENCE, AS WELL AS OUR STRONG COMMITMENT TO QUALITY AND SAFETY, WE OFFER A RANGE OF CAREER AND GROWTH OPPORTUNITIES ACROSS OUR GLOBAL NETWORK OF LOCATIONS. TOGETHER WITH OUR CUSTOMERS, WE AIM TO IMPROVE THE QUALITY OF LIFE FOR PATIENTS AROUND THE WORLD. START A CAREER WHERE YOU MATTER BY APPLYING TODAY!\nJOB OVERVIEW\nRESPONSIBILITY FOR EXISTING AND NEW CLIENTS AT Q1 SCIENTIFIC LTD A CAMBREX ACQUIRED ORGANIZATION.  REPORTING TO THE MANAGING DIRECTOR OF Q1 AND DOTTED LINE TO THE DURHAM CAMBREX SITE VICE PRESIDENT, SPECIFIC RESPONSIBILITIES INCLUDE BUT ARE NOT LIMITED TO:\nRESPONSIBILITIES\nENGAGE WITH TARGET NEW ACCOUNTS AND LEAD THE OPPORTUNITY MANAGEMENT PROCESS THROUGH TO SIGNED RELATIONSHIPCONTINUOUSLY MAINTAIN RELATIONSHIPS WITH EXISTING AND PROSPECTIVE CLIENTS.ENGAGE C-LEVEL AND MID-MANAGEMENT EXECUTIVES IN LARGE AND SME COMPANIES, MAKE A COMPELLING CASE AND MANAGE THE SALES CYCLE ACTIVITIES.IMPLEMENT BEST-PRACTICE PIPLELINE, SALES FORECASTING AND OPPORTUNITY MANAGEMENTTRACK AND REPORT PROGRESS USING THE CRM SYSTEM AND ASSOCIATED TOOLS.RECORD ACCURATE AND TIMELY INFORMATION ABOUT DEAL PROGRESS, TIMELINES AND CONTRACT CLOSE DATES.IMPLEMENT AND USE TOOLS FOR LEAD GENERATION.RESEARCH THE TARGET INDUSTRIES FOR PROSPECTS THAT MEET THE COMPANY’S IDEAL CUSTOMER PROFILE AND INITIATING CONTACT AND SECURING FACE-TO-FACE APPOINTMENTS.\nQUALIFICATIONS/SKILLS\nMINIMUM 5 YEARS IN SENIOR BUSINESS DEVELOPMENT /ACCOUNT MANAGEMENT ROLES.TECHNICAL/PHARMACEUTICAL B2B SALES EXPERIENCE A PLUS.DEMONSTRATED SUCCESS IN OPPORTUNITY DEVELOPMENT AND CLOSING DEALS, INCLUDING PROSPECTING, C-LEVEL PRESENTATION AND CONSULTATIVE SELLING.EXPERIENCED IN MAKING A BUSINESS CASES TO SENIOR DECISION-MAKERS WHO ARE RESPONSIBLE FOR THEIR COMPANY’S INNOVATION, REVENUE AND GROWTH.\nEDUCATION, EXPERIENCE & LICENSING REQUIREMENTS\nBACHELOR’S DEGREE MINIMALLY, WITH 5+ YEARS OF RELEVANT EXPERIENCE IN STORAGE STABILITY SALES PREFERABLY WITHIN A CMDO AND/OR PHARMACEUTICAL INDUSTRY. \nSUPERVISION RECEIVED: GENERAL SUPERVISIONEXERCISES INDEPENDENT JUDGMENT IN DEVELOPING METHODS, TECHNIQUES AND EVALUATION CRITERIA FOR OBTAINING RESULTS. ACTS INDEPENDENTLY TO DETERMINE METHODS AND PROCEDURES ON NEW ASSIGNMENTS. MAY SEEK MANAGEMENT DIRECTION FOR PROBLEMS OF DIVERSE AND/OR COMPLEX SCOPE.  TRAVEL: 10% PHYSICAL DEMANDS:THE PHYSICAL DEMANDS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY AN EMPLOYEE TO SUCCESSFULLY PERFORM THE ESSENTIAL FUNCTIONS OF THIS JOB. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS.WHILE PERFORMING THE DUTIES OF THIS JOB, THE EMPLOYEE MAY BE REQUIRED TO USE HANDS TO FINGER, HANDLE, OR FEEL AND TO REACH WITH HANDS AND ARMS. THE EMPLOYEE IS REQUIRED TO TALK AND HEAR. THE EMPLOYEE IS FREQUENTLY REQUIRED TO STAND, WALK AND SIT. THE EMPLOYEE MAY BE OCCASIONALLY REQUIRED TO CLIMB OR BALANCE. THE EMPLOYEE MAY BE REQUIRED TO REGULARLY LIFT AND/OR MOVE UP TO 10 POUNDS, FREQUENTLY LIFT AND/OR MOVE UP TO 25 POUNDS AND OCCASIONALLY LIFT AND/OR MOVE UP TO 50 POUNDS. SPECIFIC VISION ABILITIES REQUIRED BY THIS JOB INCLUDE CLOSE VISION, DISTANCE VISION, AND PERIPHERAL VISION.ENVIRONMENT AND PROTECTIVE EQUIPMENT:THE WORK ENVIRONMENT CHARACTERISTICS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE AN EMPLOYEE ENCOUNTERS WHILE PERFORMING THE ESSENTIAL FUNCTIONS OF THIS JOB. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS.WHILE PERFORMING THE DUTIES OF THIS JOB, THE EMPLOYEE MAY BE OCCASIONALLY EXPOSED TO MOVING MECHANICAL PARTS, HIGH PRECARIOUS PLACES AND VIBRATION. THE NOISE LEVEL IN THE WORK ENVIRONMENT IS USUALLY QUIET. THE EMPLOYEE MAY BE REQUIRED TO GAIN ACCESS TO LAB, MANUFACTURING OR CLINICAL AREAS FOR INSPECTIONS OR WORK DISCUSSIONS. THE EMPLOYEE IS REQUIRED TO WEAR THE APPROPRIATE PERSONAL PROTECTIVE EQUIPMENT TO PERFORM THE JOB DUTIES. SUCH PERSONAL PROTECTIVE EQUIPMENT MAY INCLUDE BUT IS NOT LIMITED TO: SAFETY EYEWEAR, VARIOUS TYPES OF RESPIRATORS/BREATHING APPARATUS, LAB COATS, GLOVES, ETC. ALL REQUIREMENTS ARE SUBJECT TO POSSIBLE MODIFICATIONS TO REASONABLY ACCOMMODATE INDIVIDUALS WITH DISABILITIES. CAMBREX CORPORATION IS AN EQUAL OPPORTUNITY / AFFIRMATIVE ACTION EMPLOYER AND WILL CONSIDER ALL QUALIFIED APPLICANTS FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX (INCLUDING PREGNANCY, SEXUAL ORIENTATION, OR GENDER IDENTITY), ANCESTRY, NATIONAL ORIGIN, PLACE OF BIRTH, AGE, MARITAL STATUS, DISABILITY/HANDICAP, GENETIC INFORMATION, VETERAN STATUS, OR OTHER CHARACTERISTICS PROTECTED BY FEDERAL, STATE, AND/OR LOCAL LAW.",
    "job_skill_set": [
      "B2B Sales",
      "Opportunity Management",
      "Lead Generation Tools",
      "Consultative Selling",
      "C-Level Presentation",
      "Business Case Development",
      "Sales Forecasting",
      "Account Management",
      "Relationship Management",
      "Communication",
      "Independent Judgment",
      "Problem Solving",
      "Teamwork",
      "Negotiation",
      "Adaptability",
      "Customer Focus",
      "Time Management",
      "CRM Systems",
      "Pharmaceutical Industry Knowledge"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "b2b",
      "business",
      "businessdevelopment",
      "case",
      "clevel",
      "communication",
      "consultative",
      "crm",
      "customer",
      "development",
      "focus",
      "forecasting",
      "generation",
      "independent",
      "industry",
      "judgment",
      "knowledge",
      "lead",
      "management",
      "manager",
      "negotiation",
      "opportunity",
      "pharmaceutical",
      "presentation",
      "problem",
      "relationship",
      "sales",
      "selling",
      "solving",
      "stability",
      "storage",
      "systems",
      "teamwork",
      "time",
      "tools"
    ]
  },
  {
    "job_id": "3906267195",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "THE BUSINESS DEVELOPMENT MANAGER IS A 'HUNTER' THAT CARRIES OUT TASKS THAT SUPPORT BUSINESS GROWTH. THEIR JOB IS TO ANALYZE MARKET TRENDS AND IDENTIFY AREAS FOR IMPROVEMENT. THIS MAY INCLUDE BUT IS NOT LIMITED TO OBTAINING NEW SUPPLIERS TO ELEVATE PRODUCT QUALITY AND COORDINATING NEW MARKETING INITIATIVES TO EXPAND THE COMPANY’S CUSTOMER BASE. THEY MAY ALSO SUPPORT UPPER MANAGEMENT AND INCREASE SALES BY ORGANIZING AND PARTICIPATING IN MEETINGS BETWEEN CLIENTS AND COMPANY EXECUTIVES.\n*** A STRONG BACKGROUND IN THE OIL AND GAS INDUSTRY, WITH ESTABLISHED RELATIONSHIPS AND THE ABILITY TO NETWORK WITHIN THE OIL AND GAS INDUSTRY IS CRUCIAL FOR THIS POSITION. ***\nTHE PERSON IN THIS ROLE WILL MAXIMIZE THE SALES OPPORTUNITIES FOR ALL THE COMPANY’S PRODUCTS FOR A DESIGNATED PRODUCT GROUP AREA (DRY FOAM). CONSISTENT WITH THE COMPANY’S OVERALL BUSINESS OBJECTIVES AND GOOD BUSINESS PRACTICES, MAINTAINS AND INCREASES THE COMPANY’S SALES AND PROFITABILITY THROUGH IDENTIFYING NEW BUSINESS OPPORTUNITIES, E.G., NEW CLIENTS AND MARKETS, FOR THE COMPANY’S PRODUCTS.\nREPRESENT TRELLEBORG OFFSHORE US, INC. AS SINGLE POINT OF CONTACT FOR AN ASSIGNED PRODUCT GROUP AREA – DRY FOAM.DEVELOP RELATIONSHIPS WITH CLIENTS IN DEFINED MARKETS AND ACCOUNTS TO GENERATE ONGOING PROFITABLE BUSINESSES LIKE OIL & GAS.IDENTIFY EXISTING RFQ WITHIN KNOWN MARKETS AND IDENTIFY NEW BUSINESS OPPORTUNITIES THAT ALIGN WITH TRELLEBORG’S CORE COMPETENCES WITHIN DEFINED ACCOUNTS.LIAISE AND COORDINATE SALES ACTIVITIES AS REQUIRED WITH OTHER TRELLEBORG PERSONNEL.TRACK AND REPORT ON COMPETITORS WITHIN DEFINED MARKETS SUCH AS OIL & GAS, FIRE REDUCTION AND SUPPRESSION.WORK WITH CLIENTS TO DEFINE TERMS & CONDITIONS OF SALE, NON-DISCLOSURES & LEGAL DOCUMENTS SUCH AS CONTRACTS OR AGREEMENTS.VISIT WITH NEW & EXISTING CUSTOMERS, ESTABLISH RELATIONSHIPS WITH POTENTIAL NEW CUSTOMERS & CLEARLY DOCUMENT ALL SUCH CONTACTS.TRAVEL AS REQUIRED TO SECURE BUSINESS AND UPDATE CUSTOMER BUSINESS COMMUNICATION(S) WITH SALESFORCE® SOFTWARE.ASSIST WITH THE PREPARATION OF AND ATTEND TRADE EXHIBITIONS AS REQUIRED.ASSIST AND SUPPORT THE BUSINESS UNIT WITH THE PREPARATION OF PRESS RELEASES AND PROMOTIONAL MATERIAL FOR THE COMPANY’S PRODUCTS.DELIVER PRESENTATIONS TO CLIENTS AND MANAGEMENT TEAM AS NEEDED.ASSIST AS REQUESTED OTHER SALES PERSONNEL AND BUSINESS UNITS ACCORDING TO THE NEEDS OF THE BUSINESS.FOLLOW UP WITH CLIENTS ON COMPLETED PROJECTS TO DOCUMENT CLIENT SATISFACTION AND ENSURE A SYSTEM OF CONTINUOUS IMPROVEMENT.ENSURES A CONTINUOUS IMPROVEMENT IN BOTH PERSONAL AND STAFF'S LEVEL OF KNOWLEDGE AND EXPERTISE IN RELEVANT INDUSTRY DEVELOPMENTS SO AS TO MAINTAIN THE COMPANY’S REPUTATION AND POSITION IN ITS FIELD.GATHER AND REPORT ON MARKET DATA AND TRENDS TO PREPARE SALES FORECASTS TO PREDICT FUTURE BUSINESS OPPORTUNITIES.\nQUALIFICATIONSDECISION MAKINGCOMMERCIAL AWARENESSCUSTOMER KNOWLEDGE & FOCUSBUSINESS SYSTEMS, CRM SYSTEM, VIDEOCONFERENCING, SOCIAL MEDIA AS A BUSINESS TOOLPROJECT MANAGEMENT SKILLSTECHNICAL PRODUCT KNOWLEDGEESTABLISHED RELATIONSHIPS WORKING WITH OIL & GAS, FIRE REDUCTION AND SUPPRESSION APPLICATION COMPANIES.PROVEN TRACK RECORD OF LONG-TERM RELATIONSHIP AND TECHNICAL SELLINGSOME COLLEGE OR TECHNICAL BACKGROUND WOULD BE PREFERRED.INDUSTRY BACKGROUND WITH SOME MANUFACTURING INDUSTRY EXPERIENCEEXPERIENCE WORKING WITH DISTRIBUTORS AND MANUFACTURERS’ REPS DESIREDANY POLYMER OR COMPOSITES PRODUCT EXPOSURE WILL BE PREFERRED BUT NOT REQUIREDMUST BE WILLING AND ABLE TO TRAVEL UP TO 50% OF THE TIME.",
    "job_skill_set": [
      "business development",
      "market analysis",
      "sales forecasting",
      "CRM systems",
      "project management",
      "networking",
      "customer relationship management",
      "contract negotiation",
      "trade exhibitions",
      "promotional material preparation",
      "data reporting",
      "communication",
      "decision making",
      "commercial awareness",
      "customer focus",
      "relationship building",
      "team collaboration",
      "adaptability",
      "continuous improvement mindset",
      "technical product knowledge",
      "oil and gas industry knowledge",
      "Salesforce",
      "presentation skills"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "and",
      "awareness",
      "building",
      "business",
      "businessdevelopment",
      "collaboration",
      "commercial",
      "communication",
      "continuous",
      "contract",
      "crm",
      "customer",
      "data",
      "decision",
      "development",
      "exhibitions",
      "focus",
      "forecasting",
      "gas",
      "improvement",
      "industry",
      "knowledge",
      "making",
      "management",
      "manager",
      "market",
      "material",
      "mindset",
      "negotiation",
      "networking",
      "oil",
      "preparation",
      "presentation",
      "product",
      "project",
      "promotional",
      "relationship",
      "reporting",
      "sales",
      "salesforce",
      "skills",
      "systems",
      "team",
      "technical",
      "trade"
    ]
  },
  {
    "job_id": "3906094481",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "THE SALES TEAM AT STRAIGHT UP GROWTH IS RESPONSIBLE FOR SOURCING QUALIFIED OPPORTUNITIES AND BUILDING A STRONG PIPELINE. WE ARE SEEKING A BUSINESS DEVELOPMENT REPRESENTATIVE (BDR) TO JOIN OUR SUCCESSFUL SALES TEAM. OUR BDRS RESEARCH PROSPECTIVE LEADS, EXECUTE OUTREACH STRATEGIES, AND IDENTIFY POTENTIAL OPPORTUNITIES. IN THIS ROLE, YOU WILL CONDUCT EXPLORATORY CONVERSATIONS WITH PROSPECTS, USE YOUR BUSINESS ACUMEN TO ASSESS THEIR COMPANY, AND SUCCESSFULLY PITCH SUG’S VALUE PROPOSITION. SUG IS SCALING RAPIDLY AND IT IS CRITICAL FOR US TO FIND A CANDIDATE WHO IS AMBITIOUS, EAGER TO LEARN, AND EMBRACES CHALLENGES.\nDUTIES AND RESPONSIBILITIES:● ACTIVELY MAKE OVER 50 TO 100 OUTBOUND ACTIVITIES PER DAY INCLUDING COLD CALLS, EMAILS, AND SOCIAL MEDIA OUTREACH● CONDUCT SCREENING AND QUALIFICATION CALLS FOR INBOUND LEADS● WORK CLOSELY WITH OUR ACCOUNT EXECUTIVE TEAM TO DEVELOP AND EXECUTE PROSPECTING STRATEGIES● PIPELINE MANAGEMENT, REPORTING, AND COORDINATING BETWEEN OUR SALES AND MARKETING, TEAMS● SUPPORT OUR SALES AND CUSTOMER SUCCESS TEAMS TO ENSURE A SUCCESSFUL HAND OFF PROCESS● ACCOUNTABLE FOR DAILY AND WEEKLY ACTIVITY METRICS● LEARN THE FUNDAMENTALS OF NEW CUSTOMER ACQUISITION PROCESS AND BE PART OF AN EXTREMELY HIGH GROWTH COMPANY\nQUALIFICATIONS:● EXCELLENT PRESENTATION AND COMMUNICATION SKILLS● 1+ YEAR OF EXPERIENCE IN AMAZON SALES● AMBITIONS AND DESIRE TO EXCEED PERFORMANCE GOALS● ABILITY TO WORK IN FAST-PACED ENVIRONMENT● EXPERIENCE IN THE E-COMMERCE INDUSTRY IS A PLUS● EXPERIENCE WITH HUBSPOT AND CRM TOOLS IS A PLUS● B2B SALES / BUSINESS SOLUTIONS EXPERIENCE A PLUS",
    "job_skill_set": [
      "outbound sales",
      "pipeline management",
      "B2B sales",
      "communication",
      "ambition",
      "adaptability",
      "teamwork",
      "problem solving",
      "time management",
      "CRM tools",
      "Amazon sales",
      "e-commerce experience",
      "HubSpot",
      "presentation skills"
    ],
    "short_keywords": [
      "adaptability",
      "amazon",
      "ambition",
      "b2b",
      "business",
      "businessdevelopment",
      "communication",
      "crm",
      "development",
      "ecommerce",
      "experience",
      "hubspot",
      "management",
      "outbound",
      "pipeline",
      "presentation",
      "problem",
      "representative",
      "sales",
      "skills",
      "solving",
      "teamwork",
      "time",
      "tools"
    ]
  },
  {
    "job_id": "3899524216",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "BUSINESS DEVELOPMENT MANAGER – COMMERCIAL STAFFINGFEATURED MAU EMPLOYEE BENEFITS:\nCOMPETITIVE BASE SALARY AND UNCAPPED COMMISSIONMEDICAL, DENTAL, VISION AND COMPANY PAID LONG TERM DISABILITY INSURANCESPAID HOLIDAYS, VACATION, AND PERSONAL TIMEHEALTH CLUB REIMBURSEMENT PROGRAM401K AND SALARY CONTINUATION PROGRAMEDUCATION REIMBURSEMENT PROGRAMSUBSCRIPTION TO SANDLER SALES TRAINING PROGRAM – WEEKLY PROFESSIONAL DEVELOPMENT OPPORTUNITIES AND ONE-ON-ONE COACHING\nJOB SUMMARY:THE BUSINESS DEVELOPMENT MANAGER ROLE IS CRITICAL IN SUPPORTING THE SUSTAINED GROWTH MAU HAS EXPERIENCED SINCE ITS INCEPTION IN 1973. THIS POSITION IS RESPONSIBLE FOR INCREASING SALES THROUGH NEW BUSINESS GROWTH FOR ALL MAU’S SEGMENTS IN THE ASSIGNED TERRITORY. SUCCESSFUL BUSINESS DEVELOPMENT MANAGER CAN \"HUNT\" AND DELIVER SERVICE WITH A SENSE OF URGENCY WHICH LEADS TO SIGNIFICANT EARNING POTENTIAL.\nKEY RESPONSIBILITIES:\nDEVELOP A SALES PIPELINE THROUGH LEAD GENERATION, FOLLOW UP, AND CLOSING OF NEW BUSINESS.COLLABORATE WITH THE B2B MARKETING TEAM ON LEAD GENERATION AND MARKET RESEARCH.CONSULT WITH EXISTING CUSTOMERS TO EXPAND OUR RELATIONSHIP INTO NEW BUSINESS OFFERINGS.DELIVER A CONSULTATIVE SELLING APPROACH TO IDENTIFY AND MEET CLIENT NEEDS.PRESENT SOLUTION OPTIONS TO KEY LEADERS, EXECUTIVES, AND SELECTION COMMITTEES.LEVERAGE TECHNOLOGY AND MARKET INTELLIGENCE TOOLS SUCH AS, SALESFORCE, PARDOT, ZOOM INFO, AND SALES NAVIGATOR TO OPTIMIZE TERRITORY PLAN.BUILD AND MAINTAIN TRUSTING RELATIONSHIPS WITH CURRENT AND PROSPECTIVE CLIENTS.MAINTAIN A WORKING KNOWLEDGE OF THE LOCAL MARKET AND COMPETITIVE LANDSCAPE.COLLABORATE WITH HIRING MANAGERS, RECRUITERS, AND OTHER INTERNAL AND EXTERNAL STAKEHOLDERS TO DELIVER EFFICIENT AND EFFECTIVE BUSINESS SOLUTIONS TO CLIENTS.CLOSE NEW BUSINESS TO MEET TERRITORY SALES GOALS AND PASS LEADS TO OTHER SALES DIVISIONS AS IDENTIFIED.\nEDUCATION AND EXPERIENCE REQUIREMENTS:\nBACHELOR’S DEGREE IN BUSINESS ADMINISTRATION OR RELATED FIELD (REQUIRED)5-7 YEARS OF B2B SALES EXPERIENCE (REQUIRED)EXPERIENCE SELLING SERVICE-ORIENTED SOLUTIONS (PREFERRED)EXPERIENCE SELLING STAFFING SOLUTIONS (PREFERRED)PROFICIENCY USING CRM TOOLS; SALESFORCE (PREFERRED)ETHICAL CONDUCT (REQUIRED FOR ALL MAU TEAM MEMBERS)PERSONAL EFFECTIVENESS/CREDIBILITY (REQUIRED FOR ALL MAU TEAM MEMBERS)RESULTS DRIVEN WITH A STRONG BUSINESS ACUMEN INCLUDING FINANCIAL MANAGEMENTNETWORKING AND LEAD GENERATIONTERRITORY MANAGEMENT AND MARKET ANALYSISCONSULTATIVE SELLING\nPHYSICAL DEMANDS:THIS POSITION MAY REQUIRE THE FOLLOWING TO BE PERFORMED WITH OR WITHOUT REASONABLE ACCOMMODATION.\nABOUT MAU:MAU WORKFORCE SOLUTIONS IS AN INNOVATIVE GLOBAL COMPANY WITH EXTENSIVE EXPERIENCE PROVIDING SOLUTIONS FOR SUCCESS IN STAFFING, RECRUITING, TECHNOLOGY AND OUTSOURCING TO OUR CLIENTS, EMPLOYEES AND APPLICANTS. HEADQUARTERED IN AUGUSTA, GA SINCE 1973, MAU IS A FAMILY AND MINORITY-OWNED COMPANY OFFERING BETTER PROCESSES AND BETTER PEOPLE TO CREATE EFFICIENCIES AND GREATER PROFITS FOR OUR CLIENTS. OUR RELATIONSHIPS WITH WORLD-CLASS COMPANIES, OUR TRAINING PROGRAMS AND OUR CULTURE OF FAMILY ALLOW MAU TO OFFER BETTER RESULTS, BETTER JOBS AND BETTER LIVES TO THOSE WHO WORK WITH US.",
    "job_skill_set": [
      "B2B Sales",
      "Lead Generation",
      "Consultative Selling",
      "Market Analysis",
      "Financial Management",
      "Communication",
      "Relationship Building",
      "Results Driven",
      "Personal Effectiveness",
      "Collaboration",
      "Networking",
      "Problem Solving",
      "Trust Building",
      "Urgency",
      "Sales Pipeline Development",
      "CRM Tools (Salesforce)",
      "Territory Management",
      "Service-Oriented Solutions",
      "Staffing Solutions",
      "Ethical Conduct"
    ],
    "short_keywords": [
      "analysis",
      "b2b",
      "building",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "conduct",
      "consultative",
      "crm",
      "development",
      "driven",
      "effectiveness",
      "ethical",
      "financial",
      "generation",
      "lead",
      "management",
      "manager",
      "market",
      "networking",
      "personal",
      "pipeline",
      "problem",
      "relationship",
      "results",
      "sales",
      "salesforce",
      "selling",
      "serviceoriented",
      "solutions",
      "solving",
      "staffing",
      "territory",
      "tools",
      "trust",
      "urgency"
    ]
  },
  {
    "job_id": "3905252432",
    "job_title": "Business Development Specialist",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "COMPANY DESCRIPTIONWELCOME TO THE VIBRANT AND LUXURIOUS WORLD OF EVENINGS DELIGHT, SOUTH FLORIDA'S PREMIER DESTINATION FOR OUTDOOR LUXURY LIVING. OUR METICULOUSLY CURATED COLLECTION OF INDOOR AND OUTDOOR FIREPLACES, OUTDOOR KITCHENS, BBQ GRILLS, AND HOT TUBS IS DESIGNED TO TRANSFORM SPACES INTO LAVISH SANCTUARIES, WHERE EVERY MOMENT IS A CELEBRATION OF THE GOOD LIFE. WE HAVE AN UNWAVERING COMMITMENT TO LUXURY, FUN, AND THE SEDUCTIVE CHARM OF MIAMI AND SOUTH FLORIDA WHERE FINE LIVING MEETS UNPARALLELED ELEGANCE.\nOUR MISSION IS TO INSPIRE AND ELEVATE INDOOR AND OUTDOOR LIVING EXPERIENCES, MAKING EVERY HOME A TESTAMENT TO AN ELITE LIFESTYLE OF LUXURY, RELAXATION, AND JOIE DE VIVRE. OUR VISION IS TO REMAIN THE LEADING INDOOR/OUTDOOR LIVING BRAND THAT PERFECTLY EMBODIES THE SPIRIT OF MIAMI AND SOUTH FLORIDA - ENDLESSLY VIBRANT, UNAPOLOGETICALLY SUCCESSFUL, AND IRRESISTIBLY SEXY. \nWITH NEW OWNERSHIP IN 2024, JOIN OUR TEAM AS WE IMPLEMENT EXCITING NEW GROWTH INITIATIVES TO TAKE A VERY GOOD 60 YEAR OLD COMPANY TO NEW HEIGHTS AND A NEW LEVEL OF REFINED GREATNESS.\nROLE DESCRIPTIONTHIS IS A FULL-TIME ROLE FOR A BUSINESS DEVELOPMENT SPECIALIST AT EVENINGS DELIGHT. THE BUSINESS DEVELOPMENT SPECIALIST WILL BE RESPONSIBLE FOR DEVELOPING A COMPREHENSIVE LIST OF HIGHER-END SOUTH FLORIDA HOMEBUILDERS, ARCHITECTS, INTERIOR DESIGNERS, LANDSCAPE DESIGNERS, OUTDOOR KITCHEN AND PERGOLA FABRICATORS, AND REAL ESTATE GROUPS. YOU WILL THEN BEGIN BUILDING RELATIONSHIPS WITH THE COMPANIES ON THE LIST SO THAT EVENINGS DELIGHT WILL BE THE FIRST PROVIDER THEY THINK ABOUT EVERY TIME THEY HAVE A PROJECT THAT INCLUDES A FIREPLACE, OUTDOOR KITCHEN, OR BBQ GRILL. BUILDING THESE RELATIONSHIPS WILL INCLUDE COMMUNICATING BY EMAIL, TELEPHONE, IN-PERSON VISITS, CREATING MEET AND GREETS, WINE AND CHEESE EVENTS, ETC. YOUR IMAGINATION AND CREATIVITY WILL BE A TREMENDOUS ASSET. YOU WILL BE THE LIAISON BETWEEN OUR SALES STAFF AND THE DECISION MAKERS AT THESE COMPANIES. THIS ROLE IS LOCATED IN PINECREST, FL, WITH A SIGNIFICANT AMOUNT OF TIME SPENT IN THE FIELD.\nQUALIFICATIONSEXCELLENT ANALYTICAL SKILLS AND ABILITY TO IDENTIFY POTENTIAL TRADE PARTNERSHIGHLY ORGANIZED AND TASK-DRIVENSTRONG COMMUNICATION SKILLS, BOTH WRITTEN AND VERBALEXPERIENCE IN LEAD GENERATION AND CULTIVATING RELATIONSHIPSPROFICIENCY IN MARKET RESEARCH AND DATA ASSIMILATIONEXCEPTIONAL PEOPLE SKILLSABILITY TO WORK INDEPENDENTLY AND COLLABORATIVELYCREATIVE AND INNOVATIVE THINKINGPRIOR EXPERIENCE IN SALES OR BUSINESS DEVELOPMENT IS A PLUSEXPERIENCE ORGANIZING AND EXECUTING SMALL/MEDIUM SIZE EVENTS IS A PLUSENGLISH/SPANISH BILINGUAL IS A PLUS",
    "job_skill_set": [
      "lead generation",
      "market research",
      "data assimilation",
      "sales experience",
      "event organization",
      "analytical skills",
      "communication skills",
      "relationship building",
      "organizational skills",
      "creativity",
      "independent work",
      "collaborative work",
      "people skills",
      "bilingual (English/Spanish)"
    ],
    "short_keywords": [
      "analytical",
      "assimilation",
      "bilingual",
      "building",
      "business",
      "businessdevelopment",
      "collaborative",
      "communication",
      "creativity",
      "data",
      "development",
      "englishspanish",
      "event",
      "experience",
      "generation",
      "independent",
      "lead",
      "market",
      "organization",
      "organizational",
      "people",
      "relationship",
      "research",
      "sales",
      "skills",
      "specialist",
      "work"
    ]
  },
  {
    "job_id": "3905274702",
    "job_title": "Business Development Specialist",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "DESCRIPTIONTHIS ROLE IS CRITICAL TO THE ORGANIZATION. THIS ROLE WILL REQUIRE LIVING IN WEST TENNESSEE (MEMPHIS), ALABAMA (HUNTSVILLE OR BIRMINGHAM), OR MISSISSIPPI.\nTHREE MAIN VARIABLES ARE THE FOCUS:CONNECT PROVIDERS, CLIENTS, AND FAMILIES TO APPROPRIATE CLINICAL RESOURCES.SERVE AS A LIAISON AND PARTNER TO HELP EDUCATE COMMUNITIES, PROVIDERS, CLIENTS, AND FAMILIES ABOUT ADULT PSYCHIATRIC AND SUBSTANCE USE DISORDERS, SPECIFICALLY ABOUT THE ROLE LONG-TERM RESIDENTIAL PLAYS FOR ACUTE, PERSISTENT CONDITIONS.PRIORITIZE THE MARKETS, COMMUNITY, AND PROVIDER PARTNERSHIPS WITH THE GREATEST NEED FOR THE SERVICES ALIGNED WITH THE CENTER’S CLINICAL AND BUSINESS MODEL TO INCREASE CLINICALLY APPROPRIATE INQUIRIES THAT LEAD TO MEETING OR EXCEEDING ADMISSION GOALS.\nRELATIONSHIPS AND CONTACTSWITHIN THE ORGANIZATION: INITIATES AND MAINTAINS FREQUENT AND CLOSE WORKING RELATIONSHIPS WITH THE ADMINISTRATIVE TEAM, ADMISSIONS STAFF, AND CLINICAL STAFF.OUTSIDE THE ORGANIZATION: MAINTAINS WORKING RELATIONSHIPS WITH COMMUNITY PARTNERS, REFERRAL SOURCES, AND PROFESSIONAL RESOURCES. ESSENTIAL RESPONSIBILITIESBUILD A STRATEGIC REGIONAL GROWTH PLAN BY EVALUATING, ANALYZING, AND INTERPRETING FACILITY AND MARKET UTILIZATION DATA.USE MARKET DEMOGRAPHIC DATA AVAILABLE ON THE WEB TO PRIORITIZE FAVORABLE MARKETS BY ECONOMICS, AGE, AND POPULATION.COLLABORATE WITH FACILITY AND CORPORATE LEADERSHIP TO LEVERAGE STRATEGIC INITIATIVES.MAXIMIZE AVAILABLE RESOURCES AS WELL AS CREATE NEW RESOURCES TO MEET OR EXCEED STRATEGIC GROWTH GOALS.DEVELOP GOALS AND TIMELINES FOR CLOSING NEW AND ENHANCED KEY ACCOUNT OPPORTUNITIES.EXECUTE SALES AND RETENTION STRATEGIES AND PLANS, AND SUCCESSFULLY CLOSE NEW BUSINESS IN ACCORDANCE WITH PRE-DETERMINED TARGETS.MANAGES COMMUNICATIONS BY SETTING EXPECTATIONS, TROUBLESHOOTING, AND COLLABORATING WITH THE TREATMENT TEAM INTERNALLY AND EXTERNALLY TO PROVIDE COMPREHENSIVE CARE COORDINATION; WHILE ACTING AS AN INTERNAL LIAISON TO FOSTER AND ENHANCE THE RESIDENT AND REFERENT EXPERIENCE.\nQUALIFICATIONSEDUCATION AND EXPERIENCEBACHELOR’S DEGREE FROM AN ACCREDITED COLLEGE OR UNIVERSITY.3-5 YEARS OF EXPERIENCE IN STRATEGY AND BUSINESS DEVELOPMENT IN A FAST-PACED ENVIRONMENT; ABILITY TO WORK INTERDEPENDENTLY WITH MINIMAL OVERSIGHT.DEMONSTRATED ABILITY TO WORK EFFECTIVELY WITH VARIOUS EXECUTIVES AND DEPARTMENT HEADS FOR INFORMATION AND / OR INSIGHTSOME BACKGROUND IN ONE OR MORE OF THE FOLLOWINGCORPORATE DEVELOPMENT, STRATEGIC PARTNERSHIPS, PROJECT MANAGEMENT, AND / OR SALES PHYSICAL REQUIREMENTSWHILE PERFORMING THE DUTIES OF THIS JOB, THE EMPLOYEE WILL BE REQUIRED TO COMMUNICATE WITH PEERS/GENERAL PUBLIC, CLIENTS, AND/OR VENDORSJOB PERFORMANCE WILL REQUIRE THE ABILITY TO MOVE THROUGHOUT THE BUILDING AS WELL AS SIT OR REMAIN STATIONARY FOR EXTENDED PERIODS OF TIMEWHILE PERFORMING THE DUTIES OF THIS JOB, THE EMPLOYEE MAY BE REQUIRED TO TALK OR HEAR, SIT, STAND, WALK, REACH, CLIMB OR BALANCE, STOOP, KNEEL, CROUCH OR CRAWL, TASTE, OR SMELL.MUST BE ABLE TO TRAVEL IN AND OUT OF STATE TO ALL FACILITIES WITHIN THE NETWORK OF SERVICES, AS NECESSARY.ABILITY TO MOVE 25 POUNDS SKILL COMPETENCIESSTRONG PROBLEM SOLVING AND ANALYTICAL SKILLSDEMONSTRATES A HIGH LEVEL OF FOLLOW THROUGHEXCELLENT VERBAL AND WRITTEN COMMUNICATIONABILITY TO EXERCISE SOUND JUDGMENT AND DISCRETIONEXCELLENT ORGANIZATIONAL AND TIME MANAGEMENT SKILLSEXCELLENT INTERPERSONAL AND RELATIONSHIP BUILDING SKILLSABILITY TO PRIORITIZE AND MULTI-TASKPROFICIENCY WITH MICROSOFT OFFICE PROGRAMSWHAT WE OFFERMULTIPLE DEVELOPMENT PATHWAYSCOMPANY SUPPORTED CONTINUING EDUCATION & CERTIFICATIONPPO & HDHP HEALTH PLAN OPTIONSFLEXIBLE DENTAL & VISION PLAN OPTIONS100% COMPANY PAID EAP EMOTIONAL WELL-BEING SUPPORT100% COMPANY PAID CRITICAL ILLNESS (WITH HEALTH ENROLLMENT PLAN)100% COMPANY PAID LIFE & ADD401K WITH COMPANY MATCHCOMPANY-SPONSORED HSA, FSA, & DSA TAX SAVINGS ACCOUNTSSIX ANNUAL PAID HOLIDAYS PLUS ONE FLOATING HOLIDAYGENEROUS TEAM MEMBER REFERRAL PROGRAM\nSMOKY MOUNTAIN LODGE RESERVES THE RIGHTS TO MODIFY, INTERPRET, OR APPLY THIS JOB DESCRIPTION IN ANY WAY THE ORGANIZATION DESIRES. THIS JOB DESCRIPTION IN NO WAY IMPLIES THAT THESE ARE THE ONLY DUTIES, INCLUDING ESSENTIAL DUTIES, TO BE PERFORMED BY THE EMPLOYEE OCCUPYING THIS POSITION. THIS JOB DESCRIPTION IS NOT AN EMPLOYMENT CONTRACT, IMPLIED OR OTHERWISE. THE EMPLOYMENT RELATIONSHIP REMAINS “AT-WILL.” THE JOB REQUIREMENTS ARE SUBJECT TO CHANGE TO REASONABLY ACCOMMODATE QUALIFIED INDIVIDUALS WITH DISABILITIES.",
    "job_skill_set": [
      "business development",
      "strategic partnerships",
      "project management",
      "sales",
      "data analysis",
      "communication",
      "problem solving",
      "analytical skills",
      "relationship building",
      "organizational skills",
      "time management",
      "judgment and discretion",
      "multi-tasking",
      "follow through",
      "Microsoft Office"
    ],
    "short_keywords": [
      "analysis",
      "analytical",
      "and",
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "data",
      "development",
      "discretion",
      "follow",
      "judgment",
      "management",
      "microsoft",
      "multitasking",
      "office",
      "organizational",
      "partnerships",
      "problem",
      "project",
      "relationship",
      "sales",
      "skills",
      "solving",
      "specialist",
      "strategic",
      "through",
      "time"
    ]
  },
  {
    "job_id": "3901618591",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "AT MODINE, WE ARE ENGINEERING A CLEANER, HEALTHIER WORLD. BUILDING ON MORE THAN 100 YEARS OF EXCELLENCE IN THERMAL MANAGEMENT, WE PROVIDE TRUSTED SYSTEMS AND SOLUTIONS THAT IMPROVE AIR QUALITY AND CONSERVE NATURAL RESOURCES. MORE THAN 13,000 EMPLOYEES ARE AT WORK IN EVERY CORNER OF THE GLOBE, DELIVERING THE SOLUTIONS OUR CUSTOMERS NEED, WHERE THEY NEED THEM. OUR CLIMATE SOLUTIONS AND PERFORMANCE TECHNOLOGIES SEGMENTS SUPPORT OUR PURPOSE BY IMPROVING AIR QUALITY, REDUCING ENERGY AND WATER CONSUMPTION, LOWERING HARMFUL EMISSIONS AND ENABLING CLEANER RUNNING VEHICLES AND ENVIRONMENTALLY-FRIENDLY REFRIGERANTS. MODINE IS A GLOBAL COMPANY HEADQUARTERED IN RACINE, WISCONSIN (USA), WITH OPERATIONS IN NORTH AMERICA, SOUTH AMERICA, EUROPE AND ASIA. FOR MORE INFORMATION ABOUT MODINE, VISIT WWW.MODINE.COM.\n\nPOSITION DESCRIPTION\n\nTHE PRIMARY FOCUS IS ON IDENTIFYING AND CAPITALIZING ON GLOBAL BUSINESS OPPORTUNITIES FOR ACA TO DRIVE ADJACENT MARKET GROWTH VIA NEW MARKET / TECHNOLOGY IDENTIFICATION. THIS ROLE IS VERY STRATEGIC, REQUIRES INNOVATION, AND IS DRIVEN BY OUR 80/20 PRINCIPALS TO IMPROVE PROFITABILITY AND EXPAND OUR VALUE OFFERING TO NEW CUSTOMERS.\n\nTHE DIFFERENCE BETWEEN LEAD COMMERCIAL AND LEAD TECHNICAL IS THE FOCUS:COMMERCIAL HAS GREATER RESPONSIBILITY/INFLUENCE FOR IDENTIFYING, DEVELOPING AND SECURING THE BUSINESS (AS THIS IS THEIR EXPERTISE). TECHNICAL HAS GREATER RESPONSIBILITY/INFLUENCE FOR MEETING THE CUSTOMERS’ DESIGN EXPECTATIONS, PRODUCT PERFORMANCE, FOR RELAYING THIS DETAIL BACK TO OUR ENGINEERS AND FOR WORKING WITH THE ENGINEERS TO CONFIRM CUSTOMER REQUIREMENTS ARE 'BUILT/DESIGNED' INTO OUR PRODUCTS.\n\nKEY RESPONSIBILITIES\n\nMARKET RESEARCH: CONDUCTING GLOBAL MARKET RESEARCH TO IDENTIFY POTENTIAL MARKETS, CUSTOMER NEEDS, AND EMERGING TRENDS. THIS INVOLVES GATHERING DATA, ANALYZING MARKET CONDITIONS, AND EVALUATING THE COMPETITIVE LANDSCAPE.OPPORTUNITY IDENTIFICATION: IDENTIFYING NEW BUSINESS OPPORTUNITIES, POTENTIAL PARTNERSHIPS, COLLABORATIONS, OR INVESTMENT PROSPECTS THAT ALIGN WITH THE GLOBAL ORGANIZATION'S OBJECTIVES. THIS WILL INVOLVE NETWORKING, ATTENDING INDUSTRY EVENTS, MONITORING INDUSTRY NEWS, VISITING RESEARCH LABS AND UNIVERSITIES, AND STAYING UPDATED ON MARKET DEVELOPMENTS.LEAD GENERATION: SEARCHING FOR AND IDENTIFYING POTENTIAL CLIENTS, CUSTOMERS, OR STRATEGIC PARTNERS FOR THE ORGANIZATION. THIS MAY INCLUDE PROSPECTING, ATTENDING TRADE SHOWS, AND LEVERAGING ONLINE PLATFORMS TO GENERATE LEADS.RELATIONSHIP BUILDING: CULTIVATING AND MAINTAINING RELATIONSHIPS WITH KEY STAKEHOLDERS, SUCH AS CLIENTS, CUSTOMERS, PARTNERS, AND INDUSTRY INFLUENCERS. THIS INCLUDES NETWORKING, ATTENDING CONFERENCES, AND ENGAGING IN BUSINESS MEETINGS TO ESTABLISH RAPPORT AND EXPLORE POTENTIAL COLLABORATIONS.COMPETITIVE ANALYSIS: ASSESSING COMPETITORS' ACTIVITIES, PRODUCTS, AND MARKET STRATEGIES TO IDENTIFY AREAS OF OPPORTUNITY OR POTENTIAL THREATS. THIS INVOLVES GATHERING INTELLIGENCE ON COMPETITOR PERFORMANCE, PRICING, MARKETING STRATEGIES, AND PRODUCT OFFERINGS.DEVELOPMENT OF OPPORTUNITIES: COLLABORATING WITH THE REST OF VENTURE TECHNOLOGIES, OTHER AIR COOLED BUSINESS UNITS, AND PT/MODINE ENTITIES TO DEVELOP PROPOSALS, PRESENTATIONS, OR BUSINESS PITCHES TO SECURE NEW CLIENTS, PARTNERSHIPS, OR INVESTMENT OPPORTUNITIES. THIS MAY INVOLVE CREATING BUSINESS CASES, CONDUCTING FINANCIAL ANALYSIS, AND DEVELOPING STRATEGIC PLANS.COMMUNICATION SKILLS (VERBAL, WRITTEN AND PRESENTATIONS), INCLUDING ABILITY TO TRANSLATE COMPLEX IDEAS INTO UNDERSTANDABLE INSIGHTS AND PROVIDE COMMERCIALLY-SOUND BUSINESS JUSTIFICATION TO SUPPORT EXECUTIVE DECISION-MAKING STRATEGIC PLANNING: CONTRIBUTING TO THE DEVELOPMENT OF THE ORGANIZATION'S OVERALL BUSINESS STRATEGY BASED ON MARKET INSIGHTS, INDUSTRY TRENDS, AND POTENTIAL OPPORTUNITIES. THIS CAN INCLUDE PROVIDING RECOMMENDATIONS, CONDUCTING FEASIBILITY STUDIES, AND IDENTIFYING AREAS FOR GROWTH OR DIVERSIFICATION.\n\nREQUIRED EDUCATION & QUALIFICATIONS\n\nMINIMUM OF 10 YEARS OF PROVEN AND PROGRESSIVE EXPERIENCE IN SIMILAR INDUSTRIES AND ACROSS THE FOLLOWING AREAS: PRODUCT MANAGEMENT / DEVELOPMENT, MARKET DEVELOPMENT, STRATEGIC PLANNING, AND/OR NEW MARKET DEVELOPMENTBUSINESS, FINANCIAL, TECHNICAL, COMMERCIAL, STRATEGY AND NEGOTIATION SKILLSCOLLABORATIVE WORK STYLE IN AN AGILE WORK ENVIRONMENTABILITY TO WORK INDEPENDENTLYINTERCULTURAL COMPETENCES AND ABILITY FOR GLOBAL NETWORKINGEXCELLENT LEADERSHIP, ASSERTIVENESS AND COMMUNICATION SKILLSFOCUSED 80/20 MIND SETLIVES OUT MODINE VALUES\n\nMODINE IS AN EQUAL OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, VETERAN STATUS, OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW. MODINE PROVIDES A COMPETITIVE BENEFIT PACKAGE, WHICH COULD INCLUDE PAID VACATION, SHORT TERM DISABILITY, 401(K), HEALTH, DENTAL, VISION, LIFE INSURANCE, FLEX SPENDING BENEFITS, TUITION REIMBURSEMENT, HEALTH SAVINGS ACCOUNT AND MUCH MORE. HUMAN RESOURCES WILL PROVIDE MORE DETAIL UPON YOUR HIRING.\n\n",
    "job_skill_set": [
      "market research",
      "business development",
      "strategic planning",
      "financial analysis",
      "negotiation",
      "data analysis",
      "lead generation",
      "competitive analysis",
      "collaboration",
      "communication",
      "relationship building",
      "leadership",
      "innovation",
      "networking",
      "problem solving",
      "adaptability",
      "product management",
      "assertiveness",
      "intercultural competence",
      "independence"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "assertiveness",
      "building",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "competence",
      "competitive",
      "data",
      "development",
      "financial",
      "generation",
      "independence",
      "innovation",
      "intercultural",
      "lead",
      "leadership",
      "management",
      "manager",
      "market",
      "negotiation",
      "networking",
      "planning",
      "problem",
      "product",
      "relationship",
      "research",
      "solving",
      "strategic"
    ]
  },
  {
    "job_id": "3903433539",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ARTECH, A GLOBAL LEADER IN IT STAFFING AND RECRUITING IS CURRENTLY SEEKING AN EXPERIENCED BUSINESS DEVELOPMENT MANAGER, TO JOIN OUR LOCAL TEAM IN FREMONT, CA AREA.THE BUSINESS DEVELOPMENT MANAGER WILL BE RESPONSIBLE FOR THE SALES PROCESS OF SHORT AND LONG-TERM INITIATIVES AND STAFFING REQUIREMENTS BY IDENTIFYING AND SECURING BUSINESS OPPORTUNITIES AND MANAGING EXISTING RELATIONSHIPS WITH OUR ESTABLISHED CLIENTS.\nRESPONSIBILITIES:GAIN MARKET SHARE AT OUR CLIENT(S) BY INCREASING HEADCOUNT, REVENUE, AND GROSS MARGINS.MEET WITH CLIENT HIRING MANAGERS ON A DAILY BASIS TO DEVELOP LASTING RELATIONSHIPSMANAGING THE CLIENT RELATIONSHIP, PRE-SALES, POST-SALES, AND TECHNICAL ASSISTANCE.DEVELOPING AND IMPLEMENTING SALES STRATEGIES.ESTABLISH RELATIONSHIPS WITH CLIENT DECISION MAKERS.SECURE NEW BUSINESS OPPORTUNITIES.BUILDING A SALES PIPELINE FOR THE ACCOUNT(S).MANAGEMENT OF SLAS SET BY THE CLIENT, AND TRACK AND MEASURE PROGRESS.EFFECTIVELY MANAGE AND PRIORITIZE A HIGH VOLUME OF REQUISITIONSWORK CLOSELY WITH THE TECHNICAL RECRUITING TEAM TO CLEARLY COMMUNICATE CLIENT REQUIREMENTS ENSURING THE SUCCESSFUL IDENTIFICATION OF CANDIDATES.REQUIREMENTS:BACHELOR'S DEGREE REQUIREDEXPERIENCE AND KNOWLEDGE OF THE IT STAFFING INDUSTRY REQUIREDMINIMUM OF 2+ YEARS' EXPERIENCE IN A STAFFING SALES IS REQUIRED\nSALARY RANGE : $70000 TO $80000 PER YEAR + UNCAPPED COMMISSIONS\nARTECH INFORMATION SYSTEMS LLC IS AN EQUAL OPPORTUNITY / AFFIRMATIVE ACTION EMPLOYER AND DOES NOT DISCRIMINATE BECAUSE OF AGE, COLOR, DISABILITY, ETHNICITY, MARITAL OR FAMILY STATUS, NATIONAL ORIGIN, RACE, RELIGION, SEX, SEXUAL ORIENTATION, MILITARY VETERAN STATUS, OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW. WE ARE COMMITTED TO ATTRACTING, RETAINING, AND MAXIMIZING THE PERFORMANCE OF A DIVERSE AND INCLUSIVE WORKFORCE.",
    "job_skill_set": [
      "Sales Strategies",
      "Client Relationship Management",
      "Sales Pipeline Management",
      "Bachelor's Degree",
      "Communication",
      "Relationship Building",
      "Problem Solving",
      "Time Management",
      "Team Collaboration",
      "Negotiation",
      "Adaptability",
      "Market Analysis",
      "IT Staffing Knowledge",
      "Technical Assistance",
      "Data Tracking and Measurement"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "and",
      "assistance",
      "bachelors",
      "building",
      "business",
      "businessdevelopment",
      "client",
      "collaboration",
      "communication",
      "data",
      "degree",
      "development",
      "it",
      "knowledge",
      "management",
      "manager",
      "market",
      "measurement",
      "negotiation",
      "pipeline",
      "problem",
      "relationship",
      "sales",
      "solving",
      "staffing",
      "strategies",
      "team",
      "technical",
      "time",
      "tracking"
    ]
  },
  {
    "job_id": "3894876772",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "AT KALIBRI LABS, WE ARE HELPING TO REDEFINE AND REBUILD THE WAY PERFORMANCE METRICS ARE VIEWED IN THE HOTEL INDUSTRY. WE ARE LOOKING FOR PASSIONATE, ENERGETIC, AND HARDWORKING PEOPLE WITH AN ENTREPRENEURIAL SPIRIT, WHO DREAM BIG AND CHALLENGE THE STATUS QUO. WE ARE WORKING ON CUTTING-EDGE SOLUTIONS FOR THE INDUSTRY AS THEY NAVIGATE THE RECOVERY PROCESS. WE ARE USING OUR BIG DATA COUPLED WITH MACHINE LEARNING AND AI TO HELP HIGHLIGHT THE PATH FORWARD. KALIBRI LABS IS GROWING, SO IF YOU’RE READY TO MAKE A DIFFERENCE AND UTILIZE YOUR TALENTS ACROSS A GROUNDBREAKING ORGANIZATION, PLEASE KEEP READING!\nKALIBRI LABS IS SEEKING AN EXPERIENCED BUSINESS DEVELOPMENT REPRESENTATIVE TO ASSIST IN EXPANDING OUR CUSTOMER BASE. THIS POSITION WILL GENERATE POTENTIAL LEADS, SOLICITING POTENTIAL CUSTOMERS, CONNECTING PROSPECTS WITH THE RIGHT SALESPERSON, AND FACILITATE SALES.\nRESPONSIBILITIES:COLLABORATE WITH SALES AND MARKETING TEAM MEMBERS ON STRATEGIC SALES APPROACH AND HELP REFINE SALES STRATEGIES TO DRAW IN NEW POTENTIAL CUSTOMERS.INITIATE CONTACT WITH POTENTIAL CUSTOMERS THROUGH COLD CALLING, EMAILING, LINKEDIN OR BY RESPONDING TO INBOUND INQUIRIES GENERATED FROM MARKETING EFFORTS.FOLLOW-UP ON INBOUND LEADS AND IDENTIFY QUALIFIED OPPORTUNITIES PROVIDING APPROPRIATE LEVELS OF INFORMATION AT THE RIGHT TIME FOR INTERESTED PROSPECTS.CREATE RELATIONSHIPS WITH PROSPECTS AND EXISTING CLIENTS TO IDENTIFY THEIR POTENTIAL NEEDS AND QUALIFY THEIR INTERESTS AND VIABILITY TO DRIVE SALES.MOVE LEADS THROUGH THE SALES FUNNEL, CONNECTING THEM TO A SALESPERSON TO SCHEDULE APPOINTMENTS AND DEMOS.FOLLOW UP WITH POTENTIAL CUSTOMERS WHO EXPRESSED INTEREST BUT DID NOT COMPLETE A PURCHASE OF KALIBRI LABS SOLUTIONS.COLLABORATE WITH SALES EXECUTIVES TO ENSURE THE COMPANY'S GOALS AND TARGETS ARE MET.ACT AS A SUBJECT MATTER EXPERT ON KALIBRI LABS PRODUCT AND SERVICE OFFERING AND BE ABLE TO ARTICULATE THE BENEFITS, DEVELOPING PROSPECTS LEADING TO HAND-OFF TO SALES TEAMS.DRIVE ATTENDANCE FOR WEBINARS AND INDUSTRY EVENTS, SET MEETINGS FOR SALES TEAM AT CONFERENCES.ENSURE SUCCESSFUL FOLLOW THROUGH OF SALES CYCLE BY MAINTAINING ACCURATE ACTIVITY AND LEAD QUALIFICATION INFORMATION IN CRM APPLICATION (SALESFORCE).\nQUALIFICATIONSPROVEN BUSINESS DEVELOPMENT SUCCESS THROUGH EFFECTIVE USE OF CORE SALES TOOLS: SALESFORCE, ZOOMINFO, LINKEDIN, GOOGLE APPS, MICROSOFT OFFICE.PROVEN ABILITY TO COLLABORATE WITH A DISTRIBUTED SALES TEAM.CAPABILITY OF UNDERSTANDING CUSTOMER PAIN POINTS, REQUIREMENTS AND CORRELATING PROPOSED SOLUTIONS TO VALUE.APTITUDE TO MANAGE NUMEROUS REQUESTS AND TIME DEMANDS CONCURRENTLY, WHILE ACHIEVING PRODUCTION GOALS FROM ASSIGNED TERRITORY OR SET OF ACCOUNTS.PROMOTES A STRONG SENSE OF URGENCY FOR REACHING GOALS AND KEY DELIVERABLES.SUCCESSFUL COMPLETION OF COURSEWORK IN SALES TECHNIQUES, MARKETING, AND COMMUNICATION MAY BE ADVANTAGEOUS.EXCEPTIONAL COMMUNICATION SKILLS, BOTH ORAL AND WRITTEN, COUPLED WITH EXCELLENT LISTENING SKILLS\nCOMPANY BENEFITSALL POSITIONS ARE FULLY REMOTE.WE COVER 75% OF THE COST OF MEDICAL INSURANCE PREMIUMS FOR EMPLOYEES & THEIR DEPENDENTS WITH THREE MEDICAL PLANS THROUGH BLUE CROSS, BLUE SHIELD.WE COVER 75% OF THE COST OF DENTAL AND VISION INSURANCE PREMIUMS FOR EMPLOYEES & THEIR DEPENDENTS.WE PROVIDE A 50% 401K MATCH OF THE FIRST 6% OF THE EMPLOYEE'S CONTRIBUTION (FOR A MAX OF 3%).WE ALSO PROVIDE $50,000 OF LIFE INSURANCE, LONG-TERM DISABILITY AND AN EMPLOYEE ASSISTANCE PROGRAM.ALL NEW HIRES RECEIVE A $250 ALLOWANCE TO HELP THEM SET UP THEIR HOME OFFICE.",
    "job_skill_set": [
      "Microsoft Office",
      "Communication",
      "Collaboration",
      "Problem Solving",
      "Time Management",
      "Customer Relationship Management",
      "Entrepreneurial Spirit",
      "Listening Skills",
      "Sales Techniques",
      "Strategic Thinking",
      "Salesforce",
      "ZoomInfo",
      "LinkedIn",
      "Google Apps",
      "Machine Learning",
      "AI",
      "CRM Applications"
    ],
    "short_keywords": [
      "ai",
      "applications",
      "apps",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "crm",
      "customer",
      "development",
      "entrepreneurial",
      "google",
      "learning",
      "linkedin",
      "listening",
      "machine",
      "management",
      "microsoft",
      "office",
      "problem",
      "relationship",
      "representative",
      "sales",
      "salesforce",
      "skills",
      "solving",
      "spirit",
      "strategic",
      "techniques",
      "thinking",
      "time",
      "zoominfo"
    ]
  },
  {
    "job_id": "3900961237",
    "job_title": "Business Development Manager - New York",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "JOB PURPOSE MSC CRUISES IS EXPANDING ITS FIELD SALES TEAM. THIS IS A BRAND NEW POSITION DESIGNED TO DEVELOP, MAINTAIN AND SERVICE TRAVEL PARTNER RELATIONSHIPS WITHIN THE NEW YORK TERRITORY, THROUGH IN PERSON SALES MEETINGS AND EVENTS. WITHIN CORPORATE GUIDELINES, REPRESENT MSC CRUISES AS THE BRAND AMBASSADOR FOR THAT TERRITORY TO CREATE A POSITIVE PERCEPTION AND ESTABLISH PARTNERSHIPS USING A VARIETY OF STRATEGIES AND INNOVATIVE METHODS. SEEKING SOMEONE WHO LIVES IN LONG ISLAND, THE BOROUGHS OR NEW YORK CITY, AND IS FAMILIAR WITH THIS TERRITORY WITH CRUISE EXPERIENCE.  \n KEY ACCOUNTABILITIES MINES ASSIGNED MAJOR TERRITORY FOR NEW BUSINESS STREAMS ON A REGULAR BASIS. RESEARCH AND CONTINUALLY SOURCE FOR NEW REVENUE OPPORTUNITIES AND METHODS WITHIN TERRITORY TO ACHIEVE SALES GOALS.BUILDS AND ESTABLISHES NEW TRAVEL AGENCY BUSINESS. RETAIN AND MANAGE BUSINESS RELATIONSHIPS FOR EACH TRAVEL AGENCY AND DEVELOP PERSONALIZED APPROACH TO HELP MAXIMIZE AGENCIES' PROFITS. GENERATE IDEAS AND STRATEGIES TO ACTIVELY PARTICIPATE IN TRAVEL AGENCY GROWTH.PLANS, CREATES AND IMPLEMENTS AN ANNUAL TERRITORY SALES PLAN TO ACHIEVE AND MAXIMIZE TERRITORY SALES OBJECTIVES AS WELL AS ENSURING ACHIEVEMENT OF ASSIGNED GOALS. REVIEWS SALES PLAN, ACCOUNTS, PROMOTIONAL EFFORTS AND ROI MONTHLY TO DETERMINE SUCCESS TRACK, MAKING ADJUSTMENTS TO PLAN, WHEN/WHERE NECESSARY.DEVELOPS A PLAN TO REMAIN ACCESSIBLE TO TRAVEL PARTNERS AND MAINTAIN OPEN COMMUNICATION CHANNELS. MAKING A MINIMUM OF 25 IN PERSON SALES CALLS A WEEK.MANAGES BUDGET WITHIN GUIDELINES TO INCLUDE TRAVEL, CO-OP AND ALL OTHER EXPENSES. REVIEW SPEND AT THE END OF EACH MONTH.SUPPORTS NATIONAL ACCOUNTS MARKETING PROGRAMS, PROMOTIONS AND EVENTS.ANALYZES SALES DATA TO PRESENT MONTHLY, QUARTERLY BUSINESS REVIEWS WITH ACCOUNTS AND MAKE RECOMMENDATIONS.CONDUCTS SEMINARS, FAMILIARIZATION CRUISES, CRUISE EVENTS, TRADE AND CONSUMER SHOWS, AS NEEDED; THEREFORE MUST HAVE A RELIABLE FORM OF TRANSPORTATION, AND MUST BE ABLE TO TRAVEL AS REQUIRED. REQUIRES TRAVEL OF APPROXIMATELY 90%. REMAINS CURRENT ON CORPORATE INFORMATION, POLICIES, PROCEDURES, SALES AND MARKETING PROGRAMS, CORPORATE COMMUNICATIONS AND RELATED MATERIALS. PERFORMS OTHER JOB RELATED FUNCTIONS AS ASSIGNED.  \n QUALIFICATIONS MINIMUM 3 YEARS EXPERIENCE MANAGING RELATIONSHIPS WITH TRAVEL PARTNERS FOR A CRUISE LINE OR OTHER TRAVEL BUSINESSBACHELOR'S DEGREE OR EQUIVALENT COMBINATION OF EDUCATION AND/OR RELEVANT SALES EXPERIENCE;MINIMUM 5 YEARS FIELD BASED SALES EXPERIENCE AND LARGE CONTRACT NEGOTIATIONSEXPERIENCE IN NEGOTIATING AND CREATING MARKETING PLANS REQUIRED;BASIC KNOWLEDGE OF CUSTOMER RELATIONSHIP MANAGEMENT SOFTWARE.EXPERIENCED WITH MICROSOFT OUTLOOK, WORD, EXCEL AND POWERPOINT;ABILITY TO BUILD PERSONAL CREDIBILITY BY WAY OF SOLID PRODUCT KNOWLEDGE, PROCEDURES, CONSISTENT FOLLOW-THROUGH AND PROBLEM SOLVING SKILLS; AND EXECUTE AGREEMENTS USING SUPERIOR NEGOTIATION AND PRESENTATION SKILLS. ABILITY TO PREPARE AND ANALYZE COST OF SALE RESULTS.BUSINESS ACUMEN – MAINTAIN KNOWLEDGE OF MARKET AND COMPETITIVE TRENDS. EFFECTIVE TIME MANAGEMENT SKILLS TO WORK INDEPENDENTLY. \n VISA REQUIREMENTS US PASSPORT OR GREEN CARD",
    "job_skill_set": [
      "sales",
      "relationship management",
      "negotiation",
      "marketing planning",
      "customer relationship management software",
      "data analysis",
      "budget management",
      "communication",
      "problem solving",
      "time management",
      "independence",
      "creativity",
      "teamwork",
      "adaptability",
      "credibility",
      "Microsoft Outlook",
      "Microsoft Word",
      "Microsoft Excel",
      "Microsoft PowerPoint",
      "travel planning"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "budget",
      "business",
      "businessdevelopment",
      "communication",
      "creativity",
      "credibility",
      "customer",
      "data",
      "development",
      "excel",
      "independence",
      "management",
      "manager",
      "marketing",
      "microsoft",
      "negotiation",
      "new",
      "outlook",
      "planning",
      "powerpoint",
      "problem",
      "relationship",
      "sales",
      "software",
      "solving",
      "teamwork",
      "time",
      "travel",
      "word",
      "york"
    ]
  },
  {
    "job_id": "3906237986",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "COMPANY DESCRIPTION\n\nREADY TO MAKE A DIFFERENCE? EXPERIAN HAS EVOLVED INTO A GLOBAL TECH COMPANY AND LEADER IN DATA AND ANALYTICS. WE’RE PASSIONATE ABOUT UNLOCKING THE POWER OF DATA IN ORDER TO TRANSFORM LIVES AND CREATE OPPORTUNITIES FOR CONSUMERS, BUSINESSES AND SOCIETY. WE’RE A CONSTITUENT OF THE FTSE 30 AND FOR MORE THAN 125 YEARS WE’VE HELPED ECONOMIES AND COMMUNITIES FLOURISH – AND WE’RE NOT DONE.\n\nDISCOVER THE UNEXPECTED - OUR 22K AMAZING EMPLOYEES IN 30+ COUNTRIES BELIEVE THE POSSIBILITIES FOR YOU, AND THE WORLD, ARE GROWING. WE’RE INVESTING IN THE FUTURE, THROUGH NEW TECHNOLOGIES, TALENTED PEOPLE AND INNOVATION SO WE CAN HELP CREATE A BETTER TOMORROW. TO DO THIS WE EMPLOY ‘BIG-THINKERS’ AND ‘CAN-DOERS’ THAT SHARE OUR PURPOSE #UNIQUELYEXPERIAN\n\nJOB DESCRIPTION\n\nWHAT YOU’LL BE DOING\n\nTHE BUSINESS INFORMATION SERVICES BDR TEAM IS A FAST GROWING, ENTREPRENEURIAL ORGANIZATION WITHIN EXPERIAN, THAT HAS AGGRESSIVE GROWTH TARGETS TO SUPPORT THE VIGOROUSLY GROWING BUSINESS DEVELOPMENT GROUP. THEY ARE RESPONSIBLE FOR FINDING DECISION MAKERS WITHIN ORGANIZATIONS, EXPLAINING ALL OF EXPERIAN’S OFFERINGS, AND SETTING UP INTRODUCTORY CALLS BETWEEN THE PROSPECT AND OUR SALES TEAM. THE BDR IS THE FIRST IMPRESSION MANY COMPANIES WILL HAVE OF EXPERIAN; THEREFORE, IT IS CRITICAL THIS PERSON IS FRIENDLY, PROFESSIONAL, AND ENSURES EXCELLENT CLIENT EXPERIENCE.\n\nDEVELOP INDUSTRY AND LOCATION-BASED ACCOUNTS AND SET UP QUALITY APPOINTMENTS FOR THE ACCOUNT EXECUTIVESCREATE AND MANAGE ACCOUNT LISTS OF CONTACTSSTRATEGIZE EMAILS, CALLS, AND SOCIAL OUTREACH (PROSPECTING)MANAGE SALES PIPELINE THROUGH VETTING, QUALIFICATION, AND PRIORITIZATIONDEVELOP AND MAINTAIN AN IN-DEPTH KNOWLEDGE OF EXPERIAN’S PRODUCTS AND SERVICESCOLLABORATE WITH ACCOUNT EXECUTIVES, MARKETING, AND SALES LEADERSHIP TO DRIVE EFFECTIVENESS AND TEAM UNITYCONTINUOUSLY STRIVE TO DEVELOP SKILLS, WITH A STRONG LEARNING AND TEACHING MINDSET\n\nWORK LOCATION\n\nWHILE THIS POSITION CAN BE WORKED REMOTELY FROM ANYWHERE WITHIN THE COUNTRY, WE DO ENCOURAGE THOSE LOCATED NEAR OUR CORPORATE OFFICES TO APPLY. HAVING THE ABILITY TO GO INTO THE OFFICE FOR EVENTS, COMMUNITY BUILDING, AND CONNECTION ALLOWS FOR AN UNPARALLELED ENGAGEMENT AND SUPPORT SYSTEM.\n\nCORPORATE LOCATIONS CAN BE FOUND:\n\nAUSTIN, TXFRANKLIN, TNSCHAUMBURG, ILBOSTON, MACOSTA MESA, CA\n\nQUALIFICATIONS\n\nWHAT YOUR BACKGROUND LOOKS LIKE\n\nEXCELLENT COMMUNICATION SKILLS- WRITTEN AND VERBALABILITY TO BE POWERFULLY PERSUASIVEABILITY TO EFFECTIVELY MANAGE TIME TO MAXIMIZE RESULTSSELF-STARTER WITH AN ENTREPRENEURIAL SPIRIT AND GROWTH MINDSETABILITY TO LISTEN, EARN TRUST, CONSULT, AND ASK FOR A SALE WITH POTENTIAL CLIENTSHIGH LEVEL OF SELF-ACCOUNTABILITY AND INTERNAL MOTIVATION, WITH A DRIVE TO EXCEED EXPECTATIONSABILITY TO GRASP BUSINESS AND SALES CONCEPTS QUICKLY, THROUGH ONLINE EDUCATION, TEAM MEMBERS, AND COACHING\n\nTO STAND OUT\n\nPRIOR BDR/SDR EXPERIENCEFINANCIAL SERVICES EXPERIENCEEXPERIENCE WITH SALES TOOLS, SUCH AS SALESFORCE, SALESLOFT, ZOOMINFO, AND 6SENSE\n\nADDITIONAL INFORMATION\n\nOUR UNIQUENESS IS THAT WE TRULY CELEBRATE YOURS. EXPERIAN'S CULTURE AND PEOPLE ARE KEY DIFFERENTIATORS. WE TAKE OUR PEOPLE AGENDA VERY SERIOUSLY AND FOCUS ON WHAT TRULY MATTERS; DEI, WORK/LIFE BALANCE, DEVELOPMENT, AUTHENTICITY, ENGAGEMENT, COLLABORATION, WELLNESS, REWARD & RECOGNITION, VOLUNTEERING... THE LIST GOES ON. EXPERIAN’S STRONG PEOPLE FIRST APPROACH IS AWARD WINNING; GREAT PLACE TO WORK™ IN 24 COUNTRIES, FORTUNE BEST COMPANIES TO WORK AND GLASSDOOR BEST PLACES TO WORK (GLOBALLY 4.4 STARS) TO NAME A FEW. CHECK OUT EXPERIAN LIFE ON SOCIAL OR OUR CAREERS SITE TO UNDERSTAND WHY.\n\nEXPERIAN IS PROUD TO BE AN EQUAL OPPORTUNITY AND AFFIRMATIVE ACTION EMPLOYER. INNOVATION IS A CRITICAL PART OF EXPERIAN'S DNA AND PRACTICES, AND OUR DIVERSE WORKFORCE DRIVES OUR SUCCESS. EVERYONE CAN SUCCEED AT EXPERIAN AND BRING THEIR WHOLE SELF TO WORK, IRRESPECTIVE OF THEIR GENDER, ETHNICITY, RELIGION, COLOR, SEXUALITY, PHYSICAL ABILITY OR AGE. IF YOU HAVE A DISABILITY OR SPECIAL NEED THAT REQUIRES ACCOMMODATION, PLEASE LET US KNOW AT THE EARLIEST OPPORTUNITY.\n\n",
    "job_skill_set": [
      "business development",
      "data analytics",
      "prospecting",
      "client management",
      "communication",
      "persuasion",
      "time management",
      "self-motivation",
      "trust-building",
      "entrepreneurial spirit",
      "team collaboration",
      "learning mindset",
      "salesforce",
      "salesloft",
      "zoominfo",
      "6sense"
    ],
    "short_keywords": [
      "6sense",
      "analytics",
      "business",
      "businessdevelopment",
      "client",
      "collaboration",
      "communication",
      "data",
      "development",
      "entrepreneurial",
      "learning",
      "management",
      "mindset",
      "persuasion",
      "prospecting",
      "representative",
      "salesforce",
      "salesloft",
      "selfmotivation",
      "spirit",
      "team",
      "time",
      "trustbuilding",
      "zoominfo"
    ]
  },
  {
    "job_id": "3884926253",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ABOUT TELESIS BIO:\nOUR MISSION IS TO APPLY OUR BREAKTHROUGHS IN AUTOMATION SOLUTIONS FOR DNA, RNA, AND PROTEIN SYNTHESIS TO ENABLE CUSTOMERS TO PROGRAM AND \"WRITE\" SYNTHETIC BIOLOGY THAT CREATES SUSTAINABLE HEALTHCARE AND TECHNOLOGY SOLUTIONS FOR SOME OF HUMANITY’S BIGGEST CHALLENGES. OUR GENE SYNTHESIS PORTFOLIO REDUCES THE TURNAROUND TIME FOR SYNTHESIZING WORKFLOWS FROM WEEKS AND MONTHS TO DAYS AND HOURS, AND INCLUDES THE AUTOMATED BIOXP™ MOLECULAR BIOLOGY WORKSTATION, AND SYNTHESIS KITS, AS WELL AS BENCHTOP GIBSON ASSEMBLY® REAGENTS. IN ADDITION TO AUTOMATING, ACCELERATING, AND OPTIMIZING DNA DESIGN, SYNTHESIS, CLONING AND AMPLIFICATION, TELESIS BIO AND THE BIOXP™ SYSTEM ENSURE YOUR DESIGNS STAY IN YOUR HANDS, MARRYING SPEED AND SECURITY FOR INNOVATORS IN DRUG DISCOVERY, VACCINE DEVELOPMENT, PRECISION MEDICINE, AND BEYOND. SUMMARY OF ROLE: WE ARE SEEKING A BUSINESS DEVELOPMENT MANAGER TO DRIVE ADOPTION OF TELESIS BIO’S PRODUCTS AND SERVICES IN THE ASSIGNED GEOGRAPHY. THIS ROLE WILL REPORT TO THE SR. DIRECTOR – GLOBAL SALES. THE SUCCESSFUL CANDIDATE WILL HAVE AN ENTHUSIASTIC ENTREPRENEURIAL WORK ETHIC AND A STRONG UNDERSTANDING OF MOLECULAR BIOLOGY. THIS PERSON WILL WORK CLOSELY WITH FIELD APPLICATIONS SCIENTIST TO IDENTIFY NEW OPPORTUNITIES, EXPAND TELESIS BIO’S CUSTOMER AND APPLICATION BASE, AND SUPPORT EXISTING CUSTOMERS ESSENTIAL DUTIES AND RESPONSIBILITIES:DEVELOPMENT OF APPROPRIATE TERRITORY AND ACCOUNT-SPECIFIC SALES PLAN FOR EACH OF THE PRODUCT LINES IN THE PORTFOLIO TO MEET ASSIGNED SALES QUOTASSUPPORT AND SELL AN EXPANDING PORTFOLIO OF CONSUMABLE KITS TO BE USED WITH BIOXP SYSTEMSUCCESSFULLY MANAGE A COMPLEX SALES PROCESS FOR CAPITAL EQUIPMENT, CONSUMABLES, AND RELATED SERVICESDELIVER EFFECTIVE SCIENTIFIC/TECHNICAL PRESENTATIONS AND DEMONSTRATIONS OF THE TELESIS BIO PORTFOLIODEMONSTRATE, INSTALL AND GAIN CUSTOMER ACCEPTANCE OF TELESIS BIO’S BIOXP SYSTEM AT CUSTOMER SITESPROVIDE REGULAR UPDATES ON PROGRESS TOWARDS MEETING ASSIGNED QUOTAS, WHICH INCLUDES FREQUENT UPDATES TO CRMACCURATELY MANAGE SALES PIPELINE ACTIVITIES BY MANAGING EXISTING CUSTOMERS AND CONTINUOUSLY WORKING TO EXPAND OUR CUSTOMER BASEWORK REMOTELY AND ATTEND TRADE SHOWS AND CONFERENCES WHEN POSSIBLEALL OTHER DUTIES AS ASSIGNED OR NECESSARY REQUIRED QUALIFICATIONS: STRONG UNDERSTANDING OF MOLECULAR BIOLOGY AND GENE SYNTHESIS REQUIRED (HANDS-ON EXPERIENCE WITH CLONING AND RELATED WORKFLOWS STRONGLY PREFERRED).3+ YEARS’ EXPERIENCE IN COMMERCIAL ROLES IN THE LIFE SCIENCES REQUIRED.EXPERIENCE SELLING OR SUPPORTING CAPITAL EQUIPMENT A PLUS (EXPERIENCE IN FIELD APPLICATIONS OR RELATED ROLES OF PARTICULAR INTEREST).STRONG UNDERSTANDING OF PHARMA, BIOTECH AND RESEARCH ORGANIZATIONS REQUIRED (ESTABLISHED RELATIONSHIPS WITH SCIENTISTS ACROSS INDUSTRY A PLUS)DEMONSTRATED CAPACITY FOR SALES-RELATED ACTIVITIES A PLUS (EX. TRACK RECORD IN LEAD GENERATION AND PROSPECTING, MEETING & EXCEEDING SALES TARGETS).COMPETITIVE BUT COLLABORATIVE WITH STRONG DESIRE TO WIN BUSINESS AND ESTABLISH LONG-TERM CUSTOMER RELATIONSHIPSTHRIVE IN A START-UP, RAPIDLY GROWING COMPANY ENVIRONMENTTAKE INITIATIVE, BE ACCOUNTABLE, COACHABLE AND HAVE A GROWTH MINDSETEXCELLENT VERBAL AND WRITING SKILLS, GREAT COMPUTER SKILLSMUST BE LOCATED IN THE SAN FRANCISCO BAY AREA\nEDUCATION REQUIREMENTS: MINIMUM BACHELOR’S DEGREE IN LIFE SCIENCES (ADVANCED DEGREE IN LIFE SCIENCES PREFERRED).A BUSINESS DEGREE WITH STRONG HANDS-ON MOLECULAR BIOLOGY EXPERIENCE WILL BE CONSIDERED.\nWORKING CONDITIONS: TRAVEL WILL VARY BUT MAY BE AS HIGH AS 50% ON A WEEKLY BASIS.\nTHE ANTICIPATED ANNUAL BASE SALARY FOR THIS POSITION IS $100,000 - $150,000 A YEAR + COMMISSION + STOCK OPTIONS + BENEFITS. THE ACTUAL BASE SALARY OFFERED DEPENDS ON A VARIETY OF FACTORS, WHICH MAY INCLUDE AS APPLICABLE, THE QUALIFICATIONS OF THE INDIVIDUAL APPLICANT FOR THE POSITION, YEARS OF RELEVANT EXPERIENCE, SPECIFIC AND UNIQUE SKILLS, LEVEL OF EDUCATION ATTAINED, CERTIFICATIONS OR OTHER PROFESSIONAL LICENSES HELD, LOCATION OF THE ROLE, AND HOW THESE QUALIFICATIONS COMPARE TO THE INTERNAL EQUITY OF CURRENT EMPLOYEES. YOUR RECRUITER WILL BE MORE THAN HAPPY TO DISCUSS OTHER OFFERINGS WE PROVIDE DURING THE HIRING PROCESS.",
    "job_skill_set": [
      "sales management",
      "CRM software",
      "lead generation",
      "customer relationship management",
      "entrepreneurial work ethic",
      "communication",
      "initiative",
      "collaboration",
      "accountability",
      "growth mindset",
      "problem solving",
      "adaptability",
      "teamwork",
      "customer focus",
      "molecular biology",
      "gene synthesis",
      "capital equipment sales",
      "technical presentations",
      "life sciences",
      "cloning",
      "biotech knowledge",
      "trade show participation"
    ],
    "short_keywords": [
      "accountability",
      "adaptability",
      "biology",
      "biotech",
      "business",
      "businessdevelopment",
      "capital",
      "cloning",
      "collaboration",
      "communication",
      "crm",
      "customer",
      "development",
      "entrepreneurial",
      "equipment",
      "ethic",
      "focus",
      "gene",
      "generation",
      "growth",
      "initiative",
      "knowledge",
      "lead",
      "life",
      "management",
      "manager",
      "mindset",
      "molecular",
      "participation",
      "presentations",
      "problem",
      "relationship",
      "sales",
      "sciences",
      "show",
      "software",
      "solving",
      "synthesis",
      "teamwork",
      "technical",
      "trade",
      "work"
    ]
  },
  {
    "job_id": "3904718982",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "THE BUSINESS DEVELOPMENT MANAGER WILL BE RESPONSIBLE FOR MANAGING AND COORDINATING BUSINESS DEVELOPMENT IN THE ENERGY EFFICIENCY, RENEWABLE ENERGY AND TRANSPORTATION SECTORS AND ASSURING THAT PROPOSALS AND MARKETING ARE STRATEGIC AND ALIGN WITH OUR LONG TERM BUSINESS DEVELOPMENT GOALS.\nTHIS CANDIDATE WILL OVERSEE GROWING BUSINESS DEVELOPMENT EFFORTS COMPANY-WIDE, TAKING OVER FROM A CURRENT ACTING BUSINESS DEVELOPMENT MANAGER. ACTIVITIES WILL INCLUDE MANAGING THE DAY TO DAY ACTIVITIES OF THE PROPOSAL COORDINATOR, WORKING WITH THE EXECUTIVE TEAM AND CAPTURE MANAGERS TO IDENTIFY AND PRIORITIZE CAPTURE EFFORTS AND CAPTURE RELATIONS MANAGEMENT. THE BD MANAGER WILL WORK CLOSELY WITH THE PROPOSAL COORDINATOR AND EXECUTIVE MANAGEMENT TO STREAMLINE THE CAPTURE PROCESS. THE CANDIDATE WILL ALSO COLLECT INPUT FROM CAPTURE MANAGERS AND OPERATIONS SUPPORT STAFF.\nDUTIES & RESPONSIBILITIES:RESPONSIBILITIES INCLUDE, BUT ARE NOT LIMITED TO:SUPERVISE THE ACTIVITIES OF THE PROPOSAL COORDINATOR AND COORDINATE ACTIVITIES OF ANY PART TIME AND TEMPORARY BUSINESS DEVELOPMENT AND MARKETING STAFFREPORT BD ACTIVITIES REGULARLY TO THE EXECUTIVE TEAMWORK WITH EXECUTIVE TEAM AND PROGRAM DIRECTORS TO SEEK AND IDENTIFY BUSINESS OPPORTUNITIES; RESEARCH AND GATHER INFORMATION ON POTENTIAL CLIENTS AND PROJECTSESTABLISH AND DEVELOP PURSUIT PLANNING PROCESS. WORK WITH APPROPRIATE TEAM MEMBERS TO CREATE AND EXECUTE A WINNING STRATEGY TO SECURE STRATEGIC BIDS; DEVELOP WINNING APPROACH AND DIFFERENTIATORS WITH CAPTURE LEADS.ESTABLISH A STRONG PROFESSIONAL NETWORK IN THE ENERGY SPACE. DEVELOP AND MAINTAIN A NETWORK OF CORPORATE, INDUSTRY, GOVERNMENT, MUNICIPAL, AND COMMUNITY CONTACTS TO KEEP ABREAST OF INDUSTRY, CLIENT, AND COMPETITOR ACTIVITY.BUILD RELATIONSHIPS WITH CLIENTS, TEAMING PARTNERS, AND COMMUNITY INFLUENCERS INSIDE AND OUTSIDE THE FIRM. MEET WITH NEW/EXISTING CLIENTS TO DISCOVER PURSUIT INFORMATION AND DETAILSANALYZE RESEARCH DATA RELATED TO CLIENTS; COMPETITORS; PAST, CURRENT, AND PROSPECTIVE MARKETS;MONITOR LEGISLATIVE AND/OR REGULATORY ACTIVITIES THAT COULD AFFECT THE NEED FOR SERVICESASSIST EXECUTIVE TEAM IN DEVELOPING AND DRIVING STRATEGIC INITIATIVES FORWARDPARTICIPATE IN GO/NO-GO DECISIONS; ASSESS EACH POTENTIAL PURSUIT IN REGARD TO ITS ABILITY TO MEET THE FIRM’S STRATEGIC POSITIONING AND GOALSOVERSEE AND COORDINATE A CRM THROUGH A DEVELOPED CONTENT MANAGEMENT SYSTEMS; USE THIS SYSTEM TO TRACK BUSINESS DEVELOPMENT OPPORTUNITIES.REVIEW AND PROVIDE GUIDANCE TO MARKETING TEAM ON UPDATED MARKETING CONTENT TO ENSURE IT ADEQUATELY SUPPORTS THE ENERGETICS STRATEGIC BD ACTIVITIESPARTICIPATE IN COLOR TEAM AND MOCK PANEL REVIEWS (AS APPLICABLE)\nMINIMUM REQUIREMENTSMINIMUM 6 YEARS OF WORK EXPERIENCE AND 4 YEARS OF EXPERIENCE IN BUSINESS DEVELOPMENTBACHELOR'S DEGREE IN BUSINESS, MARKETING OR RELATED DISCIPLINE.OUTSTANDING WRITTEN AND ORAL COMMUNICATION SKILLS.EXCELLENT SKILLS WITH DIGITAL SYSTEMS INCLUDING MICROSOFT OFFICE (WORD, POWERPOINT, EXCEL, TEAMS) AND OTHER PROPOSAL WRITING TOOLS.EXPERIENCE WITH BUSINESS DEVELOPMENT, PROPOSAL DEVELOPMENT AND CRM AUTOMATION SOFTWARE AND EMERGING DIGITAL TOOLS.STRONG TIME MANAGEMENT AND PRIORITIZATION SKILLS.HIGHLY ORGANIZED WITH EXCELLENT ATTENTION TO DETAIL.STRATEGIC AND CRITICAL THINKING, PROBLEM-SOLVING SKILLS\nPREFERRED REQUIREMENTSKNOWLEDGE OF CONSULTING AND THE CLEAN ENERGY MARKET AND TECHNOLOGIES7 OR MORE YEARS OF RELATED BUSINESS DEVELOPMENT EXPERIENCEMBA OR RELATED ADVANCED DEGREE\nOTHER  OCCASIONAL TRAVEL TO ATTEND CONFERENCES OR MEET WITH CLIENTSTHE SELECTED APPLICANT WILL BE SUBJECT TO A BACKGROUND CHECK AND DRUG TESTING.",
    "job_skill_set": [
      "business development",
      "proposal development",
      "CRM automation software",
      "Microsoft Office",
      "digital systems",
      "strategic planning",
      "data analysis",
      "communication",
      "time management",
      "organizational skills",
      "attention to detail",
      "strategic thinking",
      "problem solving",
      "relationship building",
      "teamwork",
      "clean energy market knowledge",
      "emerging digital tools"
    ],
    "short_keywords": [
      "analysis",
      "attention",
      "automation",
      "building",
      "business",
      "businessdevelopment",
      "clean",
      "communication",
      "crm",
      "data",
      "detail",
      "development",
      "digital",
      "emerging",
      "energy",
      "knowledge",
      "management",
      "manager",
      "market",
      "microsoft",
      "office",
      "organizational",
      "planning",
      "problem",
      "proposal",
      "relationship",
      "skills",
      "software",
      "solving",
      "strategic",
      "systems",
      "teamwork",
      "thinking",
      "time",
      "to",
      "tools"
    ]
  },
  {
    "job_id": "3905363873",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "BRIEF DESCRIPTION\n\nTHE BUSINESS DEVELOPMENT MANAGER IS RESPONSIBLE FOR GENERATING NEW BUSINESS OPPORTUNITIES BY DEVELOPING RELATIONSHIPS WITH POTENTIAL BLUSKY CUSTOMERS IN THEIR VERTICAL WITHIN THE ASSIGNED AREA OF RESPONSIBILITY. PRIMARY RESPONSIBILITIES INCLUDE INSIDE AND OUTSIDE SALES ACTIVITIES SUCH AS NETWORKING, LEAD GENERATION, SOCIAL MEDIA, AND PARTICIPATION IN TRADE ASSOCIATIONS.\n\nBASE SALARY RANGE: $60,000 - $95,000\n\nCOMMISSION\n\nAUTO ALLOWANCE\n\nACCOUNTABILITIES\n\n(WITHIN ASSIGNED GEOGRAPHIC AREA OF RESPONSIBILITY AND NATIONALLY, AS APPLICABLE)\n\nBUSINESS DEVELOPMENT ACTIVITY AND MIX OF BUSINESS.FACE-TO-FACE MEETINGS.GENERATING WHALE LEADS.AVERAGE SOLD AT PROFIT MARGINS.\n\nPRINCIPAL DUTIES & RESPONSIBILITIES\n\nBUSINESS DEVELOPMENT \n\n(WITHIN ASSIGNED REGION OR IN ANY GEOGRAPHIC MARKET WHERE OUR CUSTOMERS ARE PRESENT)\n\nTHE EXPECTATION OF THIS POSITION IS THAT TIME AND EFFORT WILL BE DEDICATED TO THE REGION OF RESPONSIBILITY.NURTURES AND EXPANDS EXISTING BUSINESS RELATIONSHIPS TO INCREASE LEAD GENERATION AND AVERAGE JOB SIZE.LOCATES, PRESENTS TO, AND SELLS BLUSKY TO NEW AND PROSPECTS.WORKS WITH A DEFINED TARGET LIST MANAGED THROUGH THE BLUSKY CRM SYSTEM.MAINTAINS MEMBERSHIP AND INVOLVEMENT IN TARGETED ASSOCIATIONS AND ACHIEVES SIGNIFICANT COMMITTEE AND/OR LEADERSHIP POSITIONS.SUPPORTS ALL BLUSKY SALES EFFORTS BY FOLLOWING UP ON LEADS.PREPARES AND PRESENTS SALES PROPOSALS.MEET SALES ACTIVITY THRESHOLDS THROUGH CLIENTS AND PROSPECT MEETINGS, EVENTS, PHONE, SOCIAL MEDIA, EMAIL, ETC.DOCUMENTS AND TRACKS LEADS AND BUSINESS DEVELOPMENT ACTIVITIES IN SALESFORCE.ACHIEVE YEARLY INDIVIDUAL SALES GOALS.\n\nMARKETING (WITHIN AN ASSIGNED REGION OR IN ANY GEOGRAPHIC MARKET WHERE OUR CUSTOMERS ARE PRESENT)\n\nWORKS WITH LEADERSHIP TO PLAN ASSOCIATION INVOLVEMENT LEVELS AND BUDGETS.PARTICIPATES IN AND REPRESENTS BLUSKY IN TRADESHOWS, GOLF TOURNAMENTS, AND PROMOTIONAL EVENTS.PLANS, ORGANIZES, AND PARTICIPATES IN TRADESHOWS AND OTHER MARKETING FUNCTIONS, INCLUDING GOLF TOURNAMENTS, CHARITABLE EVENTS, AND OTHER NETWORKING AND SOCIAL ACTIVITIES, MANY OF WHICH ARE AFTER NORMAL BUSINESS HOURS.\n\nGENERAL RESPONSIBILITIES\n\n(WITHIN ASSIGNED REGION OR IN ANY GEOGRAPHIC MARKET WHERE OUR CUSTOMERS ARE PRESENT)\n\nBECOME AND REMAIN PROFICIENT IN OUR SERVICES AND THE ASSOCIATED TERMINOLOGY.ADHERES TO COMPANY EMPLOYMENT STANDARDS AND BEST PRACTICES.PROVIDES THE HIGHEST LEVEL OF INTERNAL AND EXTERNAL CUSTOMER SERVICE AT ALL TIMES.CONTRIBUTES POSITIVELY TO THE BLUSKY CULTURE AND COMMUNITY.\n\nSUPERVISORY RESPONSIBILITY\n\nTHIS POSITION HAS NO DIRECT REPORTS.\n\nQUALIFICATIONS & REQUIREMENTS;\n\nREQUIRED 3+ YEARS OF OUTSIDE SALES EXPERIENCE. RESTORATION INDUSTRY EXPERIENCE PREFERRED.MUST BE ABLE TO ATTEND NETWORKING FUNCTIONS 2 EVENINGS A WEEK.INTERMEDIATE-LEVEL MICROSOFT OFFICE SKILLS.EXPERIENCE INPUTTING AND TRACKING SALES-RELATED DATA INTO A CRM SYSTEM.VALID DRIVER'S LICENSE.AN OUTGOING, DRIVEN, TENACIOUS, TEAM-ORIENTED ATTITUDE IS A MUST!\n\nEDUCATION\n\nPREFERRED BACHELOR'S DEGREE IN BUSINESS ADMINISTRATION, MARKETING, OR RELATED FIELD.\n\nWORK ENVIRONMENT & PHYSICAL JOB DEMANDS;\n\nTHE WORK ENVIRONMENT CHARACTERISTICS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE AN EMPLOYEE ENCOUNTERS WHILE PERFORMING THE ESSENTIAL FUNCTIONS OF THIS JOB. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS. THE NOISE LEVEL IN THE WORK ENVIRONMENT IS USUALLY QUIET.\n\nTHE PHYSICAL DEMANDS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY AN EMPLOYEE TO SUCCESSFULLY PERFORM THE ESSENTIAL FUNCTIONS OF THIS JOB. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS.\n\nTHE EMPLOYEE MUST OCCASIONALLY LIFT AND/OR MOVE UP TO 25 POUNDS. WHILE PERFORMING THE DUTIES OF THIS JOB, THE EMPLOYEE IS REGULARLY REQUIRED TO SIT; USE HANDS AND FINGERS, REACH WITH HANDS AND ARMS, TALK AND HEAR. THE EMPLOYEE IS REQUIRED TO REGULARLY MOVE AND WALK AROUND THE OFFICE.\n\nTRAVEL\n\nTRAVEL IS PRIMARILY LOCAL (25%). SOME OUT-OF-AREA AND OVERNIGHT TRAVEL MAY BE EXPECTED FOR TRAINING OR MEETINGS.\n\nCOMPENSATION\n\nBLUSKY OFFERS A COMPETITIVE BASE SALARY AND A COMPREHENSIVE BENEFITS PACKAGE THAT INCLUDES: A MATCHING 401(K) PLAN, HEALTH INSURANCE (MEDICAL, DENTAL, AND VISION), PAID TIME OFF, DISABILITY, LAPTOP, SMARTPHONE, AND CORPORATE APPAREL ALLOWANCE.\n\nBLUSKY ALSO OFFERS EXTENDED BENEFITS SUCH AS: EMPLOYEE ASSISTANCE PROGRAM, ACCIDENT & CRITICAL ILLNESS COVERAGE, LEGALSHIELD, PROFESSIONAL DEVELOPMENT, PAID REFERRAL PROGRAM, AND MORE.\n\nEEOC\n\nBLUSKY IS DEDICATED TO THE PRINCIPLES OF EQUAL EMPLOYMENT OPPORTUNITY. BLUSKY PROHIBITS UNLAWFUL DISCRIMINATION AGAINST APPLICANTS OR EMPLOYEES ON THE BASIS OF AGE 40 OR OVER, RACE, SEX, COLOR, RELIGION, NATIONAL ORIGIN, DISABILITY, GENETIC INFORMATION, SEXUAL ORIENTATION, OR ANY OTHER APPLICABLE STATUS PROTECTED BY FEDERAL, STATE, OR LOCAL LAW.\n\nIT IS AND WILL CONTINUE TO BE THE POLICY OF BLUSKY THAT ALL PERSONS ARE ENTITLED TO EQUAL EMPLOYMENT OPPORTUNITY BASED ON THEIR INDIVIDUAL QUALIFICATIONS, PERFORMANCE, AND POTENTIAL WITHOUT REGARD FOR ANY PROTECTED STATUS, AS REQUIRED BY STATE AND FEDERAL LAW.",
    "job_skill_set": [
      "sales",
      "lead generation",
      "networking",
      "trade shows",
      "customer service",
      "communication",
      "team-oriented",
      "relationship building",
      "tenacity",
      "outgoing attitude",
      "problem solving",
      "CRM systems",
      "Microsoft Office",
      "sales proposals"
    ],
    "short_keywords": [
      "attitude",
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "crm",
      "customer",
      "development",
      "generation",
      "lead",
      "manager",
      "microsoft",
      "networking",
      "office",
      "outgoing",
      "problem",
      "proposals",
      "relationship",
      "sales",
      "service",
      "shows",
      "solving",
      "systems",
      "teamoriented",
      "tenacity",
      "trade"
    ]
  },
  {
    "job_id": "3898179502",
    "job_title": "Private Client Business Development Advisor",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "THE PRIVATE CLIENT BUSINESS DEVELOPMENT ROLE IS AN IDEAL OPPORTUNITY FOR A HIGHLY MOTIVATED PROFESSIONAL WITH A PASSION FOR CREATING NEW BUSINESS AND CONVERTING OPPORTUNITIES TO JOIN A GROWING AND RESPECTED PRIVATE CLIENT PRACTICE AT A WELL-ESTABLISHED AND FEDERALLY REGISTERED INVESTMENT ADVISOR MANAGING INDIVIDUALLY MANAGED ACCOUNTS AND MUTUAL FUNDS. \nAS A MEMBER OF THE PRIVATE CLIENT TEAM, THE PRIVATE CLIENT BUSINESS DEVELOPMENT ADVISOR WILL BE RESPONSIBLE FOR IDENTIFYING AND CULTIVATING RELATIONSHIPS WITH PROSPECTIVE CLIENTS ON BEHALF OF THE FIRM TO ARRANGE INTRODUCTORY CALLS AND FACE TO FACE MEETINGS WITH MEMBERS OF THE PRIVATE CLIENT TEAM. THIS INDIVIDUAL WILL HAVE A BROAD UNDERSTANDING OF WEALTH MANAGEMENT PRACTICES AND INVESTMENT STRATEGIES AND WILL BE COMFORTABLE ARTICULATING THE COMPANY’S PRIVATE CLIENT SERVICES AND INVESTMENT OFFERINGS. SOURCING NEW LEADS FOR THE PRIVATE CLIENT TEAM WILL BE CRITICAL TO SUCCESS IN THIS ROLE. THIS INDIVIDUAL WILL ALSO BE RESPONSIBLE FOR BUILDING AND MANAGING LONG-TERM RELATIONSHIPS WITH REFERRAL SOURCES. A STRONG TEAM PLAYER AND COMMUNICATOR, THE PRIVATE CLIENT BUSINESS DEVELOPMENT ADVISOR WILL PARTNER ACTIVELY ACROSS THE COMPANY’S INTERNAL PLATFORM TO DELIVER AN OUTSTANDING PROSPECTIVE CLIENT EXPERIENCE AND REPRESENT THE FIRM IN A PROFESSIONAL MANNER AND MAINTAIN A HIGH LEVEL OF PRODUCT AND PORTFOLIO KNOWLEDGE.\nTHE COMPANY TAKES INCLUSION SERIOUSLY AND EXPECTS EVERY TEAM MEMBER TO SHARE THE COMPANY’S VALUES AND TO RESPECT DIFFERENCES IN THE PURSUIT OF OUR SHARED GOALS.\nESSENTIAL FUNCTIONSIDENTIFY AND DEVELOP RELATIONSHIPS WITH PROSPECTIVE CLIENTS TO DRIVE AUM GROWTH.BUILD AND MAINTAIN RELATIONSHIPS WITH ACCOUNTANTS, ESTATE PLANNING ATTORNEYS, PROFESSIONAL FIDUCIARIES, AND OTHER CENTERS OF INFLUENCE FOR PURPOSES OF OBTAINING REFERRALS.EFFECTIVELY ARTICULATE THE FIRM’S INVESTMENT STRATEGIES, PHILOSOPHY, AND MACROECONOMIC VIEWS.ABILITY TO DISCUSS FIRM’S WEALTH MANAGEMENT SERVICES AND BEST PRACTICES.MAINTAIN A DEEP LEVEL OF UNDERSTANDING OF THE INVESTMENT MANAGEMENT INDUSTRY, OUR STRATEGIES AND PORTFOLIOS.CONTRIBUTE TO THE PREPARATION OF INVESTMENT MANAGEMENT PROPOSALS.RESPOND PROMPTLY TO INFORMATION REQUESTS.ACTIVELY UPDATE AND MAINTAIN CRM DATABASE OF PROSPECTS, REFERRAL SOURCES AND CENTERS OF INFLUENCE. EDUCATIONBACHELOR’S DEGREEADVANCED DEGREE (I.E. MBA, JD, ETC.) OR PROFESSIONAL DESIGNATION (I.E. CFA, CFP) PREFERRED.\n EXPERIENCEMINIMUM TEN YEARS IN INVESTMENT MANAGEMENT SALES.PROVEN TRACK RECORD OF SALES SUCCESS.CONSULTATIVE SALES APPROACH WITH DEPTH IN INVESTMENT STRATEGIES AND MACROECONOMIC THEMES. SKILLS/KNOWLEDGE/ABILITIES:A HIGHLY MOTIVATED AND DRIVEN TEAM PLAYER WITH A HIGH LEVEL OF PROFESSIONALISM; FLEXIBLE AND WITH A POSITIVE ATTITUDE.EXCELLENT VERBAL, WRITTEN AND INTERPERSONAL COMMUNICATION SKILLS.MUST HAVE STRONG INTEGRITY AND THE ABILITY TO BUILD TRUST WITH PROSPECTS AS WELL AS INTERNAL AND EXTERNAL PARTNERS.STRONG UNDERSTANDING OF CAPITAL MARKETS, ASSET ALLOCATION, AND INVESTMENT PLANNING.COMFORTABLE DISCUSSING FINANCIAL MARKETS, PORTFOLIO CONSTRUCTION AND RISK.STRONG COMPUTER SKILLS INCLUDING MICROSOFT OFFICE APPLICATIONS AND CRM (SALESFORCE) EXPERIENCE.",
    "job_skill_set": [
      "Microsoft Office",
      "sales success",
      "communication",
      "relationship building",
      "professionalism",
      "positive attitude",
      "motivation",
      "wealth management",
      "investment strategies",
      "CRM (Salesforce)",
      "capital markets",
      "asset allocation",
      "investment planning",
      "investment management",
      "portfolio construction",
      "risk management",
      "consultative sales",
      "investment management proposals",
      "teamwork",
      "integrity",
      "flexibility",
      "trust building"
    ],
    "short_keywords": [
      "advisor",
      "allocation",
      "asset",
      "attitude",
      "building",
      "business",
      "businessdevelopment",
      "capital",
      "client",
      "communication",
      "construction",
      "consultative",
      "crm",
      "development",
      "flexibility",
      "integrity",
      "investment",
      "management",
      "markets",
      "microsoft",
      "motivation",
      "office",
      "planning",
      "portfolio",
      "positive",
      "private",
      "professionalism",
      "proposals",
      "relationship",
      "risk",
      "sales",
      "salesforce",
      "strategies",
      "success",
      "teamwork",
      "trust",
      "wealth"
    ]
  },
  {
    "job_id": "3903846588",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "WE'RE NOT JUST IN THE PACKAGING BUSINESS–WE'RE IN THE \"WOW\" BUSINESS\n\n PREGIS IS HIRING!\n\n WHY JOIN PREGIS?\n\nPREGIS IS IN THE PACKAGING BUSINESS TO PROTECT WHAT MATTERS. WE ARE COMMITTED TO PROVIDING OUR CUSTOMERS AND EMPLOYEES SUSTAINABLE GROWTH THROUGH PURPOSE-DRIVEN INNOVATION AND CUSTOMER-CENTRIC PACKAGING SOLUTIONS. IF YOU ARE LOOKING FOR A COMPANY THAT IS THRIVING ACROSS VARIOUS HIGH GROWTH INDUSTRIES AND IS INNOVATIVE, CUSTOMER FOCUSED, HIGH INTEGRITY, BELIEVES IN STRONG TEAMWORK AND COLLABORATION, PREGIS IS THE COMPANY FOR YOU. CHECK OUT THE PREGIS PURPOSE TO LEARN HOW SUSTAINABILITY AND SOCIAL RESPONSIBILITY IS AT THE VERY CORE OF OUR COMPANY DNA.\n\nSCOPE OF RESPONSIBILITY\n\nAS A BUSINESS DEVELOPMENT MANAGER YOU WILL BE RESPONSIBLE FOR SELLING OUR FULL LINE OF PRODUCTS TO NAMED ACCOUNTS AND TARGET MARKETS. S/HE DRIVES SALES REVENUE BY BUILDING A RELATIONSHIP WITH KEY PLAYERS IN THEIR ACCOUNTS AND TARGET MARKETS; PENETRATING THE ACCOUNTS AND MARKETS AT ALL LEVELS AND ALL SUBSIDIARIES; BECOMING A TRUSTED ADVISOR ON SOLUTIONS TO MEET THE NEEDS OF THEIR ACCOUNTS; AND MAINTAINING AN ONGOING ACCOUNT AND SEGMENT STRATEGY FOR SELLING GI’S PRODUCTS AND SOLUTIONS. S/HE STAYS IN TOTAL ENGAGEMENT WITH ACCOUNTS AND SEGMENTS DURING THE SALES CYCLE WHILE BRINGING IN ADDITIONAL NECESSARY RESOURCES FROM THE SALES, PRODUCT, AND PROFESSIONAL SERVICES TEAM. THE POSITION REQUIRES TIME IN OUR CORPORATE HEADQUARTERS WORKING CLOSELY WITH GI’S LEADERSHIP TEAM AS WELL AS TIME IN FACE-TO-FACE CLIENT AND PROSPECT CALLS.\n\nRESPONSIBILITIES\n\n DEVELOPS CORPORATE CONTACTS AND CULTIVATES RELATIONSHIPS AT ALL LEVELS THAT ENHANCES GI’S POSITION, WHICH LEADS TO INCREMENTAL BUSINESS WITHIN THE DESIGNATED ACCOUNT  COMPILES CUSTOMER ACCOUNT INFORMATION ON ORGANIZATIONAL STRUCTURE (PARENT AND SUBSIDIARIES), BUYING PROCESS, COMPENSATION PROCESS, EXISTING PRODUCTS/TOOLS TO PRODUCE A PROSPECTIVE BUSINESS REPORT IDENTIFYING POTENTIAL BUSINESS ACTIVITIES NECESSARY TO CLOSE CLIENT ACCOUNTS  MAINTAINS REGULAR CONTACT WITH ACCOUNT BASE, AND INCREASES REVENUE FROM POSITIONING AND DEMONSTRATING NEW AND EXISTING PRODUCTS, PREPARING APPROPRIATE ROI’S, AND CLOSING THE SALE  OPERATES COOPERATIVELY WITH THE PREPARATION OF YEARLY AND MULTIPLE YEAR ACCOUNT PLANS FOR EACH ACCOUNT BASED ON SHORT, MID AND LONG-RANGE PLANS  GENERATES, DEVELOPS, MANAGES, AND COMMUNICATES EXPECTATIONS WITHIN ASSIGNED ACCOUNTS AS WELL AS INCREASES SCOPE OF PENETRATION WITHIN EACH ACCOUNT  QUALIFIES NEW OPPORTUNITIES AND PROSPECTS, DIMENSIONS THE SIZE OF OPPORTUNITIES AND ARTICULATES PROBABILITIES AND SALES CYCLES OF CLOSURE  COLLABORATES WITH CORPORATE MARKETING ON PRESENTATIONS AND MATERIALS.  MAINTAINS COMPLETE AND ACCURATE DOCUMENTATION OF ALL ACTIVITIES  MAINTAINS BROAD KNOWLEDGE OF COMPANY PRODUCTS AND THEIR CAPABILITIES VERSUS THE STRENGTHS/WEAKNESSES OF COMPETITIVE PRODUCTS  MAINTAINS CLOSE WORKING RELATIONSHIP WITH GI PRODUCT PERSONNEL TO KNOW PRODUCT FUTURES AND TIMING, AS WELL AS FEEDBACK CONCERNS AND REQUESTS FROM PROSPECTS  NEGOTIATES PRICING AND IMPLEMENTATION AND PREPARES PROPOSALS  TRAVEL UP TO 40%  DEVELOPS CUSTOMER RELATIONSHIPS, IMPLEMENTING A MARKETING PLAN, PROTECTING PROFITABILITY AND FOSTERING GROWTH  DIRECTS FOCUSED CUSTOMER GROWTH BASED ON THE REQUIREMENTS OF GI’S PRESIDENT AND SENIOR STAFF.  ESTABLISH SUFFICIENT PROSPECTIVE OPPORTUNITIES TO MEET STRATEGIC BUSINESS PLANS  DETAILED KNOWLEDGE OF ALL PROSPECTIVE AND NEW CUSTOMER RELATIONSHIPS SO GI’S CUSTOMER I NTERACTIONS CAN BE FACILITATED TO MAINTAIN BUSINESS GROWTH AND PROFITABILITY. \n\n#EVT\n\n DIVERSITY AND INCLUSION\n\nWE BELIEVE IN DIVERSITY OF THOUGHT AND BRINGING TOGETHER OTHER TRAITS AND CHARACTERISTICS THAT MAKE AN INDIVIDUAL BRING A UNIQUE EXPERIENCE TO PREGIS.WE STRIVE TO FOSTER AN INCLUSIVE ENVIRONMENT WHERE BEHAVIORS AND SOCIAL NORMS ENSURE PEOPLE ARE WELCOME.\n\n AFFIRMATIVE ACTION/EEO STATEMENT/INCLUSION \n\nWE OFFER EQUAL EMPLOYMENT OPPORTUNITIES TO ALL EMPLOYEES AND APPLICANTS FOR EMPLOYMENT AND PROHIBIT DISCRIMINATION AND HARASSMENT OF ANY TYPE BASED ON RACE, COLOR, RELIGION, AGE, SEX, NATIONAL ORIGIN, DISABILITY STATUS, GENETICS, PROTECTED VETERAN STATUS, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, OR ANY OTHER CHARACTERISTIC PROTECTED BY FEDERAL, STATE OR LOCAL LAWS. WE SUPPORT INCLUSION AND BELIEVE IN WELCOMING A COLLECTIVE SUM OF INDIVIDUAL DIFFERENCES, THOUGHTS, TRAITS, AND CHARACTERISTICS TO REPRESENT PREGIS’ CULTURE AND ACHIEVEMENTS.\n\nVISIT US AT WWW.PREGIS.COM FOR MORE INFORMATION ABOUT PREGIS LLC.\n\nAPPLY NOW",
    "job_skill_set": [
      "customer relationship management",
      "documentation",
      "communication",
      "teamwork",
      "relationship building",
      "problem solving",
      "adaptability",
      "collaboration",
      "customer-centric mindset",
      "time management",
      "initiative",
      "sales",
      "account management",
      "negotiation",
      "market analysis",
      "product knowledge",
      "strategic planning",
      "presentation skills",
      "ROI analysis",
      "creativity"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "analysis",
      "building",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "creativity",
      "customer",
      "customercentric",
      "development",
      "documentation",
      "initiative",
      "knowledge",
      "management",
      "manager",
      "market",
      "mindset",
      "negotiation",
      "planning",
      "presentation",
      "problem",
      "product",
      "relationship",
      "roi",
      "sales",
      "skills",
      "solving",
      "strategic",
      "teamwork",
      "time"
    ]
  },
  {
    "job_id": "3887472263",
    "job_title": "Sales & Business Development Specialist-Specialty Craft Channel",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "CALLING ALL CAREER-SEEKERS, TEAM PLAYERS AND COLLABORATORS OF ALL SKILL SETS: FLORACRAFT, THE WORLD'S LEADING CRAFT AND FLORAL FOAM MANUFACTURER, IS LOOKING TO GROW ITS TEAM. THE FAMILY-OWNED COMPANY IS LOOKING FOR A SALES & BUSINESS DEVELOPMENT SPECIALIST SPECIALTY CRAFT CHANNEL READY TO JOIN AN INNOVATIVE ENVIRONMENT FILLED WITH DEDICATED PEOPLE. SALES & BUSINESS DEVELOPMENT SPECIALIST SPECIALTY CRAFT CHANNEL THIS POSITION IS RESPONSIBLE FOR PROVIDING SUPPORT TO FACILITATE SALES AND GROWTH OF THE ACCOUNTS UNDER THE SPECIALTY CRAFT CHANNEL.ESSENTIAL DUTIES AND RESPONSIBILITIES DEVELOPS A STRONG KNOWLEDGE BASE OF COMPANY'S PRODUCTS, PROCESSES AND CORE COMPETENCIES. BECOMES THE EXPERT ON CUSTOMERS' PROCESSES AND REQUIREMENTS GENERATES SALES REPORTS ON A SPECIFIED FREQUENCY OR AS NEEDED. ANALYZES AND IDENTIFIES OUTLIERS FOR OPPORTUNITIES. SETS UP NEW ITEMS / PRICING / DESCRIPTIONS IN CUSTOMER PORTALS. MANAGES CUSTOMER CATALOG IN PLEX ERP SYSTEM. PROVIDES TROUBLESHOOTING ASSISTANCE FOR CUSTOMER ORDERS, CLAIMS FOR SHORTAGES/DAMAGES, TRACKING OF ORDERS AND RELEVANT ISSUES. ASSISTS WITH CUSTOMER MEETING PREP RESEARCH, POWER POINT DECKS, ORDERING SAMPLES AND SUPPLIES, ETC. ASSISTS WITH SETTING UP CUSTOMER POG'S (PLAN-O-GRAMS) WHEN APPLICABLE. SHARES IN RESPONSIBILITY OF CUSTOMER STORE VISITS AND SUBSEQUENT RECAPS AS NEEDED. SUGGESTS PROCESS IMPROVEMENTS. CREATES AND UPDATES SOPS AROUND ALL ACTIVITY, LOOKING FOR EFFICIENCIES. DEVELOPS AN APTITUDE FOR RETAIL SALES CONCEPTS HAS THE ABILITY AND INITIATIVE TO BE TRAINED TO HANDLE FULL ACCOUNT RESPONSIBILITY, IF APPLICABLE. COORDINATES CUSTOMER REQUESTS CROSS FUNCTIONALLY. ENSURES SAFETY STANDARDS ARE CONSISTENTLY FOLLOWED.\nSKILLS AND ABILITIES REQUIREDMUST HAVE INTERMEDIATE TO ADVANCED PROFICIENCY IN MICROSOFT OFFICE SUITE (OUTLOOK, EXCEL, WORD, POWERPOINT, ONENOTE, TEAMS) WITH AN EMPHASIS ON EXCEL. POSSESSES STRONG WRITTEN AND ORAL COMMUNICATION SKILLS AND ABILITY TO COMMUNICATE EFFECTIVELY WITH CUSTOMERS AND ALL LEVELS OF THE ORGANIZATION. ABILITY TO HANDLE CHANGING PRIORITIES, WORK ON MULTIPLE PROJECTS SIMULTANEOUSLY, AND DEMONSTRATE EXCELLENT PROBLEM-SOLVING SKILLS. DRIVEN BY CURIOSITY, A THIRST FOR KNOWLEDGE AND A FAST LEARNER. DETAIL ORIENTED. SELF-STARTER AND MOTIVATED.\nPREFERRED IN-DEPTH UNDERSTANDING OF SALES PRINCIPLES AND CUSTOMER SERVICE PRACTICES. EXPERIENCE WITH ERP AND PROJECT MANAGEMENT TECHNOLOGIES EXPERIENCE WITH DATA ANALYTICS (POWERBI) AND/OR POINT-OF-SALE DATA\nEDUCATION / EXPERIENCE REQUIREMENTS BACHELOR'S DEGREE IN BUSINESS OR MARKETING AND SALES PREFERRED; OR 3-5 YEARS OF EXPERIENCE; OR EQUIVALENT COMBINATION OF EDUCATION AND EXPERIENCE. THE IDEAL CANDIDATE IS AN EXPERIENCED PROFESSIONAL WITH KNOWLEDGE OF SALES AND CUSTOMER SERVICE BEST PRACTICES. HE OR SHE SHOULD ALSO BE ABLE TO INTERPRET SALES METRICS AND BE GOAL-ORIENTED, PERFORM WELL IN A TEAM ENVIRONMENT AND HAVE EXCEPTIONAL PEOPLE SKILLS. ULTIMATELY, THE CANDIDATE SHOULD BE ABLE TO CONTRIBUTE TO CREATING AND MAINTAINING GOOD CUSTOMER RELATIONSHIPS AND ENSURING SMOOTH SALES TEAM OPERATIONS.\nWORKING CONDITIONS / ENVIRONMENTWORKING CONDITIONS ARE CONSISTENT WITH A TYPICAL OFFICE ENVIRONMENT AND ARE USUALLY QUIET. FLORACRAFT CORPORATION OFFERS A COMPETITIVE WAGE, EXCEPTIONAL BENEFITS, AND THE OPPORTUNITY TO WORK WITH A GREAT TEAM IN A FUN ENVIRONMENT.  \nPI239165266",
    "job_skill_set": [
      "Sales Metrics Interpretation",
      "Project Management Technologies",
      "Communication",
      "Problem Solving",
      "Teamwork",
      "Detail Oriented",
      "Self-Starter",
      "Customer Relationship Management",
      "Adaptability",
      "Curiosity",
      "Microsoft Office Suite",
      "Excel",
      "ERP Systems",
      "Data Analytics (PowerBI)"
    ],
    "short_keywords": [
      "adaptability",
      "analytics",
      "business",
      "businessdevelopment",
      "channel",
      "communication",
      "craft",
      "curiosity",
      "customer",
      "data",
      "detail",
      "development",
      "erp",
      "excel",
      "interpretation",
      "management",
      "metrics",
      "microsoft",
      "office",
      "oriented",
      "powerbi",
      "problem",
      "project",
      "relationship",
      "sales",
      "selfstarter",
      "solving",
      "specialistspecialty",
      "suite",
      "systems",
      "teamwork",
      "technologies"
    ]
  },
  {
    "job_id": "3905354176",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "BOHUA IS A LARGE , INTEGRATING DESIGN, DEVELOPMENT, PRODUCTION . IT HAS NOW DEVELOPED INTO AN INDUSTRIAL LEADER WITH A PLANT AREA OF 20,000 SQUARE METERS AND 1,200 EMPLOYEES, 9 MILLION UNITS CAPACITY IN CHINA, AND TWO FACTORIES IN BANGLADESH AS WELL. BOHUA GROUP HAS ALWAYS ADHERED AND IMPLEMENTED THE BUSINESS PHILOSOPHY OF “QUALITY FIRST, SERVICE FOREMOST ”. IN RECENT YEARS, BOHUA HAS BEEN PROMOTING INNOVATION AND GREEN DEVELOPMENT, USING INNOVATIVE DESIGN AND ECO-FRIENDLY FABRICS, LOW-CARBON PRODUCTION METHODS, IT AIMS TO CONTRIBUTE TO THE SUSTAINABLE DEVELOPMENT OF THE INDUSTRY.OVERVIEW OF THE POSITIONWE ARE HIRING 3 SALES MANAGERS/DIRECTORS IN USA, THIS ROLE IS TO DEVELOP US & EUROPE MARKETS, ESTABLISH THE BUSINESS RELATIONSHIP WITH LOCAL BRANDS IN MEDICAL SCRUBS/UNIFORM FIELD, WORK TOGETHER WITH CHINA TEAM TO ENSURE THE GROWTH OF NEW BUSINESS. FULL AND PART-TIME JOB ARE BOTH ACCEPTED, REMOTE JOB (HYBRID). IF YOU ARE A STRONG COMMUNICATOR, DESIRE TO WIN AND BETTER INCOME, PLS JOIN US. WE HAVE A STRONG TEAM TO SUPPORT YOU, STRONG FACTORY WITH VERY COMPETITIVE PRICE. PAY: BASIC SALARY AND SERVICE CHARGE.JOB RESPONSIBILITIES:1. DEVELOP THE NEW CUSTOMERS IN MEDICAL SCRUBS AND UNIFORM FIELD IN US .2. VISIT CUSTOMERS, MAINTAIN GOOD COMMUNICATION AND RELATIONSHIP.3. COMMUNICATE WITH CHINA MAINLAND TEAM.4. SEARCH THE INDUSTRY TRENDS IN US.5. ASSIST TO THE SHOWING IN US AND EUROPE.6. TRIP WHEN NEEDED.QUALIFICATIONS:1. FAMILIAR WITH LOCAL CLOTHING INDUSTRY ESPECIALLY SCRUBS AND UNIFORM. MORE THAN 5 YEARS OF EXPERIENCE IN CLOTHING INDUSTRY IS PREFERRED.2. CAN DIRECTLY LED THE DEVELOPMENT AND FOLLOW UP ORDERS.3. HAVE SCRUBS & UNIFORM RESOURCES AND CONNECTION IS PREFERRED.4. BE FAMILIAR WITH CLOTHING STYLE, FABRIC AND PURCHASE/RETAIL PRICE.5. STRONG COMMUNICATION SKILL, EAGER TO LEARN AND LIKE TO SHARE.",
    "job_skill_set": [
      "business development",
      "sales management",
      "customer relationship management",
      "communication",
      "team collaboration",
      "problem solving",
      "adaptability",
      "eagerness to learn",
      "relationship building",
      "market research",
      "clothing industry knowledge",
      "supply chain management",
      "fabric knowledge",
      "pricing strategy"
    ],
    "short_keywords": [
      "adaptability",
      "building",
      "business",
      "businessdevelopment",
      "chain",
      "clothing",
      "collaboration",
      "communication",
      "customer",
      "development",
      "eagerness",
      "fabric",
      "industry",
      "knowledge",
      "learn",
      "management",
      "manager",
      "market",
      "pricing",
      "problem",
      "relationship",
      "research",
      "sales",
      "solving",
      "strategy",
      "supply",
      "team",
      "to"
    ]
  },
  {
    "job_id": "3906229818",
    "job_title": "Business Development Specialist (Intellectual Property)",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "THIS ROLE IS HYBRID REMOTE.\n\nTHE SPECIALIST, BUSINESS DEVELOPMENT SUPPORTS THE OVERALL BUSINESS DEVELOPMENT AND MARKETING EFFORTS OF THE FIRM BY HELPING TO CREATE AND EXECUTE STRATEGIC ACTIVITIES RELATED SPECIFICALLY TO THE ENERGY AND INFRASTRUCTURE PRACTICE ACROSS MULTIPLE MARKETS, CLIENTS, AND GEOGRAPHIES.\n\nIN THIS CAPACITY, THE SPECIALIST, BUSINESS DEVELOPMENT WILL:\n\nCONTRIBUTE TO THE STRATEGIC BUSINESS DEVELOPMENT AND MARKETING PLANS INCLUDING GOALS, ACTION ITEMS, AND DEADLINES. COLLABORATE WITH PARTNERS, THE BUSINESS DEVELOPMENT, MARKETING, AND COMMUNICATIONS TEAMS, AS WELL AS OTHER INTERNAL STAKEHOLDERS IN THE DEVELOPMENT AND EXECUTION OF THESE PLANS; DEVELOP STRONG KNOWLEDGE OF THE PRACTICE’S MARKET POSITION, KEY STRENGTHS, BENCH OF EXPERTISE IN KEY INDUSTRIES AND CLIENT BASE; DRAFT AND PREPARE WRITTEN PROPOSALS, PITCHES, AND OTHER COMMUNICATIONS TO CLIENTS, PROSPECTIVE CLIENTS, AND RELATED THIRD PARTY ORGANIZATIONS; DRIVE CONTENT-DRIVEN CAMPAIGN STRATEGY DESIGNED TO GENERATE NEW BUSINESS OPPORTUNITIES; COLLABORATE WITH THE GLOBAL BUSINESS DEVELOPMENT TEAM ON THE IDENTIFICATION AND PURSUIT OF CROSS-SELLING INITIATIVES; SUPPORT THE PRACTICE'S KEY CLIENT EFFORTS AND WORK WITH COLLEAGUES ON BEST PRACTICE TO ENSURE THE IDENTIFICATION, DEVELOPMENT, AND GROWTH OF HIGH-VALUE SERVICES TO KEY CLIENTS; PLAN AND OVERSEE SEMINARS, EVENTS, AND OTHER TARGETED MARKETING ACTIVITIES; HELP PRACTICE GROUP LEADERS AND BUSINESS DEVELOPMENT SENIOR MANAGER TO MANAGE RELEVANT BUSINESS DEVELOPMENT BUDGETS; COLLABORATE WITH FUNCTIONAL MANAGERS ON RELEVANT PR, COMMUNICATIONS, AND DIGITAL MARKETING INITIATIVES; TRAVEL AS NEEDED TO SUPPORT INITIATIVES AND PARTICIPATE IN ACTIVITIES; AND ACT AS A LEAD ON ADDITIONAL RELATED PROJECTS WITHIN THE DEPARTMENT OR FIRM AS ASSIGNED. \n\n\nPROFICIENCIES:\n\nKNOWLEDGE OF TECHNOLOGIES, DEVELOPMENTS, TRENDS AND LITERATURE RELATED TO LEGAL AND PROFESSIONAL SERVICES MARKETING FIELDS; PROFICIENCY IN MS OFFICE SUITE AND DOCUMENT MANAGEMENT SYSTEMS; FUNDAMENTAL KNOWLEDGE OF CRM SYSTEMS; PROFICIENCY IN ONLINE RESEARCH AND INTERNET RESOURCES AND ABILITY TO ANALYZE INFORMATION TO IDENTIFY TRENDS IN KEY MARKETS AND RELATED BUSINESS GROWTH OPPORTUNITIES; EXCELLENT VERBAL AND COMMUNICATION SKILLS, INCLUDING ATTENTION TO DETAIL AND PROOFREADING; KNOWLEDGE OF THE NEEDS AND EXPECTATIONS OF LAW FIRM OPERATIONS AND CORPORATE LEGAL CLIENTS IN ORDER TO FUNCTION AT A STRATEGIC LEVEL; ADVANCED KNOWLEDGE OF MARKETING PRINCIPLES, PROCEDURES, CONCEPTS AND PRACTICAL APPLICATIONS; FUNDAMENTAL KNOWLEDGE OF NETWORKING AND RELATIONSHIP MANAGEMENT; PROFICIENCY IN TEAM BUILDING, MANAGEMENT, AND LEADERSHIP SKILLS; FUNDAMENTAL KNOWLEDGE OF LEGAL CONCEPTS; AND ABILITY TO INDEPENDENTLY MANAGE PRIORITIES AND PROJECTS EFFECTIVELY. \n\n\nQUALIFICATIONS:\n\nBA/BS DEGREE (REQUIRED); AT LEAST 5 YEARS OF WORK EXPERIENCE (REQUIRED); LAW FIRM EXPERIENCE (PREFERRED);AND EXPERIENCE SUPPORTING INTELLECTUAL PROPERTY PRACTICE GROUP (PREFERRED).",
    "job_skill_set": [
      "business development",
      "MS Office Suite",
      "CRM systems",
      "data analysis",
      "budget management",
      "networking",
      "relationship management",
      "communication",
      "teamwork",
      "leadership",
      "attention to detail",
      "project management",
      "strategic thinking",
      "independence",
      "marketing",
      "document management systems",
      "online research",
      "event planning",
      "legal concepts"
    ],
    "short_keywords": [
      "analysis",
      "attention",
      "budget",
      "business",
      "businessdevelopment",
      "communication",
      "concepts",
      "crm",
      "data",
      "detail",
      "development",
      "document",
      "event",
      "independence",
      "intellectual",
      "leadership",
      "legal",
      "management",
      "marketing",
      "ms",
      "networking",
      "office",
      "online",
      "planning",
      "project",
      "property",
      "relationship",
      "research",
      "specialist",
      "strategic",
      "suite",
      "systems",
      "teamwork",
      "thinking",
      "to"
    ]
  },
  {
    "job_id": "3904941405",
    "job_title": "Business Development Manager, Grasslands",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "JOB TITLE: BUSINESS DEVELOPMENT MANAGER, GRASSLANDSREPORTS TO: PRESIDENT LOCATION: FIELD-BASED - LOCATION FLEXIBLE WITHIN PRIORITY GEOGRAPHY  POSITION SUMMARY:   AGRICAPTURE IS A MISSION-DRIVEN COMPANY THAT CERTIFIES CLIMATE-FRIENDLY PRACTICES ON FARMS, RANCHLANDS AND GRASSLANDS AND QUANTIFIES ASSOCIATED EMISSIONS REDUCTIONS, ENABLING PRODUCERS TO GENERATE REVENUE FOR THEIR SUSTAINABLE MANAGEMENT PRACTICES. BY CERTIFYING AGRICULTURAL PRODUCTS AS CLIMATE-FRIENDLY AND DEVELOPING CARBON CREDITS, WE SERVE CORPORATIONS THAT ARE REDUCING AND OFFSETTING THEIR GHG EMISSIONS WHILE EMPOWERING CONSUMERS TO CONSCIOUSLY SELECT CLIMATE-FRIENDLY PRODUCTS. WE ARE SEEKING A GRASSLANDS CARBON BUSINESS DEVELOPMENT MANAGER TO JOIN OUR EXPANDING TEAM AND LEAD OUR EFFORT TO PRESERVE SOIL CARBON. BY PREVENTING ACTIVITIES SUCH AS TILLAGE, CROPLAND CONVERSION, AND SYNTHETIC FERTILIZER USE, WE CAN PROTECT OUR NATION’S GRASSLANDS AND LIMIT FUTURE GREENHOUSE GAS EMISSIONS.  AS BUSINESS DEVELOPMENT MANAGER, YOU WILL BE RESPONSIBLE FOR SOURCING NEW OPPORTUNITIES FOR AGRICAPTURE’S GRASSLANDS CARBON OFFSET PROGRAM BY DEVELOPING RELATIONSHIPS WITH LAND TRUSTS AND LANDOWNERS WILLING TO CONSERVE GRASSLANDS AND GET REWARDED FOR STORING CARBON. THIS POSITION IS FIELD-BASED, WITH AN EXPECTATION OF TRAVEL TO ATTEND CONFERENCES, NETWORK, MEET PROSPECTIVE LAND TRUST PARTNERS AND LANDOWNERS, AND DEVELOP AN ECOSYSTEM OF REFERRALS. YOU WILL SPEND MOST OF YOUR TIME SECURING ACREAGE FOR NEW CARBON PROJECTS- RESEARCHING SUITABLE LAND TRUSTS AND CONTACTING THEM OR RESPONDING TO REFERRALS AND INTRODUCTIONS. YOU WILL LEAD PROJECT FEASIBILITY ANALYSIS, WORKING WITH AGRICAPTURE’S TECHNOLOGY TEAM AND A DEDICATED TECHNICAL PROJECT MANAGER, AND DIRECT ALL COMMUNICATION WITH THE LAND TRUST AND/OR LANDOWNER.    THIS ROLE REQUIRES AN INDIVIDUAL WITH EXCELLENT INTERPERSONAL AND COMMUNICATION SKILLS, A STRONG NETWORK IN THE LAND TRUST COMMUNITY IN THE FOLLOWING FOCUS STATES: TX, OK, NE, KS, ND, SD, CO AND MT, A WILLINGNESS TO TRAVEL, AND A SOLID UNDERSTANDING OF LAND CONSERVATION PRINCIPLES. THIS POSITION WILL BE STRUCTURED WITH A SALARY AND A COMMISSION-BASED ANNUAL BONUS FOR PERFORMANCE-BASED COMPENSATION.   RESPONSIBILITIES · ENGAGE AND EDUCATE LAND TRUST COMMUNITY TO INCREASE AWARENESS OF GRASSLANDS CARBON OFFSETS AND DEVELOP STRATEGIC PARTNERSHIPS TO ENROLL LANDOWNERS.· DIRECT OUTREACH TO PRIVATE LANDOWNERS TO PROVIDE AN OVERVIEW OF THE OFFERING, INCLUDING DEVELOPMENT AND PREPARATION OF LANDOWNER INFORMATION PACKETS AND PROPOSALS.· ATTEND RELEVANT LAND TRUST/LAND CONSERVATION CONFERENCES, WORKSHOPS, AND INDUSTRY EVENTS TO GENERATE BUSINESS OPPORTUNITIES AND EDUCATE ATTENDEES.· COORDINATE RESPONSES TO LANDOWNER (OR LANDOWNER LEGAL COUNSEL) INQUIRIES REGARDING PROJECT ENROLLMENT, IN COORDINATION WITH THE LAND TRUST PARTNER AND WITH TECHNICAL ASSISTANCE FROM PROJECT MANAGER. · LEAD NEGOTIATIONS WITH LAND TRUST AND LANDOWNERS WITH INPUT FROM AGRICAPTURE LEADERSHIP.· PROVIDE REGULAR REPORTING ON PIPELINE TO ENABLE ACCURATE AND TIMELY CARBON CREDIT SALES.  SKILLS AND QUALIFICATIONS STRONG LAND TRUST NETWORK IN TARGET STATES (TX, OK, NE, KS, ND, SD, CO, AND MT)BACHELOR OR GRADUATE DEGREE IN AGRICULTURE, NATURAL RESOURCE CONSERVATION, OR RELATED FIELD.MINIMUM OF FIVE YEARS’ PROFESSIONAL WORK EXPERIENCE.UNDERSTANDING OF, OR EXPERIENCE WITH, VOLUNTARY CARBON MARKETS IS A PLUS.UNDERSTANDING OF ECOLOGICAL CONCEPTS IN LAND CONSERVATION, AND A BASIC PROFICIENCY WITH ARC GIS, GOOGLE EARTH AND/OR OTHER MAPPING SOFTWARE. DEMONSTRATED ABILITY TO WORK INDEPENDENTLY, SET PRIORITIES, MANAGE TIME, REMAIN FLEXIBLE AND COMPOSED UNDER PRESSURE, AND DEVOTE ADEQUATE ATTENTION TO DETAIL TO MAINTAIN AN EFFICIENT AND ORGANIZED WORKLOAD INVOLVING MULTIPLE PROJECTS. ENTHUSIASM TO WORK IN AN ENTREPRENEURIAL ENVIRONMENT, A “SELF-STARTER” ATTITUDE. EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS, AND COMFORT WITH ONLINE VIDEO PRESENTATIONS, SUCH AS ZOOM OR TEAMS.PROFICIENCY WITH STANDARD PC COMPUTER SOFTWARE, INCLUDING MS WORD, EXCEL, POWERPOINT, AND ADOBE PRODUCTS. BENEFITS· 100% OF EMPLOYEE MEDICAL PREMIUMS COMPANY PAID· EMPLOYER HSA CONTRIBUTION· COVERAGE FOR DENTAL, VISION, DISABILITY, AND LIFE INSURANCE · IDENTITY THEFT AND PREPAID LEGAL COVERAGE OPTIONS AVAILABLE · COMPETITIVE PAY· TIME AWAY: FLEXIBLE PTO AND PAID HOLIDAYS · PARENTAL LEAVE· 401K WITH COMPANY MATCH · ALLOWANCE FOR OFFICE EQUIPMENT  \nAGRICAPTURE IS COMMITTED TO CREATING A DIVERSE ENVIRONMENT AND IS PROUD TO BE AN EQUAL-OPPORTUNITY EMPLOYER. AGRICAPTURE RECRUITS, EMPLOYS, TRAINS, COMPENSATES, AND PROMOTES REGARDLESS OF RACE, COLOR, RELIGION, GENDER, GENDER IDENTITY OR EXPRESSION, SEXUAL ORIENTATION, NATIONAL ORIGIN, GENETICS, DISABILITY, AGE, OR VETERAN STATUS. ",
    "job_skill_set": [
      "Google Earth",
      "MS Word",
      "Excel",
      "PowerPoint",
      "communication",
      "interpersonal skills",
      "networking",
      "time management",
      "flexibility",
      "attention to detail",
      "self-starter",
      "independent work",
      "pressure management",
      "entrepreneurial mindset",
      "land trust network",
      "agriculture",
      "natural resource conservation",
      "voluntary carbon markets",
      "ecological concepts",
      "ARC GIS",
      "mapping software",
      "Adobe products"
    ],
    "short_keywords": [
      "adobe",
      "agriculture",
      "arc",
      "attention",
      "business",
      "businessdevelopment",
      "carbon",
      "communication",
      "concepts",
      "conservation",
      "detail",
      "development",
      "earth",
      "ecological",
      "entrepreneurial",
      "excel",
      "flexibility",
      "gis",
      "google",
      "grasslands",
      "independent",
      "interpersonal",
      "land",
      "management",
      "manager",
      "mapping",
      "markets",
      "mindset",
      "ms",
      "natural",
      "network",
      "networking",
      "powerpoint",
      "pressure",
      "products",
      "resource",
      "selfstarter",
      "skills",
      "software",
      "time",
      "to",
      "trust",
      "voluntary",
      "word",
      "work"
    ]
  },
  {
    "job_id": "3902861623",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "SALES | BUSINESS DEVELOPMENT MANAGER | IT STAFFING\nTHIS BUSINESS DEVELOPMENT MANAGER WILL BE SUPPORTING ONE OF THE TOP ACCOUNTS IN ALL OF AKKODIS.\nTHIS WILL BE A HYBRID ROLE WITH A MIX OF WORK-FROM-HOME AND ON-SITE CLIENT VISITS. CANDIDATES MUST BE ABLE TO COMMUTE TO CLIENT SITES WITHIN THE MARKET. CANDIDATES WILL BE REQUIRED TO HAVE ON-SITE CLIENT VISITS IN THE RICHMOND, VA AREA AND MUST BE WITHIN A COMMUTABLE DISTANCE. CANDIDATES WILL BE SUPPORTING A HIGH-PROFILE CLIENT WITHIN THE FINANCIAL SECTOR, SO ANY EXPERIENCE SELLING INTO THIS INDUSTRY IS HIGHLY DESIRABLE!\nWHAT YOU’LL BE DOINGREACHING OUT TO NEW AND EXISTING CLIENTS IN ORDER TO BUILD STRONG LONG-TERM BUSINESS RELATIONSHIPSHOLD INTAKE MEETINGS WITH CLIENTS TO UNDERSTAND THEIR IT STAFFING NEEDS, SET EXPECTATIONS AROUND THEIR CONTRIBUTIONS TO THE PARTNERSHIP, EXPLAIN THE SERVICES OF AKKODIS, AND WORK WITH THEM TO DEVELOP FEASIBLE, CREATIVE SOLUTIONS TO THEIR BUSINESS NEEDSWORK CLOSELY WITH THE RECRUITMENT DELIVERY TEAMS TO ENSURE THEY UNDERSTAND CLIENT REQUIREMENTS AND DELIVER QUALIFIED CANDIDATES IN A TIMELY MANNERINCREASE AKKODIS’ MARKET SHARE IN THE REGION OR CLIENT PORTFOLIOLEAD OR ATTEND TEAM MEETINGS TO ENSURE THE TEAM HAS THE MOST UP-TO-DATE INFORMATION, PROVIDE CLIENT FEEDBACK, AND PRIORITIZE ACCORDINGLYCROSS-SELL OTHER AKKODIS AND ADECCO GROUP SERVICESCONSTANTLY LEARN CURRENT EMERGING TECHNOLOGY TO EFFECTIVELY ADVISE CLIENTS AND RECRUITMENT DELIVERY TEAMS\nMINIMUM EDUCATION & EXPERIENCE REQUIREMENTS:BACHELOR'S DEGREE IN BUSINESS OR A RELATED FIELD WITH A MINIMUM OF TWO (2) YEARS OF SALES-RELATED EXPERIENCE IS REQUIRED.PREVIOUS EXPERIENCE IN THE STAFFING AND/OR HUMAN RESOURCES SOLUTIONS INDUSTRIES IS HIGHLY DESIRABLE.WILLINGNESS AND ABILITY TO TRAVEL AS MUCH AS 50% PER WEEK, DEPENDING ON THE TERRITORY IS REQUIRED. MAINTAINING RELIABLE TRANSPORTATION IS ALSO REQUIRED.EXPERIENCE WORKING WITH THE FOLLOWING WILL BE A PLUS: MSP, SERVICES, RPO, STAFF AUG\nKNOWLEDGE, SKILLS & ABILITIES REQUIREMENTS:ABILITY TO COMMUNICATE EFFECTIVELY, VERBALLY AND IN WRITING.ABILITY TO ESTABLISH AND MAINTAIN EFFECTIVE WORKING RELATIONSHIPS.ABILITY TO ADAPT TO CHANGES IN THE BUSINESS ENVIRONMENT QUICKLY.ABILITY TO FOCUS ON CLIENT NEEDS WITH A COMMITMENT TO QUALITY AND CUSTOMER SERVICE.ABILITY TO PRIORITIZE, ORGANIZE, AND PERFORM MULTIPLE WORK ASSIGNMENTS SIMULTANEOUSLY WHILE MEETING DEADLINES.ABILITY TO IDENTIFY AND RESOLVE PROBLEMS THROUGH RECOMMENDING AND IMPLEMENTING CREATIVE SOLUTIONS.ABILITY TO DEMONSTRATE BUSINESS ACUMEN AND MARKET INSIGHT.KNOWLEDGE OF AND THE ABILITY TO UTILIZE CUSTOMER RELATIONSHIP MANAGEMENT SYSTEMS AND/OR RELATED TOOLS.KNOWLEDGE OF CURRENT SALES TRENDS, BEST PRACTICES, AND METHODOLOGIES WITHIN THE STAFFING AND WORKFORCE SOLUTIONS INDUSTRIES.PROFICIENT WITH MICROSOFT OFFICE PRODUCTS, INCLUDING WORD, EXCEL, POWERPOINT, AND OUTLOOK.\nABOUT AKKODIS - WE MAKE EXCEPTIONAL CONNECTIONSTO SUCCEED IN THE COMPLEX WORLD OF TECHNOLOGY, YOU NEED EXCEPTIONAL CONNECTIONS - TO THE RIGHT EXPERTS, THE RIGHT OPPORTUNITIES, AND THE RIGHT ANSWERS. YOU'LL FIND AKKODIS RIGHT IN THE CENTER OF THIS EVER-CHANGING TECHNOLOGICAL WORLD - UNCOVERING OPPORTUNITIES AND CONNECTING POSSIBILITIES.\nAS A GLOBAL PROVIDER OF IT STAFFING SERVICES AND THE SECOND LARGEST IN NORTH AMERICA, AKKODISCONNECTS THE VERY BEST IT PROFESSIONALS TO GREAT OPPORTUNITIES AT LEADING COMPANIES. AND WE DO IT EVERY SINGLE DAY - FOR BOTH TEMPORARY AND PERMANENT ASSIGNMENTS AND ACROSS VIRTUALLY ALL INDUSTRIES. WE USE OUR INSIGHT, FLEXIBILITY, AND EXPANDED RESOURCES TO ANTICIPATE THE NEEDS OF LEADING TECH COMPANIES AND HELP THEM MAKE EXCEPTIONAL CONNECTIONS WITH TOP TECH TALENT.\nSUCCESS IS ABOUT MAKING THE RIGHT CONNECTIONS BETWEEN PEOPLE, SOLUTIONS, AND OBJECTIVES. WITH AKKODIS, YOU CAN TAKE A STRATEGIC APPROACH TO BOOST PERFORMANCE THROUGH AN OPTIMAL MIX OF INTERNAL STAFF, OUTSIDE CONSULTING RESOURCES, AND PROJECT OUTSOURCING. AND BECAUSE WE TAKE THE TIME TO PROPERLY UNDERSTAND THE NEEDS OF OUR CLIENTS AND CANDIDATES, WE CAN HELP THEM MAKE EXCEPTIONAL CONNECTIONS AND ACHIEVE GREATER LEVELS OF SUCCESS.\nYES, THE WORLD OF TECHNOLOGY IS A COMPLEX PLACE. BUT FROM OUR PERSPECTIVE, WE SEE THINGS CLEARLY.\nWHY CHOOSE US?IT’S AN EXCITING TIME TO BE PART OF OUR TEAM. WE’RE PROUD TO BE A GLOBAL THOUGHT LEADER AND CARE ABOUT DOING THE BEST JOB WE CAN TO ENSURE BETTER FUTURES FOR EVERYONE. WE DO THIS BY BUILDING OUR FUTURE@WORK STRATEGY AS A UNITED TEAM OF 30,000+ COLLEAGUES WITH A COLLECTIVE SPIRIT WORKING IN OVER 60 COUNTRIES GLOBALLY.\nYOU’LL HAVE THE OPPORTUNITY TO GROW ACROSS A VARIETY OF INTERESTING JOBS AND CAREERS OVER OUR EXTENSIVE PORTFOLIO OF GLOBAL BRANDS. WE EMPOWER OUR COLLEAGUES TO WORK IN THE SMARTEST, MOST EFFICIENT WAYS TO ACHIEVE TOTAL BALANCE BETWEEN THE DEMANDS OF THEIR JOBS AND THEIR LIVES. THAT’S WHY WE GIVE YOU THE AUTONOMY AND SUPPORT YOU NEED TO WORK IN THE WAY THAT MAKES YOU MOST PRODUCTIVE, AGILE, CONFIDENT, AND INSIGHTFUL.\nPUTTING PEOPLE FIRST, PIONEERING WITH A COLLECTIVE SPIRIT, AND ALWAYS ADVANCING WITH A GROWTH MINDSET - THAT’S WHAT WE STAND FOR AT THE ADECCO GROUP. HERE, WE ARE ALL INDIVIDUALS WITH A UNIQUE PERSPECTIVE ON THE WORLD WE LIVE IN. THAT’S WHAT MAKES US STRONGER. WHOEVER YOU ARE AND WHATEVER YOUR BACKGROUND, YOU CAN BE YOURSELF. SO, WE AIM TO BUILD ON THE ATTRIBUTES THAT MAKE YOU, YOU. WE OFFER A RANGE OF WORLD-CLASS RESOURCES FOR UPSKILLING AND DEVELOPMENT, SATISFYING YOUR CURIOSITY WHILE SHARING SKILLS, KNOWLEDGE, AND EXPERTISE TO GROW TOGETHER.\nDO YOU WANT TO MAKE AN IMPACT WHERE IT MATTERS MOST? APPLY NOW!\nA JOURNEY TO BRING OUT THE BEST IN YOUWE BELIEVE THAT HAVING AN UNDERSTANDING OF THE HIRING PROCESS HELPS YOU TO PREPARE, FEEL, AND BE, AT YOUR BEST. AS A GLOBAL, MULTI-BRAND ORGANIZATION WITH MULTIPLE DIFFERENT ROLES, OUR APPLICATION PROCESS CAN VARY.\nON OUR CAREER SITE, YOU WILL FIND SOME OF THE KEY STEPS YOU CAN EXPECT TO GUIDE YOU ALONG THE WAY.AS ONE OF THE WORLD’S LARGEST EMPLOYERS, WE BELIEVE IN TALENT, NOT LABELS, AND FOCUS ON THE DIVERSE AND UNIQUE SKILLS OUR PEOPLE BRING. WE SEEK TO FOSTER A CULTURE OF BELONGING AND PURPOSE, AN ENVIRONMENT WHERE EVERYONE CAN THRIVE AND FEEL ENGAGED, AND WHERE DIFFERENCE IS RESPECTED AND VALUED. OUR COMMITMENT TO EQUITY, EQUAL OPPORTUNITY, INCLUSION, AND DIVERSITY IS PART OF OUR BROADER COMMITMENT TO RESPECTING FUNDAMENTAL HUMAN RIGHTS ACROSS OUR VALUE CHAIN. THE ADECCO GROUP IS PROUD TO BE AN EQUAL OPPORTUNITY EMPLOYER.\nEQUAL OPPORTUNITY EMPLOYER/VETERANS/DISABLEDTHE COMPANY WILL CONSIDER FOR EMPLOYMENT QUALIFIED APPLICANTS WITH ARREST AND CONVICTION RECORDSTHE COMPANY MAY REQUIRE PROOF OF COVID-19 VACCINATION AT THE TIME OF HIRE BASED ON CLIENT POLICIES OR CERTAIN REGULATORY REQUIREMENTS. AS SUCH, TAG MAY REQUIRE YOU TO REPORT YOUR COVID-19 VACCINATION STATUS AT THE TIME OF HIRE UNLESS PROHIBITED BY STATE LAW. THE COMPANY WILL CONSIDER REQUESTS FOR EXEMPTION BASED ON MEDICAL/DISABILITY OR RELIGIOUS REASONS, OR ADDITIONAL REASONS IF PERMITTED BY STATE LAW.\nSALARY WILL BE DETERMINED BASED ON EXPERIENCE, EDUCATION, GEOGRAPHIC LOCATION, AND OTHER FACTORS.\nBENEFIT OFFERINGS FOR FULL-TIME EMPLOYMENT MAY INCLUDE MEDICAL, DENTAL, VISION, TERM LIFE INSURANCE, SHORT-TERM AND LONG-TERM DISABILITY, ADDITIONAL VOLUNTARY BENEFITS, COMMUTER BENEFITS, WELLNESS PLANS, AND REIMBURSEMENT AND RETIREMENT PROGRAMS. AVAILABLE PAID LEAVE MAY INCLUDE PAID TIME OFF, PARENTAL LEAVE, AND HOLIDAY PAY.",
    "job_skill_set": [
      "Sales",
      "Business Development",
      "Customer Relationship Management (CRM) Systems",
      "Market Insight",
      "Problem Solving",
      "Emerging Technology Knowledge",
      "Recruitment Delivery",
      "Communication",
      "Relationship Building",
      "Adaptability",
      "Customer Service Orientation",
      "Time Management",
      "Team Collaboration",
      "Creative Solutions Development",
      "Business Acumen",
      "Organizational Skills",
      "Feedback Provision",
      "IT Staffing",
      "Microsoft Office (Word, Excel, PowerPoint, Outlook)",
      "Staffing Solutions"
    ],
    "short_keywords": [
      "acumen",
      "adaptability",
      "building",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "creative",
      "crm",
      "customer",
      "delivery",
      "development",
      "emerging",
      "excel",
      "feedback",
      "insight",
      "it",
      "knowledge",
      "management",
      "manager",
      "market",
      "microsoft",
      "office",
      "organizational",
      "orientation",
      "outlook",
      "powerpoint",
      "problem",
      "provision",
      "recruitment",
      "relationship",
      "sales",
      "service",
      "skills",
      "solutions",
      "solving",
      "staffing",
      "systems",
      "team",
      "technology",
      "time",
      "word"
    ]
  },
  {
    "job_id": "3903840817",
    "job_title": "Business Development Manager - Defense Segment",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "OVERVIEW\n\nMOLECULAR PRODUCTS, INC. (MPI) IS A FAST-GROWING CHEMICAL MANUFACTURING AND DISTRIBUTION COMPANY THAT IS DEDICATED TO MAKING THE WORLD A SAFER, HEALTHIER AND MORE PRODUCTIVE PLACE BY PROVIDING PURE AIR TECHNOLOGIES . WE SERVE CUSTOMERS IN MULTIPLE SECTORS INCLUDING DEFENSE, GREEN ENERGY, HEALTHCARE AND DIVERSIFIED INDUSTRIAL WITH HIGHLY ENGINEERED SOLUTIONS THAT MEET OR EXCEED INTENSE REGULATORY STANDARDS FOR AIR PURIFICATION. MPI IS LOCATED IN LOUISVILLE, COLORADO (20 MILES FROM BOULDER) AND HAS AN AGGRESSIVE GROWTH STRATEGY, RELYING ON RAPID ORGANIC GROWTH AUGMENTED BY ACQUISITIONS WHICH WE EXPECT TO DOUBLE SALES AND PROFIT OVER THE NEXT 3-YEAR PERIOD.\n\nWE ARE SEEKING A BUSINESS DEVELOPMENT MANAGER TO GENERATE NEW BUSINESS REVENUE DEFENSE SECTOR CHANNEL. THE PRIMARY FOCUS OF THIS ROLE IS GENERATING NEW SALES, SUCCESSFUL CONTRACT BIDDING AND ACCOUNT MANAGEMENT OF DEFENSE CUSTOMERS WITH THE OBJECTIVE OF ESTABLISHING AND GROWING ACCOUNTS FOR RESPIRATORY PRODUCTS.\n\nTHE DEFENSE BUSINESS DEVELOPMENT MANAGER (DBDM) WILL WORK WITH THE SUPPORT OF LOUISVILLE AND INTERNATIONAL TEAM MEMBERS TO ACHIEVE TARGETED GROWTH IN SALES AND PRODUCT RANGE TO NEW AND EXISTING CUSTOMERS THROUGH DIRECT SALES, WINNING DOD CONTRACTS, WINNING CONTRACTS FOR INTERNATIONAL DEFENSE OPPORTUNITIES AND THROUGH DISTRIBUTED SALES CHANNELS. THE DBDM WILL BE RESPONSIBLE FOR PARTICIPATING IN THE DEVELOPMENT OF STRATEGIES TO DEVELOP NEW OPPORTUNITIES AND ROUTES TO MARKET WHILE SETTING A PATH TO SUSTAINABLE, PROFITABLE BUSINESS WITH NEW ACCOUNTS, MAJOR TERRITORY CUSTOMERS AND PROSPECTS.\n\nREPORTS TO: COMMERCIAL DIRECTOR\n\n TERRITORY: AMERICAS BUT SUPPORTING OTHER TERRITORIES AS NEEDED  PRODUCTS: OXYGEN, ACTIVATED CARBON, SODA LIME  KEY MARKETS: MILITARY AND FIRST RESPONDER, CBRN FILTRATION, INDIVIDUAL PROTECTION AND COLPRO FILTERS  TRAVEL: UP TO 40% TRAVEL IS REQUIRED FOR CONFERENCES, EXHIBITIONS, CUSTOMER MEETINGS, AND COMPANY TRAINING \n\nRESPONSIBILITIES\n\n KEY DELIVERABLES: \n\n NEW BUSINESS/NEW PRODUCT SALES REVENUE GENERATION AND GROWTH TO TARGETS  SUCCESSFUL MANAGEMENT OF NEW BUSINESS PIPELINE FROM PROSPECTING-TO LEADS-TO CLOSE  ORGANIC GROWTH OF EXISTING ACCOUNTS  MARGINS CONSISTENT WITH COMPANY POLICIES  RESPECTED COMMERCIAL REPRESENTATIVE FOR THE COMPANY \n\n KEY CRITERIA FOR SUCCESS: \n\n UNDERSTANDING OF MILITARY MARKET (SPECIFICALLY SPECIAL OPERATIONS AND COMBAT CRITICAL CARE).  ABILITY TO EVALUATE MARKETS AND ACCOUNTS AT STRATEGIC AND TACTICAL SCALES, RECOGNIZE FEASIBLE COURSES OF ACTION AND DEVELOP AND THEN EXECUTE ACTION PLANS  ABILITY TO DEVELOP INFLUENTIAL COMMERCIAL RELATIONSHIPS AT ALL LEVELS OF DECISION-MAKING WITH GOVERNMENT PROGRAM AND TECHNICAL PERSONNEL, PROSPECTS, AND CUSTOMERS.  ABILITY TO IDENTIFY AND UNDERSTAND CUSTOMER NEEDS AND ADDRESS RISK.  ABILITY TO NEGOTIATE AND PERSUADE – SELL VALUE NOT PRICE.  ABILITY TO IDENTIFY AND RELATE VALID MARKET INFORMATION.  SALES FUNNEL PACE MANAGEMENT – URGENCY AND ABILITY TO OVERCOME OBSTACLES.  PERSONAL DRIVE TO DELIVER EXCELLENCE.  PROFESSIONAL AND EFFECTIVE COMMUNICATION ACROSS BROAD INTERNAL AND EXTERNAL AUDIENCES WITH THE ABILITY TO LISTEN AND EMPATHIZE WITH PEOPLE  COLLABORATIVE AND ENERGIZED BY BEING PART OF A GLOBAL TEAM RATHER THAN A LONE WOLF \n\n KEY OBJECTIVES: \n\n GENERATE NEW BUSINESS FOR NEW AND EXISTING PRODUCT LINES  SUCCESSFULLY EXECUTE A CHANNEL PLAN FOR DISTRIBUTION OF SOLID OXYGEN PRODUCTS TO THE US DOD AND OUTSIDE THE US THROUGHOUT KEY GEOGRAPHIC MARKETS IN THE AMERICAS.  ESTABLISH AGREEMENTS WITHUS DISTRIBUTORS FOR THE DOD MARKET WITH STRONG ACCESS TO ECAT, EMALL, GSA, TLS, MEDICAL PRIME VENDOR, AND OTHER US GOVERNMENT PURCHASING SCHEDULES AS APPROPRIATE.  DEVELOP DISTRIBUTION AND/OR AGENT RELATIONSHIPS AND ESTABLISH AGREEMENTS WITH CHANNEL PARTNERS IN THE KEY AMERICAS GEOGRAPHIC MARKETS SUCH AS CANADA, MEXICO, BRAZIL, CHILE, AND PERU.  WORK WITH THE COMMERCIAL DIRECTOR TO DEVELOP AND EXECUTE FUTURE STRATEGY FOR OTHER US GOVERNMENT AGENCIES.  ASSUME ASSIGNED GLOBAL AND KEY ACCOUNTS, TAKE INITIATIVE AND DRIVE GROWTH \n\nQUALIFICATIONS\n\n MINIMUM 5-YEARS OF DEFENSE SALES EXPERIENCE AND US DOD CONTRACT BIDDING WITH TRACK RECORD OF SUCCESSFUL GROWTH  BACHELOR’S DEGREE OR 10-YEARS OR MORE US DOD ACTIVE-DUTY MILITARY EXPERIENCE  EFFECTIVE WRITTEN AND VERBAL COMMUNICATION  ABILITY TO TRAVEL  BUSINESS ACUMEN \n\n DESIRED EDUCATION/EXPERIENCE: \n\n SOME HIGHER MATH, CHEMISTRY AND/OR PHYSICS  BACKGROUND INCLUDING MILITARY MEDICAL MARKET (SPECIFICALLY SPECIAL OPERATIONS AND COMBAT CRITICAL CARE), OR 4 YEARS RELEVANT NEW BUSINESS DEVELOPMENT EXPERIENCE FOR DEFENSE, HEALTHCARE, INDUSTRIAL, OR SAFETY PRODUCTS. \n\nMORE ABOUT US\n\nMOLECULAR PRODUCTS IS PART OF FILTRATION GROUP. FILTRATION GROUP IS A GLOBAL MARKET-LEADING PROVIDER OF FILTRATION CONSUMABLES THAT ARE DESIGNED TO DRIVE INNOVATION AND DELIVER SOLUTIONS ACROSS A BROAD SPECTRUM OF APPLICATIONS AND END-MARKETS, WITH A FOCUS ON LIFE SCIENCES, INDOOR AIR QUALITY AND INDUSTRIAL TECHNOLOGIES.\n\nWITH A GLOBAL WORKFORCE OF NEARLY 10,000 DEDICATED TEAM MEMBERS AND A FOOTPRINT THAT SPANS 27 COUNTRIES, WE ARE COMMITTED TO PARTNERING CLOSELY WITH OUR CUSTOMERS TO FURTHER OUR MISSION TO MAKE THE WORLD SAFER, HEALTHIER AND MORE PRODUCTIVE.\n\nCULTIVATING TALENT AND BUILDING STRONG TEAMS ARE CRITICAL TO OUR SUCCESS. WE KNOW THAT FULFILLING OUR MISSION IS ONLY POSSIBLE WHEN WE FOSTER AN ENTREPRENEURIAL CULTURE BUILT ON A FOUNDATION OF TRUST, IN WHICH OUR LEADERS EXHIBIT A STRONG BIAS FOR ACTION.",
    "job_skill_set": [
      "business acumen",
      "market evaluation",
      "higher math knowledge",
      "communication",
      "relationship building",
      "collaboration",
      "problem solving",
      "personal drive",
      "empathy",
      "strategic thinking",
      "influence",
      "defense sales experience",
      "US DOD contract bidding",
      "negotiation",
      "sales funnel management",
      "chemistry knowledge",
      "physics knowledge"
    ],
    "short_keywords": [
      "acumen",
      "bidding",
      "building",
      "business",
      "businessdevelopment",
      "chemistry",
      "collaboration",
      "communication",
      "contract",
      "defense",
      "development",
      "dod",
      "drive",
      "empathy",
      "evaluation",
      "experience",
      "funnel",
      "higher",
      "influence",
      "knowledge",
      "management",
      "manager",
      "market",
      "math",
      "negotiation",
      "personal",
      "physics",
      "problem",
      "relationship",
      "sales",
      "segment",
      "solving",
      "strategic",
      "thinking",
      "us"
    ]
  },
  {
    "job_id": "3904416271",
    "job_title": "Business Development Director",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "THE\n\nBUSINESS DEVELOPMENT DIRECTOR\n\nIS RESPONSIBLE FOR HOSPITAL INPATIENT AND OUTPATIENT CENSUS IN THE IRF AND/OR LTCH AND MIX THROUGH THE DESIGN AND IMPLEMENTATION OF REFERRAL PROGRAMS AND CUSTOMER SERVICE STRATEGIES. THIS POSITION OVERSEES INPATIENT ADMISSION PROCESS. THE BUSINESS DEVELOPMENT DIRECTOR MANAGES, TRAINS AND DEVELOPS HOSPITAL-WIDE BUSINESS DEVELOPMENT TEAM AND SERVES IN A SENIOR LEADERSHIP ROLE. THE BUSINESS DEVELOPMENT DIRECTOR IS RESPONSIBLE IN CREATING AN ENVIRONMENT AND CULTURE THAT ENABLES THE HOSPITAL TO FULFILL ITS MISSION BY MEETING OR EXCEEDING ITS GOALS, CONVEYING THE HOSPITAL MISSION TO ALL STAFF, HOLDING STAFF ACCOUNTABLE FOR PERFORMANCE, MOTIVATING STAFF TO IMPROVE PERFORMANCE AND BEING RESPONSIBLE FOR THE OPERATION OF THE DEPARTMENT, MEASUREMENT, ASSESSMENT AND CONTINUOUS IMPROVEMENT OF THE DEPARTMENT'S PERFORMANCE. THE BUSINESS DEVELOPMENT DIRECTOR CREATES AN ENVIRONMENT AND CULTURE THAT ENABLES THE HOSPITAL TO FULFILL ITS MISSION BY PROVIDING PATIENT SAFETY AND PATIENT-CENTERED TREATMENT.\n\nRESPONSIBILITIES AND TASKS\n\nREVIEWS, EVALUATES, AND MONITORS CRITICAL NUMBERS AND PROGRESS TOWARDS GOALS.\n\nTAKES ACTIONS TO REVERSE NEGATIVE ADMISSION AND DISCHARGE VOLUME TRENDS. IMPLEMENTS PLANS TO ENSURE MARKETING EFFECTIVENESS. USES MONTHLY DATA TO MEASURE PROGRESS TOWARDS GOALS. MONITORS AND MEASURES VOLUME, CASE MIX GROWTH, CMS %, PAYER MIX %, AND FUNCTIONAL OUTCOMES OF PATIENTS TO ENSURE QUALITY PRODUCT LINES. \n\nUNDERSTANDS THE VOLUME IMPACT ON EBITDA TO MEET THE FINANCIAL OF THE BUSINESS.\n\nUNDERSTANDS THE OPERATIONAL AND FINANCIAL METRICS.\n\nCOMMUNICATES OPPORTUNITY AND THREATS IN THE MARKETPLACE TO SENIOR MANAGEMENT.\n\nMANAGES ALL MARKETING OPERATIONS, INCLUDING HIRING AND RECRUITING STAFF.\n\nEDUCATES MARKETING STAFF ON TOOLS, BUDGET, SALES SKILLS, AND TERRITORY MANAGEMENT TO ACHIEVE VOLUME GOALS. EFFECTIVELY AND APPROPRIATELY COMMUNICATES FINANCIAL DATA AND OPERATIONAL INDICATORS TO MARKETING AND OTHER RELEVANT STAFF. \n\nUNDERSTANDS AND MANAGES ADMISSION PROCESSES.\n\nMANAGES INSURANCE VERIFICATION, PRE-CERTIFICATION REQUIREMENTS, BED CONTROL, HOSPITAL DISCHARGES, AND BARRIERS. UNDERSTANDS AND USES CLINICAL KNOWLEDGE AND RESOURCES TO DETERMINE APPROPRIATENESS OF ADMISSION. \n\nUNDERSTANDS AND MANAGES THE REIMBURSEMENT SYSTEM.\n\nMANAGES THE REIMBURSEMENT SYSTEM AS IT RELATES TO VOLUME IMPACT, APPROPRIATE UTILIZATION OF RESOURCES, AND LOS MANAGEMENT TO PROMOTE QUALITY OUTCOMES. \n\nIDENTIFIES NEW AND REPACKAGING EXISTING PRODUCT LINES IN COLLABORATION WITH HOSPITAL LEADERSHIP.\n\nASSIGNS TERRITORIES TO MARKETING TEAM AND REALIGNS AS INDICATED BY KEY PERFORMANCE INDICATORS.\n\nDRIVES GRASS ROOTS EFFORTS AS DEEMED NECESSARY TO INDUSTRY CONDITIONS. \n\nCOMMUNICATES EFFECTIVELY WITH REFERRAL SOURCES TO MARKET AND EDUCATE PRODUCT LINES.\n\nDIFFERENTIATES COMPANY SERVICES FROM COMPETITION. DEVELOPS MARKETING COLLATERAL AND ADVERTISES IN CONJUNCTION WITH CORPORATE SUPPORT THAT MEETS THE NEEDS OF THE MARKET. \n\nPLANS AND COORDINATES MARKETING, MEDIA COVERAGE, AND PUBLIC RELATIONS FUNCTIONS TO INCREASE VOLUME.\n\nUSES CRM FOR CREATING, TRACKING, AND MONITORING LIAISON TERRITORY MANAGEMENT, REFERRALS AND ACTIVITIES.\n\nCOMPLETES MANDATORY TRAINING AND COURSES REQUIRED BY COMPLETION DATE.\n\nBUILDS 30 DAYS OF ACTIVITIES IN ADVANCE.\n\nCOMPLETES PRE-CALL PLANNING ON MINIMUM OF 95% OF ACTIVITIES (AS DESCRIBED IN THE RDS SALES CYCLE).\n\nRESULTS AND POST CALL FOLLOW-UP ENTERED ON MINIMUM OF 95% OF ALL ACTIVITIES.\n\nQUALIFICATIONS\n\nLICENSE OR CERTIFICATION:\n\nDRIVER'S LICENSE AND ACCEPTABLE DRIVING RECORD ACCORDING TO COMPANY POLICY.\n\nMINIMUM QUALIFICATIONS:\n\nMINIMUM 2 YEARS EXPERIENCE AS A MARKETING REPRESENTATIVE, OR NURSE LIAISON IN A HEALTHCARE ENVIRONMENT.\n\nBACHELOR'S DEGREE IN RELATED AREA PREFERRED.\n\nSUCCESSFUL TRACK RECORD IN LEADING, MANAGING OR DIRECT SALES AND MARKETING, PREFERABLY IN HEALTHCARE ENVIRONMENT.\n\nPHYSICIAN RELATIONS, CASE MANAGER, MANAGED CARE, KNOWLEDGE OF LOCAL HEALTHCARE MARKET PREFERRED.\n\nABOUT US\n\nAS A NATIONAL LEADER IN POST-ACUTE CARE, ENCOMPASS HEALTH (NYSE: EHC) OFFERS FACILITY-BASED PATIENT CARE THROUGH ITS NETWORK OF INPATIENT REHABILITATION HOSPITALS. WITH A NATIONAL FOOTPRINT THAT SPANS 157 HOSPITALS IN 37 STATES AND PUERTO RICO, THE COMPANY IS COMMITTED TO DELIVERING HIGH-QUALITY, COST-EFFECTIVE REHABILITATION. ENCOMPASS HEALTH IS RANKED AS ONE OF FORTUNE'S 100 BEST COMPANIES TO WORK FOR AND MODERN HEALTHCARE'S BEST PLACES TO WORK.\n\nBENEFITS\n\nENJOY COMPETITIVE COMPENSATION AND BENEFITS THAT START DAY ONE OF EMPLOYMENT, INCLUDING:\n\nAFFORDABLE MEDICAL, DENTAL AND VISION PLANS PROVIDED TO MEET THE NEEDS OF FULL AND PART-TIME EMPLOYEES AND THEIR FAMILIES. GENEROUS PAID TIME OFF THAT INCREASES WITH TENURE. TUITION REIMBURSEMENT AND CONTINUING EDUCATION OPPORTUNITIES. AN EMPLOYEE ASSISTANCE PROGRAM FOR COUNSELING AND MENTAL HEALTH NEEDS. COMPANY-MATCHING 401(K) AND EMPLOYEE STOCK-PURCHASE PLANS. FLEXIBLE SPENDING AND HEALTH SAVINGS ACCOUNTS. \n\nTO LEARN MORE ABOUT US, PLEASE VISIT US ONLINE AT\n\nENCOMPASSHEALTH.COM\n\nOR\n\nCAREERS.ENCOMPASSHEALTH.COM\n\nCONNECT WITH US:\n\nEQUAL OPPORTUNITY EMPLOYER",
    "job_skill_set": [
      "marketing",
      "business development",
      "data analysis",
      "financial metrics",
      "healthcare knowledge",
      "customer service strategies",
      "leadership",
      "communication",
      "team management",
      "problem solving",
      "motivation",
      "strategic planning",
      "collaboration",
      "accountability",
      "adaptability",
      "CRM software",
      "admission processes",
      "reimbursement systems",
      "staff training"
    ],
    "short_keywords": [
      "accountability",
      "adaptability",
      "admission",
      "analysis",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "crm",
      "customer",
      "data",
      "development",
      "director",
      "financial",
      "healthcare",
      "knowledge",
      "leadership",
      "management",
      "marketing",
      "metrics",
      "motivation",
      "planning",
      "problem",
      "processes",
      "reimbursement",
      "service",
      "software",
      "solving",
      "staff",
      "strategic",
      "strategies",
      "systems",
      "team",
      "training"
    ]
  },
  {
    "job_id": "3904082300",
    "job_title": "Account Executive, New Business Development, HEOR & Market Access",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ACCOUNT EXECUTIVE, NEW BUSINESS DEVELOPMENT, HEOR & MARKET ACCESS JOB SUMMARYOPEN HEALTH'S BUSINESS DEVELOPMENT TEAM IS LOOKING TO ADD A TEAM MEMBER TO SUPPORT GROWTH EFFORTS IN THE HEALTH ECONOMICS & OUTCOMES RESEARCH (HEOR), REAL-WORLD EVIDENCE (RWE), AND MARKET ACCESS PRACTICE. THE ROLE WILL BE FOCUSED ON OUTBOUND LEAD GENERATION. ESSENTIAL DUTIES & RESPONSIBILITIESIDENTIFYING KEY CLIENT DECISION MAKERS AND PROACTIVELY TARGETING THEM TO GENERATE LEADS ACROSS MULTIPLE DISCIPLINES (INCLUDING PROCUREMENT, SCIENTIFIC, AND CLIENT LEADERSHIP) AND TO SUPPORT EVIDENCE & ACCESS (E&A) BUSINESS GROWTH OWNING PIPELINE GENERATION PERFORMANCE TO SUPPORT E&A'S ACHIEVEMENT OF ANNUAL SALES AND REVENUE GROWTH TARGETSWORKING TO QUALIFY LEADS BASED ON KEY CRITERIA TO ACCELERATE PROSPECTS THROUGH THE SALES FUNNEL PARTNERING WITH BUSINESS DEVELOPMENT DIRECTORS AND CENTERS OF EXCELLENCE (COE) PERSONNEL TO CULTIVATE OPPORTUNITIES THAT WILL LEAD TO SUCCESSFUL CONVERSION MANAGING SALESFORCE TRACKING FOR ALL LEADS GENERATED UNTIL THEY ARE ASSIGNED TO A BUSINESS DEVELOPMENT DIRECTOR OR COE CONVERSION LEADFOCUSING ON EXCELLENCE AND DELIVERY OF OUTBOUND ACTIVITY FOR THE BENEFIT OF OUR CLIENTS AND OUR BUSINESS  EXPERIENCE, SKILLS, AND QUALIFICATIONSBS, MS, PHD, PHARMD, MD, MPH, OR RELEVANT ADVANCED EDUCATION EXPERIENCE IN HEOR, RWE AND MARKET ACCESS CONSULTING & RESEARCH SERVICES TO THE BIOPHARMA (PREFERABLY), OR BIOTECH AND MED TECH SECTORS DOCUMENTED SUCCESS IN MEETING AND/OR EXCEEDING SALES OR LEAD GENERATION TARGETS EXCELLENT VERBAL & WRITTEN COMMUNICATION AND PRESENTATION SKILLS STRONG COLLABORATION AND PARTNERSHIP WORKING WITH KEY INTERNAL AND EXTERNAL STAKEHOLDERS HIGHLY ORGANIZED AND ABLE TO PRIORITIZE AND BALANCE ROLE WORKLOAD AND DEMAND THAT ALIGNS TO THE AGREED TARGETS AND PLANS STRONG PROFICIENCY IN MS365 INCLUDING POWERPOINT, EXCEL, WORD, TEAMS, OUTLOOK AND EXPERIENCE OF EFFECTIVELY UTILIZING CRM PLATFORMS TO SUPPORT AND INFORM DATA ANALYTICS AND APPROACHES REQUIRED TO ACHIEVE BUSINESS DEVELOPMENT GROWTH AND SUCCESS TRAVEL REQUIREMENTS 10% POTENTIAL GLOBAL TRAVEL ABOUT OPEN HEALTHOPEN HEALTH UNITES DEEP SCIENTIFIC KNOWLEDGE WITH WIDE-RANGING SPECIALIST EXPERTISE TO UNLOCK POSSIBILITIES THAT IMPROVE HEALTH OUTCOMES AND PATIENT WELLBEING. WORKING IN PARTNERSHIP WITH OUR CLIENTS, WE EMBRACE OUR DIFFERENT PERSPECTIVES AND STRENGTHS TO DELIVER FRESH THINKING AND SOLUTIONS THAT MAKE A DIFFERENCE. OPEN HEALTH IS A FLEXIBLE GLOBAL ORGANIZATION THAT SOLVES COMPLEX HEALTHCARE CHALLENGES ACROSS HEOR AND MARKET ACCESS, MEDICAL COMMUNICATIONS AND CREATIVE OMNICHANNEL CAMPAIGNS. WHAT WE OFFER:\n\nAS A GLOBAL ORGANIZATION, OPEN HEALTH IS COMMITTED TO SUPPORTING OUR EMPLOYEES AND THEIR FAMILIES THROUGH A COMPREHENSIVE BENEFITS PROGRAMCOMPETITIVE PAY, GENEROUS PAID VACATION AND HOLIDAYS, AND HEALTH INSURANCE PROGRAMS ACROSS ALL OUR LOCATIONSONGOING TRAINING AND DEVELOPMENT OPPORTUNITIES WHICH FOSTER AND SHAPE YOUR INDIVIDUAL CAREER PATHAN ACTIVE AND GROWING COMMITMENT TO BETTERING THE COMMUNITIES OUR EMPLOYEES CALL HOME THROUGH OUR CORPORATE SOCIAL RESPONSIBILITY PROGRAMTHE OPPORTUNITY TO THRIVE IN A GLOBAL, COLLABORATIVE ENVIRONMENT WHILE WORKING EVERY DAY TO IMPROVE HEALTH OUTCOMES AND PATIENT WELLBEINGDIVERSE, INCLUSIVE CULTURE THAT ENCOURAGES YOU TO BRING YOUR WHOLE SELF TO WORK  IF WE SOUND LIKE THE SORT OF BUSINESS ENVIRONMENT IN WHICH YOU WOULD THRIVE, THEN WE WOULD LOVE TO HEAR FROM YOU.  ",
    "job_skill_set": [
      "Sales Performance Tracking",
      "Presentation Skills",
      "Communication",
      "Collaboration",
      "Organization",
      "Problem Solving",
      "Client Relationship Management",
      "Teamwork",
      "Adaptability",
      "HEOR",
      "RWE",
      "Market Access",
      "Salesforce",
      "MS365",
      "CRM Platforms",
      "Data Analytics",
      "Lead Generation",
      "Research Services",
      "Prioritization"
    ],
    "short_keywords": [
      "access",
      "account",
      "adaptability",
      "analytics",
      "business",
      "businessdevelopment",
      "client",
      "collaboration",
      "communication",
      "crm",
      "data",
      "development",
      "executive",
      "generation",
      "heor",
      "lead",
      "management",
      "market",
      "ms365",
      "new",
      "organization",
      "performance",
      "platforms",
      "presentation",
      "prioritization",
      "problem",
      "relationship",
      "research",
      "rwe",
      "sales",
      "salesforce",
      "services",
      "skills",
      "solving",
      "teamwork",
      "tracking"
    ]
  },
  {
    "job_id": "3906092584",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "MANAGER BUSINESS DEVELOPMENT (COMP WILL BE DOE \"COMMENSURATE W/ EXPERIENCE\")\nSUMMARYREPORTING TO THE DIRECTOR OF BUSINESS DEVELOPMENT, THE BUSINESS DEVELOPMENT MANAGER PROVIDES THE BUSINESS DEVELOPMENT TEAM ONGOING SALES ACTIVITIES IN CORDIA’S WEST REGION.PRINCIPLE RESPONSIBILITIES/KEY RESULTS AREASSUPPORTS SALES AND BUSINESS DEVELOPMENT BY:CONDUCTING MARKET RESEARCH, IDENTIFYING, AND FOLLOWING UP ON NEW CUSTOMER LEADS, AND PROVIDING RECOMMENDATIONS ON SALES OPPORTUNITIESMEETING AND PRESENTING CORDIA’S OFFERINGS, PRODUCTS AND SERVICES TO POTENTIAL CUSTOMERS IN CORDIA’S WEST REGION.ATTENDING LOCAL CITY GOVERNMENT AND PARTNERSHIP COMMUNITY DEVELOPMENT MEETINGSMANAGING AND UPDATING CUSTOMER DATABASE (I.E., SALESFORCE) AS REQUIREDCOLLABORATING WITH CORDIA’S CORPORATE MARKETING DEPARTMENT ON PROJECTS, PRESENTATIONS, AND EVENTSSUPPORT CUSTOMER SERVICE ACTIVITIES AND SERVICE AGREEMENT RENEWALS AS DIRECTED BY THE BUSINESS DEVELOPMENT DIRECTOR.GENERAL OFFICE AND BUSINESS SUPPORT OBTAIN A WORKING LEVEL UNDERSTANDING OF CORDIA’S SERVICE RATES AND ASSIST IN CONDUCTING BILLING ANALYSIS TO IDENTIFY DISCREPANCIES AND ENSURE ACCURACY.ANALYZE BUDGET DATA TO PROVIDE INSIGHTS INTO VARIANCES.SUPPORTING THE ANNUAL BUDGETING PROCESS BY COMPILING SALES FORECAST DATA, COMPLETING EXCEL SHEET/WORKBOOKS AND PERFORMING NECESSARY ANALYSISCREATING AND MAINTAINING CUSTOMER AND BUSINESS REPORTS TO TRACK KPIS.COLLABORATING WITH THE TEAM ON AD-HOC PROJECTS AND OTHER BUSINESS NEEDS AND PROVIDING SOLUTIONSASSISTING WITH SPECIAL PROJECTS AND INITIATIVES AS NEEDEDWHAT WE LOOK FOR:WE ACTIVELY ENCOURAGE INDIVIDUALS FROM DIVERSE BACKGROUNDS AND EXPERIENCES TO APPLY.WE SEEK A CANDIDATE WITH AN UNWAVERING COMMITMENT TO ORGANIZATION, BOUNDLESS ENERGY, AND AN UNWAVERING PASSION FOR BEING A DEDICATED AND ENTHUSIASTIC TEAM PLAYER.WE SEEK A CANDIDATE WHO IS DETAIL-ORIENTED AND COMFORTABLE DEALING WITH COMPLEX MATTERS.PHOENIX AREA CANDIDATES PREFERRED; HOWEVER, QUALIFIED SOUTHERN CALIFORNIA CANDIDATES WILL BE CONSIDERED.REQUIREMENTSEXPERIENCE & EDUCATIONBACHELOR’S DEGREE IN BUSINESS/RELATED FIELD OF STUDY OR EQUIVALENT EXPERIENCEMUST HAVE PROFICIENCY IN MICROSOFT OFFICE PRODUCTS (EXCEL, WORD AND POWERPOINT)STRONG COMMUNICATION, INTERPERSONAL AND PRESENTATION SKILLS3 - 4 YEARS' PRIOR INDUSTRY SALES RELATED AND/OR BUSINESS DEVELOPMENT EXPERIENCEPROVEN KNOWLEDGE AND SUCCESSFUL SALES TRACK RECORDSELF-STARTER, FOCUSED, RESULTS AND GOAL-ORIENTEDEXPERIENCE AND/OR PREVIOUS EXPOSURE TO THE ENERGY INDUSTRY IS PREFERRED.WORKING CONDITIONSSOME NON-STANDARD WORKING HOURS AS REQUIRED.SOME OUT OF TOWN OVERNIGHT TRAVEL FOR EXISTING CUSTOMERS AND PROSPECTIVE CUSTOMERS VISITS, COMPANY MEETINGS AND COMPANY AND/OR VENDOR TRAININGNORMAL OFFICE ENVIRONMENTREQUIRES SOME OVERNIGHT TRAVEL IN CORDIA’S WEST REGION.OCCASIONALLY REQUIRES WEARING PERSONAL PROTECTIVE SAFETY EQUIPMENT (SAFETY GLASSES, HARD HAT, PLUGS, ETC.)OCCASIONALLY LIFTING 35 LBS. AS APPROPRIATE TO PERFORM DUTIES AND RESPONSIBILITIES.",
    "job_skill_set": [
      "Microsoft Office",
      "Excel",
      "data analysis",
      "budgeting",
      "presentation skills",
      "reporting",
      "communication",
      "interpersonal skills",
      "teamwork",
      "organization",
      "self-starter",
      "detail-oriented",
      "problem solving",
      "goal-oriented",
      "enthusiasm",
      "market research",
      "salesforce",
      "customer database management",
      "sales forecasting",
      "energy industry knowledge"
    ],
    "short_keywords": [
      "analysis",
      "budgeting",
      "business",
      "businessdevelopment",
      "communication",
      "customer",
      "data",
      "database",
      "detailoriented",
      "development",
      "energy",
      "enthusiasm",
      "excel",
      "forecasting",
      "goaloriented",
      "industry",
      "interpersonal",
      "knowledge",
      "management",
      "manager",
      "market",
      "microsoft",
      "office",
      "organization",
      "presentation",
      "problem",
      "reporting",
      "research",
      "sales",
      "salesforce",
      "selfstarter",
      "skills",
      "solving",
      "teamwork"
    ]
  },
  {
    "job_id": "3901625868",
    "job_title": "Summer Intern Business Development",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "THE COMMERCIAL SALES DEPARTMENT INVOLVES WORKING WITH SPONSORS ON A NATIONAL, REGIONAL AND LOCAL LEVEL. THE COMMERCIAL SALES DEPARTMENT FOCUSES ON FULLY DEVELOPING INTEGRATED MARKETING PARTNERSHIPS BETWEEN SPONSORS AND OUR PROPERTIES. THIS DEPARTMENT SEEKS OUTGOING, CREATIVE, HIGHLY MOTIVATED, CAN-DO INDIVIDUALS WITH GOOD COMMUNICATION SKILLS. THE COMMERCIAL SALES DEPARTMENT LOOKS FOR 2-3 INTERNS EACH SEMESTER.\nRESPONSIBILITIESTHIS POSITION WILL HELP MANAGE AND ASSIST SALES OPERATIONS FOR THE PROPERTY, ASSIST WITH CLIENT FULFILLMENT, SALES PROPOSALS, SPIRE CRM SYSTEM, RACE/GAME DAY HOSPITALITY AND CLIENT INTERACTION, AS WELL AS OTHER SPONSOR EVENTS THROUGHOUT THE YEAR UNDER THE APPOINTED ACCOUNT EXECUTIVE AND MANAGER;GET FIRST HAND EXPERIENCE FROM A SPONSORSHIP SALES PERSPECTIVE;DEVELOP SPONSORSHIP SALES IDEAS TO PITCH TO POTENTIAL PROSPECTS;RESEARCH AND IDENTIFY POTENTIAL CATEGORIES AND SPECIFIC COMPANIES WHO WOULD BE A GOOD ADDITION TO EXISTING FAMILY OF SPONSORS;ASSIST WITH DEVELOPING STANDARD AND CUSTOMIZED PROPOSALS AND CONTRACTS FOR POTENTIAL CLIENTS;DEVELOPING AND MAINTAINING CLIENT INTERACTION AND RELATIONSHIPS WITH POTENTIAL AND CURRENT SPONSORS;ASSISTING BUSINESS DEVELOPMENT EXECUTIVES WITH SALES PROPOSALS FOR EXISTING AND POTENTIAL CLIENTS; ANDDAILY OFFICE DUTIES SUCH AS ANSWERING PHONE CALLS, FILING AND DATA MANAGEMENT WOULD ALSO BE A PART OF THE POSITION.\nINTERNS MUST BE ABLE TO WORK A MINIMUM OF THREE (3) DAYS PER WEEK, OR TWENTY-FOUR (24) HOURS. WE ARE AN EQUAL OPPORTUNITY EMPLOYER AND ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, NATIONAL ORIGIN, SEX, SEXUAL ORIENTATION, AGE, DISABILITY, GENDER IDENTITY, MARITAL OR VETERAN STATUS, OR ANY OTHER PROTECTED CLASS.\nCOMPENSATION: HOURLY LOCATION: ON-SITE (MOORESVILLE, NORTH CAROLINA) REPORTS TO: COMMERCIAL SALES DEPARTMENT",
    "job_skill_set": [
      "sales operations",
      "client fulfillment",
      "data management",
      "proposal development",
      "market research",
      "contract development",
      "communication",
      "creativity",
      "motivation",
      "relationship building",
      "teamwork",
      "outgoing personality",
      "problem solving",
      "sales proposals",
      "CRM systems"
    ],
    "short_keywords": [
      "building",
      "business",
      "businessdevelopment",
      "client",
      "communication",
      "contract",
      "creativity",
      "crm",
      "data",
      "development",
      "fulfillment",
      "intern",
      "management",
      "market",
      "motivation",
      "operations",
      "outgoing",
      "personality",
      "problem",
      "proposal",
      "proposals",
      "relationship",
      "research",
      "sales",
      "solving",
      "summer",
      "systems",
      "teamwork"
    ]
  },
  {
    "job_id": "3894210676",
    "job_title": "Business Development Manager - Audio North America",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "BUSINESS DEVELOPMENT MANAGER- NORTH AMERICA \nSELF DRIVEN FOR REMOTE WORKING\nAMPHENOL AUSTRALIA PTY LTD (AMPHENOL AUDIO PRODUCT DIVISION)\nARE YOU READY FOR A NEW MOVE? READY FOR A CHANGE FROM THE TRADITIONAL 8-5 OFFICE ENVIRONMENT TO HAVE MORE FLEXIBILITY WORKING AUTONOMOUSLY?\nJOIN A TEAM RECOGNIZED FOR LEADERSHIP, INNOVATION, AND PROVEN SUCCESS.\nWE DON’T JUST SELL PRODUCTS. WE OFFER SOLUTIONS BY DESIGN TO TOMORROW’S CHALLENGES.\nJOB DESCRIPTION:\nAMPHENOL AUSTRALIA IS SEEKING AN INDIVIDUAL WITH STRONG PROFESSIONAL AUDIO / LIGHTING CONNECTOR RELATED EXPERIENCE TO DEVELOP AND COORDINATE NEW BUSINESS OPPORTUNITIES FOR AUDIO / LIGHTING INTERCONNECT SYSTEMS BASED IN THE WEST OR EAST COAST USA.\nTHE PRIMARY FUNCTION IS TO ACHIEVE ACCEPTABILITY OF AMPHENOL’S AUDIO / LIGHTING PRODUCTS IN THE MARKETPLACE, WHILE PROVIDING TECHNICAL LEADERSHIP TO OEM’S, DISTRIBUTION CHANNEL PARTNERS AND OUTSIDE REP AGENCIES. THIS POSITION WILL BE FAMILIAR WITH COMPETITIVE PRODUCT OFFERINGS IN VARIOUS MARKET SEGMENTS AND BE ABLE TO POSITION AMPHENOL PRODUCTS TO BEST COMPETE AGAINST COMPETITIVE PRODUCTS. THE PRIMARY CUSTOMER INDUSTRIES ARE ENTERTAINMENT, RENTAL AND LIVE SOUND, PRO-AUDIO, A/V, BROADCAST, INSTALLATION AND LIGHTING MARKETS, WORKING DIRECTLY WITH THE END USER, AS WELL AS FRONT-END CONSULTING ENGINEERING FIRMS AS NEEDED.\nOTHER MAIN FUNCTIONS INCLUDE PROVIDING EFFICIENT AND ACCURATE PRE-SALE APPLICATION AND TECHNICAL SUPPORT BY ANALYZING AND RECOMMENDING SOLUTIONS TO MEET CUSTOMER’S NEEDS; WORK WITH CUSTOMER ENGINEERING DESIGN TEAM TO DESIGN IN AMPHENOL PRODUCTS; MANAGE DAILY PHONE AND EMAIL ACTIVITY WHILE PROVIDING DIRECTIONS, SOLUTIONS, AND RECOMMENDATIONS; EFFECTIVELY COMMUNICATE PRODUCT VALUE PROPOSITION AND PRODUCT LINE STRATEGIES; PROVIDE FEEDBACK TO PRODUCT MARKETING AND ENGINEERING REGARDING INFORMATION, CROSS REFERENCE DATA, TECHNICAL DRAWINGS, AND ANY OTHER TECHNICAL DOCUMENTATION FOUND IN HARD COPY OR ON THE WEBSITE; SERVE ON SPECIAL TEAMS TO ENHANCE TEAM PERFORMANCE AND DRIVE PROCESS IMPROVEMENT , PRODUCTIVITY AND CUSTOMER SATISFACTION.\nAMPHENOL OFFERS A HIGHLY COMPETITIVE SALARY AND ATTRACTIVE COMMISSION PLAN, ALONG WITH A COMPREHENSIVE BENEFITS PACKAGE INCLUDING MEDICAL, DENTAL, VISION, GROUP LIFE INSURANCE AND 401K.\nREGION: OPEN POSITION BASED IN THE WEST OR EAST COAST USA.\nPOSITION REQUIREMENTSDRIVE THE SALES, AND BUSINESS STRATEGIES AT OEM AND/OR WITH AMPHENOL DISTRIBUTION CHANNEL PARTNERS.PROVIDE SUPPORT ON MAJOR MISSION CRITICAL PROJECTS INCLUDING PRELIMINARY CONCEPT DRAWINGS, MODELS AND INTERFACING WITH THE CUSTOMER AND PROJECT CONSULTANT.CONDUCT PRODUCT SEMINARS AND TRAINING ON AMPHENOL PRODUCTS AND SOLUTIONS TO END USERS, CONSULTANTS, AND SALES ENGINEERS.PROVIDE TECHNICAL SUBMITTAL PACKAGES FOR CUSTOMER APPROVAL.MAKE DIRECT OEM/MRO SALES CALLS, JOINT CALLS WITH REPRESENTATIVES AND DISTRIBUTORS TO ACHIEVE DEFINED BUDGETS.PROVIDE FORECASTS AND BUDGET UPDATES TO MANAGEMENT AS REQUIRED.FOLLOW-UP ON ALL LEADS AND QUOTATIONS WITHIN ASSIGNED TERRITORY AND/OR ACCOUNT PORTFOLIO.VIRTUAL PRESENTATIONS AND HANDS-ON DEMONSTRATIONS OF AMPHENOL PRODUCTS, APPLICATIONS, AND TECHNOLOGY FOR THE PURPOSE OF PRODUCT SALES. INDEPENDENTLY AND/OR IN CONJUNCTION WITH MANAGEMENT, DEVELOP AND IMPLEMENT EFFECTIVE MUTUAL ACTION PLANS WITH TARGET OEM’S AND ASSIGNED DISTRIBUTOR BRANCH LOCATIONS.MUST BE ABLE TO TRAVEL VIA AIRPLANE & OVERNIGHT UP TO 20% AS REQUIRED BY ASSIGNED RESPONSIBLY.MUST HAVE A VALID DRIVER’S LICENSE AND BE ABLE TO OPERATE AN AUTOMOBILE FOR UP TO SIX HOURS AT A TIME.TRAVEL TO CORPORATE HEADQUARTERS AND AREAS OUTSIDE OF TERRITORY WILL ALSO BE REQUIRED ON A PERIODIC BASIS.\nDESIRED SKILLS & EXPERIENCE:BACHELOR’S DEGREE IN AUDIO/ELECTRICAL/MECHANICAL ENGINEERINGMINIMUM FIVE (5) YEARS OF AUDIO / LIGHTING INTERCONNECT SALES EXPERIENCE IN ADDITION TO WORKING WITH DISTRIBUTION, PREFERRED.PROFICIENT WITH A COMPUTER AND WINDOWS BASED APPLICATIONS (WORD, EXCEL, AND POWERPOINT).EXCELLENT PRESENTATION, COMMUNICATION, AND INTERPERSONAL SKILLS.PROBLEM SOLVER; STRONG INFLUENCING AND NEGOTIATIONS BEHAVIORS.STRONG BUSINESS ETHICS AND INTEGRITY.\nCOMPANY DESCRIPTION:\nWWW.AMPHENOL.COM\nAMPHENOL IS ONE OF THE WORLD’S LARGEST PROVIDERS OF HIGH-TECHNOLOGY INTERCONNECT, SENSOR, AND ANTENNA SOLUTIONS. OUR PRODUCTS ENABLE THE ELECTRONICS REVOLUTION ACROSS VIRTUALLY EVERY END MARKET INCLUDING AUTOMOTIVE, BROADBAND COMMUNICATIONS, COMMERCIAL AEROSPACE, INDUSTRIAL, INFORMATION TECHNOLOGY AND DATA COMMUNICATIONS, MILITARY, MOBILE DEVICES AND MOBILE NETWORKS. AMPHENOL’S 2021 REVENUES WERE $10.9 BILLION WITH OVER 90,000 EMPLOYEES.\nWWW.AMPHENOLAUDIO.COM\nAMPHENOL AUSTRALIA WAS FOUNDED IN 1955 AND IS A SUBSIDIARY OF AMPHENOL CORPORATION AND IS A LEADER IN PROFESSIONAL AUDIO AND LIGHTING INTERCONNECT PRODUCTS. THE COMPANY DESIGNS, MANUFACTURERS AND SUPPLIES HIGH-PERFORMANCE INTERCONNECT SYSTEMS FOR A BROAD RANGE OF PROFESSIONAL ENTERTAINMENT APPLICATIONS INCLUDING LIVE SOUND SYSTEMS, STAGE LIGHTING, STUDIOS, AUDIO INTERFACE DEVICES AND MUSICAL INSTRUMENTS. THE COMPANY’S HEADQUARTERS ARE LOCATED IN MELBOURNE, AUSTRALIA WITH A DEDICATED SUPPORT OFFICE IN CLINTON TOWNSHIP, MICHIGAN WITH GLOBAL MANUFACTURING, ENGINEERING, SALES AND SERVICE OPERATIONS.\nJOB TYPE: FULL-TIME",
    "job_skill_set": [
      "sales experience",
      "presentation skills",
      "negotiation",
      "business strategy",
      "customer relationship management",
      "forecasting",
      "market analysis",
      "communication",
      "problem solving",
      "teamwork",
      "influencing",
      "autonomy",
      "customer focus",
      "adaptability",
      "leadership",
      "time management",
      "audio engineering",
      "lighting systems",
      "technical support",
      "Windows applications",
      "product knowledge",
      "project management",
      "technical documentation",
      "integrity"
    ],
    "short_keywords": [
      "adaptability",
      "america",
      "analysis",
      "applications",
      "audio",
      "autonomy",
      "business",
      "businessdevelopment",
      "communication",
      "customer",
      "development",
      "documentation",
      "engineering",
      "experience",
      "focus",
      "forecasting",
      "influencing",
      "integrity",
      "knowledge",
      "leadership",
      "lighting",
      "management",
      "manager",
      "market",
      "negotiation",
      "north",
      "presentation",
      "problem",
      "product",
      "project",
      "relationship",
      "sales",
      "skills",
      "solving",
      "strategy",
      "support",
      "systems",
      "teamwork",
      "technical",
      "time",
      "windows"
    ]
  },
  {
    "job_id": "3902370054",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "LOOKING FOR A REWARDING CAREER IN SALES, WHERE RELATIONSHIP BUILDING, COMPETITIVE DRIVE, AND STRONG COMMUNICATION SKILLS WILL LEAD YOU TO A SUCCESSFUL CAREER? LOOK NO FURTHER! \nMALONE WORKFORCE SOLUTIONS IS ACTIVELY RECRUITING THE BEST AND BRIGHTEST IN THE INDUSTRY. OUR BUSINESS DEVELOPMENT MANAGER ROLE IS RESPONSIBLE FOR GENERATING AND OVERSEEING NEW BUSINESS RELATIONSHIPS, WHILE COLLABORATING WITH MARKETING TEAMS TO DEVELOP STRATEGIES FOR ASSIGNED TERRITORIES AND DEVELOP SALES PLANS WITH INTERNAL AND EXTERNAL CUSTOMERS. IF YOU ARE LOOKING FOR A FAMILY-OWNED AND OPERATED COMPANY, OPPORTUNITIES FOR FUTURE GROWTH, AND ONE OF THE STRONGEST COMMISSION PLANS IN THE INDUSTRY, WE ARE LOOKING FOR A BUSINESS DEVELOPMENT MANAGER TO JOIN OUR TEAM IN POOLER, GA!\nRESPONSIBILITIES:SALES GENERATION, DEVELOPMENT OF LEADS, AND BUSINESS DEVELOPMENT FOR AN ASSIGNED REGIONAL AREA THROUGH SOCIAL NETWORKING, COLD CALLING, AND TELEMARKETINGQUALIFY POTENTIAL NEW BUSINESS FOR THEIR TERRITORY AND NEGOTIATE PRICING AND PAYMENT TERMS BASED ON CORPORATE GUIDELINESSALES PLANNING AND RELATIONSHIP BUILDING WITH INTERNAL AND EXTERNAL CUSTOMERSWORK WITH CORPORATE MARKETING TO IMPLEMENT MARKETING STRATEGIES FOR THE TERRITORYMEET SALES GOALS AND METRICS GIVENREPORT ACTIVITY ON A REGULAR BASIS IN CRM SYSTEM\nQUALIFICATIONS:PREVIOUS SALES EXPERIENCE, REQUIREDABILITY TO WORK INDEPENDENTLY AND WITH A TEAMSTRONG ORGANIZATIONAL SKILLS WITH ATTENTION TO DETAILPROFICIENCY IN MICROSOFT OUTLOOK, WORD, EXCEL, POWERPOINTEXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLSABILITY TO INTERACT FACE-TO-FACE WITH CUSTOMERS AND PRESENT A SOLUTION-BASED PRESENTATIONBACHELOR'S DEGREE IN SALES, BUSINESS MANAGEMENT, COMMUNICATION OR RELATED FIELD PREFERRED, NOT REQUIRED\nMANAGEMENT REGISTRY, INC. HIRING DECISIONS ARE MADE WITHOUT REGARD TO RACE, COLOR, RELIGION, NATIONAL OR ETHNIC ORIGIN, SEX, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, AGE, DISABILITY, PROTECTED VETERAN STATUS OR OTHER CHARACTERISTICS PROTECTED BY LAW. EQUAL OPPORTUNITY EMPLOYER/PROTECTED VETERANS/INDIVIDUALS WITH DISABILITIES.\nFOR MORE INFORMATION, PLEASE CONTACT OUR CORPORATE OFFICE AT 1-866-805-8600.",
    "job_skill_set": [
      "sales generation",
      "business development",
      "CRM systems",
      "Microsoft Outlook",
      "Microsoft Word",
      "Microsoft Excel",
      "Microsoft PowerPoint",
      "negotiation",
      "lead development",
      "marketing strategies",
      "relationship building",
      "communication",
      "organizational skills",
      "attention to detail",
      "independent work",
      "teamwork",
      "competitive drive",
      "problem solving"
    ],
    "short_keywords": [
      "attention",
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "competitive",
      "crm",
      "detail",
      "development",
      "drive",
      "excel",
      "generation",
      "independent",
      "lead",
      "manager",
      "marketing",
      "microsoft",
      "negotiation",
      "organizational",
      "outlook",
      "powerpoint",
      "problem",
      "relationship",
      "sales",
      "skills",
      "solving",
      "strategies",
      "systems",
      "teamwork",
      "to",
      "word",
      "work"
    ]
  },
  {
    "job_id": "3901941451",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "RAINSTICK SHOWER IS AN INNOVATIVE AND QUICKLY GROWING CANADIAN CLEANTECH COMPANY THAT HAS WON NUMEROUS AWARDS INCLUDING TIME’S BEST INVENTIONS OF 2023 AND “BEST OF INNOVATION” AT CES 2022. RAINSTICK’S TECHNOLOGY ALLOWS PEOPLE TO SHOWER WITH 80% LESS WATER AND UP TO 80% ENERGY WHILE PROVIDING 2X THE FLOW RATE.\nWE ARE IN SEARCH OF AN ARIZONA-BASED BUSINESS DEVELOPMENT MANAGER TO ADD TO OUR PASSIONATE, INTELLECTUAL, AND INTUITIVE TEAM. ARE YOU AN EXPERIENCED BUSINESS DEVELOPMENT PROFESSIONAL? DO YOU UNDERSTAND THE BUILDING AND SMART HOME SPACE IN THE US MARKET? ARE YOU MOTIVATED BY THE CHALLENGE, AND DO YOU KNOW HOW TO GENERATE AND CONVERT HIGH-QUALITY LEADS TO DRIVE GROWTH?\nWHAT YOU’LL BE DOING:BUILD AN ACTIVE AND ENGAGED SALES PIPELINE THROUGH TRADESHOWS AND EVENTS, COLD CALLING AND REFERRALSDEVELOP LONG-LASTING RELATIONSHIPS WITH B2B RAINSTICK SUPPLIERS AND PARTNERS BUILT ON TRUST, RESPECT, AND INTEGRITYWORK CLOSELY WITH THE RAINSTICK TEAM ON SHOWCASE PILOT OPPORTUNITIES CONTINUALLY LOOKING FOR WAYS TO RE-ENGAGE WITH PARTNERSLOOK FOR OPPORTUNITIES TO CONTINUALLY GENERATE AND INCREASE REVENUESINCREASE PIPELINE THROUGH ACTIVE DEMAND GENERATION AND TARGETED CAMPAIGNSREPORT WEEKLY, MONTHLY, AND ANNUALLY ON THE $ OF CLOSED REVENUE ATTACHED TO THOSE OPPORTUNITIESMANAGE MULTIPLE CUSTOMER CALLS, IN-PERSON AND VIRTUAL MEETINGS, AND PRESENTATIONS DAILYWORK CLOSELY WITH OUR MARKETING, PRODUCT SUPPORT AND ENGINEERING TEAMS TO BUILD CONTENT APPLICABLE TO OUR CUSTOMERS AND PARTNERSTHINK STRATEGICALLY AND CREATIVELY ABOUT HOW WE CAN CONTINUE TO CULTIVATE NEW RELATIONSHIPS, INNOVATE IN OUR SPACE, AND CREATE VALUE FOR OUR CUSTOMERSMAINTAIN EXISTING RELATIONSHIPS AND BUSINESS\nSKILLS/REQUIREMENTS:HAVE A STRONG NETWORK OF POTENTIAL CUSTOMERS IN THE CONSTRUCTION INDUSTRYBACKGROUND IN PLUMBING FIXTURES, CONSTRUCTION (IE. MODULAR, OFF-GRID) OR SIMILAR INDUSTRYBACHELOR’S DEGREE PREFERRED BUT NOT REQUIRED. IDEALLY IN BUSINESS ADMINISTRATION OR MARKETING.AT LEAST 5 YEARS OF SALES EXPERIENCE, WITH EXPERIENCE IN BUSINESS DEVELOPMENT STRATEGYA WILLINGNESS TO LEARN AND GROWEXPERIENCE IN THE BUILDING AND/OR SMART HOME SPACETHE ABILITY TO EFFECTIVELY AND SIMPLY COMMUNICATE HOW RAINSTICK WORKS IN BOTH TECHNICAL AND NON-TECHNICAL LANGUAGEB2B EXPERIENCE, WORKING IN-PERSON SALES ROLE AND COMFORT WITH CALLING AND ACTIVELY REACHING OUTMUST POSSESS GREAT WRITTEN AND ORAL COMMUNICATION WITH ALL LEVELS OF MANAGEMENT AND WITH OUTSIDE CONTACTSCRM EXPERIENCE IS A MUST!WE ARE LOOKING FOR SOMEONE WHO IS HIGHLY MOTIVATED, COLLABORATIVE AND IS COACHABLEENTREPRENEURIAL SPIRIT AND INTEGRITYORGANIZED AND DETAIL-ORIENTEDTRACK RECORD OF SUCCESS IN A METRICS-BASED ROLE\nBONUS POINTS FOR:A CAN DO ATTITUDEA GOOD SENSE OF HUMOURSTART-UP EXPERIENCE\nTRAVEL:ABILITY TO TRAVEL TO TRADE SHOWS AND CLIENT LOCATIONS AS NEEDED, APPROXIMATELY 30%\nLOCATION: THIS POSITION WILL BE PREDOMINANTLY HOME-BASED IN ARIZONA. THERE WILL BE OCCASIONAL TRAVEL TO AND CUSTOMER SITES AND HEADQUARTERS IN CANADA REQUIRED.\nBENEFITS: FLEXIBLE WORKING AND BENEFITS PACKAGESTART DATE: AS SOON AS THE RIGHT CANDIDATE IS FOUND\nIF YOU ARE INTERESTED OR KNOW SOMEONE WHO IS, PLEASE APPLY IN CONFIDENCE WITH A COVER LETTER AND RESUME AND TELL US WHY YOU ARE THE RIGHT FIT FOR THIS ROLE? WE APPRECIATE THE INTEREST OF ALL APPLICANTS, HOWEVER ONLY THOSE UNDER CONSIDERATION WILL BE CONTACTED.WE ARE AN EQUAL OPPORTUNITY EMPLOYER, COMMITTED TO INCLUSION AND DIVERSITY AND WELCOME ALL APPLICANTS INCLUDING BUT NOT LIMITED TO: INDIGENOUS PEOPLES, VISIBLE MINORITIES, ALL RELIGIONS AND ETHNICITIES, PERSONS WITH DISABILITIES, LGBTQIA2S+ PERSONS, AND ALL OTHERS WHO MAY CONTRIBUTE TO THE FURTHER DIVERSIFICATION OF IDEAS. IF YOU REQUIRE SPECIAL ACCOMMODATIONS AT ANY STAGE OF THE RECRUITMENT PROCESS, PLEASE INDICATE THIS IN YOUR COVER LETTER.",
    "job_skill_set": [
      "CRM",
      "Sales Strategy",
      "B2B Sales",
      "Lead Generation",
      "Market Research",
      "Metrics-Based Performance",
      "Communication",
      "Relationship Building",
      "Motivation",
      "Collaboration",
      "Organizational Skills",
      "Detail-Oriented",
      "Entrepreneurial Spirit",
      "Coachable",
      "Creativity",
      "Construction Industry Knowledge",
      "Plumbing Fixtures Knowledge",
      "Humor"
    ],
    "short_keywords": [
      "b2b",
      "building",
      "business",
      "businessdevelopment",
      "coachable",
      "collaboration",
      "communication",
      "construction",
      "creativity",
      "crm",
      "detailoriented",
      "development",
      "entrepreneurial",
      "fixtures",
      "generation",
      "humor",
      "industry",
      "knowledge",
      "lead",
      "manager",
      "market",
      "metricsbased",
      "motivation",
      "organizational",
      "performance",
      "plumbing",
      "relationship",
      "research",
      "sales",
      "skills",
      "spirit",
      "strategy"
    ]
  },
  {
    "job_id": "3889417407",
    "job_title": "Business Development Senior Associate- Remote/South Africa",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "EMPLOYER INDUSTRY: INTERNATIONAL DEVELOPMENT\n\nWHY CONSIDER THIS JOB OPPORTUNITY\n\n COMPETITIVE PAY UP TO $60 MILLION FOR SUCCESSFUL PROPOSAL ACTIVITIES OPPORTUNITY FOR CAREER ADVANCEMENT AND GROWTH WITHIN THE ORGANIZATION REMOTE WORK FLEXIBILITY IN ARLINGTON, VA OR SOUTH AFRICA CHANCE TO LEAD PROPOSAL DEVELOPMENT AND CONTRIBUTE TO STRATEGIC GROWTH INITIATIVES COLLABORATIVE WORK ENVIRONMENT WITH SENIOR MANAGEMENT AND BUSINESS SERVICES TEAMS SUPPORT FROM HIRING COMPANY'S GLOBAL NETWORK FOR BD EFFORTS\n\nWHAT TO EXPECT (JOB RESPONSIBILITIES)\n\n POSITION FOR AND WIN NEW BUSINESS TO INCREASE PROJECT BACKLOG MANAGE ALL ASPECTS OF THE PROPOSAL LIFE CYCLE LEAD CAPTURE PLANNING TRIPS AND COLLABORATE WITH THE TECHNICAL TEAM DEVELOP STAFFING AND MANAGEMENT APPROACH SECTIONS FOR TECHNICAL PROPOSALS CREATE VISUALLY APPEALING GRAPHICS AND ILLUSTRATIONS FOR PROPOSALS\n\nWHAT IS REQUIRED (QUALIFICATIONS)\n\n BACHELOR’S DEGREE IN RELATED FIELD MINIMUM OF FIVE YEARS' RELEVANT WORK EXPERIENCE IN BUSINESS DEVELOPMENT ABILITY TO MANAGE A PROPOSAL TEAM OF 10-30 INDIVIDUALS STRONG ANALYTICAL AND ORGANIZATIONAL SKILLS EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS\n\nHOW TO STAND OUT (PREFERRED QUALIFICATIONS)\n\n MASTER’S DEGREE IN RELATED FIELD EXPERIENCE WORKING IN THE ENERGY SECTOR WITHIN INTERNATIONAL DEVELOPMENT FLUENCY IN A SECOND LANGUAGE, PREFERABLY SPANISH, FRENCH, OR ARABIC\n\n#BUSINESSDEVELOPMENT #INTERNATIONALDEVELOPMENT #PROPOSALMANAGEMENT #CAREEROPPORTUNITY #REMOTEWORK\n\nAT TALENTIFY, WE PRIORITIZE CANDIDATE PRIVACY AND CHAMPION EQUAL-OPPORTUNITY EMPLOYMENT. CENTRAL TO OUR MISSION IS OUR PARTNERSHIP WITH COMPANIES THAT SHARE THIS COMMITMENT. WE AIM TO FOSTER A FAIR, TRANSPARENT, AND SECURE HIRING ENVIRONMENT FOR ALL. IF YOU ENCOUNTER ANY EMPLOYER NOT ADHERING TO THESE PRINCIPLES, PLEASE BRING IT TO OUR ATTENTION IMMEDIATELY.\n\nTALENTIFY IS NOT THE EOR (EMPLOYER OF RECORD) FOR THIS POSITION. OUR ROLE IN THIS SPECIFIC OPPORTUNITY IS TO CONNECT OUTSTANDING CANDIDATES WITH A TOP-TIER EMPLOYER.\n\nTALENTIFY HELPS CANDIDATES AROUND THE WORLD TO DISCOVER AND STAY FOCUSED ON THE JOBS THEY WANT UNTIL THEY CAN COMPLETE A FULL APPLICATION IN THE HIRING COMPANY CAREER PAGE/ATS.",
    "job_skill_set": [
      "business development",
      "analytical skills",
      "organizational skills",
      "project management",
      "staffing and management",
      "communication",
      "collaboration",
      "leadership",
      "problem solving",
      "proposal management",
      "graphic design",
      "fluency in Spanish/French/Arabic"
    ],
    "short_keywords": [
      "africa",
      "analytical",
      "and",
      "associate",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "design",
      "development",
      "fluency",
      "graphic",
      "in",
      "leadership",
      "management",
      "organizational",
      "problem",
      "project",
      "proposal",
      "remotesouth",
      "senior",
      "skills",
      "solving",
      "spanishfrencharabic",
      "staffing"
    ]
  },
  {
    "job_id": "3884434107",
    "job_title": "Business Development Representative (BDR) - Lead Finder",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ABOUT NOWADAYSAT NOWADAYS, WE'RE IN THE BUSINESS OF MAKING WAVES IN THE DIGITAL SPACE. LOCATED IN THE VIBRANT LITTLE ITALY NEIGHBORHOOD OF SAN DIEGO (WITH PLANS TO MOVE SLIGHTLY NORTHWARD SOON), WE'RE A CUTTING-EDGE VIRAL MARKETING AGENCY SET ON MERGING BRANDS WITH POP CULTURE AND CRAFTING CAMPAIGNS THAT BREAK THE INTERNET. OUR RAPID GROWTH AND INNOVATIVE EDGE DEMAND THE ADDITION OF A DYNAMIC, ADAPTABLE, AND ENERGETIC BUSINESS DEVELOPMENT REPRESENTATIVE (BDR) TO OUR TEAM. THIS ROLE ISN'T JUST A JOB; IT'S AN ADVENTURE FOR THOSE READY TO TACKLE CHALLENGES HEAD-ON AND CONTRIBUTE TO OUR AGENCY'S EXCITING JOURNEY OF EXPANSION.\nWHAT YOU'LL BE STEPPING INTO:JOINING OUR SMALL, AMBITIOUS TEAM MEANS DIVING INTO A FAST-PACED, EVOLVING ENVIRONMENT WHERE ADAPTABILITY AND A PROACTIVE MINDSET ARE KEY. CHANGE IS OUR ONLY CONSTANT; STRATEGIES, METHODOLOGIES, AND TASKS SHIFT AS WE SCALE. IF YOU'RE EXCITED BY THE PROSPECT OF ADAPTING TO NEW CHALLENGES, PIVOTING WITH THE BUSINESS'S NEEDS, AND THINKING ON YOUR FEET, YOU'LL FIND A PERFECT FIT WITH US. WE SEEK PARTNERS IN GROWTH, INDIVIDUALS AS DEDICATED TO THEIR DEVELOPMENT AS TO THE SUCCESS OF NOWADAYS.\nOFFICE ATTENDANCE: PRESENCE AT THE OFFICE IS REQUIRED 3-5 TIMES A WEEK, BLENDING WFH FLEXIBILITY WITH ESSENTIAL IN-PERSON COLLABORATION.\nKEY RESPONSIBILITIES:INBOX MASTERY: OVERSEE OUR INBOX, ENGAGING IN COLD EMAILS AND OTHER COMMUNICATIONS SWIFTLY AND WITH A FRIENDLY TOUCH. YOUR GOAL IS TO MAINTAIN ACTIVE DIALOGUES AND GUIDE LEADS TOWARDS BOOKING CALLS WITH OUR ACCOUNT EXECUTIVES.PROACTIVE LEAD GENERATION: SEEK OUT AND ENGAGE NEW LEADS THROUGH VARIOUS CHANNELS, INCLUDING EMAIL MARKETING, LINKEDIN, COLD CALLING, AND BEYOND. WE VALUE CREATIVITY IN FINDING AND ENGAGING POTENTIAL CLIENTS.CREATIVE SALES SUPPORT: AID THE SALES TEAM IN PREPARING COMPELLING PROPOSALS. YOUR INNOVATIVE TOUCH AND DESIGN SENSIBILITY WILL ENSURE OUR PROPOSALS STAND OUT.TECH PROFICIENCY & DATA ANALYSIS: QUICKLY MASTER NEW DIGITAL TOOLS AND PLATFORMS. YOUR ABILITY TO ANALYZE DATA WILL INFORM DECISIONS THAT IMPROVE OUR SALES PROCESS. EFFORTLESSLY NAVIGATE TECH CHALLENGES AND STREAMLINE OUR DIGITAL INFRASTRUCTURE.FLEXIBLE STRATEGY IMPLEMENTATION: SUPPORT THE PLANNING AND EXECUTION OF STRATEGIES FOR ACCOUNT EXECUTIVES, FINE-TUNING APPROACHES BASED ON PERFORMANCE AND FEEDBACK.\nWHO WE’RE LOOKING FOR:INDIVIDUALS EXCITED BY CHANGE AND CAPABLE OF THRIVING IN DYNAMIC SETTINGS.TECH ENTHUSIASTS EAGER TO LEARN AND MASTER SOFTWARE TOOLS, ESPECIALLY THOSE FOCUSED ON AUTOMATION LIKE ZAPIER AND MAKE, TO DRIVE EFFICIENCY AND RESULTS.SHARP ANALYSTS WHO USE DATA TO INFORM STRATEGIES AND DECISIONS.SKILLED COMMUNICATORS ADEPT AT MANAGING DIGITAL INTERACTIONS WITH PROFESSIONALISM.CREATIVE MINDS THAT BLEND INNOVATIVE THINKING WITH STRATEGIC ACUMEN.\nWHAT WE OFFER:HYBRID WORK MODEL: ENJOY THE FLEXIBILITY OF A HYBRID WORK SCHEDULE, SUBJECT TO ADJUSTMENTS WITH OUR UPCOMING OFFICE MOVE.COMPENSATION: STARTING BASE SALARY OF $40,000, WITH ON-TARGET EARNINGS (OTE) UP TO $60,000, INCLUSIVE OF BONUSES AND COMMISSIONS FOR BUSINESS DEVELOPMENT SUCCESS.FUN ASS WORK ENVIRONMENT. SERIOUSLY, IT'S NOT YOUR BASIC EVERYDAY BORING COMPANY.BENEFITS: ENJOY UNLIMITED PTO, HEALTH AND DENTAL INSURANCE, WITH PLANS TO EXPAND OUR BENEFITS PACKAGE.INCENTIVES: YOUR HARD WORK AND ACHIEVEMENTS ARE REWARDED WITH A TRANSPARENT BONUS AND COMMISSION STRUCTURE.CAREER GROWTH: THIS ROLE IS A LAUNCHING PAD FOR PROFESSIONAL ADVANCEMENT WITHIN NOWADAYS, OFFERING CLOSE COLLABORATION WITH OUR LEADERSHIP AND COMPREHENSIVE EXPOSURE TO OUR OPERATIONS AND MARKET.\n",
    "job_skill_set": [
      "lead generation",
      "data analysis",
      "proposal preparation",
      "adaptability",
      "communication",
      "creativity",
      "problem solving",
      "team collaboration",
      "proactive mindset",
      "strategic thinking",
      "email marketing",
      "cold calling",
      "digital tools proficiency",
      "automation tools (Zapier, Make)"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "automation",
      "bdr",
      "business",
      "businessdevelopment",
      "calling",
      "cold",
      "collaboration",
      "communication",
      "creativity",
      "data",
      "development",
      "digital",
      "email",
      "finder",
      "generation",
      "lead",
      "make",
      "marketing",
      "mindset",
      "preparation",
      "proactive",
      "problem",
      "proficiency",
      "proposal",
      "representative",
      "solving",
      "strategic",
      "team",
      "thinking",
      "tools",
      "zapier"
    ]
  },
  {
    "job_id": "3884932592",
    "job_title": "Food & Beverage Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ABOUT US\n\nWE ARE THE INDEPENDENT EXPERT IN ASSURANCE AND RISK MANAGEMENT. DRIVEN BY OUR PURPOSE, TO SAFEGUARD LIFE, PROPERTY, AND THE ENVIRONMENT, WE EMPOWER OUR CUSTOMERS AND THEIR STAKEHOLDERS WITH FACTS AND RELIABLE INSIGHTS SO THAT CRITICAL DECISIONS CAN BE MADE WITH CONFIDENCE.\n\nAS A TRUSTED VOICE FOR MANY OF THE WORLD’S MOST SUCCESSFUL ORGANIZATIONS, WE USE OUR KNOWLEDGE TO ADVANCE SAFETY AND PERFORMANCE, SET INDUSTRY BENCHMARKS, AND INSPIRE AND INVENT SOLUTIONS TO TACKLE GLOBAL TRANSFORMATIONS.\n\nABOUT THE ROLE\n\nDNV SUPPLY CHAIN AND ASSURANCE SERVICES IN NORTH AMERICA IS CURRENTLY SEEKING A FOOD & BEVERAGE (F&B) BUSINESS DEVELOPMENT MANAGER TO JOIN OUR DYNAMIC TEAM.\n\nAS AN F&B BUSINESS DEVELOPMENT MANAGER, YOULL HAVE THE CHANCE TO COLLABORATE WITH A VAST NETWORK OF EXPERIENCED SALES AND DEVELOPMENT LEADERS WORLDWIDE. THIS ROLE IS PART OF AN AMBITIOUS EXPANSION PLAN, OFFERING NUMEROUS OPPORTUNITIES TO SHAPE THE BUSINESS WITHIN A QUASI-STARTUP ENVIRONMENTA PERFECT LAUNCHING PAD FOR YOUR CAREER AS A SALES LEADER.\n\nYOUR RESPONSIBILITIES WILL INVOLVE DELVING INTO CLIENTS NEEDS AND PAIN POINTS WITH A KEEN ENTREPRENEURIAL CURIOSITY. YOULL BE TASKED WITH SUCCESSFULLY SELLING OUR COMPREHENSIVE SUITE OF SERVICES, WHICH INCLUDES SUPPLY CHAIN, COMPLIANCE, AND ASSURANCE SERVICES. IN MANY CASES, YOULL WORK CLOSELY WITH OUR DELIVERY AND TECHNICAL TEAMS TO DESIGN CUSTOMIZED SOLUTIONS.\n\nTHIS EXCITING OPPORTUNITY ALLOWS YOU TO ACTIVELY CONTRIBUTE TO GROWTH AS A SALES AND BUSINESS DEVELOPER. SIMULTANEOUSLY, YOULL LEAD THE DESIGN AND EXECUTION OF PROJECTS, ENSURING SERVICE EXCELLENCE FOR CLIENTS. BY FORGING LASTING PARTNERSHIPS WITH SOME OF THE WORLDS MOST ICONIC GLOBAL BRANDS, YOULL HELP THEM ACHIEVE BUSINESS SUCCESS AND MITIGATE RISKS ACROSS THEIR OPERATIONS AND EXTENDED SUPPLY CHAINS.\n\nTHIS POSITION IS PREFERRED TO BE BASED OUT OF DNV OFFICES IN HOUSTON, CINCINNATI, MEDFORD, PHOENIX, AUSTIN, DALLAS, MIAMI, DETROIT OR COLUMBUS WITH FLEXIBLE WORK ARRANGEMENT (HOME/OFFICE).\n\nWHAT YOU'LL DO\n\nYOUR ROLE WILL INVOLVE IDENTIFYING OPPORTUNITIES AND SPEARHEADING SALES GROWTH ACROSS A DIVERSE ARRAY OF SERVICES AND CUSTOMIZED SOLUTIONS. THESE OFFERINGS WILL SPECIFICALLY SUPPORT KEY INDUSTRY SECTORS AND THEIR EXTENDED SUPPLY CHAINS. YOUR EXPERTISE WILL BE CRUCIAL IN DRIVING SUCCESS AND FOSTERING LASTING PARTNERSHIPS WITH OUR CLIENTS.\n\nSOME OF OUR CORE SERVICES INCLUDE\n\nSUPPLIERS INSPECTION AND VERIFICATIONCOMPLIANCE TO CUSTOMERS OWN PROTOCOLSEXECUTION OR RISK MITIGATION CHECK LISTSSOCIAL AUDITS AND DIGITAL SOLUTIONS\n\nROLE\n\nYOU WILL TAKE ON PROJECTS WITH END-TO-END ACCOUNTABILITY, FROM PROSPECTING AND DESIGNING TO SELLING AND DELIVERING. ADDITIONALLY, YOUR ROLE WILL CONTRIBUTE TO BUSINESS GROWTH THROUGH THE FOLLOWING ACTIVITIES:\n\nINDEPENDENTLY DEVELOPING AND GROWING YOUR PIPELINE: YOULL IDENTIFY AND PROGRESS OPPORTUNITIES ACROSS DIFFERENT SALES STAGES.PROACTIVELY IDENTIFYING CUSTOMER NEEDS: BY UNDERSTANDING CLIENT REQUIREMENTS, YOULL DEVELOP TAILORED SOLUTIONS AND SUCCESSFULLY SELL THEM TO BOTH NEW AND EXISTING CLIENTS.COORDINATING PROJECTS: ENSURING THAT PROJECTS ARE EXECUTED TO CLIENTS EXPECTATIONSON TIME, WITHIN BUDGET, AND MEETING DNV QUALITY STANDARDS.EFFECTIVE COMMUNICATION AND LEADERSHIP: YOULL LEAD AND COMMUNICATE EFFECTIVELY WITH OTHER TEAM MEMBERS WITHIN THE NETWORK AND CLIENTS.INTRODUCING NEW SERVICES: YOULL INTRODUCE SERVICES FROM YOUR OWN/EXISTING DISCIPLINE(S) TO NEW CLIENTS AND EXPLORE NEW SERVICES FOR EXISTING CLIENTS.CONSULTATIVE SELLING: UNDERSTANDING CLIENTS NEEDS, EMPATHIZING WITH THEIR CHALLENGES, AND OFFERING TAILORED SOLUTIONS. \n\nWHAT WE OFFER FOR INTERNAL CANDIDATES\n\nWHAT WE OFFER\n\nWHAT WE OFFER\n\nGENEROUS PAID TIME OFF (VACATION, SICK DAYS, COMPANY HOLIDAYS, PERSONAL DAYS)MULTIPLE MEDICAL AND DENTAL BENEFIT PLANS TO CHOOSE FROM, VISION BENEFITSSPENDING ACCOUNTS FSA, DEPENDENT CARE, COMMUTER BENEFITS, COMPANY-SEEDED HSASPECIAL PROGRAMS EMPLOYEE ASSISTANCE PROGRAM, ID THEFT PROTECTION, AND ACCIDENT AND CRITICAL ILLNESS OPTIONS FOR YOU AND YOUR FAMILYEMPLOYER-PAID, THERAPIST-LED, VIRTUAL CARE SERVICES THROUGH TALKSPACE401(K) WITH COMPANY MATCHCOMPANY PROVIDED LIFE INSURANCE, SHORT-TERM, AND LONG-TERM DISABILITY BENEFITSTUITION ASSISTANCECONSUMER DISCOUNTS AND REWARDSFLEXIBLE WORK SCHEDULE WITH HYBRID/REMOTE OPPORTUNITIESADVANCEMENT OPPORTUNITIES\n\n**BENEFITS VARY BASED ON POSITION, TENURE, LOCATION, AND EMPLOYEE ELECTION**\n\nHOW WE DO IT\n\nWE CARE, WE DARE, WE SHARE\n\nDNV IS A PROUD EQUAL-OPPORTUNITY EMPLOYER COMMITTED TO BUILDING AN INCLUSIVE AND DIVERSE WORKFORCE. ALL EMPLOYMENT IS DECIDED ON THE BASIS OF QUALIFICATIONS, MERIT, OR BUSINESS NEED, WITHOUT REGARD TO RACE, COLOR, RELIGION, AGE, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, OR PROTECTED VETERAN STATUS. DNV IS COMMITTED TO ENSURING EQUAL EMPLOYMENT OPPORTUNITY, INCLUDING PROVIDING REASONABLE ACCOMMODATIONS TO INDIVIDUALS WITH A DISABILITY. US APPLICANTS WITH A PHYSICAL OR MENTAL DISABILITY WHO REQUIRE A REASONABLE ACCOMMODATION FOR ANY PART OF THE APPLICATION OR HIRING PROCESS MAY CONTACT THE NORTH AMERICA RECRUITMENT DEPARTMENT (HRRECRUITMENT.NORTHAMERICA@DNV.COM). INFORMATION RECEIVED RELATING TO ACCOMMODATIONS WILL BE ADDRESSED CONFIDENTIALLY.\n\nFOR MORE INFORMATION ABOUT YOUR RIGHTS UNDER THE LAW, SEE:\n\nHTTPS://WWW.EEOC.GOV/KNOW-YOUR-RIGHTS-WORKPLACE-DISCRIMINATION-ILLEGAL-POSTER\n\nREAD MORE HERE\n\nDIVERSITY AT DNV\n\nMEET OUR EMPLOYEES\n\nABOUT DNV\n\nCAREERS IN DNV\n\nABOUT YOU\n\nWHAT IS REQUIRED\n\nBACHELORS DEGREE OR HIGHER RELEVANT TO THE ROLE AND SUBJECT AREAS (PREFERRED).PROVEN TRACK RECORD OF MINIMUM 2 YEARS IN SALES AND BUSINESS DEVELOPMENT WITHIN THE SUPPLY CHAIN DOMAIN, IDEALLY WITHIN A CONSULTANCY ENVIRONMENT.MINIMUM 2 YEARS OF EXPERIENCE LEADING AND DELIVERING CONSULTING SERVICES AS A TRUSTED ADVISOR AND THOUGHT LEADER TO CLIENTS.EXPERIENCE IN SELLING SOLUTIONS WITHIN THE FOOD AND BEVERAGE INDUSTRIES. PROVEN PROJECT MANAGEMENT SKILLS, INCLUDING DESIGN AND DELIVERING SERVICE EXCELLENCE (PREFERRED).ENTREPRENEURIAL DRIVE TO PROACTIVELY INITIATE NEW INITIATIVES, GROW FROM A SMALL BASE, AND OPERATE IN A QUICK EXPERIMENTATION, HIGH-AMBIGUITY ENVIRONMENT.TRAVEL: UP TO 20% DOMESTIC.\n\nKEY COMPETENCIES\n\nSALES: PROVEN ABILITY TO SELL IN A CONSULTATIVE MANNER THROUGHOUT THE ENTIRE SALES CYCLEFROM CLIENT OUTREACH TO CLOSING DEALS CONSISTENTLY AND ACHIEVING TARGET SALES PERFORMANCE.INITIATIVE & RESPONSIBILITY: ACTS ON OWN INITIATIVE, MAKES THINGS HAPPEN, AND ACCEPTS RESPONSIBILITY FOR RESULTS.ANALYSIS & JUDGMENT: QUICKLY UNDERSTANDS AND ANALYZES COMPLEX ISSUES, COMING UP WITH SOUND AND RATIONAL JUDGMENTS.PROFESSIONAL EXPERTISE: DEMONSTRATES SPECIALIST KNOWLEDGE AND EXPERTISE IN SUPPLY CHAIN RISK MANAGEMENT AND SELLING SOLUTIONS TO THE FOOD AND BEVERAGE INDUSTRY. EFFECTIVE COMMUNICATION: COMMUNICATES CLEARLY, PRECISELY, AND IN A STRUCTURED MANNER; SPEAKS WITH AUTHORITY AND CONVICTION; PRESENTS EFFECTIVELY. BUILDS A NETWORK.CONSTRUCTIVE TEAMWORK: COOPERATES WELL WITH OTHERS, SHARES KNOWLEDGE, EXPERIENCE, AND INFORMATION, AND SUPPORTS TEAM GOALS.\n\n** IMMIGRATION-RELATED EMPLOYMENT BENEFITS, SUCH AS VISA SPONSORSHIP, ARE NOT AVAILABLE FOR THIS POSITION. **",
    "job_skill_set": [
      "sales",
      "business development",
      "project management",
      "food and beverage industry knowledge",
      "service excellence",
      "data analysis",
      "communication",
      "initiative",
      "teamwork",
      "problem solving",
      "leadership",
      "entrepreneurial mindset",
      "relationship building",
      "adaptability",
      "supply chain management",
      "consultative selling",
      "risk management"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "and",
      "beverage",
      "building",
      "business",
      "businessdevelopment",
      "chain",
      "communication",
      "consultative",
      "data",
      "development",
      "entrepreneurial",
      "excellence",
      "food",
      "industry",
      "initiative",
      "knowledge",
      "leadership",
      "management",
      "manager",
      "mindset",
      "problem",
      "project",
      "relationship",
      "risk",
      "sales",
      "selling",
      "service",
      "solving",
      "supply",
      "teamwork"
    ]
  },
  {
    "job_id": "3903428571",
    "job_title": "Senior Director, Business Development, Early Phase - US - Remote (Northeast)",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "WHO WE ARE\n\nWE’RE A GLOBAL, MIDSIZE CRO THAT PUSHES BOUNDARIES, INNOVATES, AND INVENTS BECAUSE THE PATH TO A CURE FOR THE WORLD’S MOST PERSISTENT DISEASES IS NOT PAVED BY THOSE WHO PLAY IT SAFE. IT IS BUILT BY THOSE WHO TAKE PIONEERING, CREATIVE APPROACHES AND IMPLEMENT THEM WITH QUALITY AND EXCELLENCE.\n\nWE ARE WORLDWIDE CLINICAL TRIALS, AND WE ARE A GLOBAL TEAM OF OVER 3,000 EXPERTS, BRIGHT THINKERS, DREAMERS, AND DOERS AND, TOGETHER, WE ARE CHANGING THE WAY THE WORLD EXPERIENCES CROS – IN THE BEST POSSIBLE WAY.\n\nOUR MISSION IS TO WORK WITH PASSION AND PURPOSE EVERY DAY TO IMPROVE LIVES AND WE ARE LOOKING FOR OTHERS WHO VALUE THIS SAME PURSUIT.\n\nWHAT THE EARLY PHASE BUSINESS DEVELOPMENT DEPARTMENT DOES AT WORLDWIDE\n\nTHE EARLY PHASE BUSINESS DEVELOPMENT DEPARTMENT IS A GROUP OF HIGHLY DEDICATED INDIVIDUALS WORKING AS ONE TO BRING THE BEST-IN-CLASS CUSTOMER SERVICE TO OUR CLIENTS. THIS DEPARTMENT IS COMMITTED TO GROWING AND BUILDING BUSINESS LONGEVITY FOR PHASE I AND IB STUDIES WHILE BRINGING ON NEW CLIENTS AND GROWING RELATIONSHIPS WITH CURRENT CLIENTS.\n\nWHAT THE SR. DIRECTOR, BUSINESS DEVELOPMENT DOES AT WORLDWIDE\n\nTHE SR. DIRECTOR OF BUSINESS DEVELOPMENT, EARLY PHASE IS RESPONSIBLE FOR DRIVING EXPOSURE AND BUSINESS GROWTH TO OUR BIOANALYTICAL LAB CAPABILITIES AND OFFERINGS ALONG WITH GROWING NEW RELATIONSHIPS WITH CLIENTS. THIS PERSON WILL DEVELOP NEW BUSINESSES IN THE DESIGNATED TERRITORY AND WILL HAVE A PROVEN TRACK RECORD IN BUILDING PRODUCTIVE CLIENT RELATIONSHIPS IN THE CLINICAL RESEARCH OR BIOTECH INDUSTRIES.\n\nTO BE CONSIDERED FOR THIS ROLE, YOU WILL HAVE A PROVEN TRACK RECORD SELLING BIOANALYTICAL SERVICES IN THE SMALL AND LARGE MOLECULE SPACE. A PROVEN TRACK RECORD OF DEVELOPING, GROWING, AND NURTURING CUSTOMER RELATIONSHIPS. MUST BE ABLE TO DESIGN AND DELIVER POWERFUL BIOANALYTICAL SOLUTION-DRIVEN CAPABILITIES AND PROPOSAL DEFENSE PRESENTATIONS IN COLLABORATION WITH HIGHLY SKILLED CLINICAL AND OPERATION PERSONNEL; CREATE BUSINESS OPPORTUNITIES THROUGH CUSTOMER NEEDS IDENTIFICATION AND RELATIONSHIP BUILDING; PROACTIVELY WORK WITH CUSTOMER AND PROJECT TEAMS TO RESOLVE CLIENT CONCERNS BY HELPING TO CREATE SPECIFIC ACTION PLANS THAT SUPPORT THE CUSTOMER AND THE PROJECT TEAM.\n\nWHAT YOU WILL DO\n\nTASKS MAY INCLUDE BUT ARE NOT LIMITED TO:\n\nACHIEVE INDIVIDUAL REVENUE AND SALES OBJECTIVES THROUGH PROACTIVE COMMUNICATION AND SALES FOR WORLDWIDE CLINICAL TRIALS EARLY PHASE SERVICES TO ASSIGNED CLIENTSDETERMINE NEW APPROACHES TO PROBLEM-SOLVING AND DEVISE SOLUTIONS WITHIN THE SCOPE OF RESPONSIBILITYCONNECT THE WORLDWIDE TEAM TO YOUR ESTABLISHED NETWORK OF BIOANALYTICAL CONTACTSIDENTIFY NEW CONTACT LEADS FOR POTENTIAL PHASE I CLINICAL PHARMACOLOGY BUSINESS.DEVELOP AND IMPLEMENT INDIVIDUAL, TERRITORY, AND KEY ACCOUNT STRATEGIES THAT ARE SPECIFICALLY GEARED TO THE GROWTH AND RETENTION OF THE CLIENT BASE.\n\nWHAT YOU BRING TO THE ROLE\n\nA PROVEN TRACK RECORD OF SELLING AND BUILDING BIOANALYTICAL REVENUES IN THE SMALL AND LARGE MOLECULE SPACEA PROVEN ABILITY TO WORK INDEPENDENTLY AND UNDER PRESSURE WITHOUT SUPERVISIONSTRONG, AND EFFECTIVE PRESENTATION SKILLS; ABILITY TO CONVINCINGLY PRESENT FEATURES AND BENEFITS OF SERVICE TO CLIENTSEXCELLENT COMMUNICATION SKILLS WITH A HIGH DEGREE OF PROFESSIONALISM\n\nYOUR EXPERIENCE\n\nBA/BS IN BUSINESS OR LIFE SCIENCESMS OR MBA PREFERREDMANAGEMENT EXPERIENCE PREFERREDSEVEN (7) YEARS OF SALES EXPERIENCE IN CRO INDUSTRIES\n\nWHY WORLDWIDE\n\nAT WORLDWIDE, WE BALANCE FUN WITH THE SERIOUS BUSINESS OF CHANGING LIVES. WE HAVE A VALUES-DRIVEN CULTURE THAT IS BUILT FROM THE GROUND UP. WE EMPOWER OUR TEAM MEMBERS TO TREAT EVERY CLINICAL TRIAL LIKE A PATIENT’S LIFE DEPENDS ON IT – BECAUSE IT DOES. OUR LEADERS ARE IN THE TRENCHES WITH YOU - COMMITTED TO ADVANCING SCIENCE AND MOVING MOUNTAINS FOR OUR CUSTOMERS. \n\nINTERESTED IN HEARING MORE ABOUT WORLDWIDE OR OUR ROLES? CHECK OUT OUR CAREERS PAGE AT WWW.WORLDWIDE.COM/CAREERS!\n\nWE’RE A GLOBAL, MID-SIZE CRO THAT PUSHES BOUNDARIES, INNOVATES AND INVENTS — BECAUSE THE PATH TO A CURE FOR THE WORLD’S MOST PERSIST DISEASES IS NOT PAVED BY THOSE WHO PLAY IT SAFE, BUT BY THOSE WHO TAKE PIONEERING, CREATIVE APPROACHES, AND IMPLEMENT THEM WITH QUALITY AND EXCELLENCE. WE ARE EXPERTS, BRIGHT THINKERS, DREAMERS AND DOERS AND, TOGETHER, WE ARE CHANGING THE WAY THE WORLD EXPERIENCES CROS, IN THE BEST POSSIBLE WAY.",
    "job_skill_set": [
      "sales experience",
      "customer relationship management",
      "business development",
      "strategic planning",
      "problem-solving",
      "networking",
      "communication",
      "presentation skills",
      "teamwork",
      "independence",
      "professionalism",
      "adaptability",
      "bioanalytical services",
      "clinical research",
      "proposal defense presentations"
    ],
    "short_keywords": [
      "adaptability",
      "bioanalytical",
      "business",
      "businessdevelopment",
      "clinical",
      "communication",
      "customer",
      "defense",
      "development",
      "director",
      "early",
      "experience",
      "independence",
      "management",
      "networking",
      "northeast",
      "phase",
      "planning",
      "presentation",
      "presentations",
      "problemsolving",
      "professionalism",
      "proposal",
      "relationship",
      "remote",
      "research",
      "sales",
      "senior",
      "services",
      "skills",
      "strategic",
      "teamwork",
      "us"
    ]
  },
  {
    "job_id": "3902349403",
    "job_title": "Business Development & Growth",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ABOUT US\nFOUNDED BY BROTHERS DAVE AND STEVE PEEK, THIS HIGH ENERGY COMPANY PROVIDES BUSINESSES THE TOOLS AND RESOURCES THEY NEED TO COMPLETE THEIR SHIPPING NEEDS. HEADWALL ISN'T JUST A NAME; IT EMBODIES OUR ENTIRE APPROACH. THE HEADWALL OF A MOUNTAIN IS THE STEEPEST CLIFF AND OFTEN THE MOST DIFFICULT TO ASCEND. OUR CLIENTS COME TO US TIME AND TIME AGAIN BECAUSE WE NEVER SHY AWAY FROM THE ASCENT, REGARDLESS OF THE PITCH.DELIVERING FOR OUR CLIENTS IS MADE POSSIBLE BY OUR TEAM'S COMMITMENT TO HEADWALL'S CORE VALUES, PRACTICED DAILY AS WE ACT AS STRATEGIC PARTNERS FOR OUR CLIENTS:\nSOLUTIONS. SOLUTIONS. SOLUTIONS: WE ARE SOLVERS. WE ARE FIXERS. WE ARE OUTCOME ORIENTED.INTEGRITY: WE SAY WHAT WE MEAN AND DO WHAT WE SAY. THAT SIMPLE.DETAILS ARE EVERYTHING: WE LIVE IN THE DETAILS SO OUR CLIENTS CAN FOCUS ON THE RESULTS.FAMILY MENTALITY: WHETHER A CLIENT, CARRIER, OR EMPLOYEE, WE LOOK OUT FOR OUR PEOPLE.\n*THE ANTICIPATED START DATE FOR THIS ROLE IS MAY 22ND 2024*\nROLE – BUSINESS DEVELOPMENT & GROWTH\nHEADWALL SALES OFFERS A UNIQUE AND FUN SALES ENVIRONMENT FUELED BY THE NONSTOP PACE OF THE TRANSPORTATION INDUSTRY. WE LOVE COMPETITION AND ARE LOOKING FOR INDIVIDUALS THAT WILL THRIVE IN OUR FAST-PACED, HIGH-ENERGY ENVIRONMENT AND WANT TO HELP PUSH OTHERS TO BE BETTER. HEADWALL SALES OFFERS MANY INCENTIVES LIKE TEAM OUTINGS, HAPPY HOURS, AND PERSONALIZED COACHING. WE TAKE PRIDE IN ALL ASPECTS OF THE COMPANY BEING ACCESSIBLE AND INVESTING IN OUR EMPLOYEE'S SUCCESS AND DEVELOPMENT. EMPLOYEE ENGAGEMENT IS AT THE HEART OF THE ORGANIZATION AND INCREDIBLY IMPORTANT TO US.\nHEADWALL IS HEADQUARTERED IN DENVER, CO AND LOOKING FOR MOTIVATED CURRENT OR ASPIRING SALES INDIVIDUALS WHO ARE EXCITED TO WORK IN OFFICE TO CULTIVATE, BUILD, AND OWN THEIR OWN BOOK OF BUSINESS.\nYOU WILL:· COMPLETE HEADWALL TRAINING THAT PREPS YOU FOR YOUR NEW TEAM· CALL CUSTOMERS DAILY TO GENERATE NEW BUSINESS, DEVELOP DEEP RELATIONSHIPS, AND GROW YOUR BOOK OF BUSINESS· COLLABORATE CROSS FUNCTIONALLY WITH OPERATIONS TO ENSURE DELIVERY OF HEADWALL’S TRACKING AND CUSTOMER SERVICE STANDARDS· BECOME AN EXPERT IN OVERCOMING OBJECTIONS TO BUSINESS OWNERS OVER THE PHONE· COLLABORATE WITH LEADERSHIP AND OTHER TEAM MEMBERS TO CONTINUE TO MASTER YOUR SALES PITCH\nCAREER GROWTH– WHAT TO EXPECT:· EXPERIENCE PERSONALIZED ONE-ON-ONE COACHING TO BECOME A SALES EXPERT· OPPORTUNITY TO MANAGE ACCOUNT TEAMS THROUGH BOOK OF BUSINESS· LEADERSHIP THAT IS INVESTED IN YOUR SUCCESS AND DEVELOPMENT· ADDITIONAL LEADERSHIP TRAINING OFFERED THROUGHOUT TIME OF EMPLOYMENT· DIRECT CONTACT, COACHING, AND MENTORING FROM THE FOUNDERS OF THE COMPANY\nWHAT WE ARE LOOKING FOR:· BACHELOR’S DEGREE IN BUSINESS PREFERRED· 1-3 YEARS OF EXPERIENCE AND/OR INTENSE INTEREST IN SALES, PIPELINE MANAGEMENT, AND NEGOTIATIONS· YOU'RE NOT AFRAID TO FAIL AND YOU CAN RECOVER QUICKLY FROM DIFFICULT OBJECTIONS - REJECTION DOESN’T GET TO YOU· ABILITY TO THINK ON YOUR FEET AND PIVOT QUICKLY WHEN SELLING TO BUSINESSES OVER THE PHONE· YOU’RE AN EXCELLENT LISTENER AND YOU CAN COMMUNICATE CLEARLY & CONCISELY BOTH VERBALLY AND IN WRITTEN FORMS· STRONG ABILITY TO ADAPT AND POSSESS A COACHABLE MINDSET - YOU'LL RECEIVE FREQUENT COACHING· OPENNESS TO GROWTH AND DESIRE FOR LEADERSHIP OPPORTUNITIES A PLUS· DESIRE TO WORK HARD AND EXCEED GOALS- YOU’RE NOT SATISFIED UNLESS YOU’RE THE BESTBENEFITS & COMPENSATION:· BASE SALARY AND UNCAPPED COMMISSION – EXPECTED EARNINGS OF 70K TO 120K· ONGOING BONUS OPPORTUNITIES AND INCENTIVES· EMPLOYER PAID MEDICAL COVERAGE· 401(K) WITH COMPANY MATCHING HEADWALL LOGISTICS LLC PROVIDES EQUAL EMPLOYMENT OPPORTUNITIES TO ALL EMPLOYEES AND APPLICANTS FOR EMPLOYMENT AND PROHIBITS DISCRIMINATION AND HARASSMENT OF ANY TYPE WITHOUT REGARD TO RACE, COLOR, RELIGION, AGE, SEX, NATIONAL ORIGIN, DISABILITY STATUS, GENETICS, PROTECTED VETERAN STATUS, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, OR ANY OTHER CHARACTERISTIC PROTECTED BY FEDERAL, STATE OR LOCAL LAWS.THIS POLICY APPLIES TO ALL TERMS AND CONDITIONS OF EMPLOYMENT, INCLUDING RECRUITING, HIRING, PLACEMENT, PROMOTION, TERMINATION, LAYOFF, RECALL, TRANSFER, LEAVES OF ABSENCE, COMPENSATION AND TRAINING.",
    "job_skill_set": [
      "sales",
      "pipeline management",
      "negotiations",
      "customer service",
      "business development",
      "relationship building",
      "communication",
      "teamwork",
      "problem solving",
      "leadership",
      "motivation",
      "coaching",
      "adaptability",
      "resilience",
      "listening",
      "growth mindset"
    ],
    "short_keywords": [
      "adaptability",
      "building",
      "business",
      "businessdevelopment",
      "coaching",
      "communication",
      "customer",
      "development",
      "growth",
      "leadership",
      "listening",
      "management",
      "mindset",
      "motivation",
      "negotiations",
      "pipeline",
      "problem",
      "relationship",
      "resilience",
      "sales",
      "service",
      "solving",
      "teamwork"
    ]
  },
  {
    "job_id": "3901800100",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "CREATIO IS A GLOBAL VENDOR OF ONE PLATFORM TO AUTOMATE INDUSTRY WORKFLOWS AND CRM WITH NO-CODE AND A MAXIMUM DEGREE OF FREEDOM. WITH A GLOBAL TEAM OF 700+ DEDICATED PROFESSIONALS, 700+ PARTNERS AND THOUSANDS OF CUSTOMERS, CREATIO OPERATES IN 100+ COUNTRIES WORLDWIDE. THE COMPANY HAS BEEN HIGHLY RECOGNIZED BY KEY INDUSTRY ANALYSTS BEING INCLUDED INTO SEVEN FORRESTER WAVES AND FIVE GARTNER MAGIC QUADRANTS AND RECOGNIZED AS A LEADER IN TWO OF THEM.\nWE ARE AGGRESSIVELY EXPANDING OUR AMERICAS BASED TEAM WHICH IS HEADQUARTERED IN BOSTON, MA.\nTHE OPPORTUNITYWE ARE LOOKING FOR A BUSINESS DEVELOPMENT REPRESENTATIVE TO JOIN OUR CREATIO TEAM, WHO WILL WORK WITH GLOBAL MARKETS. THE ROLE IS FULL-TIME AND BASED IN BOSTON, MA. THE CANDIDATE MUST HAVE RECENTLY GRADUATED WITH A BACHELOR’S DEGREE, PREFERABLY IN BUSINESS.THE IDEAL CANDIDATE FOR THIS ROLE WOULD STRONGLY DESIRE TO FOSTER CONNECTIONS. WITH ADEPTNESS IN TELEPHONE, EMAIL, AND SOCIAL MEDIA COMMUNICATION, THEY WOULD EXCEL IN THIS POSITION. EXCEPTIONAL VERBAL COMMUNICATION AND PRESENTATION SKILLS WOULD DISTINGUISH THEM, AND THEIR INTRINSIC MOTIVATION, UNWAVERING INTEGRITY, AND COLLABORATIVE SPIRIT WOULD ENSURE EFFECTIVE TEAMWORK WITH THE SALES AND MARKETING DEPARTMENT. FAMILIARITY WITH THE SAAS INDUSTRY LANDSCAPE, PARTICULARLY WITHIN CRM AND LOW/NO-CODE SOLUTIONS, WOULD BE A VALUABLE ASSET. IN RETURN, THIS ROLE OFFERS AN ATTRACTIVE COMPENSATION PACKAGE WITH BONUSES, EXPOSURE TO A DISTINGUISHED PRODUCT, A CULTURE OF KNOWLEDGE EXCHANGE AND MENTORSHIP, EXTENSIVE PATHWAYS FOR PROFESSIONAL GROWTH, AND COMPREHENSIVE BENEFITS.\nRESPONSIBILITIES:IDENTIFYING POTENTIAL PARTNERS (COMPANIES) AND RELEVANT PEOPLE WORKING THERE;SETTING UP AUTOMATED SEQUENCES THROUGH EMAIL AND LINKEDIN AUTOMATION TOOLS;REACHING OUT TO RELEVANT PROSPECTS WITHIN THE ASSIGNED TERRITORY, GENERATING INITIAL INTEREST IN HAVING A CONVERSATION WITH CREATIO REPRESENTATIVE;GENERATING LEADS AND QUALIFIED MEETINGS FOR THE PARTNERSHIP (CHANNELS) TEAM;WORKING AND COLLABORATING WITH THE SALES TEAM;PARTICIPATING IN CREATIO DISCOVERY AND DEMO SESSIONS, EFFECTIVELY MANAGING HAND-OFFS AND TRANSITIONS;SUPPORTING VARIOUS ACTIVITIES OF THE MARKETING DEPARTMENT AND A LARGER GROWTH TEAM.\nDESIRED SKILLS AND EXPERIENCE:PHONE, EMAIL, AND SOCIAL MEDIA COMMUNICATION SKILLS;EXCEPTIONAL VERBAL COMMUNICATION AND PRESENTATION SKILLS;SELF-MOTIVATED, WITH A HIGH LEVEL OF INTEGRITY AND WORK ETHIC;EAGER TO KICKSTART A PROMISING CAREER JOURNEY AND ACTIVELY SEEKING OPPORTUNITIES TO DEVELOP ESSENTIAL SKILLS AND GAIN VALUABLE EXPERIENCES.IT WILL BE AN ADVANTAGE TO UNDERSTAND THE SAAS INDUSTRY LANDSCAPE, ESPECIALLY CRM, LOW/NO-CODE SOLUTIONS, AND HAVE EXPERIENCE WITH TOOLS FOR OUTBOUND CAMPAIGN BUILDING – APOLLO.IO, EXPANDI, SALESLOFT, REPLY, LINKEDIN SALES NAVIGATOR, AND ALIKE;FAMILIARITY WORKING WITH B2B CLIENTS/PARTNERS IS PREFERRED\nWHAT YOU SHOULD EXPECT FROM US:COMPETITIVE SALARY + COMMISSION;POWERFUL AWARD-WINNING PRODUCT. CREATIO RECOGNIZED AS A LEADER AND STRONG PERFORMER BY GARTNER AND FORRESTER;COLLABORATIVE ENVIRONMENT. OUR CORPORATE CULTURE ENCOURAGES THE EXCHANGE OF EXPERIENCE AND KNOWLEDGE, READINESS TO HELP, AND MENTORING;LIMITLESS OPPORTUNITIES FOR CAREER DEVELOPMENT. WE ORGANIZE PLENTY OF EXTERNAL AND INTERNAL TRAINING. EACH EMPLOYEE HAS AN INDIVIDUAL PROFESSIONAL AND CAREER GROWTH PLAN;OTHER ESSENTIAL BENEFITS: HEALTH INSURANCE, PAID VACATION, AND SICK LEAVE.",
    "job_skill_set": [
      "presentation skills",
      "teamwork",
      "self-motivation",
      "integrity",
      "communication",
      "collaboration",
      "problem solving",
      "adaptability",
      "CRM",
      "SaaS",
      "email communication",
      "telephone communication",
      "social media communication",
      "outbound campaign tools",
      "LinkedIn Sales Navigator",
      "Apollo.io",
      "Salesloft",
      "Expandi",
      "Reply"
    ],
    "short_keywords": [
      "adaptability",
      "apolloio",
      "business",
      "businessdevelopment",
      "campaign",
      "collaboration",
      "communication",
      "crm",
      "development",
      "email",
      "expandi",
      "integrity",
      "linkedin",
      "media",
      "navigator",
      "outbound",
      "presentation",
      "problem",
      "reply",
      "representative",
      "saas",
      "sales",
      "salesloft",
      "selfmotivation",
      "skills",
      "social",
      "solving",
      "teamwork",
      "telephone",
      "tools"
    ]
  }
]