[
  {
    "job_id": "3902864826",
    "job_title": "Information Technology Field Technician",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "COMPANY DESCRIPTION\n LAGNIAPPE IT IS A FAMILY-OWNED IT SERVICES BUSINESS LOCATED IN MANDEVILLE, LA. WE ARE DEDICATED TO SERVING SOUTH LOUISIANA AND HELPING BUSINESSES FOCUS ON THEIR OPERATIONS WHILE WE HANDLE THE TECH. OUR MISSION IS TO PROVIDE CUSTOMERS WITH HIGH-QUALITY SERVICES, EXCEPTIONAL CUSTOMER SERVICE, AND PROFESSIONALISM. WE STRIVE TO BUILD LASTING RELATIONSHIPS WITH OUR CUSTOMERS.\n ROLE DESCRIPTION\n THIS IS A FULL-TIME ROLE AS AN INFORMATION TECHNOLOGY FIELD TECHNICIAN AT LAGNIAPPE IT. AS A FIELD TECHNICIAN, YOU WILL BE RESPONSIBLE FOR DAY-TO-DAY TASKS SUCH AS PROVIDING TECHNICAL SUPPORT, TROUBLESHOOTING DESKTOP COMPUTERS AND PRINTERS, AND PERFORMING COMPUTER REPAIRS. THIS ROLE IS AN ON-SITE POSITION LOCATED IN MANDEVILLE, LA.\n QUALIFICATIONS\n TECHNICAL SUPPORT, TROUBLESHOOTING, AND COMPUTER REPAIR SKILLSEXPERIENCE WITH DESKTOP COMPUTERS AND PRINTER SUPPORTEXCELLENT PROBLEM-SOLVING AND COMMUNICATION SKILLSABILITY TO WORK IN A FAST-PACED ENVIRONMENT AND MEET DEADLINESSTRONG ATTENTION TO DETAIL AND ORGANIZATIONAL SKILLSVALID DRIVER'S LICENSE AND RELIABLE TRANSPORTATIONASSOCIATE'S OR BACHELOR'S DEGREE IN INFORMATION TECHNOLOGY OR RELATED FIELD (PREFERRED)CERTIFICATIONS SUCH AS COMPTIA A+, NETWORK+, OR MICROSOFT CERTIFIED PROFESSIONAL (MCP) (PREFERRED)",
    "job_skill_set": [
      "troubleshooting",
      "problem-solving",
      "communication",
      "attention to detail",
      "organizational skills",
      "ability to work in a fast-paced environment",
      "meeting deadlines",
      "technical support",
      "computer repair",
      "desktop computers support",
      "printer support",
      "CompTIA A+",
      "Network+",
      "Microsoft Certified Professional (MCP)"
    ],
    "short_keywords": [
      "a",
      "ability",
      "attention",
      "certified",
      "communication",
      "comptia",
      "computer",
      "computers",
      "deadlines",
      "desktop",
      "detail",
      "environment",
      "fastpaced",
      "field",
      "in",
      "information",
      "informationtechnology",
      "mcp",
      "meeting",
      "microsoft",
      "network",
      "organizational",
      "printer",
      "problemsolving",
      "professional",
      "repair",
      "skills",
      "support",
      "technical",
      "technician",
      "technology",
      "to",
      "troubleshooting",
      "work"
    ]
  },
  {
    "job_id": "3891010624",
    "job_title": "Information Technology System Administrator",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOIN A WORLD LEADER IN ENERGY MEASUREMENT AND START YOUR OWNERSHIP JOURNEY TODAY! RADIAN RESEARCH IS AN EMPLOYEE-OWNED INNOVATIVE TECHNOLOGY COMPANY WITH AN ENGAGING AND PARTICIPATIVE WORK ENVIRONMENT. WE PROVIDE ELECTRIC METER TESTING INSTRUMENTS, SYSTEMS, SOFTWARE AND SERVICES TO ELECTRIC UTILITY COMPANIES, ELECTRIC METER MANUFACTURERS AND NATIONAL METROLOGY INSTITUTES FOR ENGINEERING, LABORATORY, SHOP AND SITE APPLICATIONS. RADIAN PROVIDES BOTH PORTABLE AND PRIMARY ENERGY REFERENCE STANDARDS UNEQUALED IN ACCURACY, STABILITY, AND RELIABILITY. THE FOCUS OF RADIAN IS OUR CUSTOMER, AND THE HEART OF RADIAN IS OUR TEAM. WE RECOGNIZE AND VALUE THE 3 CS OF RADIAN’S CULTURE: CUSTOMER-CENTRIC FOCUS, CONTINUOUS IMPROVEMENT MINDSET, AND CARE FOR OUR CUSTOMER, COMPANY, COMMUNITY, AND FOR EACH OTHER.  THE SYSTEM ADMINISTRATOR WILL BE RESPONSIBLE FOR INSTALLING, MAINTAINING, UPGRADING, AND SECURING OUR SOFTWARE, HARDWARE, AND NETWORKS. THE ROLE REQUIRES A TECHNICALLY SKILLED INDIVIDUAL WHO CAN MANAGE OUR IT INFRASTRUCTURE AND PROVIDE HARDWARE AND SOFTWARE SUPPORT TO INTERNAL USERS. THE POSITION IS LOCATED IN LAFAYETTE, INDIANA AND ACTS AS THE PRIMARY ORGANIZATIONAL INTERFACE WITH VENDORS FOR COMPUTER RELATED SERVICES. OUR VALUES: WE VALUE DYNAMIC, HIGH-ENERGY, HIGHLY INTERACTIVE RELATIONSHIPS WHICH REQUIRE EXCELLENT COMMUNICATION, COLLABORATION, AND MULTI-TASKING SKILLS, WHILE SIMULTANEOUSLY PROVIDING UNDIVIDED ATTENTION TO OUR CUSTOMERS AND THEIR NEEDS. IN ADDITION, WE VALUE INDIVIDUALS WHO WANT TO GROW IN THEIR SKILLS AND DEMONSTRATE SELF-INITIATIVE IN OUR SUPPORTED AND ACCOUNTABLE ENVIRONMENT. THIS POSITION REQUIRES A HIGH DEGREE OF ACCURACY AND DECISION-MAKING CAPABILITIES THAT MUST BE BOTH CUSTOMER-CENTRIC AND IN THE COMPANY'S BEST INTEREST.  RESPONSIBILITIES: INSTALL, CONFIGURE, SUPPORT AND SECURE LOCAL AREA NETWORK (LAN), WIDE AREA NETWORK (WAN), AND INTERNET SYSTEMS INCLUDING SUPPORT OF FIREWALLS, ROUTERS, AND SWITCHES.PLAN, COORDINATE, AND IMPLEMENT NETWORK SECURITY MEASURES TO PROTECT DATA, SOFTWARE, AND HARDWARE.MAINTAIN AND UPDATE SERVER HARDWARE, SOFTWARE, AND PRINTERS.MAINTAIN DOMAIN USER ACCOUNTS AND PERMISSIONS.PERFORM DATA BACKUPS AND DISASTER RECOVERY OPERATIONS.MAINTAIN AND UPDATE COMPUTER HARDWARE AND SOFTWARE. PROVIDE USER SUPPORT FOR HARDWARE AND SOFTWARE.TRACK COMPANY SOFTWARE LICENSING.ANTIVIRUS SOFTWARE – MAINTAIN AND KEEP SOFTWARE UP TO DATE.PHONE SYSTEM – ADMINISTER AND MAINTAIN PHONE HARDWARE, SOFTWARE, AND ACCOUNTS.MS M365 EMAIL AND AZURE/ENTRA ADMINISTRATION.RESEARCH DATA AND VOICE SERVICE PROVIDERS AND PROVIDE SUGGESTIONS TO MANAGEMENT.INSTALL, ADMINISTER, AND MAINTAIN SQL SERVER DATABASES.MS DYNAMICS NAV (BUSINESS CENTRAL) – MAINTAIN USER ACCOUNTS AND PERMISSIONS. MAKE CHANGES TO SYSTEM REPORTS, ETC. WORK WITH CONSULTANTS TO TEST SOFTWARE CHANGES PRIOR TO IMPLEMENTATION.OTHER DUTIES ASSIGNED BY SUPERVISION OR MANAGEMENT. EDUCATION: BACHELOR’S DEGREE IN COMPUTER SCIENCE, INFORMATION TECHNOLOGY, OR RELATED FIELD, OR EQUIVALENT EXPERIENCE. EXPERIENCE: 3-5 YEARS OF SYSTEM ADMINISTRATION, NETWORK ADMINISTRATION, OR SIMILAR ROLE. KNOWLEDGE OF: WINDOWS OPERATING SYSTEMS AND APPLICATIONSVMWARE VIRTUALIZATIONM365 OFFICE PRODUCTIVITY SOFTWAREAZURE OR SIMILAR CLOUD MANAGEMENTTCP/IP NETWORKINGCYBER SECURITYSQL DATABASESPROGRAMMING OR SCRIPTING LANGUAGES SKILLED AT: ACTIVE DIRECTORY NETWORK ADMINISTRATIONCOMPUTER TROUBLESHOOTING AND REPAIR – HARDWARE AND SOFTWAREUSER COMPUTER SUPPORT – HARDWARE AND SOFTWAREEXCELLENT COMMUNICATION SKILLS  ",
    "job_skill_set": [
      "Network Administration",
      "SQL Databases",
      "TCP/IP Networking",
      "Programming or Scripting Languages",
      "Communication",
      "Collaboration",
      "Multi-tasking",
      "Customer-Centric Focus",
      "Decision-Making",
      "Self-Initiative",
      "Continuous Improvement Mindset",
      "Attention to Detail",
      "Windows Operating Systems",
      "Cyber Security",
      "VMware Virtualization",
      "M365 Office Productivity Software",
      "Azure Cloud Management",
      "Active Directory",
      "Computer Troubleshooting and Repair",
      "User Computer Support",
      "Firewall Management",
      "Data Backup and Disaster Recovery",
      "Phone System Administration",
      "MS Dynamics NAV (Business Central)"
    ],
    "short_keywords": [
      "active",
      "administration",
      "administrator",
      "and",
      "attention",
      "azure",
      "backup",
      "business",
      "central",
      "cloud",
      "collaboration",
      "communication",
      "computer",
      "continuous",
      "customercentric",
      "cyber",
      "data",
      "databases",
      "decisionmaking",
      "detail",
      "directory",
      "disaster",
      "dynamics",
      "firewall",
      "focus",
      "improvement",
      "information",
      "informationtechnology",
      "languages",
      "m365",
      "management",
      "mindset",
      "ms",
      "multitasking",
      "nav",
      "network",
      "networking",
      "office",
      "operating",
      "or",
      "phone",
      "productivity",
      "programming",
      "recovery",
      "repair",
      "scripting",
      "security",
      "selfinitiative",
      "software",
      "sql",
      "support",
      "system",
      "systems",
      "tcpip",
      "technology",
      "to",
      "troubleshooting",
      "user",
      "virtualization",
      "vmware",
      "windows"
    ]
  },
  {
    "job_id": "3902324071",
    "job_title": "Lead Information Technology Specialist (Systems Administration)",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "SUMMARY\n\nTHIS POSITION SERVES AS THE INFORMATION SYSTEM SECURITY OFFICER (ISSO) IN THE NIH BUSINESS SYSTEMS (NBS) UNDER THE OFFICE OF MANAGEMENT, OFFICE OF THE DIRECTOR. THE OVERALL OBJECTIVE OF THE NBS IS TO FACILITATE THE SCIENTIFIC MISSION OF THE NIH AND PROVIDE AN ADMINISTRATIVE/SCIENTIFIC SYSTEM THAT IS COST EFFECTIVE AND PROVIDES ACCURATE AND TIMELY INFORMATION.\n\nLEARN MORE ABOUT THIS AGENCY\n\nDUTIES\n\nPERFORM TECHNICAL ANALYSIS TO DIAGNOSE AND RESOLVE IT CONFIGURATION OR INTEGRATION ISSUES AND IDENTIFY PROBLEMATIC TRENDS AND PATTERNSDEVELOP CUSTOMER SUPPORT POLICIES, PROCEDURES, AND STANDARDS FOR USE IN PROVIDING CUSTOMER SUPPORT. LEAD A TEAM IN IT SYSTEMS DEVELOPMENT PROJECTS FROM DESIGN TO SUPPORT INCLUDING PLAN AND SCHEDULE DEVELOPMENT, ESTIMATING RESOURCE REQUIREMENTS, DEFINING MILESTONES AND DELIVERABLES, AND DEFINING POST-IMPLEMENTATION SUPPORT REQUIREMENTS. EVALUATE SPECIFICATIONS AND FEATURES OF NEW PRODUCTS, PERFORMING PRODUCT COMPARISONS, FEASIBILITY AND COST BENEFIT ANALYSES, AND PERFORMANCE AND COMPATIBILITY TESTING. MAKE RECOMMENDATIONS FOR FUTURE IMPLEMENTATION OF IT PRODUCTS AND SERVICES TO MANAGEMENT. \n\nREQUIREMENTS\n\n CONDITIONS OF EMPLOYMENT\n\nU.S. CITIZENSHIP REQUIREMENT OR PROOF OF BEING A U.S. NATIONAL MUST BE MET BY CLOSING DATE. EMPLOYMENT IS SUBJECT TO THE SUCCESSFUL COMPLETION OF A BACKGROUND INVESTIGATION, VERIFICATION OF QUALIFICATIONS, COMPLETION OF ONBOARDING FORMS, SUBMISSION OF REQUIRED DOCUMENTS, AND ANY OTHER JOB-RELATED REQUIREMENT BEFORE OR AFTER APPOINTMENT. APPLICANTS MUST MEET ALL QUALIFICATION REQUIREMENTS BY THE CLOSING DATE OF THIS ANNOUNCEMENT. MALES BORN AFTER DECEMBER 31, 1959 MUST BE REGISTERED WITH THE SELECTIVE SERVICE. \n\n QUALIFICATIONS\n\nIN ORDER TO QUALIFY FOR THE IT SPECIALIST, GS-2210-14 POSITION, YOU MUST HAVE IT RELATED EXPERIENCE DEMONSTRATED BY PAID OR UNPAID EXPERIENCE OBTAINED IN EITHER THE PRIVATE OR PUBLIC SECTOR, AND/OR COMPLETION OF SPECIFIC, INTENSIVE TRAINING THAT DEMONSTRATES THAT YOU POSSESS EACH OF THE FOLLOWING FOUR COMPETENCIES:\n\nATTENTION TO DETAIL - IS THOROUGH WHEN PERFORMING WORK AND CONSCIENTIOUS ABOUT ATTENDING TO DETAIL;CUSTOMER SERVICE - WORKS WITH CLIENTS AND CUSTOMERS (THAT IS, ANY INDIVIDUALS WHO USE OR RECEIVE THE SERVICES OR PRODUCTS THAT YOUR WORK UNIT PRODUCES, INCLUDING THE GENERAL PUBLIC, INDIVIDUALS WHO WORK IN THE AGENCY, OTHER AGENCIES, OR ORGANIZATIONS OUTSIDE THE GOVERNMENT) TO ASSESS THEIR NEEDS, PROVIDE INFORMATION OR ASSISTANCE, RESOLVE THEIR PROBLEMS, OR SATISFY THEIR EXPECTATIONS; KNOWS ABOUT AVAILABLE PRODUCTS AND SERVICES; IS COMMITTED TO PROVIDING QUALITY PRODUCTS AND SERVICES;ORAL COMMUNICATION - EXPRESSES INFORMATION (FOR EXAMPLE, IDEAS OR FACTS) TO INDIVIDUALS OR GROUPS EFFECTIVELY, TAKING INTO ACCOUNT THE AUDIENCE AND NATURE OF THE INFORMATION (FOR EXAMPLE, TECHNICAL, SENSITIVE, CONTROVERSIAL); MAKES CLEAR AND CONVINCING ORAL PRESENTATIONS; LISTENS TO OTHERS, ATTENDS TO NONVERBAL CUES, AND RESPONDS APPROPRIATELY. PROBLEM SOLVING - IDENTIFIES PROBLEMS; DETERMINES ACCURACY AND RELEVANCE OF INFORMATION; USES SOUND JUDGMENT TO GENERATE AND EVALUATE ALTERNATIVES, AND TO MAKE RECOMMENDATIONS. \n\nAND\n\nYOU MUST DEMONSTRATE IN YOUR RESUME THAT YOU HAVE AT LEAST ONE (1) YEAR OF QUALIFYING SPECIALIZED EXPERIENCE EQUIVALENT TO AT LEAST THE GS-13 LEVEL IN THE FEDERAL SERVICE OBTAINED IN EITHER THE PRIVATE OR PUBLIC SECTOR, TYPICALLY GAINED IN THE IT FIELD OR THROUGH PERFORMING IT RELATED TASKS SUCH AS: PERFORMING TECHNICAL ANALYSIS TO DIAGNOSE AND RESOLVE IT CONFIGURATION, INTEGRATION AND SECURITY ISSUES; LEADING IT SYSTEMS DEVELOPMENT PROJECTS THROUGH THE ENTIRE PROJECT LIFECYCLE TO INCLUDE: DEVELOPING PROJECT SCHEDULE, ESTIMATING RESOURCE REQUIREMENTS, DEFINING MILESTONES AND DELIVERABLES, AND DEFINING POST-IMPLEMENTATION SUPPORT REQUIREMENTS; RECOMMENDING IT POLICY AND PROCEDURAL UPDATES TO ENSURE COMPLIANCE AND RISK MITIGATION; CONDUCTING FEASIBILITY, PERFORMANCE AND COMPATIBILITY TESTING AND COST BENEFIT ANALYSES OF NEW IT PRODUCTS AND SERVICES; AND MAKING RECOMMENDATIONS FOR FUTURE IMPLEMENTATION OF IT PRODUCTS AND SERVICES TO MANAGEMENT.\n\nYOU WILL RECEIVE CREDIT FOR ALL EXPERIENCE MATERIAL TO THE POSITION, INCLUDING EXPERIENCE GAINED IN RELIGIOUS, CIVIC, WELFARE, SERVICE, AND ORGANIZATIONAL ACTIVITIES, REGARDLESS OF WHETHER YOU RECEIVED PAY.\n\nDO NOT COPY AND PASTE THE DUTIES, SPECIALIZED EXPERIENCE, OR OCCUPATIONAL ASSESSMENT QUESTIONNAIRE FROM THIS ANNOUNCEMENT INTO YOUR RESUME AS THAT WILL NOT BE CONSIDERED A DEMONSTRATION OF YOUR QUALIFICATIONS FOR THIS POSITION.\n\nPREVIEW ASSESSMENT QUESTIONNAIRE BEFORE YOU APPLY:  HTTPS://APPLY.USASTAFFING.GOV/VIEWQUESTIONNAIRE/12376442\n\nEDUCATION\n\nTHIS JOB DOES NOT HAVE AN EDUCATION QUALIFICATION REQUIREMENT.\n\nADDITIONAL INFORMATION\n\nA ONE-YEAR PROBATIONARY PERIOD MAY BE REQUIRED UPON SELECTION/PLACEMENT. THIS POSITION IS DESIGNATED AS A \" NON-EMERGENCY/TELEWORKER \" POSITION AND THE SELECTED CANDIDATE WILL BE CONSIDERED A \" NON-EMERGENCY/TELEWORKER \" EMPLOYEE. IN THE EVENT OF A CLOSURE, YOU MUST BE AVAILABLE TO TELEWORK OR REQUEST LEAVE. AT THE SUPERVISOR'S DISCRETION, THIS POSITION MAY OFFER WORK SCHEDULE FLEXIBILITIES: TELEWORK (WORK FROM HOME ON A REGULAR BASIS OR AD HOC BASIS BUT REPORTS TO THE OFFICE AT LEAST ONCE A WEEK/TWO DAYS A PAY PERIOD). IF SELECTED, YOU WILL BE REQUIRED TO COMPLETE A CONFIDENTIAL FINANCIAL DISCLOSURE REPORT, OGE FORM 450 TO DETERMINE IF A CONFLICT OR AN APPEARANCE OF A CONFLICT EXISTS BETWEEN YOUR FINANCIAL INTEREST AND YOUR PROSPECTIVE POSITION WITH THE AGENCY. THIS INFORMATION IS REQUIRED ANNUALLY. FOR INFORMATION, VISIT THE NIH ETHICS WEBSITE: HTTPS://ETHICS.OD.NIH.GOV/FD. PHS COMMISSIONED OFFICERS INTERESTED IN PERFORMING THE DUTIES OF THIS POSITION WITHIN THE COMMISSIONED CORPS SHOULD APPLY ONLINE TO THIS ANNOUNCEMENT TO RECEIVE CONSIDERATIONWE MAY MAKE ADDITIONAL SELECTIONS FOR SIMILAR POSITIONS WITHIN THE COMMUTING AREA(S) OF THE LOCATIONS LISTED THROUGH THIS VACANCY ANNOUNCEMENT. BY APPLYING, YOU AGREE TO HAVE YOUR APPLICATION SHARED WITH ANY INTERESTED SELECTING OFFICIAL(S). CLEARANCE OF CTAP/ICTAP WILL BE APPLIED FOR SIMILAR POSITIONS. THE NATIONAL INSTITUTES OF HEALTH PARTICIPATES IN THE USCIS ELECTRONIC EMPLOYMENT ELIGIBILITY VERIFICATION PROGRAM ( E-VERIFY ). E-VERIFY HELPS EMPLOYERS DETERMINE EMPLOYMENT ELIGIBILITY OF NEW HIRES AND THE VALIDITY OF THEIR SOCIAL SECURITY NUMBERS. THE NIH MAINTAINS A TOBACCO FREE WORK ENVIRONMENT AND CAMPUS. MUST BE ABLE TO PERFORM THE ESSENTIAL DUTIES OF THE POSITION, WITH OR WITHOUT REASONABLE ACCOMMODATION. VISIT OUR APPLICANT FAQS PAGE FOR HELPFUL INFORMATION ON THE APPLICATION PROCESS. VISIT OUR TOTAL COMPENSATION PAGE AND THIS SAMPLE FOR A DETAILED LOOK INTO THE BENEFITS, AWARDS, LEAVE, RETIREMENT, AND OTHER INCENTIVES EMPLOYEES MAY RECEIVE AS PART OF A REWARDING WORK ENVIRONMENT. \n\nREAD MORE\n\nHELP\n\nREVIEW OUR BENEFITS \n\nHOW YOU WILL BE EVALUATED\n\nYOU WILL BE EVALUATED FOR THIS JOB BASED ON HOW WELL YOU MEET THE QUALIFICATIONS ABOVE.\n\nYOU WILL BE ASSESSED ON THE FOLLOWING COMPETENCIES (KNOWLEDGE, SKILLS, ABILITIES, AND OTHER CHARACTERISTICS):\n\nQ1. KNOWLEDGE OF COMPUTER SYSTEMS ANALYSIS PRINCIPLES AND TECHNIQUES. Q2. ABILITY TO ANALYZE AND REFINE COMPUTER SYSTEMS REQUIREMENTS, CAPABILITIES, AND LIMITATIONS. Q3. ABILITY TO PERFORM IT PROJECT MANAGEMENT DUTIES AND FUNCTIONS IN A LEADERSHIP CAPACITY. Q4. SKILL IN ADVISING ON SYSTEMS DESIGN AND IT BUSINESS SOLUTIONS\n\nIF YOU MEET THE MINIMUM QUALIFICATIONS FOR THIS POSITION, YOUR APPLICATION AND RESPONSES TO THE ONLINE QUESTIONNAIRE WILL BE EVALUATED UNDER CATEGORY RATING AND SELECTION PROCEDURES FOR PLACEMENT IN ONE OF THE FOLLOWING CATEGORIES:\n\nBEST QUALIFIED - FOR THOSE WHO ARE SUPERIOR IN THE EVALUATION CRITERIAWELL QUALIFIED - FOR THOSE WHO EXCEL IN THE EVALUATION CRITERIAQUALIFIED - FOR THOSE WHO ONLY MEET THE MINIMUM QUALIFICATION REQUIREMENTS\n\nTHE CATEGORY RATING PROCESS DOES NOT ADD VETERANS' PREFERENCE POINTS BUT PROTECTS THE RIGHTS OF VETERANS BY PLACING THEM AHEAD OF NON-PREFERENCE ELIGIBLES WITHIN EACH CATEGORY. APPLICANTS DETERMINED TO BE BEST QUALIFIED WILL BE REFERRED FOR FURTHER CONSIDERATION. PREFERENCE ELIGIBLES IN THE BEST QUALIFIED CATEGORY ARE REFERRED BEFORE ALL OTHER APPLICANTS.\n\nTO DETERMINE YOUR QUALIFICATIONS AND REFERRAL STATUS, WE MAY REVIEW YOUR RESUME AND SUPPORTING DOCUMENTATION AND COMPARE IT AGAINST YOUR RESPONSES TO THE VACANCY QUESTIONNAIRE. ENSURE YOU SUPPORT YOUR SELF-RATINGS BY THE INFORMATION YOU PROVIDE IN YOUR APPLICATION. WE MAY VERIFY OR ASSESS YOUR QUALIFICATIONS AT ANY TIME. INFLATED OR UNSUPPORTED QUALIFICATIONS MAY AFFECT YOUR RATING. ANY MISREPRESENTATION OR MATERIAL OMISSION OF FACTS MAY BE SUFFICIENT CAUSE TO END FURTHER CONSIDERATION OF YOUR CANDIDACY. PERSONS LISTED AS HAVING KNOWLEDGE OF YOUR PAST ACCOMPLISHMENTS OR EXPERIENCE IN YOUR APPLICATION MAY BE CONTACTED FOR VERIFICATION PURPOSES AT ANY TIME. VERIFICATION MAY, BUT NEED NOT, BEGIN PRIOR TO RECEIVING AN OFFER.\n\nTO BE CONSIDERED WELL QUALIFIED FOR THE PURPOSES OF THE CAREER TRANSITION ASSISTANCE PROGRAM (CTAP) AND THE INTERAGENCY CAREER TRANSITION ASSISTANCE PROGRAM (ICTAP) , YOU MUST BE ABLE TO SATISFACTORILY PERFORM THE DUTIES OF THE POSITION UPON ENTRY AND SUBSTANTIVELY EXCEED THE BASIC QUALIFICATIONS BY SCORING AT LEAST AN 85 ON THE ASSESSMENT AND MEET ALL ELIGIBILITY, PHYSICAL, MEDICAL, SUITABILITY, AND ALL OTHER REQUIREMENTS.",
    "job_skill_set": [
      "IT configuration",
      "IT integration",
      "IT security",
      "project management",
      "technical analysis",
      "customer support policies",
      "performance testing",
      "system design",
      "attention to detail",
      "customer service",
      "oral communication",
      "problem solving",
      "leadership",
      "cost benefit analysis",
      "compatibility testing"
    ],
    "short_keywords": [
      "administration",
      "analysis",
      "attention",
      "benefit",
      "communication",
      "compatibility",
      "configuration",
      "cost",
      "customer",
      "design",
      "detail",
      "information",
      "informationtechnology",
      "integration",
      "it",
      "lead",
      "leadership",
      "management",
      "oral",
      "performance",
      "policies",
      "problem",
      "project",
      "security",
      "service",
      "solving",
      "specialist",
      "support",
      "system",
      "systems",
      "technical",
      "technology",
      "testing",
      "to"
    ]
  },
  {
    "job_id": "3899540380",
    "job_title": "Information Technology Analyst Principal – Enterprise Data Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "SOLANO COUNTY DEPARTMENT OF INFORMATION TECHNOLOGY INFORMATION TECHNOLOGY ANALYST PRINCIPAL – ENTERPRISE DATA MANAGERSALARY: $124,790.33 - $151,683.43FFD: MAY 10, 2024\nTHE SOLANO COUNTY DEPARTMENT OF INFORMATION TECHNOLOGY IS HIRING AN INFORMATION TECHNOLOGY ANALYST PRINCIPAL – ENTERPRISE DATA MANAGER!THE SOLANO COUNTY DEPARTMENT OF INFORMATION TECHNOLOGY IS HIRING AN IT ANALYST PRINCIPAL - ENTERPRISE DATA MANAGER (EDM) WHO WILL LEAD THE DATA WAREHOUSE DEVELOPMENT FOR HEALTH AND SOCIAL SERVICES DATA SOURCES USING THE AZURE TOOLSET. THIS POSITION WILL MANAGE THE DATA MANAGEMENT TEAM. AS AN EXPERIENCED IT MANAGER, THE IT ANALYST PRINCIPAL WILL PARTICIPATE IN THE DEVELOPMENT AND IMPLEMENTATION OF GOALS, OBJECTIVES, POLICIES, AND PRIORITIES RELATED TO INFORMATION TECHNOLOGY, AND MAKE RECOMMENDATIONS THAT WILL RESULT IN IMPLEMENTATION OF POLICIES AND PROCEDURES. THE IT ANALYST PRINCIPAL WILL OVERSEE, COORDINATE, AND PARTICIPATE IN ORGANIZATIONAL, OPERATIONAL, AND PROCEDURAL ANALYSES TO DETERMINE INFORMATION INPUT, WORK PROCESSES, AND DESIRED OUTPUT FOR POTENTIAL AND/OR UP-DATED COMPUTERIZATION FOR A LARGE NUMBER OF USERS IN SUPPORT OF MULTI-DEPARTMENTAL OR COUNTY-WIDE APPLICATIONS. THE IT ANALYST PRINCIPAL WILL RECOMMEND COUNTY-WIDE INFORMATION TECHNOLOGY STANDARDS, AND EVALUATE AND DEVELOP PROPOSED STANDARDS FOR HARDWARE, SOFTWARE, AND NETWORKS.\nTHE IDEAL EDM WILL HAVE EXTENSIVE EXPERIENCE AND EXPERTISE IN DATA GOVERNANCE, DATA MANAGEMENT, AND DATA WAREHOUSING WITH MODERN TECHNOLOGY AND CLOUD PLATFORMS. THIS PERSON WILL HAVE EXCELLENT COMMUNICATION SKILLS AND BE FORWARD THINKING AND COMFORTABLE WORKING AUTONOMOUSLY. THE PERSON WILL ALSO SUPERVISE A TEAM OF IT PROFESSIONALS AND LEAD THE EFFORT TO BUILD OUT A DATA WAREHOUSE AND PROVIDE A SOLID STRUCTURE FOR THE ANALYTICS TEAM TO BRING MEANINGFUL AND TRUSTED INFORMATION TO THE END USERS.\nTO VIEW THE DETAILED RECRUITMENT BROCHURE, VISIT HTTPS://ONLINE.FLIPBUILDER.COM/KPER/NZOJ/\nFOR MORE INFORMATION CONTACT:KRISTIN MORRISCPS HR CONSULTINGPH: 916-471-3405KMORRIS@CPSHR.US",
    "job_skill_set": [
      "data governance",
      "data management",
      "cloud platforms",
      "hardware standards",
      "software standards",
      "network standards",
      "communication",
      "leadership",
      "autonomy",
      "analytical thinking",
      "team management",
      "problem solving",
      "data warehousing",
      "Azure"
    ],
    "short_keywords": [
      "analyst",
      "analytical",
      "autonomy",
      "azure",
      "cloud",
      "communication",
      "data",
      "enterprise",
      "governance",
      "hardware",
      "information",
      "informationtechnology",
      "leadership",
      "management",
      "manager",
      "network",
      "platforms",
      "principal",
      "problem",
      "software",
      "solving",
      "standards",
      "team",
      "technology",
      "thinking",
      "warehousing"
    ]
  },
  {
    "job_id": "3899930721",
    "job_title": "Information Technology Help Desk",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "RESPONSIBILITIES:\n• INSTALL AND CONFIGURE PC’S AND MAC’S, PRINTERS AND PERIPHERALS WITHIN ESTABLISHED STANDARDS AND GUIDELINES• INSTALL NEW HARDWARE AND SOFTWARE UPGRADES REQUESTED FROM USERS• ANALYZE AND SOLVE TECHNICAL PROBLEMS BY USING PROBLEM-SOLVING SKILLS• CONDUCT ANALYSIS AND TROUBLESHOOTING VIA TELEPHONE, EMAIL AND USING REMOTE ASSISTANCE• RESOLVE TECHNICAL PROBLEMS WITH COMPUTING EQUIPMENT AND SOFTWARE• ASSIST VISITORS AND VIPS WITH THE ONGOING USABILITY OF PC, PERIPHERAL DEVICES, AND SOFTWARE• PROVIDE ON-SITE TECHNICAL SUPPORT AND END-USER TECHNICAL TRAINING AT ASSIGNED SITES WHICH MAY INCLUDE TRAVEL TO REMOTE SITES• CREATE AND UPDATE MICROSOFT-BASED OS IMAGE AND APPLE OS X FOR INTERNAL USAGE• CREATE AND UPDATE PE BOOTABLE WINDOWS DISC FOR DEPLOYMENT PURPOSE• PROVIDE TECHNICAL SUPPORT FOR IT SERVICES IN CONFERENCE ROOMS• ASSIST EMPLOYEES IN COMPANY EVENTS, SUCH AS EXHIBITS• INSTALL AND PERFORM MAINTENANCE ON PROPRIETARY SYSTEM/S• MAY BE ASKED TO LEAD PROJECTS AND/OR TECHNOLOGY EVALUATIONS AND MAKE RECOMMENDATIONS TO MANAGEMENT TEAM\nQUALIFICATIONS:• 2-YEAR DEGREE OR BETTER OR EQUIVALENT WORK EXPERIENCE WITH HS DEGREE OR MILITARY EXPERIENCE• WORKING KNOWLEDGE OF FUNDAMENTAL OPERATIONS OF RELEVANT SOFTWARE, HARDWARE, AND OTHER EQUIPMENT• 3+ YEARS OF RELATED EXPERIENCE• SENSITIVITY TO WORKING WITH AN ETHNICALLY, LINGUISTICALLY, AND CULTURALLY DIVERSE ENVIRONMENT• HIGH LEVEL OF ORGANIZATIONAL SKILLS AND ATTENTION TO DETAIL• KNOWLEDGE OF WINDOWS OS IN ENTERPRISE ENVIRONMENT• UNDERSTANDING OF PC TECHNOLOGY (MS OFFICE, INTERNET, WINDOWS)• PROJECT MANAGEMENT FUNDAMENTALS",
    "job_skill_set": [
      "PC Configuration",
      "Mac Configuration",
      "Technical Problem Solving",
      "Remote Assistance",
      "Microsoft OS Imaging",
      "Apple OS X",
      "Windows Deployment",
      "Technical Support",
      "Project Management",
      "Software Installation",
      "Hardware Upgrades",
      "Maintenance of Proprietary Systems",
      "Communication",
      "Organizational Skills",
      "Attention to Detail",
      "Cultural Sensitivity",
      "Teamwork",
      "Customer Service",
      "Printer Setup"
    ],
    "short_keywords": [
      "apple",
      "assistance",
      "attention",
      "communication",
      "configuration",
      "cultural",
      "customer",
      "deployment",
      "desk",
      "detail",
      "hardware",
      "help",
      "imaging",
      "information",
      "informationtechnology",
      "installation",
      "mac",
      "maintenance",
      "management",
      "microsoft",
      "of",
      "organizational",
      "os",
      "pc",
      "printer",
      "problem",
      "project",
      "proprietary",
      "remote",
      "sensitivity",
      "service",
      "setup",
      "skills",
      "software",
      "solving",
      "support",
      "systems",
      "teamwork",
      "technical",
      "technology",
      "to",
      "upgrades",
      "windows",
      "x"
    ]
  },
  {
    "job_id": "3888939626",
    "job_title": "Information Technology Support Specialist (Active TS/SCI /wPoly)",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOB DESCRIPTION:\n\nTYPE OF REQUISITION:\n\nREGULAR\n\nCLEARANCE LEVEL MUST CURRENTLY POSSESS:\n\nTOP SECRET SCI + POLYGRAPH\n\nCLEARANCE LEVEL MUST BE ABLE TO OBTAIN:\n\nTOP SECRET SCI + POLYGRAPH\n\nSUITABILITY:\n\nPUBLIC TRUST/OTHER REQUIRED:\n\nJOB FAMILY:\n\nHELP DESK\n\nSKILLS:\n\nJOB QUALIFICATIONS:\n\nCOMPUTER REPAIRS, HELP DESK SUPPORT, INFORMATION TECHNOLOGY (IT), REMOTE SUPPORT, TROUBLESHOOTING HARDWARE\n\nCERTIFICATIONS:\n\nNONE - NONE\n\nEXPERIENCE:\n\n3 + YEARS OF RELATED EXPERIENCE\n\nUS CITIZENSHIP REQUIRED:\n\nYES\n\nJOB DESCRIPTION:\n\nTRANSFORM TECHNOLOGY INTO OPPORTUNITY AS AN INFORMATION TECHNOLOGY SUPPORT SPECIALIST WITH GDIT. A CAREER IN ENTERPRISE IT MEANS CONNECTING AND ENHANCING THE SYSTEMS THAT MATTER MOST. AT GDIT YOU’LL BE AT THE FOREFRONT OF INNOVATION AND PLAY A MEANINGFUL PART IN IMPROVING HOW AGENCIES OPERATE.\n\nAT GDIT, PEOPLE ARE OUR DIFFERENTIATOR. AS AN INFORMATION TECHNOLOGY SUPPORT SPECIALIST YOU WILL HELP ENSURE TODAY IS SAFE AND TOMORROW IS SMARTER. OUR WORK DEPENDS ON AN INFORMATION TECHNOLOGY SUPPORT SPECIALIST JOINING OUR TEAM TO PROVIDE TECHNICAL SUPPORT AND TROUBLESHOOTING SERVICES FOR INCOMING QUERIES AND ISSUES RELATED TO COMPUTER SYSTEMS, SOFTWARE, AND HARDWARE. RESPOND TO QUERIES EITHER IN PERSON OR OVER THE PHONE.\n\nHOW AN INFORMATION TECHNOLOGY SUPPORT SPECIALIST WILL MAKE AN IMPACT\n\nPROVIDES TECHNICAL SUPPORT AND TROUBLESHOOTING TO NETWORK, DESKTOP, AND/OR SYSTEMS HARDWARE AND SOFTWAREMAY COACH AND PROVIDE GUIDANCE TO LESS-EXPERIENCED PROFESSIONALSAPPLIES BASIC DIAGNOSTIC TECHNIQUES TO IDENTIFY PROBLEMS, INVESTIGATE CAUSES, AND RECOMMEND SOLUTIONSPROVIDES REMOTE SUPPORT ACCESS THROUGH DESKTOP MIRRORING AND OTHER REMOTE ACCESS APPLICATIONS FOR WORLDWIDE SITESIDENTIFY, INVESTIGATE, RESOLVE, AND FOLLOW-UP PROBLEMS BROUGHT TO THE HELPDESK BY USERS OF CLOUD INFRASTRUCTURE\n\nWHAT YOU’LL NEED TO SUCCEED:\n\nREQUIRED EXPERIENCE: 3+ YEARS OF RELATED EXPERIENCEREQUIRED TECHNICAL SKILLS: INSTALLS, MODIFIES, AND REPAIRS COMPUTER HARDWARE AND SOFTWARE BOTH IN PERSON AND USING REMOTE ACCESS TOOLSREQUIRED: IAT LEVEL 1 CERTIFICATE IS REQUIRED WITHIN 6 MONTHS OF START DATESECURITY CLEARANCE LEVEL: TS/SCI W/POLYREQUIRED SKILLS AND ABILITIES: MAINTAINS CURRENT KNOWLEDGE OF RELEVANT TECHNOLOGY AS ASSIGNEDLOCATION: ON-SITE IN ANNAPOLIS JUNCTION, MDUS CITIZENSHIP REQUIRED\n\nGDIT IS YOUR PLACE:\n\n401K WITH COMPANY MATCHCOMPREHENSIVE HEALTH AND WELLNESS PACKAGESINTERNAL MOBILITY TEAM DEDICATED TO HELPING YOU OWN YOUR CAREERPROFESSIONAL GROWTH OPPORTUNITIES INCLUDING PAID EDUCATION AND CERTIFICATIONSCUTTING-EDGE TECHNOLOGY YOU CAN LEARN FROM\n\n#GREENWAY\n\n#ITPOLYMD\n\n#GDPOLY\n\nSCHEDULED WEEKLY HOURS:\n\n40\n\nTRAVEL REQUIRED:\n\nLESS THAN 10%\n\nTELECOMMUTING OPTIONS:\n\nONSITE\n\nWORK LOCATION:\n\nUSA MD ANNAPOLIS JUNCTION\n\nADDITIONAL WORK LOCATIONS:\n\nWE ARE GDIT. A GLOBAL TECHNOLOGY AND PROFESSIONAL SERVICES COMPANY THAT DELIVERS CONSULTING, TECHNOLOGY AND MISSION SERVICES TO EVERY MAJOR AGENCY ACROSS THE U.S. GOVERNMENT, DEFENSE AND INTELLIGENCE COMMUNITY. OUR 30,000 EXPERTS EXTRACT THE POWER OF TECHNOLOGY TO CREATE IMMEDIATE VALUE AND DELIVER SOLUTIONS AT THE EDGE OF INNOVATION. WE OPERATE ACROSS 30 COUNTRIES WORLDWIDE, OFFERING LEADING CAPABILITIES IN DIGITAL MODERNIZATION, AI/ML, CLOUD, CYBER AND APPLICATION DEVELOPMENT. TOGETHER WITH OUR CLIENTS, WE STRIVE TO CREATE A SAFER, SMARTER WORLD BY HARNESSING THE POWER OF DEEP EXPERTISE AND ADVANCED TECHNOLOGY.\n\nWE CONNECT PEOPLE WITH THE MOST IMPACTFUL CLIENT MISSIONS, CREATING AN UNPARALLELED WORK EXPERIENCE THAT ALLOWS THEM TO SEE THEIR IMPACT EVERY DAY. WE CREATE OPPORTUNITIES FOR OUR PEOPLE TO LEAD AND LEARN SIMULTANEOUSLY. FROM SECURING OUR NATION’S MOST SENSITIVE SYSTEMS, TO ENABLING DIGITAL TRANSFORMATION AND CLOUD ADOPTION, OUR PEOPLE ARE THE ONES WHO MAKE CHANGE REAL.\n\nGDIT IS AN EQUAL OPPORTUNITY/AFFIRMATIVE ACTION EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, OR VETERAN STATUS, OR ANY OTHER PROTECTED CLASS.",
    "job_skill_set": [
      "computer repairs",
      "help desk support",
      "information technology (IT)",
      "remote support",
      "troubleshooting hardware",
      "installing software",
      "remote access tools",
      "cloud infrastructure",
      "communication",
      "problem solving",
      "coaching",
      "teamwork",
      "customer service",
      "adaptability"
    ],
    "short_keywords": [
      "access",
      "active",
      "adaptability",
      "cloud",
      "coaching",
      "communication",
      "computer",
      "customer",
      "desk",
      "hardware",
      "help",
      "information",
      "informationtechnology",
      "infrastructure",
      "installing",
      "it",
      "problem",
      "remote",
      "repairs",
      "service",
      "software",
      "solving",
      "specialist",
      "support",
      "teamwork",
      "technology",
      "tools",
      "troubleshooting",
      "tssci",
      "wpoly"
    ]
  },
  {
    "job_id": "3884811019",
    "job_title": "Information Technology Support Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "RESPONSIBILITIES:• SERVE AS THE INITIAL CONTACT FOR END-USERS REQUIRING TECHNICAL ASSISTANCE THROUGH PHONE, EMAIL, OR IN-PERSON INTERACTIONS.• DELIVER TIMELY AND RESPECTFUL TECHNICAL SUPPORT TO ADDRESS HARDWARE, SOFTWARE, AND NETWORK-RELATED CONCERNS.• RECORD ALL SUPPORT INQUIRIES, INCIDENTS, AND SERVICE REQUESTS SYSTEMATICALLY WITHIN A TICKETING SYSTEM.• IDENTIFY AND RESOLVE TECHNICAL ISSUES THROUGH COMPREHENSIVE DIAGNOSIS AND TROUBLESHOOTING, ENSURING EFFECTIVE SOLUTIONS.• ESCALATE INTRICATE PROBLEMS TO THE RELEVANT IT TEAM MEMBERS AS NEEDED, AND ENSURE PROPER FOLLOW-UP ON RESOLUTIONS.• PERFORM INSTALLATION, CONFIGURATION, AND UPKEEP OF COMPUTER HARDWARE, OPERATING SYSTEMS, AND SOFTWARE APPLICATIONS.",
    "job_skill_set": [
      "communication",
      "customer service",
      "problem solving",
      "teamwork",
      "technical support",
      "troubleshooting",
      "ticketing system",
      "hardware installation",
      "software installation",
      "network support",
      "diagnosis",
      "configuration",
      "follow-up"
    ],
    "short_keywords": [
      "communication",
      "configuration",
      "customer",
      "diagnosis",
      "followup",
      "hardware",
      "information",
      "informationtechnology",
      "installation",
      "network",
      "problem",
      "service",
      "software",
      "solving",
      "specialist",
      "support",
      "system",
      "teamwork",
      "technical",
      "technology",
      "ticketing",
      "troubleshooting"
    ]
  },
  {
    "job_id": "3901937672",
    "job_title": "Information Technology Asset Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "ROLE : DATA CENTER AUDITORLOCATION : ASHBURN, VA CONTRACT JOB DESCRIPTION :WE ARE SEEKING A METICULOUS AND DETAIL-ORIENTED INDIVIDUAL TO JOIN OUR TEAM AS A DATA CENTER AUDITOR. IN THIS ROLE, YOU WILL BE RESPONSIBLE FOR CONDUCTING THOROUGH AUDITS OF CUSTOMER DATA CENTER SUITES TO ENSURE COMPLIANCE WITHIN ITAM GOALS AND PROCESSES.  KEY RESPONSIBILITIES:1. CONDUCT AUDITS:PERFORM REGULAR AUDITS OF DATA CENTER SUITES TO ENSURE ACCURACY OF HARDWARE PHYSICALLY RACKED IN A CABINET IS BEING ACCOUNTED FOR IN OUR DCIMB (DATA CENTER INVENTORY MANAGEMENT DATABASE).2. VERIFICATION: VERIFY THE INTEGRITY AND ACCURACY OF AUDITED DEVICES STORED WITHIN THE DATA CENTER SUITES, ENSURING PROPER UPDATES IN DCIMB AND ASSET TAG PLACEMENT ON ALL DEVICES.3. DOCUMENTATION AND REPORTING: DOCUMENT AUDIT FINDINGS, DISCREPANCIES, AND RECOMMENDATIONS FOR IMPROVEMENT. PREPARE COMPREHENSIVE REPORTS FOR MANAGEMENT, HIGHLIGHTING AREAS OF CONCERN AND SUGGESTING CORRECTIVE ACTIONS.4. COLLABORATION: COLLABORATE WITH CROSS-FUNCTIONAL TEAMS, INCLUDING IT, SECURITY, AND FACILITY MANAGEMENT, TO ADDRESS AUDIT FINDINGS AND IMPLEMENT CORRECTIVE MEASURES.5. CONTINUOUS IMPROVEMENT:STAY UPDATED ON INDUSTRY TRENDS, REGULATORY CHANGES, AND EMERGING BEST PRACTICES RELATED TO DATA CENTER OPERATIONS AND SECURITY. PROPOSE AND IMPLEMENT IMPROVEMENTS TO AUDIT PROCESSES AND PROCEDURES. REQUIREMENTS:- BACHELOR’S DEGREE OR EQUIVALENT IN TECHNICAL FIELD OR PROJECT MANAGEMENT PREFERRED- 4 OR MORE YEARS OF EXPERIENCE IN IT ASSET MANAGEMENT- EXPERIENCE WITH MULTI-LOCATION COORDINATION OF TECHNICAL RESOURCES- EXPERIENCE MANAGING LEASED ASSETS- SERVICENOW ITAM MODULE EXPERIENCE PREFERRED- CERTIFICATIONS/LICENSES –ITIL CERTIFICATION, ITAM, CITAM, CHAMP INDUSTRY CERTIFICATIONS PREFERRED",
    "job_skill_set": [
      "IT Asset Management (ITAM)",
      "ServiceNow ITAM Module",
      "Technical Resource Coordination",
      "Attention to Detail",
      "Documentation",
      "Reporting",
      "Collaboration",
      "Continuous Improvement",
      "Problem Solving",
      "Data Center Inventory Management Database (DCIMB)",
      "ITIL Certification",
      "CITAM Certification",
      "CHAMP Industry Certifications"
    ],
    "short_keywords": [
      "asset",
      "attention",
      "center",
      "certification",
      "certifications",
      "champ",
      "citam",
      "collaboration",
      "continuous",
      "coordination",
      "data",
      "database",
      "dcimb",
      "detail",
      "documentation",
      "improvement",
      "industry",
      "information",
      "informationtechnology",
      "inventory",
      "it",
      "itam",
      "itil",
      "management",
      "manager",
      "module",
      "problem",
      "reporting",
      "resource",
      "servicenow",
      "solving",
      "technical",
      "technology",
      "to"
    ]
  },
  {
    "job_id": "3900076153",
    "job_title": "Information Technology Administrator",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOB OVERVIEW: \nTHE IT SYSTEMS ADMINISTRATOR WILL PLAY A CRUCIAL ROLE IN MAINTAINING AND ENHANCING OUR ORGANIZATION'S NETWORK AND SERVER INFRASTRUCTURE TO ENSURE HIGH AVAILABILITY, SECURITY, AND PERFORMANCE. THIS POSITION REQUIRES A SKILLED PROFESSIONAL WITH A STRONG BACKGROUND IN NETWORK AND SERVER ADMINISTRATION, INCLUDING HANDS-ON EXPERIENCE WITH MERAKI NETWORK EQUIPMENT, WINDOWS SERVER 2016+, AND VM-WARE. THE IDEAL CANDIDATE WILL CONTRIBUTE TO THE IMPLEMENTATION AND MANAGEMENT OF IT SOLUTIONS THAT SUPPORT AND DRIVE THE STRATEGIC OBJECTIVES OF OUR ORGANIZATION.\nRESPONSIBILITIES AND DUTIES: \nNETWORK ADMINISTRATION: \n• INSTALL, CONFIGURE, AND MAINTAIN NETWORK EQUIPMENT, INCLUDING ROUTERS, SWITCHES, FIREWALLS, AND OTHER HARDWARE, WITH A FOCUS ON MERAKI NETWORK EQUIPMENT. • MONITOR NETWORK PERFORMANCE, TROUBLESHOOT NETWORK ISSUES, AND ENSURE THE SECURITY OF THE NETWORK INFRASTRUCTURE. • IMPLEMENT AND MANAGE NETWORK SECURITY MEASURES, SUCH AS FIREWALLS, VPNS, AND INTRUSION DETECTION SYSTEMS.SERVER ADMINISTRATION: • INSTALL, CONFIGURE, AND MANAGE WINDOWS SERVER ENVIRONMENTS (2016+), ENSURING THEIR RELIABILITY, PERFORMANCE, AND SECURITY. • ADMINISTER VM-WARE VIRTUALIZATION ENVIRONMENTS, INCLUDING THE CREATION, MAINTENANCE, AND MONITORING OF VIRTUAL MACHINES. • PERFORM REGULAR SYSTEM MAINTENANCE, INCLUDING UPDATES AND PATCHES, BACKUP MANAGEMENT, AND DISASTER RECOVERY PLANNING.\nSYSTEM SECURITY AND COMPLIANCE: • IMPLEMENT AND MAINTAIN SECURITY POLICIES AND PRACTICES TO PROTECT INFORMATION ASSETS FROM UNAUTHORIZED ACCESS OR COMPROMISE. • WORK CLOSELY WITH THE IT TEAM TO ENSURE COMPLIANCE WITH INTERNAL POLICIES AND REGULATORY REQUIREMENTS.\nCOLLABORATION AND SUPPORT: \n• COLLABORATE WITH IT TEAM MEMBERS AND OTHER DEPARTMENTS TO IDENTIFY, RECOMMEND, DEVELOP, IMPLEMENT, AND SUPPORT COST-EFFECTIVE TECHNOLOGY SOLUTIONS. • PROVIDE TIER II SUPPORT FOR ESCALATED ISSUES, INCLUDING TROUBLESHOOTING AND RESOLVING HARDWARE, SOFTWARE, AND NETWORK PROBLEMS.\nQUALIFICATIONS: \n• REQUIRES A BACHELOR'S DEGREE IN INFORMATION TECHNOLOGY, COMPUTER SCIENCE, OR RELATED DISCIPLINE, OR AN EQUIVALENT COMBINATION OF EDUCATION AND WORK EXPERIENCE IN A SIMILAR FIELD. • 1 – 3 YEARS OF PROVEN EXPERIENCE AS AN IT SYSTEMS ADMINISTRATOR WITH A STRONG BACKGROUND IN BOTH NETWORK AND SERVER ADMINISTRATION. • EXTENSIVE EXPERIENCE WITH MERAKI NETWORK EQUIPMENT, WINDOWS SERVER 2016+, AND VM-WARE. • KNOWLEDGE OF SYSTEM SECURITY TECHNIQUES AND NETWORK INFRASTRUCTURE. • EXCELLENT PROBLEM-SOLVING AND COMMUNICATION SKILLS.\nPREFERRED SKILLS: \n• EXPERIENCE WITH OKTA, IIS, AND ARUBA WAP IS A PLUS. • CERTIFICATIONS IN RELEVANT AREAS (E.G., CISCO, MICROSOFT, VM-WARE) ARE HIGHLY DESIRABLE. • ABILITY TO WORK INDEPENDENTLY AND AS PART OF A TEAM, WITH A PROACTIVE ATTITUDE TOWARDS FINDING SOLUTIONS AND IMPROVING PROCESSES.\nTHIS POSITION IS 90% REMOTE.OPEN TO TEMP TO HIRE OR DIRECT HIRE.",
    "job_skill_set": [
      "problem solving",
      "communication",
      "collaboration",
      "independence",
      "proactive attitude",
      "network administration",
      "server administration",
      "Meraki network equipment",
      "Windows Server 2016+",
      "VMware",
      "network security",
      "firewalls",
      "VPNs",
      "intrusion detection systems",
      "system maintenance",
      "backup management",
      "disaster recovery planning",
      "compliance",
      "system security techniques",
      "troubleshooting",
      "hardware support",
      "software support"
    ],
    "short_keywords": [
      "2016",
      "administration",
      "administrator",
      "attitude",
      "backup",
      "collaboration",
      "communication",
      "compliance",
      "detection",
      "disaster",
      "equipment",
      "firewalls",
      "hardware",
      "independence",
      "information",
      "informationtechnology",
      "intrusion",
      "maintenance",
      "management",
      "meraki",
      "network",
      "planning",
      "proactive",
      "problem",
      "recovery",
      "security",
      "server",
      "software",
      "solving",
      "support",
      "system",
      "systems",
      "techniques",
      "technology",
      "troubleshooting",
      "vmware",
      "vpns",
      "windows"
    ]
  },
  {
    "job_id": "3899518312",
    "job_title": "Senior Information Technology Project Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "GOVERNMENT DOMAIN EXPERIENCE REQUIREDLOCAL TO MA(PREFERRED)\nJOB DESCRIPTION:LEAD EFFORTS TO DEFINE PROJECT REQUIREMENTS WITH KEY PROJECT STAKEHOLDERS.EFFECTIVELY MANAGE AND MONITOR THE PROJECT DEVELOPMENT PROCESS, OVERSEEING SCOPE AND CHANGE CONTROL PROCESSES.PREPARE AND PUBLISH PROJECT DOCUMENTATION, IN ACCORDANCE WITH AGENCY STANDARDS AND DUE DATES.ENSURE TASKS, TIMELINES AND RESOURCES ALIGN WITH ESTABLISHED MILESTONES AND DUE DATES WHILE ADHERING TO THE COMPANY STANDARDS AND POLICIES.FOLLOW A COMPREHENSIVE DEFECT TRACKING PROCESS TO ENSURE THOROUGH TESTING EFFORTS LOCALLY AND BY VARIOUS TEAMS. SUBMIT DETAILED DOCUMENTATION OF THE PROCESS TO THE DIRECTOR OF ENTERPRISE PROJECT MANAGEMENT.REPORT PROJECT STATUS, RISKS AND MITIGATION STRATEGIES TO KEY STAKEHOLDERS AND SENIOR MANAGEMENT WEEKLY.IDENTIFY KEY RISKS AND THEIR IMPACT ON THE PROJECT.ENSURE EFFECTIVE COMMUNICATION BETWEEN NON-TECHNICAL AND TECHNICAL TEAMS.MONITOR RESULTS AGAINST ESTABLISHED TIMELINES, DELIVERABLES, TASKS, DEPENDENCIES AND ASSOCIATED TECHNICAL SPECIFICATIONS.ADHERE TO PROJECT MANAGEMENT POLICIES, METHODOLOGY, QUALITY ASSURANCE AND RELATED STANDARDS.UNDERSTAND THE SDLC AND ADHERE TO THE WORKFLOW AND TIMELINES FOR REQUIREMENTS GATHERING, DOCUMENT REVIEWS, AND APPROVAL OF DOCUMENTS.STAY CURRENT WITH CUSTOMER NEEDS AND STRATEGIES, UTILIZING FORMAL AND INFORMAL COMMUNICATION METHODS.ASSIST IN MENTORING JUNIOR PMO STAFF MEMBERS.ANY OTHER DUTIES ASSIGNED BY THE DIRECTOR OF ENTERPRISE PROJECT MANAGEMENT.",
    "job_skill_set": [
      "Documentation",
      "Resource Management",
      "Communication",
      "Problem Solving",
      "Team Collaboration",
      "Adaptability",
      "Project Management",
      "Risk Management",
      "SDLC (Software Development Life Cycle)",
      "Defect Tracking",
      "Change Control",
      "Quality Assurance",
      "Stakeholder Management",
      "Leadership",
      "Mentoring"
    ],
    "short_keywords": [
      "adaptability",
      "assurance",
      "change",
      "collaboration",
      "communication",
      "control",
      "cycle",
      "defect",
      "development",
      "documentation",
      "information",
      "informationtechnology",
      "leadership",
      "life",
      "management",
      "manager",
      "mentoring",
      "problem",
      "project",
      "quality",
      "resource",
      "risk",
      "sdlc",
      "senior",
      "software",
      "solving",
      "stakeholder",
      "team",
      "technology",
      "tracking"
    ]
  },
  {
    "job_id": "3895514999",
    "job_title": "Information Technology Manager ServiceNow",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "PURPOSE\n\nTHE SERVICENOW MANAGER AT FLOOR & DECOR IS TASKED WITH COLLABORATING CLOSELY WITH INTERNAL TEAMS, ENGAGING STAKEHOLDERS, AND ESTABLISHING SERVICE LEVEL AGREEMENTS (SLAS) FOR BOTH INTERNAL AND MANAGED SERVICE PROVIDER (MSP) TEAMS. THIS ROLE INVOLVES INTRICATELY DEFINING THE SCOPE OF IT SERVICES TO BE PROVIDED AND SETTING KEY PERFORMANCE INDICATORS (KPIS) AND METRICS TO ASSESS THE PERFORMANCE OF THE SERVICENOW PLATFORM AND MSP PARTNERS, DETAILING THEIR MEASUREMENT METHODOLOGIES.\n\nMOREOVER, THE SERVICENOW MANAGER IS RESPONSIBLE FOR CRAFTING AND REFINING THE PROCESSES FOR IT SERVICE DESK CORPORATE, STORE SUPPORT, AND MSP OPERATIONS WITHIN THE SERVICENOW PLATFORM. THIS INCLUDES COMPREHENSIVE DOCUMENTATION, AUDITING PROCEDURES, AND ENSURING ALIGNMENT WITH THE STRATEGIC DIRECTION AND OBJECTIVES SET FORTH BY SERVICE DESK LEADERSHIP. CONTINUAL ANALYSIS OF WORKFLOWS AND PERFORMANCE METRICS IS CENTRAL TO THIS ROLE, DRIVING THE IMPLEMENTATION OF STRATEGIES AIMED AT ENHANCING EFFICIENCY AND STREAMLINING OPERATIONS WITHIN THE SERVICENOW ENVIRONMENT.\n\nMINIMUM ELIGIBILITY REQUIREMENTS\n\nCERTIFICATIONS: SERVICENOW CERTIFIED SYSTEM ADMINISTRATOR (CSA)PLATFORM MANAGEMENT: 5+ YEARS OF EXPERIENCE OVERSEEING THE ADMINISTRATION, CONFIGURATION, AND CUSTOMIZATION OF THE SERVICENOW PLATFORM TO MEET THE ORGANIZATION'S NEEDS. THIS INCLUDES MANAGING USER ACCESS, SECURITY, WORKFLOWS, FORMS, AND INTEGRATIONS WITH OTHER SYSTEMS. EXPERIENCE WORKING IN ALL THE FLOWING SERVICENOW APPLICATIONS SUITES IS PREFERRED ITSM, CSM, SPM, AND ITOM.SERVICE DELIVERY: 5+ YEARS OF EXPERIENCE ENSURING THE EFFECTIVE DELIVERY OF IT SERVICES THROUGH SERVICENOW, INCLUDING INCIDENT MANAGEMENT, PROBLEM MANAGEMENT, CHANGE MANAGEMENT, SERVICE CATALOG MANAGEMENT, AND REQUEST FULFILLMENT. THIS INVOLVES DEFINING AND OPTIMIZING SERVICE PROCESSES AND WORKFLOWS WITHIN SERVICENOW.STAKEHOLDER ENGAGEMENT: COLLABORATING WITH STAKEHOLDERS ACROSS THE ORGANIZATION TO UNDERSTAND THEIR REQUIREMENTS AND PRIORITIES, AND TO ENSURE THAT SERVICENOW SOLUTIONS ALIGN WITH BUSINESS GOALS. THIS MAY INVOLVE GATHERING FEEDBACK, CONDUCTING WORKSHOPS, AND FACILITATING DISCUSSIONS TO DRIVE ADOPTION AND SATISFACTION.GOVERNANCE AND COMPLIANCE: ESTABLISHING GOVERNANCE FRAMEWORKS AND BEST PRACTICES FOR THE USE OF SERVICENOW, ENSURING COMPLIANCE WITH ORGANIZATIONAL POLICIES, INDUSTRY REGULATIONS, AND SECURITY STANDARDS. THIS INCLUDES CONDUCTING REGULAR AUDITS, IMPLEMENTING CONTROLS, AND MANAGING RISKS ASSOCIATED WITH SERVICENOW USAGE.PERFORMANCE MONITORING AND OPTIMIZATION: MONITORING THE PERFORMANCE AND UTILIZATION OF THE SERVICENOW PLATFORM, ANALYZING DATA AND METRICS TO IDENTIFY AREAS FOR IMPROVEMENT AND OPTIMIZATION. THIS MAY INVOLVE CONDUCTING PERFORMANCE TUNING, CAPACITY PLANNING, AND IMPLEMENTING ENHANCEMENTS TO ENHANCE THE PLATFORM'S EFFECTIVENESS AND EFFICIENCY.TEAM LEADERSHIP AND DEVELOPMENT: LEADING A TEAM OF SERVICENOW ADMINISTRATORS, DEVELOPERS, AND ANALYSTS, PROVIDING GUIDANCE, SUPPORT, AND MENTORSHIP TO ENSURE THEIR SUCCESS. THIS INCLUDES DEFINING ROLES AND RESPONSIBILITIES, SETTING GOALS AND OBJECTIVES, AND FOSTERING A CULTURE OF CONTINUOUS LEARNING AND PROFESSIONAL DEVELOPMENT.VENDOR MANAGEMENT: MANAGING RELATIONSHIPS WITH SERVICENOW VENDORS, PARTNERS, AND CONSULTANTS, INCLUDING CONTRACT NEGOTIATION, VENDOR SELECTION, AND OVERSIGHT OF EXTERNAL RESOURCES. THIS MAY INVOLVE COLLABORATING WITH PROCUREMENT AND LEGAL TEAMS TO ENSURE COMPLIANCE WITH CONTRACTUAL AGREEMENTS AND SERVICE LEVEL AGREEMENTS.PROJECT MANAGEMENT: LEADING SERVICENOW IMPLEMENTATION PROJECTS, UPGRADES, AND ENHANCEMENTS FROM INITIATION TO COMPLETION. THIS INCLUDES DEFINING PROJECT SCOPE, TIMELINES, AND DELIVERABLES, MANAGING RESOURCES AND BUDGETS, AND COMMUNICATING PROGRESS AND STATUS UPDATES TO STAKEHOLDERS.USER TRAINING AND SUPPORT: PROVIDING TRAINING AND SUPPORT TO USERS OF THE SERVICENOW PLATFORM, ENSURING THEY HAVE THE KNOWLEDGE AND SKILLS REQUIRED TO EFFECTIVELY UTILIZE ITS FEATURES AND FUNCTIONALITY. THIS MAY INVOLVE DEVELOPING TRAINING MATERIALS, CONDUCTING WORKSHOPS, AND PROVIDING ONGOING ASSISTANCE AND GUIDANCE AS NEEDED.CONTINUOUS IMPROVEMENT: DRIVING CONTINUOUS IMPROVEMENT INITIATIVES TO ENHANCE THE CAPABILITIES, USABILITY, AND VALUE OF THE SERVICENOW PLATFORM. THIS INCLUDES SOLICITING FEEDBACK FROM USERS, STAYING CURRENT WITH PLATFORM UPDATES AND BEST PRACTICES, AND ACTIVELY PARTICIPATING IN USER COMMUNITIES AND FORUMS.\n\nESSENTIAL JOB FUNCTIONS\n\nMANAGE AND LEAD A TEAM OF SERVICENOW DEVELOPERS AND CONFIGURATORS, INCLUDING HIRING, TRAINING, COACHING, AND PERFORMANCE MANAGEMENT.DEVELOP AND IMPLEMENT SERVICENOW POLICIES, PROCEDURES, AND BEST PRACTICES TO ENSURE CONSISTENT AND HIGH-QUALITY SUPPORT SERVICES.MONITOR SERVICENOW PERFORMANCE METRICS AND KPIS TO IDENTIFY AREAS FOR IMPROVEMENT AND DRIVE CONTINUOUS SERVICE IMPROVEMENT INITIATIVES.COORDINATE WITH OTHER IT TEAMS AND STAKEHOLDERS TO RESOLVE ESCALATED ISSUES AND ENSURE TIMELY RESOLUTION OF SERVICE REQUESTS AND INCIDENTS.OVERSEE THE DEPLOYMENT AND MAINTENANCE OF THE SERVICENOW SYSTEM TO SUPPORT EFFICIENT SERVICE DELIVERY.PROVIDE TECHNICAL EXPERTISE AND GUIDANCE TO SERVICENOW STAFF, ASSISTING WITH COMPLEX TECHNICAL ISSUES AND ESCALATIONS.FOSTER A CUSTOMER-FOCUSED CULTURE WITHIN THE SERVICENOW TEAM, PROMOTING EXCELLENT COMMUNICATION AND COLLABORATION WITH END-USERS.STAY UP TO DATE ON INDUSTRY TRENDS AND BEST PRACTICES IN IT SERVICE MANAGEMENT, RECOMMENDING AND IMPLEMENTING INNOVATIONS TO ENHANCE SERVICE DELIVERY.DEVELOP AND MAINTAIN DOCUMENTATION, KNOWLEDGE ARTICLES, AND TRAINING MATERIALS TO SUPPORT SERVICENOW OPERATIONS AND KNOWLEDGE TRANSFER.WORK WITH IT TEAMS TO GENERATE AND DELIVER REGULAR SERVICENOW REPORTS AND PRESENTATIONS FOR SENIOR MANAGEMENT, SUMMARIZING SERVICE DESK PERFORMANCE, TRENDS, AND KEY METRICS.ESTABLISH BEST PRACTICES THROUGHOUT THE ENTIRE TECHNICAL SUPPORT PROCESS.OVERSEE IT SERVICE DESK TRANSFORMATION INITIATIVES TO ENSURE THEY SUPPORT THE ACHIEVEMENT OF THE SHORT/LONG TERM PLAN(S)PERFORM OTHER SUCH ROLES, ACTIVITIES AND DUTIES AS MAY BE REQUIRED BY EXECUTIVE MANAGEMENT OR BY ANY OTHER MANAGERIAL REPRESENTATIVE OF F&D FROM TIME TO TIME.\n\nWORKING CONDITIONS (TRAVEL & ENVIRONMENT)\n\nLIMITED TRAVEL REQUIRED INCLUDING AIR AND CARWHILE PERFORMING THE DUTIES OF THIS JOB, THE EMPLOYEE MAY OCCASIONALLY BE EXPOSED TO A WAREHOUSE ENVIRONMENT AND MOVING VEHICLES. THE NOISE LEVEL IN THE WORK ENVIRONMENT IS TYPICALLY QUIET TO MODERATE.\n\nPHYSICAL/SENSORY REQUIREMENTS\n\nSEDENTARY WORK – ABILITY TO EXERT 10 - 20 POUNDS OF FORCE OCCASIONALLY, AND/OR NEGLIGIBLE AMOUNT OF FORCE FREQUENTLY TO LIFT, CARRY, PUSH, PULL OR OTHERWISE MOVE OBJECTS. SEDENTARY WORK INVOLVES SITTING MOST OF THE TIME, BUT MAY INVOLVE WALKING OR STANDING FOR BRIEF PERIODS OF TIME.\n\nNOTE: FLOOR & DECOR CONSIDERS ALL APPLICANTS FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, GENDER IDENTITY, SEXUAL ORIENTATION, NATIONAL ORIGIN, AGE, DISABILITY, MEDICAL CONDITION, PREGNANCY, MARITAL OR FAMILIAL STATUS, VETERAN STATUS, OR BASED ON ANY OTHER CLASS PROTECTED BY APPLICABLE FEDERAL, STATE, OR LOCAL LAW. FLOOR & DECOR ALSO PROVIDES REASONABLE ACCOMMODATIONS TO QUALIFIED INDIVIDUALS WITH DISABILITIES IN ACCORDANCE WITH THE AMERICANS WITH DISABILITIES ACT AND APPLICABLE STATE AND LOCAL LAW.\n\nTHIS JOB DESCRIPTION DOES NOT CONSTITUTE AN EMPLOYMENT AGREEMENT BETWEEN THE EMPLOYER AND THE EMPLOYEE AND IS SUBJECT TO CHANGE BY THE EMPLOYER AT ITS SOLE DISCRETION.\n\nBENEFITS & REWARDS\n\nBONUS OPPORTUNITIES AT EVERY LEVELCAREER ADVANCEMENT OPPORTUNITIESRELOCATION OPPORTUNITIES ACROSS THE COUNTRY401K WITH DISCRETIONARY COMPANY MATCHEMPLOYEE STOCK PURCHASE PLANREFERRAL BONUS PROGRAMMEDICAL, DENTAL, VISION, LIFE AND OTHER INSURANCE PLANS (SUBJECT TO ELIGIBILITY CRITERIA)\n\nEQUAL EMPLOYMENT OPPORTUNITY\n\nFLOOR & DECOR PROVIDES EQUAL EMPLOYMENT OPPORTUNITIES TO ALL ASSOCIATES AND APPLICANTS WITHOUT REGARD TO AGE, RACE, COLOR, RELIGION OR CREED, NATIONAL ORIGIN OR ANCESTRY, SEX (INCLUDING PREGNANCY), SEXUAL ORIENTATION, GENDER, GENDER IDENTITY, DISABILITY, VETERAN STATUS, GENETIC INFORMATION, ETHNICITY, CITIZENSHIP, OR ANY OTHER CATEGORY PROTECTED BY LAW.\n\nTHIS POLICY APPLIES TO ALL AREAS OF EMPLOYMENT, INCLUDING RECRUITMENT, TESTING, SCREENING, HIRING, SELECTION FOR TRAINING, UPGRADING, TRANSFER, DEMOTION, LAYOFF, DISCIPLINE, TERMINATION, COMPENSATION, BENEFITS AND ALL OTHER PRIVILEGES, TERMS AND CONDITIONS OF EMPLOYMENT. THIS POLICY AND THE LAW PROHIBIT EMPLOYMENT DISCRIMINATION AGAINST ANY ASSOCIATE OR APPLICANT ON THE BASIS OF ANY LEGALLY PROTECTED STATUS OUTLINED ABOVE.\n\nR036619",
    "job_skill_set": [
      "Data Analysis",
      "Documentation",
      "Training Development",
      "Continuous Improvement",
      "Team Leadership",
      "Communication",
      "Collaboration",
      "Problem Solving",
      "Mentorship",
      "Customer Focus",
      "Adaptability",
      "Leadership",
      "Analytical Thinking",
      "Time Management",
      "ServiceNow",
      "IT Service Management (ITSM)",
      "Configuration Management",
      "Incident Management",
      "Problem Management",
      "Change Management",
      "Service Catalog Management",
      "User Access Management",
      "Performance Monitoring",
      "Governance and Compliance",
      "Project Management",
      "Vendor Management",
      "Capacity Planning",
      "Stakeholder Engagement",
      "Strategic Thinking"
    ],
    "short_keywords": [
      "access",
      "adaptability",
      "analysis",
      "analytical",
      "and",
      "capacity",
      "catalog",
      "change",
      "collaboration",
      "communication",
      "compliance",
      "configuration",
      "continuous",
      "customer",
      "data",
      "development",
      "documentation",
      "engagement",
      "focus",
      "governance",
      "improvement",
      "incident",
      "information",
      "informationtechnology",
      "it",
      "itsm",
      "leadership",
      "management",
      "manager",
      "mentorship",
      "monitoring",
      "performance",
      "planning",
      "problem",
      "project",
      "service",
      "servicenow",
      "solving",
      "stakeholder",
      "strategic",
      "team",
      "technology",
      "thinking",
      "time",
      "training",
      "user",
      "vendor"
    ]
  },
  {
    "job_id": "3901937254",
    "job_title": "Information Technology Service Delivery Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "ELIGIBILITY: • GRADUATE/POSTGRADUATE WITH 10+ YEARS OF RELEVANT EXPERIENCE JOB OVERVIEW: THE SERVICE DELIVERY MANAGER IS RESPONSIBLE FOR MANAGING THE ACTIVITIES AND RESPONSIBILITIES OF THE SERVICE DESK TEAM. AS A PART OF THIS MANAGEMENT, THE SERVICE DELIVERY MANAGER IS ALSO RESPONSIBLE FOR PROVIDING HIGH-LEVEL TECHNICAL ASSISTANCE TO THE TEAM AND ENSURING SERVICE AND SUPPORT IS PROVIDED TO CUSTOMERS AT AGREED LEVELS. \nMUST HAVES: · KNOWLEDGE AND EXPERIENCE IN CROSS-FUNCTIONAL MANAGEMENT METHODS AND TECHNIQUES. · KNOWLEDGE OF IT APPLICATIONS, PROCESSES, SOFTWARE, AND EQUIPMENT. · STRONG ORGANIZATIONAL, PRESENTATION, AND CUSTOMER SERVICE SKILLS. · SKILL IN STRATEGIC PLANNING WITH AN ABILITY TO THINK AHEAD AND PLAN OVER A 6 - 12 MONTHS’ TIME SPAN. · SKILL IN PLANNING AND PREPARING WRITTEN COMMUNICATIONS. · SKILL IN LEADING PEOPLE AND GETTING RESULTS WITH A STRONG CUSTOMER ORIENTATION. · INTERPERSONAL SKILLS: SUCH AS TELEPHONY SKILLS, COMMUNICATION SKILLS, ACTIVE LISTENING, AND CUSTOMER-CARE. · ABILITY TO MULTI-TASK AND ADAPT TO CHANGES QUICKLY. · ABILITY TO WORK IN A TEAM AND COMMUNICATE EFFECTIVELY. · SERVICE AWARENESS OF ALL ORGANIZATION’S KEY IT SERVICES FOR WHICH SUPPORT IS BEING PROVIDED. · UNDERSTANDING OF SUPPORT TOOLS, TECHNIQUES, AND HOW TECHNOLOGY IS USED TO PROVIDE IT SERVICES. · TYPING SKILLS TO ENSURE QUICK AND ACCURATE ENTRY OF SERVICE REQUEST DETAILS. · SELF-MOTIVATED WITH THE ABILITY TO WORK IN A FAST-MOVING ENVIRONMENT.",
    "job_skill_set": [
      "IT applications",
      "cross-functional management",
      "support tools and techniques",
      "strategic planning",
      "service awareness",
      "organizational skills",
      "customer service skills",
      "leadership",
      "interpersonal skills",
      "communication skills",
      "active listening",
      "multi-tasking",
      "teamwork",
      "self-motivation",
      "typing skills",
      "presentation skills"
    ],
    "short_keywords": [
      "active",
      "and",
      "applications",
      "awareness",
      "communication",
      "crossfunctional",
      "customer",
      "delivery",
      "information",
      "informationtechnology",
      "interpersonal",
      "it",
      "leadership",
      "listening",
      "management",
      "manager",
      "multitasking",
      "organizational",
      "planning",
      "presentation",
      "selfmotivation",
      "service",
      "skills",
      "strategic",
      "support",
      "teamwork",
      "techniques",
      "technology",
      "tools",
      "typing"
    ]
  },
  {
    "job_id": "3887491764",
    "job_title": "Information Technology Program Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "OUR CLIENT, A LEADING BIOTECHNOLOGY COMPANY IS HIRING AN IT PROGRAM MANAGER TO JOIN THEIR TEAM IN BOSTON, MA!\n**THIS IS A 9-MONTH W2 CONTRACT WITH BENEFITS**\nAS THE IT PROGRAM MANAGER, YOU WILL ORCHESTRATE AND LEAD TRANSFORMATIONS OF OUR APPLICATION LANDSCAPE, INCLUDING BESPOKE SOLUTIONS, SAAS, AND HOSTED APPLICATIONS. THE PROJECT MANAGER IS RESPONSIBLE FOR A SEAMLESS TRANSITION WHILE ENSURING THE CONTINUITY OF CRITICAL BUSINESS PROCESSES.\nRESPONSIBILITIES:DEVELOP COMPREHENSIVE PROJECT PLANS, INCLUDING SCOPE, GOALS, DELIVERABLES, TIMELINES, RESOURCES, AND RISK ASSESSMENTSBUILD AND MAINTAIN STRONG RELATIONSHIPS WITH KEY STAKEHOLDERS, INCLUDING SENIOR MANAGEMENT, DEPARTMENT HEADS, AND EXTERNAL PARTNERSDEVELOP RISK MITIGATION STRATEGIES AND CONTINGENCY PLANS TO ENSURE PROJECT SUCCESSDRIVE CHANGE MANAGEMENT INITIATIVES TO ENSURE A SMOOTH TRANSITION FOR EMPLOYEES AND STAKEHOLDERS DURING THE BUILD-UP AND OPERATIONAL TRANSFORMATION\nDESIRED SKILLS:2 – 5 YEARS OF EXPERIENCE IN PROJECT OR PROGRAM MANAGEMENTPROFICIENT WITH EXCELPROJECT OR PROGRAM MANAGER CERTIFICATION (PMP)NICE TO HAVE: MEDICAL DEVICE, MEDICAL TECHNOLOGY, OR HIGH-TECH INDUSTRY EXPERIENCE WITHIN A MANUFACTURING CONTEXT.\nMOTION RECRUITMENT PARTNERS IS AN EQUAL OPPORTUNITY EMPLOYER, INCLUDING DISABILITY/VETS. ALL APPLICANTS MUST BE CURRENTLY AUTHORIZED TO WORK ON A FULL-TIME BASIS IN THE COUNTRY FOR WHICH THEY ARE APPLYING, AND NO SPONSORSHIP IS CURRENTLY AVAILABLE. EMPLOYMENT IS SUBJECT TO THE SUCCESSFUL COMPLETION OF A PRE-EMPLOYMENT SCREENING. ACCOMMODATION WILL BE PROVIDED IN ALL PARTS OF THE HIRING PROCESS AS REQUIRED UNDER MOTION RECRUITMENT EMPLOYMENT ACCOMMODATION POLICY. APPLICANTS NEED TO MAKE THEIR NEEDS KNOWN IN ADVANCE.",
    "job_skill_set": [
      "project management",
      "change management",
      "PMP certification",
      "high-tech industry experience",
      "stakeholder management",
      "communication",
      "relationship building",
      "problem solving",
      "team leadership",
      "adaptability",
      "program management",
      "risk assessment",
      "Excel",
      "SaaS",
      "bespoke solutions",
      "application landscape transformation",
      "medical device experience",
      "medical technology experience"
    ],
    "short_keywords": [
      "adaptability",
      "application",
      "assessment",
      "bespoke",
      "building",
      "certification",
      "change",
      "communication",
      "device",
      "excel",
      "experience",
      "hightech",
      "industry",
      "information",
      "informationtechnology",
      "landscape",
      "leadership",
      "management",
      "manager",
      "medical",
      "pmp",
      "problem",
      "program",
      "project",
      "relationship",
      "risk",
      "saas",
      "solutions",
      "solving",
      "stakeholder",
      "team",
      "technology",
      "transformation"
    ]
  },
  {
    "job_id": "3900960518",
    "job_title": "Information Technology Network Engineer",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "AKKODIS IS CURRENTLY LOOKING FOR AN IT NETWORK ENGINEER IN IRVINE CA LOCATION, FOR AEROSPACE DOMAIN CLIENT.IDEALLY, THE NETWORK ENGINEER WILL LEAD THE DEVELOPMENT OF A NEW NETWORK INFRASTRUCTURE TO SUPPORT A SPECIAL PROJECT. WITH A FOCUS ON DESIGNING AND IMPLEMENTING A VPN, THIS ROLE REQUIRES HANDS-ON PLANNING, EXECUTION, AND MANAGEMENT OF THE NETWORK INFRASTRUCTURE TO MEET EVOLVING BUSINESS NEEDS.HERE ARE THE SPECS OF THE ROLE:\nJOB TITLE: IT NETWORK ENGINEERLOCATION: IRVINE CAPAY RATE: $80-95 PER HOUR(BASED ON EXPERIENCE)TRAVEL SPECIFICATIONS: ABILITY TO TRAVEL TO MEXICO, ESTIMATED AT ABOUT 5% OF THE ROLE.\nESSENTIAL JOB FUNCTIONS:PLAN, DESIGN, AND IMPLEMENT A NEW NETWORK INFRASTRUCTURE FOR THE SPECIAL PROJECT.DESIGN AND IMPLEMENT A VPN AS A CRITICAL COMPONENT OF THE NEW NETWORK.CONFIGURE AND MANAGE VPN CONNECTIONS TO ENSURE SECURITY AND EFFICIENCY.IDENTIFY REQUIREMENTS AND SET UP NECESSARY NETWORK CONFIGURATIONS, INCLUDING PORTS AND ENDPOINTS.ENSURE COMPLIANCE WITH EXISTING COMPANY DESIGN AND SECURITY STANDARDS FOR NETWORKS.MANAGE AND IMPLEMENT FIREWALL MODIFICATIONS AND ENFORCE NETWORK SECURITY MEASURES.VALIDATE ALL NETWORK CHANGES TO ENSURE OPTIMAL PERFORMANCE AND SECURITY.DEVELOP AND MANAGE A COMPREHENSIVE PROJECT PLAN FOR NETWORK SETUP.COLLABORATE WITH INTERNAL STAFF AND EXTERNAL VENDORS TO ALIGN NETWORK ARCHITECTURE WITH BUSINESS OBJECTIVES.PROVIDE TECHNICAL SUPPORT AND EXPERT ADVICE ON NETWORK-RELATED ISSUES.\nEDUCATION / EXPERIENCE:BACHELOR’S DEGREE IN COMPUTER SCIENCE, INFORMATION TECHNOLOGY, OR RELATED FIELD.MINIMUM 5 YEARS OF EXPERIENCE IN NETWORK ENGINEERING.PREFERRED: RELEVANT CERTIFICATIONS SUCH AS CCNA, CCNP, CISSP.\nKNOWLEDGE, SKILLS, AND ABILITIES:PROFICIENCY IN FORTIGATE FIREWALLS, F5 VPN HARDWARE/SOFTWARE, CISCO SWITCHES, AND MULTIFACTOR AUTHENTICATION SOFTWARE.STRONG KNOWLEDGE OF VPN TECHNOLOGIES AND NETWORK SECURITY.PROVEN EXPERIENCE IN PROJECT PLANNING AND NETWORK INFRASTRUCTURE IMPLEMENTATION.\nIF YOU ARE INTERESTED IN EXPLORING THIS OPPORTUNITY FURTHER THEN CLICK ON APPLY NOW OR FEEL FREE TO CONTACT ME DIRECTLY AT LAKSHAY.SAHAJPAL@AKKODISGROUP.COM OR 610-979-9189. I WOULD BE DELIGHTED TO PROVIDE MORE DETAILS AND DISCUSS HOW YOUR SKILLS ALIGN WITH THIS EXCITING ROLE. FOR OTHER OPPORTUNITIES AVAILABLE AT AKKODIS GO TO WWW.AKKODIS.COM.\nEQUAL OPPORTUNITY EMPLOYER/VETERANS/DISABLED\nBENEFIT OFFERINGS INCLUDE MEDICAL, DENTAL, VISION, TERM LIFE INSURANCE, SHORT-TERM DISABILITY INSURANCE, ADDITIONAL VOLUNTARY BENEFITS, COMMUTER BENEFITS, AND A 401K PLAN. OUR PROGRAM PROVIDES EMPLOYEES THE FLEXIBILITY TO CHOOSE THE TYPE OF COVERAGE THAT MEETS THEIR INDIVIDUAL NEEDS. AVAILABLE PAID LEAVE MAY INCLUDE PAID SICK LEAVE, WHERE REQUIRED BY LAW; ANY OTHER PAID LEAVE REQUIRED BY FEDERAL, STATE, OR LOCAL LAW; AND HOLIDAY PAYS UPON MEETING ELIGIBILITY CRITERIA.TO READ OUR CANDIDATE PRIVACY INFORMATION STATEMENT, WHICH EXPLAINS HOW WE WILL USE YOUR INFORMATION, PLEASE VISIT HTTPS://WWW.AKKODISGROUP.COM/EN-US/CANDIDATE-PRIVACY/ .",
    "job_skill_set": [
      "network infrastructure",
      "network security",
      "project planning",
      "network configuration",
      "collaboration",
      "technical support",
      "problem solving",
      "communication",
      "planning",
      "VPN",
      "firewall management",
      "Fortigate firewalls",
      "F5 VPN hardware/software",
      "Cisco switches",
      "multifactor authentication software",
      "compliance standards"
    ],
    "short_keywords": [
      "authentication",
      "cisco",
      "collaboration",
      "communication",
      "compliance",
      "configuration",
      "engineer",
      "f5",
      "firewall",
      "firewalls",
      "fortigate",
      "hardwaresoftware",
      "information",
      "informationtechnology",
      "infrastructure",
      "management",
      "multifactor",
      "network",
      "planning",
      "problem",
      "project",
      "security",
      "software",
      "solving",
      "standards",
      "support",
      "switches",
      "technical",
      "technology",
      "vpn"
    ]
  },
  {
    "job_id": "3901977680",
    "job_title": "Information Technology Project Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "TITLE : PROJECT MANAGER - W2 ONLYLOCATION: RANCHO CUCAMONGA, CA /ROCKY HILL CT (ONSITE)\n\nWE ARE OPEN FOR VISA SPONSORSHIP\n.\nOVERALL 10 YEARS OF EXPERIENCE IT INDUSTRY EXPERIENCE .MINIMUM 5+ YEARS EXPERIENCE WORKING AS PROJECT MANGER DEALING WITH EDW APPLICATIONS .MUST HAVE HANDS ON EXPERIENCE WORKING WITH ADO (AZURE DEVOPS).MUST HAVE EXPERIENCE WORKING WITH AGILE.SOLID KNOWLEDGE OF PROJECT MANAGEMENT METHODOLOGIES, PROJECT MANAGEMENT SOFTWARE, AND PROJECT MANAGEMENT TOOLS SUCH AS [MICROSOFT PROJECT, TRELLO, ASANA, JIRA.AN UNDERSTANDING OF RISK MANAGEMENT PRINCIPLES AND TECHNIQUES TO HANDLE PROJECT CHANGES AND ENSURE SMOOTH TRANSITIONS.MUST HAVE EXCELLENT COMMUNICATION SKILLS.MUST HAVE STAKEHOLDER MANAGEMENT SKILLS.EXPERIENCE WITH BUDGETING AND FINANCIAL MANAGEMENT, INCLUDING BUDGETING, COST ESTIMATION, AND TRACKING. PROFICIENCY IN FINANCIAL ANALYSIS AND REPORTING IS ALSO VALUED.A BACHELOR'S DEGREE IN A RELATED FIELD, SUCH AS PROJECT MANAGEMENT, BUSINESS ADMINISTRATION, COMPUTER SCIENCE, OR INFORMATION TECHNOLOGY, IS PREFERRED. HOWEVER, WORK EXPERIENCE AND OTHER PROJECT MANAGER QUALIFICATIONS CAN PROVE ELIGIBILITYGOOD TO HAVE PROJECT MANAGEMENT PROFESSIONAL (PMP) CERTIFICATION.GOOD TO HAVE HEALTHCARE DOMAIN EXPERIENC\nE.\nINFOWAVE SYSTEMS IS AN EQUAL OPPORTUNITY EMPLOYER THAT IS COMMITTED TO DIVERSITY AND INCLUSION IN THE WORKPLACE.INFOWAVE IS AN ESTABLISHED INFORMATION TECHNOLOGY SERVICES AND SOLUTIONS COMPANY PROVIDING INNOVATIVE AND COST-EFFECTIVE SOLUTIONS COVERING BUSINESS STRATEGY, TECHNICAL ARCHITECTURE, ENTERPRISE DATA WAREHOUSING (EDW), BUSINESS INTELLIGENCE (BI), BUSINESS ANALYTICS, PREDICTIVE ANALYTICS, INFORMATICS, CLOUD SOLUTIONS, WEB APPLICATIONS DEVELOPMENT AND SYSTEMS INTEGRATION. INFOWAVE HAS PROVEN DOMAIN AND SUBJECT MATTER EXPERTISE (SME) IN HEALTHCARE, INSURANCE AND UTILITY INDUSTR\nIES",
    "job_skill_set": [
      "Project Management",
      "Risk Management",
      "Budgeting",
      "Financial Analysis",
      "Communication",
      "Stakeholder Management",
      "Problem Solving",
      "Teamwork",
      "Azure DevOps (ADO)",
      "Agile",
      "Microsoft Project",
      "Trello",
      "Asana",
      "JIRA",
      "Healthcare Domain Knowledge",
      "Project Management Professional (PMP) Certification"
    ],
    "short_keywords": [
      "ado",
      "agile",
      "analysis",
      "asana",
      "azure",
      "budgeting",
      "certification",
      "communication",
      "devops",
      "domain",
      "financial",
      "healthcare",
      "information",
      "informationtechnology",
      "jira",
      "knowledge",
      "management",
      "manager",
      "microsoft",
      "pmp",
      "problem",
      "professional",
      "project",
      "risk",
      "solving",
      "stakeholder",
      "teamwork",
      "technology",
      "trello"
    ]
  },
  {
    "job_id": "3884433564",
    "job_title": "Instructor, Computer Information Technology",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "UNDER THE GENERAL DIRECTION AND SUPERVISION OF THE ASSOCIATE DEAN AND DEAN, THE INSTRUCTOR, COMPUTER INFORMATION TECHNOLOGY CULTIVATES LEARNERS IN A DYNAMIC AND FAST-PACED INDUSTRY. THE INSTRUCTOR IS RESPONSIBLE FOR KEEPING UP-TO-DATE WITH THE CURRENT INDUSTRY AND DEVELOPING/UPDATING COURSES FOR DIFFERENT DELIVERY FORMATS (CLASSROOM, HYBRID, SYNCHRONOUS ONLINE, AND ASYNCHRONOUS ONLINE). THIS IS A FULL-TIME REGULAR POSITION.\nCOURSES ARE FOCUSED ON BUT ARE NOT LIMITED TO WINDOWS COMMAND PROMPT, LINUX COMMAND LINE, BASIC POWERSHELL, IT FUNDAMENTALS, PROGRAMMING LOGIC, AND NETWORKING CONCEPTS. \nSOUTHEAST COMMUNITY COLLEGE OFFERS COMPETITIVE COMPENSATION AND A ROBUST BENEFITS PACKAGE, INCLUDING, BUT NOT LIMITED TO: MEDICAL/DENTAL INSURANCE, 403(B) RETIREMENT WITH COLLEGE MATCHING CONTRIBUTION, VISION INSURANCE, FLEXIBLE SPENDING ACCOUNT, AND TUITION REIMBURSEMENT. SOUTHEAST COMMUNITY COLLEGE ALSO OFFERS EXTENSIVE LEAVE PLANS. IN ADDITION, SOUTHEAST COMMUNITY COLLEGE MAKES AVAILABLE TO ALL FULL-TIME EMPLOYEES THE USE OF “BEN DOLLARS” (CASH-IN-LIEU POTENTIAL FOR CERTAIN COVERAGE LEVELS) TO COVER MEDICAL AND DENTAL PREMIUMS.\nESSENTIAL FUNCTIONSPROVIDE STUDENT INSTRUCTION IN ASSIGNED PROGRAM COURSESCONSTRUCT RELATIONSHIPS WITH DIVERSE LEARNERS;DEVELOP AND DELIVER ENGAGING LESSONS IN ASSIGNED PROGRAM COURSES;BUILD CURRICULUM: LESSON PLANS, ASSIGNMENTS, TESTS (SUBJECT TO PROGRAM APPROVAL);DEVELOPING COURSES IS A SHARED RESPONSIBILITY BASED ON THE DEAN, ASSOCIATE DEAN, AND PROGRAM DIRECTOR(S) AFTER CONSIDERATION OF THE INDUSTRY LEADER’S FEEDBACK.OPERATE ALL APPROPRIATE AUDIO-VISUAL AND MULTIMEDIA EQUIPMENT AND SOFTWARE.\nCREATE AND DEVELOP TEACHING AIDS AND SUPPLEMENTSCREATE VISUAL COMMUNICATIONS PRESENTATIONS.ENHANCE ENGAGED LEARNING THROUGH THE COLLEGE’S CURRENT VISUAL/AUDIO EQUIPMENT AND PROGRAM APPLICATIONS.KEEP UP TO DATE WITH CURRENT TRENDS THAT REFLECT METHODS USED IN THE COMPUTER INFORMATION TECHNOLOGY INDUSTRY.\nDEVELOP NEW COURSES AND UPDATE EXISTING COURSESCOLLABORATE WITH OTHERS AND ADD, DEVELOP, AND/OR IMPLEMENT CHANGES IN CURRENT COURSES TO KEEP THE COMPUTER INFORMATION TECHNOLOGY PROGRAM CURRENT.DEVELOP COURSES THAT INCLUDE WRITING COURSE OBJECTIVES, SYLLABI, HANDOUTS, AND TESTS, AND RESEARCHING TEXTBOOKS AND ONLINE RESOURCES AND DATA FOR COURSE USE. MAINTAIN AND UPGRADE COMPUTER INFORMATION TECHNOLOGY EQUIPMENTENSURE CLASSROOMS, COMPUTER LAB(S) AND ONLINE EQUIPMENT ARE SUITABLE FOR ENGAGED LEARNING AND ARE IN WORKING ORDER FOR STUDENT USE.\nCOMPLETE AND MAINTAIN PROGRAM AND STUDENTS RECORDSFOLLOW STATE AND FEDERAL GUIDELINES FOR STUDENT RECORDS.MAINTAIN PERMANENT STUDENT RECORDS: GRADE BOOKS, ATTENDANCE, AND STUDENT ACHIEVEMENT FOR ALL COURSES TAUGHT.USE AND PROMOTE THE ONLINE INSTRUCTIONAL LEARNING MANAGEMENT SOFTWARE (LMS), SELF-SERVICE, OFFICE 365, AND THE HUB.PROVIDE RECOMMENDATIONS FOR CAPITAL EQUIPMENT PURCHASES OF INSTRUCTIONAL SUPPLIES AND EQUIPMENT.\nMAINTAIN TECHNICAL COMPETENCY IN THE TEACHING AREAATTEND SEMINARS, PROFESSIONAL ASSOCIATION MEETINGS, CONFERENCES, EDUCATIONAL WORKSHOPS, OR OTHER RELATED TRAINING SESSIONS TO STAY TECHNICALLY COMPETENT.PARTICIPATE IN COLLEGE ACTIVITIES RELATED TO PROFESSIONAL DEVELOPMENT, DIVERSITY, AND SAFETY.PARTICIPATE IN AREA CAMPUS-BASED PROGRAM ACTIVITIES AND TEAMSACTIVELY ENGAGE IN, AND SUPPORT PROGRAM ACTIVITIES (ADVISORY TEAM MEETINGS, OPEN HOUSE, DIVISION MEETINGS, ETC.) AND COLLEGE ACTIVITIES AND TEAMS AS REQUESTED.\nACT AS A PROGRAM ADVISOR FOR STUDENTS IN THE COMPUTER INFORMATION TECHNOLOGY PROGRAM.MENTOR, SUPPORT, AND ADVISE STUDENTS ON ACADEMIC STANDING, PROGRESS, AND THE ACADEMIC MAP DEMONSTRATING COURSES NEEDED FOR GRADUATION;EXPLAIN COLLEGE POLICIES AND PROCEDURES TO STUDENTS TO COMPLETE ALL RECORDS AND FORMS ETC., AS NEEDED FOR ARTICULATION AND PROGRAM OPERATION.\nINDIVIDUAL DEVELOPMENT PLANDEVELOP AN INDIVIDUALIZED DEVELOPMENT PLAN IN COOPERATION WITH THE ASSOCIATE DEAN AND AS DEFINED AND SUPPORTED ON THE PROFESSIONAL DEVELOPMENT WEBSITE.\nPROFESSIONAL DEVELOPMENTFACULTY MUST COMPILE (3) DIFFERENT PROFESSIONAL DEVELOPMENT ACTIVITIES DURING THE YEAR AS DEFINED AND SUPPORTED ON THE PROFESSIONAL DEVELOPMENT WEBSITE.\nANNUAL SAFETY TRAININGFACULTY MUST COMPLETE ALL ANNUAL SAFETY TRAINING AS REQUIRED BY THE COLLEGE.PERFORM OTHER CAMPUS AND PROGRAM DUTIES AS ASSIGNED INCLUDING, BUT NOT LIMITED TO: SUBSTITUTE TEACH AS REQUIRED, BUDGET DEVELOPMENT, ADVISE CO-PROGRAM DIRECTORS AS REQUESTED, SUPPORT AND PROMOTE THE COLLEGE, THE CAMPUS, AND THE COMPUTER INFORMATION TECHNOLOGY PROGRAM, SUPPORT STUDENT RECRUITMENT, ASSIST IN THE SECURITY OF ALL COLLEGE AND PROGRAM FACILITIES, INSTRUMENTS, TOOLS, MATERIALS, AND EQUIPMENT, AND ASSIST IN SUPERVISING STUDENT HELP.PARTICIPATION IN DETERMINING AND UPDATING THE STRATEGIC PLAN AND COMPLETION OF THE ANNUAL ASSESSMENT PROCESS.TEACH EVENING CONTINUING EDUCATION OR OFF-CAMPUS COMPUTER INFORMATION TECHNOLOGY CLASSES OR CUSTOMIZED TRAINING CLASSES.\nMARGINAL FUNCTIONSSERVE AS PROGRAM ADVISOR FOR THE COMPUTER INFORMATION TECHNOLOGY PROGRAM, PROVIDE INSTRUCTIONAL ASSISTANCE TO OTHER COLLEGE DIVISIONS AND PROGRAMS AS REQUESTED, ENSURE QUALITY EDUCATION FOR STUDENTS, AND THAT COLLEGE POLICIES AND PROCEDURES ARE FOLLOWED.TEACH EVENING CONTINUING EDUCATION OR OFF-CAMPUS COMPUTER INFORMATION TECHNOLOGY CLASSES OR CUSTOMIZED TRAINING CLASSES.PERFORM OTHER RELATED DUTIES WITHIN THE DIVISION/PROGRAM AS ASSIGNED.MAY BE REQUIRED TO PERFORM ASSOCIATED DUTIES, FUNCTIONS, OR ASSIGNMENTS IN OTHER DIVISIONS/PROGRAMS/AREAS AS REQUIRED.PERFORM OTHER COLLEGE FUNCTIONS AND DUTIES AS ASSIGNED.MUST BE ABLE TO WORK VARIED DAYS, HOURS, SHIFTS, LOCATIONS, AND CAMPUSES AS REQUIRED. WORK SCHEDULES (HOURS/DAYS/WORK LOCATION) ARE SCHEDULED BY SOUTHEAST COMMUNITY COLLEGE BASED ON THE NEEDS OF THE COLLEGE. WORK HOURS, SHIFTS, DAYS, AND WORK LOCATIONS MAY VARY DEPENDING ON THE NEEDS OF SOUTHEAST COMMUNITY COLLEGE AND ARE SUBJECT TO MODIFICATION. EMERGENCY OR SCHEDULED SPECIAL ACTIVITIES MAY REQUIRE HOURS OUTSIDE OF THE REGULAR WORKWEEK.REQUIRED KNOWLEDGE, SKILLS, AND ABILITIESPOSSESS SPECIFIC KNOWLEDGE AND EXPERIENCE IN THE COMPUTER INFORMATION TECHNOLOGY FIELD. THIS WILL INCLUDE THE FOLLOWING, FOCUSING ON, BUT NOT LIMITED TO, WINDOWS COMMAND PROMPT, LINUX COMMAND LINE, POWERSHELL, IT FUNDAMENTALS, PROGRAMMING LOGIC, AND NETWORKING CONCEPTS.ABILITY TO MAINTAIN CLASSROOM AND COMPUTER LAB ENVIRONMENTS CONDUCIVE TO LEARNING, INCLUDING CLASSROOM MANAGEMENT AND CONFLICT RESOLUTION.POSSESS POSITIVE AND COOPERATIVE INTERACTION WITH COLLEAGUES, STAFF, STUDENTS, AND SUPERVISORS.DEMONSTRATE EFFECTIVE ORAL AND WRITTEN COMMUNICATION RELEVANT TO TEACHING DIVERSE STUDENTS.DEVISE AND UTILIZE APPROPRIATE EVALUATION METHODS FOR THE CLASSROOM, LABORATORY, INTERNET, AND/OR DISTANCE LEARNING USE THAT SIMULATE REAL BUSINESS AND INDUSTRY PROCESSES.OBJECTIVELY EVALUATE ASSIGNMENTS AND LAB ACTIVITIES COMPLETED BY STUDENTS.PREPARE LECTURES, TESTS, QUIZZES, AND ENGAGED LEARNING LABORATORY EXPERIENCES PERTINENT TO THE CURRICULUM.GRADE ALL ASSIGNED WORK WITHIN SEVEN CALENDAR DAYS. KEEP STUDENTS INFORMED VIA FEEDBACK ON THEIR PROGRESS.ABILITY TO ORGANIZE AND PRESENT LOGICAL COURSE MATERIAL IN A TIMELY MANNER USING EFFECTIVE COMMUNICATION SKILLS; PREPARE AND PROVIDE THIS INFORMATION FOR VARIOUS CLASSROOM FORMATS, INCLUDING ONLINE LEARNING MANAGEMENT SYSTEMS (LMS).ACTIVELY RESEARCH CLASSROOM MATERIAL FOR LECTURES/LESSONS. MAINTAIN QUALITY RESOURCES IN BOOKS, PEOPLE, COMPUTER INFORMATION TECHNOLOGY ASSOCIATIONS, AND/OR THE INTERNET.CONDUCTS CLASSROOM INSTRUCTION FOR THE ENTIRE TIME AS DESCRIBED BY THE COURSE DESCRIPTIONS FOR ALL ASSIGNED PROGRAM COURSES.ABILITY TO LECTURE/INSTRUCT FOR TWO (2) HOURS.PARTICIPATE, DEVELOP, AND IMPLEMENT COLLEGE RECRUITING ACTIVITIES TO ATTRACT STUDENTS TO A CAREER IN COMPUTER INFORMATION TECHNOLOGY.PARTICIPATE AS A COOPERATIVE TEAM MEMBER OF THE COMPUTER INFORMATION TECHNOLOGY FACULTY TO STRENGTHEN THE PROGRAM, RESPOND TO INDUSTRY NEEDS TO PREPARE STUDENT WORKERS, AND HELP STUDENTS DEVELOP POSITIVE WORK ETHICS FOR SUCCESSFUL EMPLOYMENT.ABILITY TO LIFT AND CARRY UP TO (50) FIFTY POUNDS FOR SHORT DISTANCES, AND MOVE TABLES, CHAIRS, AND MEDIA EQUIPMENT.ABILITY TO COMMUNICATE EFFECTIVELY BOTH IN WRITING, IN PERSON, AND ON THE PHONE.ABILITY TO USE BASIC COMPUTER SKILLS.THE INDIVIDUAL MUST POSSESS THE ABOVE SKILLS AND ABILITIES OR BE ABLE TO EXPLAIN AND DEMONSTRATE THAT THE INDIVIDUAL CAN PERFORM THE ESSENTIAL FUNCTIONS OF THE JOB, WITH OR WITHOUT REASONABLE ACCOMMODATION, USING SOME OTHER COMBINATION OF SKILLS AND ABILITIES.\nMINIMUM QUALIFICATIONS:ASSOCIATE OF APPLIED SCIENCE DEGREE IN COMPUTER INFORMATION TECHNOLOGY AND/OR BACHELOR’S DEGREE IN ANY FIELDTESTED* EXPERIENCE AS DEFINED BY THE PROGRAM IN COMPUTER INFORMATION TECHNOLOGY*THE EXAMINATION WILL INCLUDE KNOWLEDGE AND/OR PHYSICAL DEMONSTRATION OF COMPETENCIES RELATED TO COMPUTER HARDWARE FUNCTIONS AND TERMINOLOGY, WINDOWS AND LINUX OPERATING SYSTEM FILE MANAGEMENT COMMANDS, PROGRAMMING LOGIC, AND FOUNDATIONAL NETWORK CONCEPTS. RELEVANT INDUSTRY-RECOGNIZED CERTIFICATES COULD REPLACE THE NEED FOR THE EXAMINATION PROCESS.\nRELEVANT CERTIFICATIONS THAT MAY SUBSTITUTE FOR TESTED EXPERIENCE WOULD INCLUDE BUT ARE NOT LIMITED TO TESTOUT PC PRO OR COMPTIA A+ CERTIFICATIONS, MCSA: WINDOWS SERVER 2016 EXAMS 70-740 OR 70-742 EXAMS, COMP TIA SECURITY + OR SECURITY PRO CERTIFICATIONS, OR LPIC-2 LINUX PROFESSIONAL INSTITUTE CERTIFICATION.",
    "job_skill_set": [
      "IT Fundamentals",
      "Programming Logic",
      "Networking Concepts",
      "Computer Hardware Functions",
      "CompTIA A+ Certification",
      "Communication",
      "Teamwork",
      "Adaptability",
      "Conflict Resolution",
      "Mentoring",
      "Organizational Skills",
      "Engagement",
      "Professional Development",
      "Student Support",
      "Windows Command Prompt",
      "Linux Command Line",
      "PowerShell",
      "Audio-Visual Equipment Operation",
      "Learning Management Systems (LMS)",
      "Curriculum Development",
      "MCSA: Windows Server 2016",
      "CompTIA Security+ Certification",
      "LPIC-2 Linux Professional Institute Certification",
      "Diversity Awareness"
    ],
    "short_keywords": [
      "2016",
      "a",
      "adaptability",
      "audiovisual",
      "awareness",
      "certification",
      "command",
      "communication",
      "comptia",
      "computer",
      "concepts",
      "conflict",
      "curriculum",
      "development",
      "diversity",
      "engagement",
      "equipment",
      "functions",
      "fundamentals",
      "hardware",
      "information",
      "informationtechnology",
      "institute",
      "instructor",
      "it",
      "learning",
      "line",
      "linux",
      "lms",
      "logic",
      "lpic2",
      "management",
      "mcsa",
      "mentoring",
      "networking",
      "operation",
      "organizational",
      "powershell",
      "professional",
      "programming",
      "prompt",
      "resolution",
      "security",
      "server",
      "skills",
      "student",
      "support",
      "systems",
      "teamwork",
      "technology",
      "windows"
    ]
  },
  {
    "job_id": "3904999114",
    "job_title": "Southeast Regional Manager, Office IT (Support) - Information Technology (IT)",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JONES DAY IS A GLOBAL LAW FIRM WITH 40 OFFICES IN MAJOR CENTERS OF BUSINESS AND FINANCE THROUGHOUT THE WORLD. COVERING 19 COUNTRIES ON FIVE CONTINENTS, OUR UNIQUE GOVERNANCE SYSTEM FOSTERS AN UNPARALLELED LEVEL OF INTEGRATION AND CONTRIBUTES TO OUR RANKING AS ONE OF THE BEST IN THE WORLD IN CLIENT SERVICE.\nJONES DAY SEEKS TO EMPLOY THE MOST QUALIFIED PEOPLE, CAPABLE OF DELIVERING SUPERIOR CLIENT SERVICE THROUGH PROFESSIONAL EXCELLENCE AND TEAMWORK, FOR EVERY POSITION IN THE FIRM. WE OFFER COMPETITIVE COMPENSATION AND BENEFITS IN A STIMULATING WORK ENVIRONMENT.\nARE YOU INTERESTED IN THE OPPORTUNITY TO WORK FOR A GLOBAL LEADING LAW FIRM THAT WILL GIVE YOU THE EXPERIENCE AND EXPOSURE YOU NEED TO BUILD YOUR KNOWLEDGE AND SKILLS AS WELL AS ADVANCE YOUR CAREER? IF YOU ARE, THEN JONES DAY MAY BE THE FIRM FOR YOU.\nSUMMARY OF ESSENTIAL DUTIES AND RESPONSIBILITIES:THE REGIONAL IT SUPPORT MANAGER IS RESPONSIBLE FOR DELIVERING FIRM TECHNOLOGY SERVICES UNDER THE DIRECTION OF THE GLOBAL OFFICE IT SUPPORT MANAGER, INCLUDING MANAGEMENT OF THE REGION’S IT STAFF, COLLABORATION WITH THE OFFICE LEADERSHIP, OVERSIGHT OF THE OFFICE TECHNICAL PLATFORMS AND NETWORK, OVERSIGHT OF TECHNOLOGY PROJECTS AND ACTIVITIES, AND COORDINATING REGIONAL NEEDS WITH ALL FIRM IT TEAMS. PROVIDE SUPPORT FOR ASSIGNED FIRM SYSTEMS; MANAGING WORK UTILIZING A TICKET MANAGEMENT SYSTEM; RESOLVING ISSUES ESCALATED FROM THE HELP DESK AND OTHER TECHNOLOGY TEAMS; COMMUNICATING WITH END-USERS, DOCUMENTING RESOLUTIONS AND KNOWN TECHNICAL ISSUES; MONITORING THE INTEGRITY OF VARIOUS NETWORKS AND SYSTEMS; ASSISTING WITH ENGINEERING RESOLUTIONS OR DEVELOPING \"BUG\" FIXES AND SYSTEM ENHANCEMENTS; INTERFACING WITH VARIOUS GROUPS WITHIN THE DEPARTMENT; AND PARTICIPATING IN TECHNOLOGY PROJECTS AS REQUESTED. THE REGIONAL IT SUPPORT MANAGER WILL BE BASED IN OUR ATLANTA OFFICE AND HAVE RESPONSIBILITY FOR OUR MIAMI, MEXICO CITY, AND SAO PAULO OFFICES.\nREQUIRED QUALIFICATIONS:BACHELOR’S DEGREE, PREFERABLY IN COMPUTER SCIENCE OR INFORMATION TECHNOLOGY AND/OR EQUIVALENT WORK EXPERIENCE.MINIMUM OF FIVE (5) YEARS OF EXPERIENCE IN A COMPUTER-RELATED FIELD, PREFERABLY IN A LAW FIRM OR PROFESSIONAL SERVICES ENVIRONMENT.AN UNDERSTANDING OF AND EXPERIENCE IN DEALING WITH LOCAL AREA NETWORKS, CABLING, ELECTRICAL SYSTEMS, AND OTHER INFRASTRUCTURE COMPONENTS (E.G., COMPUTER ROOM HVAC, UPS, SECURITY SYSTEMS).A PRACTICAL KNOWLEDGE OF PC HARDWARE AND SOFTWARE AND THE ABILITY TO TROUBLESHOOT RELATED PROBLEMS.A PRACTICAL KNOWLEDGE OF MOBILE DEVICES, MOBILE DEVICE OPERATING SYSTEMS AND SOFTWARE, MOBILE ENTERPRISE EMAIL CLIENTS AND THE ABILITY TO TROUBLESHOOT RELATED PROBLEMS.ITIL CERTIFICATION PREFERRED.\nJONES DAY IS AN EQUAL OPPORTUNITY EMPLOYER",
    "job_skill_set": [
      "IT management",
      "network management",
      "ticket management system",
      "troubleshooting",
      "PC hardware and software",
      "project management",
      "technical documentation",
      "infrastructure components knowledge",
      "teamwork",
      "communication",
      "problem solving",
      "collaboration",
      "leadership",
      "customer service",
      "adaptability",
      "mobile device management",
      "ITIL certification"
    ],
    "short_keywords": [
      "adaptability",
      "and",
      "certification",
      "collaboration",
      "communication",
      "components",
      "customer",
      "device",
      "documentation",
      "hardware",
      "information",
      "informationtechnology",
      "infrastructure",
      "it",
      "itil",
      "knowledge",
      "leadership",
      "management",
      "manager",
      "mobile",
      "network",
      "office",
      "pc",
      "problem",
      "project",
      "regional",
      "service",
      "software",
      "solving",
      "southeast",
      "support",
      "system",
      "teamwork",
      "technical",
      "technology",
      "ticket",
      "troubleshooting"
    ]
  },
  {
    "job_id": "3905331454",
    "job_title": "Information Technology Data Analyst II - Professional Development",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "DESCRIPTION\n\nSUMMARY:\n\nPOSSESSES KNOWLEDGE OF QUALITY IMPROVEMENT PRINCIPLES AND STATISTICS COMMONLY USED IN DATA EXTRACTION, ANALYTICS, AND PERFORMANCE IMPROVEMENT. RESPONSIBLE FOR COMPILING, PRODUCING AND ANALYZING REPORTS AND STATISTICAL INFORMATION FOR DSRIP ADMINISTRATIVE DEPARTMENT. PARTICIPATES IN THE PLANNING, IMPLEMENTATION, AND MONITORING OF DATA COLLECTION, IN COLLABORATION WITH OPERATIONAL TEAMS AND EXTERNAL PROGRAM PARTNERS. RESPONSIBLE FOR PROVIDING DATA REQUESTS, RETRIEVAL, ANALYSIS, AND ASSISTS IN MEASURING OUTCOMES, PROCESS IMPROVEMENTS, AND BUSINESS PLANNING PERTAINING TO DSRIP PROGRAMS. RESPONSIBLE GATHERING AND SUBMISSION OF DSRIP PROGRAM RELATED INFORMATION (CLINICAL AND FINANCIAL) AND OTHER DATA REQUESTS. RESPONSIBILITY FOR PREPARING DATA REQUIRED DSRIP MONTHLY REPORTING. PARTICIPATE IN THE ANALYSIS, SUMMARY AND REPORTING OF CLINICAL AND ADMINISTRATIVE DATA FOR REGULATORY PURPOSES. IMPLEMENTS DATA MANAGEMENT PLAN BY CONDUCTING AUDITS ON PATIENTS FILES, VALIDATING DATA INTEGRITY AND INTERPRETING RESULTS USING STATISTICAL AND DATA ANALYSIS TOOLS. UNDERSTANDS THE SOFTWARE APPLICATION SYSTEMS (I.E., STRATA, MIDAS+) UTILIZED BY HOSPITAL FOR DATA ANALYTICS AND REPORTING. SERVES AS A TEAM MEMBER ON ASSIGNED PROJECTS.\n\nRESPONSIBILITIES\n\nMEETS EXPECTATIONS OF THE APPLICABLE ONECHRISTUS COMPETENCIES: LEADER OF SELF, LEADER OF OTHERS, OR LEADER OF LEADERS.MAINTAINS CONSISTENCY WITH ADMINISTRATIVE AND DEPARTMENTAL POLICIES WITH APPROPRIATE BEHAVIOR, DRESS, ATTITUDE, ATTENDANCE, CONFIDENTIALITY, PROFESSIONALISM, AND RELIABILITY.SERVES AS TEAM MEMBER ON ASSIGNED TEAMS. PROVIDES REQUESTED DRILLDOWNS, FOLLOW -UPS AND RECOMMENDATIONS THAT MAY BE REQUESTED BY THE TEAM AND PRESENTS IN REPORT FORMAT.PROVIDES TECHNICAL SUPPORT AND ANALYTICAL SUPPORT ON DSRIP PROJECTS, OPERATIONAL PLANNING AND PERFORMANCE MONITORING. CREATES CUSTOM AND STANDARD REPORTS FOR DSIRP PROGRAM MANAGEMENT. ANALYZES DATA AND PERFORMS DRILLDOWNS WHEN INDICATED.PARTICIPATES IN THE PLANNING, IMPLEMENTATION, AND MONITORING OF DATA COLLECTION. PROVIDES GUIDANCE AND ASSISTANCE FOR MORE EFFICIENT APPROACHES AND METHODS FOR WORK PROCESSES AND/OR SOLVING PROBLEMS. SUPPORTS DATA REQUESTS, RETRIEVAL, ANALYSIS, AND ASSISTS IN MEASURING OUTCOMES, PROCESS IMPROVEMENTS, AND BUSINESS PLANNING. CONSISTENTLY MEETS DAILY, MONTHLY, AND ANNUAL DEADLINES BY WORKING EFFECTIVELY WITH MULTIPLE INDIVIDUALS IN A HIGHLY TACTFUL YET PRECISE AND PROFESSIONAL MANNER.IMPLEMENTS DATA MANAGEMENT PLAN BY CONDUCTING AUDITS ON PATIENT FILES, VALIDATING DATA INTEGRITY AND INTERPRETING RESULTS USING STATISTICAL AND DATA ANALYSIS TOOLS. PRESENTS DATA THAT IS USEFUL AND UNDERSTANDABLE FOR ONGOING MONITORING. UNDERSTANDS ALL OF THE SOFTWARE APPLICATION SYSTEMS (I.E., STRATA, MIDAS+) UTILIZED BY DSRIP ADMINISTRATIVE MANAGEMENT. GATHERS AND SUBMITS DSRIP RELATED INFORMATION (CLINICAL AND FINANCIAL) AND OTHER DATA REQUESTS. ASSISTS IN THE ANALYSIS, SUMMARY AND REPORTING OF CLINICAL AND ADMINISTRATIVE DATA FOR REGULATORY PURPOSES.PREPARES DATA AND OTHER SUPPORTING DOCUMENTATION FOR SUBMISSION TO INTERNAL AND EXTERNAL AUDITORS (CLINICAL AND FINANCIAL). COMPLETES THE DATA INTEGRITY DATA QUALITY TEST WITH A 90% ACCURACY RATE.\n\nREQUIREMENTS\n\nBACHELOR’S DEGREE PREFERRED.2 YEARS OF EXPERIENCE REQUIRED.3 OR MORE YEARS OF EXPERIENCE PREFERRED.\n\nWORK TYPE\n\nFULL TIME\n\nEEO IS THE LAW - CLICK BELOW FOR MORE INFORMATION: \n\nHTTPS://WWW.EEOC.GOV/SITES/DEFAULT/FILES/2023-06/22-088_EEOC_KNOWYOURRIGHTS6.12SCREENRDR.PDF\n\nWE ENDEAVOR TO MAKE THIS SITE ACCESSIBLE TO ANY AND ALL USERS. IF YOU WOULD LIKE TO CONTACT US REGARDING THE ACCESSIBILITY OF OUR WEBSITE OR NEED ASSISTANCE COMPLETING THE APPLICATION PROCESS, PLEASE CONTACT US AT (844) 257-6925.",
    "job_skill_set": [
      "performance improvement",
      "problem solving",
      "attention to detail",
      "data analysis",
      "statistical analysis",
      "data extraction",
      "data management",
      "reporting",
      "data integrity validation",
      "software applications (Strata, MIDAS+)",
      "data collection",
      "auditing",
      "teamwork",
      "communication",
      "professionalism",
      "time management",
      "adaptability",
      "confidentiality"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "analyst",
      "applications",
      "attention",
      "auditing",
      "collection",
      "communication",
      "confidentiality",
      "data",
      "detail",
      "development",
      "extraction",
      "ii",
      "improvement",
      "information",
      "informationtechnology",
      "integrity",
      "management",
      "midas",
      "performance",
      "problem",
      "professional",
      "professionalism",
      "reporting",
      "software",
      "solving",
      "statistical",
      "strata",
      "teamwork",
      "technology",
      "time",
      "to",
      "validation"
    ]
  },
  {
    "job_id": "3902825422",
    "job_title": "Information Technology Project Coordinator",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOB TITLE: PROJECT COORDINATORPROJECT DURATION: 02 MONTHS (WITH POSSIBLE RENEWAL)WORKSITE ADDRESS: QUINCY, MA 02171, \nJOB DUTIES: (DETAILED LIST OF RESPONSIBILITIES): ENSURE THE QUALITY, TIMELINESS, AND CONTINUITY OF THE BUSINESS EVV PROGRAM IN REVIEWING ALL PROJECT DELIVERABLES, MANAGING AND MONITORING OF ISSUES AND RISKS (RAID REPORTING) WITHIN THE PROJECT AND OPERATIONS, CONSOLIDATING PROJECT, TECHNICAL, SECURITY, & VENDOR DOCUMENTATION TO THE EOHHS DESIGNATED INTERNAL REPOSITORY, AND BE RESPONSIBLE FOR THE ONGOING MONITORING OF THE SERVICE LEVELS & SUPPORT AGREEMENTS OF THE EVV PROGRAM.PROVIDE SUPPORT FOR IT PROJECTS, SUCH AS ISSUES AND ACTIONS NECESSARY FOR REMEDIATION/PRESENT WEEKLY FINDINGS AND/OR RECOMMENDATIONS AS REQUIRED TO INTERNAL AND EXTERNAL STAKEHOLDERS, REPORTING ON THE PROGRESS WITHIN EACH STAGE OF DESIGN, DEVELOPMENT, IMPLEMENTATION, TESTING, AND OPERATIONAL ACTIVITIES OF THE OF THE ELECTRONIC VISIT VERIFICATION (EVV) SOLUTION.WORK CLOSELY WITH BUSINESS, PROJECT MANAGEMENT AND BUSINESS MANAGERSEVALUATE AND ENSURE PROPER CHANGE CONTROL AND UPDATES TO SOURCE DOCUMENTATION AND GUIDELINES.COLLABORATE WITH CROSS-FUNCTIONAL TEAMS.PROACTIVELY MANAGE ISSUES, RISKS AND DEPENDENCIES, EMPLOYING PROBLEM-SOLVING SKILLS TO OVERCOME OBSTACLES AND ENSURE SUCCESSFUL PROJECT TASKS.FACILITATE EFFECTIVE COMMUNICATION BETWEEN TECHNICAL TEAMS AND NON-TECHNICAL STAKEHOLDERS, TRANSLATING COMPLEX TECHNICAL CONCEPTS INTO EASY-TO-UNDERSTAND LANGUAGE.QUICKLY GAIN A DEEP UNDERSTANDING OF OUR BUSINESS AND\\OR APPLICATION PROCESSES.EXPERIENCE AND KNOWLEDGE OF WORKING IN A SOFTWARE DEVELOPMENT LIFE CYCLE (SDLC).EXPERIENCE MANAGING AND OR WORKING WITH 3RD PARTY VENDORS OR CONSULTANTS.ABILITY TO DEVELOP AND MAINTAIN EFFECTIVE RELATIONSHIPS WITH MANAGEMENT, END USERS, PROJECT TEAM MEMBERS, AND VENDORS. EXCELLENT CUSTOMER SERVICE SKILLS.EXCELLENT ORAL AND WRITTEN COMMUNICATION AND PRESENTATION SKILLS.PROFICIENT IN USING MICROSOFT OFFICE SUITE, VISIO, MS PROJECT, OTHER PROJECT MANAGEMENT AND COLLABORATION TOOLS.EXCELLENT PROBLEM-SOLVING SKILLS. QUALIFICATIONS (EDUCATION, YEARS’ EXPERIENCE, CERTIFICATES): ASSOCIATE OR BACHELOR’S DEGREE IN COMPUTER SCIENCE, INFORMATION SYSTEMS, BUSINESS ADMINISTRATION OR OTHER RELATED FIELD, OR EQUIVALENT WORK EXPERIENCE.PROFESSIONAL CERTIFICATION IN PROJECT MANAGEMENT, SECURITY, OR BUSINESS ANALYSIS WOULD BE PREFERRED OR A MINIMUM OF 3 YEARS OF HANDS-ON EXPERIENCE IN BUSINESS APPLICATION IMPLEMENTATION SUPPORT.STRONG FAMILIARITY WITH SECURITY, HIPAA, AND PRIVACY STANDARDS IN WORKING WITH EDI, PII AND PHI DATA.EXCELLENT TECHNICAL SKILLS, INCLUDING EXPERIENCE WITH DATA ANALYSIS AND VISUALIZATION TOOLS.EXCELLENT WRITING AND COMMUNICATION SKILLS.EXCELLENT PRESENTATION SKILLS.ABILITY TO LEARN QUICKLY AND TAKE DIRECTION FROM LEAD MANAGERS.ABILITY TO WORK INDEPENDENTLY AND AS PART OF A TEAM.",
    "job_skill_set": [
      "project management",
      "data analysis",
      "Microsoft Office Suite",
      "MS Project",
      "software development life cycle (SDLC)",
      "documentation management",
      "vendor management",
      "collaboration tools",
      "communication",
      "problem solving",
      "teamwork",
      "customer service",
      "relationship building",
      "presentation skills",
      "adaptability",
      "stakeholder management",
      "Visio",
      "security standards (HIPAA, EDI, PII, PHI)"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "building",
      "collaboration",
      "communication",
      "coordinator",
      "customer",
      "cycle",
      "data",
      "development",
      "documentation",
      "edi",
      "hipaa",
      "information",
      "informationtechnology",
      "life",
      "management",
      "microsoft",
      "ms",
      "office",
      "phi",
      "pii",
      "presentation",
      "problem",
      "project",
      "relationship",
      "sdlc",
      "security",
      "service",
      "skills",
      "software",
      "solving",
      "stakeholder",
      "standards",
      "suite",
      "teamwork",
      "technology",
      "tools",
      "vendor",
      "visio"
    ]
  },
  {
    "job_id": "3904729333",
    "job_title": "Information Technology Program Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "AKKODIS IS PARTNERING WITH A LEADING COMPANY AIMED TO EMPOWER TOP-TIER GLOBAL ENTERPRISES TO SECURELY MODERNIZE THEIR NETWORKS AND APPLICATIONS, PRIORITIZING MOBILITY AND CLOUD-FIRST STRATEGIES. THEY ARE SEEKING A SENIOR TECHNICAL PROJECT MANAGER (TPM). \nTHE TERMS:REMOTE BUT SF BAY AREA CANDIDATES MUST BE HYBRIDPAY RANGE OF $70-95/HR MAXUNTIL THE END OF THE YEAR WITH A POSSIBILITY TO EXTEND\nREQUIRED SKILLS/EXPERIENCE: 7+ YEARS TECHNOLOGY PM EXPERIENCE WITH EXPERIENCE IMPLEMENTING WORKDAYCOMMUNICATION SKILLS WILL BE CRITICAL SINCE THEY WILL BE WORKING WITH C-LEVEL EXECUTIVES\n\nSUMMARY: WE ARE SEEKING A SENIOR TECHNICAL PROJECT MANAGER (TPM), PRIMARILY RESPONSIBLE FOR OVERSEEING THE IMPLEMENTATION OF WORKDAY FOCUSING ON HR MODULES. THE SUCCESSFUL CANDIDATE WILL EXHIBIT STRONG LEADERSHIP SKILLS, TECHNICAL PROJECT MANAGEMENT EXPERTISE, AND A DEEP UNDERSTANDING OF HR PROCESSES, PARTICULARLY WITHIN THE CONTEXT OF THE \"PEOPLE AND CULTURE\" DOMAIN. THIS ROLE DEMANDS A PROACTIVE INDIVIDUAL WHO CAN NAVIGATE COMPLEX STAKEHOLDER DYNAMICS, INCLUDING IT, HR, EXTERNAL CONSULTANTS, AND WORKDAY REPRESENTATIVES.\n\n---\nBENEFIT OFFERINGS INCLUDE MEDICAL, DENTAL, VISION, TERM LIFE INSURANCE, SHORT-TERM DISABILITY INSURANCE, ADDITIONAL VOLUNTARY BENEFITS, COMMUTER BENEFITS AND 401K PLAN. OUR PROGRAM PROVIDES EMPLOYEES THE FLEXIBILITY TO CHOOSE THE TYPE OF COVERAGE THAT MEETS THEIR INDIVIDUAL NEEDS. AVAILABLE PAID LEAVE MAY INCLUDE PAID SICK LEAVE, WHERE REQUIRED BY LAW; ANY OTHER PAID LEAVE REQUIRED BY FEDERAL, STATE OR LOCAL LAW; AND HOLIDAY PAY UPON MEETING ELIGIBILITY CRITERIA. DISCLAIMER: THESE BENEFIT OFFERINGS DO NOT APPLY TO CLIENT-RECRUITED JOBS AND JOBS WHICH ARE DIRECT HIRE TO A CLIENT.\nTO READ OUR CANDIDATE PRIVACY INFORMATION STATEMENT, WHICH EXPLAINS HOW WE WILL USE YOUR INFORMATION, PLEASE VISIT HTTPS://WWW.MODIS.COM/EN-US/CANDIDATE-PRIVACY/\nTHE COMPANY WILL CONSIDER QUALIFIED APPLICANTS WITH ARREST AND CONVICTION RECORDS.\nIF YOU ARE INTERESTED IN THIS POSITION THEN PLEASE CLICK APPLY NOW. FOR OTHER OPPORTUNITIES AVAILABLE AT AKKODIS GO TO WWW.AKKODIS.COM. IF YOU HAVE QUESTIONS ABOUT THE POSITION, PLEASE CONTACT THE JOB POSTER.\nEQUAL OPPORTUNITY EMPLOYER/VETERANS/DISABLED",
    "job_skill_set": [
      "Communication",
      "Leadership",
      "Proactivity",
      "Collaboration",
      "Problem Solving",
      "Workday",
      "Technical Project Management",
      "HR Processes",
      "Stakeholder Management",
      "Cloud Strategies",
      "Mobility Solutions"
    ],
    "short_keywords": [
      "cloud",
      "collaboration",
      "communication",
      "hr",
      "information",
      "informationtechnology",
      "leadership",
      "management",
      "manager",
      "mobility",
      "proactivity",
      "problem",
      "processes",
      "program",
      "project",
      "solutions",
      "solving",
      "stakeholder",
      "strategies",
      "technical",
      "technology",
      "workday"
    ]
  },
  {
    "job_id": "3905249935",
    "job_title": "Information Technology Security Administrator",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "ROLE NAME: IT SECURITY ADMINISTRATOR5 YRS HANDS ON IT SECURITY OPERATIONS\nSKILL SUMMARYLOOKING FOR AN IT SECURITY ADMINISTRATOR TO SUPPORT IT SECURITY OPERATIONS WITH EXCELLENCE AND COLLABORATION. FROM MANAGING SECURITY CONTROLS TO FOSTERING RESILIENCE, AN EXPERT WHO WILL PROTECT BUSINESS AGAINST EVOLVING THREATS.ON/OFFSHORE, REMOTE/ETC.ONSITE: 5 DAYS A WEEK @ CLIENT LOCATION - PLEASANT PRAIRIE, WI.TYPE OF EMPLOYMENT: CONTRACT 6 MONTHS SUBJECT TO EXTENSION.\nJOB RESPONSIBILITIESWORK WITH IT SECURITY STAFF IN MAINTAINING THE INTEGRITY OF OUR SYSTEMS AND DATA WITH A FOCUS ON SECURITY CONTROLS, RISK MANAGEMENT AND RESILIENCE.MENTOR ASSOCIATES AND INTERNS BY OFFERING TECHNICAL GUIDANCE AND EXPERTISE ON TASKS AND PROJECTS TO ENSURE CONTINUOUS DEVELOPMENT OF OUR IT SECURITY TEAM.COLLABORATE WITH IT AND OTHER BUSINESS TEAMS TO DEVELOP ROBUST SECURITY PROCEDURES TO ENHANCE OUR SECURITY POSTURE AND ENSURE SEAMLESS BUSINESS OPERATIONS.CONTRIBUTE TO OUR THREAT OPERATIONS PROGRAM, INCLUDING PERSONNEL SUPPORT, POLICY ENFORCEMENT AND CYBERSECURITY AWARENESS INITIATIVES.COMMUNICATE TECHNICAL SECURITY CONCEPTS EFFECTIVELY TO ALL PERSONNEL.\nMANDATORY SKILLSBACHELOR'S DEGREE IN COMPUTER SCIENCE, INFORMATION TECHNOLOGY OR RELATED FIELD.5+ YEARS OF EXPERIENCE IN IT SECURITY OPERATIONS, WITH A STRONG UNDERSTANDING OF ENTERPRISE-LEVEL SECURITY PRACTICES.CISSP (CERTIFIED INFORMATION SYSTEMS SECURITY PROFESSIONAL), SECURITY+ OR RELATED INFORMATION SECURITY CERTIFICATIONS ARE PREFERRED.REQUIRED EDUCATIONBACHELOR’S OR MASTER’S DEGREE IN COMPUTER SCIENCE, INFORMATION TECHNOLOGY, OR A RELATED FIELD.",
    "job_skill_set": [
      "IT Security Operations",
      "Security Controls",
      "Risk Management",
      "Cybersecurity Awareness",
      "Security+ Certification",
      "Technical Guidance",
      "Enterprise-Level Security Practices",
      "Collaboration",
      "Communication",
      "Continuous Development",
      "Problem Solving",
      "CISSP Certification",
      "Bachelor's Degree in Computer Science",
      "Master's Degree in Computer Science",
      "Mentoring"
    ],
    "short_keywords": [
      "administrator",
      "awareness",
      "bachelors",
      "certification",
      "cissp",
      "collaboration",
      "communication",
      "computer",
      "continuous",
      "controls",
      "cybersecurity",
      "degree",
      "development",
      "enterpriselevel",
      "guidance",
      "in",
      "information",
      "informationtechnology",
      "it",
      "management",
      "masters",
      "mentoring",
      "operations",
      "practices",
      "problem",
      "risk",
      "science",
      "security",
      "solving",
      "technical",
      "technology"
    ]
  },
  {
    "job_id": "3901941877",
    "job_title": "Information Technology System Administrator",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "THE IT SYSTEM ADMINISTRATOR POSITION WILL SUPPORT THE CURRENT SERVER MIDDLEWARE AND SOFTWARE ENVIRONMENTS. THIS POSITION WILL BE REQUIRED TO COORDINATE WITH TEAMS IN SUPPORT AND ADMINISTRATION OF SERVERS SUPPORTING THE CLIENT’S ENVIRONMENT. THIS POSITION WILL ALSO SUPPORT TECHNICAL TEAMS ON PROBLEM RESOLUTION, UPGRADES, PATCHING, AND OTHER TASKS WITH MIDDLEWARE AND 3RD PARTY APPLICATIONS. THIS POSITION WILL OFFER INPUT TO ESTABLISH SHORT-TERM AND LONG-TERM STRATEGIC NEEDS FOR THE ACTIVE DIRECTORY ENVIRONMENT AND SUPPORTING COMPONENTS.\nREQUIRED SKILLS, QUALIFICATIONS, AND EDUCATION:1-3 YEARS’ EXPERIENCE MANAGING CURRENT SERVER OPERATING SYSTEMS INCLUDING MICROSOFT AND LINUX.1-3 YEARS’ EXPERIENCE MANAGING MICROSOFT ACTIVE DIRECTORY AND ITS COMPONENTS.UNDERSTANDING OF ACTIVE DIRECTORY REPLICATION, DNS, DHCP, SITE LINKS, SITE TOPOLOGY, GROUP POLICY, GLOBAL CATALOGS, AND OTHER CORE INFRASTRUCTURE COMPONENTS REQUIRED.KNOWLEDGE AND UNDERSTANDING OF KERBEROS AND NLTM, LDAP AND SAML PROTOCOLS.PREFERRED EXPERIENCE WITH MULTI-FOREST ACTIVE DIRECTORY ENVIRONMENTSKNOWLEDGE UTILIZING POWERSHELL IN CONFIGURATION AND ADMINISTRATION OF MICROSOFT SOLUTIONS IS A MAJOR PLUS.HANDS-ON EXPERIENCE WITH WINDOWS AND LINUX ENVIRONMENTS, BOTH SERVER AND CLIENT BASED.ABILITY TO DIAGNOSE AND TROUBLESHOOT COMPLEX TECHNICAL ISSUES.",
    "job_skill_set": [
      "Linux",
      "Troubleshooting",
      "Team Coordination",
      "Problem Resolution",
      "Microsoft Server Operating Systems",
      "Microsoft Active Directory",
      "Active Directory Replication",
      "DNS",
      "DHCP",
      "Group Policy",
      "Kerberos",
      "NTLM",
      "LDAP",
      "SAML",
      "PowerShell",
      "Strategic Planning"
    ],
    "short_keywords": [
      "active",
      "administrator",
      "coordination",
      "dhcp",
      "directory",
      "dns",
      "group",
      "information",
      "informationtechnology",
      "kerberos",
      "ldap",
      "linux",
      "microsoft",
      "ntlm",
      "operating",
      "planning",
      "policy",
      "powershell",
      "problem",
      "replication",
      "resolution",
      "saml",
      "server",
      "strategic",
      "system",
      "systems",
      "team",
      "technology",
      "troubleshooting"
    ]
  },
  {
    "job_id": "3905255326",
    "job_title": "Information Technology Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "TITLE: IT SPECIALISTCOMPANY: TENDERCARE HOME HEALTH SERVICESLOCATION: INDIANAPOLIS, INDIANAHOURS: FULL-TIME, IN-OFFICE WITH REMOTE ON-CALL\nABOUT TENDERCARE HOME HEALTH SERVICES:AT TENDERCARE HOME HEALTH SERVICES, WE ARE COMMITTED TO PROVIDING OUTSTANDING CARE THROUGH A TEAM OF PASSIONATE HEALTHCARE PROFESSIONALS. RECOGNIZED AS A PERENNIAL TOP WORKPLACE, WE OFFER A SUPPORTIVE AND INNOVATIVE ENVIRONMENT WHERE YOU CAN TRULY MAKE A DIFFERENCE. JOIN US AS WE EXPAND OUR TECHNOLOGICAL CAPABILITIES TO BETTER SERVE OUR CLIENTS AND STAFF. ROLE OVERVIEW:WE ARE SEEKING AN IT SPECIALIST WHO IS READY TO TACKLE CHALLENGING TASKS IN A FAST-PACED HEALTHCARE SETTING. THE IDEAL CANDIDATE WILL POSSESS A SOLID TECHNICAL BACKGROUND, A READINESS FOR ON-CALL DUTIES, AND A STRONG SENSE OF CUSTOMER SERVICE. KEY RESPONSIBILITIES:ENSURE EFFICIENT OPERATION AND TROUBLESHOOTING OF SYSTEMS INCLUDING ADP, CELLTRAK, ACTIVE DIRECTORY, NETSMART, LITMOS, RINGCENTRAL, WORDPRESS.MANAGE AND DEVELOP SQL DATABASES, CREATE TOOLS USING ACCESS, EXCEL, AND PYTHON TO ENHANCE OPERATIONAL EFFICIENCY.MAINTAIN RIGOROUS SECURITY PROTOCOLS AND MANAGE USER ACCESS ACROSS PLATFORMS.PROVIDE RESPONSIVE TECHNICAL SUPPORT TO OUR OFFICE STAFF, FIELD STAFF, CLIENTS, & OUR NEW BRANCH IN LAWRENCEBURG, INDIANA. PROMOTING A CULTURE OF HIGH-QUALITY SERVICE IS KEY. REQUIREMENTS:BACHELOR’S DEGREE IN INFORMATION TECHNOLOGY, COMPUTER SCIENCE, OR RELATED FIELD.PROFICIENCY MICROSOFT SUITE PROGRAMS (ACCESS, EXCEL, WORD, ONE DRIVE, ETC.)UNDERSTANDING & EXPERIENCE IN SQL & PYTHON IS A PLUS.EXPERIENCE WITH PATIENT DATABASE SYSTEMS, RINGCENTRAL, LITMOSBACKGROUND IN HEALTHCARE AND CUSTOMER SERVICE IS HIGHLY PREFERRED.ABILITY TO PARTICIPATE IN AN AFTER-HOURS/WEEKENDS ON-CALL ROTATION WITH OTHER TEAM MEMBERSSTRONG ANALYTICAL AND PROBLEM-SOLVING SKILLS. BENEFITS:COMPETITIVE HEALTH, DENTAL, AND VISION INSURANCE.LIFE INSURANCE AND SUPPLEMENTAL SHORT-TERM DISABILITY COVERAGE.GENEROUS 401(K) PLAN WITH EMPLOYER MATCH TO HELP YOU INVEST IN YOUR FUTURE.FULL-TIME POSITION WITH THE FLEXIBILITY TO WORK FROM HOME AS NEEDED.OPPORTUNITY TO WORK IN A TOP WORKPLACE THAT VALUES INNOVATION AND TEAMWORK. HOW TO APPLY:IF YOU ARE LOOKING TO MAKE A SIGNIFICANT IMPACT IN A REWARDING FIELD, WE WOULD LOVE TO HEAR FROM YOU. PLEASE SUBMIT YOUR RESUME DETAILING YOUR QUALIFICATIONS AND ENTHUSIASM FOR THE ROLE AT TENDERCARE HOME HEALTH SERVICES. WE ARE EAGER TO FILL THIS POSITION PROMPTLY AND LOOK FORWARD TO REVIEWING YOUR APPLICATION.TENDERCARE HOME HEALTH SERVICES IS AN EQUAL OPPORTUNITY EMPLOYER. WE CELEBRATE DIVERSITY AND ARE COMMITTED TO CREATING AN INCLUSIVE ENVIRONMENT FOR ALL EMPLOYEES.",
    "job_skill_set": [
      "SQL",
      "Microsoft Suite",
      "Active Directory",
      "WordPress",
      "Access",
      "Excel",
      "Customer Service",
      "Analytical Skills",
      "Problem Solving",
      "Teamwork",
      "Communication",
      "Adaptability",
      "Python",
      "ADP",
      "CellTrak",
      "NetSmart",
      "Litmos",
      "RingCentral"
    ],
    "short_keywords": [
      "access",
      "active",
      "adaptability",
      "adp",
      "analytical",
      "celltrak",
      "communication",
      "customer",
      "directory",
      "excel",
      "information",
      "informationtechnology",
      "litmos",
      "microsoft",
      "netsmart",
      "problem",
      "python",
      "ringcentral",
      "service",
      "skills",
      "solving",
      "specialist",
      "sql",
      "suite",
      "teamwork",
      "technology",
      "wordpress"
    ]
  },
  {
    "job_id": "3889131111",
    "job_title": "Director, Information Technology – Washington DC",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "COMPANY: \n\nCOGENT COMMUNICATIONS IS A GLOBAL, TIER 1 FACILITIES-BASED ISP, CONSISTENTLY RANKED AS ONE OF THE TOP FIVE NETWORKS IN THE WORLD AND IS PUBLICLY TRADED ON THE NASDAQ STOCK MARKET UNDER THE TICKER SYMBOL CCOI. COGENT SPECIALIZES IN PROVIDING BUSINESSES WITH HIGH SPEED INTERNET ACCESS AND ETHERNET TRANSPORT SERVICES. COGENT'S FACILITIES-BASED, ALL-OPTICAL IP NETWORK BACKBONE PROVIDES IP SERVICES GLOBALLY. SINCE ITS INCEPTION, COGENT HAS UNLEASHED THE BENEFITS OF IP TECHNOLOGY, BUILDING ONE OF THE LARGEST AND HIGHEST CAPACITY IP NETWORKS IN THE WORLD. THIS NETWORK ENABLES COGENT TO OFFER LARGE BANDWIDTH CONNECTIONS AT HIGHLY COMPETITIVE PRICES. COGENT ALSO OFFERS SUPERIOR CUSTOMER SUPPORT BY VIRTUE OF ITS END-TO-END CONTROL OF SERVICE DELIVERY AND NETWORK MONITORING. A COMPETITIVE BASE SALARY AND A FULL BENEFITS PACKAGE INCLUDING; HEALTH, DENTAL, VISION, PAID TIME OFF ( PTO), SHORT- AND LONG-TERM DISABILITY, LIFE INSURANCE, HOLIDAYS, PARENTAL LEAVE, 401 ( K) PLAN WITH EMPLOYER MATCH, STOCK OPTIONS, AND AN EMPLOYEE ASSISTANCE PROGRAM. MOST BENEFITS TAKE EFFECT WITHIN 30 DAYS OF EMPLOYMENT, AND SOME REQUIRE A WAITING PERIOD.\n\n JOB SUMMARY: \n\nTHE DIRECTOR OF INFORMATION TECHNOLOGY WILL POSSESS TECHNICAL EXPERTISE AND PROVIDE STRATEGIC LEADERSHIP, VISION, PLANNING, AND MANAGEMENT TO ALL AREAS OF CORPORATE IT. THE DIRECTOR WILL DEVELOP AND OVERSEE COMPANY-WIDE TECHNOLOGY POLICIES, PROCEDURES, SERVICES, AND FACILITIES. THE DIRECTOR WILL WORK COLLABORATIVELY WITH THE CIO AND OTHER LEADERSHIP TO DEVELOP EFFECTIVE STRATEGIES FOR INTEGRATING AND ADVANCING OUR TECHNOLOGY.\n\nTHE SUCCESSFUL CANDIDATE WILL BE A HANDS-ON MANAGER, LEADER AND MENTOR. CANDIDATE MUST HAVE THE ABILITY TO DEVELOP AND LEAD STRATEGIC AND OPERATIONAL INITIATIVES AND WILL POSSESS EXCEPTIONAL COMMUNICATION, COLLABORATION, PROJECT MANAGEMENT AND CUSTOMER SERVICE SKILLS.\n\n ESSENTIAL DUTIES AND RESPONSIBILITIES: \n\nDEVELOPS OVERALL TECHNOLOGY ROADMAP AND PLANS, FORMULATES, SETS AND IMPLEMENTS POLICES FOR CURRENT AND FUTURE INFORMATION/COMMUNICATION/ TELECOMMUNICATIONS SYSTEMS AND ACTIVITIESANALYZES IT INFRASTRUCTURE AND SYSTEMS PERFORMANCE TO ASSESS OPERATING COSTS, PRODUCTIVITY LEVELS, UPGRADE REQUIREMENTS, AND OTHER METRICS AND NEEDSMANAGES IT STAFF INCLUDING RECRUITMENT, PERFORMANCE MANAGEMENT AND EVALUATIONS, AND PROFESSIONAL DEVELOPMENTPREPARES, SUBMITS, AND MANAGES OPERATING AND CAPITAL EXPENDITURES FOR TECHNOLOGY NEEDED TO SUPPORT THE ORGANIZATIONS TECHNOLOGY PROJECTSOVERSEES THE PURCHASE, INSTALLATION, AND MAINTENANCE OF COMPUTER HARDWARE, SOFTWARE, NETWORKS, TELECOMMUNICATION EQUIPMENT ON PREMISES AND THE CLOUD ENVIRONMENTCOLLABORATES WITH DIRECTOR OF IS ON DEVELOPMENT, STAGING AND PRODUCTION PLATFORMSCOLLABORATES WITH CYBERSECURITY STAFF ON RISK ASSESSMENT, RESPONSE AND REMEDIATIONPROVIDES WEEKLY UPDATES AND STRATEGIES ON ALL PROJECTS TO CIO AND CEOPERFORM REVIEWS AND UPDATES, PROMOTES AND ENSURES POLICY AWARENESS, TRACKS EXCEPTIONS, AND PERFORMS TESTING / AUDITING / MONITORING ON POLICY COMPLIANCEKEEPS ABREAST OF NEW KNOWLEDGE, RESEARCH, PRODUCTS, AND SERVICES IN TECHNOLOGY THAT WILL BENEFIT THE ORGANIZATION\n\nQUALIFICATIONS: \n\nCOMPUTER SCIENCE OR RELATED BACHELOR’S DEGREE AND 10+ YEARS OF RELEVANT IT EXPERIENCEMINIMUM 5 YEARS OF LEADING IT TEAMS AND HANDS-ON TECHNICAL OPERATIONSPRIOR EXPERIENCE IN A HANDS-ON TECHNICAL ROLE WITH OVERSIGHT OF SYSTEMS, NETWORK, STORAGE AND DATABASE ADMINISTRATION IN AN ON-PREMISE ENVIRONMENT.STRONG EXPERIENCE IN WINDOWS AND UNIX OPERATING SYSTEMSEXPERIENCE WITH VMWARE AND NETAPP A PLUSIMPLEMENTATION AND PROJECT MANAGEMENT OF LARGE-SCALE TECHNOLOGY IMPLEMENTATIONSDETERMINE SKILLS OF CURRENT STAFF, ALIGN RESOURCES FOR BEST FIT/FUTURE STATE, STAFF DEVELOPMENT/MENTORSHIPMANAGE VENDOR RELATIONSHIPS AND NEGOTIATIONSESTABLISHING AND MAINTAINING ACCOUNTABILITY AND ADAPTABILITYEXCELLENT COMMUNICATION AND ORGANIZATION SKILLSABILITY TO WRITE AND PRESENT FORMAL DOCUMENTATION\n PHYSICAL REQUIREMENTS: \n\nREMAINS IN A SITTING/STATIONARY POSITION CONTINUALLY OR ALMOST CONTINUALLY DURING THE WORK DAYOPERATES A COMPUTER AND PERFORMS DESK-BASED COMPUTER TASKS CONTINUALLY; FREQUENTLY VIEWING A COMPUTER SCREENRARELY LIFTING, CARRYING, PUSHING, PULLING OBJECTS AND/OR EQUIPMENT THAT WEIGHS UP TO 50 POUNDS\n\n COVID-19 POLICY: \n\nCOGENT HAS ADOPTED A MANDATORY VACCINATION AND BOOSTER POLICY WHICH REQUIRES ALL U.S. EMPLOYEES TO BE FULLY VACCINATED WITH ONE BOOSTER AGAINST COVID-19. PRIOR TO BEGINNING EMPLOYMENT, NEW EMPLOYEES MUST PROVIDE PROOF OF VACCINATION OR APPLY FOR AND RECEIVE AN ACCOMMODATION TO BE EXEMPT FROM THE POLICY.\n\nBY SUBMITTING AN APPLICATION OR RESUME FOR THIS POSITION, I UNDERSTAND THAT IS AN IN-OFFICE POSITION AND AGREE TO ABIDE COGENT’S MANDATORY VACCINATION POLICY.\n\nTO APPLY FOR THE DIRECTOR INFORMATION TECHNOLOGY POSITION, PLEASE SUBMIT YOUR RESUME AND COVER LETTER TO CAREERS@COGENTCO.COM .\n\nCOGENT COMMUNICATIONS IS AN EQUAL OPPORTUNITY EMPLOYER.",
    "job_skill_set": [
      "IT Management",
      "Technical Leadership",
      "Project Management",
      "Windows Operating System",
      "Telecommunications Systems",
      "Cybersecurity",
      "Budget Management",
      "Policy Development",
      "Database Administration",
      "Network Administration",
      "Communication",
      "Collaboration",
      "Mentorship",
      "Customer Service",
      "Adaptability",
      "Accountability",
      "Organizational Skills",
      "Formal Documentation",
      "UNIX Operating System",
      "VMware",
      "NetApp",
      "Infrastructure Analysis",
      "Vendor Management",
      "Cloud Computing"
    ],
    "short_keywords": [
      "accountability",
      "adaptability",
      "administration",
      "analysis",
      "budget",
      "cloud",
      "collaboration",
      "communication",
      "computing",
      "customer",
      "cybersecurity",
      "database",
      "dc",
      "development",
      "director",
      "documentation",
      "formal",
      "information",
      "informationtechnology",
      "infrastructure",
      "it",
      "leadership",
      "management",
      "mentorship",
      "netapp",
      "network",
      "operating",
      "organizational",
      "policy",
      "project",
      "service",
      "skills",
      "system",
      "systems",
      "technical",
      "technology",
      "telecommunications",
      "unix",
      "vendor",
      "vmware",
      "washington",
      "windows"
    ]
  },
  {
    "job_id": "3891080059",
    "job_title": "Information Technology Business Analyst",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "ABOUT US:PERFICT GLOBAL IS A LEADING IT CONSULTING SERVICES PROVIDER FOCUSED ON PROVIDING INNOVATIVE AND SUCCESSFUL BUSINESS WORKFORCE SOLUTIONS TO FORTUNE 500 COMPANIES. OUR TRAINED AND EXPERIENCED PROFESSIONALS CONSTANTLY STRIVE TO BRING TOGETHER THE BEST TECHNOLOGIES AVAILABLE TO MANAGE CLIENT'S COMPLEX BUSINESS AND TECHNOLOGY, PARTICIPATE IN IMPLEMENTATION ACTIVITIES AND COLLABORATE IN NEW WAYS TO MEET CLIENT NEEDS.\nWE PROVIDE EXCELLENT BENEFITS SUCH AS MEDICAL, DENTAL, VISION ++ A FUN COMPANY TO WORK!!!\nW2\nJOB DESCRIPTION:\nBACHELORS DEGREE + 5 YEARS RELATED EXPERIENCEPEOPLESOFTCOUPASUPPLY CHAIN EXPERIENCENEED DATA BACKGROUND; DATA MANAGEMENT, DATA CLEANSING, DATA VALIDATION, WORKING WITH MASTER DATA – POSITION IS FOCUSED ON TRANSITIONING FROM PEOPLESOFT TO COUPA -WILL BE ACCOUNTABLE FOR MONITORING ALL SYSTEM INTERFACES AND EXTERNAL FILE VALIDATION – ETL, ETC.HEAVY EXCEL EXPERIENCE.BA BACKGROUND; GATHERING REQUIREMENTS, DOCUMENTATION, ETC.",
    "job_skill_set": [
      "Data Management",
      "Data Cleansing",
      "Data Validation",
      "Excel",
      "Documentation",
      "Collaboration",
      "Problem Solving",
      "Communication",
      "Accountability",
      "PeopleSoft",
      "Coupa",
      "Master Data Management",
      "ETL",
      "Business Analysis",
      "Requirements Gathering"
    ],
    "short_keywords": [
      "accountability",
      "analysis",
      "analyst",
      "business",
      "cleansing",
      "collaboration",
      "communication",
      "coupa",
      "data",
      "documentation",
      "etl",
      "excel",
      "gathering",
      "information",
      "informationtechnology",
      "management",
      "master",
      "peoplesoft",
      "problem",
      "requirements",
      "solving",
      "technology",
      "validation"
    ]
  },
  {
    "job_id": "3905867221",
    "job_title": "Information Technology Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "THE IT MANAGER WILL PRIMARILY BE RESPONSIBLE FOR THE PLANNING, IMPLEMENTATION, AND MANAGEMENT OF TECHNOLOGICAL SOLUTIONS WITHIN RICE TIRE. THIS ROLE INVOLVES OVERSIGHT OF THE TECHNOLOGY DEPARTMENT, BUDGET MANAGEMENT FOR IT OPERATIONS, AND ENSURING THE ALIGNMENT OF TECHNOLOGY INITIATIVES WITH BUSINESS GOALS. THE IT MANAGER SERVES AS A BRIDGE BETWEEN THE COMPANY’S EXECUTIVE MANAGEMENT AND ITS TECHNOLOGY DEPARTMENT, TRANSLATING BUSINESS STRATEGIES INTO TECHNOLOGICAL FRAMEWORKS THAT PROPEL THE ORGANIZATION FORWARD. PRIMARY RESPONSIBILITIES INCLUDE, BUT MAY NOT LIMITED TO, THE FOLLOWING:Ø DEVELOP AND PROMOTE THE LONG-TERM VISION AND STRATEGY OF THE IT DEPARTMENT.Ø MAINTAIN PCI DSS COMPLIANCE.Ø PROACTIVELY IMPLEMENT CYBERSECURITY PROTOCOLS AND TESTING, UTILIZING OUTSIDE SOURCES AS NEEDED.Ø RECOMMEND INFORMATION TECHNOLOGY STRATEGIES, POLICIES, AND PROCEDURES BY IDENTIFYING PROBLEMS; EVALUATE TRENDS; ANTICIPATE REQUIREMENTS.Ø ANALYZE DATA AND CREATE REPORTS. Ø WORK WITH CONTROLLER TO DETERMINE ANNUAL IT BUDGETARY NEEDS FOR ALL LOCATIONS.Ø RESEARCH NEW TECHNOLOGIES AND GUIDE DIRECTION OF RICE TIRE’S IT GOALS.Ø COMPLETE PROJECTS BY COORDINATING TIMETABLES WITH USER DEPARTMENTS AND BRING IN THIRD PARTY ASSISTANCE, WHEN NECESSARYØ AUDIT ALL ELECTRONIC SYSTEMS AND COMMUNICATION AS NECESSARY TO ENSURE COMPLIANCE WITH COMPANY POLICIES AS WELL AS THIRD PARTY POLICIES.Ø DESIGN, IMPLEMENT, MONITOR, AND MAINTAIN SERVERS AND NETWORK INFRASTRUCTURE.Ø MANAGE RELATIONS WITH VARIOUS IT VENDORS.Ø EDUCATE THE USER COMMUNITY ON THE PROPER AND SECURE RESOURCES.Ø REQUIRES 20% TRAVEL TO VARIOUS RICE TIRE LOCATIONS, WHICH MAY VARY. THE IDEAL CANDIDATE WILL HAVE KNOWLEDGE AND/OR EXPERIENCE WITH PHOCAS (OR OTHER SIMILAR SALES ANALYTICS SOFTWARE) AND SOME EXPERIENCE WITH PYTHON OR OTHER SCRIPTING LANGUAGES. ADDITIONALLY, THE CANDIDATE WILL HAVE EXPERIENCE WITH CYBERSECURITY REQUIREMENTS. EXPERIENCE WITH POINT-OF-SALE SYSTEMS IS DESIRABLE. RELEVANT DEGREES AND CERTIFICATIONS WILL BE A PLUS. RICE TIRE OFFERS A COMPETITIVE WAGE, 401K PLAN, PAID HOLIDAYS AND VACATION, AND AN AFFORDABLE BENEFITS PACKAGE. MUST HAVE A VALID DRIVER’S LICENSE AND AN ACCEPTABLE DRIVING RECORD. PRE-EMPLOYMENT DRUG SCREEN REQUIRED. THIS POSITION IS PRIMARILY AN “IN OFFICE” JOB LOCATED AT ITS CORPORATE HEADQUARTERS IN FREDERICK, MD.  RICE TIRE IS A 4TH GENERATION FAMILY-OWNED TIRE COMPANY BASED OUT OF FREDERICK, MD. WE BEGAN AS A GAS STATION IN 1929 AND NOW HAVE 13 COMMERCIAL TIRE SERVICE CENTERS, 2 RETREADING FACILITIES, AND MULTIPLE WAREHOUSES IN THE MID-ATLANTIC REGION. SAFETY, RESPECT, WORK ETHIC, HONESTY, AND TEAMWORK ARE THE CORE VALUES THAT WE STAND BY. WE ARE ALWAYS LOOKING FOR LIKE-MINDED INDIVIDUALS TO JOIN THE RICE TIRE TEAM. AS WE CONTINUE TO GROW, WE WANT YOU TO GROW WITH US.  IF YOU BELIEVE YOU ARE THE IDEAL CANDIDATE FOR THIS POSITION, SEND YOU RESUME TO SNAVE@RICETIRE.COM.",
    "job_skill_set": [
      "IT management",
      "budget management",
      "network infrastructure",
      "project coordination",
      "vendor management",
      "communication",
      "teamwork",
      "problem solving",
      "strategic thinking",
      "leadership",
      "adaptability",
      "user education",
      "cybersecurity",
      "data analysis",
      "server management",
      "sales analytics software",
      "Python",
      "compliance auditing"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "analytics",
      "auditing",
      "budget",
      "communication",
      "compliance",
      "coordination",
      "cybersecurity",
      "data",
      "education",
      "information",
      "informationtechnology",
      "infrastructure",
      "it",
      "leadership",
      "management",
      "manager",
      "network",
      "problem",
      "project",
      "python",
      "sales",
      "server",
      "software",
      "solving",
      "strategic",
      "teamwork",
      "technology",
      "thinking",
      "user",
      "vendor"
    ]
  },
  {
    "job_id": "3900079841",
    "job_title": "Information Technology Analyst ",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "ORGANIZATION- HYATT REGENCY TAMAYA RESORT AND SPA\n\nSUMMARY\n\nTHE IT ANALYST FOCUSES ON THE DAY-TO-DAY AVAILABILITY AND FUNCTIONALITY OF IT SYSTEMS IN THE HOTEL AND RESOLVES STANDARD USER ISSUES BY TROUBLESHOOTING END USERS' PROBLEMS USING SERVICENOW TICKETING SYSTEM AND HOTEL'S IT KNOWLEDGEBASE.\n\nTHE IT ANALYST IS RESPONSIBLE FOR OVERSEEING ALL COMPUTING TECHNOLOGY ASSOCIATED WITH PROPERTY APPLICATIONS, POINT OF SALES, DESKTOP HARDWARE, NETWORKING AND COMPUTING SERVICES AT THE RESORT. THEY WILL PROVIDE MAINTENANCE AND SUPPORT FOR DESKTOP AND LAPTOP COMPUTERS, MOBILE DEVICES, AND PROVIDE END-USER SUPPORT FOR HARDWARE AND SOFTWARE PROBLEMS. INSTALLS, MAINTAINS, REPAIRS, ADMINISTERS AND TROUBLESHOOTS EQUIPMENT AND SOFTWARE NECESSARY FOR SMOOTH OPERATIONS. THIS ROLE IS FULL-TIME ON-PROPERTY ROLE.\n\n ESSENTIAL FUNCTIONS: \n\n IDENTIFIES, DIAGNOSES AND RESOLVES PROBLEMS WITH DESKTOP HARDWARE, APPLICATIONS AND NETWORKING. CONFIGURES AND DEPLOYS END-USER DESKTOP HARDWARE, SOFTWARE AND PERIPHERALS. INSTALLING AND MAINTAINING HOTEL IT HARDWARE AND SOFTWARE  ONGOING SUPPORT AND MAINTENANCE OF THE LOCAL AREA NETWORKS.  SETUP COMPUTER SOFTWARE AND HARDWARE FOR NEW/EXISTING STAFF, INCLUDING NEW USER ACCOUNTS. COORDINATES THE TIMELY REPAIR OF EQUIPMENT COVERED BY THIRD-PARTY SUPPORT VENDORS. PRODUCE WELL WRITTEN PLANS, PROCEDURES, AND DOCUMENTATION. ENSURE ACCEPTABLE PERFORMANCE IN COMPUTING AND NETWORK SYSTEMS. MAINTAIN COMPLETE AND ACCURATE SOFTWARE/HARDWARE INVENTORY WITH THE USE OF AUTOMATED TOOLS. MANAGE DAILY PCI-DSS COMPLIANCE FOCUSED TASKS SUCH AS ACCOUNT TERMINATIONS AND LOG ANALYSIS. MONITOR SERVER PERFORMANCE, DISK SPACE, ERROR LOGS, AND BACKUPS OF CRITICAL SYSTEMS. MAINTAINING VENDOR RELATIONSHIPS. \n\n WHY WORK AT HYATT? \n\n WE CARE FOR PEOPLE SO THEY CAN BE THEIR BEST.  ENJOY FREE MEALS IN OUR COLLEAGUE CAFETERIA FOR EVERY SHIFT WORKED. FREE PARKING ON-SITE DISCOUNTED & COMPLIMENTARY HOTEL ROOM NIGHTS. MEDICAL, DENTAL, VISION INSURANCE – (FULL-TIME COLLEAGUES) FLEXIBLE SPENDING ACCOUNT (FULL-TIME COLLEAGUES) RETIREMENT SAVINGS PLAN BASIC LIFE INSURANCE OPPORTUNITIES TO WORK AROUND THE WORLD WITH HYATT HOTELS AND RESORTS\n\nHYATT ASSOCIATES WORK IN AN ENVIRONMENT THAT DEMANDS EXCEPTIONAL PERFORMANCE YET REAPS GREAT REWARDS. WHETHER ITS CAREER OPPORTUNITIES, JOB ENRICHMENT OR A SUPPORTIVE WORK ENVIRONMENT, IF YOU ARE READY FOR THIS CHALLENGE, THEN WE ARE READY FOR YOU.\n\nOUR VALUES: RESPECT | INTEGRITY | HUMILITY | EMPATHY | CREATIVITY | FUN\n\nHYATT IS AN EQUAL OPPORTUNITY EMPLOYER - M/F/VETERAN/DISABILITY/SEXUAL ORIENTATION/GENDER IDENTITY\n\nQUALIFICATIONS\n\n 2+ YEARS WORK EXPERIENCE IN TECHNICAL CAPACITY PROVIDING END USER SUPPORT AND/OR SUPPORTING & MANAGING A NETWORKED COMPUTING ENVIRONMENT. GOOD ANALYTICAL AND PROBLEM SOLVING SKILLS, EFFECTIVE STRATEGIC PLANNING AND ORGANIZATION, ABILITY TO MULTI-TASK AND PRIORITIZE SELF MOTIVATED AND CAPABLE OF WORKING UNSUPERVISED EXCELLENT COMMUNICATION AND CUSTOMER SERVICE SKILLS. ABILITY TO INTERACT WITH OTHER COLLEAGUES IN A PROFESSIONAL AND FRIENDLY MANNER",
    "job_skill_set": [
      "Desktop Hardware",
      "Networking",
      "Troubleshooting",
      "Inventory Management",
      "Technical Support",
      "Problem Solving",
      "Organization",
      "Communication",
      "Customer Service",
      "Professionalism",
      "ServiceNow",
      "Software Installation",
      "PCI-DSS Compliance",
      "Server Monitoring",
      "Point of Sale Systems",
      "Analytical Skills",
      "Strategic Planning",
      "Multi-tasking",
      "Self-motivation"
    ],
    "short_keywords": [
      "analyst",
      "analytical",
      "communication",
      "compliance",
      "customer",
      "desktop",
      "hardware",
      "information",
      "informationtechnology",
      "installation",
      "inventory",
      "management",
      "monitoring",
      "multitasking",
      "networking",
      "of",
      "organization",
      "pcidss",
      "planning",
      "point",
      "problem",
      "professionalism",
      "sale",
      "selfmotivation",
      "server",
      "service",
      "servicenow",
      "skills",
      "software",
      "solving",
      "strategic",
      "support",
      "systems",
      "technical",
      "technology",
      "troubleshooting"
    ]
  },
  {
    "job_id": "3891016039",
    "job_title": "Information Technology Auditor",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "FOR MORE JOB OPPORTUNITIES FOLLOW FINTRUST CONNECT HERE: FINTRUST CONNECT: JOBS | LINKEDIN\nSHARE YOUR RESUME AND BUILD YOUR FUTURE! 🌟\nWE'RE THRILLED TO INVITE YOU TO JOIN OUR EXCLUSIVE TALENT COMMUNITY!\nARE YOU LOOKING FOR YOUR NEXT CAREER OPPORTUNITY?\nLOOK NO FURTHER – JOIN OUR TALENT NETWORK TODAY! BY SHARING YOUR RESUME WITH US, YOU'LL BE ADDED TO OUR DATABASE AND CONSIDERED FOR FUTURE ROLES WITH LEADING COMPANIES IN YOUR INDUSTRY. WHETHER YOU'RE SEEKING FLEXIBLE WORK ARRANGEMENTS, REMOTE OPPORTUNITIES, OR TRADITIONAL OFFICE-BASED ROLES, WE HAVE OPTIONS FOR YOU.\nTAKE THE FIRST STEP TOWARDS A BRIGHTER FUTURE – SHARE YOUR RESUME WITH US TODAY!\nAS AN IT AUDITOR YOU CAN CONTRIBUTE TO ENSURING THE INTEGRITY, SECURITY, AND COMPLIANCE OF OUR CLIENTS' INFORMATION TECHNOLOGY SYSTEMS AND PROCESSES. THIS ROLE OFFERS AN EXCITING OPPORTUNITY TO WORK IN A DYNAMIC ENVIRONMENT, CONDUCTING AUDITS AND ASSESSMENTS TO IDENTIFY AND MITIGATE IT RISKS WITHIN THE BANKING AND FINANCIAL SERVICES INDUSTRY.\nREQUIREMENTS:BACHELOR'S DEGREE IN INFORMATION TECHNOLOGY, COMPUTER SCIENCE, ACCOUNTING, FINANCE, OR A RELATED FIELD; RELEVANT CERTIFICATIONS (E.G., CISA, CISSP, CRISC) PREFERRED.PROVEN EXPERIENCE IN IT AUDITING ROLES WITHIN THE BANKING OR FINANCIAL SERVICES INDUSTRY, WITH A STRONG UNDERSTANDING OF IT GOVERNANCE, RISK MANAGEMENT, AND COMPLIANCE FRAMEWORKS (E.G., COBIT, ISO 27001, NIST).KNOWLEDGE OF BANKING REGULATIONS AND COMPLIANCE REQUIREMENTS, INCLUDING FFIEC, GLBA, SOX, AND GDPR, AS THEY RELATE TO IT SYSTEMS AND CONTROLS.HANDS-ON EXPERIENCE WITH IT AUDIT TOOLS AND TECHNIQUES, INCLUDING AUDIT MANAGEMENT SOFTWARE, DATA ANALYTICS TOOLS, AND SECURITY ASSESSMENT FRAMEWORKS.EXCELLENT ANALYTICAL AND PROBLEM-SOLVING SKILLS, WITH THE ABILITY TO ANALYZE COMPLEX IT SYSTEMS AND PROCESSES AND IDENTIFY POTENTIAL RISKS AND CONTROL GAPS.STRONG COMMUNICATION AND INTERPERSONAL SKILLS, WITH THE ABILITY TO EFFECTIVELY COMMUNICATE TECHNICAL CONCEPTS TO NON-TECHNICAL STAKEHOLDERS.ABILITY TO WORK INDEPENDENTLY AND MANAGE MULTIPLE PROJECTS SIMULTANEOUSLY IN A FAST-PACED, DEADLINE-DRIVEN ENVIRONMENT.\nKEY RESPONSIBILITIES:PLAN, EXECUTE, AND REPORT ON IT AUDITS AND ASSESSMENTS IN ACCORDANCE WITH INDUSTRY STANDARDS, REGULATORY REQUIREMENTS, AND INTERNAL POLICIES.EVALUATE THE EFFECTIVENESS OF IT CONTROLS, PROCESSES, AND PROCEDURES RELATED TO INFORMATION SECURITY, DATA PRIVACY, SYSTEM RELIABILITY, AND REGULATORY COMPLIANCE.CONDUCT RISK ASSESSMENTS AND IDENTIFY POTENTIAL VULNERABILITIES, WEAKNESSES, AND AREAS FOR IMPROVEMENT IN IT INFRASTRUCTURE, APPLICATIONS, AND OPERATIONS.COLLABORATE WITH CROSS-FUNCTIONAL TEAMS, INCLUDING IT PROFESSIONALS, BUSINESS STAKEHOLDERS, AND EXTERNAL AUDITORS, TO DEVELOP AUDIT PLANS AND REMEDIATION STRATEGIES.PERFORM TECHNICAL TESTING AND ANALYSIS OF IT SYSTEMS AND NETWORKS, INCLUDING VULNERABILITY SCANNING, PENETRATION TESTING, AND CONFIGURATION REVIEWS, TO IDENTIFY SECURITY WEAKNESSES AND POTENTIAL THREATS.REVIEW AND ASSESS THIRD-PARTY VENDOR SECURITY CONTROLS AND CONTRACTS TO ENSURE COMPLIANCE WITH REGULATORY REQUIREMENTS AND INDUSTRY STANDARDS.PREPARE AUDIT REPORTS DOCUMENTING FINDINGS, RECOMMENDATIONS, AND REMEDIATION PLANS, AND COMMUNICATE FINDINGS TO SENIOR MANAGEMENT AND RELEVANT STAKEHOLDERS.STAY CURRENT WITH EMERGING TECHNOLOGIES, INDUSTRY TRENDS, AND REGULATORY DEVELOPMENTS RELATED TO IT AUDITING AND INFORMATION SECURITY.",
    "job_skill_set": [
      "Data Analytics Tools",
      "Analytical Skills",
      "Problem Solving",
      "Communication Skills",
      "Interpersonal Skills",
      "Project Management",
      "Independence",
      "Collaboration",
      "Adaptability",
      "IT Auditing",
      "Risk Management",
      "Compliance Frameworks",
      "Audit Management Software",
      "Security Assessment Frameworks",
      "Vulnerability Scanning",
      "Penetration Testing",
      "Configuration Reviews",
      "Banking Regulations",
      "CISA Certification",
      "CISSP Certification",
      "CRISC Certification",
      "ISO 27001",
      "NIST",
      "COBIT",
      "GDPR",
      "SOX"
    ],
    "short_keywords": [
      "27001",
      "adaptability",
      "analytical",
      "analytics",
      "assessment",
      "audit",
      "auditing",
      "auditor",
      "banking",
      "certification",
      "cisa",
      "cissp",
      "cobit",
      "collaboration",
      "communication",
      "compliance",
      "configuration",
      "crisc",
      "data",
      "frameworks",
      "gdpr",
      "independence",
      "information",
      "informationtechnology",
      "interpersonal",
      "iso",
      "it",
      "management",
      "nist",
      "penetration",
      "problem",
      "project",
      "regulations",
      "reviews",
      "risk",
      "scanning",
      "security",
      "skills",
      "software",
      "solving",
      "sox",
      "technology",
      "testing",
      "tools",
      "vulnerability"
    ]
  },
  {
    "job_id": "3905245370",
    "job_title": "Information Technology Operations Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "THE IT OPERATIONS MANAGER WORKS DIRECTLY WITH OUR DIRECTOR OF CONFIGURATION SERVICES TO ENSURE THE TIMELY DELIVERY OF IT EQUIPMENT FOR BLUE MANTIS EMPLOYEES AND CLIENTS. THE ROLE WORKS COLLABORATIVELY ACROSS THE ORGANIZATION TO REVIEW NEEDS AND SPECIFICATIONS TO ENSURE TIMELY SHIPMENT OF IT EQUIPMENT. THIS INDIVIDUAL WORKS COLLABORATIVELY WITH LEADERS FROM ALL DEPARTMENTS TO IDENTIFY, RECOMMEND, DEVELOP, IMPLEMENT, AND SUPPORT INNOVATIVE, COST-EFFECTIVE TECHNOLOGY SOLUTIONS FOR ALL ASPECTS OF THE ORGANIZATION’S SALES, SERVICES, MARKETING AND BACK OFFICE OPERATIONS. \n\nKEY RESPONSIBILITIESOVERSEE A TEAM OF RESOURCES TO ENSURE ALL LAPTOPS, PERIPHERALS, & IT ASSETS ARE SHIPPED IN A TIMELY MANNER. OVERSEE LAPTOP, DESKTOP, AND SERVER ASSEMBLY AND CONFIGURATIONS.OVERSEE INNOVATIVE & EFFECTIVE USE OF THE COMPANY’S TECHNOLOGY INVESTMENTS & INDUSTRY PARTNERSHIPS.SUPERVISE ACTIVITIES OF CONFIGURATION TECHNICIANS, AND OTHER CONTRACTORS PERFORMING INFORMATION TECHNOLOGY WORKOVERSEE SWITCH AND DISK ARRAY INITIAL CONFIGURATIONS. INVESTIGATE, ANALYZE AND TROUBLE SHOOT EMERGENCIES AND ESTABLISH PROACTIVE PLANS TO RESOLVE AND PREVENT DISRUPTION THAT WOULD PREVENT THE TEAM FROM PERFORMING ITS DAY-TO-DAY DUTIES.PROMOTE A PRODUCTIVE/ANALYTICAL APPROACH WITHIN TO IDENTIFY ISSUES WITHIN THE TEAM THAT IDENTIFIES POTENTIAL ISSUES BEFORE THEY BECOME CRITICAL BUSINESS IMPACTING EVENTS. OVERSEE THE INSTALLATION OF OPERATING SYSTEMS, WARRANTY REPAIR, FIRMWARE AND IOS UPGRADES AND INSTALLATION OF MANAGED SERVICES TOOLS FOR CONTRACTED AND NON-CONTRACTED CUSTOMERS. ASSIST DEVICE PREPARATION, SPECIFICALLY IMAGING AND CUSTOM CONFIGURATION OF LAPTOPS AND DESKTOPS FOR ONSITE INSTALLATION USING VARIOUS IMAGING TOOLS. OVERSEE WAREHOUSE MANAGEMENT TASKS INCLUDING SHIPPING, RECEIVING, INVENTORY MANAGEMENT AND DELIVERY OF FINISHED DEVICES. ABILITY TO WORK ONSITE IN A WAREHOUSE ENVIRONMENT 5 DAYS A WEEK. ABILITY TO TRAVEL TO NH/MA/FL/RI BLUE MANTIS OFFICES & CLIENT SITES AS NEEDED. ACT AS CONTACT ESCALATION POINT FOR BLUE MANTIS CONFIGURATION TECHS. HANDLES MAINTENANCE, AVAILABILITY, AND PERFORMANCE OF KEY TECHNOLOGIES/SYSTEMS. MANAGE ALL ASPECTS OF A WAREHOUSE, SHIPPING, RECEIVING, INVENTORY MANAGEMENT, CYCLE COUNTS.\nSKILLS, KNOWLEDGE & EXPERTISE10 + YEARS DEMONSTRATED SUCCESS LEADING IT TECHNICAL SUPPORT TEAMS OR IT HELP DESK ENGINEERS5 + YEARS OF PROGRESSIVE RESPONSIBILITY IN INFORMATION TECHNOLOGY POSITIONS. 5+ YEARS WAREHOUSE MANAGEMENT EXPERIENCE & IT DOCUMENTATION. EXPERIENCE WITH HAM (HARDWARE ASSET MANAGEMENT PROCESS) EXPERIENCE WITH OVERSEEING IT STAFF THAT CONFIGURE 30-40 LAPTOPS/PC’S PER DAY.EXPERIENCE WITH POWERSHELL, MICROSOFT AZURE, & INTUNEBACHELOR’S DEGREE IN COMPUTER SCIENCE, OR EQUIVALENT WORK-RELATED EXPERIENCEABILITY TO MULTITASK FOCUS ON URGENCY/EXECUTION. ABILITY AND DESIRE TO LEARN NEW COMPETENCIES. WORK WITH INTERNAL AND EXTERNAL RESOURCES TO MAINTAIN CUSTOMER AGREED SERVICE LEVEL AGREEMENTS EXCELLENT VERBAL, WRITTEN PRESENTATION, AND COMMUNICATION SKILLS. ABILITY TO SERVE, LEAD, PARTNER AND COLLABORATE WITH OTHERS BOTH INTERNALLY AND EXTERNALLY ON COMPLEX, TIME SENSITIVE INITIATIVES AND PROJECTS. EXPERIENCE WITH HARDWARE, OPERATING SYSTEMS, AND NETWORKING KNOWLEDGE LAN/WAN ABILITY TO TROUBLESHOOT AND COMMUNICATE ISSUES TO EMPLOYEES & CUSTOMERS.EXPERIENCE WITH ONE OF THE FOLLOWING PC IMAGING SOFTWARE:MDT SERVER, SCCM, SMARTDEPLOY OR ACRONIS OR EXPERIENCE WITH PXE BOOTINGEXPERIENCE WITH MICROSOFT ACTIVE DIRECTORY, SCCM, DNS, MICROSOFT ENTRA.A+, NETWORK+ CERTIFICATION OR HIGHER PREFERRED NETWORK CABLING AND TERMINATION KNOWLEDGE. WINDOWS 10 AND WINDOWS 11 FLUENCYCOMFORTABLE WITH ITSM SYSTEMS USAGE, INVENTORY CONTROL SYSTEMS, AND LOGISTICS SOFTWARE. ABILITY AND WILLINGNESS TO BECOME HANDS ON TO ASSIST ON THE BENCHES WHEN WORK SCALES.",
    "job_skill_set": [
      "IT Operations Management",
      "Technical Support",
      "PC Imaging Software (MDT, SCCM, SmartDeploy, Acronis)",
      "Microsoft Active Directory",
      "DNS",
      "Windows 10 and Windows 11",
      "Collaboration",
      "Communication",
      "Problem Solving",
      "Leadership",
      "Multitasking",
      "Analytical Thinking",
      "Customer Service Orientation",
      "Adaptability",
      "Time Management",
      "Warehouse Management",
      "Hardware Asset Management (HAM)",
      "Powershell",
      "Microsoft Azure",
      "Intune",
      "Network Cabling and Termination",
      "ITSM Systems",
      "Inventory Control Systems",
      "Logistics Software"
    ],
    "short_keywords": [
      "10",
      "11",
      "acronis",
      "active",
      "adaptability",
      "analytical",
      "and",
      "asset",
      "azure",
      "cabling",
      "collaboration",
      "communication",
      "control",
      "customer",
      "directory",
      "dns",
      "ham",
      "hardware",
      "imaging",
      "information",
      "informationtechnology",
      "intune",
      "inventory",
      "it",
      "itsm",
      "leadership",
      "logistics",
      "management",
      "manager",
      "mdt",
      "microsoft",
      "multitasking",
      "network",
      "operations",
      "orientation",
      "pc",
      "powershell",
      "problem",
      "sccm",
      "service",
      "smartdeploy",
      "software",
      "solving",
      "support",
      "systems",
      "technical",
      "technology",
      "termination",
      "thinking",
      "time",
      "warehouse",
      "windows"
    ]
  },
  {
    "job_id": "3904357962",
    "job_title": "Staff Information Technology Program Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "ROLE OVERVIEW\n\nCONVERA IS SEEKING AN EXPERIENCED AND DYNAMIC STAFF TECHNICAL PROGRAM MANAGER TO LEAD CRITICAL INFORMATION TECHNOLOGY PROGRAMS. AS A KEY MEMBER OF THE TECHNOLOGY & ENTERPRISE TEAM, YOU WILL BE INSTRUMENTAL IN DRIVING THE SUCCESS OF OUR CROSS FUNCTIONAL INFRASTRUCTURE, END USER COMPUTING AND TECHNOLOGY OPERATIONS PROGRAMS. IF YOU ARE A SEASONED TECHNICAL PROGRAM MANAGER WITH A PROVEN TRACK RECORD, WE INVITE YOU TO BE PART OF OUR AMBITIOUS JOURNEY.\n\nKEY RESPONSIBILITIES\n\nPROGRAM LEADERSHIP:LEAD AND OVERSEE THE PLANNING, EXECUTION, AND DELIVERY OF COMPLEX GLOBAL TECHNICAL PROGRAMS.PROVIDE STRATEGIC DIRECTION AND TECHNICAL GUIDANCE TO ENSURE ALIGNMENT WITH CONVERA'S OVERALL BUSINESS OBJECTIVES.LEAD SEVERAL PROGRAMS OF VARYING SIZES IN PARALLEL.CROSS-FUNCTIONAL COLLABORATION:COLLABORATE CLOSELY WITH CROSS-FUNCTIONAL TEAMS ACROSS THE ENTERPRISE, YOU SHOULD BE COMFORTABLE BEING THE FACE OF PROGRAMS THAT TOUCH MANY PARTS OF THE BUSINESS.FOSTER A CULTURE OF COLLABORATION AND INNOVATION.RISK MANAGEMENT AND RESOLUTION:PROACTIVELY IDENTIFY AND MITIGATE RISKS ASSOCIATED WITH TECHNICAL PROGRAMS, ENSURING TIMELY RESOLUTION OF CHALLENGES.IMPLEMENT EFFECTIVE RISK MANAGEMENT STRATEGIES TO MAINTAIN PROGRAM QUALITY AND INTEGRITY.STAKEHOLDER COMMUNICATION:DEVELOP AND MAINTAIN STRONG COMMUNICATION CHANNELS WITH INTERNAL AND EXTERNAL STAKEHOLDERS.PROVIDE REGULAR UPDATES ON PROGRAM PROGRESS, MILESTONES, AND POTENTIAL ROADBLOCKS TO EXECUTIVE LEADERSHIP.RESOURCE OPTIMIZATION:EFFICIENTLY IDENTIFY RESOURCE NEEDS ACROSS GLOBAL TEAMS TO OPTIMIZE PROGRAM DELIVERY.WORK COLLABORATIVELY WITH DEPARTMENT LEADS TO ENSURE THE AVAILABILITY OF NECESSARY RESOURCES.\nQUALIFICATIONS\n\nBACHELOR'S DEGREE IN A RELEVANT TECHNICAL FIELD; ADVANCED DEGREE IS A PLUS.MINIMUM OF 7 YEARS OF EXPERIENCE IN TECHNICAL PROGRAM MANAGEMENT, WITH A FOCUS ON CLOUD INFRASTRUCTURE AND ENTERPRISE SYSTEMS A PLUS.PROVEN SUCCESS IN LEADING AND DELIVERING LARGE-SCALE, COMPLEX TECHNICAL PROGRAMS ON A GLOBAL SCALE.STRONG BACKGROUND IN ONE OR MORE OF TECHNOLOGY INFRASTRUCTURE (AWS), TECHNOLOGY OPERATIONS, ENTERPRISE SYSTEMS AND END USER COMPUTING.STRONG LEADERSHIP AND INTERPERSONAL SKILLS, WITH THE ABILITY TO INFLUENCE AND LEAD CROSS-FUNCTIONAL TEAMS.SOLID UNDERSTANDING OF METHODOLOGIES AND TOOLING (JIRA).EXCEPTIONAL PROBLEM-SOLVING AND DECISION-MAKING ABILITIES.\n\nPREFERRED QUALIFICATIONS\n\nPROJECT MANAGEMENT PROFESSIONAL (PMP) CERTIFICATION OR EQUIVALENT.AWS CERTIFICATIONS",
    "job_skill_set": [
      "Technical Program Management",
      "Enterprise Systems",
      "Technology Operations",
      "End User Computing",
      "Leadership",
      "Interpersonal Skills",
      "Cross-Functional Collaboration",
      "Communication",
      "Problem-Solving",
      "Decision-Making",
      "Risk Management",
      "Resource Optimization",
      "Cloud Infrastructure (AWS)",
      "JIRA",
      "Project Management Professional (PMP) Certification",
      "AWS Certifications"
    ],
    "short_keywords": [
      "aws",
      "certification",
      "certifications",
      "cloud",
      "collaboration",
      "communication",
      "computing",
      "crossfunctional",
      "decisionmaking",
      "end",
      "enterprise",
      "information",
      "informationtechnology",
      "infrastructure",
      "interpersonal",
      "jira",
      "leadership",
      "management",
      "manager",
      "operations",
      "optimization",
      "pmp",
      "problemsolving",
      "professional",
      "program",
      "project",
      "resource",
      "risk",
      "skills",
      "staff",
      "systems",
      "technical",
      "technology",
      "user"
    ]
  },
  {
    "job_id": "3894206026",
    "job_title": "2024 Summer - Information Technology (IT) Internship - St. Petersburg, FL",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "RAYMOND JAMES OVERVIEW\n\nONE OF THE LARGEST INDEPENDENT FINANCIAL SERVICES FIRMS IN THE COUNTRY COULD BE THE PLACE YOU BUILD A CAREER BEYOND YOUR EXPECTATIONS. \n\nOUR FOCUS IS ON PROVIDING TRUSTED ADVICE AND TAILORED, SOPHISTICATED STRATEGIES FOR INDIVIDUALS AND INSTITUTIONS. RAYMOND JAMES FINANCIAL IS A DIVERSIFIED HOLDING COMPANY, HEADQUARTERED IN ST. PETERSBURG, FL. RAYMOND JAMES PROVIDES FINANCIAL SERVICES TO INDIVIDUALS, CORPORATIONS AND MUNICIPALITIES THROUGH ITS SUBSIDIARY COMPANIES ENGAGED PRIMARILY IN INVESTMENT AND FINANCIAL PLANNING, IN ADDITION TO CAPITAL MARKETS AND ASSET MANAGEMENT.\n\nAT RAYMOND JAMES, WE ARE PUTTING THE POWER OF PERSPECTIVES INTO ACTION AND BUILDING AN INCLUSIVE AND DIVERSE WORKFORCE THAT REFLECTS OUR COMMITMENT TO ASSOCIATES, AND CLIENTS OF THE FUTURE. OUR COMPANY VALUES ASSOCIATE DEVELOPMENT AND GROWTH, OFFERING OPPORTUNITIES THROUGH DEVELOPMENTAL PROGRAMS, MENTORSHIPS, AND CONTINUING EDUCATION OPTIONS.\n\nWE STRIVE TO ENSURE EVERYONE FEELS WELCOMED, VALUED, RESPECTED AND HEARD SO THAT YOU CAN FULLY CONTRIBUTE YOUR UNIQUE TALENTS FOR THE BENEFIT OF CLIENTS, YOUR CAREER, OUR FIRM AND OUR COMMUNITIES. RAYMOND JAMES IS AN EQUAL OPPORTUNITY EMPLOYER AND MAKES ALL EMPLOYMENT DECISIONS ON THE BASIS OF MERIT AND BUSINESS NEEDS.\n\nINTERNSHIP PROGRAM OVERVIEW\n\nRAYMOND JAMES IS THE PLACE WHERE GOOD PEOPLE GROW AND NOWHERE IS THAT BETTER DEMONSTRATED THAN IN OUR INTERNSHIP PROGRAM. DURING THE 9 - 10-WEEK IMMERSIVE EXPERIENCE, YOU WILL ENGAGE WITH AND IMPLEMENT THE FIRM’S CORE VALUES THROUGH OUR FIVE GUIDING BEHAVIORS. FEATURING A COMPREHENSIVE ORIENTATION, ONSITE AND REMOTE TRAINING SESSIONS IN PROFESSIONAL DEVELOPMENT, NETWORKING EVENTS, A SPEAKER SERIES, AND VOLUNTEER OPPORTUNITIES, YOU WILL BE EQUIPPED WITH KNOWLEDGE OF THE BUSINESS AND CULTURE TO HELP YOU BUILD RELATIONSHIPS AND DEVELOP SKILLSETS FOR THE INTERNSHIP AND YOUR FUTURE.\n\nTO BE ELIGIBLE FOR THE SUMMER 2024 INTERNSHIP PROGRAM, YOU MUST BE A JUNIOR STANDING CANDIDATE PURSUING A BACHELOR'S DEGREE WITH A GRADUATE DATE OF MAY 2025. MOST POSITIONS ARE BASED IN ST. PETERSBURG WITH OTHER AVAILABLE LOCATIONS DEPENDING ON COMPANY NEED.\n\nCANDIDATES WHO SUCCESSFULLY COMPLETE THE INTERNSHIP PROGRAM HAVE THE OPPORTUNITY TO TRANSITION INTO A FULL-TIME ROLE AT RAYMOND JAMES AFTER GRADUATION.\n\nJOB SUMMARY:\n\nTHE RAYMOND JAMES INFORMATION TECHNOLOGY SUMMER INTERNSHIP PROGRAM IS A NINE TO TEN WEEK COMPREHENSIVE LEARNING AND PROFESSIONAL OPPORTUNITY FOR HIGHLY MOTIVATED INDIVIDUALS WHO HAVE A PASSION FOR BOTH TECHNOLOGY AND BUSINESS.\n\nINTERNS GAIN FIRST-HAND EXPERIENCE, RECEIVE VALUABLE ON-THE-JOB-TRAINING, AND LEARN ABOUT THE MANY TECHNOLOGY PROFESSIONS AVAILABLE IN THE FINANCIAL SERVICES INDUSTRY. INTERNSHIPS ARE AVAILABLE ACROSS THE TECHNOLOGY ORGANIZATION IN AREAS SUCH AS: ARCHITECTURE/DATA/PLATFORM,RISK/LEGAL/COMPLIANCE & SUPERVISION, INFRASTRUCTURE & INFORMATION SECURITY, IT FINANCE & BUSINESS MANAGEMENT, BUSINESS ARCHITECTURE & ENTERPRISE DATA MANAGEMENT, CORPORATE & INSTITUTIONAL DEVELOPMENT, PRIVATE CLIENT GROUP & ASSET MANAGEMENT SERVICES, PRIVATE CLIENT GROUP TECHNOLOGY EDUCATION, AND SERVICE DELIVERY AND SUPPORT.\n\nUNDER GENERAL SUPERVISION, INTERNS:\n\nUTILIZE SKILLS GAINED THROUGH TRAINING AND EXPERIENCE TO ASSIST WITH SPECIFIC PROJECTS WITHIN AN ASSIGNED FUNCTIONAL AREA FOR A SPECIFIED PERIOD OF TIME. USE JUDGMENT TO ADAPT PROCEDURES, PROCESSES AND TECHNIQUES TO APPLY TO MORE COMPLEX ASSIGNMENTS. RESOLVE ROUTINE QUESTIONS AND PROBLEMS AND REFER MORE COMPLEX ISSUES TO A HIGHER LEVEL. GAIN PERSONAL AND PROFESSIONAL ENRICHMENT THROUGH COMMUNITY SERVICE INVOLVEMENT. PARTICIPATE IN TEAM PROJECT CHALLENGES THAT PRODUCE TANGIBLE OUTCOMES FOR THE BUSINESS. \n\nINTERNSHIP LENGTH: 9-10 WEEKS\n\nSTART DATE: MAY 2024\n\nEND DATE: JULY 2024\n\nWORK SCHEDULE: MONDAY THROUGH FRIDAY, UP TO 40 HOURS PER WEEK\n\nESSENTIAL DUTIES AND RESPONSIBILITIES:\n\nSPECIFIED PROJECTS AND VARIED ASSIGNMENTS. OPERATES STANDARD OFFICE EQUIPMENT AND USES REQUIRED SOFTWARE APPLICATIONS. PERFORMS OTHER DUTIES AND RESPONSIBILITIES AS ASSIGNED \n\nQUALIFICATIONS:\n\nKNOWLEDGE, SKILLS, AND ABILITIES\n\nKNOWLEDGE OF:  \n\nFUNDAMENTAL CONCEPTS, PRACTICES AND PROCEDURES OF A PROFESSIONAL OFFICE ENVIRONMENT.  \n\nBASIC CONCEPTS, PRINCIPLES AND PRACTICES OF AN ASSIGNED BUSINESS UNIT. \nSKILL IN:  \n\nOPERATING STANDARD OFFICE EQUIPMENT AND USING, OR HAVING THE ABILITY TO LEARN, REQUIRED SOFTWARE APPLICATIONS. \nABILITY TO:  \n\nORGANIZE AND PRIORITIZE MULTIPLE TASKS AND MEET DEADLINES.  \n\nCOMMUNICATE EFFECTIVELY, BOTH VERBALLY AND IN WRITING. WORK INDEPENDENTLY AS WELL AS COLLABORATIVELY WITHIN A TEAM ENVIRONMENT. PROVIDE A HIGH LEVEL OF CUSTOMER SERVICE. ESTABLISH AND MAINTAIN EFFECTIVE WORKING RELATIONSHIPS. \nEDUCATIONAL/PREVIOUS EXPERIENCE REQUIREMENTS: \n\nAPPLICANTS ARE REQUIRED TO BE ENROLLED IN A COLLEGE DEGREE SEEKING PROGRAM. CANDIDATES ENROLLED IN DEGREES RELATED TO INFORMATION TECHNOLOGY OR BUSINESS PREFERRED OR EQUIVALENT COMBINATION OF EXPERIENCE, EDUCATION, AND/OR TRAINING APPROVED BY HUMAN RESOURCES.\n\nLICENSES/CERTIFICATIONS:\n\nNONE REQUIRED.\n\nLOCATION:\n\nHYBRID POSITION – ST. PETERSBURG OFFICE\n\n LI\" DATA-CCP-PARASTYLE-DEFN='{\"OBJECTID\":\"46140C57-6197-4EC8-99EA-4CA0F1C8A0DE|114\",\"CLASSID\":1073872969,\"PROPERTIES\":[469775450,\"UL > LI\",201340122,\"2\",134233614,\"TRUE\",469778129,\"ULLI\",335572020,\"1\",268442635,\"24\",469778324,\"NORMAL\"]}' STYLE=\"MARGIN: 0PX; PADDING: 0PX; USER-SELECT: TEXT; -WEBKIT-USER-DRAG: NONE; -WEBKIT-TAP-HIGHLIGHT-COLOR: TRANSPARENT;\">NO TRAVEL LI\" STYLE=\"MARGIN: 0PX; PADDING: 0PX; USER-SELECT: TEXT; -WEBKIT-USER-DRAG: NONE; -WEBKIT-TAP-HIGHLIGHT-COLOR: TRANSPARENT;\">REQUIRED LI\" STYLE=\"MARGIN: 0PX; PADDING: 0PX; USER-SELECT: TEXT; -WEBKIT-USER-DRAG: NONE; -WEBKIT-TAP-HIGHLIGHT-COLOR: TRANSPARENT;\">. \n\n#WAYUP\n\nAT RAYMOND JAMES OUR ASSOCIATES USE FIVE GUIDING BEHAVIORS (DEVELOP, COLLABORATE, DECIDE, DELIVER, IMPROVE) TO DELIVER ON THE FIRM'S CORE VALUES OF CLIENT-FIRST, INTEGRITY, INDEPENDENCE AND A CONSERVATIVE, LONG-TERM VIEW.\n\nWE EXPECT OUR ASSOCIATES AT ALL LEVELS TO:\n\n GROW PROFESSIONALLY AND INSPIRE OTHERS TO DO THE SAME WORK WITH AND THROUGH OTHERS TO ACHIEVE DESIRED OUTCOMES MAKE PROMPT, PRAGMATIC CHOICES AND ACT WITH THE CLIENT IN MIND TAKE OWNERSHIP AND HOLD THEMSELVES AND OTHERS ACCOUNTABLE FOR DELIVERING RESULTS THAT MATTER CONTRIBUTE TO THE CONTINUOUS EVOLUTION OF THE FIRM\n\nAT RAYMOND JAMES – AS PART OF OUR PEOPLE-FIRST CULTURE, WE HONOR, VALUE, AND RESPECT THE UNIQUENESS, EXPERIENCES, AND BACKGROUNDS OF ALL OF OUR ASSOCIATES. WHEN ASSOCIATES BRING THEIR BEST AUTHENTIC SELVES, OUR ORGANIZATION, CLIENTS, AND COMMUNITIES THRIVE. THE COMPANY IS AN EQUAL OPPORTUNITY EMPLOYER AND MAKES ALL EMPLOYMENT DECISIONS ON THE BASIS OF MERIT AND BUSINESS NEEDS.\n\nJOB :\n\nTECHNOLOGY\n\nPRIMARY LOCATION :\n\nUS-FL-ST. PETERSBURG-SAINT PETERSBURG\n\nORGANIZATION :\n\nTECHNOLOGY\n\nSCHEDULE :\n\nFULL-TIME\n\nSHIFT :\n\nDAY JOB\n\nTRAVEL :\n\n",
    "job_skill_set": [
      "software applications",
      "data management",
      "information security",
      "business analysis",
      "project management",
      "communication",
      "teamwork",
      "customer service",
      "organization",
      "problem solving",
      "adaptability",
      "office equipment operation"
    ],
    "short_keywords": [
      "2024",
      "adaptability",
      "analysis",
      "applications",
      "business",
      "communication",
      "customer",
      "data",
      "equipment",
      "fl",
      "information",
      "informationtechnology",
      "internship",
      "it",
      "management",
      "office",
      "operation",
      "organization",
      "petersburg",
      "problem",
      "project",
      "security",
      "service",
      "software",
      "solving",
      "st",
      "summer",
      "teamwork",
      "technology"
    ]
  },
  {
    "job_id": "3903806821",
    "job_title": "Information Technology Network Administrator",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "TEMP TO PERM OPPORTUNITY RESPONSIBILITIES:◼ ADMINISTRATE AND MAINTAIN THE NETWORK INFRASTRUCTURE TO ENSURE HIGH SECURITY ANDPERFORMANCE◼ ENSURE THAT NETWORK DEVICE CONFIGURATION AND PATCHING ARE WELL MANAGED WHILEMEETING THE BANK’ IT & IS STANDARDS.◼ SUPERVISE AND CONTROL THE OVERALL OPERATIONS AND IMPLEMENTATION OF SYSTEMSINVOLVING NETWORK, INTERNET, EMAIL GATEWAY, IDS/IPS, SIEM SYSTEM, VULNERABILITYSCAN SYSTEMS ETC.◼ COLLABORATE WITH IS TEAM IN VULNERABILITY SCAN & PENETRATION TESTS, ENSURE THAT THEVULNERABILITIES ARE WELL TRACKED AND REMEDIATED ON TIME WHILE MEETING THE BANK’IT & IS STANDARDS◼ LIAISE WITH DATA CENTER SERVICE PROVIDERS (E.G. HEAD OFFICE) IN RELATION TO NETWORK,EQUIPMENT, INFORMATION SECURITY AND SERVICE PROVISIONS.◼ CONTACT CARRIERS FOR CIRCUITS, AND OTHER VENDORS FOR EQUIPMENT AND SERVICEINSTALLATION, MAINTENANCE OR TROUBLESHOOTING.◼ FORMULATE DISASTER RECOVERY PLANS/INCIDENT RESPONSES, AND ARRANGE FOR RELEVANTTESTS TO ENSURE THAT THE PLAN IS IN COMPLIANCE WITH THE REGULATORY REQUIREMENTS ANDHEAD OFFICE'S REQUIREMENTS.◼ PROVIDE HELPDESK SUPPORT FOR NETWORK/SECURITY RELATED REQUESTS OR ISSUES.◼ SUPPORT INFORMATION SECURITY MANAGEMENT, DATA CENTER/IT ROOM MANAGEMENT ANDEQUIPMENT MANAGEMENT.◼ ANY OTHER WORK ASSIGNED BY IT DEPARTMENT MANAGEMENT.",
    "job_skill_set": [
      "network infrastructure management",
      "vulnerability scanning",
      "information security management",
      "collaboration",
      "communication",
      "problem solving",
      "supervision",
      "time management",
      "customer service",
      "network device configuration",
      "patch management",
      "IDS/IPS systems",
      "SIEM systems",
      "penetration testing",
      "disaster recovery planning",
      "incident response",
      "helpdesk support",
      "data center management",
      "equipment management"
    ],
    "short_keywords": [
      "administrator",
      "center",
      "collaboration",
      "communication",
      "configuration",
      "customer",
      "data",
      "device",
      "disaster",
      "equipment",
      "helpdesk",
      "idsips",
      "incident",
      "information",
      "informationtechnology",
      "infrastructure",
      "management",
      "network",
      "patch",
      "penetration",
      "planning",
      "problem",
      "recovery",
      "response",
      "scanning",
      "security",
      "service",
      "siem",
      "solving",
      "supervision",
      "support",
      "systems",
      "technology",
      "testing",
      "time",
      "vulnerability"
    ]
  },
  {
    "job_id": "3904992462",
    "job_title": "Information Technology Application Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "TITLE: IT APPLICATIONS PROJECT MANAGERLOCATION: HUNTINGDON, NYSALARY: $110K – 150K \nCONSUMER GOODS COMPANY IS SEEKING AN IT APPLICATIONS PROJECT MANAGER TO JOIN THEIR TEAM!\n RESPONSIBILITIESOVERSEE THE DAY-TO-DAY OPERATIONS OF THE RESPECTIVE APPLICATIONS TEAM.ADHERE TO ALL HEALTH AND SAFETY RULES AND PROCEDURES.IDENTIFY, ESCALATE AND MANAGE PROJECT RISKS AND ISSUES TO RESOLUTION.MONITOR PERFORMANCE OF DIRECT REPORTS AND PROVIDE COACHING AND COUNSELING AS NEEDED.MAINTAIN INVENTORIES OF SHEETS, INKS, AND OTHER CONVERTING SUPPLIES.ENSURE TIMELY AND CONSISTENT COMMUNICATION DURING ANY MAJOR DOWNTIME.ENSURE THAT NEW SYSTEMS AND CHANGES ARE PROPERLY TESTED.ABILITY TO MOTIVATE, EFFECTIVELY DELEGATE, AND COACH TEAM TO CREATE A POSITIVE AND DYNAMIC WORKING ATMOSPHERE.ESTABLISH DATA DISTRIBUTION POLICIES BY WORKING WITH BOUNDARY PARTNERS AND CONTRACT RESOURCES.CONDUCT WORKFLOW ANALYSIS, BUSINESS PROCESS REVIEWS, AND CREATE FUNCTIONAL SPECIFICATIONS.ENSURE APPLICATION RESOURCES ARE ASSIGNED APPROPRIATELY TO DAY-TO-DAY SUPPORT AND PROJECTS.MANAGE OUTSIDE VENDORS AND CONTRACTORS TO ENSURE PERFORMANCE EXPECTATIONS AND CUSTOMER SATISFACTION.PROVIDE SUPPORT, GUIDANCE, LEADERSHIP, AND MOTIVATION TO PROMOTE MAXIMUM PERFORMANCE.COORDINATE ANALYSIS AND RESOLVE ISSUES ON ALL SYSTEM UPGRADES AND CHANGES.   QUALIFICATIONSBACHELOR'S OR GRADUATE'S DEGREE IN BUSINESS, COMPUTER SCIENCE, ENGINEERING OR COMPUTER SCIENCE, OR EQUIVALENT EXPERIENCE.EXPERIENCE WITH CSS, HTML, SQL, EDI, C, AND SQL SERVER SOFTWARE AND SYSTEMS.SOUND UNDERSTANDING OF SOFTWARE DEVELOPMENT LIFE CYCLES, SCRIPTING, SYSTEMS PROGRAMMING, AGILE, AND JAVASCRIPT.EXPERIENCE WITH ERP",
    "job_skill_set": [
      "SQL",
      "SQL Server",
      "Agile",
      "ERP",
      "Team Management",
      "Communication",
      "Problem Solving",
      "Coaching",
      "Delegation",
      "Motivation",
      "Workflow Analysis",
      "Leadership",
      "Customer Satisfaction",
      "CSS",
      "HTML",
      "EDI",
      "C",
      "Software Development Life Cycle (SDLC)",
      "Scripting",
      "Systems Programming",
      "JavaScript"
    ],
    "short_keywords": [
      "agile",
      "analysis",
      "application",
      "c",
      "coaching",
      "communication",
      "css",
      "customer",
      "cycle",
      "delegation",
      "development",
      "edi",
      "erp",
      "html",
      "information",
      "informationtechnology",
      "javascript",
      "leadership",
      "life",
      "management",
      "manager",
      "motivation",
      "problem",
      "programming",
      "satisfaction",
      "scripting",
      "sdlc",
      "server",
      "software",
      "solving",
      "sql",
      "systems",
      "team",
      "technology",
      "workflow"
    ]
  },
  {
    "job_id": "3895549181",
    "job_title": "Principal Architect - Information Technology (EUC)",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "DESCRIPTION\n\nTHERE’S NEVER BEEN A MORE EXCITING TIME TO JOIN UNITED AIRLINES. WE’RE ON A PATH TOWARDS BECOMING THE BEST AIRLINE IN THE HISTORY OF AVIATION. OUR SHARED PURPOSE – CONNECTING PEOPLE, UNITING THE WORLD – IS ABOUT MORE THAN GETTING PEOPLE FROM ONE PLACE TO ANOTHER. IT ALSO MEANS THAT AS A GLOBAL COMPANY THAT OPERATES IN HUNDREDS OF LOCATIONS AROUND THE WORLD WITH MILLIONS OF CUSTOMERS AND TENS OF THOUSANDS OF EMPLOYEES, WE HAVE A UNIQUE RESPONSIBILITY TO UPLIFT AND PROVIDE OPPORTUNITIES IN THE PLACES WHERE WE WORK, LIVE AND FLY, AND WE CAN ONLY DO THAT WITH A TRULY DIVERSE AND INCLUSIVE WORKFORCE. AND WE’RE GROWING – IN THE YEARS AHEAD, WE’LL HIRE TENS OF THOUSANDS OF PEOPLE ACROSS EVERY AREA OF THE AIRLINE. OUR CAREERS INCLUDE A COMPETITIVE BENEFITS PACKAGE AIMED AT KEEPING YOU HAPPY, HEALTHY AND WELL-TRAVELED. FROM EMPLOYEE-RUN \"BUSINESS RESOURCE GROUP\" COMMUNITIES TO WORLD-CLASS BENEFITS LIKE PARENTAL LEAVE, 401K AND PRIVILEGES LIKE SPACE AVAILABLE TRAVEL, UNITED IS TRULY A ONE-OF-A-KIND PLACE TO WORK. ARE YOU READY TO TRAVEL THE WORLD?\n\nWE BELIEVE THAT INCLUSION PROPELS INNOVATION AND IS THE FOUNDATION OF ALL THAT WE DO. UNITED'S DIGITAL TECHNOLOGY TEAM SPANS THE GLOBE AND IS MADE UP OF DIVERSE INDIVIDUALS ALL WORKING TOGETHER WITH CUTTING-EDGE TECHNOLOGY TO BUILD THE BEST AIRLINE IN THE HISTORY OF AVIATION. OUR TEAM DESIGNS, DEVELOPS AND MAINTAINS MASSIVELY SCALING TECHNOLOGY SOLUTIONS BROUGHT TO LIFE WITH INNOVATIVE ARCHITECTURES, DATA ANALYTICS, AND DIGITAL SOLUTIONS.\n\nKEY RESPONSIBILITIES\n\nWE ARE IN SEARCH OF A DILIGENT, RESULTS-DRIVEN EUC (END-USER COMPUTING) ARCHITECT WITH A PROVEN TRACK RECORD TO JOIN OUR SKILLED TEAM. IN THE ROLE OF AN EUC ARCHITECT, YOU WILL BE TASKED WITH DEVELOPING, OPTIMIZING, AND OVERSEEING OUR END-USER COMPUTING ARCHITECTURE. YOUR EXPERTISE SHOULD ENCOMPASS A THOROUGH UNDERSTANDING OF EUC DESIGN PRINCIPLES AND THE ABILITY TO ASSESS SYSTEM REQUIREMENTS AS WE ADVANCE OUR CLOUD-NATIVE SOLUTIONS, INCLUDING THE IMPLEMENTATION OF MIGRATION STRATEGIES. YOUR RESPONSIBILITIES WILL INCLUDE DEMONSTRATING A STRONG BACKGROUND IN EUC STRATEGY, ANALYSIS, AND MANAGEMENT, COUPLED WITH EXCEPTIONAL ANALYTICAL AND PROBLEM-SOLVING SKILLS.\n\nAS A PRINCIPAL EUC ARCHITECT, YOU WILL\n\nCRAFT AND REFINE THE OVERALL EUC DESIGN AND ARCHITECTURE, ENSURING SEAMLESS INTEGRATION AND ALIGNMENT WITH OUR CLOUD-NATIVE APPROACHMANAGE EUC ASPECTS ACROSS THE ORGANIZATION’S DATA SYSTEMS, INCLUDING DATA GOVERNANCE, DATA MASTERING, AND METADATA MANAGEMENTFOSTER RELATIONSHIPS AND WORK CLOSELY WITH CYBERSECURITY AND OTHER TEAMS ACROSS ENTERPRISE TO ENSURE ALIGNMENT WITH ALL MANDATES AND REQUIREMENTSLEAD THE DESIGN AND IMPLEMENTATION OF SCALABLE, COST-EFFECTIVE ENTERPRISE DATA SOLUTIONS THAT ARE FLEXIBLE AND FUTURE-PROOFPROACTIVELY ANTICIPATE TECHNOLOGICAL ADVANCEMENTS AND EFFECTIVELY COMMUNICATE POTENTIAL IMPACTS AND REQUIREMENTS TO LEADERSHIP AND CROSS-FUNCTIONAL TEAMSGAIN A DEEP UNDERSTANDING OF THE CURRENT ORGANIZATIONAL-WIDE ARCHITECTURE TO IDENTIFY AREAS FOR ENHANCEMENTDETERMINE KEY BUSINESS DRIVERS AND NECESSARY TECHNOLOGICAL CAPABILITIES TO ACHIEVE AN OPTIMAL EUC FRAMEWORKCOLLABORATE WITH PARTNER TEAMS TO ARTICULATE USE CASES, OBJECTIVES, AND ARCHITECTURAL DESIGNS THAT SUPPORT BUSINESS GOALSACTIVELY ENGAGE WITH AND PRESENT RECOMMENDATIONS TO SENIOR LEADERSHIP TEAMS, CHAMPIONING EUC INITIATIVES AND THEIR VALUE TO THE ORGANIZATION\n\nTHIS ROLE IS DESIGNED FOR AN INNOVATOR WHO IS PASSIONATE ABOUT LEVERAGING EUC TO DRIVE ORGANIZATIONAL SUCCESS AND EFFICIENCY.\n\nUNITED VALUES DIVERSE EXPERIENCES, PERSPECTIVES, AND WE ENCOURAGE EVERYONE WHO MEETS THE MINIMUM QUALIFICATIONS TO APPLY. WHILE HAVING THE “DESIRED” QUALIFICATIONS MAKE FOR A STRONGER CANDIDATE, WE ENCOURAGE APPLICANTS WHO MAY NOT FEEL THEY CHECK ALL OF THOSE BOXES! WE ARE ALWAYS LOOKING FOR INDIVIDUALS WHO WILL BRING SOMETHING NEW TO THE TABLE!\n\nQUALIFICATIONS\n\nWHAT’S NEEDED TO SUCCEED (MINIMUM QUALIFICATIONS):\n\nBACHELOR'S DEGREE IN ENGINEERING MANAGEMENT, COMPUTER ENGINEERING, COMPUTER SCIENCE OR RELATED FIELD7+ YEARS OF RELATED EXPERIENCE5+ YEARS OF EXPERIENCE IN A SYSTEM ARCHITECT ROLE INCLUDING ENTERPRISE EUC ARCHITECTURE MODELS, SYSTEMS INTEGRATION, DATA SYSTEMS, CLOUD TECHNOLOGY AND PLANNING/COMPLETING STRATEGIC ROADMAPSEXPERIENCE IN DESIGNING AND MANAGING COMPLEX EUC ENVIRONMENTS AND SUPPORT OF HIGHLY AVAILABLE AND RESILIENT MULTI-REGION PLATFORMSIN-DEPTH KNOWLEDGE OF ONE OR MORE OF THE INDUSTRY RECOGNIZED EUC MANAGEMENT PLATFORMS (WORKSPACE ONE, INTUNE, IVANTI, ETC.)SOLID UNDERSTANDING OF AI CONCEPTS, TRENDS, AND TOOLSMUST BE LEGALLY AUTHORIZED TO WORK IN THE UNITED STATES FOR ANY EMPLOYER WITHOUT SPONSORSHIP\n\nWHAT WILL HELP YOU PROPEL FROM THE PACK (PREFERRED QUALIFICATIONS):\n\nMASTER'S DEGREEAIRLINE EXPERIENCE\n\nEQUAL OPPORTUNITY EMPLOYER - MINORITIES/WOMEN/VETERANS/DISABLED/LGBT WHQ00023561",
    "job_skill_set": [
      "cloud technology",
      "analytical skills",
      "problem-solving",
      "communication",
      "collaboration",
      "leadership",
      "relationship building",
      "EUC architecture",
      "data governance",
      "data mastering",
      "metadata management",
      "systems integration",
      "AI concepts",
      "Workspace ONE",
      "Intune",
      "Ivanti",
      "strategic roadmap planning",
      "complex EUC environments design",
      "innovation"
    ],
    "short_keywords": [
      "ai",
      "analytical",
      "architect",
      "architecture",
      "building",
      "cloud",
      "collaboration",
      "communication",
      "complex",
      "concepts",
      "data",
      "design",
      "environments",
      "euc",
      "governance",
      "information",
      "informationtechnology",
      "innovation",
      "integration",
      "intune",
      "ivanti",
      "leadership",
      "management",
      "mastering",
      "metadata",
      "one",
      "planning",
      "principal",
      "problemsolving",
      "relationship",
      "roadmap",
      "skills",
      "strategic",
      "systems",
      "technology",
      "workspace"
    ]
  },
  {
    "job_id": "3901940057",
    "job_title": "Information Technology Network Administrator",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "OVERVIEW: WE ARE SEEKING A MOTIVATED AND RESULTS-DRIVEN INDIVIDUAL TO JOIN OUR NETWORK TEAM. THE PRIMARY FOCUS OF THIS ROLE IS TO PROVIDE SUPPORT FOR THE BUILDING, IMPLEMENTATION, AND MAINTENANCE OF SCIENCELOGIC TECHNOLOGY WITHIN OUR NETWORK INFRASTRUCTURE. THE IDEAL CANDIDATE WILL POSSESS STRONG TECHNICAL SKILLS IN NETWORK MANAGEMENT, CONFIGURATION, AND TROUBLESHOOTING, ALONG WITH THE ABILITY TO COLLABORATE EFFECTIVELY WITH CROSS-FUNCTIONAL TEAMS.\nRESPONSIBILITIES:SUPPORT THE BUILDING AND CONFIGURATION OF THE SCIENCELOGIC INFRASTRUCTURE.DEVELOP, TEST, AND DEPLOY ALERTING CAPABILITIES FOR NETWORK DEVICES IN PRODUCTION.MONITOR NETWORK EVENTS AND IDENTIFY ISSUES REQUIRING MITIGATION.TROUBLESHOOT AND RESOLVE ESCALATED NETWORK EVENTS.\nSKILLS AND QUALIFICATIONS:MINIMUM REQUIREMENTS:CONFIGURING, IMPLEMENTING, AND MANAGING SCIENCELOGIC AND/OR IT ENTERPRISE MONITORING SYSTEMS.COLLABORATING WITH CROSS-FUNCTIONAL TEAMS TO DELIVER NETWORK SOLUTIONS.CONFIGURING, IMPLEMENTING, AND MANAGING NETWORK DEVICES.MONITORING AND TROUBLESHOOTING COMPLEX NETWORK SWITCHES, ROUTERS, AND FIREWALLS.OPERATING, MANAGING, AND SUPPORTING ROUTING PROTOCOLS, SPECIFICALLY BGP, OSPF, EIGRP, AND VXLAN.OPERATING, MANAGING, AND SUPPORTING NEXT-GENERATION FIREWALLS.OPERATING, MANAGING, AND SUPPORTING WIRELESS NETWORKS.OPERATING, MANAGING, AND SUPPORTING DNS.OPERATING, MANAGING, AND SUPPORTING SOFTWARE-DEFINED NETWORKS.OPERATING, MANAGING, AND SUPPORTING NETWORK ACCESS CONTROLS.PREFERRED SKILLS:EXPERIENCE COMPLYING WITH REGULATORY CONTROLS.SCIENCELOGIC PROFESSIONAL CERTIFICATION.SCIENCELOGIC EXPERT CERTIFICATION.\n\n\n\n\n\n\n\n\n\n\nPRICESENZ IS AN EQUAL OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, AGE, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, OR DISABILITY.",
    "job_skill_set": [
      "troubleshooting",
      "collaboration",
      "communication",
      "problem solving",
      "results-driven",
      "network management",
      "network configuration",
      "ScienceLogic",
      "network devices",
      "routing protocols",
      "BGP",
      "OSPF",
      "EIGRP",
      "VXLAN",
      "next-generation firewalls",
      "wireless networks",
      "DNS",
      "software-defined networks",
      "network access controls",
      "regulatory compliance",
      "ScienceLogic Professional Certification",
      "ScienceLogic Expert Certification"
    ],
    "short_keywords": [
      "access",
      "administrator",
      "bgp",
      "certification",
      "collaboration",
      "communication",
      "compliance",
      "configuration",
      "controls",
      "devices",
      "dns",
      "eigrp",
      "expert",
      "firewalls",
      "information",
      "informationtechnology",
      "management",
      "network",
      "networks",
      "nextgeneration",
      "ospf",
      "problem",
      "professional",
      "protocols",
      "regulatory",
      "resultsdriven",
      "routing",
      "sciencelogic",
      "softwaredefined",
      "solving",
      "technology",
      "troubleshooting",
      "vxlan",
      "wireless"
    ]
  },
  {
    "job_id": "3901601435",
    "job_title": "Information Technology Officer",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "OVERVIEW\nMEMPHIS-SHELBY COUNTY SCHOOLS IS SEEKING DYNAMIC EDUCATIONAL CHAMPIONS READY TO POSITION OUR DISTRICT AS A NATIONAL EXEMPLAR OF EDUCATION TRANSFORMATION. WE NEED LEADERS WITH A FIERCE COMMITMENT TO ACTUALIZING A BOLD VISION THAT YIELDS AMBITIOUS OUTCOMES FOR MORE THAN 110,000 STUDENTS AND FAMILIES ACROSS THE MEMPHIS-SHELBY COUNTY AREA. THE REALITY IS THAT WE CAN DO BETTER FOR KIDS, AND WE WILL WITH THE RIGHT LEADERS IN PLACE. THE MOST SUCCESSFUL CANDIDATES BELIEVE THAT MORE IS POSSIBLE FOR MEMPHIS AND ARE:\nCOURAGEOUS THINKERS & DOERS: PREPARED TO NAVIGATE AND THRIVE IN A COMPLEX AND AMBIGUOUS ENVIRONMENT ON DAY ONE, PRESENT INNOVATIVE IDEAS TO ADDRESS SYSTEMWIDE ISSUES, AND EXECUTE SUSTAINABLE PLANS TOWARD TRANSFORMATION.\nSOLUTIONS-ORIENTED: SEE THE POSSIBILITIES, DEMONSTRATE THE CAPACITY TO SYNTHESIZE INFORMATION AND ADJUST SHORT AND LONG-TERM GOALS, AND CONSISTENTLY FIND A WINDOW WHEN DOORS CLOSE TO DELIVER MEASURABLE RESULTS FOR KIDS AND FAMILIES.\nHIGH-PERFORMING GAMECHANGERS: LEADER OF LEADERS WITH THE CAPACITY TO MOBILIZE AND EMPOWER AN OUTSTANDING TEAM, MAKE PEOPLE-CENTERED DATA-INFORMED DECISIONS, AND OPERATE WITH A RELENTLESS HYPER-FOCUS ON REMOVING STUBBORN BARRIERS THAT DESTROY THE HOPES AND DREAMS OF TOO MANY OF OUR STUDENTS.\nSUMMARY DESCRIPTION UNDER THE DIRECTION OF THE ASSISTANT SUPERINTENDENT OF BUSINESS OPERATIONS, THE INFORMATION TECHNOLOGY OFFICER PROVIDES LEADERSHIP AND SUPPORT FOR ALL DIGITAL AND TECHNOLOGY SYSTEMS IN STUDENT SERVICES, TEACHING AND LEARNING, BUSINESS OPERATIONS, VOICE AND DATA COMMUNICATIONS, AND LOCAL AND WIDE AREA NETWORKING WITHIN MEMPHIS-SHELBY COUNTY SCHOOLS.\nINFORMATION FOR CANDIDATESTHANK YOU FOR YOUR INTEREST IN SERVING AS TALENT MANAGEMENT OFFICER TO CONTRIBUTE TO ENHANCING THE LEGACY OF MEMPHIS-SHELBY COUNTY SCHOOLS. PLEASE REVIEW THE INFORMATION PROVIDED TO ENSURE FULL CONSIDERATION.\nDEADLINE FOR SUBMISSION - ALL MATERIALS ARE DUE ON OR BY 5PM FRIDAY, APRIL 26, 2024.INTERVIEWS - INTERVIEWS WILL BEGIN IMMEDIATELY AND OCCUR UNTIL THE POSITION IS FILLED.\nAPPLICATION REQUIREMENTSSUBMIT AN UPDATED RESUME, CURRENT WRITING SAMPLE, AND VIDEO RESPONSES TO LEGACYLEADER@SCSK12.ORG WITH THE TITLE OF THE POSITION IN THE SUBJECT.\nRECORD -IN A QUIET SETTING, CANDIDATES SHOULD RECORD A RESPONSE TO THE PROMPTS BELOW WITHIN THE SPECIFIED TIMEFRAME.\nPROMPT (60 SECONDS)- PLEASE SHARE YOUR EXPERIENCE IN A COMPARABLE POSITION WHERE YOU IDENTIFIED A PROBLEM AND IMPLEMENTED A SOLUTION THROUGH COMPLETION TO ENHANCE THE EFFICIENCY OF A LARGE ORGANIZATION.\nPROMPT (90 SECONDS)- WHAT EXPERIENCE DO YOU HAVE THAT DEMONSTRATES YOUR CAPACITY TO EFFECTIVELY MANAGE THE DISTRICT’S TECHNOLOGY AND RELATED PLATFORMS TO ENSURE SECURE TRANSACTIONS AND EFFECTIVE DIGITAL EXPERIENCES FOR STUDENTS AND STAFF? PLEASE BE SUCCINCT AND SPECIFIC.\nSAVE ALL FILES USING THE NAMING CONVENTION: [LAST NAME. FIRST NAME. TITLE OF POSITION SEEKING. RESUME (OR WRITINGSAMPLE)].\nSUBMISSIONS EXCEEDING THE TIME LISTED OR WITHOUT THE CORRECT NAMING CONVENTION WILL NOT BE REVIEWED.",
    "job_skill_set": [
      "digital systems management",
      "data analysis",
      "networking",
      "project management",
      "communication systems",
      "problem solving",
      "team leadership",
      "innovation",
      "adaptability",
      "collaboration",
      "strategic thinking",
      "decision making",
      "technology leadership",
      "cybersecurity"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "collaboration",
      "communication",
      "cybersecurity",
      "data",
      "decision",
      "digital",
      "information",
      "informationtechnology",
      "innovation",
      "leadership",
      "making",
      "management",
      "networking",
      "officer",
      "problem",
      "project",
      "solving",
      "strategic",
      "systems",
      "team",
      "technology",
      "thinking"
    ]
  },
  {
    "job_id": "3889772048",
    "job_title": "Information Technology Application Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "THE COMMERCIAL APPLICATIONS MANAGER IS A STRATEGIC LEADER RESPONSIBLE FOR STEERING THE DEVELOPMENT AND UPKEEP OF CUTTING-EDGE CONSUMER-FACING DIGITAL SOLUTIONS. THIS POSITION INVOLVES ORCHESTRATING A VISIONARY JOURNEY, LEADING A DYNAMIC TEAM THROUGH THE STRATEGIC PLANNING AND EXECUTION OF DIGITAL INITIATIVES THAT ALIGN WITH THE ORGANIZATIONAL OBJECTIVES. IN ADDITION TO FOSTERING INNOVATION, THE ROLE ENCOMPASSES TALENT MANAGEMENT, LEVERAGING FINANCIAL ACUMEN, AND CRAFTING A ROADMAP FOR DIGITAL EXCELLENCE THAT ANTICIPATES FUTURE INDUSTRY TRENDS. THIS PERSON IS KEY IN SHAPING OUR DIGITAL NARRATIVE AND ENSURING ITS CONTINUED SUCCESS IN THE EVOLVING DIGITAL LANDSCAPE.\nRESPONSIBILITIESLEAD AND MANAGE A TEAM OF WEB DEVELOPERS IN THE DESIGN, CONSTRUCTION, TESTING AND IMPLEMENTATION OF MULTIPLE, CONCURRENT, LARGE-SYSTEM INITIATIVES.COLLABORATE WITH CROSS-FUNCTIONAL TEAMS TO ENSURE COST-EFFECTIVE, EFFICIENT AND STATE-OF-THE-ART APPLICATION SYSTEMS ARE IN PLACE AND MAINTAINED.COLLABORATE WITH PROJECT MANAGERS, PRODUCT OWNERS, AND SCRUM MASTERS TO ENSURE SOLUTIONS DELIVERED MEET THE EXPECTATIONS OF OUR BUSINESS STAKEHOLDERS.OVERSEE THE FULL SOFTWARE DEVELOPMENT LIFE CYCLE, FROM PROJECT INITIATION TO DELIVERY AND MAINTENANCE.PROVIDE MENTORSHIP, TECHNICAL GUIDANCE, AND PROFESSIONAL DEVELOPMENT OPPORTUNITIES FOR TEAM MEMBERS.IMPLEMENT AND ENFORCE CODING STANDARDS, CODE REVIEWS, AND TESTING PROCESSES TO MAINTAIN THE QUALITY OF OUR COMMERCIAL APPLICATION PORTFOLIO.OPTIMIZE RESOURCE UTILIZATION AND EXPLORE COST-EFFECTIVE SOLUTIONS.FOSTER A CULTURE OF INNOVATION, CONTINUOUS LEARNING, AND EXCELLENCE IN SOFTWARE DEVELOPMENT PRACTICES.COLLABORATE WITH ARCHITECTS AND DEVELOPERS TO DESIGN SCALABLE, SECURE, AND MAINTAINABLE WEB APPLICATIONS.STAY UP-TO-DATE WITH INDUSTRY TRENDS AND BEST PRACTICES IN WEB AND APPLICATION DEVELOPMENT.OTHER DUTIES AS ASSIGNED.\nREQUIRED QUALIFICATIONSBACHELOR'S DEGREE IN MIS, COMPUTER SCIENCE, BUSINESS MANAGEMENT, ENGINEERING OR RELATED FIELD10+ YEARS OF SYSTEM AND APPLICATION DEVELOPMENT EXPERIENCE, WITH AT LEAST 3 YEARS IN A DIRECT SUPERVISORY/MANAGERIAL ROLEEXPERIENCE WITH AGILE DEVELOPMENT METHODOLOGIESEXPERIENCE WITH B2B/B2C, E-COMMERCE AND OR COMMERCIAL SYSTEMS DEVELOPMENT, SUCH AS CRM AND WEB FRAMEWORKSFULL-STACK DEVELOPMENT TECHNOLOGIES, INCLUDING REACT, JAVA, JAVASCRIPT, CSS, HTMLEXPERIENCE WITH CLOUD BASED DEVELOPMENT PLATFORMS SUCH AS AWSEXCELLENT COMMUNICATION AND INTERPERSONAL SKILLS, WITH THE ABILITY TO EFFECTIVELY COLLABORATE WITH STAKEHOLDERS AT ALL LEVELS OF THE ORGANIZATIONSDEMONSTRATED LEADERSHIP ABILITIES, INCLUDING THE ABILITY TO DEVELOP AND MANAGE A TEAM TO DRIVE RESULTS",
    "job_skill_set": [
      "project management",
      "software development life cycle",
      "leadership",
      "communication",
      "interpersonal skills",
      "team management",
      "collaboration",
      "innovation",
      "mentorship",
      "strategic planning",
      "financial acumen",
      "problem solving",
      "web development",
      "agile development methodologies",
      "full-stack development",
      "react",
      "java",
      "javascript",
      "css",
      "html",
      "cloud-based development",
      "CRM systems",
      "e-commerce systems",
      "coding standards",
      "code reviews",
      "testing processes"
    ],
    "short_keywords": [
      "acumen",
      "agile",
      "application",
      "cloudbased",
      "code",
      "coding",
      "collaboration",
      "communication",
      "crm",
      "css",
      "cycle",
      "development",
      "ecommerce",
      "financial",
      "fullstack",
      "html",
      "information",
      "informationtechnology",
      "innovation",
      "interpersonal",
      "java",
      "javascript",
      "leadership",
      "life",
      "management",
      "manager",
      "mentorship",
      "methodologies",
      "planning",
      "problem",
      "processes",
      "project",
      "react",
      "reviews",
      "skills",
      "software",
      "solving",
      "standards",
      "strategic",
      "systems",
      "team",
      "technology",
      "testing",
      "web"
    ]
  },
  {
    "job_id": "3895210408",
    "job_title": "Information Technology Analyst",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "EMMIS CORPORATION, HEADQUARTERED ON MONUMENT CIRCLE IN DOWNTOWN INDIANAPOLIS, HAS AN OPENING FOR AN INFORMATION TECHNOLOGY ANALYST TO BE PART OF OUR CORPORATE IT TEAM. IF YOU LOVE TECHNOLOGY, ARE WELL ORGANIZED, AMBITIOUS, HARDWORKING, ENJOY HELPING OTHERS AND ARE INTERESTED IN WORKING FOR A GREAT COMPANY AND TEAM WE ENCOURAGE YOU TO APPLY.\nTHIS IS AN EXCELLENT, ENTRY-LEVEL IT POSITION FOR AN AMBITIOUS PERSON. AS PART OF OUR TECHNOLOGY TEAM, YOU WILL BE EXPOSED TO MANY TECHNOLOGIES AND HAVE THE ABILITY TO GROW AND GAIN REAL WORLD IT EXPERIENCE. \nRECENT AND UPCOMING COLLEGE GRADUATES WITH SOME PROFESSIONAL IT EXPERIENCE WHILE IN SCHOOL ARE ENCOURAGED TO APPLY. WHILE THIS IS A FULL-TIME POSITION, FOR THE RIGHT CANDIDATE, WE WILL CONSIDER AN INITIAL PART-TIME SCHEDULE THAT TRANSITIONS TO FULL-TIME IF YOU WILL BE FINISHING SCHOOL THIS YEAR.\nTHIS IS A FULL TIME, NON-REMOTE POSITION BASED ON-SITE IN OUR DOWNTOWN INDIANAPOLIS OFFICE. THIS POSITION WILL REPORT TO THE DIRECTOR, NETWORK & CLOUD INFRASTRUCTURE.\nDUTIES INCLUDE, BUT ARE NOT LIMITED TO:\nOVERSEEING END USER HARDWARE AND SOFTWARE RELATED TECHNOLOGIES.SUPPORTS EMMIS USERS IN A FAST-PACED ENVIRONMENT, PROVIDING OUTSTANDING CUSTOMER SERVICE THROUGH PROFESSIONALISM, MATURITY, AND TIMELY RESPONSES. RESPONDS TO SUPPORT REQUESTS RECEIVED BY PHONE, EMAIL AND HELP DESK TICKETS. PROVIDE TIER 1 TROUBLESHOOTING OF ALL SUPPORT ISSUES.MANAGES COMPUTER HARDWARE INVENTORY AND MECM/SCCM OPERATING SYSTEM DEPLOYMENT TASK SEQUENCES, BUILDING APPLICATION PACKAGES FOR DEPLOYMENT TO COMPUTERS.ASSISTS WITH MANAGING ENDPOINT SECURITY SOFTWARE, EMAIL SECURITY SOFTWARE.SUPPORTS WINDOWS 10 WORKSTATIONS IN A MICROSOFT ACTIVE DIRECTORY ENVIRONMENT, WITH MICROSOFT OFFICE, VPN ACCESS, ENDPOINT SECURITY, TEAMS, ZOOM AND ANY OTHER APPROVED SOFTWARE BY DEPARTMENT INCLUDING ADOBE, SAP BUSINESS ONE, AUTOCAD, VISUAL STUDIO, PYTHON, STATA, R.CREATES DOCUMENTATION OF ASSIGNED TECHNOLOGIES, PROJECTS, AND RESPONSIBILITIES.\nTO BE CONSIDERED, CANDIDATES ARE REQUIRED TO HAVE THE FOLLOWING SKILLS:\nEXCEPTIONAL CUSTOMER SERVICE, WRITTEN AND VERBAL COMMUNICATION, TROUBLESHOOTING AND ANALYTICAL SKILLS. RELIABLE WITH TIMELY ATTENDANCE. THIS WILL ALLOW THE SUCCESSFUL CANDIDATE TO BUILD A STRONG RELATIONSHIP WITH OUR USERS TO BE A TRUSTED TECHNICAL RESOURCE FOR THEM.MINIMUM ONE YEAR OF INFORMATION TECHNOLOGY EXPERIENCE.EXPERIENCE SUPPORTING WINDOWS 10 COMPUTERS IN AN ENTERPRISE ACTIVE DIRECTORY ENVIRONMENT.LENOVO AND DELL COMPUTER HARDWARE, MOBILE DEVICE (ANDROID AND IOS), AND PRINTER KNOWLEDGE.EXPERIENCE SUPPORTING MICROSOFT 365 TECHNOLOGIES AND APPLICATIONS.AVAILABLE FOR OCCASIONAL ON CALL DUTIES, TRAVEL TO REMOTE OFFICES AND AFTER-HOURS WORK.ABILITY TO SUPPORT USERS AT OUR REMOTE LOCATIONS OR IN PERSON.BE ABLE TO LIFT AND MOVE UP TO 50 POUNDS. WHILE NOT REQUIRED, WE WOULD PREFER CANDIDATES WITH SOME OR ALL THE FOLLOWING:\nASSOCIATES DEGREE OR HIGHER IN COMPUTER SCIENCE OR RELATED FIELD; EQUIVALENT WORK EXPERIENCE WILL BE CONSIDERED.EXPERIENCE WITH ENDPOINT SECURITY, EMAIL SECURITY, AND CYBERSECURITY AWARENESS TRAINING.EXPERIENCE WITH VOIP, INCLUDING TEAMS PHONE SYSTEM.EXPERIENCE WITH CISCO AND FORTINET NETWORKING.EXPERIENCE WITH MICROSOFT HYPER-V.EXPERIENCE WITH WINDOWS SERVER.EXPERIENCE WITH MICROSOFT AZURE.EXPERIENCE WITH MICROSOFT AZURE AD/ENTRA ID.TECHNOLOGY CERTIFICATIONS (MICROSOFT, CISCO, FORTINET, COMPTIA)\nPLEASE APPLY ONLINE AT WWW.EMMIS.COM. NO PHONE CALLS PLEASE!\nEMMIS CORPORATION IS A HIGHLY ENTREPRENEURIAL COMPANY WITH AN AWARD-WINNING CULTURE AND LONG HISTORY OF USING OUR SALES AND MARKETING EXPERTISE TO BUILD SUCCESSFUL BUSINESSES. WE ARE PROUD OF OUR STORIED HISTORY IN MEDIA AND ENTERTAINMENT, PROFESSIONAL SPORTS, AND DIGITAL CONTENT AND TECHNOLOGY, AND WE ARE ENTHUSIASTIC ABOUT USING THIS EXPERIENCE TO ACCELERATE GROWTH AND CREATE VALUE FOR OUR CURRENT PORTFOLIO OF ASSETS AND INVESTMENTS IN THE NEXT GENERATION OF COMPANIES. \nEMMIS OWNS LENCORE, THE WORLD LEADER IN HIGH-QUALITY SOUND MASKING SOLUTIONS FOR OFFICES AND OTHER COMMERCIAL APPLICATIONS; DIGONEX, WHICH PROVIDES DYNAMIC PRICING SOLUTIONS FOR ATTRACTIONS, PERFORMING ARTS ORGANIZATIONS, AND OTHER INDUSTRIES. EMMIS HAS AN INVESTMENT IN ANZU, THE MOST ADVANCED INTRINSIC IN-GAME ADVERTISING SOLUTION FOR PC, CONSOLE, MOBILE, AND CLOUD-BASED VIDEO GAMES. EMMIS ALSO OWNS ONE AM AND ONE FM RADIO STATION IN NEW YORK CITY. \nOUR PEOPLE ARE AGGRESSIVE, KNOWLEDGEABLE, AND DEEPLY COMMITTED TO EACH OF THE COMMUNITIES IN WHICH WE OPERATE. BECAUSE EMPLOYEES ARE THE KEY TO OUR SUCCESS, EMMIS OFFERS STRONG BENEFITS AND INCENTIVES, INCLUDING HEALTH, DENTAL AND LIFE INSURANCE, 401K, GENEROUS VACATION AND HOLIDAY SCHEDULE, AN ON-SITE FITNESS CENTER AT OUR INDIANAPOLIS HEADQUARTERS AND MANY PERKS THAT COME WITH WORKING IN OUR VIBRANT DOWNTOWN. FOR MORE INFORMATION ABOUT EMMIS, SEE OUR WEBSITE AT WWW.EMMIS.COM.\nEMMIS CORPORATION IS AN EQUAL OPPORTUNITY EMPLOYER",
    "job_skill_set": [
      "Windows 10",
      "Active Directory",
      "Troubleshooting",
      "Documentation",
      "Windows Server",
      "Communication",
      "Analytical Skills",
      "Reliability",
      "Teamwork",
      "Problem Solving",
      "Organizational Skills",
      "Adaptability",
      "Time Management",
      "Professionalism",
      "Microsoft 365",
      "Endpoint Security",
      "Email Security",
      "Customer Service",
      "Python",
      "SAP Business One",
      "Visual Studio",
      "Stata",
      "R",
      "Cisco",
      "Fortinet",
      "Microsoft Azure",
      "Microsoft Hyper-V",
      "VoIP",
      "MECM/SCCM",
      "Hardware Inventory Management",
      "Mobile Device Support",
      "Printer Knowledge",
      "Customer Relationship Management"
    ],
    "short_keywords": [
      "10",
      "365",
      "active",
      "adaptability",
      "analyst",
      "analytical",
      "azure",
      "business",
      "cisco",
      "communication",
      "customer",
      "device",
      "directory",
      "documentation",
      "email",
      "endpoint",
      "fortinet",
      "hardware",
      "hyperv",
      "information",
      "informationtechnology",
      "inventory",
      "knowledge",
      "management",
      "mecmsccm",
      "microsoft",
      "mobile",
      "one",
      "organizational",
      "printer",
      "problem",
      "professionalism",
      "python",
      "r",
      "relationship",
      "reliability",
      "sap",
      "security",
      "server",
      "service",
      "skills",
      "solving",
      "stata",
      "studio",
      "support",
      "teamwork",
      "technology",
      "time",
      "troubleshooting",
      "visual",
      "voip",
      "windows"
    ]
  },
  {
    "job_id": "3904424969",
    "job_title": "Threat Hunting Analyst /Information Technology Specialist 3 (Information Security), ref 5774M-10BR",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "MINIMUM QUALIFICATIONS\n\nBACHELOR’S DEGREE* WITH AT LEAST 15 CREDIT HOURS IN CYBER SECURITY, INFORMATION ASSURANCE, OR INFORMATION TECHNOLOGY; AND TWO YEARS OF INFORMATION TECHNOLOGY EXPERIENCE, INCLUDING ONE YEAR OF INFORMATION SECURITY OR INFORMATION ASSURANCE EXPERIENCE**.\n\n SUBSTITUTION: BACHELOR’S DEGREE CANDIDATES WITHOUT AT LEAST 15 COURSE CREDITS IN CYBER SECURITY, INFORMATION ASSURANCE, OR INFORMATION TECHNOLOGY REQUIRE AN ADDITIONAL YEAR OF GENERAL INFORMATION TECHNOLOGY EXPERIENCE TO QUALIFY. APPROPRIATE INFORMATION SECURITY OR INFORMATION ASSURANCE EXPERIENCE MAY SUBSTITUTE FOR THE BACHELOR’S DEGREE ON A YEAR-FOR-YEAR BASIS; AN ASSOCIATE’S DEGREE REQUIRES AN ADDITIONAL TWO YEARS OF GENERAL INFORMATION TECHNOLOGY EXPERIENCE. EXPERIENCE SOLELY IN INFORMATION SECURITY OR INFORMATION ASSURANCE MAY SUBSTITUTE FOR THE GENERAL INFORMATION TECHNOLOGY EXPERIENCE.\n\nPREFERRED QUALIFICATIONS\n\n CERTIFICATIONS IN ONE OR MORE OF THE FOLLOWING:CYBER DEFENSE (E.G., GCIA, GCIH, GCED, GSOM, GSOC, GMON, GCDA)CYBER THREAT INTELLIGENCE (E.G., GCTI, CTIA, CCIP, GOSI)INFORMATION SECURITY MANAGEMENT (E.G., CISSP, CISM, CCISO) 1+ YEARS’ EXPERIENCE IN ONE OR MORE OF THE FOLLOWING:WORKING AS A SOC ANALYSTCONDUCTING LOG ANALYSIS (E.G., FIREWALL LOGS, DNS LOGS, PROXY LOGS, IDS/IPS LOGS)USING SIEM TECHNOLOGIES TO SUPPORT IN-DEPTH INVESTIGATIONSPARTICIPATING IN CYBER INCIDENT RESPONSE STRONG UNDERSTANDING OF ENTERPRISE IT ENVIRONMENTS, INCLUDING BUT NOT LIMITED TO SYSTEM ADMINISTRATION, NETWORK ARCHITECTURE, OPERATING SYSTEMS, ENDPOINT DETECTION AND RESPONSE TOOLS, AND NETWORK-BASED SECURITY SOLUTIONS (E.G., IDS/IPS, FIREWALLS). STRONG UNDERSTANDING OF THE FOUNDATIONS OF INFORMATION SECURITY, SUCH AS THE CIA TRIAD, INFORMATION CLASSIFICATION, IDENTITY AND ACCESS MANAGEMENT, RISK MANAGEMENT, VULNERABILITY MANAGEMENT, SECURE ARCHITECTURE AND ENGINEERING, NETWORK SECURITY, SOFTWARE DEVELOPMENT SECURITY, ETC. EXCELLENT ORAL AND WRITTEN COMMUNICATION SKILLS INCLUDING THE ABILITY TO CLEARLY ARTICULATE INFORMATION TECHNOLOGY AND INFORMATION SECURITY CONCEPTS TO A VARIED AUDIENCE TO FACILITATE WIDE UNDERSTANDING. DEMONSTRATED CRITICAL THINKING, PROBLEM SOLVING AND ANALYTICAL SKILLS.\n\nDUTIES DESCRIPTION\n\nUNDER THE DIRECTION OF SENIOR LEADERSHIP WITHIN THE OFFICE OF INFORMATION TECHNOLOGY SERVICES\\CHIEF INFORMATION SECURITY OFFICE\\CYBER COMMAND CENTER\\ NEW YORK SECURITY OPERATIONS CENTER (NYSOC), THE INCUMBENT WILL BE A THREAT HUNTING ANALYST WORKING IN THE NYSOC. THE INCUMBENT WILL LEVERAGE A VARIETY OF THREAT INTELLIGENCE SOURCES AND INDICATORS OF COMPROMISE (IOCS) TO PERFORM BOTH PROACTIVE AND REACTIVE THREAT HUNTING ACROSS A LARGE AND DIVERSE MULTI-ENTITY ENVIRONMENT. THE INCUMBENT WILL PARTICIPATE IN THE INGESTION AND RESPONSE TO ALL FORMS OF THREAT INTELLIGENCE AND VULNERABILITY ANNOUNCEMENTS RECEIVED FROM MANY THIRD PARTIES SUCH AS VENDORS, DHS CISA, MS-ISAC, NYSP, AND OTHER SOURCES OF OPEN-SOURCE INTELLIGENCE.\n\nTHIS POSITION REQUIRES THE INCUMBENT TO POSSESS A SOLID UNDERSTANDING OF THE CURRENT CYBER THREAT LANDSCAPE, THE TACTICS, TECHNIQUES, TOOLS, AND PROCEDURES COMMONLY LEVERAGED, AND THE STEPS NECESSARY TO SWIFTLY IDENTIFY AND CONTAIN A POTENTIAL CYBER THREAT. ADDITIONALLY, THIS POSITION REQUIRES AN INCUMBENT TO ACT WITH A GREAT DEAL OF INDEPENDENCE IN ALIGNMENT WITH AGENCY AND UPPER-LEVEL MANAGEMENT STRATEGIC DIRECTION.\n\nDUE TO THE NATURE OF THE WORK PERFORMED BY THE SOC, THIS POSITION REQUIRES AVAILABILITY DURING OFF-SHIFT HOURS TO ENSURE APPROPRIATE RESPONSE TO SECURITY INCIDENTS OR OTHER CRITICAL ACTIVITIES AS NEEDED.\n\nDUTIES INCLUDE, BUT ARE NOT LIMITED TO\n\n MONITOR AND REPORT ON CURRENT AND EMERGING THREATS INCLUDING EXPLOITABLE VULNERABILITIES, AND DETAILS OF THOSE VULNERABILITIES CONDUCT RESEARCH, ANALYSIS, AND CORRELATION ACROSS A WIDE VARIETY OF ALL SOURCE DATA SETS SUCH AS IOCS, IOAS AND WARNINGS PERFORM THREAT HUNTING ACROSS A MULTI-OS/MULTI-CLOUD ENVIRONMENT TO ENSURE A TIMELY AND EFFECTIVE RESPONSE TO NEW CYBER THREATS IDENTIFY TACTICS, TECHNIQUES, AND PROCEDURES (TTPS) FOR INTRUSION SETS RESPOND TO AD-HOC REQUEST, RESEARCH, THREAT HUNTS, AND ASSIST WITH OTHER BUSINESS UNITS AS NEEDED ASSIST WITH CREATING DETECTION CONTENT BASED ON THREAT HUNTING FINDINGS DOCUMENT ALL THREAT HUNT, TRACK, AND CREATE TRENDS BASED ON THE FINDINGS CLASSIFY/CATEGORIZE HUNTING USE CASES BASED ON MITRE ATT&CK FRAMEWORK AND CYBER KILL CHAIN CREATE DAILY, MONTHLY, AND YEARLY INTELLIGENCE INFORMATION IN SUPPORT OF NYSOC BUSINESS NEEDS CREATE TECHNICAL REPORTS AND EXECUTIVE SUMMARIES RELATED TO CYBER SECURITY INCIDENTS AND EVENTS PARTICIPATE IN ACTIVE PROJECTS TO HELP IDENTIFY AND RESOLVE ISSUES/PROBLEMS TO ENSURE SUCCESSFUL OUTCOMES ARE ACHIEVED PERFORM THE FULL RANGE OF SUPERVISORY RESPONSIBILITIES, AS ASSIGNED\n\nADDITIONAL COMMENTS\n\nTHIS POSTING MAY BE USED TO FILL MULTIPLE POSITIONS.\n\nADDITIONAL DETAILS ON WORK SHIFT WILL BE DISCUSSED AT TIME OF INTERVIEW.\n\nBACKGROUND CHECK AND FINGERPRINTING ARE REQUIRED.\n\nBENEFITS OF WORKING FOR NYS\n\nGENEROUS BENEFITS PACKAGE, WORTH 65% OF SALARY, INCLUDING:\n\n HOLIDAY & PAID TIME OFF THIRTEEN (13) PAID HOLIDAYS ANNUALLY UP TO THIRTEEN (13) DAYS OF PAID VACATION LEAVE ANNUALLY UP TO FIVE (5) DAYS OF PAID PERSONAL LEAVE ANNUALLY UP TO THIRTEEN (13) DAYS OF PAID SICK LEAVE ANNUALLY FOR PEF UP TO THREE (3) DAYS OF PROFESSIONAL LEAVE ANNUALLY TO PARTICIPATE IN PROFESSIONAL DEVELOPMENT\n\nHEALTH CARE BENEFITS\n\n ELIGIBLE EMPLOYEES AND DEPENDENTS CAN PICK FROM A VARIETY OF AFFORDABLE HEALTH INSURANCE PROGRAMS FAMILY DENTAL AND VISION BENEFITS AT NO ADDITIONAL COST\n\nADDITIONAL BENEFITS\n\n NEW YORK STATE EMPLOYEES’ RETIREMENT SYSTEM (ERS) MEMBERSHIP NYS DEFERRED COMPENSATION ACCESS TO NY 529 AND NY ABLE COLLEGE SAVINGS PROGRAMS, AS WELL AS U.S. SAVINGS BONDS PUBLIC SERVICE LOAN FORGIVENESS (PSLF) UP TO 50% TELECOMMUTING AND MANY MORE.\n\n",
    "job_skill_set": [
      "cyber security",
      "information technology",
      "data analysis",
      "identity and access management",
      "software development security",
      "communication",
      "critical thinking",
      "problem solving",
      "analytical skills",
      "independence",
      "teamwork",
      "information assurance",
      "log analysis",
      "SIEM technologies",
      "threat intelligence",
      "network security",
      "endpoint detection and response",
      "vulnerability management",
      "incident response",
      "MITRE ATT&CK framework",
      "technical report writing",
      "system administration",
      "network architecture",
      "firewall management",
      "IDS/IPS",
      "CIA triad",
      "risk management",
      "secure architecture"
    ],
    "short_keywords": [
      "3",
      "5774m10br",
      "access",
      "administration",
      "analysis",
      "analyst",
      "analytical",
      "and",
      "architecture",
      "assurance",
      "attck",
      "cia",
      "communication",
      "critical",
      "cyber",
      "data",
      "detection",
      "development",
      "endpoint",
      "firewall",
      "framework",
      "hunting",
      "identity",
      "idsips",
      "incident",
      "independence",
      "information",
      "informationtechnology",
      "intelligence",
      "log",
      "management",
      "mitre",
      "network",
      "problem",
      "ref",
      "report",
      "response",
      "risk",
      "secure",
      "security",
      "siem",
      "skills",
      "software",
      "solving",
      "specialist",
      "system",
      "teamwork",
      "technical",
      "technologies",
      "technology",
      "thinking",
      "threat",
      "triad",
      "vulnerability",
      "writing"
    ]
  },
  {
    "job_id": "3904390620",
    "job_title": "Vice President Information Technology",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "LIFE CHANGING THERAPIES. GLOBAL IMPACT. BRIDGE TO THOUSANDS OF BIOPHARMA COMPANIES AND THEIR PATIENTS.\n\nWE ARE PCI. \n\nOUR INVESTMENT IS IN PEOPLE WHO MAKE AN IMPACT, DRIVE PROGRESS AND CREATE A BETTER TOMORROW. OUR STRATEGY INCLUDES BUILDING TEAMS ACROSS OUR GLOBAL NETWORK TO PIONEER AND SHAPE THE FUTURE OF PCI.\n\nJOB TITLE: VICE PRESIDENT, INFORMATION TECHNOLOGY (VP,IT)\n\nPOSITION SUMMARY\n\nTHE VICE PRESIDENT, INFORMATION TECHNOLOGY (VP IT) WILL PLAY A PIVOTAL ROLE IN SHAPING AND EXECUTING THE TECHNOLOGY STRATEGY OF OUR FAST-GROWING GLOBAL PHARMACEUTICAL PACKAGING COMPANY. THE SUCCESSFUL CANDIDATE WILL BE RESPONSIBLE FOR LEVERAGING MODERN IT SOLUTIONS TO ENHANCE BUSINESS OPERATIONS, DRIVE EFFICIENCY, AND ENSURE COMPLIANCE. YOUR LEADERSHIP WILL BE CRITICAL IN ACHIEVING OUR ORGANIZATIONAL GOALS AND MAINTAINING A COMPETITIVE EDGE. THIS ROLE WILL DIRECTLY REPORT TO PCI’S CHIEF INFORMATION OFFICER (CIO) AND WILL BE A STRATEGIC MEMBER OF THE SENIOR LEADERSHIP TEAM.\n\nKEY RESPONSIBILITIES\n\nSTRATEGIC LEADERSHIP:\n\nCOLLABORATE WITH OTHER SENIOR AND C-SUITE EXECUTIVES TO ALIGN IT INITIATIVES WITH OVERALL BUSINESS OBJECTIVES.DEVELOP AND COMMUNICATE A CLEAR IT VISION AND STRATEGY.\n\nTEAM BUILDING AND MANAGEMENT\n\nBUILD AND LEAD HIGH-PERFORMING IT TEAMS.FOSTER A COLLABORATIVE AND INNOVATIVE WORK ENVIRONMENT.MENTOR AND DEVELOP TEAM MEMBERS.\n\nINNOVATIVE TECHNOLOGIES\n\nEXPERIENCE WITH TECHNOLOGIES TO ENABLE AND ACCELERATE INNOVATION COMPANY WIDE.KNOWLEDGEABLE IN TECHNOLOGY SCALABILITY AND EFFICIENCIES, DATA PLATFORM AND SERVICES, OPERATIONAL PLANT TECHNOLOGIES AND TECHNOLOGY / OUTSOURCING PARTNERSHIPS.\n\nERP RATIONALIZATION AND STANDARDIZATION\n\nEVALUATE EXISTING ERP SYSTEMS AND RECOMMEND IMPROVEMENTS.DRIVE STANDARDIZATION AND ALIGNMENT ACROSS ERP INSTANCESSTANDARDIZE PROCESSES ACROSS DIFFERENT BUSINESS SITES AND SEGMENTS.\n\nERP IMPLEMENTATION\n\nOVERSEE SUCCESSFUL IMPLEMENTATION OF ERP SOLUTIONS.AVOID ANY DISRUPTIONS RESULTING FROM IMPLEMENTATIONS.ENSURE SEAMLESS INTEGRATION WITH EXISTING SYSTEMS.\n\nCYBERSECURITY\n\nPROTECT AND FURTHER DEVELOP AND IMPLEMENT ROBUST CYBERSECURITY MEASURES.PROTECT SENSITIVE DATA AND MITIGATE RISKS.\n\nENTERPRISE ARCHITECTURE MANAGEMENT\n\nDEFINE AND MAINTAIN THE COMPANY'S TECHNOLOGY ARCHITECTURE.ENSURE SCALABILITY, RELIABILITY, AND FLEXIBILITY.SPEARHEAD COMPANY MASTER DATA STANDARDIZATION IN PARTNERSHIP WITH BUSINESS PROCESS OPTIMIZATIONDRIVE IT INFRASTRUCTURE MODERNIZATION AND EFFICIENCY GLOBALLY.\n\nAUTOMATION\n\nIDENTIFY OPPORTUNITIES FOR PROCESS AUTOMATION.STREAMLINE WORKFLOWS AND ENHANCE EFFICIENCY.\n\nCLOUD SUPPORT\n\nEVALUATE CLOUD SOLUTIONS (E.G., AWS, AZURE) AND IMPLEMENT CLOUD STRATEGIES.OPTIMIZE CLOUD INFRASTRUCTURE FOR COST-EFFECTIVENESS AND PERFORMANCE.\n\nIT GENERAL CONTROLS FOR SOX COMPLIANCE\n\nESTABLISH AND ENFORCE IT CONTROLS TO COMPLY WITH SARBANES-OXLEY (SOX) REQUIREMENTS.WORK CLOSELY WITH INTERNAL AUDIT TEAMS. \n\nACQUISITION INTEGRATION\n\nLEAD IT INTEGRATION EFFORTS DURING MERGERS AND ACQUISITIONS.ENSURE SMOOTH TRANSITION OF TECHNOLOGY SYSTEMS.\n\nDIGITAL TRANSFORMATION AND OPEN AI\n\nDESIGN AND PREPARE FOR DIGITAL TRANSFORMATION INITIATIVES IN COMING YEARS.INVEST IN, AND EXPAND OUR DIGITAL PLATFORM CAPABILITIES SUPPORTING PCI-BRIDGEEXPLORE OPPORTUNITIES FOR LEVERAGING OPEN AI TECHNOLOGIES ACROSS MULTIPLE AREAS (QUALITY, BUSINESS DEVELOPMENT, LEGAL, FINANCE).\n\nGLOBAL SYSTEMS MANAGEMENT AND IT SUPPORT\n\nJDE, WD, SF, LIMS ADF, MEF, ETC. \n\nMINIMUM QUALIFICATIONS\n\nMASTERS DEGREE IN COMPUTER SCIENCE, INFORMATION SYSTEMS, OR RELATED FIELD.PROVEN EXPERIENCE AS A CIO OR IN A SIMILAR LEADERSHIP ROLE FOR A MID TO LARGE SIZED PUBLIC COMPANYSTRONG UNDERSTANDING OF PHARMACEUTICAL INDUSTRY DYNAMICS.EXCELLENT COMMUNICATION AND NEGOTIATION SKILLS.ABILITY TO BALANCE STRATEGIC THINKING WITH HANDS-ON EXECUTION.\n\nOTHER\n\nTRAVEL - DOMESTIC USA AND INTERNATIONAL (PRIMARILY EUROPE) TRAVEL REQUIRED; EXPECTED TO BE 25-30% OF THE TIME AND AS NEEDED \n\nJOIN US AND BE PART OF BUILDING THE BRIDGE BETWEEN LIFE CHANGING THERAPIES AND PATIENTS. LET’S TALK FUTURE\n\nEQUAL EMPLOYMENT OPPORTUNITY (EEO) STATEMENT\n\nPCI PHARMA SERVICES IS AN EQUAL OPPORTUNITY/AFFIRMATIVE ACTION EMPLOYER. WE DO NOT UNLAWFULLY DISCRIMINATE ON THE BASIS OF RACE, COLOR, RELIGION, AGE, SEX, CREED, NATIONAL ORIGIN, ANCESTRY, CITIZENSHIP STATUS, MARITAL OR DOMESTIC OR CIVIL UNION STATUS, FAMILIAL STATUS, AFFECTIONAL OR SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, GENETICS, DISABILITY, MILITARY ELIGIBILITY OR VETERAN STATUS, OR ANY OTHER PROTECTED STATUS.",
    "job_skill_set": [
      "cybersecurity",
      "cloud solutions",
      "automation",
      "digital transformation",
      "project management",
      "communication",
      "collaboration",
      "problem solving",
      "innovation",
      "IT strategy",
      "ERP systems",
      "data platform",
      "enterprise architecture",
      "technology scalability",
      "IT controls for SOX compliance",
      "technology outsourcing",
      "JDE",
      "WD",
      "SF",
      "LIMS",
      "ADF",
      "MEF",
      "leadership",
      "team building",
      "strategic thinking",
      "negotiation",
      "mentoring",
      "adaptability"
    ],
    "short_keywords": [
      "adaptability",
      "adf",
      "architecture",
      "automation",
      "building",
      "cloud",
      "collaboration",
      "communication",
      "compliance",
      "controls",
      "cybersecurity",
      "data",
      "digital",
      "enterprise",
      "erp",
      "for",
      "information",
      "informationtechnology",
      "innovation",
      "it",
      "jde",
      "leadership",
      "lims",
      "management",
      "mef",
      "mentoring",
      "negotiation",
      "outsourcing",
      "platform",
      "president",
      "problem",
      "project",
      "scalability",
      "sf",
      "solutions",
      "solving",
      "sox",
      "strategic",
      "strategy",
      "systems",
      "team",
      "technology",
      "thinking",
      "transformation",
      "vice",
      "wd"
    ]
  },
  {
    "job_id": "3903452481",
    "job_title": "Information Technology Support Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOB SUMMARYTHE TECHNICAL SUPPORT, AV & DESKTOP SPECIALIST IS RESPONSIBLE FOR PROVIDING DIRECT, TECHNICAL SUPPORT AND TROUBLESHOOTING ASSISTANCE TO ATTORNEYS AND STAFF. THE SPECIALIST WILL IDENTIFY, RESEARCH, TRACK, MONITOR AND RESOLVE TECHNICAL ISSUES.JOB RESPONSIBILITIES• RESOLVES INCOMING REQUESTS FOR ASSISTANCE FROM USERS EXPERIENCING PROBLEMS WITH HARDWARE,SOFTWARE, NETWORKING, AND OTHER COMPUTER RELATED TECHNOLOGIES.• ANALYZES AND RESOLVES PROBLEMS ACCORDING TO SHIFTING PRIORITIES, TIME FRAMES AND RESOURCES, ASWELL AS DOCUMENTING RESOLUTIONS IN CALL TRACKING SYSTEM.• EFFECTIVELY DOCUMENTS ALL SUPPORT CALLS AND, IF NECESSARY, ESCALATES CALLS TO PROPER INTERNALSUPPORT PERSON. MONITORS PROGRESS THROUGH RESOLUTION.• MONITORS SUPPORT ACTIVITY AND INFORMS TEAM/MANAGER OF ANY PERCEIVED TRENDS, POSITIVE ORNEGATIVE, IN CALLS BEING RECEIVED AND/OR SOLUTIONS BEING EMPLOYED.• ACQUIRES AND MAINTAINS KNOWLEDGE OF RELEVANT PRODUCTS, CURRENT SUPPORT POLICIES, ANDMETHODS OF SUPPORT DELIVERY.• TROUBLESHOOTS, DIAGNOSES AND IDENTIFIES FAILING/FAILED PARTS OR SYSTEMS THROUGH THE USE OFHARDWARE DIAGNOSTIC SOFTWARE AND ROUTINES.• ASSISTS IN THE MANAGEMENT AND MAINTAINING OF THE HARDWARE ASSET INVENTORY.• IMAGING AND REPAIR OF EQUIPMENT.• PROVIDES DESKSIDE SUPPORT.• PERFORMS SETUP OF VIDEO TELECONFERENCE EQUIPMENT.• PERFORMS SETUP OF CONFERENCE ROOM TECHNOLOGIES; PROJECTORS, SCREENS, PCS.• PARTICIPATES IN THE IMPLEMENTATION OF SPECIAL PROJECTS AS REQUESTED.• CONSISTENTLY MODELS THE HIGHEST LEVELS OF CLIENT SERVICE ORIENTATION AND PROFESSIONALISM.• CONTINUALLY IMPROVES TECHNICAL PROFICIENCY THROUGH RESEARCH, SELF-TRAINING AND PARTICIPATION ININTERNAL AND EXTERNAL TRAINING OPPORTUNITIES.• CONTINUALLY IMPROVES CLIENT SERVICE THROUGH DILIGENT, THOUGHTFUL AND TIMELY EXECUTION OFSUPPORT REQUESTS.• PARTICIPATES IN THE AFTER-HOURS PAGER ROTATION, PROVIDING ON-CALL 24X7 TECHNICAL SUPPORT.• PARTICIPATES IN THE ROTATION OF MONITORING AND RESOLVING OF VOICEMAIL AND EMAIL REQUESTS.",
    "job_skill_set": [
      "technical support",
      "troubleshooting",
      "hardware diagnostics",
      "software support",
      "networking",
      "hardware asset management",
      "imaging and repair of equipment",
      "client service orientation",
      "communication",
      "problem solving",
      "teamwork",
      "time management",
      "self-training",
      "professionalism",
      "adaptability",
      "video teleconferencing setup",
      "projector setup",
      "call tracking system"
    ],
    "short_keywords": [
      "adaptability",
      "and",
      "asset",
      "call",
      "client",
      "communication",
      "diagnostics",
      "equipment",
      "hardware",
      "imaging",
      "information",
      "informationtechnology",
      "management",
      "networking",
      "of",
      "orientation",
      "problem",
      "professionalism",
      "projector",
      "repair",
      "selftraining",
      "service",
      "setup",
      "software",
      "solving",
      "specialist",
      "support",
      "system",
      "teamwork",
      "technical",
      "technology",
      "teleconferencing",
      "time",
      "tracking",
      "troubleshooting",
      "video"
    ]
  },
  {
    "job_id": "3906222807",
    "job_title": "Information Technology Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOIN AN AMAZING TEAM AND BE PART OF A TRANSFORMATIVE JOURNEY! FOUNDED IN 2015 AND LOCATED IN ORLANDO, FL, OUR COMPANY HAS RAPIDLY EVOLVED UNDER DYNAMIC LEADERSHIP, EXPANDING NATIONWIDE WITH OVER 150 EMPLOYEES AND STILL GROWING. WE ARE DEDICATED TO PROVIDING ACCURATE AND PROMPT SERVICES, ENSURING OPTIMAL PATIENT CARE AND OUTCOMES.ABOUT THE ROLE: AS THE INFORMATION TECHNOLOGY MANAGER, YOU WILL PLAY A PIVOTAL ROLE IN SUPPORTING AND EXECUTING VARIOUS TECHNOLOGY-RELATED ACTIVITIES TO DRIVE OUR COMPANY'S MISSION AND GROWTH OBJECTIVES. EMBRACING A CLOUD-FIRST STRATEGY, YOU WILL OVERSEE A SPECTRUM OF THIRD-PARTY SOLUTIONS AND SERVICES, ENSURING THEIR SECURE, COMPLIANT, OPTIMIZED, AND COST-EFFECTIVE UTILIZATION. COLLABORATING CLOSELY WITH CROSS-FUNCTIONAL TEAMS INCLUDING SALES, CLINICAL SERVICES, RESEARCH AND DEVELOPMENT, AND BILLING SERVICES, YOU WILL MONITOR IT OPERATIONS, MANAGE PROJECTS, AND PROVIDE STRATEGIC GUIDANCE ON TECHNOLOGY-RELATED MATTERS.RESPONSIBILITIES:COLLABORATE WITH TEAM MEMBERS TO STREAMLINE AND OPTIMIZE PROCESSES ACROSS DEPARTMENTSENHANCE AND EXPAND OUR CYBER SECURITY PROGRAM IN COLLABORATION WITH EXTERNAL IT PROVIDERSENSURE NETWORKS, PROCESSES, AND SOLUTIONS COMPLY WITH INDUSTRY, STATE, AND LOCAL REGULATIONS, INCLUDING CONDUCTING ANNUAL HIPAA SECURITY ASSESSMENTSDEVELOP AND MAINTAIN IT POLICIES, PROCEDURES, AND STANDARDS IN PARTNERSHIP WITH EXTERNAL CONSULTANTS AND COMPANY MANAGEMENTPROVIDE ONGOING SUPPORT FOR DAY-TO-DAY UTILIZATION OF SOLUTIONS AND PROCESSES, RECOMMENDING IMPROVEMENTS AS NEEDEDMANAGE THE OVERALL PORTFOLIO OF TECHNOLOGY HARDWARE, SOFTWARE, AND SOLUTIONSATTEND AND CONTRIBUTE TO DEPARTMENTAL MEETINGS AS REQUIRED, AND PROVIDE REGULAR IT STATUS REPORTSFOSTER HEALTHY RELATIONSHIPS WITH DEPARTMENTAL DIRECTORS, SUPERVISORS, AND EXTERNAL PARTNERSMONITOR THE PERFORMANCE OF THIRD-PARTY PARTNERS, VENDORS, AND SUPPLIERSRESEARCH AND RECOMMEND SOLUTIONS AND SERVICES AS NECESSARYPLAN, TRACK, AND OVERSEE IT-RELATED ACTIVITIES AND PROJECTSCOLLABORATE WITH EXTERNAL IT PARTNERS, SUPPLIERS, AND AGENCIES ON PROJECTS AND PROCESS ENHANCEMENTSKEEP COMPANY LEADERSHIP INFORMED ON PROGRAM EXECUTION AND PERFORMANCEGENERATE IT HELP DESK AND QUALITY ASSURANCE METRICS, INCLUDING INCIDENT ANALYSIS AND RESOLUTION STATEMENTSPERFORM OTHER DUTIES AS ASSIGNEDPREFERRED QUALIFICATIONS:3-5 YEARS OF EXPERIENCE MANAGING OR LEADING AN IT DEPARTMENT FOR A SMALL COMPANYPROFICIENCY WITH MICROSOFT 365 SUITE AND RELATED TOOLSEXPERIENCE IN MANAGING IT CONTRACTS AND CLINICAL LABORATORY WORKFLOWSFAMILIARITY WITH CUSTOMER PORTAL DEVELOPMENT AND MANAGEMENTABILITY TO DISCOVER, PLAN, AND IMPLEMENT OPTIMIZED BUSINESS PROCESSESSTRONG UNDERSTANDING OF NETWORKING CONCEPTS AND DIAGNOSTICS INDUSTRYKNOWLEDGE OF HEALTHCARE MARKETS AND CUSTOMER DYNAMICSCOMFORTABLE WORKING IN A STARTUP ENVIRONMENT AND MANAGING MULTIPLE TASKS SIMULTANEOUSLYEXCELLENT COLLABORATION, COMMUNICATION, AND PRESENTATION SKILLSFAMILIARITY WITH ITIL TERMINOLOGY AND CONCEPTS PREFERREDDETAIL-ORIENTED WITH A COMMITMENT TO QUALITY WORK AND TIMELY DELIVERABLESPROACTIVE WORK STYLE WITH A WILLINGNESS TO TAKE INITIATIVEPROFESSIONALISM AND DEDICATION TO RESPECTING COLLEAGUES, CUSTOMERS, AND STAKEHOLDERSPASSION FOR CONTINUOUS LEARNINGCOMFORTABLE WORKING IN A LABORATORY ENVIRONMENTEDUCATION, CERTIFICATIONS, AND OTHER REQUIREMENTS:BACHELOR’S DEGREE IN COMPUTER SCIENCE, INFORMATION MANAGEMENT, OR RELATED FIELDON-SITE WORK AT OFFICE REQUIREDPHYSICAL INSTALLATION OF EQUIPMENT AND OCCASIONAL TRAVEL MAY BE NECESSARYJOIN US IN OUR MISSION TO COMBINE ACCURACY WITH INTEGRITY AND IMPROVE PATIENT OUTCOMES THROUGH CLINICALLY ACTIONABLE DATA. APPLY NOW AND BE PART OF OUR INNOVATIVE TEAM!TOP OF FORM\n",
    "job_skill_set": [
      "cyber security",
      "Microsoft 365",
      "networking concepts",
      "IT contract management",
      "project management",
      "collaboration",
      "communication",
      "presentation skills",
      "problem solving",
      "attention to detail",
      "proactive work style",
      "professionalism",
      "continuous learning",
      "time management",
      "cloud strategy",
      "IT policy development",
      "customer portal development",
      "ITIL terminology",
      "data analysis"
    ],
    "short_keywords": [
      "365",
      "analysis",
      "attention",
      "cloud",
      "collaboration",
      "communication",
      "concepts",
      "continuous",
      "contract",
      "customer",
      "cyber",
      "data",
      "detail",
      "development",
      "information",
      "informationtechnology",
      "it",
      "itil",
      "learning",
      "management",
      "manager",
      "microsoft",
      "networking",
      "policy",
      "portal",
      "presentation",
      "proactive",
      "problem",
      "professionalism",
      "project",
      "security",
      "skills",
      "solving",
      "strategy",
      "style",
      "technology",
      "terminology",
      "time",
      "to",
      "work"
    ]
  },
  {
    "job_id": "3902841871",
    "job_title": "Director of Information Technology",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "MEET COME NEARCOME NEAR IS A PURPOSE-DRIVEN ORGANIZATION WHOSE MISSION IS TO INVITE ALL PEOPLE ONE STEP CLOSER TO JESUS FROM WHEREVER THEY ARE. WE PRODUCE THOUGHT-PROVOKING CAMPAIGNS THAT SHARE THE LIFE AND LOVE OF JESUS IN FRESH, INNOVATIVE WAYS. \nWE FUEL THE WIDELY RECOGNIZED HE GETS US CAMPAIGN, WHICH HAS SHATTERED STEREOTYPES AND CREATED AN INVITATION FOR EVERYONE TO (RE)DISCOVER JESUS AT THEIR OWN PACE.\nABOUT THE DIRECTOR OF INFORMATION TECHNOLOGYWE ARE SEEKING A VISIONARY AND EXPERIENCED IT DIRECTOR TO LEAD OUR TECHNOLOGY STRATEGY. IN THIS PIVOTAL ROLE, YOU WILL PLAY A KEY PART IN ENSURING OUR TECHNOLOGY INFRASTRUCTURE SUPPORTS OUR MISSION OF INVITING ALL PEOPLE TO TAKE ONE STEP CLOSER TO JESUS FROM WHEREVER THEY ARE. YOU WILL PARTNER WITH LEADERSHIP ACROSS THE ORGANIZATION TO LEVERAGE TECHNOLOGY FOR GROWTH, EFFICIENCY, AND SECURITY.\nRESPONSIBILITIESLEAD THE DEVELOPMENT AND IMPLEMENTATION OF A STRATEGIC IT ROADMAP THAT SUPPORTS ORGANIZATIONAL GROWTH AND INNOVATIONESTABLISH AND MAINTAIN STATE-OF-THE-ART DATA INFRASTRUCTURE AND MANAGEMENT SYSTEMSOVERSEE ALL ASPECTS OF IT INFRASTRUCTURE, INCLUDING NETWORK SECURITY, DATA MANAGEMENT, AND SYSTEM ADMINISTRATIONDEVELOP AND IMPLEMENT A ROBUST CYBERSECURITY PROGRAM TO PROTECT SENSITIVE DATA AND MITIGATE CYBER THREATSBUILD OUT (OVER TIME) A TEAM OF IT PROFESSIONALS, FOSTERING A CULTURE OF CONTINUOUS LEARNING AND IMPROVEMENTEVALUATE AND IMPLEMENT NEW TECHNOLOGIES THAT ENHANCE EFFICIENCY, COLLABORATION, AND COMMUNICATION WITHIN THE ORGANIZATIONDEVELOP AND MAINTAIN IT POLICIES AND PROCEDURES TO ENSURE COMPLIANCE WITH INDUSTRY STANDARDS AND REGULATIONSPARTNER WITH LEADERSHIP TO ALIGN IT INITIATIVES WITH THE ORGANIZATION'S STRATEGIC GOALS\nWHAT YOU BRINGTHE FOLLOWING DESCRIBES MANY OF THE CHARACTERISTICS OF THE IDEAL CANDIDATE:\nEDUCATION & EXPERIENCESEASONED IT PROFESSIONAL WITH 7+ YEARS OF EXPERIENCE IN A LEADERSHIP ROLE (EXPERIENCE WORKING IN A STARTUP ENVIRONMENT IS PREFERRED)EXTENSIVE EXPERIENCE IN NETWORK ADMINISTRATION, SERVER MANAGEMENT, AND CLOUD COMPUTING SOLUTIONS\nKNOWLEDGE, SKILLS, AND ABILITIESPOSSESSES A STRONG UNDERSTANDING OF CURRENT IT TRENDS, BEST PRACTICES, AND CYBERSECURITY THREATSABILITY TO DEVELOP AND IMPLEMENT A COMPREHENSIVE IT STRATEGY ALIGNED WITH THE ORGANIZATION'S MISSION AND GOALSCYBERSECURITY EXPERT WITH A DEEP UNDERSTANDING OF DATA SECURITY PROTOCOLS AND RISK MITIGATION STRATEGIESPROFICIENT IN IT SERVICE MANAGEMENT METHODOLOGIES (E.G. ITIL) AND PROJECT MANAGEMENT TECHNIQUESEXCELLENT COMMUNICATOR AND COLLABORATORABLE TO EFFECTIVELY PARTNER WITH STAFF ACROSS ALL DEPARTMENTSCAN WORK INDEPENDENTLY WITH MINIMAL SUPERVISION WHILE MAINTAINING A HIGH LEVEL OF EFFICIENCY AND EFFECTIVENESS\nPERSONAL CHARACTERISTICS & QUALIFICATIONSCOMMITTED JESUS FOLLOWERPASSIONATE ABOUT COME NEAR'S MISSIONINSPIRED BY THE HE GETS US MOVEMENTPURPOSE-DRIVEN THRIVES WORKING IN A FAST-PACED ENVIRONMENTPROVEN LEADERALWAYS WILLING TO “ROLL UP YOUR SLEEVES” TO ACCOMPLISH IMPORTANT TASKSSELF-STARTER“CAN DO” ATTITUDEALWAYS THINKING ABOUT CREATIVE SOLUTIONS TO CHALLENGES WHILE OPERATING WITHIN APPROPRIATE BOUNDARIES\nWHAT WE OFFERA UNIQUE OPPORTUNITY TO IMPACT CULTURE THROUGH MISSION-DRIVEN WORKMEDICAL, VISION, DENTAL INSURANCE403(B) PLAN HSA PLANCOMPREHENSIVE BENEFITS PACKAGE\n",
    "job_skill_set": [
      "network administration",
      "data management",
      "project management",
      "risk mitigation strategies",
      "communication",
      "collaboration",
      "leadership",
      "problem solving",
      "independence",
      "creativity",
      "adaptability",
      "self-starter",
      "IT strategy development",
      "server management",
      "cloud computing",
      "cybersecurity",
      "IT service management (ITIL)",
      "data security protocols",
      "passion for mission"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "cloud",
      "collaboration",
      "communication",
      "computing",
      "creativity",
      "cybersecurity",
      "data",
      "development",
      "director",
      "for",
      "independence",
      "information",
      "informationtechnology",
      "it",
      "itil",
      "leadership",
      "management",
      "mission",
      "mitigation",
      "network",
      "of",
      "passion",
      "problem",
      "project",
      "protocols",
      "risk",
      "security",
      "selfstarter",
      "server",
      "service",
      "solving",
      "strategies",
      "strategy",
      "technology"
    ]
  },
  {
    "job_id": "3906074327",
    "job_title": "Portfolio Manager (Lead Information Technology Systems Specialist)",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "ABOUT THIS POSITIONWITH MORE THAN 14,000 EMPLOYEES WORKING ACROSS 41 DEPARTMENTS, THE CITY OF PHOENIX OFFERS OPPORTUNITY FOR CAREER GROWTH AND ADVANCEMENT. WHETHER YOU'RE AN EXPERIENCED PROFESSIONAL OR JUST STARTING YOUR CAREER, WORKING IN PUBLIC SERVICE OFFERS MANY REWARDS! BE A PART OF BUILDING THE PHOENIX OF TOMORROW.\nTHE INFORMATION TECHNOLOGY SERVICES (ITS) DEPARTMENT HAS AN OPENING FOR A PORTFOLIO MANAGER. IN THIS ROLE YOU WILL MANAGE A BUSINESS AREA PORTFOLIO, PROVIDE LEADERSHIP AND COORDINATION WITHIN THE PROJECT MANAGEMENT OFFICE (PMO). YOU WILL PROVIDE OVERSIGHT TO A TEAM OF PROJECT MANAGERS AND BUSINESS ANALYSTS, ENSURING QUALITY DELIVERABLES, ADHERENCE TO PMO PROCESSES, AND THE PROJECT TEAM'S ACHIEVEMENT OF PROJECT GOALS. IN THIS VITAL ROLE YOU WILL ALSO PROVIDE PROJECT MANAGEMENT SUPPORT, OVERSIGHT, AND LEADERSHIP TO FACILITATE ISSUE RESOLUTION AND RISK MITIGATION. \nKEY RESPONSIBILITIES INCLUDE:PORTFOLIO DELIVERABLES, INCLUDING STATUS, FINANCIALS, METRICS, CROSS-PROJECT DEPENDENCIES AND RISKS, AND PORTFOLIO SCHEDULING.ENSURE CLEAR AND EFFECTIVE COMMUNICATION OF PMO ROLES & AND RESPONSIBILITIES, PROCESSES, AND VALUE TO SENIOR MANAGEMENT AND COLLEAGUES.ACTIVELY ENGAGE IN DAY-TO-DAY OPERATIONAL ACTIVITIES WITHIN THE PMO.IDENTIFY AND ADDRESS PROJECT RISKS, ISSUES, AND POTENTIAL SLIPPAGE IN COORDINATION WITH SENIOR MANAGEMENT.ENSURE VISIBILITY AND RESOLUTION OF CORRECTIVE ACTION PLANS FOR \"AT RISK\" PROJECTS.PROVIDE COACHING AND GUIDANCE TO PROJECT MANAGERS AND BUSINESS ANALYSTS.CONDUCT PROJECT AUDITS AND CHECKPOINT ASSESSMENTS TO ENSURE PROPER PROJECT MANAGEMENT.ESTABLISH AND TRACK KPIS, BUDGET, AND OTHER CONSTRAINTS TO DELIVER A HIGH-QUALITY SERVICE.PROVIDE INSIGHTFUL REPORTING TO THE ORGANIZATION AND DEPARTMENTAL LEADERSHIP TEAM.CONTINUOUSLY ASSESS CURRENT PRACTICES AND SYSTEMS, DRIVING PERFORMANCE IMPROVEMENT.EFFECTIVELY CAPTURE AND MANAGE RISKS WITHIN THE ITS PMO FUNCTION, ALIGNED WITH AUDIT AND ORGANIZATIONAL STANDARDS.CONTRIBUTE TO ORGANIZATIONAL LEARNING AND CONTINUOUS IMPROVEMENT.IDENTIFY AND REPORT DEVIATIONS FROM BASELINE, TRIGGERING EXCEPTION REPORTS AND ESCALATIONS WHEN NECESSARY.MANAGE PROJECTS UTILIZING PMO STANDARD PROCESSES AND TOOLS.OTHER RESPONSIBILITIES AS REQUESTED BY LEADERSHIP.\nDEPENDING ON ASSIGNMENT, THIS POSITION MAY BE ELIGIBLE FOR A TELEWORK SCHEDULE AT THE DISCRETION OF THE CHIEF INFORMATION OFFICER. YOU WILL BE REQUIRED TO COME INTO THE OFFICE FOR MEETINGS IN THE PHOENIX METRO AREA OR TO WORK ON-SITE WHEN ASSIGNED. TELEWORK IS SUBJECT TO DEPARTMENT NEED AND COULD CHANGE IN THE FUTURE.\n\nIDEAL CANDIDATEPROVEN EXPERIENCE IN PROJECT MANAGEMENT AND PORTFOLIO MANAGEMENT.EXCELLENT COMMUNICATION AND COLLABORATION SKILLS FOR EFFECTIVE ENGAGEMENT WITH STAKEHOLDERS AND TEAM.PROACTIVE AND DRIVEN TO ENHANCE SERVICES AND DEMONSTRATE VALUE.STRONG ATTENTION TO DETAIL WHILE MAINTAINING A \"BIG PICTURE\" PERSPECTIVE.ABILITY TO INFLUENCE AND DRIVE CHANGE. QUICK PROBLEM-SOLVING ABILITY, WITH THE CAPACITY TO PROPOSE EFFECTIVE SOLUTIONS.PROFICIENCY IN DEFINING NEW OPERATING PROCESSES.\n\nSALARYPAY RANGE: $97,780.80 TO $144,476.80/ANNUALLY.HIRING RANGE: $97,780.80 TO $131,040.00/ANNUALLY.\n\nPAY RANGE EXPLANATION:PAY RANGE IS THE ENTIRE COMPENSATION RANGE FOR THE POSITION CLASSIFICATION.HIRING RANGE IS AN ESTIMATE OF WHERE YOU CAN RECEIVE AN OFFER. THE ACTUAL SALARY OFFER WILL CAREFULLY CONSIDER A WIDE RANGE OF FACTORS, INCLUDING YOUR SKILLS, QUALIFICATIONS, EXPERIENCE, EDUCATION, LICENSES, TRAINING, AND INTERNAL EQUITY.\n\nBENEFITSA COMPREHENSIVE BENEFITS PACKAGE IS OFFERED WHICH INCLUDES:TRADITIONAL PENSION WITH EMPLOYER AND EMPLOYEE CONTRIBUTIONS, CLICK HERE FOR MORE DETAILS: PENSION INFORMATION401(A) AND 457 PLANS WITH EMPLOYER CONTRIBUTIONSCHOICE OF GENEROUS MEDICAL HMO, PPO, OR HSA/HDHP PLANSMEDICAL ENROLLMENT INCLUDES A MONTHLY $150 CITY CONTRIBUTION TO A POST-EMPLOYMENT HEALTH PLANWELLNESS INCENTIVE OF UP TO $720 ANNUALLYDENTAL, VISION, AND LIFE INSURANCE OPTIONSEMPLOYER PAID LONG-TERM DISABILITYFREE BUS/LIGHT RAIL PASSTUITION REIMBURSEMENT PROGRAM UP TO $6,500 PER YEARPAID TIME OFF INCLUDES 13.5 PAID HOLIDAYS, 12 VACATION DAYS, AND 15 SICK DAYS AND PERSONAL LEAVE DAYSPAID PARENTAL LEAVE FOR ELIGIBLE EMPLOYEES UP TO 480 HOURS (12 WEEKS) OF PAID LEAVE FOR THE BIRTH, ADOPTION, OR FOSTER CARE PLACEMENT OF A CHILD DURING A 12-MONTH PERIODFEDERAL STUDENT LOAN FORGIVENESS OFFERED THROUGH SAVIFOR MORE DETAILS, VISIT: UNIT 007 BENEFITS\n\nMINIMUM QUALIFICATIONSTHREE YEARS OF EXPERIENCE DEVELOPING, EVALUATING, USING, AND MAINTAINING TECHNICAL SYSTEM HARDWARE AND SOFTWARE.BACHELOR'S DEGREE IN COMPUTER SCIENCE, MATH OR A RELATED FIELD.OTHER COMBINATIONS OF EXPERIENCE AND EDUCATION THAT MEET THE MINIMUM REQUIREMENTS MAY BE SUBSTITUTED.THE CITY JOB DESCRIPTION CAN BE FOUND HERE.ALL FINALISTS FOR POSITIONS ARE SUBJECT TO A CRIMINAL BACKGROUND CHECK APPLICABLE TO THE DEPARTMENT OR POSITION.FOR INFORMATION REGARDING PRE-SCREENING AND DRIVING POSITIONS, CLICK HERE.\n\nPREFERRED QUALIFICATIONSTHE MINIMUM QUALIFICATIONS LISTED ABOVE, PLUS:FIVE YEARS OF EXPERIENCE DIRECTLY SUPERVISING STAFF.FIVE YEARS OF EXPERIENCE MANAGING A PORTFOLIO OF IT PROJECTS.THREE YEARS OF BUDGETING EXPERIENCE.CURRENT PMI PROJECT MANAGEMENT PROFESSIONAL (PMP) CERTIFICATION.\n\nRECRUITMENT DATESRECRUITMENT CLOSES MAY 2, 2024. ALL MATERIALS MUST BE RECEIVED BY 11:59 P.M. ON THIS DATE.THIS IS A POSITION-BASED RECRUITMENT AND WILL NOT RESULT IN ANY ONGOING ELIGIBILITY LIST. THIS RECRUITMENT AND ANY SELECTION PROCESSES RESULTING FROM THIS RECRUITMENT MAY BE USED TO FILL OTHER RELATED VACANCIES WITHIN THE ORGANIZATION NOW OR IN THE NEAR FUTURE.\n\nHOW TO APPLYAPPLY ONLINE BY COMPLETING THE REQUIRED INFORMATION AND ATTACHING, AS ONE DOCUMENT, YOUR COVER LETTER AND RESUME. PLEASE INCLUDE YOUR EXPERIENCE AS IT RELATES TO THE QUALIFICATIONS STATED ABOVE. ONLY THE HIGHEST QUALIFIED MAY BE POSTED TO THE ELIGIBLE TO HIRE LIST. THE RESULTS OF THE RESUME SCREENING PROCESS WILL BE SENT TO YOUR PRIMARY EMAIL ADDRESS.DURING THE ONLINE APPLICATION PROCESS, YOU WILL PROVIDE RESPONSES TO QUESTIONS REGARDING YOUR EXPERIENCE AND QUALIFICATIONS (THE SYSTEM ALLOWS COPY/PASTING INTO THE ANSWER FIELDS). INFORMATION YOU PROVIDE IN THESE QUESTIONS SHOULD ALIGN TO THE INFORMATION IN YOUR RESUME. INFORMATION NOT CONSISTENT WITH YOUR RESUME MAY NOT BE CONSIDERED WHEN DETERMINING YOUR EDUCATION AND/OR EXPERIENCE LEVEL.\n\nWE ARE HERE TO HELPJOB INTERVIEWS MAY BE HELD BY VIDEO OR AUDIO CONFERENCE.IF YOU ARE IN NEED OF COMPUTER RESOURCES, CLICK HERE FOR FREE OPTIONS.ARIZONA AT WORK HAS FREQUENT CLASSES TO HELP WITH RESUME WRITING, INTERVIEWING SKILLS, AND GENERAL CAREER GUIDANCE. CLICK HERE FOR MORE INFORMATION.EXPLORE OTHER EMPLOYMENT OPPORTUNITIES WITH THE CITY OF PHOENIX.SUBSCRIBE TO RECEIVE E-MAIL NOTIFICATIONS ABOUT NEW EMPLOYMENT OPPORTUNITIES.IF YOU NEED ASSISTANCE APPLYING FOR THIS JOB, PLEASE CONTACT OUR HR CONNECTION CENTER AT (602) 495-5700.\n\nREFERENCELEAD INFO TECH SYSTEMS SPEC, JC:09580, ID# 54134, 4/17/2024, USM, KA, BENEFITS:007.BUILDING THE PHOENIX OF TOMORROW.#DOWORKTHATMAKESPHOENIXWORKCITY OF PHOENIX IS AN EQUAL OPPORTUNITY EMPLOYER. AMERICORPS, PEACE CORPS, AND OTHER NATIONAL SERVICE ALUMNI WHO MEET THE REQUIRED QUALIFICATIONS ARE ENCOURAGED TO APPLY.",
    "job_skill_set": [
      "Communication Tools",
      "Leadership",
      "Collaboration",
      "Problem Solving",
      "Project Management",
      "Portfolio Management",
      "Risk Mitigation",
      "Budgeting",
      "KPI Tracking",
      "Technical Systems Management",
      "PMO Processes",
      "Process Improvement",
      "Project Audits",
      "PMP Certification",
      "Attention to Detail",
      "Influencing",
      "Proactivity",
      "Stakeholder Engagement",
      "Coaching",
      "Continuous Improvement",
      "Big Picture Thinking"
    ],
    "short_keywords": [
      "attention",
      "audits",
      "big",
      "budgeting",
      "certification",
      "coaching",
      "collaboration",
      "communication",
      "continuous",
      "detail",
      "engagement",
      "improvement",
      "influencing",
      "information",
      "informationtechnology",
      "kpi",
      "lead",
      "leadership",
      "management",
      "manager",
      "mitigation",
      "picture",
      "pmo",
      "pmp",
      "portfolio",
      "proactivity",
      "problem",
      "process",
      "processes",
      "project",
      "risk",
      "solving",
      "specialist",
      "stakeholder",
      "systems",
      "technical",
      "technology",
      "thinking",
      "to",
      "tools",
      "tracking"
    ]
  },
  {
    "job_id": "3905219414",
    "job_title": "Information Technology Operations Project Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOB TITLE: IT OPERATIONS PROJECT MANAGERPAY RATE: $75 TO $80 PER HOUR.DURATION: UP TO 6 MONTHS CONTRACTLOCATION: REMOTEESSENTIAL FUNCTIONSMANAGE PROJECTS UNDER THE IT OPS & SVCS PORTFOLIO INCLUDING ENTERPRISE APPLICATIONS, INFORMATION SECURITY, ENDPOINT ENGINEERING, AND NETWORK/SYSTEMS OPERATIONSMANAGE PROCESS IMPROVEMENT PROJECTS FOR IT OPERATIONS INCLUDING DOCUMENTING STANDARD OPERATING PROCEDURES, DEVELOPING CROSS DEPARTMENT PROCEDURES WITH CORPORATE DEPARTMENTS, AND INFRASTRUCTURE CHANGE MANAGEMENT STANDARDSWORK WITH IT MANAGEMENT AND STAKEHOLDERS TO CREATE IT OPERATIONS AND SERVICES PROJECT PLANS WITH CLEAR DEPENDENCIES, RESOURCES ESTIMATES AND TARGET DEADLINESWORK WITH IT TEAMS TO REFINE IT OPERATIONS CHANGE MANAGEMENT PROCESS AND GOVERNANCEEXECUTE PROJECT PLANNING TO MEET DEPARTMENT NEEDS; DOCUMENT AND COMMUNICATE PROJECT STATUSES AND RISKS ACCURATELYCOLLABORATE WITH IT OPERATIONS LEADERSHIP TEAM ON PROJECTSFACILITATE MEETINGS THAT SUPPORT THE IT OPERATIONS AND SERVICES PORTFOLIO MANAGEMENT AND CONTROLSACT AS LIAISON FOR BETWEEN IT OPERATIONS AND PROJECT STAKEHOLDERS IN SOFTWARE DEVELOPMENT AND CORPORATE DEPARTMENTSWORK WITH THIRD PARTIES TO EVALUATE VENDOR CONTRACTS AND FACILITATE ONBOARDING CONTRACTORS FOR PROJECTSFACILITATE ANNUAL PLANNING ACTIVITIES SUPPORTING TECHNOLOGY PRODUCTSDEVELOP BACKLOG AND ROADMAPS BASED ON IT PRIORITIES AND RESOURCE AVAILABILITYWORK WITH IT OPERATIONS TEAMS TO TRANSITION FROM PROJECT CLOSE TO OPERATIONAL SUPPORTSUPPORT IT OPERATIONS AND SERVICES MANAGEMENT TEAM IN BUILDING AND MAINTAINING A SCALABLE IT SUPPORT SYSTEMBUILD RELATIONSHIPS AND WORK CLOSELY WITH IT ANALYSTS, SUPPORT TECHNICIANS, SYSTEM/NETWORK ADMINISTRATOR, IT MANAGEMENT, AND INTERNAL STAKEHOLDERS TO DRIVE CHANGE AND PROCESS IMPROVEMENTPLAN AND OVERSEE THE PREPARATION AND DISSEMINATION OF PROJECT COMMUNICATIONSROLL OUT IT OPERATIONS CHANGE MANAGEMENT PROJECT TEMPLATES AND PROCEDURESRECOMMEND TECHNOLOGY STRATEGIES, POLICIES, AND PROCEDURES IN LINE WITH INDUSTRY STANDARDSMAINTAIN PROFESSIONAL AND TECHNICAL KNOWLEDGE BY ATTENDING EDUCATIONAL WORKSHOPS; REVIEWING PROFESSIONAL PUBLICATIONS; ESTABLISHING PERSONAL NETWORKS; BENCHMARKING STATE-OF-THE-ART PRACTICES; PARTICIPATING IN PROFESSIONAL SOCIETIESQUALIFICATIONSBACHELOR’S DEGREE IN COMPUTER SCIENCE, INFORMATION TECHNOLOGY OR RELATED FIELD7 YEARS’ EXPERIENCE AS AN IT PROFESSIONAL5+ YEARS OF PROJECT MANAGEMENT EXPERIENCE WITH IMPLEMENTATION IN MEDIUM TO LARGE ENVIRONMENTSSOLID IT EXPERIENCE – UNDERSTANDING OF APPLICATION DEVELOPMENT, INFRASTRUCTURE, OPERATIONS AND SUPPORT KNOWLEDGEDEMONSTRATED SKILLS WITH PROJECT MANAGEMENT, CHANGE MANAGEMENT AND RELEASE MANAGEMENTIN DEPTH KNOWLEDGE OF MICROSOFT OFFICE, SHAREPOINT AND AZUREUNDERSTANDING OF SYSTEM AND NETWORK INFRASTRUCTUREEXPERIENCE WITH ENTERPRISE APPLICATIONS, SYSTEMS/NETWORK ADMINISTRATION, AND INFORMATION SECURITYABILITY TO SCHEDULE AND COMMUNICATE TECHNICAL NEEDS INTERNALLY AND EXTERNALLYEQUAL EMPLOYMENT OPPORTUNITY STATEMENT:SUNA SOLUTIONS PROVIDES EQUAL EMPLOYMENT OPPORTUNITIES TO ALL EMPLOYEES AND APPLICANTS FOR EMPLOYMENT AND PROHIBITS DISCRIMINATION AND HARASSMENT OF ANY TYPE WITHOUT REGARD TO RACE, COLOR, RELIGION, AGE, SEX, NATIONAL ORIGIN, DISABILITY STATUS, GENETICS, PROTECTED VETERAN STATUS, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, OR ANY OTHER CHARACTERISTIC PROTECTED BY FEDERAL, STATE, OR LOCAL LAWS.THIS POLICY APPLIES TO ALL TERMS AND CONDITIONS OF EMPLOYMENT, INCLUDING RECRUITING, HIRING, PLACEMENT, PROMOTION, TERMINATION, LAYOFF, RECALL, TRANSFER, LEAVES OF ABSENCE, COMPENSATION, AND TRAINING.APPLICANTS, WITH CRIMINAL HISTORIES, ARE CONSIDERED IN A MANNER THAT IS CONSISTENT WITH LOCAL, STATE, AND FEDERAL LAWS.REQUESTING AN ACCOMODATIONSUNA SOLUTIONS IS COMMITTED TO PROVIDING EQUAL EMPLOYMENT OPPORTUNITIES FOR PERSONS WITH DISABILITIES OR RELIGIOUS OBSERVANCES, INCLUDING REASONABLE ACCOMMODATION WHEN NEEDED. IF YOU ARE HIRED BY SUNA SOLUTIONS AND REQUIRE ACCOMMODATION TO PERFORM THE ESSENTIAL FUNCTIONS OF YOUR ROLE, YOU WILL BE ASKED TO PARTICIPATE IN OUR REASONABLE ACCOMMODATION PROCESS. ACCOMMODATIONS MADE TO FACILITATE THE RECRUITING PROCESS ARE NOT A GUARANTEE OF FUTURE OR CONTINUED ACCOMMODATIONS ONCE HIRED.IF YOU WOULD LIKE TO BE CONSIDERED FOR EMPLOYMENT OPPORTUNITIES WITH SUNA SOLUTIONS AND HAVE ACCOMMODATION NEEDS FOR A DISABILITY OR RELIGIOUS OBSERVANCE, PLEASE CALL US AT 1 (888) 223-4788, SEND US AN EMAIL OR SPEAK WITH YOUR RECRUITER.PAY TRANSPARENCY POLICY STATEMENTCOMPENSATION FOR ROLES AT SUNA SOLUTIONS VARIES DEPENDING ON A WIDE ARRAY OF FACTORS INCLUDING BUT NOT LIMITED TO THE SPECIFIC CLIENT, OFFICE OR REMOTE LOCATION, ROLE, SKILL SET AND LEVEL OF EXPERIENCE. AS REQUIRED BY LOCAL LAW, SUNA SOLUTIONS PROVIDES A REASONABLE PAY SCALE TO INCLUDE THE HOURLY OR SALARY RANGE THAT SUNA SOLUTIONS REASONABLY EXPECTS TO PAY FOR ROLES THAT MAY BE HIRED IN CALIFORNIA, COLORADO, NEW YORK CITY OR WASHINGTON.",
    "job_skill_set": [
      "project management",
      "change management",
      "release management",
      "Microsoft Office",
      "SharePoint",
      "information security",
      "enterprise applications",
      "network infrastructure",
      "process improvement",
      "documentation",
      "communication",
      "collaboration",
      "relationship building",
      "problem solving",
      "leadership",
      "organizational skills",
      "stakeholder management",
      "planning",
      "Azure",
      "system administration"
    ],
    "short_keywords": [
      "administration",
      "applications",
      "azure",
      "building",
      "change",
      "collaboration",
      "communication",
      "documentation",
      "enterprise",
      "improvement",
      "information",
      "informationtechnology",
      "infrastructure",
      "leadership",
      "management",
      "manager",
      "microsoft",
      "network",
      "office",
      "operations",
      "organizational",
      "planning",
      "problem",
      "process",
      "project",
      "relationship",
      "release",
      "security",
      "sharepoint",
      "skills",
      "solving",
      "stakeholder",
      "system",
      "technology"
    ]
  },
  {
    "job_id": "3905887086",
    "job_title": "Information Technology Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "TITLE: IT SPECIALIST - WORKSTATION SUPPORT DURATION: 12 MONTHSLOCATION: COLUMBIA, SCPAY RATE STARTS: $20 PER HR\n\nREQUIRED EDUCATION: ASSOCIATE DEGREE IN COMPUTER SCIENCE, INFORMATION TECHNOLOGY, OR OTHER JOB-RELATED FIELD. OR 2 YEARS OF JOB-RELATED WORK EXPERIENCE. \nREQUIRED WORK EXPERIENCE: 2 YEARS OF TECHNICAL OPERATIONS SUPPORT EXPERIENCE. \nLINE OF BUSINESS: WORKSTATION SUPPORT CENTRAL DEPLOYMENT \nREQUIRED TECHNOLOGIES: TEAMS, EXCEL, OFFICE, & WINDOWS \nDAY TO DAY: THIS POSITION COULD BE BUILDING, BACKING UP DATA, INSTALLING SOFTWARE, AND DEPLOYING NEW WORKSTATIONS TO USERS IN OUR ENVIRONMENT. \nSOFT SKILLS: CUSTOMER SERVICE AND COMMUNICATION ARE THE BIGGEST SKILLS NEEDED IN THIS ROLE SINCE WE DIRECTLY WORK WITH KEEPING USERS PRODUCTIVE. \nTHE TEAM: WE HAVE A SUB-TEAM OF 15 MEMBERS OF THE GREATER TEAM OF 70 FOR ALL OF WORKSTATION SUPPORT. WE HAVE MANY TENURED TECHS SOME WITH OVER 10 YEARS AT CLINET AND THAT SHOWS OUR PEOPLE ENJOY THIS COMPANY, ENVIRONMENT, AND THE WORK WE DO.\nDUTIES: RESPONSIBLE FOR CONFIGURING, INSTALLING, AND MAINTAINING DESKTOP SOFTWARE AND HARDWARE. PROVIDES TECHNICAL SUPPORT AND GUIDANCE TO USERS. •55% MONITORS/UPDATES DISPATCH SYSTEM AND WORKS INCOMING TICKETS AS ASSIGNED. PROVIDES TROUBLESHOOTING, TECHNICAL SUPPORT AND DEVELOPMENT OF END-USER GUIDELINES. CONFIGURES, INSTALLS, MONITORS, AND MAINTAINS IT USERS’ WORKSTATION SOFTWARE AND HARDWARE. ENSURES PROPER BACKING UP OF DATA FROM USER WORKSTATIONS AND THAT TOOLS AND EQUIPMENT ARE LICENSED AND APPROVED BY IS PURCHASING. ENSURES PROPER CONFIGURATION AND ADHERENCE TO SECURITY CONFIGURATIONS AND SETTINGS. •10% TESTS, TROUBLESHOOTS, MAINTAINS, MODIFIES, VALIDATES AND DOCUMENTS APPLICATION PACKAGES. •10% DOCUMENTS CONFIGURATIONS AND STANDARDS SO THAT COLLEAGUES CAN REFERENCE SIMILAR ISSUES AND IMPROVE RESOLUTION TIME. ASSISTS OTHER DEPARTMENTS AS NEEDED TO RESOLVE ISSUES. •20% MAY PERFORM ADMINISTRATIVE TASK SUCH AS REPORTING, ORDERING REPLACEMENT PARTS, AND TRACKING STATUS/INVENTORY OF ITEMS. •5% KEEPS APPRISED OF NEW TECHNOLOGIES RELATED TO WORKSTATION SUPPORT PROCEDURES.",
    "job_skill_set": [
      "Technical Operations Support",
      "Data Backup",
      "Software Installation",
      "Workstation Deployment",
      "Windows OS",
      "Troubleshooting",
      "Configuration Management",
      "Customer Service",
      "Communication",
      "Team Collaboration",
      "Problem Solving",
      "Adaptability",
      "Microsoft Teams",
      "Microsoft Excel",
      "Microsoft Office",
      "Documentation"
    ],
    "short_keywords": [
      "adaptability",
      "backup",
      "collaboration",
      "communication",
      "configuration",
      "customer",
      "data",
      "deployment",
      "documentation",
      "excel",
      "information",
      "informationtechnology",
      "installation",
      "management",
      "microsoft",
      "office",
      "operations",
      "os",
      "problem",
      "service",
      "software",
      "solving",
      "specialist",
      "support",
      "team",
      "teams",
      "technical",
      "technology",
      "troubleshooting",
      "windows",
      "workstation"
    ]
  },
  {
    "job_id": "3889129366",
    "job_title": "Director, Information Technology - Washington DC",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "COMPANY: \n\nCOGENT COMMUNICATIONS IS A MULTINATIONAL, TIER 1 FACILITIES-BASED ISP, CONSISTENTLY RANKED AS ONE OF THE TOP FIVE NETWORKS IN THE WORLD AND IS PUBLICLY TRADED ON THE NASDAQ STOCK MARKET UNDER THE TICKER SYMBOL CCOI. COGENT SPECIALIZES IN PROVIDING BUSINESSES WITH HIGH SPEED INTERNET ACCESS AND POINT-TO-POINT TRANSPORT SERVICES. COGENT FACILITIES-BASED, ALL-OPTICAL IP NETWORK BACKBONE PROVIDES IP SERVICES IN OVER 219 MARKETS GLOBALLY. SINCE ITS INCEPTION, COGENT HAS UNLEASHED THE BENEFITS OF IP TECHNOLOGY, BUILDING ONE OF THE LARGEST AND HIGHEST CAPACITY IP NETWORKS IN THE WORLD. THIS NETWORK ENABLES COGENT TO OFFER LARGE BANDWIDTH CONNECTIONS AT HIGHLY COMPETITIVE PRICES. COGENT ALSO OFFERS SUPERIOR CUSTOMER SUPPORT BY VIRTUE OF ITS END-TO-END CONTROL OF SERVICE DELIVERY AND NETWORK MONITORING. A COMPETITIVE BASE SALARY AND A FULL BENEFITS PACKAGE INCLUDING; HEALTH, DENTAL, VISION, PAID TIME OFF ( PTO), SHORT- AND LONG-TERM DISABILITY, LIFE INSURANCE, HOLIDAYS, PARENTAL LEAVE, 401 ( K) PLAN WITH EMPLOYER MATCH, STOCK OPTIONS, AND AN EMPLOYEE ASSISTANCE PROGRAM. MOST BENEFITS TAKE EFFECT WITHIN 30 DAYS OF EMPLOYMENT, AND SOME REQUIRE A WAITING PERIOD.\n\n JOB SUMMARY: \n\nTHE DIRECTOR OF INFORMATION TECHNOLOGY WILL POSSESS TECHNICAL EXPERTISE AND PROVIDE STRATEGIC LEADERSHIP, VISION, PLANNING, AND MANAGEMENT TO ALL AREAS OF CORPORATE IT. THE DIRECTOR WILL DEVELOP AND OVERSEE COMPANY-WIDE TECHNOLOGY POLICIES, PROCEDURES, SERVICES, AND FACILITIES. THE DIRECTOR WILL WORK COLLABORATIVELY WITH THE CIO AND OTHER LEADERSHIP TO DEVELOP EFFECTIVE STRATEGIES FOR INTEGRATING AND ADVANCING OUR TECHNOLOGY.\n\nTHE SUCCESSFUL CANDIDATE WILL BE A HANDS-ON MANAGER, LEADER AND MENTOR. CANDIDATE MUST HAVE THE ABILITY TO DEVELOP AND LEAD STRATEGIC AND OPERATIONAL INITIATIVES AND WILL POSSESS EXCEPTIONAL COMMUNICATION, COLLABORATION, PROJECT MANAGEMENT AND CUSTOMER SERVICE SKILLS.\n\n ESSENTIAL DUTIES AND RESPONSIBILITIES: \n\n DEVELOPS OVERALL TECHNOLOGY ROADMAP AND PLANS, FORMULATES, SETS AND IMPLEMENTS POLICES FOR CURRENT AND FUTURE INFORMATION/COMMUNICATION/ TELECOMMUNICATIONS SYSTEMS AND ACTIVITIES  ANALYZES IT INFRASTRUCTURE AND SYSTEMS PERFORMANCE TO ASSESS OPERATING COSTS, PRODUCTIVITY LEVELS, UPGRADE REQUIREMENTS, AND OTHER METRICS AND NEEDS.  MANAGES IT STAFF INCLUDING RECRUITMENT, PERFORMANCE MANAGEMENT AND EVALUATIONS, AND PROFESSIONAL DEVELOPMENT  PREPARES, SUBMITS, AND MANAGES OPERATING AND CAPITAL EXPENDITURES FOR TECHNOLOGY NEEDED TO SUPPORT THE ORGANIZATIONS TECHNOLOGY PROJECTS  OVERSEES THE PURCHASE, INSTALLATION, AND MAINTENANCE OF COMPUTER HARDWARE, SOFTWARE, NETWORKS, TELECOMMUNICATION EQUIPMENT ON PREMISES AND THE CLOUD ENVIRONMENT  COLLABORATES WITH DIRECTOR OF IS ON DEVELOPMENT, STAGING AND PRODUCTION PLATFORMS  COLLABORATES WITH CYBERSECURITY TEAM ON RISK ASSESSMENT, RESPONSE AND REMEDIATION  PROVIDES WEEKLY UPDATES AND STRATEGIES ON ALL PROJECTS TO CIO AND CEO  PERFORM REVIEWS AND UPDATES, PROMOTE AND ENSURE POLICY AWARENESS, TRACK EXCEPTIONS, AND PERFORM TESTING / AUDITING / MONITORING ON POLICY COMPLIANCE.  KEEPS ABREAST OF NEW KNOWLEDGE, RESEARCH, PRODUCTS, AND SERVICES IN TECHNOLOGY THAT WILL BENEFIT THE ORGANIZATION. \n\n QUALIFICATIONS: \n\n COMPUTER SCIENCE OR RELATED BACHELOR’S DEGREE AND 10+ YEARS OF RELEVANT IT EXPERIENCE  MINIMUM 5 YEARS OF LEADING IT TEAMS AND HANDS-ON TECHNICAL OPERATIONS  PRIOR EXPERIENCE IN A HANDS-ON TECHNICAL ROLE OF SYSTEMS, NETWORK, STORAGE AND DATABASE ADMINISTRATION  STRONG EXPERIENCE IN WINDOWS AND UNIX OPERATING SYSTEMS  EXPERIENCE WITH VMWARE AND NETAPP A PLUS  IMPLEMENTATION AND PROJECT MANAGEMENT OF LARGE-SCALE TECHNOLOGY IMPLEMENTATIONS  DETERMINE SKILLS OF CURRENT STAFF ALIGN RESOURCES FOR BEST FIT/FUTURE STATE, STAFF DEVELOPMENT/MENTORSHIP  MANAGE VENDOR RELATIONSHIPS AND NEGOTIATIONS  ESTABLISHING AND MAINTAINING ACCOUNTABILITY AND ADAPTABILITY  EXCELLENT COMMUNICATION AND ORGANIZATION SKILLS  ABILITY TO WRITE AND PRESENT FORMAL DOCUMENTATION \n\n PHYSICAL REQUIREMENTS: \n\n REMAINS IN A SITTING/STATIONARY POSITION CONTINUALLY OR ALMOST CONTINUALLY DURING THE WORK DAY  OPERATES A COMPUTER AND PERFORMS DESK-BASED COMPUTER TASKS CONTINUALLY; FREQUENTLY VIEWING A COMPUTER SCREEN  RARELY LIFTING, CARRYING, PUSHING, PULLING OBJECTS AND/OR EQUIPMENT THAT WEIGHS UP TO 50 POUNDS \n\n COVID-19 POLICY: \n\nCOGENT HAS ADOPTED A MANDATORY VACCINATION AND BOOSTER POLICY WHICH REQUIRES ALL U.S. EMPLOYEES TO BE FULLY VACCINATED ( INCLUDING BOOSTER SHOTS WHEN ELIGIBLE) AGAINST COVID-19. PRIOR TO BEGINNING EMPLOYMENT, NEW EMPLOYEES MUST PROVIDE PROOF OF VACCINATION OR APPLY FOR AND RECEIVE AN ACCOMMODATION TO BE EXEMPT FROM THE POLICY.\n\nBY SUBMITTING AN APPLICATION OR RESUME FOR THIS POSITION, I UNDERSTAND THAT IS AN IN-OFFICE POSITION AND AGREE TO ABIDE COGENT MANDATORY VACCINATION POLICY.\n\nTO APPLY FOR THE DIRECTOR, INFORMATION TECHNOLOGY POSITION, PLEASE SUBMIT YOUR RESUME AND COVER LETTER TO CAREERS@COGENTCO.COM.\n\nCOGENT COMMUNICATIONS IS AN EQUAL OPPORTUNITY EMPLOYER.\n\n",
    "job_skill_set": [
      "IT Management",
      "Project Management",
      "Technical Operations",
      "Windows Operating System",
      "UNIX Operating System",
      "Database Administration",
      "Policy Development",
      "IT Infrastructure Analysis",
      "Leadership",
      "Communication",
      "Collaboration",
      "Customer Service",
      "Mentorship",
      "Adaptability",
      "Organization",
      "Strategic Planning",
      "Problem Solving",
      "VMware",
      "NetApp",
      "Telecommunications Systems",
      "Cybersecurity",
      "Vendor Management",
      "Budget Management"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "analysis",
      "budget",
      "collaboration",
      "communication",
      "customer",
      "cybersecurity",
      "database",
      "dc",
      "development",
      "director",
      "information",
      "informationtechnology",
      "infrastructure",
      "it",
      "leadership",
      "management",
      "mentorship",
      "netapp",
      "operating",
      "operations",
      "organization",
      "planning",
      "policy",
      "problem",
      "project",
      "service",
      "solving",
      "strategic",
      "system",
      "systems",
      "technical",
      "technology",
      "telecommunications",
      "unix",
      "vendor",
      "vmware",
      "washington",
      "windows"
    ]
  },
  {
    "job_id": "3901377516",
    "job_title": "Information Technology Sourcing Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "THE IT SOURCING MANAGER NEGOTIATES WITH SUPPLIERS TO OBTAIN GOODS AND SERVICES AT THE BEST PRICES. THEY DEVELOP STRATEGIES FOR COST REDUCTION, SUPPLIER CONSOLIDATION, QUALITY IMPROVEMENTS AND PROCESS EFFICIENCIES TO SAVE COSTS AND MAXIMIZE PROFITABILITY. THIS ROLE IS CRUCIAL FOR DAILY OPERATIONS AT CONSUMERS ENERGY. COMPLETE IT [SOFTWARE, SERVICES, TELECOM, CYBER, HARDWARE] NON-STRATEGIC SERVICE AND MATERIAL (EQUIPMENT) PURCHASE REQUESTS BY VERIFYING SPECIFICATIONS AND/OR SCOPE OF WORK; DETERMINING IF A REQUEST FOR INFORMATION (RFI), REQUEST FOR PROPOSAL (RFP) OR REQUEST FOR QUOTE (RFQ) IS NEEDED; ADMINISTER THE (RFI, RFP OR RFQ); NEGOTIATE COST EFFECTIVE AGREEMENTS WITH KEY SUPPLIERS BASED ON OUR CORE VALUES OF PROCUREMENT SAFETY/QUALITY/COST/DELIVERY/MORALE. THE SOURCING MANAGER COLLABORATES WITH INTERNAL STAKEHOLDERS, SUPPLIERS, AND LEGAL COUNCIL TO NEGOTIATE FAVORABLE CONTRACTUAL TERMS AND MANAGE CONTRACTS. THEY WORK WITH SUPPLIER QUALITY AND PERFORMANCE, STRATEGIC SOURCING, AND BUSINESS PARTNERS TO DEVELOP SUPPLIERS, REDUCE COSTS, AND IMPROVE EFFECTIVENESS. THEY ALSO MANAGE RELATIONSHIPS WITH KEY STAKEHOLDERS AND ENSURE COMPLIANCE IN PROCUREMENT TRANSACTIONS. THE SOURCING MANAGER USES APPROPRIATE VERIFICATION TECHNIQUES TO IDENTIFY COST-SAVING OPPORTUNITIES AND SUPPORTS CONTINUOUS IMPROVEMENT GOALS. SKILLS:  PREVIOUS EXPERIENCE IN AN INFORMATION TECHNOLOGY SUPPORT ROLE.KNOWLEDGE OF BUSINESS LAW, COMMERCIAL TERMS AND CONDITIONS, AND RELATED LEGAL ISSUES. NEGOTIATIONS AND COMPETITIVE PROCESS ENGAGEMENT RECOGNIZING TCO. IT CONTRACT DEVELOPMENT AND MANAGEMENT. EXPERIENCE IN SUPPLY CHAIN INCLUDING 2+ YEARS INFORMATION TECHNOLOGY SERVICES/SOURCING, RFX END TO END WITH A FOCUS ON SAAS, PAAS AND IAAS CONTRACTING.ABILITY TO PROVIDE GUIDANCE TO DEVELOP AND EVOLVE SOURCING MANAGEMENT PROCESSES, DEVELOP METRICS, AND ENGAGE SUPPLIERS ON OPERATIONAL, STRATEGIC, AND FINANCIAL ISSUES. THE SOURCING MANAGER IS KNOWLEDGEABLE ABOUT PROCUREMENT PROCESSES AND ESCALATION MECHANISMS. DEMONSTRATE ADVANCED ABILITY TO INFLUENCE STAKEHOLDERS, DELIVER CUSTOMER SERVICE, AND RESOLVE ISSUES EFFECTIVELY AND EFFICIENTLY. CREATING, ANALYZING, ALIGNING, AND EDITING INFORMATION TECHNOLOGY CONTRACTS INCLUDING SUPPLIER PAPER. EXCELS IN CRITICAL THOUGHT DISCIPLINE- FACT BASED MEASURES AND OBSERVATIONS RELATED TO PRODUCTION OF RATIONAL EVALUATIONS/PROPOSALS.KNOWLEDGE AND UNDERSTANDING OF THE COMPLETE PROCUREMENT CYCLE, INCLUDING EXPERIENCE COMPLETING REQUEST FOR QUOTE (RFQ) AND REQUEST FOR PROPOSAL (RFP) PACKAGES. ABILITY TO ANALYZE FLAT FILES, DATA, SCOPE AND STATEMENTS OF WORK (SOW) TO UNDERSTAND KEY REQUIREMENTS TO CREATE, ALIGN, AND EDIT SOURCING PACKAGES AND CONTRACTS. EXCELLENT COMMUNICATION, BOTH WRITTEN AND VERBAL, SUPPLIER MANAGEMENT, NEGOTIATION, AND ANALYTICAL SKILLSETS. PROVEN EXPERIENCE CREATING, ANALYZING, NEGOTIATING AND EDITING CONTRACTS WITH COMPANY STANDARDS AND REFLECTIVE OF BUSINESS PARTNER INTERESTS. PROFICIENCY WITH MS OFFICE SUITE INCLUDING ADVANCED EXCEL, POWERBI, SERVICE NOW, AND SAP.  EDUCATION:BACHELOR'S DEGREE MAY BE ACCEPTABLE IF ACCOMPANIED BY 4-7 YEARS OF RELEVANT COMPANY OR INDUSTRY EXPERIENCE IN POSITIONS THAT DEMONSTRATE REQUIRED ABILITIES AND PERFORMANCE.SKILLS NEEDED INCLUDE KNOWLEDGE OF PURCHASING AND PROJECT MANAGEMENT SOFTWARE, ABILITY TO IDENTIFY OUTCOMES AND HANDLE DIFFICULT SITUATIONS, TENACITY AND INITIATIVE, AND DEMONSTRATED ABILITY TO ANALYZE DATA AND IDENTIFY KEY ISSUES.\nSFT: THIS POSITION WILL BE HYBRID, M/T/TH WITH THE OPPORTUNITY TO REPORT TO THE CLOSEST SERVICE CENTER. DUR: 24 MONTHS",
    "job_skill_set": [
      "procurement processes",
      "data analysis",
      "MS Office Suite",
      "Service Now",
      "project management software",
      "communication",
      "stakeholder management",
      "problem solving",
      "customer service",
      "critical thinking",
      "initiative",
      "team collaboration",
      "negotiation",
      "contract management",
      "supply chain management",
      "Power BI",
      "SAP",
      "IT sourcing",
      "RFX process",
      "SaaS",
      "PaaS",
      "IaaS",
      "business law",
      "tenacity"
    ],
    "short_keywords": [
      "analysis",
      "bi",
      "business",
      "chain",
      "collaboration",
      "communication",
      "contract",
      "critical",
      "customer",
      "data",
      "iaas",
      "information",
      "informationtechnology",
      "initiative",
      "it",
      "law",
      "management",
      "manager",
      "ms",
      "negotiation",
      "now",
      "office",
      "paas",
      "power",
      "problem",
      "process",
      "processes",
      "procurement",
      "project",
      "rfx",
      "saas",
      "sap",
      "service",
      "software",
      "solving",
      "sourcing",
      "stakeholder",
      "suite",
      "supply",
      "team",
      "technology",
      "tenacity",
      "thinking"
    ]
  },
  {
    "job_id": "3905202045",
    "job_title": "Information Technology Support Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "OVERVIEW OF KRAPF GROUP: KRAPF GROUP VISION: PROVIDE THE BEST PASSENGER TRANSPORTATION ANYTIME, ANYWHERE. KRAPF IS SERIOUS ABOUT SERVICE AND SAFETY. WE ARE ONE OF THE LARGEST PRIVATE, FAMILY-OWNED SCHOOL BUS CONTRACTORS IN THE U.S. IN ADDITION, KRAPF HAS TRANSIT, PARATRANSIT AND CHARTER LINES OF BUSINESS. FOUNDED IN 1942 WITH TWO EMPLOYEES, KRAPF HAS GROWN TO THOUSANDS OF EMPLOYEES IN MULTIPLE STATES. KRAPF CORPORATE HEADQUARTERS IS LOCATED IN WEST CHESTER, PENNSYLVANIA.\nEXPECTATIONS:· SUPPORT KRAPF VISION AND MISSION IN ALL ACTIVITIES· DEMONSTRATE KRAPF CORE VALUES OF COMMITMENT, OPEN COMMUNICATION, RESPECT AND EXCELLENT SERVICE· REPRESENT KRAPF IN A PROFESSIONAL, BUSINESS-LIKE MANNER· COMPLY WITH ALL KRAPF EMPLOYEE AND SAFETY POLICIES\nPOSITION SUMMARY:THIS POSITION WILL SUPPORT THE IT MANAGER IN THE DAY-TO-DAY IT OPERATIONS ACROSS ALL OF THE BUSINESS UNITS. THIS INDIVIDUAL WILL ASSIST IN MAINTAINING ALL IT INFRASTRUCTURE INCLUDING DESKTOPS, SERVERS, PRINTERS AND NETWORK EQUIPMENT. THIS PERSON WILL BE RESPONSIBLE FOR PROVIDING SUPPORT TO END-USERS ON HARDWARE, SOFTWARE AND NETWORK RELATED PROBLEMS.\nESSENTIAL DUTIES & RESPONSIBILITIES:· ACT AS THE FIRST POINT OF CONTACT FOR END-USERS SEEKING TECHNICAL ASSISTANCE VIA PHONE, EMAIL, OR IN-PERSON.· PROVIDE PROMPT AND COURTEOUS TECHNICAL SUPPORT TO RESOLVE HARDWARE, SOFTWARE, AND NETWORK-RELATED ISSUES.· LOG ALL SUPPORT REQUESTS, INCIDENTS, AND SERVICE REQUESTS IN A TICKETING SYSTEM.· DIAGNOSE AND TROUBLESHOOT TECHNICAL ISSUES, IDENTIFYING ROOT CAUSES AND PROVIDING EFFECTIVE SOLUTIONS.· ESCALATE COMPLEX ISSUES TO APPROPRIATE IT TEAM MEMBERS WHEN NECESSARY AND FOLLOW UP ON RESOLUTIONS.· INSTALL, CONFIGURE, AND MAINTAIN COMPUTER HARDWARE, OPERATING SYSTEMS, AND SOFTWARE APPLICATIONS.· PERFORM ROUTINE MAINTENANCE AND UPDATES ON DESKTOPS, LAPTOPS, AND PERIPHERAL DEVICES.· TROUBLESHOOT AND RESOLVE HARDWARE AND SOFTWARE ISSUES ON END-USER SYSTEMS.· SET UP AND CONFIGURE NEW WORKSTATIONS, ENSURING THEY MEET ORGANIZATIONAL STANDARDS.· PROVIDE USER TRAINING AND DOCUMENTATION FOR COMMON DESKTOP PROCEDURES AND APPLICATIONS.· OFFER USER TRAINING AND GUIDANCE ON THE PROPER USE OF HARDWARE AND SOFTWARE.· ASSIST WITH USER ACCOUNT MANAGEMENT, PASSWORD RESETS, AND ACCESS PERMISSIONS.· EDUCATE END-USERS ON BEST PRACTICES FOR DATA SECURITY AND COMPLIANCE.· MAINTAIN A HIGH LEVEL OF PROFESSIONALISM AND PATIENCE WHEN DEALING WITH USERS, PROVIDING EXCEPTIONAL CUSTOMER SERVICE.· CREATE AND MAINTAIN DETAILED DOCUMENTATION OF TECHNICAL PROCEDURES AND ISSUE RESOLUTIONS.· SHARE KNOWLEDGE WITH TEAM MEMBERS TO ENHANCE THE OVERALL EFFICIENCY OF IT SUPPORT OPERATIONS.· MONITOR AND MANAGE HARDWARE AND SOFTWARE INVENTORY TO ENSURE OPTIMAL ASSET TRACKING AND ALLOCATION.· COLLABORATE WITH PROCUREMENT TO ORDER AND MANAGE IT EQUIPMENT.· OCCASIONAL AFTER-HOURS SUPPORT AND ON-CALL DUTIES MAY BE REQUIRED.· WILLINGNESS TO TRAVEL TO REMOTE LOCATIONS AS NEEDED. DIRECT REPORTS:· NONE QUALIFICATIONS: · PROVEN EXPERIENCE IN A HELP DESK AND DESKTOP SUPPORT ROLE.· PROFICIENCY IN WINDOWS OPERATING SYSTEMS.· STRONG KNOWLEDGE OF COMMON BUSINESS APPLICATIONS AND PRODUCTIVITY TOOLS.· EXCELLENT TROUBLESHOOTING AND PROBLEM-SOLVING SKILLS.· STRONG CUSTOMER SERVICE ORIENTATION AND COMMUNICATION SKILLS.· FAMILIARITY WITH IT TICKETING SYSTEMS.· CERTIFICATIONS SUCH AS COMPTIA A+, COMPTIA NETWORK+, OR MICROSOFT CERTIFIED DESKTOP SUPPORT TECHNICIAN (MCDST) ARE A PLUS.· ABILITY TO WORK INDEPENDENTLY AND COLLABORATIVELY WITHIN A TEAM.· SELF-STARTED AND ABLE TO TAKE A TASK AND RUN WITH IT TO COMPLETION.  EDUCATION:· BACHELOR'S DEGREE IN INFORMATION TECHNOLOGY OR A RELATED FIELD IS PREFERRED, BUT NOT REQUIRED.\n\nPHYSICAL REQUIREMENTS:· ABLE TO LIFT 50 LBS. OR MORE\nSAFETY SENSITIVE STATUS:THIS JOB IS CONSIDERED SAFETY-SENSITIVE AND WILL BE SUBJECT TO RANDOM SUBSTANCE, DRUG AND ALCOHOL TESTING.",
    "job_skill_set": [
      "Troubleshooting",
      "Software Installation and Configuration",
      "Network Equipment Maintenance",
      "Data Security Best Practices",
      "Communication Skills",
      "Problem Solving",
      "Team Collaboration",
      "Windows Operating Systems",
      "Help Desk Support",
      "Desktop Support",
      "IT Ticketing Systems",
      "Computer Hardware Installation",
      "Documentation of Technical Procedures",
      "User Account Management",
      "Common Business Applications",
      "Productivity Tools",
      "CompTIA A+",
      "CompTIA Network+",
      "Microsoft Certified Desktop Support Technician (MCDST)",
      "Customer Service Orientation",
      "Professionalism",
      "Patience",
      "Self-Starter",
      "Willingness to Travel"
    ],
    "short_keywords": [
      "a",
      "account",
      "and",
      "applications",
      "best",
      "business",
      "certified",
      "collaboration",
      "common",
      "communication",
      "comptia",
      "computer",
      "configuration",
      "customer",
      "data",
      "desk",
      "desktop",
      "documentation",
      "equipment",
      "hardware",
      "help",
      "information",
      "informationtechnology",
      "installation",
      "it",
      "maintenance",
      "management",
      "mcdst",
      "microsoft",
      "network",
      "of",
      "operating",
      "orientation",
      "patience",
      "practices",
      "problem",
      "procedures",
      "productivity",
      "professionalism",
      "security",
      "selfstarter",
      "service",
      "skills",
      "software",
      "solving",
      "specialist",
      "support",
      "systems",
      "team",
      "technical",
      "technician",
      "technology",
      "ticketing",
      "to",
      "tools",
      "travel",
      "troubleshooting",
      "user",
      "willingness",
      "windows"
    ]
  },
  {
    "job_id": "3899531088",
    "job_title": "Information Technology Operations Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "IT OPERATIONS MANAGERNASHVILLE, TN UP TO $80K\nBELL & ASSOCIATES HAS BEEN ENGAGED TO SEARCH FOR AN IT OPERATIONS MANAGER FOR OUR CLIENT! THIS ROLE IS OPEN DUE TO GROWTH, WILL BE ONSITE IN NASHVILLE AND THIS POSITION WILL CONTRIBUTE TO THE COMPANY'S STRATEGIC GOALS BY DELIVERING TOP-NOTCH SERVICE AND SUPPORT IN LINE WITH ITS VISION, MISSION, PURPOSE, AND VALUES.\nRESPONSIBILITIES:ADVISE AND SUPPORT THE ORGANIZATION ON IT SOLUTIONS TO ENHANCE GROWTH AND EFFICIENCY.MANAGE PROJECTS FROM CONCEPTION TO COMPLETION, ENSURING OPTIMAL RESOURCE ALLOCATION.OVERSEE IT STAFF PERFORMANCE, INCLUDING RECRUITMENT, TRAINING, AND ENFORCING POLICIES.ANALYZE USER NEEDS AND PROPOSE TECHNICAL SOLUTIONS.MANAGE VENDOR RELATIONSHIPS AND STAY UPDATED ON IT BEST PRACTICES.ACT AS A LIAISON BETWEEN USERS, OPERATIONS, AND IT.HANDLE ADMINISTRATIVE TASKS RELATED TO DEPARTMENT BILLING, BUDGETS, AND SECURITY COMPLIANCE.DESIGN AND IMPLEMENT SECURE IT SOLUTIONS ALIGNED WITH COMPANY REQUIREMENTS.DEVELOP SECURITY STANDARDS AND PROCEDURES.PERFORM OTHER DUTIES AS ASSIGNED BY THE CIO.\nPOSITION REQUIREMENTS:BACHELOR'S DEGREE IN A RELATED FIELD OR EQUIVALENT EXPERIENCE.MINIMUM OF FIVE YEARS OF IT MANAGEMENT EXPERIENCE IN A MULTI-LOCATION ENVIRONMENT.PROFICIENCY IN OFFICE AND REPORTING APPLICATIONS.STRONG INTERPERSONAL, ORGANIZATIONAL, AND TIME MANAGEMENT SKILLS.LEADERSHIP, DECISION-MAKING, ANALYTICAL, AND PROBLEM-SOLVING ABILITIES.ABILITY TO WORK UNDER PRESSURE AND WITHIN DEADLINES.",
    "job_skill_set": [
      "IT management",
      "project management",
      "vendor management",
      "security compliance",
      "resource allocation",
      "IT solutions design",
      "budget management",
      "leadership",
      "decision-making",
      "analytical skills",
      "problem-solving",
      "interpersonal skills",
      "organizational skills",
      "time management",
      "ability to work under pressure",
      "technical analysis",
      "reporting applications"
    ],
    "short_keywords": [
      "ability",
      "allocation",
      "analysis",
      "analytical",
      "applications",
      "budget",
      "compliance",
      "decisionmaking",
      "design",
      "information",
      "informationtechnology",
      "interpersonal",
      "it",
      "leadership",
      "management",
      "manager",
      "operations",
      "organizational",
      "pressure",
      "problemsolving",
      "project",
      "reporting",
      "resource",
      "security",
      "skills",
      "solutions",
      "technical",
      "technology",
      "time",
      "to",
      "under",
      "vendor",
      "work"
    ]
  }
]