[
  {
    "job_id": "3901389720",
    "job_title": "Finance Manager",
    "category": "FINANCE",
    "job_description": "FINANCE MANAGERWINDINGS, INC.NEW ULM, MN\nIF YOU ARE INTERESTED IN BECOMING AN EMPLOYEE OWNER, READ ON...\nWINDINGS INC. THRIVES ON THE STRENGTH OF OUR EMPLOYEE OWNERSHIP. AS A 100% EMPLOYEE-OWNED COMPANY, OUR DEDICATED AND INNOVATIVE WORKFORCE SERVES CRITICAL INDUSTRIES LIKE AEROSPACE, DEFENSE, AUTOMOTIVE, MEDICAL, OIL & GAS, AND MORE. SINCE TRANSITIONING TO AN EMPLOYEE STOCK OWNERSHIP PLAN (ESOP) IN 1998, EVERY ONE OF OUR 150+ EMPLOYEES IS AN OWNER OR ON THE PATH TO BECOMING ONE.\nJOIN OUR TEAM AND ENJOY UNIQUE ESOP BENEFITS. WE AIM TO CONTRIBUTE AN AVERAGE OF 10-12% OF YOUR YEARLY EARNINGS TO YOUR ESOP ACCOUNT, ALLOWING YOUR RETIREMENT SAVINGS TO GROW THROUGH COMPOUND INTEREST WITHOUT ANY OUT-OF-POCKET EXPENSE. YOUR SUCCESS IS OUR SUCCESS, AND WE'RE EXCITED TO SHARE IT WITH YOU! ANOTHER WAY THAT WE SHARE WITH OUR EMPLOYEE OWNERS IS THROUGH OUR QUARTERLY PRODUCTION BONUSES PROGRAM. OUR SALARY AND COMPENSATION PACKAGE ARE HARD TO BEAT.\nWITH OUR ESOP, FORWARD-THINKING APPROACH, AND UNWAVERING COMMITMENT TO OUR EMPLOYEES AND CUSTOMERS, WE'VE ESTABLISHED OURSELVES AS INDUSTRY LEADERS AND COMMUNITY CONTRIBUTORS. OUR REMARKABLE TEAMS EMBODY OUR PURPOSE: \"POWERING SYSTEMS AND EMPOWERING LIVES.\"\nWHAT YOU WILL BE RESPONSIBLE FOR:\nTHE FINANCE MANAGER IS RESPONSIBLE FOR OVERSEEING THE FINANCIAL LANDSCAPE TO ENSURE ACCURACY, COMPLIANCE, AND STRATEGIC ALIGNMENT. THE FINANCE MANAGER WILL NEED A KEEN EYE FOR DETAIL, EXCEPTIONAL ANALYTICAL SKILLS, AND A DEEP UNDERSTANDING OF FINANCIAL PRINCIPLES, AND PLAYS A CRITICAL ROLE IN FINANCIAL PLANNING, REPORTING, AND ANALYSIS EFFORTS TO FACILITATE INFORMED DECISION-MAKING. FINANCE MANAGER PERFORMS VARIOUS FINANCIAL FUNCTIONS, INCLUDING BUDGET MANAGEMENT, FINANCIAL ANALYSIS, REPORTING, AND RISK MITIGATION. FINANCIAL ANALYSIS AND REPORTING: CONDUCT THOROUGH FINANCIAL ANALYSIS, UTILIZING DATA TO UNCOVER INSIGHTS, TRENDS, AND AREAS FOR IMPROVEMENT. PREPARE COMPREHENSIVE FINANCIAL REPORTS, INCLUDING STATEMENTS, FORECASTS, AND VARIANCE ANALYSIS, TO SUPPORT EFFECTIVE DECISION-MAKING BY SENIOR MANAGEMENT. GENERAL LEDGER ACTIVITIES INCLUDING JOURNAL ENTRIES, MONTHLY CLOSING TASKS AND PREPARATION OF MONTHLY SUPPORTING SCHEDULES WILL BE NECESSARY TO SUPPORT REPORTING AND ANALYSIS.BUDGET MANAGEMENT: DEVELOPMENT, MONITORING, AND MANAGEMENT OF BUDGETS ACROSS DEPARTMENTS; WORK COLLABORATIVELY TO ENSURE ALIGNMENT WITH STRATEGIC OBJECTIVES WHILE IDENTIFYING OPPORTUNITIES FOR COST OPTIMIZATION.RISK MANAGEMENT: IDENTIFY POTENTIAL FINANCIAL RISKS AND DEVELOP STRATEGIES TO MITIGATE THEM; IMPLEMENT INTERNAL CONTROLS TO SAFEGUARD ASSETS, ENSURING COMPLIANCE WITH REGULATIONS AND INTERNAL POLICIES.FINANCIAL STRATEGY: PLAY AN INSTRUMENTAL ROLE IN SHAPING THE COMPANY'S FINANCIAL STRATEGY, CONTRIBUTING INSIGHTS ON RESOURCE ALLOCATION, INVESTMENT OPPORTUNITIES, AND REVENUE ENHANCEMENT. TEAM LEADERSHIP: LEAD, MENTOR, AND MOTIVATE A TEAM OF FINANCE PROFESSIONALS BY PROVIDING GUIDANCE THAT WILL FOSTER A COHESIVE AND PRODUCTIVE ENVIRONMENT, EMPOWERING TEAM MEMBERS TO EXCEL IN THEIR ROLES.COLLABORATION: COLLABORATE WITH AUDITORS, TAX ADVISORS, AND EXTERNAL STAKEHOLDERS TO FACILITATE SMOOTH AUDITS AND COMPLIANCE. MANAGE BANKING PARTNERSHIPS.CASH FLOW MANAGEMENT: OVERSEE CASH FLOW BY ANALYZING LIQUIDITY NEEDS, OPTIMIZING WORKING CAPITAL, AND COORDINATING WITH DEPARTMENTS TO ENSURE EFFICIENT CASH UTILIZATION.ACCOUNTS PAYABLE: MANAGE THE ACCOUNTS PAYABLE ACCOUNTING PROCESS INCLUDING CODING AND MATCHING GRN.PAYROLL:  MANAGE OUTSIDE PAYROLL PROCESSING VENDOR AND COLLABORATE WITH HR TO ENSURE PAYROLL IS PROCESSED TIMELY AND ACCURATELY. \nREQUIREMENTS EDUCATION:BACHELOR'S DEGREE IN ACCOUNTING, FINANCE OR RELATED FIELD REQUIRED; CPA CERTIFICATION PREFERRED.EXPERIENCE: 5-7 YEARS PROVEN EXPERIENCE IN FINANCE OR ACCOUNTING ROLES, WITH AT LEAST 2 YEARS IN A MANAGERIAL OR SUPERVISORY CAPACITY.KNOWLEDGE / SKILLS:STRONG UNDERSTANDING OF FINANCIAL PRINCIPLES, REGULATIONS, AND BEST PRACTICES.PROFICIENCY IN FINANCIAL ANALYSIS, BUDGETING, AND FORECASTING.EXCELLENT KNOWLEDGE OF ACCOUNTING SOFTWARE AND FINANCIAL MANAGEMENT TOOLS.ADVANCED PROFICIENCY IN MICROSOFT EXCEL AND OTHER RELEVANT SOFTWARE APPLICATIONS.STRONG ANALYTICAL, PROBLEM-SOLVING, AND COMMUNICATION SKILLS.EFFECTIVE LEADERSHIP AND TEAM MANAGEMENT ABILITIES.ATTENTION TO DETAIL, ACCURACY, AND COMMITMENT TO MEETING DEADLINES.USE THE UTMOST DISCRETION IN ALL PRESENTATIONS/CORRESPONDENCE AND COMMUNICATION FOR STAFF AND SENIOR LEADERSHIP.  PHYSICAL REQUIREMENTS:THE PHYSICAL DEMANDS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY AN EMPLOYEE TO SUCCESSFULLY PERFORM THE ESSENTIAL FUNCTIONS OF THIS JOB. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS. WHILE PERFORMING THE DUTIES OF THIS JOB, THE EMPLOYEE IS REGULARLY REQUIRED TO SIT; REACH WITH HANDS AND ARMS AND TALK OR HEAR. THE EMPLOYEE IS FREQUENTLY REQUIRED TO USE HANDS AND FINGERS TO HANDLE OR FEEL; FREQUENTLY LIFT AND/OR MOVE UP TO 10 POUNDS AND OCCASIONALLY LIFT AND/OR MOVE UP TO 50 POUNDS. THE EMPLOYEE IS REGULARLY REQUIRED TO STAND AND WALK. SPECIFIC VISION ABILITY BY THIS JOB INCLUDES CLOSE VISION, DISTANCE VISION, PERIPHERAL VISION, DEPTH PERCEPTION AND ABILITY TO ADJUST FOCUS. \nWORK ENVIRONMENTTHE WORK ENVIRONMENT CHARACTERISTICS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE AN EMPLOYEE ENCOUNTERS WHILE PERFORMING THE ESSENTIAL FUNCTIONS OF THIS JOB. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS. WHILE PERFORMING THE DUTIES OF THIS JOB, THE EMPLOYEE IS OCCASIONALLY EXPOSED TO FUMES OR AIRBORNE PARTICLES. THE NOISE LEVEL IN THE WORK ENVIRONMENT IS USUALLY MODERATE.\nOTHER REQUIREMENTS:BECAUSE EMPLOYEES IN THIS POSITION MUST HANDLE INFORMATION COVERED BY THE INTERNATIONAL TRADE AND ARMS REGULATIONS (ITAR) AND EXPORT ADMINISTRATION REGULATIONS (EAR), SUCCESSFUL APPLICANTS WILL BE REQUIRED TO VERIFY THEIR IDENTITY AND THEIR STATUS AS A U.S. CITIZEN OR NATIONAL, U.S. LAWFUL PERMANENT RESIDENT, OR PERSON GRANTED REFUGEE OR ASYLEE STATUS IN THE U.S.\nEQUAL OPPORTUNITY EMPLOYERWINDINGS IS AN EQUAL OPPORTUNITY/AFFIRMATIVE ACTION EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO AGE, SEX, RACE, COLOR, RELIGION, NATIONAL ORIGIN, AGE, MARITAL STATUS, POLITICAL AFFILIATION, SEXUAL ORIENTATION, GENDER IDENTITY, GENETIC INFORMATION, DISABILITY OR PROTECTED VETERAN STATUS. WE ARE COMMITTED TO PROVIDING A WORKPLACE FREE OF ANY DISCRIMINATION OR HARASSMENT.",
    "job_skill_set": [
      "financial analysis",
      "budget management",
      "financial reporting",
      "accounting software",
      "Microsoft Excel",
      "cash flow management",
      "accounts payable",
      "analytical skills",
      "communication skills",
      "leadership",
      "team management",
      "attention to detail",
      "problem solving",
      "collaboration",
      "risk management",
      "CPA certification",
      "payroll management"
    ],
    "short_keywords": [
      "accounting",
      "accounts",
      "analysis",
      "analytical",
      "attention",
      "budget",
      "cash",
      "certification",
      "collaboration",
      "communication",
      "cpa",
      "detail",
      "excel",
      "finance",
      "financial",
      "flow",
      "leadership",
      "management",
      "manager",
      "microsoft",
      "payable",
      "payroll",
      "problem",
      "reporting",
      "risk",
      "skills",
      "software",
      "solving",
      "team",
      "to"
    ]
  },
  {
    "job_id": "3889437728",
    "job_title": "Finance Specialist - 1771249",
    "category": "FINANCE",
    "job_description": "BOUTIQUE LAW FIRM SEEKS FULL-TIME FINANCE SPECIALIST TO WORK IN FINANCE DEPARTMENT. FINANCE SPECIALIST WILL WORK CLOSELY WITH HEAD OF BILLING AND ATTORNEYS. THE ROLE INVOLVES OVERSEEING THE CONTROL, MONITORING, AND COLLECTION OF ACCOUNTS RECEIVABLES, AND REQUIRES CLOSE COLLABORATION WITH ATTORNEYS AND CLIENTS. THIS IS AN IN-OFFICE POSITION.\n\nRESPONSIBILITIES INCLUDE:\n\nWORK WITH ATTORNEYS AND STAFF TO CREATE, DISTRIBUTE, EDIT, POST, AND SUBMIT BILLS USING A VARIETY OF DELIVERY METHODS.REVIEWING MONTHLY ATTORNEY TIME ENTRIES.PREPARE REPORTS ON BILLING AND COLLECTIONS DATA.ENSURE EFFECTIVE MONITORING AND MANAGEMENT OF OUTSTANDING ACCOUNTS RECEIVABLE, UNAPPLIED FUNDS, AND COLLECTION EFFORTS.ASSIST PARTNERS AND CLIENTS WITH ANY INQUIRIES OR CONCERNS REGARDING UNPAID OR UNDERPAID INVOICES.PROCESS PAYMENTS FOR RETAINERS, INVOICES, ETC., AND ACCURATELY APPLY FEES AND COSTS IN TABS.WORK WITH BILLING TEAM TO RESOLVE ANY INQUIRIES OR ISSUES REGARDING THE BILLING AND COLLECTIONS PROCESS.REVIEW CREDIT CARD EXPENSES AND ASSIGN THEM TO THE CORRECT GENERAL LEDGER ACCOUNTS.PERFORMING ACCOUNTS PAYABLE DUTIES.\n\n\nQUALIFICATIONS:\n\nBACHELOR'S DEGREE IN EITHER ACCOUNTING OR FINANCE. SUPERIOR ORGANIZATIONAL, COMMUNICATION AND TIME MANAGEMENT SKILLS. SKILLED IN MICROSOFT OFFICE, WITH A PARTICULAR FOCUS ON OUTLOOK AND EXCELEXPERIENCE WITH TABS3 IS A PLUS.\n\n\n",
    "job_skill_set": [
      "financial reporting",
      "data analysis",
      "communication",
      "organizational skills",
      "time management",
      "collaboration",
      "problem solving",
      "accounts receivable",
      "billing",
      "accounts payable",
      "Microsoft Office",
      "Excel",
      "TABs3"
    ],
    "short_keywords": [
      "1771249",
      "accounts",
      "analysis",
      "billing",
      "collaboration",
      "communication",
      "data",
      "excel",
      "finance",
      "financial",
      "management",
      "microsoft",
      "office",
      "organizational",
      "payable",
      "problem",
      "receivable",
      "reporting",
      "skills",
      "solving",
      "specialist",
      "tabs3",
      "time"
    ]
  },
  {
    "job_id": "3900087591",
    "job_title": "IT Finance Operations Manager",
    "category": "FINANCE",
    "job_description": "WHEN YOU JOIN THE GROWING BILH TEAM, YOU'RE NOT JUST TAKING A JOB, YOU’RE MAKING A DIFFERENCE IN PEOPLE’S LIVES.\n\nJOB TYPE:\n\nREGULAR\n\nSCHEDULED HOURS:\n\n40\n\nWORK SHIFT:\n\nDAY (UNITED STATES OF AMERICA)\n\nTHE OPERATIONS MANAGER REPORTS TO THE EXECUTIVE DIRECTOR, IT FINANCE & ADMINISTRATION AND MANAGES THE FINANCIAL AND OPERATIONAL SYSTEMS, PROCESSES, ADMINISTRATION, AND INTERNAL CONTROLS IN SUPPORT OF BILH IT. THIS ROLE MANAGES THE QUARTERLY REPORTS AND FINANCIAL FORECASTING OF CAPITAL AND OPERATIONAL IT BUDGETS FOR HR AND FINANCIAL DECISION MAKING DURING THE YEAR. ADDITIONALLY, THIS ROLE MANAGES THE HR FUNCTIONS WITHIN IT FOR APPROXIMATELY 800 EMPLOYEES AND CONTRACTORS INCLUDING: EMPLOYEE LISTS, POSITION CONTROL, JOB REQUISITIONS, EMPLOYEE RELATIONS, ANNUAL REVIEW SCHEDULES AND OTHER HR RELATED ACTIVITIES.\n\nWORKING WITH THE MANAGER, IT FINANCE, THIS ROLE SUPPORTS THE MANAGEMENT OF THE ANNUAL OPERATING AND CAPITAL BUDGET PROCESS AND FINAL REQUEST FOR FUNDS.\n\nTHIS ROLE WILL WORK COLLABORATIVELY WITH IT SYSTEM SERVICE LEADERS, MANAGERS, HUMAN RESOURCES, RECRUITMENT, COMPENSATION AND EMPLOYEE RELATIONS TO MITIGATE IT RISK FOR THE ORGANIZATION.\n\nJOB DESCRIPTION:\n\nESSENTIAL DUTIES & RESPONSIBILITIES INCLUDING BUT NOT LIMITED TO:\n\n RESPONSIBLE FOR THE REPORTING OF ALL IT OPERATING BUDGETS, INCLUDING AGGREGATION OF DATA AND ACTIVITY REPORTING ON A REGULAR BASIS TO SENIOR LEADERSHIP. INTERACTS WITH ALL LEVELS OF BILH, INCLUDING SENIOR MANAGEMENT AND DEPARTMENT HEADS, AND IS RESPONSIBLE FOR KNOWLEDGE OF OPERATIONAL AND FINANCIAL POLICIES AND PROCEDURES.  POSSESS A THOROUGH KNOWLEDGE AND UNDERSTANDING OF ESTABLISHED IT POLICIES AND PROCEDURES AND TO EFFECTIVELY TRANSLATE OPERATIONAL PLANS INTO METHODS AND PROCESSES TO BE USED IN THE DELIVERY OF SERVICES, TECHNOLOGY PLANNING AND SUPPORT TO CUSTOMERS AND EMPLOYEES.  RECOMMENDS AND IMPLEMENTS PROCESS IMPROVEMENTS TO ENSURE THAT FINANCIAL REPORTING ADDRESSES THE NEEDS OF KEY USERS AND SENIOR LEADERSHIP.  MANAGES THE CONSOLIDATED HR ACTIVITIES REQUIRED FOR IT INCLUDING; MAINTAIN $64M BUDGETED IT EMPLOYEE TRACKING VIA VACANCY LISTS, POSTED POSITIONS, FILLED POSITIONS, THE WEEKLY POSITION CONTROL APPROVAL PROCESS AND RESULTING JOB REQUISITIONS. COMPLETES VERIFICATION OF SALARY RECOMMENDATIONS VERSUS BUDGET AND COORDINATES AND MANAGES THE SERVICE LINE ANNUAL MARKET REVIEWS AS SCHEDULED.  DEVELOPS HIGHLY SENSITIVE BUDGET/FINANCIAL MODELS TO DETERMINE AS QUICKLY AS POSSIBLE IF EXPENSE CHANGES ARE REQUIRED TO MEET ANNUAL BUDGET GOALS.  DEVELOPS AND MANAGES COMPLEX ANALYSES AND FORECASTING OF OPERATING EXPENSES, VENDORS AND/OR CAPITAL TO PROVIDE DECISION SUPPORT TO IS LEADERS AS NEEDED TO MANAGE AND PLAN RESOURCES AND SPENDING, EVALUATE PROJECTS AND SUPPORT VENDOR NEGOTIATIONS.  MANAGES AND FACILITATES HR/IT PROJECTS AND ACTIVITIES IN COORDINATION WITH HR, LEADS THE WEEKLY HR/IT LEADERSHIP MEETING, SUPPORTS IT LEADERSHIP WITH NEW MERGERS OR ACQUISITIONS, COORDINATES ANNUAL PERFORMANCE REVIEWS, MAINTAINS IT ORG CHARTS, AND MANAGES SPECIAL REQUESTS RELATED TO IT EMPLOYEE RESOURCES (NEW/REVISED JOB DESCRIPTIONS, EMPLOYEE DATA VALIDATION, REPORTING STRUCTURE CHANGES, ETC.) DEVELOPS AND MAINTAINS STRONG PROFESSIONAL RELATIONSHIPS WITH VENDORS, SENIOR IT LEADERS, AND HOSPITAL MANAGEMENT.  PROVIDES ANY ADDITIONAL SUPPORT REQUIRED BY MANAGEMENT AND PROVIDE COVERAGE FOR OTHER TEAM MEMBERS WHEN HE/SHE IS NOT AVAILABLE.  ROUTINELY COMMUNICATES WITH SENIOR IT LEADERSHIP REGARDING DEPARTMENTAL FUNCTIONS AND THE STATUS OF VARIOUS PROGRAMS, SERVICES, AND FINANCIAL OBJECTIVES. ATTEND DEPARTMENT MEETINGS AS NECESSARY IN ORDER TO FACILITATE COLLABORATION AND DATA GATHERING AS REQUIRED FOR SPECIAL PROJECTS AND ANALYSIS IN SUPPORT OF THE OCIO. \n\nMINIMUM QUALIFICATIONS:\n\nEDUCATION: BACHELOR'S OR RELATED YEARS OF EXPERIENCE\n\nLICENSURE, CERTIFICATION & REGISTRATION:\n\nEXPERIENCE: 8 – 10 YEARS. STRONG BACKGROUND IN FINANCIAL ANALYSIS AND REPORTING RESULTS, PREFERABLY WITHIN A HEALTHCARE SETTING. PAST EXPERIENCE WITH HR ADMINISTRATION\n\nSKILLS, KNOWLEDGE & ABILITIES: WORK REQUIRES STRONG VERBAL, ANALYTICAL AND INTERPERSONAL SKILLS.\n\nMUST BE ABLE TO WORK WELL IN A TEAM-FOCUSED ENVIRONMENT AND COMMUNICATE WELL WITH COLLEAGUES AND VENDORS.\n\nFLSA STATUS:\n\nEXEMPT\n\nAS A HEALTH CARE ORGANIZATION, WE HAVE A RESPONSIBILITY TO DO EVERYTHING IN OUR POWER TO CARE FOR AND PROTECT OUR PATIENTS, OUR COLLEAGUES AND OUR COMMUNITIES. BETH ISRAEL LAHEY HEALTH REQUIRES THAT ALL STAFF BE VACCINATED AGAINST INFLUENZA (FLU) AND COVID-19 AS A CONDITION OF EMPLOYMENT. LEARN MORE ABOUT THIS REQUIREMENT.\n\nMORE THAN 35,000 PEOPLE WORKING TOGETHER. NURSES, DOCTORS, TECHNICIANS, THERAPISTS, RESEARCHERS, TEACHERS AND MORE, MAKING A DIFFERENCE IN PATIENTS' LIVES. YOUR SKILL AND COMPASSION CAN MAKE US EVEN STRONGER.\n\nEQUAL OPPORTUNITY EMPLOYER/VETERANS/DISABLED",
    "job_skill_set": [
      "financial analysis",
      "budget management",
      "data aggregation",
      "financial forecasting",
      "reporting",
      "process improvement",
      "communication",
      "teamwork",
      "interpersonal skills",
      "problem solving",
      "collaboration",
      "leadership",
      "adaptability",
      "relationship building",
      "organizational skills",
      "verbal skills",
      "HR administration",
      "vendor negotiation",
      "analytical modeling",
      "IT policies and procedures"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "aggregation",
      "analysis",
      "analytical",
      "and",
      "budget",
      "building",
      "collaboration",
      "communication",
      "data",
      "finance",
      "financial",
      "forecasting",
      "hr",
      "improvement",
      "interpersonal",
      "it",
      "leadership",
      "management",
      "manager",
      "modeling",
      "negotiation",
      "operations",
      "organizational",
      "policies",
      "problem",
      "procedures",
      "process",
      "relationship",
      "reporting",
      "skills",
      "solving",
      "teamwork",
      "vendor",
      "verbal"
    ]
  },
  {
    "job_id": "3904925494",
    "job_title": "Senior Project Finance Attorney",
    "category": "FINANCE",
    "job_description": "NEXTERA ENERGY RESOURCES  IS THE WORLD'S LARGEST GENERATOR OF RENEWABLE ENERGY FROM THE WIND AND SUN, AND A WORLD LEADER IN BATTERY STORAGE. WE PROVIDE ENERGY-RELATED PRODUCTS AND SERVICES THAT GROW OUR ECONOMY, PROTECT THE ENVIRONMENT, SUPPORT OUR COMMUNITIES AND HELP CUSTOMERS MEET THEIR ENERGY NEEDS. WE ARE LEADING THE DECARBONIZATION OF THE U.S. ECONOMY WITH OUR GOAL TO REACH REAL ZERO CARBON EMISSIONS FROM OUR OPERATIONS BY 2045 WHILE IMPROVING CUSTOMER AFFORDABILITY AND RELIABILITY. ARE YOU INTERESTED IN CREATING A CLEANER ENVIRONMENT FOR FUTURE GENERATIONS? JOIN OUR WORLD-CLASS, INNOVATIVE TEAM TODAY.\n\nPOSITION SPECIFIC DESCRIPTION\n\nNEXTERA ENERGY IS SEEKING AN EXPERIENCED LEGAL PRACTITIONER TO JOIN ITS FINANCE LEGAL TEAM WITH EXPERIENCE IN PROJECT AND CORPORATE FINANCE, INCLUDING SECURED AND UNSECURED SYNDICATED CREDIT FACILITIES, NON-RECOURSE PORTFOLIO FINANCINGS, MEZZANINE FINANCINGS, RESTRUCTURINGS, CAPITAL MARKETS TRANSACTIONS AND TAX EQUITY TRANSACTIONS, AND A PROVEN RECORD OF COMMERCIAL AWARENESS. THIS POSITION WILL PROVIDE LEGAL SUPPORT RELATED TO COMPLEX RENEWABLES FINANCINGS, INCLUDING PROJECT FINANCINGS AND TAX EQUITY TRANSACTIONS, AND CORPORATE FINANCINGS, AND PLAY A LEAD ROLE IN DRAFTING, NEGOTIATING, AND PROVIDING TRANSACTIONAL ASSISTANCE TO INTERNAL CLIENTS.\n\n**POSITION COULD BE LOCATED IN THE FOLLOWING LOCATIONS: JUNO BEACH, FL, WASHINGTON, DC, HOUSTON, TX, OR SAN FRANCISCO, CA.**\n\nJOB OVERVIEW\n\nEMPLOYEES IN THIS JOB PARTICIPATE IN COMPLEX LEGAL MATTERS AND PROJECTS AND DELIVER TIMELY AND QUALITY LEGAL SERVICES TO CLIENTS WITH MINIMAL SUPERVISION.\n\nJOB DUTIES & RESPONSIBILITIES\n\n PROVIDES WRITTEN AND ORAL LEGAL ADVICE TO CLIENTS ANTICIPATES AND GUARDS AGAINST LEGAL RISKS INVOLVING THE ORGANIZATION WORKS TO ENSURE BUDGET COMPLIANCE AND AVOIDS THE NEED FOR OUTSIDE COUNSEL ENSURES DISCLOSURE OF POTENTIALLY MATERIAL LEGAL ISSUES TO SENIOR LEADERSHIP PERFORMS OTHER JOB-RELATED DUTIES AS ASSIGNED\n\nREQUIRED QUALIFICATIONS\n\n MEMBER IN GOOD STANDING OF STATE BAR HIGH SCHOOL GRAD / GED JURIS DOCTORATE BACHELOR'S DEGREE EXPERIENCE:5+ YEARS\n\nPREFERRED QUALIFICATIONS\n\n NONE\n\nEMPLOYEE GROUP: EXEMPT\n\nEMPLOYEE TYPE: FULL TIME\n\nJOB CATEGORY: LEGAL/REGULATORY/EXTERNAL AFFAIRS\n\nORGANIZATION: NEXTERA ENERGY RESOURCES, LLC\n\nRELOCATION PROVIDED: YES, IF APPLICABLE\n\nNEXTERA ENERGY IS AN EQUAL OPPORTUNITY EMPLOYER. QUALIFIED APPLICANTS ARE CONSIDERED FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, AGE, NATIONAL ORIGIN, RELIGION, MARITAL STATUS, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, GENDER EXPRESSION, GENETICS, DISABILITY, PROTECTED VETERAN STATUS OR ANY OTHER BASIS PROHIBITED BY LAW. WE ARE COMMITTED TO A DIVERSE AND INCLUSIVE WORKPLACE.\n\nNEXTERA ENERGY AND PROVIDES REASONABLE ACCOMMODATION IN ITS APPLICATION AND SELECTION PROCESS FOR QUALIFIED INDIVIDUALS, INCLUDING ACCOMMODATIONS RELATED TO COMPLIANCE WITH CONDITIONAL JOB OFFER REQUIREMENTS, CONSISTENT WITH FEDERAL, STATE, AND LOCAL LAWS. SUPPORTING MEDICAL OR RELIGIOUS DOCUMENTATION WILL BE REQUIRED WHERE APPLICABLE AND PERMITTED BY APPLICABLE LAW. TO REQUEST A REASONABLE ACCOMMODATION, PLEASE SEND AN E-MAIL TO RECRUITING-COORDINATOR.SHAREDMAILBOX@NEXTERAENERGY.COM , PROVIDING YOUR NAME, TELEPHONE NUMBER AND THE BEST TIME FOR US TO REACH YOU. ALTERNATIVELY, YOU MAY CALL 1-844-694-4748. PLEASE DO NOT USE THIS LINE TO INQUIRE ABOUT YOUR APPLICATION STATUS.\n\nNEXTERA ENERGY WILL NOT DISCHARGE OR IN ANY OTHER MANNER DISCRIMINATE AGAINST EMPLOYEES OR APPLICANTS BECAUSE THEY HAVE INQUIRED ABOUT, DISCUSSED, OR DISCLOSED THEIR OWN PAY OR THE PAY OF ANOTHER EMPLOYEE OR APPLICANT. HOWEVER, EMPLOYEES WHO HAVE ACCESS TO THE COMPENSATION INFORMATION OF OTHER EMPLOYEES OR APPLICANTS AS A PART OF THEIR ESSENTIAL JOB FUNCTIONS CANNOT DISCLOSE THE PAY OF OTHER EMPLOYEES OR APPLICANTS TO INDIVIDUALS WHO DO NOT OTHERWISE HAVE ACCESS TO COMPENSATION INFORMATION, UNLESS THE DISCLOSURE IS (A) IN RESPONSE TO A FORMAL COMPLAINT OR CHARGE, (B) IN FURTHERANCE OF AN INVESTIGATION, PROCEEDING, HEARING, OR ACTION, INCLUDING AN INVESTIGATION CONDUCTED BY THE EMPLOYER, OR (C) CONSISTENT WITH THE CONTRACTOR’S LEGAL DUTY TO FURNISH INFORMATION.\n\nNEXTERA ENERGY DOES NOT ACCEPT ANY UNSOLICITED RESUMES OR REFERRALS FROM ANY THIRD-PARTY RECRUITING FIRMS OR AGENCIES. PLEASE SEE OUR POLICY FOR MORE INFORMATION.\n\n",
    "job_skill_set": [
      "negotiation",
      "communication",
      "problem solving",
      "commercial awareness",
      "teamwork",
      "adaptability",
      "project finance",
      "corporate finance",
      "syndicated credit facilities",
      "non-recourse portfolio financing",
      "mezzanine financing",
      "restructurings",
      "capital markets transactions",
      "tax equity transactions",
      "legal drafting",
      "legal compliance",
      "risk management",
      "legal advice",
      "time management"
    ],
    "short_keywords": [
      "adaptability",
      "advice",
      "attorney",
      "awareness",
      "capital",
      "commercial",
      "communication",
      "compliance",
      "corporate",
      "credit",
      "drafting",
      "equity",
      "facilities",
      "finance",
      "financing",
      "legal",
      "management",
      "markets",
      "mezzanine",
      "negotiation",
      "nonrecourse",
      "portfolio",
      "problem",
      "project",
      "restructurings",
      "risk",
      "senior",
      "solving",
      "syndicated",
      "tax",
      "teamwork",
      "time",
      "transactions"
    ]
  },
  {
    "job_id": "3905370101",
    "job_title": "Director, Commercial Finance",
    "category": "FINANCE",
    "job_description": "NEWELL BRANDS IS A LEADING $8.5B CONSUMER PRODUCTS COMPANY WITH A PORTFOLIO OF ICONIC BRANDS SUCH AS GRACO®, COLEMAN®, OSTER®, RUBBERMAID® AND SHARPIE®, AND 28,000 TALENTED EMPLOYEES AROUND THE WORLD. OUR HIGH-PERFORMANCE CULTURE, UNPARALLELED CURIOSITY ABOUT THE WORLD AROUND US, AND TALENTED PEOPLE FUEL OUR SUCCESS. OUR CULTURE IS ENABLED THROUGH OUR CORE VALUES WHICH GUIDE ALL WE DO AND HOW WE WIN AS ONE NEWELL. THEY ARE INTEGRITY, TEAMWORK, PASSION FOR WINNING, OWNERSHIP & LEADERSHIP.\n\nTHE DIRECTOR, COMMERCIAL FINANCE WILL ENABLE NEWELL BRANDS GROWTH BY PROVIDING WORLD-CLASS FINANCIAL LEADERSHIP AND DECISION SUPPORT TO US SALES, FINANCE AND BUSINESS SEGMENT PARTNERS. THESE DUTIES INCLUDE BEING A RELIABLE BUSINESS PARTNER TO SALES EXECUTIVES AND THEIR TEAMS. ADDITIONALLY, THE DIRECTOR LEAD OR ACTIVELY SUPPORT SEVERAL ELEMENTS OF THE COMMERCIAL FINANCE CAPABILITY AGENDA IN AREAS INCLUDING RGM/PRICING, SALES PLANNING AND OPERATIONS.\n\nRESPONSIBILITIES\n\nPROVIDE FINANCIAL DECISION SUPPORT TO NEWELL SALES TEAMS TO ENSURE DELIVERY OF PLANS.COLLABORATE INTERNALLY AND EXTERNALLY TO DEVELOP AND DELIVER WIN-WIN, CUSTOMER BUSINESS PLANS AND FINANCIAL TARGETS.PLAY AN ACTIVE LEADERSHIP ROLE ON CROSS-FUNCTIONAL CUSTOMER TEAM AND SALES LEADERSHIP TEAMMANAGE AND OVERSEE FINANCIAL ELEMENTS OF SALES OPERATING RHYTHM WITH ENGAGEMENT TO SENIOR LEADERS.ACTIVELY MONITOR AND REPORT PERFORMANCE AGAINST KEY PERFORMANCE AND FINANCIAL METRICS (IE. CUSTOMER P&L, TRADE CHECKBOOK, ETC.)CHAMPION LOCAL EXECUTION OF PRICING AND CHANNEL STRATEGIESPARTNER WITH KEY SALES LEADERSHIP TO ADVANCE GO-TO-MARKET TRANSFORMATION AGENDA.LEAD OR SUPPORT DEVELOPMENT AND DEPLOYMENT OF KEY RGM FRAMEWORKS AND TOOLSDRIVE FINANCIAL PROCESS EFFICIENCY AND EFFECTIVENESS ACROSS THE ENTERPRISE TO INCLUDE THE DEVELOPMENT AND REFINEMENT OF REPORTING AND ANALYTICAL TOOLS.ENSURE ONGOING GOVERNANCE, CONTROL, AND COMPLIANCE WITH CORPORATE POLICY AND PROCEDURES.PROVIDE PARTNERS AND TEAM MEMBERS WITH COACHING, FEEDBACK, AND DEVELOPMENTAL OPPORTUNITIES.\n\nQUALIFICATIONS\n\nBACHELOR’S DEGREE IN FINANCE, ACCOUNTING, OR RELATED DISCIPLINE10-15 YEARS RELEVANT EXPERIENCE IN A FINANCE OR RGM ROLEABILITY TO WORK INDEPENDENTLY AND PROVEN SUCCESS IN A FAST PACED, MATRIXED ORGANIZATION.SELF-STARTER WITH PROVEN TRACK RECORD OF WORKING THRU AMBIGUITY, BUILDING RELATIONSHIPS AND CONSENSUS AMONGST DIVERSE TEAMS.EXPERIENCE SETTING UP NEW PROCESSES, STRONG ANALYTIC CAPABILITY AND BUSINESS PARTNERING.\n\nPREFERRED QUALIFICATIONS\n\nMBA OR EQUIVALENTCONSUMER GOODS EXPERIENCECOMMERCIAL FINANCE EXPERIENCE SUPPORTING SALES AND/OR BRAND.REVENUE GROWTH MANAGEMENT (RGM) EXPERIENCEFINANCIAL SYSTEMS EXPERIENCE\n\n_NEWELL BRANDS (NASDAQ: NWL) IS A LEADING GLOBAL CONSUMER GOODS COMPANY WITH A STRONG PORTFOLIO OF WELL-KNOWN BRANDS, INCLUDING RUBBERMAID, SHARPIE, GRACO, COLEMAN, RUBBERMAID COMMERCIAL PRODUCTS, YANKEE CANDLE, PAPER MATE, FOODSAVER, DYMO, EXPO, ELMER’S, OSTER, NUK, SPONTEX AND CAMPINGAZ. WE ARE FOCUSED ON DELIGHTING CONSUMERS BY LIGHTING UP EVERYDAY MOMENTS. NEWELL BRANDS AND ITS SUBSIDIARIES ARE EQUAL OPPORTUNITY EMPLOYERS AND COMPLY WITH APPLICABLE EMPLOYMENT LAWS. EOE/M/F/VET/DISABLED ARE ENCOURAGED TO APPLY.",
    "job_skill_set": [
      "financial leadership",
      "sales planning",
      "revenue growth management (RGM)",
      "financial analysis",
      "financial reporting",
      "financial systems",
      "analytical tools",
      "compliance",
      "business partnering",
      "teamwork",
      "communication",
      "leadership",
      "relationship building",
      "problem solving",
      "self-starter",
      "coaching",
      "adaptability",
      "consensus building",
      "pricing strategy"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "analytical",
      "building",
      "business",
      "coaching",
      "commercial",
      "communication",
      "compliance",
      "consensus",
      "director",
      "finance",
      "financial",
      "growth",
      "leadership",
      "management",
      "partnering",
      "planning",
      "pricing",
      "problem",
      "relationship",
      "reporting",
      "revenue",
      "rgm",
      "sales",
      "selfstarter",
      "solving",
      "strategy",
      "systems",
      "teamwork",
      "tools"
    ]
  },
  {
    "job_id": "3903845427",
    "job_title": "Finance Analyst",
    "category": "FINANCE",
    "job_description": "THE BONADIO GROUP IS LOOKING FOR A FINANCE ANALYST TO WORK WITH THE ENTERPRISE FINANCE TEAM. THIS PERSON WILL BE RESPONSIBLE FOR PROVIDING TIMELY, ACCURATE, AND RELIABLE COMPLETION OF WORK, AND ENSURING DELIVERY OF THAT WORK MEETS INTERNAL CLIENT EXPECTATIONS. THIS ROLE REQUIRES THE ABILITY TO WORK IN A CHANGEABLE, FAST-PACED, CLIENT-SERVICE ENVIRONMENT. THIS POSITION WILL REPORT INTO THE ROCHESTER, NY LOCATION WITH THE BONADIO GROUP.\n\nRESPONSIBILITIES\n\n PROCESS DAILY CASH RECEIPTS, POSTING TO CLIENT LEDGER  PREPARATION OF DAILY CASH SHEET  MANAGE ASSIGNED ACCOUNTS RECEIVABLE ACCOUNTS  RESPONSIBLE FOR FIRM-WIDE ACCOUNTS RECEIVABLE INVOICE PROCESSING  RESEARCH ACCOUNT DISPUTES AND BILLING DISCREPANCIES  CLIENT STATEMENT PREPARATION AND REVIEW  MANAGE BILLING EMAILS  ASSIST AS NEEDED WITH ACCOUNTS PAYABLE  MANAGE NEW CLIENT REFERENCE ID SETUP  ASSIST WITH MONTH-END REPORTING TO BE INCLUDED IN FINANCIAL STATEMENTS  LEARN AND UTILIZE PRACTICE MANAGEMENT SOFTWARE; PROVIDE SUPPORT AND TRAINING TO TEAM MEMBERS  ASSIST WITH SPECIAL PROJECTS AS NEEDED \n\nQUALIFICATIONS\n\n REQUIRED: \n\n A MINIMUM OF AN ASSOCIATES DEGREE WITHIN AN ACCOUNTING OR BUSINESS-RELATED AREA  A MINIMUM OF THREE YEARS IN ACCOUNTS RECEIVABLE AND BILLING  PROFICIENCY WITH MICROSOFT OFFICE (WORD, EXCEL, POWERPOINT, AND OUTLOOK) \n\nTHE SALARY RANGE FOR THIS POSITION IS BETWEEN $55,000 AND $65,000 COMMENSURATE WITH EXPERIENCE.\n\n HOURS OF OPERATION: \n\n OUR OFFICE HOURS ARE FROM 8:00 A.M. UNTIL 5:00 P.M. MONDAY THROUGH FRIDAY  OUR SUMMER HOURS ARE FROM 8:00 A.M. UNTIL 5:00 P.M. MONDAY THROUGH THURSDAY, AND FROM 8:00 A.M. UNTIL 12:00 P.M. ON FRIDAY  WE PRIDE OURSELVES ON OUR FLEXIBILITY; HOWEVER, THE ABILITY TO WORK ADDITIONAL HOURS WILL BE NEEDED AT PEAK TIMES \n\nAT THE BONADIO GROUP, WE BELIEVE THAT AN INCLUSIVE WORK ENVIRONMENT ALLOWS ALL OF OUR PEOPLE TO ACHIEVE THEIR GREATEST POTENTIAL AND THE GREATEST RESULTS FOR OUR CLIENTS AND COMMUNITIES. BONADIO IS COMMITTED TO THE PRINCIPLE OF EQUAL TREATMENT AND OPPORTUNITY FOR ALL PEOPLE. THE FIRM IS COMMITTED TO FOSTERING AND MANAGING DIVERSITY IN THE WORKPLACE AS AN INTEGRAL PART OF ITS PRACTICE AND SERVICE TO CLIENTS. THE FIRM VALUES THE RICH VARIETY OF PERSPECTIVES AND EXPERIENCES OFFERED BY THOSE OF DIFFERENT BACKGROUNDS. THIS DIVERSITY STRENGTHENS OUR INSTITUTION AND ENABLES IT TO BETTER RESPOND TO OUR CLIENTS’ NEEDS IN AN INCREASINGLY GLOBAL PROFESSION.\n\nIN THE FAST-CHANGING ACCOUNTING INDUSTRY, THE BONADIO GROUP IS ALWAYS ON THE CUTTING EDGE OF GROWTH AND INNOVATION. WITH OUR GREAT MENTORING AND TRAINING PROGRAMS, YOU’LL BE EXPOSED TO DIVERSITY OF WORK, THE ABILITY TO TACKLE MORE INTERESTING ISSUES, AND HAVE A PATH TO PARTNERSHIP. YOU’LL BE WORKING WITH GREAT PEOPLE AND GREAT CLIENTS WHERE YOU CAN TRULY MAKE A DIFFERENCE. APPLY ONLINE, GET ON BOARD, AND GROW WITH US. YOU’LL BE GLAD YOU DID!\n\nALL COMMUNICATIONS FROM THE BONADIO GROUP REGARDING RECRUITMENT AND HIRING WILL COME FROM AN @BONADIO.COM EMAIL ADDRESS AND OUR PROCESS INCLUDES A DISCUSSION WITH OUR TALENT MANAGEMENT TEAM. IF YOU HAVE ANY QUESTIONS OR CONCERNS, PLEASE CONTACT US IMMEDIATELY AT (800) 487-7624 OR CAREERS@BONADIO.COM .\n\n EOE/AA DISABILITY/VETERAN",
    "job_skill_set": [
      "accounts receivable",
      "financial reporting",
      "cash management",
      "data analysis",
      "client service",
      "adaptability",
      "communication",
      "teamwork",
      "problem solving",
      "attention to detail",
      "time management",
      "billing",
      "Microsoft Office",
      "practice management software"
    ],
    "short_keywords": [
      "accounts",
      "adaptability",
      "analysis",
      "analyst",
      "attention",
      "billing",
      "cash",
      "client",
      "communication",
      "data",
      "detail",
      "finance",
      "financial",
      "management",
      "microsoft",
      "office",
      "practice",
      "problem",
      "receivable",
      "reporting",
      "service",
      "software",
      "solving",
      "teamwork",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3901933964",
    "job_title": "Director of Finance / Controller ",
    "category": "FINANCE",
    "job_description": "ONE OF OUR CLIENT’S, A GLOBAL MANUFACTURING COMPANY, IS LOOKING FOR AN EXPERIENCED DIRECTOR OF FINANCE / CONTROLLER TO JOIN THEIR U.S. TEAM.\nREPORTING TO THE GENERAL MANAGER AND SERVING AS AN INTEGRAL MEMBER OF THE SENIOR MANAGEMENT TEAM, THE DIRECTOR OF FINANCE WILL BE RESPONSIBLE FOR THE DEVELOPMENT OF OUR FINANCIAL MANAGEMENT STRATEGY AND CONTRIBUTE TO THE DEVELOPMENT OF THE ORGANIZATION’S STRATEGIC GOALS AS WELL ASREPORTING THE FINANCIAL RESULTS + ANALYSIS TO THE GROUP’S HQ; WORK CLOSELY WITH THE CORPORATE CONTROLLER AND GROUP’S CFO.\nIN ADDITION TO THE STRATEGIC COMPONENTS, THE DIRECTOR WILL OVERSEE THE DEVELOPMENT AND IMPLEMENTATION OF MORE SOPHISTICATED POLICIES AND PROCEDURES BOTH IN THE FINANCE AND GENERAL OPERATIONAL REALMS. THE DIRECTOR WILL BE EXPECTED TO MONITOR THE FINANCIAL HEALTH OF THE ORGANIZATION, INCLUDING KEEPING CAREFUL TABS ON ITS REGULAR TRANSACTIONS, CASH FLOW AND ANY BUSINESS DEALS THAT AFFECT THE BOTTOM LINE.\nTHIS IS A “HANDS-ON” POSITION, REQUIRING THE SUCCESSFUL CANDIDATE TO BE WELL-VERSED IN FINANCE MANAGEMENT, BUT ALSO WILLING AND ABLE TO HANDLE TRANSACTIONS, PREPARE FINANCIAL STATEMENTS ANDPRESENTATIONS, ETC. THIS IS AN OUTSTANDING OPPORTUNITY FOR A FINANCE EXECUTIVE WITH OPERATIONAL EXPERIENCE AND A PROVEN TRACK RECORD OF CREATIVE PROBLEM-SOLVING AND CHANGE MANAGEMENT.\n\nESSENTIAL DUTIES AND RESPONSIBILITIESSTRATEGY, VISION AND LEADERSHIPADVISE GM AND OTHER KEY MEMBERS OF SENIOR MANAGEMENT ON FINANCIAL PLANNING BUDGETING, CASH FLOW, INVESTMENT PRIORITIES, AND POLICY MATTERS.CONTRIBUTE TO THE DEVELOPMENT OF OUR COMPANY’S STRATEGIC GOALS AND OBJECTIVES AS WELL AS THE OVERALL MANAGEMENT OF THE ORGANIZATION.SUPPLY A MONTHLY REPORTING PACKAGE OF ALL FINANCIAL DATA AND ANALYSIS TO THE CORPORATE CONTROLLER AND CFO.OVERALL MANAGE AND BE RESPONSIBLE FOR THE ACCOUNTING DEPARTMENT DUTIES.MAINTAIN CONTINUOUS LINES OF COMMUNICATION, KEEPING THE GM INFORMED OF ALL CRITICAL ISSUES.REPRESENT THE ORGANIZATION EXTERNALLY, AS NECESSARY, PARTICULARLY IN BANKING AND OTHER FINANCE NEGOTIATIONS.CONDUCT REGULAR AUDITS OF EXPENDITURES, ASSETS AND LIABILITIES, ENSURING THE RECORDED FIGURES ARE VERIFIABLE AND ACCURATE.REVIEW, REVISE, IMPLEMENT AND/OR MODIFY FINANCIAL CHECKS AND BALANCES WITH A HIGH DEGREE OF INVOLVEMENT AND METICULOUS ATTENTION TO DETAILDEVELOP DISCIPLINES TO REFINE INVENTORY MANAGEMENT AND OPTIMIZE CASH MANAGEMENT.MAINTAIN SYSTEMS FOR EFFECTIVE BILLING AND COLLECTION.RESPONSIBLE FOR COSTING SYSTEM AND IMPLEMENTATION.PREPARING COMPANY LOCAL AND FEDERAL TAX STATEMENTS.WORK WITH OTHER DEPARTMENTS TO MAXIMIZE CASH MANAGEMENT.\nGENERAL OPERATIONS:UPGRADE AND IMPLEMENT AN APPROPRIATE SYSTEM OF POLICIES, INTERNAL CONTROLS, ACCOUNTING STANDARDS, AND PROCEDURES.PLAN, COORDINATE, AND EXECUTE THE ANNUAL BUDGET PROCESS.ENSURE THAT OUR COMPANY IS ADHERING TO THE STRATEGIC PLAN, DELIVERING STATUS REPORTS TO THE BOARD.PROVIDE ANALYTICAL SUPPORT TO THE INTERNAL MANAGEMENT TEAM INCLUDING THE DEVELOPMENT OF INTERNAL MANAGEMENT REPORTING CAPABILITIESDRIVE REPORTING TO GIVE MANAGEMENT FORWARD-LOOKING PERFORMANCE GUIDANCE\n\nQUALIFICATION/REQUIREMENTS MINIMUM 8 YEARS OF EXPERIENCE IN A SENIOR MANAGEMENT ROLE IDEALLY WITH BOTH EXTERNAL AUDIT AND IN-HOUSE FINANCIAL MANAGEMENT EXPERIENCE GAINED IN A HIGH-GROWTH ORGANIZATIONMUST: OPERATIONAL/MANUFACTURING EXPERIENCE, UNDERSTANDS INVENTORY CAPITALIZATION, BURDEN RATE COMPILATION, BUDGETING ETC. KNOWLEDGE OF GENERALLY ACCEPTED ACCOUNTING PRINCIPLES (GAAP).MANUFACTURING COST ACCOUNTING EXPERIENCE IS HIGHLY PREFERREDPROVEN TRACK RECORD OF SUCCESS IN FACILITATING PROGRESSIVE ORGANIZATIONAL CHANGE AND DEVELOPMENT WITHIN A GROWING ORGANIZATIONEXCELLENT JUDGMENT AND CREATIVE PROBLEM-SOLVING SKILLS INCLUDING NEGOTIATION AND CONFLICT-RESOLUTION SKILLSSTRONG MENTORING, AND COACHING EXPERIENCE TO A TEAM WITH DIVERSE LEVELS OF EXPERTISEADVANCED KNOWLEDGE OF FINANCIAL MANAGEMENT SOFTWARE AND SYSTEMSABILITY TO MEET DEADLINES UNDER TIME CONSTRAINTSSTRONG LISTENING SKILLS AND ATTENTION TO DETAILMANAGE AND EVALUATE THE BUDGETING AND FORECASTING PROCESS AND RECOMMEND ACTION-ORIENTED INITIATIVES TO ATTAIN BUDGETED/FORECAST TARGETSEXPERIENCE WORKING WITH DIVERSE STAKEHOLDERS, INCLUDING GOVERNMENT OFFICIALS, BOARDS, AND COMMUNITY LEADERS INCLUDING MILITARY PERSONNELSUPERIOR MANAGEMENT SKILLS; ABILITY TO INFLUENCE AND ENGAGE DIRECT AND INDIRECT REPORTS AND PEERSSELF-RELIANT, GOOD PROBLEM SOLVER, RESULTS-ORIENTEDEXPERIENCE IN GOVERNMENT CONTRACTS WITH MILITARY APPLICATIONS IS AN ADVANTAGEENERGETIC, FLEXIBLE, COLLABORATIVE, AND PROACTIVE; A TEAM LEADER WHO CAN POSITIVELY AND PRODUCTIVELY IMPACT BOTH STRATEGIC AND TACTICAL FINANCE AND ADMINISTRATION INITIATIVESDEFENSE INDUSTRY EXPERIENCE IS AN ADVANTAGE\n\nEDUCATION: A DEGREE IN FINANCE, ACCOUNTING OR BUSINESS WITH STRONG ACCOUNTING EXPERIENCECPA IS PREFERRED",
    "job_skill_set": [
      "financial management",
      "accounting principles (GAAP)",
      "budgeting",
      "financial analysis",
      "financial management software",
      "inventory management",
      "tax preparation",
      "auditing",
      "financial reporting",
      "cash flow management",
      "change management",
      "strategic planning",
      "performance reporting",
      "problem solving",
      "leadership",
      "communication",
      "teamwork",
      "attention to detail",
      "judgment",
      "flexibility",
      "collaboration",
      "self-reliance",
      "results-oriented",
      "conflict resolution",
      "stakeholder engagement",
      "cost accounting",
      "negotiation",
      "government contracts",
      "mentoring",
      "influence",
      "creativity"
    ],
    "short_keywords": [
      "accounting",
      "analysis",
      "attention",
      "auditing",
      "budgeting",
      "cash",
      "change",
      "collaboration",
      "communication",
      "conflict",
      "contracts",
      "controller",
      "cost",
      "creativity",
      "detail",
      "director",
      "engagement",
      "finance",
      "financial",
      "flexibility",
      "flow",
      "gaap",
      "government",
      "influence",
      "inventory",
      "judgment",
      "leadership",
      "management",
      "mentoring",
      "negotiation",
      "of",
      "performance",
      "planning",
      "preparation",
      "principles",
      "problem",
      "reporting",
      "resolution",
      "resultsoriented",
      "selfreliance",
      "software",
      "solving",
      "stakeholder",
      "strategic",
      "tax",
      "teamwork",
      "to"
    ]
  },
  {
    "job_id": "3905247377",
    "job_title": "Finance Manager",
    "category": "FINANCE",
    "job_description": "WE ARE ASSISTING OUR CLIENT WITH THEIR SEARCH FOR A FINANCE MANAGER LOCATED IN NEW JERSEY. THIS IS A KEY ROLE WITHIN A GROWING ORGANIZATION, WHICH WILL BE HANDS-ON WITH BOTH PLANT OPERATIONS AND CORPORATE FINANCE ACTIVITIES. IF YOU HAVE PRIOR RELATED EXPERIENCE IN FINANCE WITHIN THE MANUFACTURING INDUSTRY, WE WANT TO SPEAK WITH YOU! \nRESPONSIBILITIES: ASSIST IN THE MONTHLY FINANCIAL CLOSE PROCESSPRODUCE FINANCIAL STATEMENT ANALYSIS TO SUPPORT MANAGEMENTLEVERAGE INFORMATION SYSTEMS AND ESTABLISH EFFICIENT PROCESSESMANAGE CASH FLOWS & BANK RECONCILIATIONSIMPLEMENT BEST PRACTICES AND PRODUCTIVITY INITIATIVES ACROSS THE ORGANIZATION, ENSURING COMPLIANCE, EFFICIENCY, AND EFFECTIVENESSMANAGE SALES REPORTINGPERFORM BUSINESS UNIT FINANCIAL REPORTING AND ANALYSISWORK DIRECTLY WITH THE GENERAL MANAGER ON PROCESS IMPROVEMENTWORK ON PROJECTS THAT INTEGRATE DIVISIONAL REPORTINGCOMMUNICATE WITH ACCOUNTS PAYABLE, BILLING, AND INVENTORY CONTROL TO MAINTAIN THE ACCURACY & INTEGRITY OF THE FINANCIAL STATEMENTS\nREQUIREMENTS:QUALIFIED CANDIDATES WILL HAVE 5+ YEARS OF ACCOUNTING EXPERIENCEBACHELOR’S DEGREE IS REQUIREDPRIOR EXPERIENCE WITHIN THE MANUFACTURING INDUSTRY IS HIGHLY PREFERRED CPA (CAN BE NON-ACTIVE) IS PREFERRED\nWORK MODEL: ON-SITE",
    "job_skill_set": [
      "financial analysis",
      "cash flow management",
      "bank reconciliations",
      "financial reporting",
      "accounting",
      "information systems",
      "compliance",
      "process improvement",
      "sales reporting",
      "communication",
      "teamwork",
      "problem solving",
      "initiative",
      "adaptability",
      "manufacturing finance experience",
      "CPA"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "analysis",
      "bank",
      "cash",
      "communication",
      "compliance",
      "cpa",
      "experience",
      "finance",
      "financial",
      "flow",
      "improvement",
      "information",
      "initiative",
      "management",
      "manager",
      "manufacturing",
      "problem",
      "process",
      "reconciliations",
      "reporting",
      "sales",
      "solving",
      "systems",
      "teamwork"
    ]
  },
  {
    "job_id": "3902860497",
    "job_title": "Regional & Specialty Banking Finance Manager",
    "category": "FINANCE",
    "job_description": "DESCRIPTION\n\nRESPONSIBLE FOR PROVIDING FINANCIAL PLANNING & ANALYSIS FOR REGIONAL BANKING AND BUSINESS CREDIT & SPECIALTY BANKING AND COMMUNITY DEVELOPMENT ORGANIZATIONS WITHIN THE CONSUMER & REGIONAL BANKING SEGMENT. PARTNERS CLOSELY WITH IDENTIFIED COLLEAGUES IN ONE OR MORE SIGNIFICANT BUSINESS SEGMENTS OR REGIONS, RESPONSIBLE FOR CONTINUOUS IMPROVEMENT ON FINANCIAL FOCUS AND PERFORMANCE EXPECTATIONS IN AN EFFORT TO DELIVER ENHANCED EARNINGS TO THE ORGANIZATION THROUGH STRATEGIC, SHORT & LONG-TERM FINANCIAL FORECASTING, BUDGETING, REPORTING, AND FINANCIAL ANALYSIS.\n\nTHIS ROLE IS A FAST PACED, DEADLINE DRIVEN POSITION, OFTEN REQUIRING PARTICIPATION, OR LEADING OF LARGE COMPLEX PROJECTS. PRODUCES MONTHLY REPORTING INFORMATION CONSUMED BY INTERNAL AND EXTERNAL AUDIENCES WHILE WORKING CLOSELY WITH SEGMENT, TREASURY, BALANCE SHEET MANAGEMENT, REGULATORY REPORTING, AND IT.\n\nDIRECT SUPERVISOR OF FINANCE PROFESSIONALS, LEADING AS AN INTEGRAL PARTNER IN THE PERFORMANCE OF SIGNIFICANT REGIONS AND/OR BUSINESS SEGMENTS.\n\nJOB DESCRIPTION\n\nENGAGE, COMMUNICATE, AND MANAGE EXPECTATIONS OF SEGMENT AND FINANCE LEADERSHIP TEAMSLEAD REGIONAL BANKING MONTHLY CLOSE AND FORECASTING PROCESSESFACILITATE PUSH DOWN OF HIGH-LEVEL ANNUAL SEGMENT BUDGET TO VARIOUS GEOGRAPHIC MARKETSDEVELOP AND DELIVER KEY FINANCIAL INSIGHTS THROUGH ACTION-ORIENTED REPORTINGPARTNER WITH REGIONAL BANKING AND FINANCE LEADERSHIP TEAMS TO CREATE AND EXECUTE STRATEGIES AND OTHER TACTICS TO IMPROVE PERFORMANCEESTABLISH REGULAR REPORTING ROUTINES OF KEY FINANCIAL PERFORMANCE INDICATORSPARTNER WITH SEGMENT MANAGEMENT AND INCENTIVE TEAMS TO HELP DESIGN, MODEL, AND MONITOR EFFECTIVENESS OF REGIONAL BANKING INCENTIVE PLANSWORK WITH SEGMENT MANAGEMENT TO SET SALES AND PRODUCTION GOALS THAT ARE ALIGNED TO FINANCIAL BUDGETANALYZE PRODUCT PROFITABILITY/PRICING TO OPTIMIZE RESULTS AND ACHIEVE FINANCIAL BUDGETPARTNER DIRECTLY WITH REGIONAL PRESIDENTS AND THEIR LEADERSHIP TEAMSOVERSEE THE ENTIRE FINANCIAL PLANNING PROCESS. PROVIDES ADVANCED, SHORT & LONG-TERM FINANCIAL ANALYSIS TO ASSESS PERFORMANCE, IDENTIFY TRENDS, AND EVALUATE FINANCIAL VIABILITY OF BUSINESS INITIATIVES. CONDUCTS AND DOCUMENTS COMPLEX AD-HOC FINANCIAL ANALYSIS PROJECTS.LEADS THE DEVELOPMENT AND ANALYZES BUDGETING, FORECASTING, AND/OR STRATEGIC PLANNING FOR AN IDENTIFIED SIGNIFICANT BUSINESS SEGMENT/REGION. IDENTIFIES TRENDS AND DEVELOPMENTS IN COMPETITIVE ENVIRONMENTS.GATHERS, ANALYZES, PREPARES, AND SUMMARIZES RECOMMENDATIONS FOR FINANCIAL PLANS, ACQUISITION ACTIVITY, FUTURE TRENDED FUTURE REQUIREMENTS, AND OPERATING FORECASTS. MONITOR BUDGET PERFORMANCE AND PROVIDE VARIANCE ANALYSIS TO SUPPORT DECISION MAKING.EVALUATE FINANCIAL PERFORMANCE AND IDENTIFY AREAS FOR IMPROVEMENT AND CONDUCT VARIANCE ANALYSIS AND PROVIDE INSIGHTS TO SUPPORT DECISION-MAKING.MANAGES ASSEMBLY OF MONTHLY FINANCIAL PERFORMANCE REVIEW MATERIALS. PREPARE AND DELIVER REGULAR AD-HOC REPORTS WITH WRITTEN COMMENTARY AND ANALYSIS ON BUSINESS PERFORMANCE. PRESENT FINANCIAL INSIGHTS TO SENIOR MANAGEMENT AND EXECUTIVE LEADERSHIP.HEAVY COLLABORATION WITH STRATEGY, INVESTOR RELATIONS, AND FINANCE CROSS-FUNCTIONAL TEAMS AND BUSINESS PARTNERS TO DRIVE FINANCIAL PERFORMANCE IMPROVEMENTS. PARTNER WITH CONTROLLERSHIP TO ENSURE APPROPRIATE G/L ENTRIES ARE PREPARED AND POSTED.MAINTAIN FINANCIAL FORECAST AND BUDGET TOOLS, DEVELOP ANNUAL BUDGET AND BUSINESS PLAN BASED ON THE DRIVERS OF THE BUSINESS THAT MEETS THE DESIRED CORPORATE TARGETS.ENSURE THE CONSISTENT DELIVERY OF DATA AND INFORMATION THAT SUPPORTS WRITING AND VERBAL REPORTING. PROVIDE GOVERNANCE OF FINANCIAL REPORTING AND FORECAST HIERARCHIES.IMPLEMENT IMPROVEMENTS TO ENHANCE THE EFFICIENCY OF FINANCIAL PROCESSES AND CREATE SOLUTIONS FOR DATA NEEDS IN A CHANGING REGULATORY REPORTING ENVIRONMENT.LEAD COLLEAGUE AND COMPENSATION PLANNING INCLUDING COORDINATION WITH HUMAN RESOURCES LIAISON TO ENSURE FORECAST ALIGNS WITH HIRING PLANS FOR CERTAIN SUPPORT FUNCTIONS WITHIN THE COMMERCIAL BANKATTRACT, DEVELOP, AND MANAGE A TEAM OF DIRECT REPORTS SUPPORTING FINANCIAL INFORMATION RUN/BUILD ENVIRONMENT\n\n\nBASIC QUALIFICATIONS\n\nBACHELORS DEGREE IN BUSINESS, FINANCE, ECONOMICS, ACCOUNTING, MATH, OR ENGINEERING REQUIRED8 - 10 YEARS OF FINANCE OR RISK MANAGEMENT EXPERIENCE IN FINANCIAL SERVICES INDUSTRYEXPERIENCE PARTNERING DIRECTLY WITH SEGMENT DIRECTORS/SENIOR LEADERSHIPSTRONG EXCEL & POWERPOINT EXPERIENCE REQUIRED\n\n\nPREFERRED QUALIFICATIONS\n\nMBA IN FINANCE OR ACCOUNTINGCPA, CFA, OR OTHER RELEVANT CERTIFICATIONSABILITY TO RESOLVE ISSUES & DRIVE PERFORMANCEDATA VISUALIZATION SKILLS FOR EXECUTIVE LEVEL PRESENTATIONSOUTSTANDING TIME MANAGEMENT AND PRIORITIZATION SKILLSMANAGEMENT, MENTORING, AND CLIENT PARTNERSHIP SKILLSTECHNICAL SKILLS: ESSBASE, EXCEL, POWERPOINTSELF-STARTER, PROACTIVE, ANALYTICAL, CURIOUS, GOAL-ORIENTED, RESOURCEFUL, PROBLEM-SOLVERWELL-DEVELOPED WRITTEN & VERBAL COMMUNICATION SKILLSSTRONG ANALYTICAL SKILLS WITH THE ABILITY TO TRANSLATE COMPLEX DATA INTO ACTIONABLE INSIGHTS.STRONG PROFICIENCY IN FINANCIAL MODELING, DATA ANALYSIS, AND MS EXCEL.PROVEN ABILITY TO WORK INDEPENDENTLY, MANAGE MULTIPLE PRIORITIES, AND MEET DEADLINES IN A FAST-PACED ENVIRONMENT.STRONG COMMUNICATION AND PRESENTATION SKILLS, WITH THE ABILITY TO EFFECTIVELY COMMUNICATE FINANCIAL INFORMATION TO STAKEHOLDERS AT ALL LEVELS.PROVEN LEADERSHIP AND TEAM MANAGEMENT EXPERIENCE, WITH THE ABILITY TO MENTOR AND DEVELOP TEAM MEMBERS.\n\n\nEXEMPT STATUS: (YES = NOT ELIGIBLE FOR OVERTIME PAY) (NO = ELIGIBLE FOR OVERTIME PAY)\n\nYES\n\nWORKPLACE TYPE\n\nHUNTINGTON IS AN EQUAL OPPORTUNITY AND AFFIRMATIVE ACTION EMPLOYER AND IS COMMITTED TO PROVIDING EQUAL EMPLOYMENT OPPORTUNITIES FOR ALL REGARDLESS OF RACE, COLOR, RELIGION, SEX, NATIONAL ORIGIN, AGE, DISABILITY, SEXUAL ORIENTATION, VETERAN STATUS, GENDER IDENTITY AND EXPRESSION, GENETIC INFORMATION, OR ANY OTHER BASIS PROTECTED BY LOCAL, STATE, OR FEDERAL LAW.\n\nTOBACCO-FREE HIRING PRACTICE: VISIT HUNTINGTON'S CAREER WEB SITE FOR MORE DETAILS.\n\nAGENCY STATEMENT: HUNTINGTON DOES NOT ACCEPT SOLICITATION FROM THIRD PARTY RECRUITERS FOR ANY POSITION",
    "job_skill_set": [
      "financial planning",
      "financial analysis",
      "budgeting",
      "forecasting",
      "performance metrics",
      "communication",
      "leadership",
      "team management",
      "problem solving",
      "time management",
      "collaboration",
      "analytical thinking",
      "presentation skills",
      "mentoring",
      "self-starter",
      "Excel",
      "PowerPoint",
      "data analysis",
      "financial modeling",
      "Essbase",
      "regulatory reporting",
      "variance analysis"
    ],
    "short_keywords": [
      "analysis",
      "analytical",
      "banking",
      "budgeting",
      "collaboration",
      "communication",
      "data",
      "essbase",
      "excel",
      "finance",
      "financial",
      "forecasting",
      "leadership",
      "management",
      "manager",
      "mentoring",
      "metrics",
      "modeling",
      "performance",
      "planning",
      "powerpoint",
      "presentation",
      "problem",
      "regional",
      "regulatory",
      "reporting",
      "selfstarter",
      "skills",
      "solving",
      "specialty",
      "team",
      "thinking",
      "time",
      "variance"
    ]
  },
  {
    "job_id": "3900070596",
    "job_title": "Area Finance Manager",
    "category": "FINANCE",
    "job_description": "DESCRIPTION\n\nWHO WE ARE:\n\nINTEGRATED POWER SERVICES (IPS) IS THE LEADING NORTH AMERICAN SOLUTION PROVIDER FOR POWER MANAGEMENT, ELECTRO-MECHANICAL AND ROTATING ASSETS. SERVING CUSTOMERS ACROSS A WIDE RANGE OF INDUSTRIES, INCLUDING POWER GENERATION, UTILITIES, WATER AND WASTEWATER, PETROCHEMICALS, AIR SEPARATION, OIL & GAS, METALS, MINING, PAPER, AGGREGATES, AND CEMENT.\n\nIPS DEFINES WORLD-CLASS ELECTRIC MOTOR AND GENERATOR REPAIR, AND POWER MANAGEMENT EVERY DAY. WHEN YOU WORK FOR IPS, YOU CAN LEARN FROM INDUSTRY EXPERTS AND DISCOVER YOUR POTENTIAL WHILE BEING PART OF A WINNING TEAM COMMITTED TO UPHOLDING OUR CORE VALUES: SAFETY, INTEGRITY, TEAMWORK, ACCOUNTABILITY, CUSTOMER FOCUS, ENTREPRENEURIAL SPIRIT.\n\nRESPONSIBILITIES AND EXPECTATIONS\n\nTHE AREA FINANCE MANAGER WILL OVERSEE THE FINANCIAL MANAGEMENT OF MULTIPLE SERVICE CENTERS IN A REGION. THIS POSITION IS RESPONSIBLE FOR DEVELOPMENT AND INTERPRETATION OF COMPLEX FINANCIAL AND OPERATIONAL DATA, PROVIDING INSIGHTS AND RECOMMENDATIONS, WHICH WILL HELP DRIVE IMPROVEMENTS IN OPERATIONS, SALES, AND OVERALL PROFITABILITY. SELECTED CANDIDATE WILL BE BASED OUT OF A SERVICE CENTER IN THE REGION.\n\nPARTNER WITH MANAGEMENT TEAM IN OVERALL FINANCIAL SUPPORT OF ASSIGNED ORGANIZATIONDEVELOP AND INTERPRET COMPLEX FINANCIAL AND OPERATIONAL INFORMATION FOR ANALYSIS TO FINANCIAL AND EXECUTIVE MANAGEMENT TEAMSWORK CLOSELY WITH REGIONAL AND AREA GENERAL MANAGER TO INTERPRET AND ANALYZE FINANCIAL DATA PROVIDE FINANCIAL BUDGETING AND DETAILED ANALYSIS OF ACTUAL BUDGET VERSUS PLANNED AND FORECASTED BUDGETS DEVELOP AND DIRECT SPECIAL PROJECTS, ENSURING ACCURATE AND TIMELY RESULTSPREPARE AND PRESENT KEY EXECUTIVE SUMMARY ANALYSIS TO FINANCIAL AND EXECUTIVE LEADERSHIPACT AS EXPERT POINT OF CONTACT FOR REGIONAL AND AREA GENERAL MANAGER FINANCIAL INQUIRIES AND ANALYSIS REQUESTSPROACTIVELY ANALYZE CURRENT PROCESSES TO IDENTIFY, RECOMMEND AND IMPLEMENT IMPROVEMENTSPROVIDE INSIGHT AND RECOMMENDATIONS FOR COST SAVINGS OR PROFITABILITY IMPROVEMENT STRATEGIESPREPARE AND PRESENT FORECASTS, REPORTING AND ANALYSIS INCLUDING BUT NOT LIMITED TO DETAILED P/L REVIEWSENSURE ADHERENCE WITH ALL COMPLIANCE AND CORPORATE PROCESSES, POLICIES AND PROCEDURES\n\nQUALIFICATIONS AND COMPETENCIES\n\nBACHELORS DEGREE IN ACCOUNTING OR FINANCE AND MINIMUM OF FIVE YEARS OF RELATED EXPERIENCE OR EQUIVALENT COMBINATION OF EDUCATION AND EXPERIENCEABILITY TO PRIORITIZE AND MAINTAIN HIGH DEGREE OF ORGANIZATIONSHARP ANALYTICAL AND PROBLEM-SOLVING SKILLSPOSES EXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLSABILITY TO ANALYZE AND INTERPRET COMPLEX DATA, TAKING APPROPRIATE ACTIONABILITY TO BUILD STRONG RELATIONSHIPS\n\nBENEFITS\n\nPAID TIME OFF (PTO)401K EMPLOYER MATCHBONUS INCENTIVESTUITION REIMBURSEMENT PROGRAMMEDICAL, DENTAL AND VISION PLANSEMPLOYEE ASSISTANCE PROGRAM (EAP)AND MORE!\n\nSALARY RANGE\n\n$110,000 - $125,000 PER YEAR\n\nIPS IS COMMITTED TO EQUAL EMPLOYMENT OPPORTUNITY REGARDLESS OF RACE, COLOR, ANCESTRY, RELIGION, SEX, NATIONAL ORIGIN, SEXUAL ORIENTATION, AGE, CITIZENSHIP, MARITAL STATUS, DISABILITY, OR VETERAN STATUS.\n\nANY OFFER OF EMPLOYMENT IS CONTINGENT UPON THE SUCCESSFUL COMPLETION OF A BACKGROUND INVESTIGATION. AS A FEDERAL CONTRACTOR, OUR COMPANY IS COMMITTED TO MAINTAINING A SAFE AND DRUG-FREE WORKPLACE. CANDIDATES FOR THIS POSITION ARE REQUIRED TO COMPLETE A PRE-EMPLOYMENT DRUG SCREEN SUCCESSFULLY. THE DRUG SCREENING PROCESS WILL INCLUDE TESTING FOR SUBSTANCES THAT MAY IMPAIR ONE'S ABILITY TO PERFORM THE JOB SAFELY AND EFFECTIVELY.\n\n#LW-DB1\n\n",
    "job_skill_set": [
      "financial management",
      "budgeting",
      "data analysis",
      "financial reporting",
      "accounting",
      "forecasting",
      "project management",
      "communication",
      "problem solving",
      "analytical skills",
      "organizational skills",
      "relationship building",
      "teamwork",
      "entrepreneurial spirit",
      "compliance"
    ],
    "short_keywords": [
      "accounting",
      "analysis",
      "analytical",
      "area",
      "budgeting",
      "building",
      "communication",
      "compliance",
      "data",
      "entrepreneurial",
      "finance",
      "financial",
      "forecasting",
      "management",
      "manager",
      "organizational",
      "problem",
      "project",
      "relationship",
      "reporting",
      "skills",
      "solving",
      "spirit",
      "teamwork"
    ]
  },
  {
    "job_id": "3901960753",
    "job_title": "Finance Manager",
    "category": "FINANCE",
    "job_description": "ABOUT LA RAZA COMMUNITY RESOURCE CENTER: \nLA RAZA COMMUNITY RESOURCE CENTER (LRCRC) IS A BILINGUAL, MULTI-SERVICE NON-PROFIT ORGANIZATION DEDICATED TO MEETING THE SOCIAL SERVICE, IMMIGRATION, EDUCATIONAL, AND LEADERSHIP DEVELOPMENT NEEDS OF LOW-INCOME FAMILIES AND INDIVIDUALS. LA RAZA COMMUNITY RESOURCE CENTER IS LOCATED IN THE HEART OF THE HISTORIC SAN FRANCISCO MISSION DISTRICT, THE VIBRANT CORNERSTONE OF SAN FRANCISCO'S LATINO COMMUNITY. WE HAVE BEEN SERVING THE COMMUNITY FOR OVER 50 YEARS. OUR SOCIAL SERVICES PROGRAM SERVICES INCLUDE A FOOD PANTRY, FAMILY COUNSELING, EDUCATIONAL WORKSHOPS, SUPPORT GROUPS, RENTAL ASSISTANCE, AND MANY OTHER SERVICES. OUR IMMIGRATION PROGRAM ATTORNEYS PROVIDE BOTH AFFIRMATIVE FAMILY-BASED IMMIGRATION SERVICES AND REMOVAL DEFENSE. ALL OF OUR SOCIAL SERVICES ARE FREE (SUBSIDIZED) AND LEGAL SERVICES ARE PRO BONO.\n\nJOB SUMMARY:\nREPORTING TO THE EXECUTIVE DIRECTOR AND THE CHIEF OF STAFF, THE FINANCE MANAGER WILL MANAGE THE DAILY FINANCIAL ACTIVITIES AND FUNCTIONS FOR AN ORGANIZATION INCLUDING: ACCOUNTING, BUDGET, CREDIT, INSURANCE, TAX, PAYROLL, AND TREASURY. THE FINANCE MANAGER WILL MANAGE THE ACCOUNTS RECEIVABLE AND ACCOUNTS PAYABLE.THE FINANCE MANAGER WILL ALSO ENSURE ALL FINANCIAL OPERATIONS ARE IN COMPLIANCE WITH GOVERNMENTAL RULES AND REGULATIONS. THIS ROLE WILL ALSO FORECAST AND MANAGE A CASH FLOW THAT MEETS THE NEEDS OF THE COMPANY. THE ROLE WILL PROVIDE GUIDANCE TO LRCRC'S PROGRAM DIRECTORS AND ADMINISTRATIVE STAFF IN FINANCIAL REPORTING OBJECTIVES AND STANDARDS TO ENSURE ACCURATE, COMPLIANT AND USEFUL FINANCIAL REPORTING IS PRODUCED.\nTHE FINANCE MANAGER WILL OVERSEE LRCRC’S BUDGET PROCESS AND WORK WITH PROGRAM DIRECTORS AND ADMINISTRATIVE STAFF TO PRODUCE AND MANAGE EFFECTIVE BUDGETS. ACTS AS AN ADVISOR TO MANAGEMENT ON REGULATIONS AND OTHER MATTERS THAT MAY IMPACT THE FINANCIAL ACTIVITIES OF THE COMPANY, ENGAGING WITH OUTSIDE CONSULTANTS IF APPLICABLE. THE FINANCE MANAGER WILL BE SUPPORTED BY OUR CHIEF OF STAFF TO CONSULT AND USE OUR CURRENT EXTERNAL ACCOUNTING SERVICES FIRM AND ASSIST WITH REINTEGRATING BUDGETING, ACCOUNTS RECEIVABLES, ACCOUNTS PAYABLES, REPORTING, AND FINANCIAL ANALYSIS BACK IN HOUSE.\nRESPONSIBILITIES:\nPERFORM FINANCIAL MANAGEMENT DUTIES INCLUDING GENERATING FINANCIAL DATA, COMPILING AND SUBMITTING REPORTS, ANALYZING INDUSTRY TRENDS AND ASSESSING THE FINANCIAL HEALTH OF THE COMPANY.OVERSEE THE OPERATIONS AND DEVELOPMENT OF THE COMPANY’S FINANCE DEPARTMENTS INCLUDING CREATING AND REVIEWING POLICIES, BUDGETING, RECRUITING, TRAINING AND CONDUCTING REGULAR ASSESSMENTS OF FINANCIAL PROCEDURES.SUPERVISE THE PREPARATION OF QUARTERLY AND ANNUAL ACCOUNT RECONCILIATIONS, MONITOR AND ENFORCE COMPLIANCE WITH TAX AND FINANCIAL REPORTING STANDARDS AND ASSIST WITH CASH FLOW FORECASTING.ADVISE COLLEAGUES AND EXECUTIVE MANAGEMENT ON DECISIONS RELATED TO THE COMPANY’S FINANCES.SUPERVISE THE DOCUMENTATION OF THE COMPANY’S FINANCIAL STATUS AND FORECASTS.MEDIATE BETWEEN THE ORGANIZATION, EMPLOYEES, STAKEHOLDERS, SHAREHOLDERS AND INVESTORS ON FINANCIAL ISSUES FOR AMICABLE RESOLUTION OF DIFFERENCES.CREATE STRATEGIC BUSINESS PLANS BASED ON THE ANALYSIS OF THE COMPANY’S STATUS AND FINANCIAL FORECASTS.\nFINANCIAL PLANNING AND ANALYSIS (FP&A):DEVELOP AND MANAGE THE COMPANY'S FINANCIAL PLANNING PROCESS.PREPARE BUDGETS, FORECASTS, AND FINANCIAL MODELS.ANALYZE FINANCIAL PERFORMANCE AND PROVIDE INSIGHTS TO SUPPORT STRATEGIC DECISION-MAKING.\nFINANCIAL REPORTING:PREPARE ACCURATE AND TIMELY FINANCIAL STATEMENTS IN ACCORDANCE WITH ACCOUNTING PRINCIPLES (E.G., GAAP OR IFRS).ENSURE COMPLIANCE WITH REGULATORY REQUIREMENTS AND REPORTING STANDARDS.COMMUNICATE FINANCIAL RESULTS TO MANAGEMENT, STAKEHOLDERS, AND RELEVANT DEPARTMENTS.\nBUDGET MANAGEMENT:MONITOR AND HELP IMPLEMENT THE ORGANIZATION'S BUDGET.IDENTIFY VARIANCES BETWEEN BUDGETED AND ACTUAL RESULTS AND PROVIDE EXPLANATIONS.RECOMMEND ADJUSTMENTS TO ENSURE FINANCIAL GOALS ARE MET.\nCASH MANAGEMENT:MANAGE CASH FLOW AND LIQUIDITY.OPTIMIZE WORKING CAPITAL TO ENSURE EFFICIENT USE OF RESOURCES.MONITOR AND FORECAST CASH NEEDS.\nACCOUNTS RECEIVABLE:GENERATE TIMELY AND ACCURATE CUSTOMER INVOICES ON A MONTHLY BASIS.KEEP PRECISE RECORD OF ALL INCOMING PAYMENTSMAKE CONTACT WITH CLIENTS TO ENSURE OUTSTANDING INVOICES ARE PAID.MONITOR DAILY COLLECTION REPORT FOR AMOUNT OF ACCOUNTS RECEIVABLE.ISSUE INVOICES AND BILLS.ASSIST IN GATHERING AND COMPILING DATA TO GENERATE MONTHLY REVENUE REPORTS AS WELL AS OTHER REPORTS RELEVANT TO ACCOUNTS RECEIVABLE\nACCOUNTS PAYABLE:RESPONSIBLE FOR RECEIVING PROCESSING AND VERIFYING INVOICES RELATED TO ACCOUNTS PAYABLES.PROCESS ACCOUNTS AND INCOMING PAYMENTS IN COMPLIANCE WITH FINANCIAL POLICIES AND PROCEDURES.PERFORMING DAY TO DAY FINANCIAL TRANSACTIONS, INCLUDING VERIFYING, CLASSIFYING, AND RECORDING ACCOUNTS PAYABLE DATA.PREPARING BILLS, INVOICES AND BANK DEPOSITS.RECONCILE THE ACCOUNTS PAYABLE LEDGER TO ENSURE THAT ALL BILLS AND PAYMENTS ARE ACCOUNTED FOR AND PROPERLY POSTED.VERIFY AND INVESTIGATE DISCREPANCIES, IF ANY, BY RECONCILING VENDOR ACCOUNTS AND MONTHLY VENDOR STATEMENTS.FACILITATE PAYMENT OF INVOICES DUE BY SENDING BILL REMINDERS AND CONTACTING CLIENTS.GENERATE REPORTS DETAILING ACCOUNTS PAYABLE STATUS.UNDERSTAND EXPENSE ACCOUNTS AND COST CENTERS.UNDERSTAND COMPLIANCE ISSUES AROUND ACCOUNTS PAYABLE PROCESSES (W-9, SALES TAX, ETC.)\nRISK MANAGEMENT:IDENTIFY AND ASSESS FINANCIAL RISKS.DEVELOP STRATEGIES TO MITIGATE FINANCIAL RISKS, SUCH AS CURRENCY FLUCTUATIONS OR INTEREST RATE CHANGES.IMPLEMENT RISK MANAGEMENT POLICIES AND PROCEDURES.\nFINANCIAL COMPLIANCE:ENSURE COMPLIANCE WITH RELEVANT FINANCIAL LAWS AND REGULATIONS.COORDINATE WITH INTERNAL AND EXTERNAL AUDITORS.IMPLEMENT AND MONITOR INTERNAL CONTROLS.\nTAX MANAGEMENT:OVERSEE TAX PLANNING AND COMPLIANCE.WORK WITH TAX AUTHORITIES AND EXTERNAL TAX ADVISORS.OPTIMIZE THE ORGANIZATION'S TAX POSITION.\nINVESTMENT ANALYSIS:EVALUATE INVESTMENT OPPORTUNITIES AND PROVIDE RECOMMENDATIONS.ASSESS THE FINANCIAL VIABILITY OF PROJECTS.MONITOR THE PERFORMANCE OF INVESTMENTS.\nCOST CONTROL:IMPLEMENT COST CONTROL MEASURES TO OPTIMIZE EXPENSES.ANALYZE COST STRUCTURES AND IDENTIFY AREAS FOR IMPROVEMENT.DEVELOP AND IMPLEMENT COST REDUCTION STRATEGIES.\nTEAM LEADERSHIP:PROVIDE GUIDANCE AND TRAINING TO TEAM MEMBERS.FOSTER A POSITIVE AND COLLABORATIVE WORK ENVIRONMENT.\nFINANCIAL SOFTWARE AND SYSTEMS:UTILIZE FINANCIAL MANAGEMENT SOFTWARE AND SYSTEMS FOR REPORTING AND ANALYSIS.STAY UPDATED ON TECHNOLOGICAL ADVANCEMENTS IN FINANCIAL MANAGEMENT TOOLS.\nSTRATEGIC FINANCIAL PLANNING:CONTRIBUTE TO THE DEVELOPMENT AND EXECUTION OF THE ORGANIZATION'S OVERALL STRATEGIC PLAN.PROVIDE FINANCIAL INSIGHTS TO SUPPORT LONG-TERM STRATEGIC GOALS.\nOTHER DUTIES ASSIGNED AS NEEDED\nQUALIFICATIONS:BACHELOR'S DEGREE IN ACCOUNTING, BUSINESS ADMINISTRATION, ECONOMICS, OR RELEVANT FIELD OR 5 YEARS OR MORE OF EQUIVALENT WORK EXPERIENCE AS A FINANCE ANALYST OR FINANCE MANAGERPROFESSIONAL CERTIFICATIONS SUCH AS CERTIFIED PUBLIC ACCOUNTANT (CPA), CHARTERED FINANCIAL ANALYST (CFA), CHARTERED ACCOUNTANT (CA) OR OBTAINED WITHIN THE FIRST 2 YEARS OF EMPLOYMENTSTRONG ANALYTICAL SKILLS, ANALYZE FINANCIAL DATA, TRENDS, AND PERFORMANCE METRICS TO PROVIDE VALUABLE INSIGHTS FOR DECISION-MAKING.EFFECTIVE COMMUNICATION SKILLS TO PRESENT FINANCIAL INFORMATION TO NON-FINANCE STAKEHOLDERS, MAKING RECOMMENDATIONS, AND COLLABORATING WITH OTHER DEPARTMENTS.LEADERSHIP AND MANAGEMENT SKILLS ARE ESSENTIAL FOR GUIDING AND MOTIVATING TEAM MEMBERS, AS WELL AS COORDINATING FINANCIAL ACTIVITIES WITHIN THE ORGANIZATION.THE ABILITY TO THINK STRATEGICALLY AND ALIGN FINANCIAL GOALS WITH OVERALL BUSINESS OBJECTIVES IS CRUCIAL.PROFICIENCY IN USING FINANCIAL MANAGEMENT SOFTWARE AND ENTERPRISE RESOURCE PLANNING (ERP) SYSTEMS IS IMPORTANT. KNOWLEDGE OF TOOLS SUCH AS EXCEL, FINANCIAL MODELING SOFTWARE, AND ACCOUNTING SOFTWARE.FAMILIARITY WITH RELEVANT FINANCIAL REGULATIONS, ACCOUNTING STANDARDS (SUCH AS GAAP OR IFRS), AND TAX LAWS TO ENSURE COMPLIANCE AND MINIMIZING LEGAL AND FINANCIAL RISKS.ADHERE TO HIGH ETHICAL STANDARDS AND MAINTAIN CONFIDENTIALITY.FAMILIARITY WITH THE FINANCIAL ASPECTS OF FEDERAL,STATE AND LOCAL FUNDING IN NON-PROFITSBENEFITS:  EMPLOYER PAID KAISER HEALTH INSURANCE INCLUDING COVERAGE FOR DEPENDENTS.EMPLOYER PAID KAISER VISION AND SUPPLEMENTAL VSP VISION (INCLUDING COVERAGE FOR DEPENDENTS)DELTA DENTAL WITH ORTHODONTICS, INCLUDING COVERAGE FOR DEPENDENTS.403(B) RETIREMENT PLAN WITH EMPLOYER MATCH UP TO 3% EMPLOYEE ASSISTANCE PROGRAM (EAP)VACATION: TWO (2) WEEKS PER YEAR INCREASING 50% EVERY 2 YEARS UP TO FOUR (4) WEEKS PAID SICK LEAVE 14 PAID HOLIDAYS (INCLUDES BIRTHDAY)PAID PARENTAL LEAVE (PER SAN FRANCISCO PAID PARENTAL LEAVE ORDINANCE)THREE (3) DAYS OF PAID BEREAVEMENT TIMEDAILY PAID LUNCH HOURAS A 501(C)(3) ORGANIZATION, WE QUALIFY FOR THE PUBLIC SERVICE LOAN FORGIVENESS PROGRAM\nLA RAZA COMMUNITY RESOURCE CENTER (LRCRC) IS COMMITTED TO PROVIDING EQUAL EMPLOYMENT OPPORTUNITIES FOR ANY EMPLOYEE OR APPLICANT WITHOUT REGARD TO RACE, COLOR, RELIGION, GENDER, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, NATIONAL ORIGIN, AGE, GENETIC INFORMATION, DISABILITY OR VETERAN STATUS. \n\n\nLRCRC ALSO PROVIDES REASONABLE ACCOMMODATION TO INDIVIDUALS WITH DISABILITIES OR BASED ON A SINCERELY HELD RELIGIOUS BELIEF, IN ACCORDANCE WITH APPLICABLE LAWS. IF YOU NEED TO INQUIRE ABOUT AN ACCOMMODATION, OR NEED ASSISTANCE WITH COMPLETING THE APPLICATION PROCESS, PLEASE EMAIL HR@LARAZACRC.ORG .",
    "job_skill_set": [
      "accounting",
      "financial reporting",
      "financial analysis",
      "cash management",
      "accounts receivable",
      "accounts payable",
      "tax management",
      "risk management",
      "financial compliance",
      "investment analysis",
      "GAAP",
      "CPA",
      "communication",
      "leadership",
      "analytical thinking",
      "strategic thinking",
      "collaboration",
      "problem solving",
      "team management",
      "ethical standards",
      "budgeting",
      "financial planning",
      "financial software",
      "cost control",
      "IFRS",
      "ERP systems",
      "Excel",
      "financial modeling",
      "CFA",
      "CA",
      "confidentiality"
    ],
    "short_keywords": [
      "accounting",
      "accounts",
      "analysis",
      "analytical",
      "budgeting",
      "ca",
      "cash",
      "cfa",
      "collaboration",
      "communication",
      "compliance",
      "confidentiality",
      "control",
      "cost",
      "cpa",
      "erp",
      "ethical",
      "excel",
      "finance",
      "financial",
      "gaap",
      "ifrs",
      "investment",
      "leadership",
      "management",
      "manager",
      "modeling",
      "payable",
      "planning",
      "problem",
      "receivable",
      "reporting",
      "risk",
      "software",
      "solving",
      "standards",
      "strategic",
      "systems",
      "tax",
      "team",
      "thinking"
    ]
  },
  {
    "job_id": "3904999159",
    "job_title": "V.I.E. Sustainable Finance Analyst",
    "category": "FINANCE",
    "job_description": "REFERENCE:\n\n24000B4X\n\nRESPONSIBILITIES\n\nWITHIN THE GLBA/ENV DEPARTMENT, YOU WILL JOIN THE SUSTAINABLE TEAM IN CHARGE OF STRUCTURING SUSTAINABLE FINANCE SOLUTIONS AND ESG ADVISORY SERVICES FOR THE BENEFIT OF THE BANK’S ISSUER AND INVESTOR CLIENTS. THIS TEAM WORKS IN COOPERATION WITH THE COVERAGE AND BUSINESS LINES OF GLBA AND DEPLOYS ITS ESG EXPERTISE TO DESIGN TAILOR-MADE PRODUCTS (BONDS, LOANS, GUARANTEES AND DERIVATIVES) AND SERVICES FITTING THE CLIENTS’ MARKET ACCESS OPTIMIZATION AND SUSTAINABLE BUSINESS PRACTICES. YOU WILL BE PART OF THIS TEAM’S REPRESENTATION IN AMER.\n\nTASKS AND RESPONSIBILITIES:\n\nASSIST GLBA AMER COVERAGE AND BUSINESS LINES TO FAMILIARIZE WITH ESG AND EMBED THE CONCEPTS IN THEIR OFFERCONTRIBUTE TO THE DEVELOPMENT, HAND IN HAND WITH THE GLBA AMER BUSINESS LINES AND COVERAGE, OF THE SUSTAINABLE PRODUCTS FOR ISSUERS AND INVESTORS, BRINGING EXPERTISE AND THE UNDERSTANDING OF MARKET PRACTICESCONTRIBUTE TO THE DEVELOPMENT, HAND IN HAND WITH THE GLBA AMER BUSINESS LINES AND COVERAGE, OF THE ESG ADVISORY OFFER FOR ISSUERS OFFERSINTERACT WITH ESG RATING AGENCIES AND OTHER ESG CONSULTANTSCONTRIBUTE TO THE DEPLOYMENT OF GLBA ESG ROADMAP IN AMER\n\nDUE TO THE VIE ELIGIBILITY CRITERIA A QUESTIONNAIRE WILL BE PROVIDED. PLEASE MAKE SURE TO ANSWER ALL THE QUESTIONS FOR AN EFFICIENT ANALYSIS OF YOUR APPLICATION.\n\nPLEASE NOTE THAT FOR THE MISSIONS OUTSIDE THE EUROPEAN COUNTRIES, A VISA IS NECESSARY. PLEASE MAKE SURE YOUR PASSPORT IS VALID UP TO 6 MONTHS AFTER THE END OF THE VIE CONTRACT TO NOT DELAY YOUR DEPARTURE. OTHERWISE, WE STRONGLY ADVISE YOU TO LAUNCH ASAP THE RENEWAL OF YOUR PASSPORT.\n\nREQUIRED\n\n PROFILE REQUIRED\n\nPLEASE NOTE THAT SINCE THIS PROGRAM IS PRIMARILY AN INTERNATIONAL DEVELOPMENT PROGRAM, CANDIDATES CANNOT APPLY TO A VIE ASSIGNMENT IN THEIR OWN COUNTRY OF CITIZENSHIP.\n\nTO FACILITATE THE EXAMINATION OF YOUR APPLICATION BY OUR ENGLISH-SPEAKING MANAGERS, WE THANK YOU FOR APPLYING IN ENGLISH.\n\nSTUDIES & EXPERIENCE:\n\nGRADUATE WITH A MASTER DEGREE FROM BUSINESS/ENGINEERING SCHOOL OR UNIVERSITY WITH A SPECIALIZATION IN FINANCE/SUSTAINABILITYA PREVIOUS EXPERIENCE IN FINANCE/ESG WOULD BE APPRECIATED\n\nLANGUAGE SKILLS:\n\nFLUENT IN ENGLISH (B2-C1)\n\nTECHNICAL, OPERATIONAL & SOFT SKILLS:\n\nPROFICIENT/GOOD COMMAND OF MS OFFICEGOOD COMMUNICATION AND PRESENTATION SKILLSGOOD TEAM SPIRIT, AS WELL AS ABLE TO WORK AUTONOMOUSLY, COOPERATION SKILLS\n\nTHE VIE ASSIGNMENT IN A NUTSHELL\n\nTHIS VIE IN NEW YORK IS TO BEGIN AS SOON AS POSSIBLE BUT YOU NEED TO PLAN 3 MONTHS BETWEEN YOUR APPLICATION DATE AND THE BEGINNING OF YOUR VIE ASSIGNMENT. IT WILL LAST 18 MONTHS.\n\nIN CASE A VISA IS NECESSARY, PLEASE MAKE SURE YOUR PASSPORT IS VALID UP TO 6 MONTHS AFTER THE END OF THE VIE CONTRACT TO NOT DELAY YOUR DEPARTURE.\n\nTHE VIE IS A SPECIFIC CONTRACT, UNDER BUSINESS FRANCE’S ELIGIBILITY CRITERIA, OPENED TO CANDIDATES UNDER 28 AND FROM THE MEMBER STATES OF THE EUROPEAN ECONOMIC SPACE. FOR FURTHER INFORMATION (INCLUDING YOUR FINANCIAL INDEMNITIES), PLEASE SEE MON VIE-VIA BUSINESS FRANCE.\n\nWE WOULD LIKE TO DRAW YOUR ATTENTION TO THE FACT THERE THAT YOUR VIE MISSION COULD POTENTIALLY GET POSTPONED, DEPENDING ON THE EVOLUTION OF THE HEALTH CRISIS AND SUBJECTS TO THE DECISION MADE BY THE CRISIS AND SUPPORT CENTRE OF THE MINISTRY OF EUROPE AND FOREIGN AFFAIRS (MEAE). IN ADDITION, THE SELECTED CANDIDATE WILL ONLY BE PAID UPON CONFIRMATION FROM BUSINESS FRANCE AND ARRIVAL IN THE COUNTRY OF ASSIGNMENT.\n\n WHY JOIN US\n\nAS SOON AS YOU ARRIVE, YOU WILL BE INTEGRATED INTO OUR TEAMS AND WILL LEARN EVERY DAY ALONGSIDE OUR EXPERTS, WHO WILL SUPPORT YOU IN YOUR TASKS. GRADUALLY, YOU WILL BECOME MORE INDEPENDENT IN YOUR PROJECTS, MAKING THIS EXPERIENCE A REAL CAREER ACCELERATOR. YOU WILL ALSO DISCOVER ALL THE DIVERSITY OF OUR BUSINESSES, IN A SECTOR THAT IS CONSTANTLY EVOLVING AND INNOVATING.\n\nAT THE END OF YOUR VIE, VARIOUS OPPORTUNITIES COULD BE OFFERED TO YOU, IN FRANCE AND ABROAD.\n\n BUSINESS INSIGHT\n\nAT SOCIETE GENERALE, WE ARE CONVINCED THAT PEOPLE ARE DRIVERS OF CHANGE, AND THAT THE WORLD OF TOMORROW WILL BE SHAPED BY ALL THEIR INITIATIVES, FROM THE SMALLEST TO THE MOST AMBITIOUS.\n\nWHETHER YOU’RE JOINING US FOR A PERIOD OF MONTHS, YEARS OR YOUR ENTIRE CAREER, TOGETHER WE CAN HAVE A POSITIVE IMPACT ON THE FUTURE. CREATING, DARING, INNOVATING AND TAKING ACTION ARE PART OF OUR DNA.\n\nIF YOU TOO WANT TO BE DIRECTLY INVOLVED, GROW IN A STIMULATING AND CARING ENVIRONMENT, FEEL USEFUL ON A DAILY BASIS AND DEVELOP OR STRENGTHEN YOUR EXPERTISE, YOU WILL FEEL RIGHT AT HOME WITH US!\n\nSTILL HESITATING?\n\nYOU SHOULD KNOW THAT OUR EMPLOYEES CAN DEDICATE SEVERAL DAYS PER YEAR TO SOLIDARITY ACTIONS DURING THEIR WORKING HOURS, INCLUDING SPONSORING PEOPLE STRUGGLING WITH THEIR ORIENTATION OR PROFESSIONAL INTEGRATION, PARTICIPATING IN THE FINANCIAL EDUCATION OF YOUNG APPRENTICES, AND SHARING THEIR SKILLS WITH CHARITIES. THERE ARE MANY WAYS TO GET INVOLVED.\n\nSOCIETE GENERALE IS AN EQUAL OPPORTUNITY EMPLOYER, AND WE ARE PROUD TO MAKE DIVERSITY A STRENGTH FOR OUR COMPANY. WE ARE COMMITTED TO RECOGNIZING AND PROMOTING THE TALENTS AND ACHIEVEMENTS OF OUR EMPLOYEES AND STAFF, REGARDLESS OF RACE, RELIGION, COLOR, NATIONAL ORIGIN, SEX, DISABILITY, AGE, GENDER, SEXUAL ORIENTATION, AND ANY OTHER CHARACTERISTIC OR STATUS PROTECTED UNDER APPLICABLE LAW.",
    "job_skill_set": [
      "MS Office",
      "finance",
      "communication",
      "presentation",
      "teamwork",
      "autonomy",
      "cooperation",
      "sustainable finance",
      "ESG advisory",
      "sustainability"
    ],
    "short_keywords": [
      "advisory",
      "analyst",
      "autonomy",
      "communication",
      "cooperation",
      "esg",
      "finance",
      "ms",
      "office",
      "presentation",
      "sustainability",
      "sustainable",
      "teamwork",
      "vie"
    ]
  },
  {
    "job_id": "3886890047",
    "job_title": "Assistant Finance Director",
    "category": "FINANCE",
    "job_description": "RESPONSIBLE FOR PLANNING, ORGANIZING AND MANAGING ASSIGNED ACTIVITIES IN THE FINANCE, CUSTOMER SERVICE AND LICENSE PLATE AGENCY DEPARTMENTS. PROVIDES THE DAY-TO-DAY SUPERVISION FOR RECEIVING, DISBURSING AND ACCOUNTING OF REVENUES AND EXPENDITURES FOR THE CITY. SUPERVISES THE ACCOUNTING, ACCOUNTS PAYABLE, REVENUE COLLECTION, UTILITY BILLING AND COLLECTION, UTILITY CUSTOMER SERVICE, FIXED ASSETS, ASSESSMENTS AND PAYROLL FUNCTIONS. PERFORMS THE SPECIALIZED ACCOUNTANT AND SUPERVISORY LEVEL WORK FOR THE CITY AND PROVIDES SIGNIFICANT FINANCIAL SUPPORT IN THE PREPARATION OF THE ANNUAL OPERATING AND CAPITAL BUDGETS AND THE CITY ANNUAL FINANCIAL REPORT (CAFR) PREPARATION. \nREQUIRED EDUCATION AND/OR EXPERIENCEBACHELOR'S DEGREE FROM FOUR-YEAR COLLEGE OR UNIVERSITY IN ACCOUNTING, BUSINESS, FINANCE, PUBLIC ADMINISTRATION OR A RELATED FIELD AND FIVE YEARS OR MORE EXPERIENCE IN FINANCE ADMINISTRATION (PREFERABLY IN LOCAL GOVERNMENT), AT LEAST TWO (2) YEARS OF WHICH MUST HAVE BEEN ABOVE THE FIRST-LINE SUPERVISORY LEVEL; OR EQUIVALENT COMBINATION OF EDUCATION AND EXPERIENCE.  SPECIAL REQUIREMENTSVALID N.C. DRIVER'S LICENSE AND ACCEPTABLE DRIVING RECORD.GOVERNMENT FINANCIAL OFFICER CERTIFICATION BY THE NORTH CAROLINA GOVERNMENTAL FINANCE OFFICERS ASSOCIATION (OR ABILITY TO OBTAIN WITHIN FIVE (5) YEARS OF HIRE DATE).\nSALARY RANGE $62,685 - $100,297, EXEMPT POSITION. VISIT WWW.WASHINGTONNC.GOV TO APPLY.",
    "job_skill_set": [
      "accounting",
      "finance",
      "budget preparation",
      "financial reporting",
      "supervisory skills",
      "revenue collection",
      "accounts payable",
      "payroll functions",
      "planning",
      "organizing",
      "management",
      "communication",
      "problem solving",
      "teamwork",
      "customer service",
      "utility billing",
      "fixed assets management",
      "public administration",
      "government financial officer certification"
    ],
    "short_keywords": [
      "accounting",
      "accounts",
      "administration",
      "assets",
      "assistant",
      "billing",
      "budget",
      "certification",
      "collection",
      "communication",
      "customer",
      "director",
      "finance",
      "financial",
      "fixed",
      "functions",
      "government",
      "management",
      "officer",
      "organizing",
      "payable",
      "payroll",
      "planning",
      "preparation",
      "problem",
      "public",
      "reporting",
      "revenue",
      "service",
      "skills",
      "solving",
      "supervisory",
      "teamwork",
      "utility"
    ]
  },
  {
    "job_id": "3888479494",
    "job_title": "Senior Analyst, Strategic Finance",
    "category": "FINANCE",
    "job_description": "STRENGTH IN TRUST\n\nONETRUST IS THE TRUST INTELLIGENCE CLOUD PLATFORM ORGANIZATIONS USE TO TRANSFORM TRUST FROM AN ABSTRACT CONCEPT INTO A MEASURABLE COMPETITIVE ADVANTAGE. ORGANIZATIONS GLOBALLY USE ONETRUST TO ENABLE THE RESPONSIBLE USE OF DATA WHILE PROTECTING THE PRIVACY RIGHTS OF INDIVIDUALS, IMPLEMENT AND REPORT ON THEIR CYBER SECURITY PROGRAM, MAKE THEIR SOCIAL IMPACT GOALS A REALITY, AND CREATE A SPEAK UP CULTURE OF TRUST. OVER 14,000 CUSTOMERS USE ONETRUST'S TECHNOLOGY, INCLUDING HALF OF THE GLOBAL 2,000. ONETRUST CURRENTLY RANKS #24 ON THE FORBES CLOUD 100 LIST OF TOP PRIVATE CLOUD COMPANIES IN THE WORLD AND EMPLOYS OVER 2,000 PEOPLE IN REGIONS ACROSS NORTH AMERICA, SOUTH AMERICA, ASIA, EUROPE, AND AUSTRALIA.\n\nTHE CHALLENGE\n\nWE'RE LOOKING FOR A RESULTS-ORIENTED AND DETAIL-FOCUSED INDIVIDUAL WITH A PASSION FOR CREATING AN IMPACT IN A GROWING COMPANY. AS AN EARLY MEMBER OF OUR TEAM, YOU'LL BE A HIGH IMPACT PLAYER, WORKING ON A WIDE RANGE OF TASKS FROM DRIVING OPERATIONAL PLANNING, TO DEVELOPING ECONOMIC FRAMEWORKS TO ASSESS BUSINESS OPPORTUNITIES.\n\nYOUR MISSION\n\nBUILD AND DEPLOY GLOBAL FINANCIAL MODELS AND OPERATIONAL PROCESSES, INCLUDING ANNUAL OPERATING PLAN AND IN SUPPORT OF INVESTMENT DECISIONSDEFINE FINANCIAL FRAMEWORKS TO EVALUATE CORE OPERATIONAL KPIS DRIVE LONG TERM UNIT ECONOMICSCONDUCT ANALYSES AND AD-HOC FINANCIAL MODELING TO IDENTIFY BUSINESS OPPORTUNITIES AND SUPPORT DECISION MAKING ACROSS THE COMPANY.DEVELOP MONTHLY AND QUARTERLY MANAGEMENT REPORTING, ANALYZE FINANCIAL RESULTS, DISTILL KEY TRENDS, ASSESS CURRENT AND FUTURE BUSINESS RISKS, AND PRESENT KEY MESSAGES TO SENIOR LEADERSHIP.COMMUNICATE AND PRESENT RESULTS OF ANALYSIS TO EXECUTIVE MANAGEMENT.\n\nYOU ARE\n\n3+ YEARS OF PROGRESSIVELY RESPONSIBLE EXPERIENCE IN STRATEGIC FINANCE, CONSULTING, INVESTMENT BANKING, OR RELATED FIELDS. TECHNOLOGY AND/OR SAAS EXPERIENCE PREFERRED.BACHELOR'S DEGREE IN FINANCE, ECONOMICS, OR A RELATED FIELD.EXPERT LEVEL FINANCIAL MODELING SKILLS WITH EXTREME ATTENTION TO DETAIL.ABILITY TO EMBRACE AMBIGUITY AND BREAK DOWN COMPLEX PROBLEMS TO PROVIDE CLEAR AND EFFECTIVE RECOMMENDATIONS.EXCELLENT COMMUNICATION SKILLS, WITH THE ABILITY TO ESTABLISH CREDIBILITY, BUILD CONSENSUS, AND PARTNER CROSS-FUNCTIONALLY WITHOUT DIRECT AUTHORITY.TEAM PLAYER WITH THE ABILITY TO PARTNER CROSS-FUNCTIONALLY IN A GROWING GLOBAL ORGANIZATION.\n\nFOR CALIFORNIA, COLORADO, CONNECTICUT, NEVADA, NEW YORK, RHODE ISLAND, AND WASHINGTON-BASED CANDIDATES: THE ANNUAL BASE PAY RANGE FOR THIS ROLE IS LISTED BELOW. WITHIN THIS RANGE, INDIVIDUAL PAY IS DETERMINED BY SEVERAL FACTORS, INCLUDING LOCATION, JOB-RELATED SKILLS, WORK EXPERIENCE, AND RELEVANT EDUCATION AND/OR TRAINING. THIS ROLE MAY ALSO BE ELIGIBLE FOR DISCRETIONARY BONUSES, EQUITY, AND/OR COMMISSIONS, AS WELL AS BENEFITS.\n\nSALARY RANGE\n\n$108,750—$163,125 USD\n\nWHERE WE WORK\n\nONETRUST EMBRACES A HYBRID WORKING MODEL. OUR WORKING@ ONETRUST INITIATIVE IS OUR WAY OF CLARIFYING WHERE WE HIRE, HOW WE WORK TOGETHER, AND WHERE WE’RE LOCATED IN THAT HYBRID MODEL.\n\nTHE UNDERLYING “WHY” FOR WORKING@ IS THAT WE ARE INTENTIONAL ABOUT THE CULTURE THAT WE WANT TO CREATE TOGETHER. THAT INCLUDES BRINGING TEAMS TOGETHER, IN-PERSON, THROUGHOUT THE YEAR TO COLLABORATE, BUILD CONNECTIONS, LEARN FROM EACH OTHER, AND CELEBRATE OUR WINS TO FINISH STRONGER.\n\nWE ARE COMMITTED TO A FLEXIBLE APPROACH INFORMED BY A SET OF GUIDING PRINCIPLES. YOU’LL SEE THAT REFLECTED IN OUR WORKER DESIGNATIONS: “OFFICE-FLEX” AND “LOCATION-FLEX”.\n\nOFFICE-FLEX: LIKE A TRADITIONAL HYBRID MODEL, ONETRUST “OFFICE-FLEX” EMPLOYEES MAY BE ASKED TO WORK IN AN OFFICE PERIODICALLY IF THEY ARE WITHIN A COMMUTABLE DISTANCE TO A ONETRUST OFFICE. THIS INCLUDES COMING INTO THE OFFICE FOR OUR COMPANY KICKOFF, COMPANY ALL HANDS, AND OTHER LARGER COMPANY EVENTS. BEYOND THAT, WE GIVE OUR LEADERS AND TEAMS THE FLEXIBILITY TO SET ADDITIONAL GUIDELINES BASED ON THE NATURE OF YOUR ROLE. LOCATION-FLEX: SIMILAR TO OTHER COMPANIES’ REMOTE POLICIES, FOR ONETRUST “LOCATION-FLEX\" ROLES, YOU WILL PRIMARILY WORK FROM YOUR HOME OFFICE LOCATION. HOWEVER, YOU MAY BE REQUIRED TO TRAVEL TO OUR ONETRUST OFFICES OR CUSTOMER SITES PERIODICALLY BASED ON THE NATURE OF YOUR ROLE.\n\nEACH ROLE MAY HAVE SPECIFIC REQUIREMENTS, SO WE ENCOURAGE YOU TO VERIFY THE LOCATION OF THE ROLE WITH YOUR RECRUITER DURING YOUR FIRST INTERVIEW.\n\nBENEFITS\n\nAS AN EMPLOYEE AT ONETRUST, YOU WILL BE PART OF THE ONETEAM. THAT MEANS YOU’LL RECEIVE SUPPORT PHYSICALLY, MENTALLY, AND EMOTIONALLY SO THAT YOU CAN DO YOUR BEST WORK BOTH IN AND OUT OF THE OFFICE. THIS INCLUDES COMPREHENSIVE HEALTHCARE COVERAGE, FLEXIBLE PTO, EQUITY STOCK OPTIONS, ANNUAL PERFORMANCE BONUS OPPORTUNITIES, RETIREMENT ACCOUNT SUPPORT, 14+ WEEKS OF PAID PARENTAL LEAVE, CAREER DEVELOPMENT OPPORTUNITIES, COMPANY-PAID PRIVACY CERTIFICATION EXAM FEES, AND MUCH MORE. SPECIFIC BENEFITS DIFFER BY COUNTRY. FOR MORE INFORMATION, TALK TO YOUR RECRUITER OR VISIT ONETRUST.COM/CAREERS.\n\nRESOURCES\n\nCHECK OUT THE FOLLOWING TO LEARN MORE ABOUT ONETRUST AND ITS PEOPLE:\n\nONETRUST CAREERS ON YOUTUBE@LIFEATONETRUST ON INSTAGRAM\n\nYOUR DATA\n\nYOU HAVE THE RIGHT TO HAVE YOUR PERSONAL DATA UPDATED OR REMOVED. YOU ALSO HAVE THE RIGHT TO HAVE A COPY OF THE INFORMATION ONETRUST HOLDS ABOUT YOU. FURTHER DETAILS ABOUT THESE RIGHTS ARE AVAILABLE ON THE WEBSITE IN OUR PRIVACY OVERVIEW. YOU CAN CHANGE YOUR MIND AT ANY TIME AND HAVE YOUR PERSONAL DATA REMOVED FROM OUR DATABASE. IN ORDER TO DO THIS YOU MUST CONTACT US AND LET US KNOW YOU WISH TO BE REMOVED. THE REQUEST SHOULD BE MADE ON THE DATA SUBJECT REQUEST FORM.\n\nOUR COMMITMENT TO YOU\n\nWHEN YOU JOIN ONETRUST YOU ARE STEPPING ONTO A LAUNCHING PAD — THE COUNTDOWN HAS BEGUN. THE DESTINATION? A CAREER WITHOUT BOUNDARIES WORKING ALONGSIDE A DIVERSE AND INCLUSIVE CREW WHO IS PASSIONATE ABOUT DOING MEANINGFUL WORK. AS A PIONEER, YOUR VOICE AND EXPERTISE WILL HELP CHART THE DIRECTION OF AN ENTIRELY NEW INDUSTRY — TRUST. OUR COMMITMENT TO PUTTING PEOPLE FIRST STARTS WITH YOU. YOUR GROWTH IS PART OF THE MISSION. OUR GOAL IS TO GIVE YOU THE POWER TO EMBARK ON THE NEXT PHASE OF YOUR UNIQUELY, UNIQUE CAREER\n\nONETRUST PROVIDES EQUAL EMPLOYMENT OPPORTUNITIES TO ALL EMPLOYEES AND APPLICANTS FOR EMPLOYMENT AND PROHIBITS DISCRIMINATION AND HARASSMENT OF ANY TYPE WITHOUT REGARD TO RACE, COLOR, RELIGION, AGE, SEX, NATIONAL ORIGIN, DISABILITY STATUS, GENETICS, PROTECTED VETERAN STATUS, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, OR ANY OTHER CHARACTERISTIC PROTECTED BY LOCAL LAWS.",
    "job_skill_set": [
      "data analysis",
      "operational planning",
      "KPI evaluation",
      "reporting",
      "strategic finance",
      "communication",
      "teamwork",
      "problem solving",
      "attention to detail",
      "adaptability",
      "credibility",
      "cross-functional collaboration",
      "consensus building",
      "financial modeling",
      "economic frameworks",
      "investment analysis",
      "SaaS experience",
      "consulting"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "analyst",
      "attention",
      "building",
      "collaboration",
      "communication",
      "consensus",
      "consulting",
      "credibility",
      "crossfunctional",
      "data",
      "detail",
      "economic",
      "evaluation",
      "experience",
      "finance",
      "financial",
      "frameworks",
      "investment",
      "kpi",
      "modeling",
      "operational",
      "planning",
      "problem",
      "reporting",
      "saas",
      "senior",
      "solving",
      "strategic",
      "teamwork",
      "to"
    ]
  },
  {
    "job_id": "3902828660",
    "job_title": "Vice President Finance",
    "category": "FINANCE",
    "job_description": "KNOWLEDGE AND SKILLS:THE IDEAL CANDIDATE IS INTELLIGENT, PROFESSIONAL, POLISHED, AND ARTICULATE, WITH GOOD INTERPERSONAL AND ANALYTICAL SKILLS.10+ YEARS RELEVANT BROKER-DEALER EXPERIENCE WORKING IN OPERATIONS AND/OR FINANCE AS A FINOP OR FINANCE MANAGEMENT POSITION AT A SELF-CLEARING BROKER-DEALER.EXPERT KNOWLEDGE OF BROKER-DEALER OPERATIONS, AND REGULATORY REPORTING NEEDS INCLUDING FINRA, SEC, AND OTHER AGENCIES AS REQUIRED.DEMONSTRATED ANALYTICAL SKILLS INCLUDING THE ABILITY TO SYNTHESIZE QUANTITATIVE AND QUALITATIVE DATA TO DRAW CONCLUSIONS AND ASSIST IN DECISION MAKING.EXTREMELY RELIABLE CHARACTER WITH A DEMONSTRATED ABILITY TO HANDLE SENSITIVE INFORMATION WITH DISCRETION.PRIOR EXPERIENCE ACROSS SEVERAL DISCIPLINES INCLUDING BUT NOT LIMITED TO OPERATIONS, FINANCE, COMPLIANCE, RISK MANAGEMENT, CASH MANAGEMENT, AND TREASURY IS A PLUS.COLLABORATE WITH THE CEO AND SENIOR MANAGEMENT ON THE DAY-TO-DAY OPERATIONS OF A PROPRIETARY TRADING FIRM.PARTNER WITH MANAGEMENT TO IDENTIFY AREAS FOR PROCESS IMPROVEMENT AND MAKE RECOMMENDATIONS FOR CHANGE.PERFORM P & S AND MARGIN CALCULATIONS TO ENSURE DATA RECONCILIATION.PREPARE FINANCIALS AND MAINTAIN BOOKS AND RECORDS FOR THE BROKER-DEALER IN COMPLIANCE WITH GAAP, WHILE MEETING ALL REGULATORY REPORTING REQUIREMENTS.ASSIST THE CFO IN PROVIDING RELEVANT SUPPORT FOR FINANCIAL INFORMATION ANALYSES, REPORTS, AND RECOMMENDATIONS.ENSURE TIMELY AND ACCURATE COMPLETION OF MONTH-END, QUARTER-END, AND YEAR-END CLOSING PROCESSES.STAY UPDATED ON REGULATORY DEVELOPMENTS AND MAKE STRATEGIC RECOMMENDATIONS FOR PROCESS/CONTROL MODIFICATIONS AND OVERSEE THEIR IMPLEMENTATION.MAINTAIN RELATIONSHIPS WITH KEY EXTERNAL STAKEHOLDERS (REGULATORY/GOVERNMENT BODIES, EXTERNAL AUDITORS) RELEVANT TO THE BROKER-DEALER.PROVIDE VALUE-ADDED AND STRATEGIC INSIGHT TO VARIOUS ORGANIZATIONAL AREAS WITHIN THE FIRM AND OTHER STAKEHOLDERS THROUGHOUT THE BUSINESS.MANAGE TAX PLANNING AND COMPLIANCE FOR ALL REQUIRED FEDERAL, STATE, LOCAL, PAYROLL, PROPERTY, AND OTHER APPLICABLE TAXES.SUPERVISE AND/OR PERFORM THE BROKER-DEALER'S RESPONSIBILITIES UNDER ALL FINANCIAL RESPONSIBILITY RULES GOVERNED BY THE SECURITIES EXCHANGE ACT OF 1934 (EXCHANGE ACT).DEMONSTRATE STRONG KNOWLEDGE OF ACCOUNTING PROCESSES THROUGH CLEAR COMMUNICATION AND PROMPT RESPONSIVENESS TO INTERNAL AND EXTERNAL PARTIES.COLLABORATE WITH ALL DEPARTMENTS TO ENSURE EFFICIENT AND ACCURATE CONSOLIDATION OF FINANCIAL INFORMATION AND NEW SYSTEMS WITH ACCOUNTING PROCESSES AND SYSTEMS.FACILITATE AND/OR PERFORM VARIOUS DUTIES, INCLUDING: FOCUS REPORTSNET CAPITAL COMPUTATIONSSUPPLEMENTAL SCHEDULE OF INCOME (SSOI)FORM CUSTODYBROKERAGE STATEMENT ANALYSISSECURITIES INVESTOR PROTECTION CORPORATION (SIPC)ANNUAL AUDIT SUPPORTFINRA EXAMINATION SUPPORTACCOUNTING DUE DILIGENCEBOOKKEEPINGOTHER DUTIES AS ASSIGNEDEDUCATION/CERTIFICATION:B.S. IN ACCOUNTING OR FINANCE REQUIRED; ADVANCED DEGREE IS A PLUSSERIES 27 IS REQUIRED CPA PREFERRED BUT NOT REQUIRED\n\n\n\n\nPOSTED SALARY: $200,000-$250,000",
    "job_skill_set": [
      "broker-dealer operations",
      "regulatory reporting",
      "financial analysis",
      "GAAP compliance",
      "tax planning and compliance",
      "accounting processes",
      "financial reporting",
      "data reconciliation",
      "margin calculations",
      "risk management",
      "operations management",
      "cash management",
      "financial responsibility rules",
      "bookkeeping",
      "SIPC compliance",
      "FINRA examination support",
      "audit support",
      "financial systems integration",
      "B.S. in Accounting or Finance",
      "analytical skills",
      "interpersonal skills",
      "communication skills",
      "collaboration",
      "discretion",
      "strategic thinking",
      "problem solving",
      "leadership",
      "reliability",
      "adaptability",
      "Series 27"
    ],
    "short_keywords": [
      "27",
      "accounting",
      "adaptability",
      "analysis",
      "analytical",
      "and",
      "audit",
      "bookkeeping",
      "brokerdealer",
      "bs",
      "calculations",
      "cash",
      "collaboration",
      "communication",
      "compliance",
      "data",
      "discretion",
      "examination",
      "finance",
      "financial",
      "finra",
      "gaap",
      "in",
      "integration",
      "interpersonal",
      "leadership",
      "management",
      "margin",
      "operations",
      "or",
      "planning",
      "president",
      "problem",
      "processes",
      "reconciliation",
      "regulatory",
      "reliability",
      "reporting",
      "responsibility",
      "risk",
      "rules",
      "series",
      "sipc",
      "skills",
      "solving",
      "strategic",
      "support",
      "systems",
      "tax",
      "thinking",
      "vice"
    ]
  },
  {
    "job_id": "3904369001",
    "job_title": "Finance Manager (Top Secret Clearance Required)",
    "category": "FINANCE",
    "job_description": "TITLE\n\nFINANCE MANAGER (TOP SECRET CLEARANCE REQUIRED)\n\nAS THE FINANCIAL MANAGER WITH KBR, YOU WILL PROVIDE SUPPORT TO THE OFFICE OF THE UNDERSECRETARY OF DEFENSE FOR RESEARCH AND ENGINEERING (OUSD(R&E) ASSISTANT SECRETARY OF DEFENSE FOR MISSION CAPABILITIES (ASD(MC)) AND THE DEPUTY ASSISTANT SECRETARY OF DEFENSE FOR PROTOTYPES & EXPERIMENTS (DASD(P&E)) LOCATED IN FALLS CHURCH, VA. THE ORGANIZATION’S MISSION IS TO IDENTIFY, DEVELOP, AND DEMONSTRATE FORWARD LOOKING CONCEPTS ENCOMPASSING MULTI-DOMAIN TECHNOLOGIES TO SATISFY MULTI-SERVICE AND COMBATANT COMMANDS PRIORITIES FOR THE DEPARTMENT OF DEFENSE.\n\nYOUR ESSENTIAL JOB FUNCTIONS WILL INCLUDE BUT MAY NOT BE LIMITED TO:\n\nPROVIDE FINANCIAL BUDGETARY AND CONTRACT SUPPORT TO PERFORM STATISTICAL ANALYSIS TO FORMULATE ANALYTICAL REPORTS FOR SENIOR LEADERSHIP.APPLY CONCEPTS OF BUDGET, PROGRAM PRINCIPLES, POLICIES, PROCEDURES, CONCEPTS, STANDARDS, TERMINOLOGY, AND KNOWLEDGE OF THE FINANCIAL MANAGEMENT AND BUSINESS OPERATION SYSTEMS OF THE ORGANIZATION.REVIEW, ALLOCATE, OR MANAGE ACQUISITION RESOURCES WHILE PROVIDING EXPERT ADVICE ON CONTRACT ADMINISTRATION.SUPPORT THE PROGRAM IN ALL THE SERVICES FOUND IN A PROGRAMMING OR COMPTROLLER SHOP TO INCLUDE PLANNING, PROGRAMMING, BUDGETING, EXECUTING (PPBE).PROVIDE FUNDING, FORECASTING, PROGRAMMING, BUDGET INFORMATION, EXECUTION STATUS AND FUNDS RECONCILIATION, FOLLOWING THE PPBE PROCESS, USING THE REQUESTED FINANCIAL MANAGEMENT TOOLS AND SYSTEMS.MONITOR AND REPORT THE STATUS OF APPROVED, DEFERRED, AND RELEASED FUNDS.DOCUMENT, MONITOR, COLLECT, COLLATE, ANNOTATE AND PROMULGATE OBLIGATION/EXPENDITURE RATES OF COMMITTED FUNDS.MAINTAIN COGNIZANCE OF VARIOUS PROGRAM FUNDS AND PROVIDE FINANCIAL INFORMATION AND OBLIGATION/EXPENDITURE PERFORMANCE GRAPHS FOR SENIOR LEADERSHIP REVIEW.CONTRIBUTE TO THE DEVELOPMENT OF PROGRAM AND BUDGET SUBMISSIONS (I.E. ISSUE PAPERS, AND RESEARCH, DEVELOPMENT, TEST AND EVALUATION DOCUMENTS (R-DOCS) AND RESEARCH AND DEVELOPMENT DESCRIPTIVE SUMMARIES (R-2S) AND PROGRAM OFFICE MEMORANDUM (POMS) INPUTS.HAVE KNOWLEDGE OF GOVERNMENTAL FINANCIAL ACTIVITY SYSTEMS, SUCH AS, BUT NOT LIMITED TO: CORE FINANCIALS (CF), ENTERPRISE BUSINESS ACCOUNTABILITY SYSTEM (EBAS), EXECUTION MANAGEMENT SYSTEM (EMS), G-INVOICE, DEFENSE AGENCIES INITIATIVE FINANCIAL MANAGEMENT TOOLS, THE COGNOS REPORTING TOOL AND THE COMPTROLLER EXHIBITS FOR R-2S WEBSITE.PREPARE MILITARY INTERDEPARTMENTAL PURCHASE REQUESTS (MIPRS), SUB-ALLOCATIONS AND INTER-AGENCY AGREEMENT FUNDING DOCUMENTS, MAINTAIN CORDIAL AND RESPECTFUL EMAIL AND TELEPHONE RELATIONS WITH MULTIPLE GOVERNMENT AND NON-GOVERNMENTAL POINTS OF CONTACT THROUGHOUT THE DOD, GOVERNMENT AND INDUSTRY.PROVIDE TECHNICAL ASSISTANCE WITHIN THE TASK ORDER SCOPE, INTERPRETING SPECIFICATIONS, STATEMENT OF WORK, AND PERFORMANCE WORK STATEMENTS.\n\nQUALIFICATIONS\n\nMINIMUM 10 YEARS’ OF FINANCIAL MANAGEMENT OR ACCOUNTING EXPERIENCE.5 YEARS’ PRIOR EXPERIENCE WORKING FOR SECRETARY OF THE AIR FORCE/FINANCIAL MANAGER (SAF/FM).EXPERIENCE MUST INCLUDE FINANCIAL MANAGEMENT EXPERIENCE IN THESE AREAS: LEAD FM OR DEPUTY FM FOR A $100M+ TECHNOLOGY DESIGN, MANUFACTURING, INTEGRATION, AND TEST PROGRAM OR FM LEADER OF A PORTFOLIO OF TECHNOLOGY DEVELOPMENT PROGRAMS.WORKING KNOWLEDGE OF THE EARNED VALUE MANAGEMENT SYSTEM (EVMS).EXPERIENCE WORKING CLASSIFIED PROGRAMS AT THE SCI LEVEL OR ABOVE.KNOWLEDGE OF THE DOD DEFENSE ACQUISITION SYSTEM. MILITARY OR OSD EXPERIENCE.PMP CERTIFICATION, DESIRED.\n\nEDUCATION REQUIREMENTS\n\nMS OR MA IN ACCOUNTING, BUDGET OR FINANCIAL DISCIPLINE THAT IS RELEVANT TO ACCOUNTING OR BUSINESS FINANCIAL MANAGEMENT.\n\nCLEARANCE REQUIREMENTS\n\nACTIVE TOP SECRET (TS) WITH SENSITIVE COMPARTMENTED INFORMATION (SCI) ELIGIBILITY.U.S. CITIZENSHIP IS REQUIRED FOR THIS POSITION.\n\nKBR IS AN EQUAL OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, DISABILITY, SEX, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, AGE, NATIONAL ORIGIN, VETERAN STATUS, GENETIC INFORMATION, UNION STATUS AND/OR BELIEFS, OR ANY OTHER CHARACTERISTIC PROTECTED BY FEDERAL, STATE, OR LOCAL LAW.\n\nR2087046",
    "job_skill_set": [
      "financial management",
      "program management",
      "financial reporting",
      "financial tools and systems",
      "communication",
      "teamwork",
      "problem solving",
      "interpersonal skills",
      "attention to detail",
      "analytical thinking",
      "adaptability",
      "leadership",
      "budgeting",
      "contract administration",
      "statistical analysis",
      "earned value management system (EVMS)",
      "government financial systems",
      "military interdepartmental purchase requests (MIPRs)",
      "financial forecasting",
      "program and budget submissions",
      "top secret clearance",
      "PMP certification"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "analysis",
      "analytical",
      "and",
      "attention",
      "budget",
      "budgeting",
      "certification",
      "clearance",
      "communication",
      "contract",
      "detail",
      "earned",
      "evms",
      "finance",
      "financial",
      "forecasting",
      "government",
      "interdepartmental",
      "interpersonal",
      "leadership",
      "management",
      "manager",
      "military",
      "miprs",
      "pmp",
      "problem",
      "program",
      "purchase",
      "reporting",
      "requests",
      "required",
      "secret",
      "skills",
      "solving",
      "statistical",
      "submissions",
      "system",
      "systems",
      "teamwork",
      "thinking",
      "to",
      "tools",
      "top",
      "value"
    ]
  },
  {
    "job_id": "3905841365",
    "job_title": "Finance Manager",
    "category": "FINANCE",
    "job_description": "ST. VINCENT DE PAUL OF BALTIMORE HAS MANDATED COVID-19 AND INFLUENZA VACCINES, AS APPLICABLE. EXCEPTIONS TO THE COVID AND FLU VACCINE REQUIREMENTS MAY BE PROVIDED TO INDIVIDUALS FOR RELIGIOUS BELIEFS OR MEDICAL REASONS. REQUESTS FOR AN EXCEPTION MUST BE SUBMITTED TO SVDP HUMAN RESOURCES DEPARTMENT FOR CONSIDERATION.\nABOUT USJOIN THE ST. VINCENT DE PAUL TEAM, WHERE WHAT YOU DO IS MUCH MORE THAN JUST A JOB—IT’S A CAUSE. OUR STAFF MEMBERS ARE TRUE PARTNERS IN OUR MISSION TO HELP THOSE IMPACTED BY POVERTY ACHIEVE THEIR FULL POTENTIAL. THEIR JOB SATISFACTION COMES FROM KNOWING THAT THEIR WORK EACH DAY HAS A POSITIVE IMPACT ON PEOPLE’S LIVES. IF YOU ARE THE TYPE OF PERSON WHO IS EXCITED AND MOTIVATED BY THE IDEA OF DOING GOOD FOR OTHERS, AND OUR COMMUNITY, COME JOIN US! WE ARE LOOKING FOR HIGH-ENERGY STAFF MEMBERS WILLING TO SHARE A COMMITMENT FOR OUR CAUSE IN A WORKPLACE FILLED WITH OTHER CARING PEOPLE. WE OFFER YOU A COMPETITIVE SALARY, GENEROUS BENEFITS, A CULTURE WHERE LEARNING AND GROWTH IS ENCOURAGED, A WORKPLACE WHERE EMPLOYEES ARE HIGHLY VALUED AND, MOST OF ALL, AN OPPORTUNITY TO BE PASSIONATE ABOUT WHAT YOU DO EVERY DAY. WE ARE GROWING AND LOOKING FOR A PASSIONATE PERSON TO JOIN OUR TEAM!\nSUMMARY\nTHE FINANCE MANAGER PERFORMS A VARIETY OF PROFESSIONAL LEVEL FUNCTIONS IN THE AREAS OF: GRANT ACCOUNTING, COMPLIANCE, AND REPORTING; FINANCIAL ANALYSIS; POLICY DEVELOPMENT; ACCOUNTS PAYABLES OVERSIGHT; AND THE ANNUAL SINGLE AUDIT. RESPONSIBLE FOR THE TIMELY AND ACCURATE MANAGEMENT OF ALL ASPECTS OF GRANTS ACCOUNTING, INCLUDING MONTHLY GRANT BILLINGS, PRE-AWARD PLANNING, BUDGETING, AND ANALYSIS, FORECASTING, AND REPORTING, COMPLYING WITH ALL APPLICABLE REQUIREMENTS. PERFORMS QUALITY CONTROL REVIEWS OF INVOICES RELATED TO GRANTS AND MONITORS THE COLLECTIONS OF PAYMENTS ON ALL GRANTS. PREPARES MONTHLY FINANCIAL REPORTING PACKAGE THAT INCLUDES SPEND-DOWN, RECEIVABLES AGING, AND OTHER KPIS EACH MONTH. SUPPORTS OVERALL ORGANIZATION BUDGETING, FORECASTING, FINANCIAL MODELING, AND ANALYSIS. \nPRIMARY DUTIES\nREGULARLY WITH INTERNAL (GRANTS AND VARIOUS PROGRAM DEPARTMENTS) AND EXTERNAL STAKEHOLDERS (FUNDERS) TO PROVIDE THE HIGHEST LEVEL OF CUSTOMER SERVICE AROUND FINANCIAL MANAGEMENT AND SUSTAINABILITY.AS A KEY CONTACT FOR ALL GRANTS AND ORGANIZATIONAL FINANCIAL ACTIVITY; PROVIDE FINANCIAL ANALYSIS, MANAGEMENT SUPPORT, AND GUIDANCE.REVIEW, AND DISTRIBUTE MONTHLY FINANCIAL REPORTS TO INTERNAL STAKEHOLDERS – EXECUTIVE AND SENIOR LEADERSHIP – ON A TIMELY BASIS AS A PART OF MONTHLY CLOSING PROCEDURES, CONSISTENTLY MEETING MONTHLY DEADLINES.GRANTS DEPARTMENT AND OTHER INTERNAL TEAMS WITH INFORMATION REQUESTS TO COMPLETE GRANT PROPOSALS – PROVIDE FINANCIAL ANALYSIS AND SUPPORTING DOCUMENTS.WITH GRANT MANAGERS TO COMPLY WITH FUNDER’S TERMS AND CONDITIONS, MANAGE DELIVERABLES, MONITOR SPENDING, REQUEST AMENDMENTS, DETERMINE FUNDING GAPS, OPPORTUNITIES AND PLAN SPEND-DOWN.GENERALLY ACCEPTED ACCOUNTING PRINCIPLES AND FEDERAL REGULATIONS TO PREPARE GRANT REPORTING TO INCLUDE ALL ALLOWABLE EXPENDITURES.THE PREPARATION AND ISSUANCE OF A MONTHLY GRANTS DASHBOARD.ORGANIZATION BUDGET CREATION, BUDGET PROJECTIONS, AND ANALYSIS.PROCESSES FOR STREAMLINED GRANTS FINANCIAL ADMINISTRATION.THE LABOR DISTRIBUTIONS FOR GRANTS DRIVEN FROM THE ANNUAL BUDGET PROCESS AND ADJUSTS AS NEEDED. COORDINATES WITH HR AND PAYROLL TO ENSURE ALLOCATIONS ARE UP TO DATE. REVIEWS MONTHLY SALARY TABLES GENERATED FOR GRANT SUPPORT.TIMELY AND ACCURATE PROCESSING OF GRANT RELATED REVENUES AND EXPENSES.ALL FEDERAL GRANT-RELATED SCHEDULES FOR ANNUAL AUDIT REQUIREMENTS AND COMPLETES OTHER DUTIES RELATED TO THE ANNUAL AUDIT, AS NEEDED.DASHBOARD METRICS AND COMMUNICATE THEM WITH THE PRESIDENT AND SENIOR MANAGEMENT.COMPLIANCE WITH THE GOVERNMENT AUDITING STANDARDS TOWARDS MONITORING OF FISCAL CONTROLS.OVERSITE OF THE ACCOUNTS PAYABLE PROCESS WORKING WITH THE ACCOUNTS PAYABLES SPECIALIST TO ENSURE ACCURATE AND TIMELY PROCESSING OF PAYMENTS.\nSECONDARY DUTIES\nENSURES THAT INQUIRIES ARE RESPONDED TO IN A PROFESSIONAL MANNER WITHIN ONE BUSINESS DAY. ASSIST IN RESEARCHING ANY PROBLEMS AND MAKE APPROPRIATE ADJUSTMENTS/CORRECTIONS TO SUCCESSFULLY RESOLVE THE PROBLEM. MONITOR THAT FOLLOW-UP CONTACTS ARE BEING MADE AT LEAST EVERY 48 HOURS UNTIL THE PROBLEM IS RESOLVED.WORKS ON SPECIAL PROJECTS AS APPROVED BY SUPERVISOR, BALANCING PRIORITIES TO ENSURE PROJECTS PROGRESS SIMULTANEOUSLY AND WITHIN ESTABLISHED DEADLINES.ASSISTS WITH ANNUAL AUDIT PREPARATION INCLUDING ANY ANALYSIS SCHEDULES AS ASSIGNED.MAINTAINS ALL ACCOUNTING AND PERMANENT FILES RELATED TO GRANTS. \nOTHER DUTIESMAINTAINS A NEAT AND ORGANIZED WORK AREA INCLUDING ACCESS TO ESSENTIAL INFORMATION.ATTENDS ALL STAFF MEETINGS AND OTHER MEETINGS AS DIRECTED.ASSISTS WITH AND ATTEND SPECIAL EVENTS HELD BY ST. VINCENT DE PAUL, AS NECESSARY.SUPPORTS A WELCOMING AND POSITIVE ENVIRONMENT.UPHOLDS THE VISION, MISSION AND VALUES OF ST. VINCENT DE PAUL.CREATES AN ATMOSPHERE OF CARE AND RESPECT FOR CLIENTS, STAFF, FUNDERS AND OTHER PARTNERS. PERFORMS OTHER DUTIES AS ASSIGNED WITHIN THE SCOPE OF THE POSITION.\nQUALIFICATIONSBACHELOR'S DEGREE IN ACCOUNTING, FINANCE, OR RELATED FIELD4 YEARS EXPERIENCE IN ACCOUNTING/FINANCE, NONPROFIT FIELD PREFERRED.2 YEARS EXPERIENCE WORKING WITH GRANTS.SUPERVISORY EXPERIENCEBUDGETING EXPERIENCESOPHISTICATED NONPROFIT FUND AND FEDERAL GRANT ACCOUNTING AND MANAGEMENT STRONGLY PREFERRED;IN ADDITION TO POSSESSING SKILLS IN MICROSOFT WORD, EXCEL, AND OUTLOOK, PROFICIENCY WITH ACCOUNTING SOFTWARE, SPREADSHEETS, AND DATA MANAGEMENT SYSTEMS REQUIRED.MUST POSSESS EXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLS, AS WELL AS INTERPERSONAL SKILLS TO EFFECTIVELY COMMUNICATE WITH VENDORS, VOLUNTEERS, AND STAFF TO PROVIDE CLEAR INSTRUCTION ON EXPECTED DELIVERABLES AND OUTCOMES.DEMONSTRATED SKILL IN PROVIDING A HIGH LEVEL OF SERVICE TO MULTIPLE CUSTOMERS, IDEALLY IN A NONPROFIT CONTEXT.EXPERIENCE WORKING AS PART OF A TEAM DELIVERING COORDINATED SERVICES HIGHLY DESIRABLE.POSSESS EXCELLENT ORGANIZATIONAL AND TIME MANAGEMENT SKILLS TO BE ABLE TO EFFICIENTLY PRIORITIZE WORK AND MEET IDENTIFIED DEADLINES.ABILITY TO WORK IN A FACE-PACED ENVIRONMENT, KEEP ALL WORK CURRENT AND ACCURATE, AND RESPOND TO IDENTIFIED DEPARTMENT DEADLINES WITH A SENSE OF URGENCY.EXPERIENCE IN A PROFESSIONAL OFFICE ENVIRONMENT.EXCELLENT PROBLEM-SOLVING SKILLS.ABILITY TO WORK INDEPENDENTLY.",
    "job_skill_set": [
      "financial analysis",
      "budgeting",
      "reporting",
      "Microsoft Excel",
      "accounting software",
      "data management systems",
      "communication",
      "interpersonal skills",
      "teamwork",
      "organizational skills",
      "problem-solving",
      "independence",
      "adaptability",
      "attention to detail",
      "grant accounting",
      "compliance",
      "accounts payables oversight",
      "financial modeling",
      "GAAP",
      "annual audit preparation",
      "customer service",
      "time management"
    ],
    "short_keywords": [
      "accounting",
      "accounts",
      "adaptability",
      "analysis",
      "annual",
      "attention",
      "audit",
      "budgeting",
      "communication",
      "compliance",
      "customer",
      "data",
      "detail",
      "excel",
      "finance",
      "financial",
      "gaap",
      "grant",
      "independence",
      "interpersonal",
      "management",
      "manager",
      "microsoft",
      "modeling",
      "organizational",
      "oversight",
      "payables",
      "preparation",
      "problemsolving",
      "reporting",
      "service",
      "skills",
      "software",
      "systems",
      "teamwork",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3902363249",
    "job_title": "D365 F&O Finance Consultant",
    "category": "FINANCE",
    "job_description": "GREAT PAY! CHALLENGING WORK! CONTINUOUS LEARNING! OPPORTUNITY TO ADVANCE!\nJOIN OUR TEAM AND BE AN INTEGRAL PART OF OUR D365 F&O PRACTICE. YOU WILL USE YOUR IMPLEMENTATION EXPERIENCES AND FUNCTIONAL KNOWLEDGE TO DELIVER INNOVATIVE SOLUTIONS THAT SOLVE CHALLENGING CLIENT PROBLEMS. IF YOU ARE LOOKING TO TAKE THE NEXT STEP IN YOUR CAREER WITH AN OPPORTUNITY TO LEARN, AN OPPORTUNITY TO ADVANCE, AN OPPORTUNITY TO BE A PART OF SOMETHING SPECIAL THEN RAND GROUP IS THE PLACE FOR YOU!\nCOMPENSATION AND BENEFITS:OBJECTIVE AND COMPREHENSIVE BONUS PROGRAMS REWARD YOUR CONTRIBUTIONS:PRODUCTION BONUSRECRUITING REFERRAL BONUSNEW BUSINESS REFERRAL BONUSCOMPANY PAID MAJOR MEDICAL HEALTH BENEFITSCOMPANY PAID DENTAL INSURANCE, LIFE INSURANCE, LONG TERM DISABILITY, SHORT TERM DISABILITY401K PLAN\nWORK LIFE BALANCE:TRAVEL NO MORE THAN 35%REMOTE AND HYBRID WORK ENVIRONMENT3 WEEKS PTOANNUAL CHARITY MATCH TO A NON-PROFIT OF YOUR CHOICE\nCAREER ADVANCEMENT:PERFORMANCE EVALUATIONS TWICE A YEAR80 HOURS ANNUAL TRAININGPERSONAL DEVELOPMENT PLAN THAT IS UPDATED ANNUALLY FOR CAREER PROGRESSION\nRESPONSIBILITIES:PARTICIPATE IN MULTIPLE ENGAGEMENTS AND IN ALL PHASES OF IMPLEMENTATIONADVANCE TO BECOME A FUNCTIONAL LEAD ON PROJECTS ASSIST IN THE PREPARATION OF BUSINESS REQUIREMENTS AND SYSTEM DESIGNABILITY TO WORK WITH TECHNICAL TEAM MEMBERS TO DEFINE AND DOCUMENT USER REQUIREMENTS AND FUNCTIONAL SPECIFICATIONSPARTICIPATE IN SOFTWARE CONFIGURATION, TESTING, TRAINING, DEPLOYMENT AND SUPPORTPROVIDE ONSITE AND OFFSITE CONSULTING SERVICES AND SUPPORT SUPPORT PROJECT MANAGEMENT DUTIES AS DIRECTED MAINTAIN CLIENT RELATIONSHIPS AND BECOME A TRUSTED ADVISORBECOME PROFICIENT IN ASSIGNED PRODUCTSENSURE QUALITY ASSURANCE MEASURESQUALIFICATIONS:4+ YEARS’ EXPERIENCE IMPLEMENTING AND USING D365 FINANCE OR A COMPARABLE MID-MARKET ERP SYSTEMBACHELOR’S DEGREE IN ACCOUNTING, FINANCE OR BUSINESS ADMINISTRATIONKNOWLEDGE OF MAJOR BUSINESS LIFE-CYCLES IN FINANCE, PURCHASING, SALES, INVENTORY AND PRODUCTIONEXPERIENCE WITH ISV SOLUTIONS FOR D365 FINANCE OR DYNAMICS AXEXPERIENCE IN A CONSULTING ENVIRONMENT STRONGLY PREFERRED DESIRE TO LEARN NEW SYSTEMS AND PROCESSES DEMONSTRATED PROBLEM SOLVING, ATTENTION TO DETAIL AND CRITICAL THINKING SKILLSABILITY TO DEVELOP CLIENT AND TEAM RELATIONSHIPS IN-PERSON AND REMOTELY POSSESS TIME MANAGEMENT SKILLS \nWHY RAND GROUP?\nJOIN A TEAM COMMITTED TO DELIVERING SOLUTIONS THAT WORKS SPECIFICALLY TO THE NEEDS OF EACH CLIENT. OUR CORE VALUES OF INTEGRITY AND RESPECT ARE OUR GUIDEPOSTS TO HOW WE WORK. SINCE 2003, RAND GROUP HAS EXPERIENCED CONSISTENT GROWTH YEAR OVER YEAR. TAKE CONTROL OF YOUR CAREER AND WORK AMONGST DRIVEN, TALENTED PROFESSIONALS IN THE INDUSTRY. WITH PERFORMANCE EVALUATIONS TWICE A YEAR, WE OFFER OPPORTUNITIES FOR CAREER ADVANCEMENT FOR OUR EMPLOYEES TO CHART THEIR OWN CAREER PATH.",
    "job_skill_set": [
      "Training",
      "Accounting",
      "Finance",
      "Business Administration",
      "Problem Solving",
      "Attention to Detail",
      "Critical Thinking",
      "Client Relationship Management",
      "Teamwork",
      "Time Management",
      "Communication",
      "Adaptability",
      "D365 Finance",
      "ERP Systems",
      "Business Requirements",
      "System Design",
      "Software Configuration",
      "Testing",
      "Deployment",
      "Quality Assurance",
      "ISV Solutions"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "administration",
      "assurance",
      "attention",
      "business",
      "client",
      "communication",
      "configuration",
      "consultant",
      "critical",
      "d365",
      "deployment",
      "design",
      "detail",
      "erp",
      "finance",
      "fo",
      "isv",
      "management",
      "problem",
      "quality",
      "relationship",
      "requirements",
      "software",
      "solutions",
      "solving",
      "system",
      "systems",
      "teamwork",
      "testing",
      "thinking",
      "time",
      "to",
      "training"
    ]
  },
  {
    "job_id": "3904954918",
    "job_title": "VP/Director of Finance",
    "category": "FINANCE",
    "job_description": "DESCRIPTION\n\nA WELL-RESPECTED ROBERT HALF GOVERNMENT CONTRACTOR CLIENT IS SEEKING AN INTERIM VP/DIRECTOR OF FINANCE TO JOIN THE COMPANY. THE DIRECTOR OF FINANCE & ACCOUNTING IS A KEY LEADER ON THE SITE’S LEADERSHIP TEAM. CONTRIBUTES TO ALL AREAS OF THE LOCATION’S MANAGEMENT AND PROVIDE STRONG FINANCIAL LEADERSHIP. THE DIRECTOR OF FINANCE & ACCOUNTING IS RESPONSIBLE FOR PLANNING AND COORDINATING BUDGET AND BUSINESS PLANNING ACTIVITIES IN ALIGNMENT WITH CORPORATE POLICIES AND PRACTICES. THIS POSITION WILL PARTNER WITH THE OPERATIONS TEAM TO DRIVE COMPANY INITIATIVES IN THE AREAS OF INVENTORY, FINANCIAL CONTROLS, REVENUE RECOGNITION, AND JOB COSTING. IN ADDITION, THIS ROLE ASSUMES OVERALL RESPONSIBILITY FOR GENERAL ACCOUNTING.\n\nDUTIES\n\nMANAGE ALL ACCOUNTING OPERATIONS INCLUDING BILLING, A/R, A/P, G/L, INVENTORY/JOB COST ACCOUNTING AND REVENUE RECOGNITIONMANAGE MONTH-END CLOSING AND COMPLETE ACTUAL TO BUDGET/FORECAST REPORTS AND OTHER OPERATIONAL REPORTSANALYZE VARIANCES AND COMMUNICATES EXPLANATIONS TO MANAGEMENT WITH RECOMMENDED ACTIONSINDIVIDUAL PROVIDES PROACTIVE / UNSOLICITED CONSULTATION, INTERPRETATION, AND EDUCATION OF COMPLEX FINANCIAL AND OPERATIONAL MATTERS TO VARIOUS DEPARTMENTAL LEADERS USED TO DRIVE BUSINESS DECISIONSCOLLABORATES DIRECTLY WITH DIRECTOR OF MANUFACTURING OPERATIONS TO EXPLAIN RESULTS, MAKE IMPROVEMENTS, MANAGE PROJECTS, IDENTIFY INEFFICIENCIES, UNDERSTAND OPERATIONS, AND LEAD THE DEVELOPMENT OF COMPLEX ANALYSISMONITOR AND IMPLEMENT INTERNAL CONTROLS (IN CONJUNCTION WITH CORPORATE POLICIES) AS NECESSARY TO ENSURE REPORTING INTEGRITY, SAFEGUARD COMPANY ASSETS, AND IDENTIFY RISKSINVENTORY COUNTS RECONCILE TO GLCOMPLETE THE UK REPORTING (MMR AND TB).COMPLETE FLASH REPORTSTANDARD COST DEVELOPMENT AND MAINTENANCE LABOR AND OVERHEAD RATESLABOR UTILIZATIONVARIANCE REVIEWMONTH-END CLOSING/CUT-OFFMANAGEMENT REPORTINGPROVIDE LEADERSHIP FOR THE ACCOUNTING AND FINANCE STAFFSUPPORTS VP OF OPERATIONS WITH LINE OF BUSINESS BUDGET AND FORECAST PREPARATION IN CONJUNCTION WITH MANAGER OF ACCOUNTING OPERATIONS.\n\n\nSKILLS/QUALIFICATIONS\n\nJOB COST EXPERIENCESTRONG UNDERSTANDING OF GENERALLY ACCEPTED ACCOUNTING PRINCIPLES (GAAP)MRP EXPERIENCEDELTEK COSTPOINTCOST ACCOUNTING EXPERIENCEMS OFFICE EXPERTISEBACHELOR’S DEGREE IN ACCOUNTING OR RELATED FIELDSTRONG ANALYTICAL, PLANNING, AND ORGANIZATIONAL SKILLS5+ YEARS’ EXPERIENCE IN A SIMILAR POSITIONWORKING KNOWLEDGE OF BUDGETING AND FORECASTING TECHNIQUESEXCELLENT LEADERSHIP AND TEAM MANAGEMENT SKILLSDEFENSE INDUSTRY EXPERIENCE IS DESIRED.INTERNATIONAL FINANCIAL REPORTING STANDARDS (IFRS), AND FINANCIAL REGULATIONS IS DESIRED.\n\n\nREQUIREMENTS\n\n HIGH LEVEL OF INTEGRITY, CONFIDENTIALLY, AND ACCOUNTABILITY MUST HAVE EXCELLENT COMMUNICATION (WRITTEN AND VERBAL) SKILLS TO INTERACT CLEARLY AND EFFECTIVELY IN A FAST-CHANGING ENVIRONMENT MUST MAINTAIN A HIGH LEVEL OF ACCURACY WHILE BEING DETAIL ORIENTED SUPER ANALYTICAL THINKING, PLANNING, PRIORITIZATION, AND EXECUTION SKILLS CPA DESIGNATION OR MBA HIGHLY PREFERRED MINIMUM OF 8 YEARS' EXPERIENCE AT AN EXECUTIVE LEVEL ROLE BACHELOR OR BUSINESS ADMINISTRATION DEGREE WITH A SPECIALIZATION IN FINANCE OR ACCOUNTING\n\n\nROBERT HALF IS THE WORLD’S FIRST AND LARGEST SPECIALIZED TALENT SOLUTIONS FIRM THAT CONNECTS HIGHLY QUALIFIED JOB SEEKERS TO OPPORTUNITIES AT GREAT COMPANIES. WE OFFER CONTRACT, TEMPORARY AND PERMANENT PLACEMENT SOLUTIONS FOR FINANCE AND ACCOUNTING, TECHNOLOGY, MARKETING AND CREATIVE, LEGAL, AND ADMINISTRATIVE AND CUSTOMER SUPPORT ROLES.\n\nROBERT HALF WORKS TO PUT YOU IN THE BEST POSITION TO SUCCEED. WE PROVIDE ACCESS TO TOP JOBS, COMPETITIVE COMPENSATION AND BENEFITS, AND FREE ONLINE TRAINING. STAY ON TOP OF EVERY OPPORTUNITY - WHENEVER YOU CHOOSE - EVEN ON THE GO.\n\nALL APPLICANTS APPLYING FOR U.S. JOB OPENINGS MUST BE LEGALLY AUTHORIZED TO WORK IN THE UNITED STATES. BENEFITS ARE AVAILABLE TO CONTRACT/TEMPORARY PROFESSIONALS, INCLUDING MEDICAL, VISION, DENTAL, AND LIFE AND DISABILITY INSURANCE. HIRED CONTRACT/TEMPORARY PROFESSIONALS ARE ALSO ELIGIBLE TO ENROLL IN OUR COMPANY 401(K) PLAN. VISIT\n\n© 2024 ROBERT HALF. AN EQUAL OPPORTUNITY EMPLOYER. M/F/DISABILITY/VETERANS. BY CLICKING “APPLY NOW,” YOU’RE AGREEING TO",
    "job_skill_set": [
      "budgeting",
      "leadership",
      "team management",
      "communication",
      "analytical thinking",
      "planning",
      "organizational skills",
      "accountability",
      "detail-oriented",
      "execution",
      "job costing",
      "GAAP",
      "MRP",
      "Deltek Costpoint",
      "cost accounting",
      "MS Office",
      "forecasting",
      "financial reporting",
      "IFRS",
      "financial regulations",
      "CPA",
      "MBA",
      "integrity",
      "prioritization"
    ],
    "short_keywords": [
      "accountability",
      "accounting",
      "analytical",
      "budgeting",
      "communication",
      "cost",
      "costing",
      "costpoint",
      "cpa",
      "deltek",
      "detailoriented",
      "execution",
      "finance",
      "financial",
      "forecasting",
      "gaap",
      "ifrs",
      "integrity",
      "job",
      "leadership",
      "management",
      "mba",
      "mrp",
      "ms",
      "of",
      "office",
      "organizational",
      "planning",
      "prioritization",
      "regulations",
      "reporting",
      "skills",
      "team",
      "thinking",
      "vpdirector"
    ]
  },
  {
    "job_id": "3905867381",
    "job_title": "Senior Finance Manager, Reporting Innovation",
    "category": "FINANCE",
    "job_description": "APPLY NOW\n\nSHARE\n\nDESCRIPTION\n\nJOHNSON & JOHNSON IS RECRUITING FOR A SR. FINANCE MANAGER, REPORTING INNOVATION, LOCATED IN NEW BRUNSWICK, NJ\n\nTHIS ROLE WILL BE RESPONSIBLE FOR THE NEW AND NEXT GENERATION REPORTING SOLUTIONS IDENTIFICATION, INTRODUCTION, AND INITIAL CONCEPTUALIZATION AND PLAY-TEST EFFORT. REPORTING INNOVATION WILL OUTLINE WHAT OUR REPORTING CAPABILITIES SHOULD LOOK LIKE, WHAT REPORTING TECHNOLOGIES AND TOOLS SHOULD BE USED TO ENSURE J&J IS THE INDUSTRY LEADER FOR OUTSTANDING REPORTING SOLUTIONS. THE REPORTING INNOVATION EFFORT SHOULD ALSO COVER NON-FINANCE BUSINESS PARTNER (“NFBP”) SOLUTIONS TO SUPPORT THEIR NEEDS TO MAKE GOOD BUSINESS DECISIONS.\n\nKEY RESPONSIBILITIES\n\n DEFINE NEXT GENERATION REPORTING CAPABILITIES INCLUDING TOOLS AND TECHNOLOGIES, TO ACCOMMODATE TO NEW WANTS OR NEEDS OF THE KEY STAKEHOLDERS.  CONDUCT EXTENSIVE RESEARCH AND BENCHMARK ANALYSIS TO IDENTIFY GAPS WITH INDUSTRY LEADING PRACTICES.  ALIGN WITH ALL LEVELS OF LEADERSHIP, PROCESS OWNERS AND KEY STAKEHOLDERS ON IDENTIFIED SOLUTIONS.  SEEK TO IMPROVE EXISTING REPORTING CAPABILITIES WHENEVER NEEDED. \n\nQUALIFICATIONS\n\nEDUCATION\n\n BACHELOR’S DEGREE OR EQUIVALENT IN ACCOUNTING / FINANCE IS REQUIRED.  ADVANCED DEGREES / CERTIFICATIONS SUCH AS A CPA, CMA, PMP OR MBA / MASTER’S ARE PREFERRED. \n\nEXPERIENCE AND SKILLS\n\n REQUIRED: \n\n A MINIMUM OF 8 YEARS OF FINANCE, ACCOUNTING OR RELATED BUSINESS EXPERIENCE IS REQUIRED.  CHANGE MANAGEMENT SKILLS AND ABILITY TO WORK IN UNEXPECTED AND AMBIGUOUS SITUATIONS, INCLUDING THE ABILITY TO DRIVE OTHERS TO ADAPT TO A CHANGING ENVIRONMENT IS REQUIRED.  ABILITY TO PARTNER WITH, INFLUENCE AND EFFECTIVELY CONNECT WITH ALL LEVELS OF THE ORGANIZATION, INCLUDING SENIOR MANAGEMENT IS REQUIRED. \n\nPREFERRED\n\n HIGHLY MOTIVATED INDIVIDUAL WITH STRONG ANALYTICAL SKILLS, INTELLECTUAL CURIOSITY AND VALIDATED LEADERSHIP SKILLS.  EXPERIENCE CRAFTING, DEVELOPING, IMPLEMENTING, AND LEADING FP&A PROCESSES THROUGH A GLOBAL ORGANIZATION IS STRONGLY PREFERRED.  INNOVATIVE AND CONTINUOUS IMPROVEMENT MINDSET WITH THE ABILITY TO TRANSLATE A COMPLEX BUSINESS OPERATIONS LANDSCAPE INTO A STREAMLINED PROCESS DESIGN IS PREFERRED.  UNDERSTANDING OF NEXT-GENERATION TECHNOLOGIES (E.G., RPA, NLG, AI, ML) AND HOW THEY CAN DRIVE PROCESS IMPROVEMENT IS HELPFUL.  PROVEN UNDERSTANDING AND EXPERIENCE OF MS OFFICE, SAP, SAC, AND BW FINANCIAL DATA ANALYTICS AND REPORTING MODULES.  KNOWLEDGE OF SOX FINANCIAL CONTROLS ON ACCOUNTING AND REPORTING PROCESSES, \n\nEXPERIENCE WORKING IN A SOPHISTICATED MULTI-ERP SYSTEM ENVIRONMENT\n\nOTHER\n\n THE PREFERRED LOCATION FOR THIS ROLE IS NEW BRUNSWICK, NEW JERSEY.  THE ROLE MAY REQUIRE UP TO 10% DOMESTIC AND/OR INTERNATIONAL TRAVEL. \n\nTHE BASE PAY RANGE FOR THIS POSITION IS $113,000 - $195,500\n\nTHE COMPANY MAINTAINS HIGHLY COMPETITIVE, PERFORMANCE-BASED COMPENSATION PROGRAMS.  UNDER CURRENT GUIDELINES, THIS POSITION IS ELIGIBLE FOR AN ANNUAL PERFORMANCE BONUS IN ACCORDANCE WITH THE TERMS OF THE APPLICABLE PLAN.  THE ANNUAL PERFORMANCE BONUS IS A CASH BONUS INTENDED TO PROVIDE AN INCENTIVE TO ACHIEVE ANNUAL TARGETED RESULTS BY REWARDING FOR INDIVIDUAL AND THE CORPORATION’S PERFORMANCE OVER A CALENDAR/ PERFORMANCE YEAR.  BONUSES ARE AWARDED AT THE COMPANY’S DISCRETION ON AN INDIVIDUAL BASIS.\n\nEMPLOYEES MAY BE ELIGIBLE TO PARTICIPATE IN COMPANY EMPLOYEE BENEFIT PROGRAMS SUCH AS HEALTH INSURANCE, SAVINGS PLAN, PENSION PLAN, DISABILITY PLAN, VACATION PAY, SICK TIME, HOLIDAY PAY, AND WORK, PERSONAL AND FAMILY TIME OFF IN ACCORDANCE WITH THE TERMS OF THE APPLICABLE PLANS. FOR ADDITIONAL GENERAL INFORMATION ON COMPANY BENEFITS, PLEASE GO TO: -  HTTPS://WWW.CAREERS.JNJ.COM/EMPLOYEE-BENEFITS\n\nJOHNSON & JOHNSON IS AN AFFIRMATIVE ACTION AND EQUAL OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, AGE, NATIONAL ORIGIN, OR PROTECTED VETERAN STATUS AND WILL NOT BE DISCRIMINATED AGAINST ON THE BASIS OF DISABILITY.\n\nFOR MORE INFORMATION ON HOW WE SUPPORT THE WHOLE HEALTH OF OUR EMPLOYEES THROUGHOUT THEIR WELLNESS, CAREER AND LIFE JOURNEY, PLEASE VISIT WWW.CAREERS.JNJ.COM .]",
    "job_skill_set": [
      "financial reporting",
      "FP&A processes",
      "MS Office",
      "change management",
      "leadership",
      "analytical skills",
      "communication",
      "influence",
      "problem solving",
      "adaptability",
      "collaboration",
      "intellectual curiosity",
      "data analytics",
      "SAP",
      "SOX compliance",
      "RPA",
      "NLG",
      "AI",
      "ML",
      "multi-ERP systems",
      "innovation"
    ],
    "short_keywords": [
      "adaptability",
      "ai",
      "analytical",
      "analytics",
      "change",
      "collaboration",
      "communication",
      "compliance",
      "curiosity",
      "data",
      "finance",
      "financial",
      "fpa",
      "influence",
      "innovation",
      "intellectual",
      "leadership",
      "management",
      "manager",
      "ml",
      "ms",
      "multierp",
      "nlg",
      "office",
      "problem",
      "processes",
      "reporting",
      "rpa",
      "sap",
      "senior",
      "skills",
      "solving",
      "sox",
      "systems"
    ]
  },
  {
    "job_id": "3901689184",
    "job_title": "Senior Manager, Digital & Events Finance - CNBC",
    "category": "FINANCE",
    "job_description": "COMPANY DESCRIPTION\n\nWE CREATE WORLD-CLASS CONTENT, WHICH WE DISTRIBUTE ACROSS OUR PORTFOLIO OF FILM, TELEVISION, AND STREAMING, AND BRING TO LIFE THROUGH OUR THEME PARKS AND CONSUMER EXPERIENCES. WE OWN AND OPERATE LEADING ENTERTAINMENT AND NEWS BRANDS, INCLUDING NBC, NBC NEWS, MSNBC, CNBC, NBC SPORTS, TELEMUNDO, NBC LOCAL STATIONS, BRAVO, USA NETWORK, AND PEACOCK, OUR PREMIUM AD-SUPPORTED STREAMING SERVICE. WE PRODUCE AND DISTRIBUTE PREMIER FILMED ENTERTAINMENT AND PROGRAMMING THROUGH UNIVERSAL FILMED ENTERTAINMENT GROUP AND UNIVERSAL STUDIO GROUP, AND HAVE WORLD-RENOWNED THEME PARKS AND ATTRACTIONS THROUGH UNIVERSAL DESTINATIONS & EXPERIENCES. NBCUNIVERSAL IS A SUBSIDIARY OF COMCAST CORPORATION.\n\nHERE YOU CAN BE YOUR AUTHENTIC SELF. AS A COMPANY UNIQUELY POSITIONED TO EDUCATE, ENTERTAIN AND EMPOWER THROUGH OUR PLATFORMS, COMCAST NBCUNIVERSAL STANDS FOR INCLUDING EVERYONE. OUR DIVERSITY, EQUITY AND INCLUSION INITIATIVES, COUPLED WITH OUR CORPORATE SOCIAL RESPONSIBILITY WORK, IS INFORMED BY OUR EMPLOYEES, AUDIENCES, PARK GUESTS AND THE COMMUNITIES IN WHICH WE LIVE. WE STRIVE TO FOSTER A DIVERSE, EQUITABLE AND INCLUSIVE CULTURE WHERE OUR EMPLOYEES FEEL SUPPORTED, EMBRACED AND HEARD. TOGETHER, WE’LL CONTINUE TO CREATE AND DELIVER CONTENT THAT REFLECTS THE CURRENT AND EVER-CHANGING FACE OF THE WORLD.\n\nJOB DESCRIPTION\n\nOVERVIEW: \n\nREPORTING TO THE VP, CNBC FINANCE, THIS KEY ROLE WILL WORK CLOSELY WITH OPERATIONAL BRAND LEADERS TO DRIVE OPERATIONAL FINANCE EXCELLENCE. THIS ROLE WILL OVERSEE AND MANAGE DIGITAL PUBLISHING & EVENTS FINANCIALS FOR CNBC.\n\nKEY RESPONSIBILITIES\n\nKEY CONTRIBUTOR TO OPERATIONAL FORECASTING & ANALYSIS, MONTHLY & QUARTERLY CLOSE PROCESS, AND DAY TO DAY FINANCIALS. MANAGE MONTHLY REPORTING & DETAILED COST TRACKERS; OWN RELATIONSHIP WITH BUDGET OWNERS AS THEIR MAIN POINT OF CONTACT.PARTNER WITH INTERNAL NEWS GROUP FINANCE TEAMS AND CROSS-FUNCTIONAL TEAMS LIKE THE NBCUNIVERSAL AD SALES AND NEWS GROUP DIGITAL RESEARCH TEAMS TO UNDERSTAND TRAFFIC/REVENUE TRENDING AND IMPACT ON FINANCIALS; THE NEWS GROUP OPERATIONS, GROWTH & BD TEAMS ON INVESTMENT MODELING AND EXECUTION.PARTNER WITH EVENTS SALES AND PRODUCTION TEAMS TO TRACK MONTHLY REVENUES AND EVENT PRODUCTION COSTCONSOLIDATE EVENTS AND COUNCILS P&L FOR MONTH/QUARTER/YEAR ENDS AS WELL AS ESTIMATE/BUDGET PROCESS, PERFORM FINANCIAL VARIANCE ANALYSISSUPPORT SIC CALCULATIONS FOR EVENTS & COUNCILS SALES TEAMPROVIDE ANALYTICAL SUPPORT TO VP OF FINANCE AND BUSINESS LEADERS IN DEVELOPING NEW EVENT MODELS, GENERATE EFFICIENCIES IN EVENT COSTSPROVIDE AD-HOC ANALYSIS WHEN NEEDED\n\nWHAT WE’LL OFFER\n\n  AT CNBC HEADQUARTERS IN ENGLEWOOD CLIFFS, NJ, YOU’LL HAVE ACCESS TO GREAT PERKS AND AMENITIES: \n\nSWEAT IT OUT -- FREE ONSITE FITNESS CENTER WITH STATE-OF-THE-ART EQUIPMENT, BASKETBALL COURT AND RUNNING COURSE, PLUS DAILY GROUP CLASSES  EAT UP -- GOURMET CAFETERIA WITH DAILY SPECIALS PLUS SOUP AND SALAD BARS  UNWIND -- MASSAGE THERAPY, PING PONG TABLES, FOOSBALL  EXTRAS -- DRY CLEANING, SHOE SHINING AND SNEAK PEEKS   \n\nDON’T HAVE A CAR? NO PROBLEM! WE OFFER FREE SHUTTLE TRANSPORTATION TO AND FROM MULTIPLE LOCATIONS IN MANHATTAN, BROOKLYN, HOBOKEN AND JERSEY CITY \n\n WHEN YOU JOIN THE NBCUNIVERSAL FAMILY, YOU’LL GET…\n\nWE’RE A GLOBAL COMPANY THAT VALUES OUR EMPLOYEE’S INDIVIDUAL EXPERIENCES AND WELLBEING. WE KNOW THAT WE’RE SMARTER, MORE DYNAMIC AND BETTER TOGETHER. THAT’S WHY WE OFFER BENEFITS AND PERKS TO MEET YOUR UNIQUE NEEDS. READ MORE ABOUT THEM ON OUR CAREERS SITE HERE. WE INVITE YOU TO SEEK THE EXCITEMENT, THE CHALLENGES AND THE OPPORTUNITIES THAT MAKE WORKING HERE SO REWARDING.\n\nQUALIFICATIONS\n\nBASIC QUALIFICATIONS:\n\nBACHELOR’S DEGREE IN FINANCE, ACCOUNTING OR RELEVANT EXPERIENCE5+ YEARS OF EXPERIENCE IN FINANCE, ACCOUNTING OR RELATED FIELDADVANCED EXCEL USER\n\nELIGIBILITY REQUIREMENTS\n\nMUST HAVE UNRESTRICTED WORK AUTHORIZATION TO WORK IN THE UNITED STATESMUST BE WILLING TO WORK IN ENGLEWOOD CLIFFS, NJ A MINIMUM OF 3 DAYS/WEEK\n\nDESIRED CHARACTERISTICS\n\nEXCELLENT TECHNICAL AND ANALYTICAL SKILLS, DETAIL ORIENTEDSTRONG ORAL AND WRITTEN COMMUNICATION SKILLSANALYTICAL MINDSET & SELF-STARTER; ENJOYS WORKING IN A DYNAMIC GROWTH BUSINESSEXCELLENT JUDGEMENT AND PROBLEM-SOLVING SKILLS, ABILITY TO RESOLVE ISSUES INDEPENDENTLYABILITY TO WORK ACROSS MULTIPLE FUNCTIONS AND TEAMS IN A COLLABORATIVE ENVIRONMENTPRIOR OPERATIONAL FINANCE EXPERIENCE, DIGITAL EXPERIENCE A PLUS\n\nADDITIONAL INFORMATION\n\nNBCUNIVERSAL'S POLICY IS TO PROVIDE EQUAL EMPLOYMENT OPPORTUNITIES TO ALL APPLICANTS AND EMPLOYEES WITHOUT REGARD TO RACE, COLOR, RELIGION, CREED, GENDER, GENDER IDENTITY OR EXPRESSION, AGE, NATIONAL ORIGIN OR ANCESTRY, CITIZENSHIP, DISABILITY, SEXUAL ORIENTATION, MARITAL STATUS, PREGNANCY, VETERAN STATUS, MEMBERSHIP IN THE UNIFORMED SERVICES, GENETIC INFORMATION, OR ANY OTHER BASIS PROTECTED BY APPLICABLE LAW. NBCUNIVERSAL WILL CONSIDER FOR EMPLOYMENT QUALIFIED APPLICANTS WITH CRIMINAL HISTORIES IN A MANNER CONSISTENT WITH RELEVANT LEGAL REQUIREMENTS, INCLUDING THE CITY OF LOS ANGELES FAIR CHANCE INITIATIVE FOR HIRING ORDINANCE, WHERE APPLICABLE.\n\nIF YOU ARE A QUALIFIED INDIVIDUAL WITH A DISABILITY OR A DISABLED VETERAN, YOU HAVE THE RIGHT TO REQUEST A REASONABLE ACCOMMODATION IF YOU ARE UNABLE OR LIMITED IN YOUR ABILITY TO USE OR ACCESS NBCUNICAREERS.COM AS A RESULT OF YOUR DISABILITY. YOU CAN REQUEST REASONABLE ACCOMMODATIONS BY EMAILING ACCESSIBILITYSUPPORT@NBCUNI.COM.",
    "job_skill_set": [
      "finance",
      "accounting",
      "advanced excel",
      "financial analysis",
      "budgeting",
      "cost tracking",
      "P&L management",
      "operational forecasting",
      "ad-hoc analysis",
      "communication",
      "analytical mindset",
      "problem solving",
      "collaboration",
      "detail oriented",
      "self-starter",
      "judgment",
      "investment modeling"
    ],
    "short_keywords": [
      "accounting",
      "adhoc",
      "advanced",
      "analysis",
      "analytical",
      "budgeting",
      "cnbc",
      "collaboration",
      "communication",
      "cost",
      "detail",
      "digital",
      "events",
      "excel",
      "finance",
      "financial",
      "forecasting",
      "investment",
      "judgment",
      "management",
      "manager",
      "mindset",
      "modeling",
      "operational",
      "oriented",
      "pl",
      "problem",
      "selfstarter",
      "senior",
      "solving",
      "tracking"
    ]
  },
  {
    "job_id": "3891280305",
    "job_title": "Director,  Finance",
    "category": "FINANCE",
    "job_description": "YOU COULD BE THE ONE WHO CHANGES EVERYTHING FOR OUR 28 MILLION MEMBERS. CENTENE IS TRANSFORMING THE HEALTH OF OUR COMMUNITIES, ONE PERSON AT A TIME. AS A DIVERSIFIED, NATIONAL ORGANIZATION, YOU’LL HAVE ACCESS TO COMPETITIVE BENEFITS INCLUDING A FRESH PERSPECTIVE ON WORKPLACE FLEXIBILITY.\n\nPOSITION PURPOSE DIRECT, NEGOTIATE AND HANDLE ACTIVITIES OF THE BUSINESS TECHNOLOGY SOLUTIONS UNIT’S FINANCE DEPARTMENT AND AID IN FORMULATING AND ADMINISTERING ORGANIZATION FINANCIAL POLICIES AND PROCEDURES.\n\nMONITOR BUSINESS PROCESSES AND SYSTEMS TO ASSURE INTEGRITY IN INFORMATION AND SYSTEMS.OVERSEE PREPARATION OF ACCURATE AND TIMELY FINANCIAL REPORTS.REVIEW, COMMUNICATE, AND PRESENT STRATEGIC PLANS, OPERATING BUDGETS AND FORECASTS.ESTABLISH TARGETS AND MEASURES THAT ARE APPROPRIATE FOR THE SITE AND ARE DIRECTLY LINKED TO BUSINESS UNIT AND CORPORATE OBJECTIVES. EVALUATE PROGRAM EFFECTIVENESS AND ENSURE REPORTING ACCURACY.PROVIDE FINANCIAL PLAN FOR PERFORMANCE VARIANCES, OPERATING ALTERNATIVES, PROGRAM AND INVESTMENT INITIATIVES, ETC.INTERPRET FINANCIAL REPORTS FOR MANAGEMENT TEAM.SERVE AS CONTACT FOR THE STATE, CORPORATE AND BUSINESS UNIT FUNCTIONS REGARDING FINANCIAL MATTERS.MONITOR LEGISLATIVE AND POLITICAL DEVELOPMENTS AFFECTING THE BUSINESS UNIT FROM A FINANCIAL PERSPECTIVE.COORDINATE POLITICAL CONTRIBUTION ACTIVITY, INTERACT WITH LOBBYISTS, ATTEND POLITICAL FUNDRAISERS, AND ENSURE COMPLIANCE WITH POLITICAL CONTRIBUTION STATUTES.\n\nEDUCATION/EXPERIENCE\n\nBACHELOR'S DEGREE IN ACCOUNTING, FINANCE, OR EQUIVALENT EXPERIENCE.5+ YEARS OF ACCOUNTING, FINANCIAL ANALYSIS OR FINANCE RELATED EXPERIENCE.PREVIOUS MANAGEMENT EXPERIENCE INCLUDING RESPONSIBILITIES FOR HIRING, TRAINING, ASSIGNING WORK AND MANAGING PERFORMANCE OF STAFF.EXPERIENCE IN PUBLIC ACCOUNTING, OPERATIONS, FINANCIAL ANALYSIS, INFORMATION SYSTEMS AND HEALTH CARE OR INSURANCE PREFERRED.\n\nPAY RANGE $142,300.00 - $263,500.00 PER YEAR\n\nCENTENE OFFERS A COMPREHENSIVE BENEFITS PACKAGE INCLUDING COMPETITIVE PAY, HEALTH INSURANCE, 401K AND STOCK PURCHASE PLANS, TUITION REIMBURSEMENT, PAID TIME OFF PLUS HOLIDAYS, AND A FLEXIBLE APPROACH TO WORK WITH REMOTE, HYBRID, FIELD OR OFFICE WORK SCHEDULES. ACTUAL PAY WILL BE ADJUSTED BASED ON AN INDIVIDUAL'S SKILLS, EXPERIENCE, EDUCATION, AND OTHER JOB-RELATED FACTORS PERMITTED BY LAW. TOTAL COMPENSATION MAY ALSO INCLUDE ADDITIONAL FORMS OF INCENTIVES.\n\nCENTENE IS AN EQUAL OPPORTUNITY EMPLOYER THAT IS COMMITTED TO DIVERSITY, AND VALUES THE WAYS IN WHICH WE ARE DIFFERENT. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, VETERAN STATUS, OR OTHER CHARACTERISTIC PROTECTED BY APPLICABLE LAW.",
    "job_skill_set": [
      "financial analysis",
      "accounting",
      "financial reporting",
      "budgeting",
      "financial planning",
      "compliance",
      "information systems",
      "management",
      "communication",
      "leadership",
      "strategic thinking",
      "problem solving",
      "team management",
      "adaptability",
      "interpersonal skills",
      "negotiation",
      "health care finance",
      "political awareness"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "analysis",
      "awareness",
      "budgeting",
      "care",
      "communication",
      "compliance",
      "director",
      "finance",
      "financial",
      "health",
      "information",
      "interpersonal",
      "leadership",
      "management",
      "negotiation",
      "planning",
      "political",
      "problem",
      "reporting",
      "skills",
      "solving",
      "strategic",
      "systems",
      "team",
      "thinking"
    ]
  },
  {
    "job_id": "3904928912",
    "job_title": "Finance - FP&A Analyst",
    "category": "FINANCE",
    "job_description": "WE HAVE THE FOLLOWING JOB OPPORTUNITY IN OUR NEW YORK CITY OFFICE:\nDESCRIPTION\nTHE FP&A ANALYST WILL WORK WITHIN THE SMALL AND AGILE FINANCE – FP&A TEAM THAT IS PART OF THE LARGER TRANSRE FINANCE / ACCOUNTING ORGANIZATION. THIS ROLE COLLABORATES CLOSELY WITH OTHER MEMBERS OF FINANCE ACROSS VARIOUS DEPARTMENTS AND LOCATIONS, AS WELL AS OTHER FUNCTIONAL GROUPS ACROSS THE BUSINESS (INCLUDING BUT NOT LIMITED TO RISK MANAGEMENT, GLOBAL PORTFOLIO MANAGEMENT, UNDERWRITING TEAMS, ETC.).\nTHE FP&A ANALYST WILL HAVE THE OPPORTUNITY TO WORK ON PROJECTS LEVERAGING INNOVATIVE TECHNOLOGIES TO IMPROVE PROCESSES AND ENHANCE REPORTING CAPABILITIES OUT OF THE FINANCE ORGANIZATION. RESPONSIBILITIES WILL INCLUDE, BUT NOT BE LIMITED TO:\nASSISTING IN COLLECTING, PROCESSING, AND INTERPRETING FINANCIAL DATA TO CREATE MONTHLY AND QUARTERLY FINANCIAL FORECASTS/REPORTS USING EXISTING AND NEW TECHNOLOGIESUTILIZING TOOLS TO ASSIST WITH CREATION OF PRO FORMA FINANCIAL STATEMENTSPARTICIPATING IN THE ANNUAL BUSINESS PLANNING PROCESS TO PROVIDE BUSINESS INSIGHTS TO SENIOR MANAGEMENT AND STAKEHOLDERSIDENTIFYING AREAS OF IMPROVEMENT IN CURRENT PROCESSES AND ASSISTING IN THE IMPLEMENTATION OF SOLUTIONS TO IMPROVE FP&A PROCESSES ACROSS DELIVERABLESASSISTING IN THE IMPLEMENTATION OF FINANCIAL SYSTEMS TRANSFORMATION PROJECTS INVOLVING USE OF TECHNOLOGY SOLUTIONS AND OTHER INTERNAL TOOLSPREPARING DETAILED PEER ANALYSIS AND CEDING COMPANY FINANCIAL REVIEWS PROVIDING INSIGHT/SUPPORT TO OTHER DEPARTMENTSCOLLABORATING ACROSS THE ORGANIZATION TO SUPPORT CROSS-FUNCTIONAL PROJECTS AND INITIATIVES\nREQUIREMENTS\n1-2 YEARS OF ACCOUNTING/FINANCE EXPERIENCE IN THE RE(INSURANCE) INDUSTRY PREFERREDBACHELOR’S DEGREE IN FINANCE, ACCOUNTING, ECONOMICS OR ANOTHER RELATED FIELDSTRONG KNOWLEDGE OF MICROSOFT OFFICE TOOLS INCLUDING EXCEL AND POWER BIEXPERIENCE WRITING SQL QUERIES AND A WORKING KNOWLEDGE OF DATABASES/RELATIONSHIPS BETWEEN DATAPROFICIENT UNDERSTANDING OF CORE ACCOUNTING CONCEPTS AND FINANCIAL STATEMENT RELATIONSHIPSABILITY TO RESEARCH AND EXTRACT RELEVANT INFORMATION FROM SEC PUBLIC FILINGS SUCH AS 10-K/10-Q AND EARNINGS TRANSCRIPTSSTRONG ATTENTION TO DETAIL & ORGANIZATIONAL SKILLS; ABILITY TO MANAGE MULTIPLE PROJECTS WITHIN SET TIMELINESDEMONSTRATED ABILITY TO WORK COLLABORATIVELY AND ENGAGE MULTIPLE STAKEHOLDERS FROM ACROSS THE BUSINESS\nWORK SCHEDULETRANSRE IS SUPPORTIVE OF AN AGILE WORK SCHEDULE, WHICH MAY DIFFER BASED ON INDIVIDUAL ROLES, YOUR LOCAL OFFICE’S PRACTICES AND PREFERENCES MARKETPLACE TRENDS, AND TRANSRE’S BUSINESS OBJECTIVES. THIS POSITION IS ELIGIBLE FOR A HYBRID WORK SCHEDULE WITH 3 DAYS IN THE OFFICE PER WEEK, AND 2 DAYS REMOTE.\nCOMPENSATIONIN ADDITION TO BASE SALARY, FOR THIS POSITION, TRANSRE OFFERS A COMPREHENSIVE BENEFITS PACKAGE, PAID TIME OFF, AND INCENTIVE PAY OPPORTUNITY. THE ANTICIPATED ANNUAL BASE SALARY RANGE IN NEW YORK FOR THIS POSITION, EXCLUSIVE OF BENEFITS, PAID TIME OFF, AND INCENTIVE PAY OPPORTUNITY IS $75,000 – 85,000 THIS RANGE IS AN ESTIMATE AND THE ACTUAL BASE SALARY OFFERED FOR THIS POSITION WILL BE DETERMINED BASED ON CERTAIN FACTORS, INCLUDING THE APPLICANT’S SPECIFIC SKILL SET AND LEVEL OF EXPERIENCE.\nTHIS ROLE IS CLASSIFIED AS SALARIED NON-EXEMPT UNDER THE FAIR LABOR STANDARD ACT (FLSA). THE INCUMBENT WILL BE PAID FOR HOURS WORKED AND WILL ALSO BE ELIGIBLE TO RECEIVE OVERTIME PAY.",
    "job_skill_set": [
      "financial analysis",
      "Microsoft Excel",
      "Power BI",
      "SQL",
      "accounting principles",
      "financial forecasting",
      "data interpretation",
      "financial reporting",
      "financial systems transformation",
      "collaboration",
      "attention to detail",
      "organizational skills",
      "stakeholder engagement",
      "project management",
      "communication",
      "SEC filings analysis"
    ],
    "short_keywords": [
      "accounting",
      "analysis",
      "analyst",
      "attention",
      "bi",
      "collaboration",
      "communication",
      "data",
      "detail",
      "engagement",
      "excel",
      "filings",
      "finance",
      "financial",
      "forecasting",
      "fpa",
      "interpretation",
      "management",
      "microsoft",
      "organizational",
      "power",
      "principles",
      "project",
      "reporting",
      "sec",
      "skills",
      "sql",
      "stakeholder",
      "systems",
      "to",
      "transformation"
    ]
  },
  {
    "job_id": "3894894372",
    "job_title": "Finance Manager",
    "category": "FINANCE",
    "job_description": "THE IDEAL CANDIDATE WILL BE RESPONSIBLE FOR WORKING WITH SENIOR MANAGEMENT TO DEVELOP FINANCIAL STRATEGIES FOR THE ORGANIZATION. YOU ARE COMFORTABLE HANDLING LARGE AMOUNTS OF DATA, ACTING AS A BUSINESS PARTNER, DECISION MAKER, AND PROVIDING REGULAR FINANCIAL REPORTING. EXPERIENCE IN HEALTHCARE INDUSTRY A PLUS BUT NOT A GAME CHANGER. RESPONSIBILITIES-PROVIDE BUDGET AND FINANCIAL MANAGEMENT SUPPORT TO INCLUDE TRACKING, FORECASTING, ANALYSIS, EXECUTION, REPORTING, AND ACTUARIAL SERVICES. \n-TASKS MAY INCLUDE ANALYSES TO DEVELOP RECOMMENDATIONS SPECIFICALLY AIMED AT COST CONTROL/COST REDUCTION.\n-SUPPORT BUDGET PLANNING AND FORMULATION ACTIVITIES FOR FUTURE YEARS FUNDING NEEDS, AND RECOMMENDATIONS FOR STANDARD OPERATING PROCEDURES RELATED TO HEALTHCARE FINANCIAL MANAGEMENT.\nQUALIFICATIONSBACHELOR'S DEGREE OR HIGHER IN FINANCE OR RELATED FIELD 5 - 7 YEARS OF RELEVANT EXPERIENCEFLUENCY IN MICROSOFT OFFICE SUITE (OUTLOOK, EXCEL, WORD, POWERPOINT, ETC.)DETAIL-ORIENTED AND ANALYTICAL",
    "job_skill_set": [
      "financial strategies",
      "data analysis",
      "financial reporting",
      "budget management",
      "forecasting",
      "cost control",
      "business partnership",
      "decision making",
      "detail-oriented",
      "analytical skills",
      "actuarial services",
      "Microsoft Office Suite",
      "healthcare financial management"
    ],
    "short_keywords": [
      "actuarial",
      "analysis",
      "analytical",
      "budget",
      "business",
      "control",
      "cost",
      "data",
      "decision",
      "detailoriented",
      "finance",
      "financial",
      "forecasting",
      "healthcare",
      "making",
      "management",
      "manager",
      "microsoft",
      "office",
      "partnership",
      "reporting",
      "services",
      "skills",
      "strategies",
      "suite"
    ]
  },
  {
    "job_id": "3891076667",
    "job_title": "Regional Finance Process Manager",
    "category": "FINANCE",
    "job_description": "LOCATION: BLUE BELL, PA\n\nABOUT SKF\n\nSKF HAS BEEN MAKING THE WORLD SPIN SINCE 1907! \n\nSKF IS AN INDUSTRY-LEADING MANUFACTURER DEDICATED TO A CULTURE OF BELONGING, WHERE OUR PEOPLE FLOURISH IN AN EQUITABLE ENVIRONMENT THAT PROMOTES LEADERSHIP DEVELOPMENT AND CAREER GROWTH. SKF BEARINGS PLAYED AN INTEGRAL ROLE IN HELPING MARS ROVER COLLECT ROCK AND REGOLITH SAMPLES ON THE PLANET’S SURFACE.\n\nAS AN SKF TEAM MEMBER, YOU WILL JOIN 40,000 COLLEAGUES FROM MORE THAN 130 COUNTRIES DEVELOPING BEARING TECHNOLOGY AND SERVICES THAT MAKE ROTATION MORE RELIABLE AND SUSTAINABLE. SUSTAINABILITY IS AT THE HEART OF EVERYTHING WE DO. SKF AIMS TO HAVE NET ZERO GREENHOUSE GAS EMISSIONS AT ALL OUR PRODUCTION FACILITIES BY 2030. \n\nSKF PRODUCTS KEEP VEHICLES ROLLING, POWER THE MACHINES THAT PUT FOOD ON YOUR TABLE, AND EVEN REACH INTO THE COSMOS AS PART OF THE MARS ROVER MISSION. FOUNDED IN SWEDEN IN 1907, TODAY SKF IS PUBLICLY TRADED ON THE NASDAQ STOCKHOLM WITH ANNUAL SALES IN 2020 OF APPROXIMATELY $10 BILLION.\n\nJOB SUMMARY\n\nSKF HAS ESTABLISHED A REGIONAL FINANCE SUPPORT STRUCTURE IN THE AMERICAS, BASED IN BLUE BELL, PA, SUPPORTING SKF FINANCE OPERATIONS CENTERS (FOC’S) IN NORTH AMERICA (NAM) AND LATIN AMERICA (LAM). AT SKF FINANCE HAS HAVE A POWERFUL ROLE RELATED TO A LEAN, EFFICIENT, AND DIGITAL ENVIRONMENT, AND WE ARE AIMING TO BE IN THE FRONTLINE OF NEXT GENERATION BUSINESS FINANCE.\n\nTHE FINANCE OPERATIONS CENTERS AT SKF IN THE AMERICAS INCLUDES ACCOUNTING & REPORTING (RECORD TO REPORT – R2R), ACCOUNTS PAYABLE (PROCURE TO PAY – P2P), ACCOUNTS RECEIVABLE (ORDER TO CASH – O2C), CENTRAL CONTROLLING, INTERNAL CONTROL, AND FINANCE PROCESSES. FINANCE OPERATIONS AMERICAS HAS TWO FOC’S LOCATED IN BLUE BELL, USA AND PUEBLA, MX.\n\nAS A FINANCE REGIONAL PROCESS MANAGER IN THE AMER REGION, YOU WILL BE PART OF THE REGIONAL SUPPORT AMERICAS TEAM AND REPORT TO THE FINANCE SUPPORT MANAGER AMERICAS, PART OF THE GLOBAL FINANCE OPERATIONS & DEVELOPMENT ORGANIZATION. YOU WILL BE RESPONSIBLE FOR OVERALL FINANCE PROCESS GOVERNANCE WITHIN SKF FINANCE PROCESS GUIDELINES, FRAMEWORK, AND TOOLS IN PROCESS SCOPE, PROVIDING SUPPORT TO FOC’S TEAMS IN THE REGION. THIS POSITION WILL ALSO BE PART OF THE IMPLEMENTATION TEAM OF THE SAP FINANCE MODULE AS PART OF THE AMERICAS SEP PROJECT AND OTHER FINANCE-RELATED SYSTEM IMPLEMENTATIONS AND PROCESS IMPROVEMENT ACTIVITIES.\n\nRESPONSIBILITIES\n\nACCOUNTABLE FOR IMPLEMENTATION OF PROCESS CHANGES WITHIN THE PROCESS SCOPE, RESPONSIBLE FOR IDENTIFYING TOPICS FOR CROSS-PROCESS ALIGNMENT.IDENTIFY BUSINESS REQUIREMENTS AND HOW THESE IMPACT PROCESS DESIGN.IDENTIFY IMPROVEMENT OPPORTUNITIES AND DRIVE CONTINUOUS IMPROVEMENT, OPTIMIZATION, AND AUTOMATION OF PROCESS.IDENTIFY THE COMPETENCIES NEEDED AND DEVELOP COMPETENCY DEVELOPMENT PLAN.SUPPORT IMPLEMENTATION OF DEFINED PROCESS MEASUREMENTS (KPIS), EVALUATE AND SUGGEST PROCESS FIXES TO IMPROVE RESULTS.PROVIDE PROBLEM RESOLUTION SUPPORT FOR FINANCE APPLICATIONS ISSUES.SUPPORT MASTER DATA MANAGEMENT IN SCOPE.WORK TOGETHER WITH IT TEAMS TO PERFORM PROCESS AND SYSTEM EVALUATIONS TO IMPROVE BUSINESS OPERATIONS.NEW SYSTEMS AND PROCESSES: TESTING, EVALUATION, AND MODIFICATION OF LOCAL PROCEDURES WHEN APPLICABLEPERFORM ON-SITE AND REMOTE/ONLINE TRAINING ON THE FINANCE APPLICATIONS.SUPPORT AUDITS (TAX, ACCOUNTING, SICS, GOVERNMENT)BE A KEY USER OF THE FINANCE APPLICATIONS IN SCOPE.BE A TEAM PLAYER AND COOPERATE ACROSS PROCESSES AND ORGANIZATIONS.\n\nREQUIREMENTS\n\nBACHELOR’S DEGREE IN ACCOUNTING.SEVEN OR MORE YEARS OF EXPERIENCE WITHIN FINANCE AND ACCOUNTING FUNCTIONS/DEPARTMENT.UNDERSTANDING OF FINANCE PROCESSES AND PROCESS DEVELOPMENT, AND EXPERTISE OF PROCESSES IN OWN PROCESS SCOPE.PROCESS DEPLOYMENT, PROJECT AND CHANGE MANAGEMENT SKILLS.DRIVING BUSINESS NEEDS MANAGEMENT.SERVICE-ORIENTED APPROACH, GOOD COMMUNICATION, NEGOTIATION, NETWORKING, AND TEAMING SKILLS.CONTINUOUS IMPROVEMENT MINDSET, CAPABILITY TO FACILITATE AND DRIVE CHANGE WITHIN A GLOBAL ORGANIZATION.HANDS-ON EXPERIENCE WITH FINANCE APPLICATIONS (SAP, BLACKLINE, CADENCY).STRONG ANALYTICAL AND PC SKILLS (O365, EXCEL, POWER BI, ETC.).\n\nWHAT YOU’LL LOVE ABOUT SKF\n\nREST AND RELAXATION. ENJOY A GENEROUS PTO POLICY AND 13 PAID HOLIDAYS.\n\nWORK/LIFE INTEGRATION. SKF SUPPORTS WORK/LIFE INTEGRATION, HOME, FAMILY, COMMUNITY, PERSONAL WELL-BEING AND HEALTH. FLEXIBLE WORK OPTIONS AVAILABLE, DEPENDING ON ROLE.\n\nDIVERSITY IN THE WORKPLACE. AT SKF, WE STRIVE TO EMBED DIVERSITY, EQUITY, AND INCLUSION IN EVERYTHING WE DO. BY DEVELOPING A CULTURE OF BELONGING, OUR PEOPLE CAN FLOURISH; LEADING TO AN INCLUSIVE, EQUITABLE ENVIRONMENT THAT PROMOTES LEADERSHIP, ENGAGEMENT, AND INNOVATION.\n\nBEST IN CLASS BENEFITS. SKF CARES ABOUT THE WELLBEING OF OUR EMPLOYEES. COMPREHENSIVE HEALTHCARE OPTIONS TO FIT YOUR NEEDS AND OPT OUT PAYMENT. ADDED BENEFITS INCLUDE COMPANY PAID LIFE INSURANCE, STD, LTD. SUPPLEMENTAL BENEFITS INCLUDE CRITICAL ILLNESS COVERAGE, TUITION REIMBURSEMENT, EMPLOYEE DISCOUNT PROGRAMS, AND MUCH MORE!\n\nINVEST IN YOUR FUTURE. PARTICIPATE IN OUR 401K PROGRAM THAT BOASTS A 10% EMPLOYER CONTRIBUTION: 100% MATCH UP TO 5% OF YOUR ELECTED CONTRIBUTION (100% VESTED) PLUS AN ADDITIONAL 5% COMPANY CONTRIBUTION.\n\nREPORTS TO: MANAGER FINANCE SUPPORT\n\nLOCATION: BLUE BELL, PA\n\nJOB ID: 19647\n\nSKF PROVIDES EQUAL EMPLOYMENT [AND AFFIRMATIVE ACTION] OPPORTUNITIES TO APPLICANTS AND EMPLOYEES WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, PROTECTED VETERAN STATUS, OR DISABILITY.\n\nBY APPLYING TO THIS JOB YOU ACKNOWLEDGE HOW SKF TREATS CANDIDATE DATA. CLICK HERE TO REVIEW THE SKF DATA PRIVACY CONSENT STATEMENT.",
    "job_skill_set": [
      "accounting",
      "finance processes",
      "data analysis",
      "Excel",
      "communication",
      "teamwork",
      "problem solving",
      "change management",
      "continuous improvement",
      "service-oriented approach",
      "SAP",
      "Blackline",
      "Cadency",
      "process development",
      "project management",
      "O365",
      "Power BI",
      "KPI measurement",
      "negotiation",
      "facilitation",
      "networking"
    ],
    "short_keywords": [
      "accounting",
      "analysis",
      "approach",
      "bi",
      "blackline",
      "cadency",
      "change",
      "communication",
      "continuous",
      "data",
      "development",
      "excel",
      "facilitation",
      "finance",
      "improvement",
      "kpi",
      "management",
      "manager",
      "measurement",
      "negotiation",
      "networking",
      "o365",
      "power",
      "problem",
      "process",
      "processes",
      "project",
      "regional",
      "sap",
      "serviceoriented",
      "solving",
      "teamwork"
    ]
  },
  {
    "job_id": "3903445729",
    "job_title": "VP of Structured Finance, Asset Backed (ABS) Credit",
    "category": "FINANCE",
    "job_description": "OUR CLIENT IS AN INTERNATIONAL BROKER DEALER WITH HQ IN NYC. THE FIRM IS LOOKING TO BUILD AND BROADEN ITS STRUCTURED FINANCE, ASSET BACKED (ABS) BUSINESS AND HAS AN OPENING FOR A VP LEVEL CANDIDATE FOR THEIR CREDIT RISK TEAM.\nLET'S CATCH UP IF YOU ARE INTERESTED AND WE CAN ELABORATE FURTHER ON THE ROLE.\n- CREDIT ANALYSIS OF VARIOUS ABS PRODUCTS, TRANSACTIONS- KNOWLEDGE OF BROAD ABS STRUCTURES, ISSUERS- KNOWLEDGE OF RESIDENTIAL MARKETS IS A PLUS- KNOWLEDGE OF MBS, CRE, CMO IS A PLUS- VP TITLE - $175-200K BASE- 40-50% BONUS- HYBRID WORK (2-3 DAYS IN NYC OFFICE)",
    "job_skill_set": [
      "credit analysis",
      "team collaboration",
      "communication",
      "analytical thinking",
      "problem solving",
      "ABS products knowledge",
      "MBS knowledge",
      "CRE knowledge",
      "CMO knowledge",
      "residential markets knowledge"
    ],
    "short_keywords": [
      "abs",
      "analysis",
      "analytical",
      "asset",
      "backed",
      "cmo",
      "collaboration",
      "communication",
      "cre",
      "credit",
      "finance",
      "knowledge",
      "markets",
      "mbs",
      "of",
      "problem",
      "products",
      "residential",
      "solving",
      "structured",
      "team",
      "thinking",
      "vp"
    ]
  },
  {
    "job_id": "3905256384",
    "job_title": "Director of Finance - Managed Communities",
    "category": "FINANCE",
    "job_description": "MISSION, VISION, AND VALUES\n\nOUR MISSION IS TO MAKE PEOPLE’S LIVES BETTER BY PROVIDING GREAT CARE AND CONSULTING. WE BELIEVE THAT OUR RESIDENTS AND CLIENTS DESERVE OUR VERY BEST. WE RECOGNIZE THAT SATISFACTION WITH CARE AND CONSULTING SERVICES DOES NOT MEAN THE SAME THING TO EVERYONE; THEREFORE, IT IS IMPERATIVE THAT WE LISTEN CLOSELY TO OUR CUSTOMERS.\n\nOUR VISION IS TO MEET AND EXCEED CUSTOMERS’ EXPECTATIONS. THIS DOES NOT HAPPEN BY CHANCE, BUT RATHER THROUGH THE DEDICATED EFFORTS OF INDIVIDUALS, WHO DAY IN AND DAY OUT MAKE GREAT CARE AND CONSULTING THEIR NUMBER ONE PRIORITY.\n\nOUR CORE VALUES OF HOSPITALITY, STEWARDSHIP, INTEGRITY, RESPECT, AND HUMOR, WIDELY RECOGNIZED AND EMBRACED, CONTINUE TO BE THE DRIVING FORCE BEHIND OUR ACTIONS AS WE CARRY OUT OUR MISSION AND WORK TOWARD OUR VISION. IT’S NOT ONLY WHAT WE DO BUT HOW WE DO IT THAT MAKES US A NATIONAL LEADER AND TRUSTED ADVISOR TO THOSE WE SERVE.\n\nSENIOR LIVING AND MULTI-SITE EXPERIENCE HIGHLY PREFERRED***\n\nTHE DIRECTOR OF FINANCE - MANAGED COMMUNITIES, IS RESPONSIBLE FOR MANAGING, IMPLEMENTING, AND IMPROVING FINANCIAL ACCOUNTING SYSTEMS AND OTHER ADMINISTRATIVE/BUSINESS PROCESSES FOR MULTIPLE MANAGED COMMUNITIES (MCS). AS A KEY STRATEGIC MEMBER AND TRUSTED PARTNER ON THE LEADERSHIP TEAM, THIS POSITION ALSO DRIVES ACCURATE AND TIMELY MONTHLY AND ANNUAL FINANCIAL REPORTING AND OPERATIONAL ANALYTICS WHICH PROVIDES CRITICAL INFORMATION FOR THE SUCCESSFUL MANAGEMENT OF COMPANY RESOURCES.\n\nESSENTIAL ACCOUNTABILITIES\n\nOVERSEES ALL ASPECTS OF REPORTING AND ACCOUNTING FOR COMMUNITIES MANAGED BY HEALTH DIMENSIONS GROUP (HDG).IDENTIFIES, IMPLEMENTS AND OVERSEES THE EXECUTION OF FINANCIAL PROCESSES, POLICIES, PROCEDURES AND CONTROLS TO ENSURE COMPLIANCE WITH US GAAP AND ALL APPLICABLE TAX LAWS, AS WELL AS THE DEPARTMENT OF LABOR AND HEALTH AND HUMAN SERVICES REGULATIONS.MAINTAINS CONFIDENTIALITY AND RIGHTS OF RESIDENT, FAMILY, EMPLOYEE, AND FACILITY INFORMATION IN COMPLIANCE WITH HIPAA POLICIES AND OTHER APPLICABLE REGULATIONS.ENSURES THAT CONTROLS ARE IN PLACE TO SAFEGUARD COMPANY ASSETS, AND TO ACCURATELY PREPARE, PRESENT AND COMPLETE FINANCIAL STATEMENTS FOR INTERNAL AND EXTERNAL REVIEW.WORKS WITH THE SENIOR LEADERSHIP TEAM AND ALL LEVELS OF FUNCTIONAL MANAGEMENT IN THE SPIRIT OF COOPERATION AND CONTINUOUS IMPROVEMENT.OVERSEES THE DEVELOPMENT OF THE ANNUAL BUDGETS AND PERIODIC OPERATIONAL FORECASTS FOR THE MCS.SERVES AS THE PRIMARY POINT-OF-CONTACT WITH EXTERNAL AUDIT FIRM FOR THE ANNUAL FINANCIAL AUDIT; MANAGES TAX MATTERS INCLUDING, BUT NOT LIMITED TO, COORDINATING WITH EXTERNAL FIRM ON ALL FILINGS.MAINTAINS THE MC’S GENERAL LEDGER AND FINANCIAL BOOKS AND RECORDS.ORGANIZES AND DRIVES ALL CLOSING AND CONSOLIDATION PROCESSES IN A TIMELY MANNER.OVERSEES AND DIRECTS ACTIVITIES FOR ACCOUNTS PAYABLE FOR THE MCS.RECRUITS, TRAINS AND RETAINS A HIGH PERFORMING TEAM THAT PROVIDES A PROFESSIONAL EXPERIENCE FOR ALL; MAINTAINS AND SUPPORTS A CULTURE OF COMPLIANCE, ETHICS, AND INTEGRITY WITHIN THE DEPARTMENT.PERFORMS OTHER DUTIES AS ASSIGNED.\n\nREQUIRED KNOWLEDGE, SKILLS, ABILITIES, AND EXPERIENCE \n\nKNOWLEDGE:DEMONSTRATED TECHNICAL KNOWLEDGE OF ACCOUNTING CONCEPTS, ALL APPLICABLE FINANCIAL REPORTING REQUIREMENTS, AND SOFTWARE REQUIRED.COMPUTER PROFICIENCY IN MICROSOFT OFFICE (WORD AND EXCEL) REQUIRED  SKILLS:EXCELLENT ORAL, WRITTEN, AND INTERPERSONAL COMMUNICATION SKILLS.ABILITIES:STRONG ORGANIZATIONAL ABILITIES; MUST BE ABLE TO WORK WELL UNDER PRESSURE, MANAGE MULTIPLE PROJECTS SIMULTANEOUSLY, AND MEET FINANCIAL DEADLINES.ABILITY TO WORK INDEPENDENTLY AND COLLABORATIVELY AS PART OF A TEAM.ABILITY TO ANTICIPATE FUTURE CHALLENGES, NEEDS, AND OPPORTUNITIES OF THE COMPANY.EXPERIENCE:BACHELOR’S DEGREE IN ACCOUNTING REQUIRED.5+ YEARS OF HEALTHCARE/SENIOR LIVING EXPERIENCE AS A CONTROLLER FOR MULTIPLE SITES REQUIRED, INCLUDING STRATEGIC FINANCE AND ACCOUNTING LEADERSHIP, FULL OVERSIGHT OF FINANCIAL OPERATIONS, AUDITS AND FINANCIAL STATEMENT PREPARATION AND PRESENTATION, FINANCIAL INSTITUTION AND INVESTORS REPORTING, KEY FINANCIAL PROCESSES AND SYSTEMS MANAGEMENT WITH TEAM MENTORSHIP AND DEVELOPMENT.CPA PREFERRED.\nBENEFITS INCLUDE\n\n401(K) RETIREMENT SAVINGSPAID TIME OFF AND VOLUNTEER TIME OFF (VTO)MEDICAL COVERAGEHEALTH SAVINGS ACCOUNT (HSA)FLEXIBLE SPENDING ACCOUNTS (FSA)DENTAL COVERAGEVISION COVERAGELIFE INSURANCE PLANSFLEXIBLE WORK SCHEDULESOPPORTUNITIES TO WORK REMOTELYMATERNITY AND PATERNITY LEAVEPROFESSIONAL DEVELOPMENTTUITION REIMBURSEMENTDREAM IT, DO IT PROGRAMPAID DISABILITY LEAVELONG-TERM DISABILITY (LTD)PET INSURANCEPET ADOPTION ASSISTANCEMANY MORE SUPPLEMENTAL BENEFITS",
    "job_skill_set": [
      "financial accounting",
      "GAAP compliance",
      "financial reporting",
      "budgeting",
      "auditing",
      "financial analysis",
      "tax compliance",
      "general ledger management",
      "team mentorship",
      "strategic finance",
      "communication",
      "organizational skills",
      "teamwork",
      "problem solving",
      "leadership",
      "adaptability",
      "customer service",
      "Microsoft Office",
      "healthcare finance",
      "confidentiality"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "analysis",
      "auditing",
      "budgeting",
      "communication",
      "communities",
      "compliance",
      "confidentiality",
      "customer",
      "director",
      "finance",
      "financial",
      "gaap",
      "general",
      "healthcare",
      "leadership",
      "ledger",
      "managed",
      "management",
      "mentorship",
      "microsoft",
      "of",
      "office",
      "organizational",
      "problem",
      "reporting",
      "service",
      "skills",
      "solving",
      "strategic",
      "tax",
      "team",
      "teamwork"
    ]
  },
  {
    "job_id": "3901933967",
    "job_title": "Finance Supervisor/Manager - Healthcare",
    "category": "FINANCE",
    "job_description": "THE FINANCE MANAGER WILL OVER THE TEAM OF ANALYSTS, OVERSEE AND DEVELOP SOP'S AND FINANCIAL SOLUTIONS, CREATE AND PACKAGE FINANCIAL PRODUCTS, LEAD TRANSITION OF ACCOUNTING FUNCTIONS AND FINANCIAL REPORTING INTO ERP SYSTEM.\nRESPONSIBILITIES:IDENTIFY COST DRIVERS AND DRILL DOWN WITH THE TEAM UTILIZING PAID CLAIMS REPORTS TO CALCULATE CLAIMS COSTREVIEW LAG REPORT FOR CLAIMS PAID AND RECEIVEDIBNR MODEL USING APPROPRIATE METHODOLOGIESCREATE SUMMARY REPORTS FOR HOSPITAL CAPITATION MONTHLY, TO ENSURE ANALYSTS HAVE CAPTURED IN THE FINANCIAL REPORTS ACCURATELYPREPARATION OF RISK POOL SUMMARIES BY LINE OF BUSINESS, HEALTH PLAN AND AID CATEGORY.REVIEW THE PREPARATION RISK POOL SUMMARY WITH COMBINED HEALTH PLANSOVERSEE THE PREPARATION OF CAPITATION SUMMARIES LEAD PREPARATION OF THE REPORT OF CLAIMS BY MONTH & TYPE OF SERVICECREATE REPORTS TO PRESENT TO HOSPITAL CLIENTS AND LEADERSHIP MAINTENANCE OF DAILY CASH FLOW AND MONTHLY BANK RECONCILIATIONREVIEW THE PREPARATION EOM FINANCIAL AND BOARD PACKAGESOVERSEE THE PREPARATION OF OTHER FINANCIAL PACKAGES TO PRESENT FOR JOINT OPERATIONS MEETING (JOM)AUTOMATION OF DATA MINING NEEDED FOR FINANCIAL REPORTINGVALIDATE QUERIES THROUGH SQL REVIEW HOSPITAL FINANCIAL RISK POOLS TO ENSURE A COMPLETE UNDERSTANDING OF THE PERFORMANCE OF EACH HOSPITAL RISK POOL AND ALL FACTORS THAT INFLUENCE ITS PERFORMANCEREVIEW RISK POOL CONTRACTS AND INTERPRET THEM INTO A SCHEDULE OF PAYMENTS FOR TRACKING PURPOSES AND ENSURE TIMELY SETTLEMENT PAYMENTS\nMINIMUM JOB REQUIREMENTS:EDUCATION: BACHELOR’S DEGREE (ACCOUNTING/FINANCE) EXPERIENCE: 3+ YEARS OF HEALTHCARE, PHYSICIAN ORGANIZATION OR HEALTH PLAN, HOSPITAL FINANCE AND/OR HEALTH PLAN EXPERIENCESTRONG UNDERSTANDING OF PROVIDER AND HEALTH PLAN CONTRACTING, DELINEATION OF RISK, MEDICAL TERMINOLOGY AND STANDARD INDUSTRY REIMBURSEMENT METHODOLOGIES REQUIRED.",
    "job_skill_set": [
      "financial reporting",
      "financial analysis",
      "ERP systems",
      "cash flow management",
      "bank reconciliation",
      "report preparation",
      "leadership",
      "communication",
      "problem solving",
      "attention to detail",
      "analytical thinking",
      "collaboration",
      "SOP development",
      "SQL",
      "data mining",
      "risk management",
      "healthcare finance",
      "contract interpretation",
      "claims analysis",
      "medical terminology",
      "reimbursement methodologies",
      "team management"
    ],
    "short_keywords": [
      "analysis",
      "analytical",
      "attention",
      "bank",
      "cash",
      "claims",
      "collaboration",
      "communication",
      "contract",
      "data",
      "detail",
      "development",
      "erp",
      "finance",
      "financial",
      "flow",
      "healthcare",
      "interpretation",
      "leadership",
      "management",
      "medical",
      "methodologies",
      "mining",
      "preparation",
      "problem",
      "reconciliation",
      "reimbursement",
      "report",
      "reporting",
      "risk",
      "solving",
      "sop",
      "sql",
      "supervisormanager",
      "systems",
      "team",
      "terminology",
      "thinking",
      "to"
    ]
  },
  {
    "job_id": "3895589628",
    "job_title": "Finance Manager",
    "category": "FINANCE",
    "job_description": "TAKE YOUR NEXT CAREER STEP AT ABB WITH A GLOBAL TEAM THAT IS ENERGIZING THE TRANSFORMATION OF SOCIETY AND INDUSTRY TO ACHIEVE A MORE PRODUCTIVE, SUSTAINABLE FUTURE.\n\nAT ABB, WE HAVE THE CLEAR GOAL OF DRIVING DIVERSITY AND INCLUSION ACROSS ALL DIMENSIONS: GENDER, LGBTQ+, ABILITIES, ETHNICITY AND GENERATIONS. TOGETHER, WE ARE EMBARKING ON A JOURNEY WHERE EACH AND EVERY ONE OF US, INDIVIDUALLY AND COLLECTIVELY, WELCOMES AND CELEBRATES INDIVIDUAL DIFFERENCES.\n\nAS FINANCE MANAGER, YOU WILL ACT AS A BUSINESS PARTNER TO THE RELEVANT BUSINESS MANAGER(S) AND LEAD LOCAL FINANCE TEAMS TO OPTIMIZE THE FINANCIAL PERFORMANCE WITHIN PAPI. YOU WILL SUPPORT IN EFFECTIVE BUSINESS DECISIONS BY MONITORING, ANALYZING, AND INTERPRETING FINANCIAL DATA TO EVALUATE VARIOUS BUSINESS ALTERNATIVES AND RECOMMEND THE MOST APPROPRIATE BUSINESS SOLUTIONS.\n\nYOUR RESPONSIBILITIES\n\nCONTRIBUTES TO THE PLANNING PROCESS FOR THE BUSINESS UNIT.PARTNERS WITH RELEVANT BUSINESS LEADER IN DETERMINING STRATEGY FOR THEIR AREA OF RESPONSIBILITY AND DEVELOPING IMPLEMENTATION AND MONITORING PLAN.ENABLES STRATEGY TRANSLATION INTO DETAILED BUSINESS PLANS AND MONITORS MEASURABLE TARGETS.DRIVES BUSINESS PLANNING AND FORECASTING PROCESS FOR THEIR AREA OF RESPONSIBILITY.LEADS CROSS-FUNCTIONAL INITIATIVES THAT SUPPORT STRATEGIC GOALS.DRIVES THE DEFINITION AND IMPLEMENTATION OF GLOBAL STANDARDS AND BUSINESS SPECIFIC GUIDELINES TO ENSURE CONTINUOUS IMPROVEMENT IN FINANCIAL CONTROL PROCESS WITHIN THEIR AREA OF RESPONSIBILITY.LEADS, PROVIDES GUIDANCE, AND PARTICIPATES OR FACILITATES BEST PRACTICES TO ENSURE ALIGNMENT AND CONSISTENCY OF CONTROLLING PRACTICES.ENSURES TIMELY AND EFFICIENT COMMUNICATION WITH RELEVANT INTERNAL CUSTOMERS TO IDENTIFY AND DISCUSS ISSUES FOR IMPROVEMENT OF OPERATIONS, WORK QUALITY, AND EFFICIENCY FOR THEIR AREA OF RESPONSIBILITY.ENSURES TRANSPARENCY IN FINANCIAL REPORTING AND DISCLOSURES.DEFINES AND IMPLEMENTS INTERNAL CONTROLS REGARDING FINANCIAL AND NON-FINANCIAL OPERATIONS.ASSESSES BUSINESS RISK EXPOSURE AND DEFINES RISK MITIGATION STRATEGIES TO REDUCE IMPACT ON BUSINESS PERFORMANCE.IDENTIFIES AND COMMUNICATES FINANCIAL RISKS AND OPPORTUNITIES FROM BUSINESS PROPOSITIONS.ESTABLISHES AND DRIVES PROCESSES AND TOOLS NECESSARY TO OBTAIN TRANSPARENT AND RELIABLE FINANCIAL DATA AND BUSINESS INFORMATION.ENSURES HIGH QUALITY OF FINANCIAL DATA AND BUSINESS INFORMATION, IN LINE WITH DEFINED STANDARDS AND FINANCIAL CLOSING SCHEDULES.\n\nYOUR BACKGROUND\n\nBACHELOR’S DEGREE IN FINANCE, ACCOUNTING, OR RELATED FIELD REQUIRED7+ YEARS OF RELATED EXPERIENCE REQUIREDSKILLS IN ACCOUNTING, FINANCIAL ANALYSIS, PERFORMANCE/PEOPLE MANAGEMENT, OPERATIONAL EXCELLENCE, RISK MANAGEMENT, INTERNAL CONTROLS, DATA ANALYTICSMANAGEMENT OR LEADERSHIP EXPERIENCE DESIREDEXPERIENCE WITH ORGANIZATIONAL PROCESS IMPROVEMENTS INITIATIVES\n\nMORE ABOUT US\n\nWE OFFER AN INTERNATIONAL AND DYNAMIC WORKING ENVIRONMENT WHERE OUR BUSINESS DELIVERS ADVANCED TECHNOLOGY IN LARGE PROJECTS ACROSS THE WORLD IN A CUSTOMER-ORIENTED AND HIGHLY GLOBALIZED INDUSTRY.\n\nWE LOOK FORWARD TO RECEIVING YOUR APPLICATION. IF YOU WANT TO DISCOVER MORE ABOUT ABB, TAKE ANOTHER LOOK AT OUR WEBSITE WWW.ABB.COM.\n\nEQUAL EMPLOYMENT OPPORTUNITY AND AFFIRMATIVE ACTION AT ABB\n\nABB IS AN EQUAL EMPLOYMENT OPPORTUNITY (EEO) AND AFFIRMATIVE ACTION EMPLOYER ENCOURAGING DIVERSITY IN THE WORKPLACE.\n\nALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO THEIR RACE, CREED, COLOR, ANCESTRY, RELIGION, SEX, NATIONAL ORIGIN, CITIZEN STATUS, AGE, SEXUAL ORIENTATION, GENDER IDENTITY, DISABILITY, MARITAL STATUS, FAMILY MEDICAL LEAVE STATUS, OR PROTECTED VETERANS STATUS. FOR MORE INFORMATION REGARDING YOUR (EEO) RIGHTS AS AN APPLICANT, PLEASE VISIT THE FOLLOWING WEBSITES:\n\nHTTPS://WWW.EEOC.GOV/SITES/DEFAULT/FILES/2022-10/EEOC_KNOWYOURRIGHTS_SCREEN_READER_10_20.PDF\n\nHTTPS://WWW.DOL.GOV/SITES/DOLGOV/FILES/OFCCP/PDF/PAY-TRANSP_%20ENGLISH_FORMATTEDESQA508C.PDF\n\nAS AN EQUAL EMPLOYMENT OPPORTUNITY AND AFFIRMATIVE ACTION EMPLOYER, APPLICANTS MAY REQUEST TO REVIEW THE AFFIRMATIVE ACTION PLAN OF A PARTICULAR ABB FACILITY BETWEEN THE HOURS OF 9:00 A.M. - 5:00 P.M. EST MONDAY THROUGH FRIDAY BY CONTACTING AN ABB HR REPRESENTATIVE AT 1-888-694-7762.\n\nPROTECTED VETERANS AND QUALIFIED INDIVIDUALS WITH A DISABILITY MAY REQUEST A REASONABLE ACCOMMODATION IF YOU ARE UNABLE OR LIMITED IN YOUR ABILITY TO USE OR ACCESS ABB'S CAREER SITE AS A RESULT OF YOUR DISABILITY. YOU MAY REQUEST REASONABLE ACCOMMODATIONS BY CALLING AN ABB HR REPRESENTATIVE AT 1-888-694-7762 OR BY SENDING AN EMAIL TO US-ASKHR@ABB.COM. RESUMES AND APPLICATIONS WILL NOT BE ACCEPTED IN THIS MANNER.\n\nMYBENEFITSABB.COM\n\n\n91216813",
    "job_skill_set": [
      "finance",
      "accounting",
      "financial analysis",
      "risk management",
      "internal controls",
      "data analytics",
      "performance management",
      "operational excellence",
      "business planning",
      "forecasting",
      "leadership",
      "communication",
      "teamwork",
      "problem solving",
      "strategic thinking",
      "adaptability",
      "collaboration",
      "decision making"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "analysis",
      "analytics",
      "business",
      "collaboration",
      "communication",
      "controls",
      "data",
      "decision",
      "excellence",
      "finance",
      "financial",
      "forecasting",
      "internal",
      "leadership",
      "making",
      "management",
      "manager",
      "operational",
      "performance",
      "planning",
      "problem",
      "risk",
      "solving",
      "strategic",
      "teamwork",
      "thinking"
    ]
  },
  {
    "job_id": "3899528915",
    "job_title": "Accounting and Finance Consulting Manager, Fund Services Plus, Location Flexible",
    "category": "FINANCE",
    "job_description": "WE ARE THE LEADING PROVIDER OF PROFESSIONAL SERVICES TO THE MIDDLE MARKET GLOBALLY, OUR PURPOSE IS TO INSTILL CONFIDENCE IN A WORLD OF CHANGE, EMPOWERING OUR CLIENTS AND PEOPLE TO REALIZE THEIR FULL POTENTIAL. OUR EXCEPTIONAL PEOPLE ARE THE KEY TO OUR UNRIVALED, INCLUSIVE CULTURE AND TALENT EXPERIENCE AND OUR ABILITY TO BE COMPELLING TO OUR CLIENTS. YOU’LL FIND AN ENVIRONMENT THAT INSPIRES AND EMPOWERS YOU TO THRIVE BOTH PERSONALLY AND PROFESSIONALLY. THERE’S NO ONE LIKE YOU AND THAT’S WHY THERE’S NOWHERE LIKE RSM.\n\nARE YOU INTERESTED IN JOINING AN IN-DEMAND RAPIDLY GROWING PRACTICE WITH EXPERIENCED PROFESSIONALS OF DIVERSE BACKGROUNDS?\n\nDO YOU ENJOY SERVING AND WORKING COLLABORATIVELY WITH YOUR CLIENTS, AND WOULD YOU LOOK FORWARD TO PLAYING A VITAL ROLE IN SUPPORTING THEIR BUSINESSES FROM AN OPERATIONAL AND FINANCIAL REPORTING PERSPECTIVE?\n\nARE YOU LOOKING TO ENHANCE YOUR TECHNICAL KNOWLEDGE OF COMPLEX FUND TERMS, TECHNICAL ACCOUNTING ISSUES AND FUND STRUCTURES IN THE PRIVATE EQUITY INDUSTRY?\n\nARE YOU LOOKING FOR A CAREER THAT WILL PROVIDE YOU WITH INTERESTING AND VARIED PROFESSIONAL GROWTH OPPORTUNITIES?\n\nIF SO, RSM'S FUND SERVICES + IS THE RIGHT FIT FOR YOU!\n\nRSM IS LOOKING FOR A MANAGER TO JOIN OUR RSM FUND SERVICES + PRACTICE. CHANGING ECONOMIES, NEW ACCOUNTING POLICIES AND EVOLVING TAX REGULATIONS MEAN THAT BUSINESS AND PROFESSIONAL SERVICES FIRMS FACE AN EVER-CHANGING BUSINESS LANDSCAPE. WITH MORE THAN 80 YEARS OF INDUSTRY EXPERTISE, RSM HAS HELPED THOUSANDS OF FIRMS TO ACHIEVE THEIR BUSINESS OBJECTIVES. AT RSM, OUR DEEP INDUSTRY EXPERIENCE AND FOCUS, AS WELL AS OUR COMPETITIVE ADVANTAGE THROUGH OUR CUTTING EDGE TECHNOLOGY AND INNOVATION, DEFINES OUR COMMITMENT TO QUALITY, MAKING RSM A FIRST CHOICE ADVISOR TO OUR CLIENTS SERVING THE FINANCIAL SERVICES, TECHNOLOGY, LIFE SCIENCES, AND MANUFACTURING INDUSTRIES.\n\nBUSINESS UNIT: CONSULTING\n\nPOSITION TITLE: FUND ACCOUNTANT MANAGER OF RSM FUND SERVICES PLUS\n\nPOSITION DESCRIPTION: THIS POSITION WILL BE INVOLVED IN RSM’S FUND ADMINISTRATION SERVICE OFFERING (INCLUDING FUND ACCOUNTING, FINANCIAL REPORTING AND FUND OPERATIONS)\n\nSPECIFIC RESPONSIBILITIES:\n\nSERVE AS THE DAY-TO-DAY ENGAGEMENT MANAGER FOR FUND ADMINISTRATION ENGAGEMENTS WITH A STRONG FOCUS ON PRIVATE EQUITY CLIENTSMANAGE ALL ASPECTS OF THE ENGAGEMENTS INCLUDING, CAPITAL CALLS, DISTRIBUTIONS, WIRES/CASH MANAGEMENT, QUARTERLY REPORTING, AND YEAR END REPORTINGMANAGE, TRAIN AND DEVELOP THE FUND SERVICES PLUS TEAM TO ASSIST WITH FUND ACCOUNTING, OPERATIONAL, AND REPORTING DELIVERABLESLIAISE WITH LEADERSHIP FROM OUR OFFSHORE AFFILIATES AND HELP COORDINATE THE ACTIVITIES OF THE OFFSHORE TEAM RELATING TO FUND SERVICES PLUS FUND ADMINISTRATION ENGAGEMENTSEDUCATE THE US TEAM ON THE VARIOUS CRITICAL ASPECTS IN SERVICING FUND ADMINISTRATION CLIENTSHEAVY INTERACTION WITH THE CLIENTS TO ENSURE ALL DELIVERABLES ARE METBECOME AN EXPERT USER IN THE FIRM’S FUND ADMINISTRATION TECHNOLOGY PLATFORMSPLAY AN IMPORTANT ROLE IN QUALITY CONTROL AND ENSURE THE IMPLEMENTATION/ADHERENCE TO POLICIES AND PROCEDURES FOR FUND ADMINISTRATIONMANAGE/ASSIST IN THE REVIEW AND PREPARATION OF THE WORK PAPER SUPPORTING SCHEDULES FOR FINANCIAL STATEMENT ACCOUNTSCOORDINATE FUND LEVEL OPERATING ACTIVITIES SUBSEQUENT CLOSES, FEE CALCULATIONS, INCLUDING CREDIT FACILITY MAINTENANCE, DEAL FUNDING, AND INVESTOR FUNDINGCOORDINATE WITH BOTH INTERNAL AND EXTERNAL AUDITORS WITH ALL ASPECTS OF THE ANNUAL AUDITMANAGE/ASSIST IN THE MAINTENANCE AND REVIEW OF THE WATERFALL DATA AND THE DEVELOPMENT OF CARRIED INTEREST CALCULATIONS/MODELSWORK WITH LEGAL AND COMPLIANCE TEAM TO ENSURE COMPLIANCE WITH VARIOUS FUND POLICIES AND PROCEDURESRESPONSIBLE FOR THE PROMPT RESPONSE TO INVESTORS’ REQUESTSPLAY A SIGNIFICANT ROLE IN THE ONBOARDING PROCESS, INCLUDING THE DESIGN FOR CLIENT ONBOARDING ‘CENTER OF EXCELLENCE’ FOR ONBOARDING NEW ADVISORS/FUNDSASSIST WITH THE TESTING AND IMPLEMENTATION OF INITIATIVES TO IMPROVE AND STREAMLINE FUND ACCOUNTING FUNCTIONS\n\nQUALIFICATIONS:\n\nRSM SEEKS TO HIRE INDIVIDUALS WHO ARE HIGHLY MOTIVATED, INTELLIGENT AND HAVE DEMONSTRATED EXCELLENCE IN PRIOR ENDEAVORS.\n\n7+ YEARS OF BIG 4 OR NATIONAL ACCOUNTING FIRMS FUND ACCOUNTING EXPERIENCE IN THE PRIVATE EQUITY INDUSTRYWELL VERSED IN INTERPRETING /APPLYING THE FINANCIAL AND OPERATIONAL TERMS OF LIMITED PARTNERSHIP AGREEMENTS FOR PRIVATE EQUITY FUNDSUNDERGRADUATE DEGREE IN ACCOUNTINGGRADUATE DEGREE, CPA AND/OR CAPROFICIENT KNOWLEDGE OF MICROSOFT OFFICE SUITE (EXCEL, WORD, POWERPOINT)ALLVUE KNOWLEDGE A LARGE PLUS!PROFICIENT KNOWLEDGE OF FUND ACCOUNTING SOFTWARE (INVESTRAN, E-FRONT, ETC.)STRONG ANALYTICAL SKILLS, DETAIL ORIENTED AND HIGHLY ORGANIZEDPOSSESSES A STRONG WORK ETHIC, PERSONAL AND PROFESSIONAL INTEGRITY, AND A POSITIVE ATTITUDESTRONG ORAL AND WRITTEN COMMUNICATION AND INFLUENCING SKILLSABILITY TO WORK IN A DYNAMIC, FAST‐PACED ENVIRONMENT AND HANDLE MULTIPLE PROJECTS\n\nAT RSM, WE OFFER A COMPETITIVE BENEFITS AND COMPENSATION PACKAGE FOR ALL OUR PEOPLE. WE SUPPORT AND INSPIRE YOU TO PRIORITIZE YOUR WELLBEING BY DELIVERING PERSONALIZED, HOLISTIC PROGRAMMING FOR YOUR PHYSICAL, EMOTIONAL, FINANCIAL AND COMMUNITY WELLBEING. RSM HAS A GENEROUS TIME OFF POLICY WITH AT LEAST 14 PAID HOLIDAYS, WELLBEING DAYS AND ASSOCIATE AND ABOVE ACCESS TO SELF-MANAGED TIME OFF. WE OFFER FLEXIBILITY IN YOUR SCHEDULE, EMPOWERING YOU TO BALANCE LIFE’S DEMANDS, WHILE ALSO MAINTAINING YOUR ABILITY TO SERVE CLIENTS. LEARN MORE ABOUT OUR TOTAL REWARDS AT HTTPS://RSMUS.COM/CAREERS/WORKING-AT-RSM/BENEFITS.\n\nRSM IS PROUD TO BE AN AFFIRMATIVE ACTION AND EQUAL EMPLOYMENT OPPORTUNITY EMPLOYER.  WE ARE PROUD TO PROVIDE OUR EMPLOYEES WITH TOOLS TO ASSIST THEM IN BEING SUCCESSFUL IN ACHIEVING BOTH PERSONAL AND PROFESSIONAL GOALS. WE WELCOME AND SUPPORT ALL OUR EMPLOYEES TO THRIVE IN AN ENVIRONMENT FREE OF DISCRIMINATION AND HARASSMENT. AS AN AFFIRMATIVE ACTION AND EQUAL OPPORTUNITY EMPLOYER ALL APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT AS RSM DOES NOT TOLERATE DISCRIMINATION AND/OR HARASSMENT BASED ON RACE; COLOR; CREED; SINCERELY HELD RELIGIOUS BELIEFS, PRACTICES OR OBSERVANCES; SEX (INCLUDING PREGNANCY OR DISABILITIES RELATED TO NURSING); GENDER (INCLUDING GENDER IDENTITY AND/OR GENDER EXPRESSION); SEXUAL ORIENTATION; HIV STATUS; NATIONAL ORIGIN; ANCESTRY; FAMILIAL OR MARITAL STATUS; AGE; PHYSICAL OR MENTAL DISABILITY; CITIZENSHIP; POLITICAL AFFILIATION; MEDICAL CONDITION (INCLUDING FAMILY AND MEDICAL LEAVE); DOMESTIC VIOLENCE VICTIM STATUS; PAST, CURRENT OR PROSPECTIVE SERVICE IN THE US UNIFORMED SERVICE; PRE-DISPOSING GENETIC CHARACTERISTICS OR ANY OTHER CHARACTERISTIC PROTECTED UNDER APPLICABLE FEDERAL, STATE OR LOCAL LAW.\n\nACCOMMODATION FOR APPLICANTS WITH DISABILITIES IS AVAILABLE UPON REQUEST IN CONNECTION WITH THE RECRUITMENT PROCESS AND/OR EMPLOYMENT/PARTNERSHIP. RSM IS COMMITTED TO PROVIDING EQUAL OPPORTUNITY AND REASONABLE ACCOMMODATION FOR PEOPLE WITH DISABILITIES. IF YOU REQUIRE A REASONABLE ACCOMMODATION TO COMPLETE AN APPLICATION, INTERVIEW, OR OTHERWISE PARTICIPATE IN THE RECRUITING PROCESS, PLEASE CALL US AT 800-274-3978 OR SEND US AN EMAIL AT CAREERS@RSMUS.COM.\n\nRSM DOES NOT INTEND TO HIRE ENTRY LEVEL CANDIDATES WHO WILL REQUIRE SPONSORSHIP NOW OR IN THE FUTURE (I.E. F-1 VISA HOLDERS). HOWEVER, THOSE CANDIDATES WHO MAY BE RECENT U.S. COLLEGE / UNIVERSITY GRADUATES POSSESSING 1-2 YEARS OF PROGRESSIVE AND RELEVANT WORK EXPERIENCE, EXCLUDING INTERNSHIPS, IN THE U.S. OR HIS/HER HOME COUNTRY WOULD BE ELIGIBLE FOR HIRE AS AN EXPERIENCED CANDIDATE AND THUS ELIGIBLE FOR SPONSORSHIP.\n\nCOMPENSATION RANGE: $89,100 - $190,400",
    "job_skill_set": [
      "financial reporting",
      "private equity",
      "Microsoft Office Suite",
      "analytical skills",
      "graduate degree",
      "compliance",
      "communication",
      "teamwork",
      "problem solving",
      "work ethic",
      "organizational skills",
      "influencing skills",
      "adaptability",
      "client service orientation",
      "fund accounting",
      "fund accounting software",
      "Allvue",
      "CPA",
      "limited partnership agreements",
      "cash management",
      "quality control",
      "audit coordination",
      "carried interest calculations",
      "onboarding processes",
      "positive attitude"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "agreements",
      "allvue",
      "analytical",
      "and",
      "attitude",
      "audit",
      "calculations",
      "carried",
      "cash",
      "client",
      "communication",
      "compliance",
      "consulting",
      "control",
      "coordination",
      "cpa",
      "degree",
      "equity",
      "ethic",
      "finance",
      "financial",
      "flexible",
      "fund",
      "graduate",
      "influencing",
      "interest",
      "limited",
      "location",
      "management",
      "manager",
      "microsoft",
      "office",
      "onboarding",
      "organizational",
      "orientation",
      "partnership",
      "plus",
      "positive",
      "private",
      "problem",
      "processes",
      "quality",
      "reporting",
      "service",
      "services",
      "skills",
      "software",
      "solving",
      "suite",
      "teamwork",
      "work"
    ]
  },
  {
    "job_id": "3891263924",
    "job_title": "Intern - Finance and Accounting",
    "category": "FINANCE",
    "job_description": "OVERVIEW\n\nWHY JOIN NEWPARK? \n\nONE OF NEWPARK’S CORE VALUES IS EXCELLENCE. IT MEANS WE ARE COMMITTED TO DELIVERING VALUE THROUGH PERFORMANCE, INNOVATION, AND SERVICE QUALITY, AND THAT COMMITMENT STARTS WITH YOU! NEWPARK IS WHERE YOU CAN CHALLENGE YOURSELF IN NEW AND EXCITING WAYS AND WORK IN AN ENVIRONMENT THAT SUPPORTS AND VALUES YOU. HERE AT NEWPARK, WE ARE COMMITTED TO FINDING, DEVELOPING, RETAINING, AND REWARDING THE BEST TALENT WHILE PROVIDING AN ENVIRONMENT WHERE OUR EMPLOYEES CAN GROW PROFESSIONALLY AND PERSONALLY.\n\nWHO WE ARE\n\nNEWPARK IS TRANSITIONING FROM AN OILFIELD SERVICES COMPANY TO A LEADING PROVIDER OF SUSTAINABLE TECHNOLOGIES AND SERVICES ACROSS THE ENERGY INDUSTRY. WE HAVE A GLOBAL PRESENCE IN LARGE-SCALE, LONG-TERM MARKETS, WITH BUSINESS UNITS POSITIONED AT EACH END OF THE ENERGY TRANSITION. HEADQUARTERED IN THE WOODLANDS, TEXAS, WE SERVE MARKETS WORLDWIDE, WITH AN ESTABLISHED GLOBAL PRESENCE, DEMONSTRATING OUR COMMITMENT TO BEING A STRONG AND RELIABLE PARTNER FOR OUR CUSTOMERS, WHEREVER THEY NEED US TO BE.\n\nWHAT WE DO\n\nAT NEWPARK, OUR DRIVE IS TO HELP CUSTOMERS IMPROVE THE EFFICIENCIES AND SUSTAINABILITY OF THEIR OPERATIONS WHILE DELIVERING RELIABLE AND ENVIRONMENTALLY RESPONSIBLE SOLUTIONS. THIS DRIVE IS THE CATALYST FOR INNOVATION AND DEVELOPMENT OF NEXT-GENERATION PRODUCTS AND SERVICES ACROSS ALL OUR BUSINESSES.\n\nWHAT WE VALUE\n\nWE MAINTAIN AN UNWAVERING COMMITMENT TO ACT FOLLOWING OUR CORE VALUES OF SAFETY, INTEGRITY, RESPECT, EXCELLENCE, AND ACCOUNTABILITY, ENSURING OUR CUSTOMERS RECEIVE THE BEST PRODUCTS AND SERVICES WE CAN OFFER AND THAT YOU EXPERIENCE A SAFE WORKPLACE WHERE YOU CAN THRIVE:\n\nSAFETY - PROTECTING EACH OTHER LIKE FAMILY WHILE SUSTAINING THE ENVIRONMENT IN WHICH WE WORK.\n\nINTEGRITY - ACTING HONESTLY, ETHICALLY, AND RESPONSIBLY IN ALL ASPECTS OF OUR BUSINESS.\n\nRESPECT - DEALING FAIRLY AND OPENLY WITH EMPLOYEES, CUSTOMERS, SUPPLIERS, AND THE COMMUNITY.\n\nEXCELLENCE - DELIVERING VALUE THROUGH PERFORMANCE, INNOVATION, AND SERVICE QUALITY.\n\nACCOUNTABILITY - USING GOOD JUDGMENT AND TAKING RESPONSIBILITY FOR OUR ACTIONS.\n\nESSENTIAL FUNCTIONS\n\nNEWPARK IS LOOKING FOR A FINANCE / ACCOUNTING INTERN FOR SUMMER OF 2024. UNDER DIRECT SUPERVISION, THE INTERN WILL ASSIST IN DAY-TO-DAY FINANCE AND ACCOUNTING ACTIVITIES, WHICH WILL INCLUDE ANALYSIS AND SPECIAL PROJECTS TO BE DEFINED.\n\nPOSITION FUNCTIONS\n\nASSIST CORPORATE ACCOUNTING TEAM WITH MONTH-END CLOSE PROCESS/TASKS, INCLUDING PREPARATION OF ACCOUNT ANALYSIS ASSIST DIVISIONAL CONTROLLER TEAM WITH ANALYSIS OR SPECIAL PROJECTS ASSIST INTERNAL AUDIT TEAM WITH ANALYSIS OR SPECIAL PROJECTS PARTICIPATE IN SOX PROCESS WALKTHROUGHS AND IMPLEMENTATION OF AUDITBOARD (SOX PLATFORM) SYSTEM FUNCTIONALITY PARTICIPATE IN THE DEVELOPMENT OF ESG REPORTING ROADMAP (IN CONJUNCTION WITH HSE TEAM) THAT ALIGNS WITH THE NEW SEC RULE PARTICIPATE IN THE ERP PROJECT, INCLUDING DATA READINESS INITIATIVES \n\nREQUIREMENTS: CURRENTLY ENROLLED IN AN ACCREDITED UNIVERSITY, PURSUING A BACHELOR’S DEGREE IN FINANCE OR ACCOUNTING.\n\nKNOWLEDGE, SKILLS AND ATTRIBUTES: THE INTERNSHIP CANDIDATE SHOULD HAVE A BASIC UNDERSTANDING OF BUSINESS PRACTICES AND PROFESSIONALISM, ALONG WITH GOOD ATTENTION TO DETAIL, VERBAL AND WRITTEN COMMUNICATION SKILLS, AND PC SKILLS.\n\nEDUCATION & EXPERIENCE REQUIREMENTS\n\nBACHELOR'S DEGREE OR CURRENTLY ENROLLED IN BACHELOR'S OR POSTGRADUATE PROGRAM\n\nPOSITION SUMMARY\n\nNEWPARK’S INTERNSHIP PROGRAM OFFERS STUDENTS AN OPPORTUNITY TO LEARN AND WORK WITH SUBJECT MATTER EXPERTS IN THEIR FIELD OF STUDY AND BE PART OF A DYNAMIC TEAM WORKING TOWARDS COMPANY STRATEGIC GOALS. INTERNS WILL BE PAIRED WITH A MENTOR AND WILL BE ASSIGNED SPECIFIC PROJECT(S) THAT ARE CRITICAL TO NEWPARK’S SUCCESS.\n\nHOW TO APPLY\n\nREGISTER TO CREATE AN ACCOUNT THEN SEARCH FOR THE VACANCY. CLICK APPLY TO COMPLETE YOUR APPLICATION ONLINE.\n\nWE ARE AN EQUAL OPPORTUNITY EMPLOYER. NEWPARK AND ITS AFFILIATES DO NOT DISCRIMINATE AGAINST APPLICANTS OR EMPLOYEES ON THE BASIS OF RACE, COLOR, AGE, RELIGION, SEX (INCLUDING PREGNANCY AND GENDER IDENTITY), NATIONAL ORIGIN, SEXUAL ORIENTATION, DISABILITY, MILITARY SERVICE/VETERAN STATUS, GENETIC INFORMATION, OR ANY OTHER PROTECTED STATUS. FOR MORE INFORMATION ON EQUAL EMPLOYMENT OPPORTUNITY, PLEASE CLICK HERE .\n\nNEWPARK RESOURCES, INC. IS COMMITTED TO ENSURING EQUAL EMPLOYMENT OPPORTUNITY, INCLUDING PROVIDING REASONABLE ACCOMMODATIONS TO INDIVIDUALS WITH A DISABILITY. APPLICANTS WITH A PHYSICAL OR MENTAL DISABILITY WHO REQUIRE A REASONABLE ACCOMMODATION FOR ANY PART OF THE APPLICATION OR HIRING PROCESS MAY CONTACT THE MANAGER, HR GOVERNANCE & COMPLIANCE AT HRCOMPLIANCE@NEWPARK.COM .\n\nIRC10820",
    "job_skill_set": [
      "accounting",
      "finance",
      "data analysis",
      "ERP systems",
      "SOX compliance",
      "PC skills",
      "communication",
      "attention to detail",
      "professionalism",
      "teamwork",
      "problem solving",
      "ESG reporting"
    ],
    "short_keywords": [
      "accounting",
      "analysis",
      "and",
      "attention",
      "communication",
      "compliance",
      "data",
      "detail",
      "erp",
      "esg",
      "finance",
      "intern",
      "pc",
      "problem",
      "professionalism",
      "reporting",
      "skills",
      "solving",
      "sox",
      "systems",
      "teamwork",
      "to"
    ]
  },
  {
    "job_id": "3895527225",
    "job_title": "Data Solutions Analyst II (Managed Care - Finance Focus) - R7269",
    "category": "FINANCE",
    "job_description": "THIS IS DATA SOLUTIONS WITH PURPOSE! BRING YOUR DEEP KNOWLEDGE OF FINANCIAL REPORTING, AND STRONG DATA SKILLS TO OUR STATE-OF-THE-ART DATABRICKS PLATFORM AND JOIN US AS WE CHANGE LIVES – TOGETHER! THIS ROLE FOCUSES UPON FINANCIAL SUBJECTS WITHIN THE HEALTH INSURANCE INDUSTRY: CLAIMS, MEMBERSHIP, ELIGIBILITY, AND FINANCIAL ACCOUNTING. YOU WILL WORK CLOSELY WITH BOTH OUR BUSINESS PARTNERS AND ENGINEERS TO DESIGN, TEST, AND REPORT FROM DATASETS THAT IMPACT THE LIVES OF MILLIONS OF MEMBERS WITHIN A DYNAMIC, GROWING ORGANIZATION!\n\nJOB SUMMARY\n\nTHE DATA SOLUTIONS ANALYST II BLENDS TWO RELATED FUNCTIONS: DATA WAREHOUSING (INCLUDING ETL, DEVELOPMENT, TESTING, AND AD-HOC REPORTING, AND BUSINESS ANALYTICS (INCLUDING REQUIREMENTS GATHERING, ANALYSIS, PRESENTATION).\n\nESSENTIAL FUNCTIONS\n\nPARTICIPATE IN THE FULL LIFE CYCLE OF DATA AND ANALYTIC SOLUTIONS, BROADLY FROM REQUIREMENTS THROUGH ETL, PRODUCTION, CONSUMPTION, AND AD-HOC REPORTING. INCLUDING:DEVELOP END-TO-END DATA WAREHOUSE / DATA MART SOLUTIONS, UTILIZING DATABRICKS AND MICROSOFT TECHNOLOGIESDEVELOP EXPERTISE ON ONE OR MORE INSURER-SPECIFIC DATA / WORKFLOWS, SUCH AS CLAIMS, CARE MANAGEMENT (CM), UTILIZATION MANAGEMENT (UM), ELIGIBILITY, AND POPULATION HEALTHPARTNER WITH STAKEHOLDERS IN PRODUCT IDEATION, REQUIREMENTS GATHERING, DATA REVIEWS, TROUBLESHOOTINGDEVELOP OR SUPPORT REPORTS, DASHBOARDS, AND AD-HOC ANALYSIS SUPPORTING BUSINESS CONSUMERSTEST, DEBUG, AND PERFORMANCE TUNE DATA PIPELINES AND END-USER QUERIESMAINTAIN THE HIGHEST LEVEL OF DATA SECURITY AND CONFIDENTIALITY, CONFORMING TO ALL HIPAA AND CONTRACT REQUIREMENTS\n\nEDUCATION AND EXPERIENCE\n\nBACHELOR'S DEGREE IN COMPUTER SCIENCE, ENGINEERING, MATHEMATICS, A RELATED FIELD, OR EQUIVALENT COMBINATION OF EDUCATION AND EXPERIENCE IS REQUIREDA MINIMUM OF FOUR (4) YEARS’ ADVANCED SQL EXPERIENCE (INCLUDING DATA MODELING, PROFILING AND CLEANSING, AND BUILDING COMPLEX DATA SETS) IS REQUIREDA MINIMUM OF TWO (2) YEARS’ EXPERIENCE BUILDING ENTERPRISE DATA SOLUTIONS (DATA WAREHOUSES AND DATA MARTS) IS REQUIREDA MINIMUM OF TWO (2) YEARS’ EXPERIENCE BUILDING CUSTOMER FACING DATA SOLUTIONS (POWERBI, TABLEAU, ORACLE, ADVANCED EXCEL, ETC.) IS REQUIREDA MINIMUM OF TWO (2) YEARS’ EXPERIENCE IN HEALTHCARE DATA IS PREFERRED\n\nCOMPETENCIES, KNOWLEDGE AND SKILLS\n\nADVANCED SQL SKILLS, INCLUDING THE ABILITY TO DEVELOP UPON AND MAINTAIN SYSTEMS UTILIZING CONTEMPORARY DATA WAREHOUSING PATTERNS INCLUDING ETL / ELT, FACT AND DIMENSION MODELING, AND DEPLOYING ANALYTIC RESOURCES VIA STAGING TIERS AND CONSUMPTION LAYERSPROFICIENT WORKING WITH AND WAREHOUSING DATA FROM MULTIPLE SOURCES, SUCH AS OPERATIONAL DATA STORES (ODS), FLAT FILE, EDI/HL7, API, ETC.PROFICIENCY WITH THE MICROSOFT DATA ECOSYSTEM (SSRS, SSIS, POWERBI)EXPERIENCE WITH AZURE DATABRICKS AND SPARKSQLWORKING KNOWLEDGE OF PYTHONPYTHON-SPECIFIC DATA MODELING SKILL SUPPORTING DATA TRANSFORMATION AND DATA SCIENCEKNOWLEDGE OF COMMON HEALTHCARE DATA DOMAINS AND PROCESSES (PATIENT REGISTRY, BILLING, DIAGNOSIS, PROCEDURE CODES)HEALTHCARE INSURANCE-SPECIFIC DOMAINS, SUCH AS CLAIMS (MEDICAL AND PHARMACY), HEALTH INFORMATION EXCHANGE (HIE), UTILIZATION MANAGEMENT (UM), DEMOGRAPHICSPROFICIENT WITH THE MICROSOFT 365 SUITE, INCLUDING EXTENSIVE USE OF TEAMS, SHAREPOINT, AND EXCELGOOD WRITTEN AND VERBAL COMMUNICATION SKILLS\n\nLICENSURE AND CERTIFICATION\n\nRELEVANT MICROSOFT CERTIFICATIONS (SQL, POWERBI, AZURE) IS PREFERREDDATABRICKS CERTIFICATION AND/OR BADGING IS PREFERRED\n\nWORKING CONDITIONS\n\nGENERAL OFFICE ENVIRONMENT; MAY BE REQUIRED TO SIT OR STAND FOR EXTENDED PERIODS OF TIME\n\nCOMPENSATION RANGE\n\n$69,400.00 - $111,000.00 CARESOURCE TAKES INTO CONSIDERATION A COMBINATION OF A CANDIDATE’S EDUCATION, TRAINING, AND EXPERIENCE AS WELL AS THE POSITION’S SCOPE AND COMPLEXITY, THE DISCRETION AND LATITUDE REQUIRED FOR THE ROLE, AND OTHER EXTERNAL AND INTERNAL DATA WHEN ESTABLISHING A SALARY LEVEL. WE ARE HIGHLY INVESTED IN EVERY EMPLOYEE’S TOTAL WELL-BEING AND OFFER A SUBSTANTIAL AND COMPREHENSIVE TOTAL REWARDS PACKAGE.\n\nCOMPENSATION TYPE\n\nSALARY",
    "job_skill_set": [
      "Communication",
      "Collaboration",
      "Problem Solving",
      "Adaptability",
      "SQL",
      "Data Warehousing",
      "ETL",
      "Databricks",
      "Power BI",
      "Tableau",
      "Azure",
      "Python",
      "Data Modeling",
      "Data Analysis",
      "Data Security",
      "Microsoft 365 Suite",
      "Attention to Detail"
    ],
    "short_keywords": [
      "365",
      "adaptability",
      "analysis",
      "analyst",
      "attention",
      "azure",
      "bi",
      "care",
      "collaboration",
      "communication",
      "data",
      "databricks",
      "detail",
      "etl",
      "finance",
      "focus",
      "ii",
      "managed",
      "microsoft",
      "modeling",
      "power",
      "problem",
      "python",
      "r7269",
      "security",
      "solutions",
      "solving",
      "sql",
      "suite",
      "tableau",
      "to",
      "warehousing"
    ]
  },
  {
    "job_id": "3901998589",
    "job_title": "VP / Client, Finance & Strategy Data Scientist Lead – JPM Private Client",
    "category": "FINANCE",
    "job_description": "JOB DESCRIPTION\n\nVP / CLIENT, FINANCE & STRATEGY DATA SCIENTIST LEAD – JPM PRIVATE CLIENT\n\nDO YOU ENJOY SOLVING KEY STRATEGIC ISSUES THAT REQUIRE ANALYTICAL APPROACHES? IF YOU HAVE A KNACK FOR BRINGING THE POWER OF DATA TO KEY STAKEHOLDERS, THAT CAN CHANGE THE GAME, THEN THIS OPPORTUNITY IS FOR YOU!\n\nJOB SUMMARY\n\nWE ARE LOOKING FOR A VICE PRESIDENT, CLIENT, FINANCE & STRATEGY DATA SCIENTIST LEAD FOR OUR DATA & ANALYTICS TEAM. THIS IS AN INDIVIDUAL CONTRIBUTOR ROLE THAT WILL WORK HAND-IN-HAND WITH FINANCE, STRATEGY AND LEADERSHIP TEAM, HELPING THEM ADDRESS ISSUES THAT REQUIRE ADVANCED ANALYTICS AND/OR A BIG DATA-DRIVEN APPROACH.\n\nJOB RESPONSIBILITIES\n\nADEPT AT COMMUNICATING AND INTERFACING WITH SENIOR STAKEHOLDERS, LEVERAGING A BLEND OF ANALYTICAL SKILLS AND BUSINESS ACUMEN TO DRIVE IMPACTFUL RESULTS THAT INFORM STRATEGIC DECISIONS.COMMITMENT TO ITERATIVE DEVELOPMENT, WITH A PROVEN ABILITY TO ENGAGE AND UPDATE STAKEHOLDERS BI-WEEKLY OR AS NECESSARY, ENSURING ALIGNMENT, FEEDBACK INCORPORATION, AND TRANSPARENCY THROUGHOUT THE PROJECT LIFECYCLE.PROJECT OWNERSHIP AND DEVELOPMENT FROM INCEPTION TO COMPLETION, ENCOMPASSING TASKS SUCH AS GATHERING DETAILED REQUIREMENTS, DATA PREPARATION, MODEL CREATION, RESULT GENERATION, AND DATA VISUALIZATION. DEVELOP INSIGHTS, METHODS OR TOOLS USING VARIOUS ANALYTIC METHODS SUCH AS CAUSAL-MODEL APPROACHES, PREDICTIVE MODELING, REGRESSIONS, MACHINE LEARNING, TIME SERIES ANALYSIS, ETC.HANDLE LARGE AMOUNTS OF DATA FROM MULTIPLE AND DISPARATE SOURCES, EMPLOYING ADVANCED PYTHON AND SQL TECHNIQUES TO ENSURE EFFICIENCY AND ACCURACYUPHOLD THE HIGHEST STANDARDS OF DATA INTEGRITY AND SECURITY, ALIGNING WITH BOTH INTERNAL AND EXTERNAL REGULATORY REQUIREMENTS AND COMPLIANCE PROTOCOLS\n\nREQUIRED QUALIFICATIONS, CAPABILITIES, AND SKILLS\n\nPHD OR MSC. IN A SCIENTIFIC FIELD (COMPUTER SCIENCE, ENGINEERING, OPERATIONS RESEARCH, ETC.) PLUS 6 YEARS OR MORE OF EXPERIENCE IN PRODUCING ADVANCED ANALYTICS WORK WITH AN EMPHASIS IN OPTIMIZATIONSTRONG PROFICIENCY IN STATISTICAL SOFTWARE PACKAGES AND DATA TOOLS, INCLUDING PYTHON AND SQLSTRONG PROFICIENCY IN ADVANCED STATISTICAL METHODS AND CONCEPTS, PREDICTIVE MODELING, TIME SERIES FORECASTING, TEXT MININGSTRONG PROFICIENCY IN DATA MINING & VISUALIZATION (TABLEAU EXPERIENCED PREFERRED)EXPERIENCE IN CLOUD AND BIG DATA PLATFORMS SUCH AS AWS, SNOWFLAKE, HADOOP, HIVE, PIG, APACHE SPARK, ETC.STRONG STORY TELLING CAPABILITIES INCLUDING COMMUNICATING COMPLEX CONCEPTS INTO DIGESTIBLE INFORMATION TO BE CONSUMED BY AUDIENCES OF VARYING LEVELS IN THE ORGANIZATIONSTRONG COMMITMENT TO ITERATIVE DEVELOPMENT, WITH A PROVEN ABILITY TO ENGAGE AND UPDATE STAKEHOLDERS BI-WEEKLY OR AS NECESSARY, ENSURING ALIGNMENT, FEEDBACK INCORPORATION, AND TRANSPARENCY THROUGHOUT THE PROJECT LIFECYCLE.\n\nPREFERRED QUALIFICATIONS, CAPABILITIES, AND SKILLS\n\nFINANCIAL SERVICE INDUSTRY EXPERIENCE PREFERREDEXPERIENCE / UNDERSTANDING OF CLOUD STORAGE (OBJECT STORES LIKE S3, BLOB; NOSQL LIKE COLUMNAR, GRAPH DATABASES) \n\nABOUT US\n\nCHASE IS A LEADING FINANCIAL SERVICES FIRM, HELPING NEARLY HALF OF AMERICA’S HOUSEHOLDS AND SMALL BUSINESSES ACHIEVE THEIR FINANCIAL GOALS THROUGH A BROAD RANGE OF FINANCIAL PRODUCTS. OUR MISSION IS TO CREATE ENGAGED, LIFELONG RELATIONSHIPS AND PUT OUR CUSTOMERS AT THE HEART OF EVERYTHING WE DO. WE ALSO HELP SMALL BUSINESSES, NONPROFITS AND CITIES GROW, DELIVERING SOLUTIONS TO SOLVE ALL THEIR FINANCIAL NEEDS.\n\nWE OFFER A COMPETITIVE TOTAL REWARDS PACKAGE INCLUDING BASE SALARY DETERMINED BASED ON THE ROLE, EXPERIENCE, SKILL SET, AND LOCATION. FOR THOSE IN ELIGIBLE ROLES, DISCRETIONARY INCENTIVE COMPENSATION WHICH MAY BE AWARDED IN RECOGNITION OF INDIVIDUAL ACHIEVEMENTS AND CONTRIBUTIONS. WE ALSO OFFER A RANGE OF BENEFITS AND PROGRAMS TO MEET EMPLOYEE NEEDS, BASED ON ELIGIBILITY. THESE BENEFITS INCLUDE COMPREHENSIVE HEALTH CARE COVERAGE, ON-SITE HEALTH AND WELLNESS CENTERS, A RETIREMENT SAVINGS PLAN, BACKUP CHILDCARE, TUITION REIMBURSEMENT, MENTAL HEALTH SUPPORT, FINANCIAL COACHING AND MORE. ADDITIONAL DETAILS ABOUT TOTAL COMPENSATION AND BENEFITS WILL BE PROVIDED DURING THE HIRING PROCESS.\n\nWE RECOGNIZE THAT OUR PEOPLE ARE OUR STRENGTH AND THE DIVERSE TALENTS THEY BRING TO OUR GLOBAL WORKFORCE ARE DIRECTLY LINKED TO OUR SUCCESS. WE ARE AN EQUAL OPPORTUNITY EMPLOYER AND PLACE A HIGH VALUE ON DIVERSITY AND INCLUSION AT OUR COMPANY. WE DO NOT DISCRIMINATE ON THE BASIS OF ANY PROTECTED ATTRIBUTE, INCLUDING RACE, RELIGION, COLOR, NATIONAL ORIGIN, GENDER, SEXUAL ORIENTATION, GENDER IDENTITY, GENDER EXPRESSION, AGE, MARITAL OR VETERAN STATUS, PREGNANCY OR DISABILITY, OR ANY OTHER BASIS PROTECTED UNDER APPLICABLE LAW. WE ALSO MAKE REASONABLE ACCOMMODATIONS FOR APPLICANTS’ AND EMPLOYEES’ RELIGIOUS PRACTICES AND BELIEFS, AS WELL AS MENTAL HEALTH OR PHYSICAL DISABILITY NEEDS. VISIT OUR FAQS FOR MORE INFORMATION ABOUT REQUESTING AN ACCOMMODATION.\n\nEQUAL OPPORTUNITY EMPLOYER/DISABILITY/VETERANS\n\nABOUT THE TEAM\n\nOUR CONSUMER & COMMUNITY BANKING DIVISION SERVES OUR CHASE CUSTOMERS THROUGH A RANGE OF FINANCIAL SERVICES, INCLUDING PERSONAL BANKING, CREDIT CARDS, MORTGAGES, AUTO FINANCING, INVESTMENT ADVICE, SMALL BUSINESS LOANS AND PAYMENT PROCESSING. WE’RE PROUD TO LEAD THE U.S. IN CREDIT CARD SALES AND DEPOSIT GROWTH AND HAVE THE MOST-USED DIGITAL SOLUTIONS – ALL WHILE RANKING FIRST IN CUSTOMER SATISFACTION.",
    "job_skill_set": [
      "data integrity",
      "communication",
      "stakeholder engagement",
      "strategic thinking",
      "problem solving",
      "project management",
      "teamwork",
      "business acumen",
      "transparency",
      "python",
      "sql",
      "data visualization",
      "predictive modeling",
      "time series analysis",
      "machine learning",
      "data mining",
      "tableau",
      "cloud platforms",
      "big data",
      "statistical software",
      "causal-model approaches",
      "data preparation",
      "regressions",
      "text mining",
      "aws",
      "hadoop",
      "apache spark",
      "hive",
      "pig",
      "storytelling",
      "iterative development"
    ],
    "short_keywords": [
      "acumen",
      "analysis",
      "apache",
      "approaches",
      "aws",
      "big",
      "business",
      "causalmodel",
      "client",
      "cloud",
      "communication",
      "data",
      "development",
      "engagement",
      "finance",
      "hadoop",
      "hive",
      "integrity",
      "iterative",
      "jpm",
      "lead",
      "learning",
      "machine",
      "management",
      "mining",
      "modeling",
      "pig",
      "platforms",
      "predictive",
      "preparation",
      "private",
      "problem",
      "project",
      "python",
      "regressions",
      "scientist",
      "series",
      "software",
      "solving",
      "spark",
      "sql",
      "stakeholder",
      "statistical",
      "storytelling",
      "strategic",
      "strategy",
      "tableau",
      "teamwork",
      "text",
      "thinking",
      "time",
      "transparency",
      "visualization",
      "vp"
    ]
  },
  {
    "job_id": "3901988304",
    "job_title": "Operations Finance Analyst I",
    "category": "FINANCE",
    "job_description": "AT THERMO FISHER SCIENTIFIC, YOU’LL DISCOVER MEANINGFUL WORK THAT MAKES A POSITIVE IMPACT ON A GLOBAL SCALE. JOIN OUR COLLEAGUES IN BRINGING OUR MISSION TO LIFE - ENABLING OUR CUSTOMERS TO MAKE THE WORLD HEALTHIER, CLEANER AND SAFER.\n\nWE PROVIDE OUR TEAMS WITH THE RESOURCES NEEDED TO ACHIEVE INDIVIDUAL CAREER GOALS WHILE TAKING SCIENCE A STEP BEYOND THROUGH RESEARCH, DEVELOPMENT AND DELIVERY OF LIFE-CHANGING THERAPIES. WITH CLINICAL TRIALS CONDUCTED IN 100+ COUNTRIES AND ONGOING DEVELOPMENT OF NOVEL FRAMEWORKS FOR CLINICAL RESEARCH THROUGH OUR PPD CLINICAL RESEARCH PORTFOLIO, OUR WORK SPANS LABORATORY, DIGITAL AND DECENTRALIZED CLINICAL TRIAL SERVICES.\n\nYOUR DETERMINATION TO DELIVER QUALITY AND ACCURACY WILL IMPROVE HEALTH OUTCOMES THAT PEOPLE AND COMMUNITIES DEPEND ON – NOW AND IN THE FUTURE.\n\nTHE OPERATIONS FINANCE ANALYST POSITION IS A HOME-BASED ROLE WITHIN THE US WORKING UNDER OUR GLOBAL FINANCE DIVISION. THIS ROLE CONTRIBUTES TO THE ACHIEVEMENT OF FINANCIAL AND BUSINESS OBJECTIVES THROUGH ACCURATE AND TIMELY REPORTING OF REVENUE AND COSTS FOR CLINICAL TRIAL PROJECTS. WORKS CROSS-FUNCTIONALLY WITH OPERATIONS, CONTRACTS AND PROPOSALS, AND FINANCE THROUGHOUT THE PROJECT LIFECYCLE.\n\nESSENTIAL FUNCTIONS:\n\nADMINISTERS THE DAILY FINANCIAL MANAGEMENT OF PROJECTS CONSISTING OF SINGLE SERVICE CONTRACTS AND/OR TACTICAL ACCOUNTS.IDENTIFIES ISSUES RELATED TO CONTRACT MODIFICATIONS, CONTRACT VALUES, AND CONTRACT DELIVERABLES.PERFORMS ANALYSIS OF BUDGET TO ACTUAL DATA ON MONTHLY, QUARTERLY, AND ANNUAL BASES AND FOR REVENUE CALCULATIONS AND FORECASTING.ANALYZES COST ASSIGNMENTS, ENSURING THAT ALL ASSIGNED PROJECTS ADHERE TO ACCEPTED COST ACCOUNTING STANDARDS.PERFORMS REGULAR PROFITABILITY AND CASH FLOW ANALYSIS ON ASSIGNED PROJECTS.PERFORMS RECONCILIATIONS OF COSTS AND REVENUES RECOGNIZED FOR ASSIGNED PROJECTS.TRACKS AND MAINTAINS PROJECT INFORMATION AND BUDGETS WITHIN THE PROJECT ACCOUNTING SYSTEM.COORDINATES WITH SUPPORT STAFF TO ENSURE SPONSORS ARE INVOICED IN A TIMELY AND ACCURATE MANNER.\n\nEDUCATION AND EXPERIENCE:\n\nBACHELOR'S DEGREE OR EQUIVALENT AND RELEVANT FORMAL ACADEMIC / VOCATIONAL QUALIFICATION. PREVIOUS FINANCE EXPERIENCE THAT PROVIDES THE KNOWLEDGE, SKILLS, AND ABILITIES TO PERFORM THE JOB (COMPARABLE TO 0-2 YEARS’ EXPERIENCE)IN SOME CASES AN EQUIVALENCY, CONSISTING OF APPROPRIATE EDUCATION, TRAINING, AND/OR DIRECTLY RELATED EXPERIENCE WILL BE CONSIDERED SUFFICIENT FOR AN INDIVIDUAL TO MEET THE REQUIREMENTS OF THE ROLE.\n\nKNOWLEDGE, SKILLS, ABILITIES:\n\nABILITY TO FUNCTION AS AN EFFECTIVE AND RESPECTED PARTNER TO INTERNAL CLIENTSABILITY TO ADAPT QUICKLY TO NEW SYSTEMS AND PROCESSESCONFIDENCE TO HANDLE SENSITIVE INFORMATION AND MAKE SOUND RECOMMENDATIONSABILITY TO JUGGLE MULTIPLE TASKS WHILE STILL DELIVERING HIGH QUALITY RESULTSGOOD ANALYTICAL AND QUANTITATIVE SKILLS AND ABILITY TO HANDLE DATA EFFECTIVELYSTRONG WRITTEN AND ORAL COMMUNICATION SKILLSSTRONG ORGANIZATIONAL AND PROJECT ADMINISTRATION SKILLSHIGH LEVEL OF PROFICIENCY IN MICROSOFT EXCEL AND POWERPOINT FOR ANALYSIS AND PRESENTATION OF DATA, FOR ROLES WITH MORE TECHNICAL FOCUS PREVIOUS EXPERIENCE WITH SHAREPOINT / VBA / SQL / POWER BI / RPA (COMPARABLE TO 1+ YEARS) WILL BE AN ADVANTAGE.SOLID UNDERSTANDING OF ACCOUNTING/FINANCIAL PRINCIPLES AND REGULATIONS/LEGAL REQUIREMENTS, FOR ROLES WITH MORE ACCOUNTING FOCUS A PROFESSIONAL ACCOUNTING QUALIFICATION – ACCA / CPA / CIMA OR EQUIVALENT WILL BE AN ADVANTAGE.\n\nAS PART OF THE PROJECT ACCOUNTING CENTER OF EXCELLENCE (PACOE), THE FINANCIAL ANALYST POSITION CONTRIBUTES TO THE ACHIEVEMENT OF FINANCIAL AND BUSINESS OBJECTIVES THROUGH ACCURATE AND TIMELY FINANCIAL ANALYSIS AND REPORTING.\n\n PARTICIPATES IN MONTHLY AND QUARTERLY CONTROL TESTING PROCEDURES TO ENSURE REVENUE RECOGNITION IS COMPLETE AND ACCURATE. FACILITATES AUDIT TESTING BY SERVING AS THE LIAISON BETWEEN THE EXTERNAL AUDIT TEAM AND THE CORRESPONDING LAB. SUPPORT INITIATIVES FOR PROCESS CHANGES TO IMPROVE EFFICIENCY AND GLOBAL CONSISTENCY. PARTICIPATES IN SPECIAL PROJECTS AS ASSIGNED.\n\nPPD VALUES THE HEALTH AND WELL-BEING OF OUR EMPLOYEES. WE SUPPORT AND ENCOURAGE INDIVIDUALS TO CREATE A HEALTHY AND BALANCED ENVIRONMENT WHERE THEY CAN THRIVE. BELOW IS LISTED THE WORKING ENVIRONMENT/REQUIREMENTS FOR THIS ROLE:\n\nABLE TO COMMUNICATE, RECEIVE, AND UNDERSTAND INFORMATION AND IDEAS WITH DIVERSE GROUPS OF PEOPLE IN A COMPREHENSIBLE AND REASONABLE MANNER.\n\nABLE TO WORK UPRIGHT AND STATIONARY FOR TYPICAL WORKING HOURS.\n\nABILITY TO USE AND LEARN STANDARD OFFICE EQUIPMENT AND TECHNOLOGY WITH PROFICIENCY.\n\nABLE TO PERFORM SUCCESSFULLY UNDER PRESSURE WHILE PRIORITIZING AND HANDLING MULTIPLE PROJECTS OR ACTIVITIES.\n\nMAY REQUIRE 0-25% AS NEEDED TRAVEL.\n\n",
    "job_skill_set": [
      "financial management",
      "budget analysis",
      "cost accounting",
      "cash flow analysis",
      "Microsoft PowerPoint",
      "accounting principles",
      "financial reporting",
      "audit testing",
      "communication",
      "analytical skills",
      "organizational skills",
      "problem solving",
      "time management",
      "team collaboration",
      "attention to detail",
      "profitability analysis",
      "Microsoft Excel",
      "SharePoint",
      "VBA",
      "SQL",
      "Power BI",
      "RPA",
      "project administration",
      "adaptability"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "administration",
      "analysis",
      "analyst",
      "analytical",
      "attention",
      "audit",
      "bi",
      "budget",
      "cash",
      "collaboration",
      "communication",
      "cost",
      "detail",
      "excel",
      "finance",
      "financial",
      "flow",
      "i",
      "management",
      "microsoft",
      "operations",
      "organizational",
      "power",
      "powerpoint",
      "principles",
      "problem",
      "profitability",
      "project",
      "reporting",
      "rpa",
      "sharepoint",
      "skills",
      "solving",
      "sql",
      "team",
      "testing",
      "time",
      "to",
      "vba"
    ]
  },
  {
    "job_id": "3889104689",
    "job_title": "Lufkin Finance Analyst",
    "category": "FINANCE",
    "job_description": "ARE YOU A QUALITY PROFESSIONAL LOOKING FOR A NEW OPPORTUNITY?\n\nJOIN OUR LUFKIN GEARS TEAM!\n\nPARTNER WITH THE BEST\n\nAS A LUFKIN FINANCE ANALYST, YOU WILL BE RESPONSIBLE FOR:\n\n\nSUPPORTING PREPARATION AND CONSOLIDATION OF MONTHLY PLANT FINANCIAL ANALYSIS, PERFORMANCE REPORTS, AND KPIS, WITH A DEEP UNDERSTANDING OF VARIANCES TO PLAN AND OPERATIONAL DRIVERS.TRACKING VARIOUS PROJECTS FOR DIRECT MATERIAL PRODUCTIVITY, COST OF QUALITY, AND ABSORPTION OPTIMIZATION AT A GRANULAR LEVEL, RECOMMEND ACTIONS TO GET TO PLANNED PERFORMANCE.DRIVING CASH FLOW IMPROVEMENT INITIATIVES FOCUSING ON DRIVING COLLECTIONS OF CUSTOMER RECEIVABLES AND EFFECTIVELY MANAGING INVENTORY.HAVING EFFECTIVE COMMUNICATION WITH OTHER FUNCTIONAL AREAS IS REQUIRED. INFLUENCING PEERS TO MEET THE OBJECTIVES.PROVIDING FINANCIAL ADVICE AND SUPPORT TO THE TEAM LEADERS WITHIN THE FACILITY.PROVIDING FINANCIAL DATA TO THE OPERATING AND FINANCE TEAMS TO IDENTIFY TRENDS, DRIVE GROWTH, AND DRIVE BEHAVIOR.ENSURING THAT ADEQUATE INTERNAL FINANCIAL CONTROLS EXIST AND ARE ADHERED TO WITHIN THE FACILITY.WORKING CLOSELY WITH ACCOUNTING TEAMS IN VARIOUS LOCATIONS TO ENSURE THAT THE FINANCIAL ACCOUNTS ARE CORRECT AND SUPPORT THE ACCOUNT RECONCILIATION PROCESS.PERFORMING OTHER DUTIES AS ASSIGNED BY THE DIRECT MANAGER.\n\n\nFUEL YOUR PASSION\n\nTO BE SUCCESSFUL IN THIS ROLE YOU WILL:\n\n\nHAVE A DEGREE IN ACCOUNTING OR EQUIVALENT DISCIPLINE IS REQUIRED.HAVE A RECOGNIZED PROFESSIONAL ACCOUNTING QUALIFICATION.HAVE PROVEN EXPERIENCE IN A FINANCE POSITION SUPPORTING A HIGH-PERFORMANCE MANUFACTURING OPERATION.HAVE EXCELLENT COMMUNICATION, ORGANIZATION, AND TIME MANAGEMENT SKILLS WITH THE ABILITY TO MANAGE SEVERAL PRIORITIES AT ONCE WILL BE REQUIRED AS WILL A HIGH LEVEL OF FLEXIBILITY WITH A HIGH-LEVEL COMMITMENT TO SUCCESS.BE PROFICIENT WITH MICROSOFT WORD, MICROSOFT EXCEL, AND POWERPOINT PACKAGES.HAVE STRONG ORAL AND WRITTEN COMMUNICATION SKILLS IN ENGLISH.HAVE THE ABILITY TO COORDINATE SEVERAL PROJECTS SIMULTANEOUSLY.\n\n\nWORK IN A WAY THAT WORKS FOR YOU\n\nWE RECOGNIZE THAT EVERYONE IS DIFFERENT AND THAT THE WAY IN WHICH PEOPLE WANT TO WORK AND DELIVER AT THEIR BEST IS DIFFERENT FOR EVERYONE TOO. IN THIS ROLE, WE CAN OFFER THE FOLLOWING FLEXIBLE WORKING PATTERNS:\n\n\nWORKING FLEXIBLE HOURS - FLEXING THE TIMES WHEN YOU WORK IN THE DAY TO HELP YOU FIT EVERYTHING IN AND WORK WHEN YOU ARE THE MOST PRODUCTIVE\n\n\nWORKING WITH US\n\nOUR PEOPLE ARE AT THE HEART OF WHAT WE DO AT BAKER HUGHES. WE KNOW WE ARE BETTER WHEN ALL OF OUR PEOPLE ARE DEVELOPED, ENGAGED AND ABLE TO BRING THEIR WHOLE AUTHENTIC SELVES TO WORK. WE INVEST IN THE HEALTH AND WELL-BEING OF OUR WORKFORCE, TRAIN AND REWARD TALENT AND DEVELOP LEADERS AT ALL LEVELS TO BRING OUT THE BEST IN EACH OTHER.\n\nWORKING FOR YOU\n\nOUR INVENTIONS HAVE REVOLUTIONIZED ENERGY FOR OVER A CENTURY. BUT TO KEEP GOING FORWARD TOMORROW, WE KNOW WE HAVE TO PUSH THE BOUNDARIES TODAY. WE PRIORITIZE REWARDING THOSE WHO EMBRACE CHANGE WITH A PACKAGE THAT REFLECTS HOW MUCH WE VALUE THEIR INPUT. JOIN US, AND YOU CAN EXPECT:\n\n\nCONTEMPORARY WORK-LIFE BALANCE POLICIES AND WELLBEING ACTIVITIESCOMPREHENSIVE PRIVATE MEDICAL CARE OPTIONSSAFETY NET OF LIFE INSURANCE AND DISABILITY PROGRAMSTAILORED FINANCIAL PROGRAMSADDITIONAL ELECTED OR VOLUNTARY BENEFITS\n\n\nABOUT US:\n\nWE ARE AN ENERGY TECHNOLOGY COMPANY THAT PROVIDES SOLUTIONS TO ENERGY AND INDUSTRIAL CUSTOMERS WORLDWIDE. BUILT ON A CENTURY OF EXPERIENCE AND CONDUCTING BUSINESS IN OVER 120 COUNTRIES, OUR INNOVATIVE TECHNOLOGIES AND SERVICES ARE TAKING ENERGY FORWARD – MAKING IT SAFER, CLEANER AND MORE EFFICIENT FOR PEOPLE AND THE PLANET.\n\nJOIN US:\n\nARE YOU SEEKING AN OPPORTUNITY TO MAKE A REAL DIFFERENCE IN A COMPANY THAT VALUES INNOVATION AND PROGRESS? JOIN US AND BECOME PART OF A TEAM OF PEOPLE WHO WILL CHALLENGE AND INSPIRE YOU! LET’S COME TOGETHER AND TAKE ENERGY FORWARD.\n\nBAKER HUGHES COMPANY IS AN EQUAL OPPORTUNITY EMPLOYER. EMPLOYMENT DECISIONS ARE MADE WITHOUT REGARD TO RACE, COLOR, RELIGION, NATIONAL OR ETHNIC ORIGIN, SEX, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, AGE, DISABILITY, PROTECTED VETERAN STATUS OR OTHER CHARACTERISTICS PROTECTED BY LAW.\n\nR114493",
    "job_skill_set": [
      "financial analysis",
      "accounting",
      "Microsoft Excel",
      "data analysis",
      "financial reporting",
      "project management",
      "account reconciliation",
      "communication",
      "organization",
      "time management",
      "flexibility",
      "team collaboration",
      "influencing",
      "KPI tracking",
      "cash flow management"
    ],
    "short_keywords": [
      "account",
      "accounting",
      "analysis",
      "analyst",
      "cash",
      "collaboration",
      "communication",
      "data",
      "excel",
      "finance",
      "financial",
      "flexibility",
      "flow",
      "influencing",
      "kpi",
      "lufkin",
      "management",
      "microsoft",
      "organization",
      "project",
      "reconciliation",
      "reporting",
      "team",
      "time",
      "tracking"
    ]
  },
  {
    "job_id": "3901392621",
    "job_title": "Vice President Finance",
    "category": "FINANCE",
    "job_description": "OVERSEE PERFORMANCE ANALYSIS AND REPORTING FOR A DIVERSE REAL ESTATE INVESTMENT PORTFOLIO, ENCOMPASSING LAND ENTITLEMENT AND CONSTRUCTION PROJECTS SUCH AS INDUSTRIAL, BUILD-FOR-RENT, MULTI-FAMILY, AND VACANT LAND.PROVIDE ACCURATE FINANCIAL ANALYSIS, CASH FLOW PROJECTIONS, AND INVESTOR REPORTING.LEAD AND GUIDE A TEAM OF ANALYSTS, FOSTERING COLLABORATION AND ACHIEVEMENT WITHIN THE GROUP.WORK CLOSELY WITH CROSS-FUNCTIONAL TEAMS INCLUDING ACCOUNTING, REAL ESTATE, AND INVESTOR RELATIONS TO ENSURE COHESIVE PORTFOLIO MANAGEMENT STRATEGIES.COLLABORATE WITH SENIOR MANAGEMENT TO OFFER INSIGHTFUL SUGGESTIONS ON INVESTMENT SOURCING AND COST EFFECTIVENESS, GUIDING STRATEGIC BUSINESS DECISIONS.DELIVER TRANSPARENT UPDATES ON PORTFOLIO PERFORMANCE AND STRATEGIC INITIATIVES, INCLUDING EXTERNAL COMMUNICATIONS FOR INVESTORS AND JOINT VENTURE PARTNERS.DEVELOP EXECUTIVE-LEVEL DASHBOARDS TO MONITOR ASSET AND FUND PERFORMANCE.MANAGE ASSET AND FUND VALUATION PROCESSES IN COORDINATION WITH ANNUAL AUDITS.SUPPORT MONTHLY REPORTING ACTIVITIES INCLUDING KEY FINANCIAL AND OPERATING METRIC ANALYSIS, VARIANCE REPORTING, CASH FORECASTING, AND CAPITAL MANAGEMENT.IMPLEMENT BEST PRACTICES AND ASSIST IN DEVELOPING NEW POLICIES/PROCEDURES TO STREAMLINE WORKFLOW ACROSS DEPARTMENTS.SUPPORT DUE DILIGENCE, FINANCING, AND REFINANCING EFFORTS ACROSS THE FIRM'S PORTFOLIO.UNDERTAKE AD-HOC FINANCIAL ANALYSIS AND SPECIAL PROJECTS AS NEEDED.",
    "job_skill_set": [
      "financial analysis",
      "asset valuation",
      "financial reporting",
      "variance reporting",
      "leadership",
      "collaboration",
      "communication",
      "strategic thinking",
      "team management",
      "problem solving",
      "adaptability",
      "analytical thinking",
      "cash flow projections",
      "portfolio management",
      "investment sourcing",
      "capital management",
      "dashboard development",
      "due diligence",
      "real estate investment",
      "construction project management"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "analytical",
      "asset",
      "capital",
      "cash",
      "collaboration",
      "communication",
      "construction",
      "dashboard",
      "development",
      "diligence",
      "due",
      "estate",
      "finance",
      "financial",
      "flow",
      "investment",
      "leadership",
      "management",
      "portfolio",
      "president",
      "problem",
      "project",
      "projections",
      "real",
      "reporting",
      "solving",
      "sourcing",
      "strategic",
      "team",
      "thinking",
      "valuation",
      "variance",
      "vice"
    ]
  },
  {
    "job_id": "3906092428",
    "job_title": "Auditor (Accounting/Finance) ",
    "category": "FINANCE",
    "job_description": "ABOUT PHILADELPHIA WORKS, INC.PHILADELPHIA WORKS (PHILAWORKS) IS A 501C3 NON-PROFIT ORGANIZATION THAT INVESTS IN SOLUTIONS AND SERVICES TO GROW PHILADELPHIA’S ECONOMY BY CONNECTING EMPLOYERS TO WORKFORCE TALENT AND CAREER SEEKERS TO JOBS. WE INFLUENCE THE PUBLIC POLICIES THAT SUPPORT ECONOMIC GROWTH AND OPTIMIZE FUNDING AND RESOURCES TO INVEST IN REGIONAL SOLUTIONS TO BUILD A SKILLED AND THRIVING WORKFORCE.\nPHILADELPHIA WORKS HAS A HYBRID SCHEDULE; STAFF WORK 2 – 3 DAYS IN THE OFFICE\nSUMMARYTHIS POSITION IS RESPONSIBLE FOR REVIEWING AND EVALUATING THE GRANTEE’S SYSTEM OF INTERNAL ACCOUNTING CONTROLS AND ACCOUNTING SYSTEM RELATIVE TO THE ADMINISTRATION OF GRANT FUNDS. RESPONSIBILITIES INCLUDE MAKING RECOMMENDATIONS FOR THE CORRECTIVE ACTIONS AND/OR IMPROVEMENT OF INTERNAL CONTROLS, THE ACCOUNTING SYSTEM AND APPLICATION OF GRANT AND CONTRACT FUNDS. THIS POSITION IS ALSO RESPONSIBLE FOR PREPARING STATISTICAL AND NARRATIVE REPORTS, ANALYZING, AND INTERPRETING CLIENT DATA AS IT RELATES TO PERFORMANCE GOALS. PERFORM ANALYTICAL WORK INVOLVING THE EVALUATION OF BUDGETS TO ENSURE FUNDING IS AVAILABLE TO SUPPORT THE NEEDS OF THE PROGRAM AND THAT EXPENDITURES ARE CONSISTENT AND IN COMPLIANCE WITH POLICIES OF THE DEPARTMENT OF HUMAN SERVICES (DHS), THE WORKFORCE INNOVATION & OPPORTUNITY ACT (WIOA) AND PHILADELPHIA WORKS. ENSURE ALL CONTRACT REQUIREMENTS ARE ADHERED TO AND QUALITY STANDARDS ARE MET PARTICULARLY CONTRACTOR EMPLOYMENT PERFORMANCE BENCHMARKS.\nESSENTIAL FUNCTIONS1. REVIEW VENDOR’S ACCOUNTING FOR COMPLIANCE WITH GAAP AND RELEVANT OMB CIRCULARS AND CONTRACT COVENANTS.2. AUDIT DOCUMENTS IN SUPPORT OF THE GRANT ACCOUNTING.3. REVIEW PERTINENT DOCUMENTS NECESSARY TO DETERMINE IF AN AUDIT TRAIL EXISTS FOR ALL RECORDS AND TRANSACTIONS.4. PREPARE WORKING PAPERS THAT RECORD AND SUMMARIZE FINDINGS FROM EACH SUBCONTRACTOR AUDIT: INCLUDE SCOPE OF AUDIT, FINANCIAL CONDITIONS AND APPLICATION OF FUNDS.5. DISCUSS AND EXPLAIN DEFICIENCIES TO APPROPRIATE GRANTEE MANAGEMENT AND PHILADELPHIA WORKS.6. PREPARE DETAILED REPORT OF AUDIT FINDINGS AND MAKE RECOMMENDATIONS FOR CORRECTIONS OF UNSATISFACTORY AREAS AND IMPROVEMENT IN OPERATIONS.7. WORK INDEPENDENTLY WITH CONTRACTORS.8. EVALUATE CONTRACTOR EXPENDITURE AND ACCRUALS AND MAKE RECOMMENDATIONS FOR ADJUSTMENTS.9. ANALYZE, REVIEW AND MAKE RECOMMENDATIONS ON BUDGET PROPOSALS SUBMITTED BY SUBCONTRACTORS.10. PERFORM STATISTICAL ANALYSIS OF SPENDING PATTERNS AMONG GRANTS, PROGRAMS AND/OR CONTRACTORS.11. PREPARE MONTHLY AND QUARTERLY (AS NEEDED) REPORTING PACKAGES AND RELATED BUDGET DATA FOR INTERNAL AND EXTERNAL CUSTOMERS.12. PREPARE DETAILED AD HOC REPORTS FOR MANAGEMENT AND EXTERNAL AGENCIES.13. PREPARE, REVIEW AND MONITOR BUDGETS AND CONTRACTS FOR ACCURACY AND ADHERENCE TO FEDERAL AND STATE REGULATIONS, PHILADELPHIA WORKS POLICIES AND PROCEDURES.14. RESEARCH, ANALYZE, AND RESOLVE CONTRACTING/INVOICING ISSUES IN COORDINATION WITH SUBCONTRACTORS AND INTERNAL DEPARTMENTS SUCH AS THE GRANT ISSUING DEPARTMENT, FINANCE, AND BUSINESS ENGAGEMENT.15. PREPARE MONTHLY STATUS/ACTIVITY REPORTS, AS WELL AS PROVIDE STATISTICAL/FISCAL DATA AS REQUIRED.16. PROVIDE TECHNICAL ASSISTANCE TO VENDORS REGARDING ALL APPLICABLE REGULATIONS.17. PERFORM OTHER JOB-RELATED DUTIES AS ASSIGNED.REQUIREMENTSEDUCATION/PROFESSIONAL EXPERIENCEBACHELOR’S DEGREE IN ACCOUNTING, BUSINESS ADMINISTRATION OR OTHER RELATED FIELD WITH A MINIMUM OF 2-3 YEARS OF ACCOUNTING EXPERIENCE AND AT LEAST 2 YEARS’ EXPERIENCE IN EXTERNAL AUDITING OF GENERAL LEDGER SYSTEMS (INTERNAL AUDITING MAY BE ACCEPTABLE). OR, ANY COMBINATION OF EDUCATION AND EXPERIENCE DETERMINED TO BE ACCEPTABLE.\nSKILLS & QUALIFICATIONS• PROFICIENT WITH MICROSOFT PRODUCTS AND OTHER COMPUTERIZED ACCOUNTING SYSTEMS• EXPERT SKILLS IN EXCEL• WORKING KNOWLEDGE OF ALLOWABLE COST ALLOCATION METHODS• EXCELLENT COMMUNICATION, ORGANIZATIONAL AND INTERPERSONAL SKILLS• FAMILIARITY WITH NON-PROFIT ORGANIZATIONS AND GRANT ACCOUNTING• WORKING KNOWLEDGE OF OMB CIRCULARS 2 CFR 200• ABILITY TO PERFORM COMPLEX AND DETAILED ANALYSIS OF FINANCIAL DATA• ABILITY TO MEET DEADLINES• MUST HAVE VALID DRIVER’S LICENSE AND ABILITY TO TRAVEL THROUGHOUT THE CITY AND SURROUNDING AREA• ABILITY TO INTERACT EFFECTIVELY WITH VARIOUS LEVELS OF STAFF, MANAGEMENT, GOVERNMENT OFFICIALS, AND THE PUBLIC\n WHAT WE OFFERPHILADELPHIA WORKS OFFERS QUALIFYING FULL-TIME EMPLOYEES WITH A COMPETITIVE BENEFITS PROGRAM INCLUDING MEDICAL, DENTAL, VISION, 401(K), TUITION ASSISTANCE, LIFE INSURANCE, AND DISABILITY. WE ALSO OFFER COMPANY-PAID VACATION, PERSONAL AND SICK LEAVE DAYS.\nEQUAL OPPORTUNITY EMPLOYERPHILADELPHIA WORKS IS AN EQUAL OPPORTUNITY EMPLOYER AND COMPLIES WITH ALL LAWS PROHIBITING DISCRIMINATION BASED ON RACE, COLOR, NATIONAL ORIGIN, ANCESTRY, RELIGION, SEX (INCLUDING SEXUAL ORIENTATION, TRANSGENDER STATUS, AND GENDER IDENTITY OR EXPRESSION), PREGNANCY (INCLUDING CHILDBIRTH, LACTATION, AND RELATED MEDICAL CONDITIONS), PHYSICAL OR MENTAL DISABILITY, GENETIC INFORMATION (INCLUDING TESTING AND CHARACTERISTICS), VETERAN STATUS, SEXUAL PREFERENCE, POLITICAL AFFILIATION, OR ANY OTHER BASIS PROTECTED BY FEDERAL, STATE OR LOCAL LAWS, IN ALL MATTERS PERTAINING TO RECRUITMENT, SELECTION, COMPENSATION, TRAINING, ADVANCEMENT AND PROMOTION, RETENTION, DISCIPLINE, AND TERMINATION.",
    "job_skill_set": [
      "Accounting systems",
      "Excel",
      "Microsoft products",
      "Communication",
      "Organizational skills",
      "Interpersonal skills",
      "Analytical thinking",
      "Time management",
      "Problem solving",
      "Attention to detail",
      "Collaboration",
      "GAAP compliance",
      "External auditing",
      "Budget analysis",
      "Statistical analysis",
      "Cost allocation methods",
      "Grant accounting",
      "OMB Circulars 2 CFR 200",
      "Independence"
    ],
    "short_keywords": [
      "2",
      "200",
      "accounting",
      "accountingfinance",
      "allocation",
      "analysis",
      "analytical",
      "attention",
      "auditing",
      "auditor",
      "budget",
      "cfr",
      "circulars",
      "collaboration",
      "communication",
      "compliance",
      "cost",
      "detail",
      "excel",
      "external",
      "finance",
      "gaap",
      "grant",
      "independence",
      "interpersonal",
      "management",
      "methods",
      "microsoft",
      "omb",
      "organizational",
      "problem",
      "products",
      "skills",
      "solving",
      "statistical",
      "systems",
      "thinking",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3887712011",
    "job_title": "Renewable IPP - Project Finance and M&A Associate",
    "category": "FINANCE",
    "job_description": "MADISON HUNT HAS PARTNERED WITH A LEADING RENEWABLE ENERGY DEVELOPER ON THE SEARCH OF AN ASSOCIATE TO JOIN THEIR FINANCE TEAM IN NEW YORK CITY. ASSOCIATES WILL WORK ON A VARIETY OF TRANSACTIONS INCLUDING ASSET ACQUISITIONS AND DIVESTITURES, DEBT FINANCINGS, AND TAX EQUITY CAPITAL RAISES ACROSS SOLAR, WIND, AND BATTERY STORAGE. \nCANDIDATES SHOULD HAVE 3-4 YEARS OF EXPERIENCE IN INVESTMENT BANKING (POWER & RENEWABLES EXPERIENCE PREFERRED), PROJECT FINANCE BANKING, OR AT ANOTHER DEVELOPMENT SHOP.",
    "job_skill_set": [
      "teamwork",
      "communication",
      "analytical thinking",
      "problem solving",
      "attention to detail",
      "project finance",
      "M&A",
      "investment banking",
      "debt financing",
      "tax equity capital raises",
      "asset acquisitions",
      "divestitures",
      "solar energy",
      "wind energy",
      "battery storage"
    ],
    "short_keywords": [
      "acquisitions",
      "analytical",
      "and",
      "asset",
      "associate",
      "attention",
      "banking",
      "battery",
      "capital",
      "communication",
      "debt",
      "detail",
      "divestitures",
      "energy",
      "equity",
      "finance",
      "financing",
      "investment",
      "ipp",
      "ma",
      "problem",
      "project",
      "raises",
      "renewable",
      "solar",
      "solving",
      "storage",
      "tax",
      "teamwork",
      "thinking",
      "to",
      "wind"
    ]
  },
  {
    "job_id": "3901363760",
    "job_title": "Finance Specialist - Channel & Customer Marketing",
    "category": "FINANCE",
    "job_description": "WANT TO BE A CROWD-STOPPER RATHER THAN A CROWD-PLEASER? BECOME A CAMPARISTA\n\nAT THIS POINT, YOU MAY NOT KNOW EXACTLY WHAT IT TAKES TO BE A CAMPARISTA , BUT YOU HAVE THE MAKINGS TO BE ONE OF US. WE’RE THE INDEPENDENT MINDED AND PASSIONATE ACHIEVERS IN THE SPIRITS INDUSTRY, INNOVATING THE ICONIC.\n\nBE PART OF OUR SIGNATURE MIX\n\nGENERAL DESCRIPTION\n\nTHE CHANNEL & CUSTOMER MARKETING FINANCE SPECIALIST WILL SUPPORT THE CHANNEL & CUSTOMER MARKETING COMMERCIAL INVESTMENTS & ANALYTICS SENIOR MANAGER IN THE APPLICATION AND MANAGEMENT OF ALL CHANNEL AND CUSTOMER MARKETING PURCHASING ORDERS AND RETAIL PROGRAMMING APPLICATIONS.\n\nKEY RESPONSIBILITIES AND ACTIVITIES\n\n SERVE AS THE PRIMARY PROCESS OWNER FOR ALL CCM PURCHASE ORDERS AND INVOICING, INCLUDING MANAGEMENT OF WORKFLOW AND PARTNERSHIP WITH BUDGET OWNERS TO PROVIDE STATUS UPDATES. WORK CLOSELY WITH KEY VENDORS TO ENSURE ACCURACY AND TIMELY PROCESSING OF INVOICES IN COMPLIANCE WITH INTERNAL STANDARDS AND VENDOR AGREEMENTS. PERFORM ACCOUNTING RELATED TASKS SUCH AS RECONCILIATIONS AND MONTH END CLOSE ACTIVITIES AS IT RELATES TO BRAND MARKETING. TROUBLESHOOT PURCHASE ORDERS AND INVOICE PROCESSING ERRORS USING SAP, COUPA, AND EXCEL. PROVIDE ACCURATE, TIMELY, AND RELEVANT REPORTING AND ANALYSIS OF FINANCIAL INFORMATION. MANAGE A CENTRAL DATABASE OF KEY VENDOR AGREEMENTS SUCH AS SCOPES OF WORK AND SCHEDULES. ONBOARD NEW VENDORS AND MANAGE NEW VENDOR CREATION PAPERWORK. IDENTIFY AND IMPLEMENT IMPROVEMENTS TO PURCHASE ORDER AND INVOICE MANAGEMENT PROCESSES IN PARTNERSHIP WITH FINANCE, ACCOUNTING, AND THIRD-PARTY BPOS. MANAGE SPECIAL PROJECTS/AD-HOC REQUESTS AS NEEDED.\n\nKEY RELATIONSHIPS\n\nINTERNAL: CHANNEL & CUSTOMER MARKETING, SALES, ACCOUNTING, FINANCE\n\nEXTERNAL: CHANNEL & CUSTOMER MARKETING AGENCIES\n\nEXPERIENCE REQUIRED\n\n A MINIMUM OF 1-2 YEARS’ EXPERIENCE WITH PROCESSING INVOICES OR SIMILAR ACTIVITY.\n\nEDUCATION / PROFESSIONAL QUALIFICATIONS\n\n BACHELOR'S DEGREE\n\nSKILLS\n\nFUNCTIONAL\n\n STRONG ORGANIZATIONAL SKILLS; ABILITY TO WORK UNDER PRESSURE; ABILITY TO PRIORITIZE MULTIPLE TASKS AND MEET ALL DEADLINES. EXCELLENT PROBLEM SOLVING/JUDGMENT SKILLS; HIGH LEVEL OF ATTENTION TO DETAIL AND ACCURACY. EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS. TEAM PLAYER.\n\nTECHNICAL\n\n EXCELLENT EXCEL SKILLS. PREFERRED ACCOUNTING SYSTEM KNOWLEDGE (SAP).\n\nOTHER\n\n MUST HAVE A CAN DO POSITIVE ATTITUDE. MUST BE A SELF STARTER.\n\nTHE EXPECTED BASE SALARY FOR THIS POSITION RANGES FROM $75,000 - $90,000. SALARY OFFERS ARE BASED ON A WIDE RANGE OF FACTORS AND CONSIDERATIONS. IN ADDITION TO BASE SALARY AND A GENEROUS EMPLOYEE BENEFITS PACKAGE, EMPLOYEES ARE ELIGIBLE TO RECEIVE A DISCRETIONARY BONUS.\n\nOUR COMMITMENT TO DIVERSITY & INCLUSION:\n\nAT CAMPARI GROUP WE BELIEVE IN BUILDING MORE VALUE TOGETHER, THUS WE SEE DIVERSITY IN ALL FORMS AS A SOURCE OF ENRICHMENT. OUR EMPLOYMENT POLICIES AND PRACTICES ENSURE THAT WE ARE COMMITTED TO PROVIDING EQUAL EMPLOYMENT OPPORTUNITIES IN ALL ASPECTS OF EMPLOYMENT WITHOUT REGARD TO ANY INDIVIDUAL’S RACE, RELIGION, CREED, COLOR, NATIONAL ORIGIN, ANCESTRY, PHYSICAL DISABILITY, MENTAL DISABILITY, MEDICAL CONDITION, GENETIC INFORMATION, MARITAL STATUS, SEX, SEXUAL ORIENTATION, GENDER IDENTITY OR CHARACTERISTICS OR EXPRESSION, POLITICAL AFFILIATION OR ACTIVITY, AGE, VETERAN STATUS, CITIZENSHIP, OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW.\n\nNOTE TO APPLICANTS:\n\nYOUR APPLICATION WILL BE ASSESSED BASED ON YOUR ABILITIES, EXPERTISE, GENERAL KNOWLEDGE AND EXPERIENCE, NOT BECAUSE OF ANY CONFIDENTIAL, PROPRIETARY OR TRADE SECRET INFORMATION YOU MAY POSSESS. YOU MUST NOT DISCLOSE TO CAMPARI GROUP ANY SUCH INFORMATION. IN THE EVENT THAT YOU ARE ASKED A QUESTION THAT CANNOT BE ANSWERED WITHOUT DISCLOSURE OF ANY CONFIDENTIAL, PROPRIETARY OR TRADE SECRET INFORMATION (INCLUDING FROM A CURRENT OR PRIOR EMPLOYER OR THEIR VENDORS OR CUSTOMERS), YOU MUST DECLINE TO ANSWER THE QUESTION.\n\nNOTICE TO THIRD PARTY AGENCIES:\n\nPLEASE REFRAIN FROM COLD-CALLING OR EMAILING OUR EXECUTIVE LEADERSHIP TEAM OR THE HR COMMUNITY DIRECTLY. THE TALENT ACQUISITION DEPARTMENT MANAGES CENTRALIZED RECRUITING OPERATIONS GLOBALLY, INCLUDING THE SELECTION AND MANAGEMENT OF EXTERNAL SUPPLIERS. CURRENTLY, OUR PREFERRED SUPPLIER LIST IS AT FULL CAPACITY. TO ENSURE WE HAVE YOUR INFORMATION ON FILE FOR FUTURE CONSIDERATION, WE KINDLY REQUEST THAT YOU COMPLETE THE ONLINE FORM PROVIDED HERE.",
    "job_skill_set": [
      "SAP",
      "Accounting",
      "Invoicing",
      "Data Analysis",
      "Organizational Skills",
      "Problem Solving",
      "Attention to Detail",
      "Communication",
      "Teamwork",
      "Self-Starter",
      "Ability to Work Under Pressure",
      "Time Management",
      "Excel"
    ],
    "short_keywords": [
      "ability",
      "accounting",
      "analysis",
      "attention",
      "channel",
      "communication",
      "customer",
      "data",
      "detail",
      "excel",
      "finance",
      "invoicing",
      "management",
      "marketing",
      "organizational",
      "pressure",
      "problem",
      "sap",
      "selfstarter",
      "skills",
      "solving",
      "specialist",
      "teamwork",
      "time",
      "to",
      "under",
      "work"
    ]
  },
  {
    "job_id": "3905243380",
    "job_title": "Finance Project Manager",
    "category": "FINANCE",
    "job_description": "MPIRE TECHNOLOGY GROUP, INC. IS SEEKING A PROJECT MANAGER FOR OUR CLIENT IN WASHINGTON, DC. CANDIDATE WILL SUPPORT THE OFFICE OF GRANTS MANAGEMENT IN SELECT PHASES OF THE GRANT’S MANAGEMENT PROCESS INCLUDING, BUT NOT LIMITED TO EVALUATING ON-GOING PERFORMANCE AND FINANCIAL STATUS REPORTS, FINAL REPORTS, SHELL AWARD CREATIONS, OUTSTANDING PAYMENT PROCESSING, AND ASSISTING WITH GRANT CLOSE-OUTS.\nRESPONSIBILITIES WILL INCLUDE:THE PM PROVIDES DIRECT MANAGEMENT GUIDANCE OF CONTRACT PERSONNEL TO ENSURE THAT GOALS AND OBJECTIVES OF THE PROJECT, AS WELL AS PROBLEM RESOLUTION, ARE ACCOMPLISHED WITHIN PRESCRIBED TIME FRAMES AND FUNDING PARAMETERSOVERSEE THE EFFORTS OF DIRECT REPORTING RESOURCES AND BE RESPONSIBLE FOR THE EFFORTS OF ALL STAFF ASSIGNED TO A SPECIFIC JOB.SUPPORT THE ADMINISTRATION OF GRANTS MONITORING TASKS BY RECEIVING AND REVIEWING GRANT AWARD, FINANCIAL AND RELATED DOCUMENTS.SUPPORT ADMINISTRATIVE CLOSEOUT OF EXPIRED GRANT; CLOSES OUT AWARDS AND PREPARES FILES FOR ARCHIVING.ENSURES ALL FINAL FINANCIAL REPORTS AND TECHNICAL REPORTS HAVE BEEN RECEIVED AND APPROVED BY THE AGENCY.LEAD/ASSIST IN COLLECTING AND EVALUATING REQUIRED DUE DILIGENCE FOR TRANSACTIONS TO INCLUDE MAKING NECESSARY INQUIRIES TO CLIENTS TO ENSURE THAT REQUIRED INFORMATION IS PROVIDED IN A TIMELY MANNER.LEAD REVIEW ALL DOCUMENTS PREPARED FOR THE SIGNATURE THAT REQUIRE COORDINATION BY THE DIVISION DIRECTOR FOR GRAMMAR, AND FORMAT.ENSURES LOG OF POST AWARD ACTIONS IN AND OUT OF THE ELECTRONIC TRACKING SYSTEM ENSURING THAT ACCURATE DATA ARE ENTERED INTO THE AGENCY DATABASE TO CAPTURE FINANCIAL INFORMATION REGARDING ASSISTANCE AWARDS.\nREQUIREMENTS:6+ YEARS EXPERIENCE IN PROJECT MANAGEMENTCERTIFIED PROJECT MANAGEMENT PROFESSIONAL (PMP) CERTIFICATION PREFERRED.PROFICIENT IN SHAREPOINT AND MICROSOFT EXCEL.EXPERIENCE REVIEWING FEDERAL REGULATIONS.EXCELLENT WRITTEN AND COMMUNICATION SKILLS.ABILITY TO OBTAIN AND MAINTAIN A PUBLIC TRUST CLEARANCE.\nNICE TO HAVE:EXPERIENCE WITH GRANTS MANAGEMENTEXPERIENCE IN ACCOUNTING AND/OR CONCEPTSKNOWLEDGE AND UNDERSTANDING OF FINANCIAL STATEMENTS, ACCOUNTING CONCEPTS, FINANCIAL MODELING, AND APPLICATION OF FINANCIAL CONCEPTS.EXPERIENCE: SENIOR LEVEL (6+ YEARS)\nEDUCATION: BA/BS IN ACCOUNTING, FINANCE, BUSINESS ADMINISTRATION, OR RELATED FIELD.\nABOUT US:MPIRE TECHNOLOGY GROUP INC. (MTG) IS SMALL BUSINESS THAT WAS FOUNDED IN VIRGINIA. THE COMPANY OFFERS INFORMATION TECHNOLOGY SERVICES CONSULTING AND SYSTEMS INTEGRATION. OUR CORE OFFERINGS INCLUDE: SOFTWARE DEVELOPMENT, IT/ENGINEERING SUPPORT AND CYBER SECURITY. MPIRE TECHNOLOGY GROUP’S TECHNICAL STAFF HAS EXTENSIVE EXPERIENCE MANAGING AND EXECUTING THE FULL LIFE CYCLE OF IT INFRASTRUCTURE AND DEVELOPMENT PROJECTS. OUR TEAMS WORK ALONGSIDE THEIR CLIENTS HELPING THEM TO ACHIEVE THEIR SPECIFIC OBJECTIVES. OUR CLIENTS CONTINUE TO USE OUR SERVICES BECAUSE OF OUR HIGH QUALITY OF WORK AND OUR COMPANY VALUES.OUR BENEFITS:HEALTH INSURANCEDENTAL INSURANCEVISION INSURANCERETIREMENT PLANPAID TIME OFFPROFESSIONAL DEVELOPMENT ASSISTANCEMPIRE TECHNOLOGY GROUP IS AN EQUAL OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, PREGNANCY, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, AGE, PROTECTED VETERAN STATUS, OR DISABILITY STATUS.WE ARE NOT CURRENTLY WORKING WITH 3RD PARTIES.WE ARE NOT CURRENTLY PROVIDING SPONSORSHIP.\nBENEFITS:401(K)DENTAL INSURANCEEMPLOYEE ASSISTANCE PROGRAMHEALTH INSURANCEPAID TIME OFFPROFESSIONAL DEVELOPMENT ASSISTANCEVISION INSURANCESCHEDULE:MONDAY TO FRIDAYEDUCATION:BACHELOR'S (PREFERRED)EXPERIENCE:PROJECT MANAGEMENT: 1 YEAR (PREFERRED)FINANCIAL REPOTS: 1 YEAR (PREFERRED)MICROSOFT EXCEL: 1 YEAR (PREFERRED)MICROSOFT POWERPOINT: 1 YEAR (PREFERRED)GRANTS MANAGEMENT: 1 YEAR (PREFERRED)ACCOUNTING: 1 YEAR (PREFERRED)LICENSE/CERTIFICATION:PMP (PREFERRED)\n",
    "job_skill_set": [
      "Microsoft Excel",
      "Financial Reporting",
      "Accounting Concepts",
      "Financial Modeling",
      "Communication",
      "Problem Solving",
      "Team Leadership",
      "Attention to Detail",
      "Time Management",
      "Analytical Skills",
      "Collaboration",
      "Organizational Skills",
      "Project Management",
      "PMP Certification",
      "SharePoint",
      "Grants Management",
      "Federal Regulations",
      "Technical Reporting"
    ],
    "short_keywords": [
      "accounting",
      "analytical",
      "attention",
      "certification",
      "collaboration",
      "communication",
      "concepts",
      "detail",
      "excel",
      "federal",
      "finance",
      "financial",
      "grants",
      "leadership",
      "management",
      "manager",
      "microsoft",
      "modeling",
      "organizational",
      "pmp",
      "problem",
      "project",
      "regulations",
      "reporting",
      "sharepoint",
      "skills",
      "solving",
      "team",
      "technical",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3905669245",
    "job_title": "Analyst/Sr Analyst, Division Finance",
    "category": "FINANCE",
    "job_description": "LOCATION: DFW HEADQUARTERS BUILDING 8 (DFW-SV08)\n\nADDITIONAL LOCATIONS: NONE\n\nREQUISITION ID: 72705\n\nINTRO\n\nARE YOU READY TO EXPLORE A WORLD OF POSSIBILITIES, BOTH AT WORK AND DURING YOUR TIME OFF? JOIN OUR AMERICAN AIRLINES FAMILY, AND YOU’LL TRAVEL THE WORLD, GROW YOUR EXPERTISE AND BECOME THE BEST VERSION OF YOU. AS YOU EMBARK ON A NEW JOURNEY, YOU’LL TACKLE CHALLENGES WITH FLEXIBILITY AND GRACE, LEARNING NEW SKILLS AND ADVANCING YOUR CAREER WHILE HAVING THE TIME OF YOUR LIFE. FEEL FREE TO ENRICH BOTH YOUR PERSONAL AND WORK LIFE AND HOP ON BOARD!\n\nWHY YOU'LL LOVE THIS JOB\n\nSUPPORTS ALL OF DIVISION FINANCE IN TRAINING AND PROCESS IMPROVEMENT INITIATIVESKEEPS A PULSE ON THE LATEST TECHNOLOGY AND SEEKS PRACTICAL APPLICATIONS TO DRIVE AUTOMATION AND/OR ENHANCE ANALYTICS CAPABILITIESTHIS JOB WILL ALSO HELP DRIVE SPECIAL PROJECTS WHICH CAN ASSIST LEADERS IN THE ORGANIZATIONS TO MAKE KEY DECISIONS \n\nWHAT YOU'LL DO\n\nDEVELOPS AND MAINTAINS A TRAINING AND DEVELOPMENT PROGRAM FOR FINANCE ANALYSTSCOLLABORATES ACROSS TEAMS TO IDENTIFY, IMPLEMENT, AND TRACK PROCESS IMPROVEMENT INITIATIVESPARTNERS CROSS-FUNCTIONALLY ACROSS THE COMPANY ON SPECIAL PROJECTSRESEARCHES AND LEARNS HOW TO USE THE LATEST TECHNOLOGY TO DRIVE EFFICIENCIES AND INSIGHTSPARTICIPATES ON PROJECTS THAT HELP DRIVE BUSINESS RECOMMENDATIONS OR DECISIONSEVALUATES COMPETITIVE STRATEGIES AND INDUSTRY TRENDS TO DETERMINE IMPACT ON CURRENT OR CONTEMPLATED ACTION PLANSDEVELOPS REPORTS WHICH CAN LEAD TO INFORMED DECISIONS BY BUSINESS LEADERSCOORDINATES NEAR AND LONG - TERM PLANNING ACTIVITIES TO ENSURE CONSISTENCY AND COMPLIANCE WITH CORPORATE ACTION PLANS\n\nALL YOU'LL NEED FOR SUCCESS\n\nMINIMUM QUALIFICATIONS- EDUCATION & PRIOR JOB EXPERIENCE\n\nBACHELOR’S DEGREE IN RELEVANT FIELD OR EQUIVALENT EXPERIENCE/TRAINING2-3 YEARS OF RELATED WORK EXPERIENCEADVANCED EXCEL MODELING SKILLS\n\nPREFERRED QUALIFICATIONS- EDUCATION & PRIOR JOB EXPERIENCE\n\n MBA PREFERREDEXPERIENCE USING HYPERION AND SAP PREFERRED\n\nSKILLS, LICENSES & CERTIFICATIONS\n\nSUPERIOR ANALYTICAL SKILLS WITH AN UNDERSTANDING OF DISCOUNTED CASH FLOW ANALYSIS, FORECASTING TECHNIQUES AND VARIANCE ANALYSISADAPTABILITY AND FLEXIBILITY IN THE USE OF ANALYTICAL APPROACHES PERTAINING TO FINANCIAL ISSUESCAPACITY TO ASSIMILATE, SYNTHESIZE, AND ANALYZE, LARGE VOLUMES OF DATAEXCELLENT TEAMWORK SKILLS, WITH PROVEN ABILITY TO WORK EFFECTIVELY IN A VARIETY OF SITUATIONSABILITY TO ACCEPT OWNERSHIP, RESPONSIBILITY AND ACCOUNTABILITY OF FUNCTIONAL OBLIGATIONSPROVEN SUCCESS IN A TEAM ENVIRONMENT AND ABILITY TO INFLUENCE CHANGEABILITY TO PRIORITIZE TASKS, WORK WELL WITH LITTLE SUPERVISION, AND MANAGE A NUMBER OF PROJECTS SIMULTANEOUSLYSKILLED IN MICROSOFT OFFICE SOFTWARE (E.G., WORD, EXCEL, ACCESS, POWERPOINT)ABILITY TO CREATE AND DELIVER POWERPOINT PRESENTATIONS TO ALL LEVELS WITHIN THE ORGANIZATION INCLUDING VICE PRESIDENT AND ABOVE \n\nWHAT YOU'LL GET\n\nFEEL FREE TO TAKE ADVANTAGE OF ALL THAT AMERICAN AIRLINES HAS TO OFFER:\n\nTRAVEL PERKS: READY TO EXPLORE THE WORLD? YOU, YOUR FAMILY AND YOUR FRIENDS CAN REACH 365 DESTINATIONS ON MORE THAN 6,800 DAILY FLIGHTS ACROSS OUR GLOBAL NETWORK.HEALTH BENEFITS: ON DAY ONE, YOU’LL HAVE ACCESS TO YOUR HEALTH, DENTAL, PRESCRIPTION AND VISION BENEFITS TO HELP YOU STAY WELL. AND THAT’S JUST THE START, WE ALSO OFFER VIRTUAL DOCTOR VISITS, FLEXIBLE SPENDING ACCOUNTS AND MORE. WELLNESS PROGRAMS: WE WANT YOU TO BE THE BEST VERSION OF YOURSELF – THAT’S WHY OUR WELLNESS PROGRAMS PROVIDE YOU WITH ALL THE RIGHT TOOLS, RESOURCES AND SUPPORT YOU NEED.401(K) PROGRAM: AVAILABLE UPON HIRE AND, DEPENDING ON THE WORKGROUP, EMPLOYER CONTRIBUTIONS TO YOUR 401(K) PROGRAM ARE AVAILABLE AFTER ONE YEAR.ADDITIONAL BENEFITS: OTHER GREAT BENEFITS INCLUDE OUR EMPLOYEE ASSISTANCE PROGRAM, PET INSURANCE AND DISCOUNTS ON HOTELS, CARS, CRUISES AND MORE\n\nFEEL FREE TO BE YOURSELF AT AMERICAN\n\nFROM THE TEAM MEMBERS WE HIRE TO THE CUSTOMERS WE SERVE, INCLUSION AND DIVERSITY ARE THE FOUNDATION OF THE DYNAMIC WORKFORCE AT AMERICAN AIRLINES. OUR 20+ EMPLOYEE BUSINESS RESOURCE GROUPS ARE FOCUSED ON CONNECTING OUR TEAM MEMBERS TO OUR CUSTOMERS, SUPPLIERS, COMMUNITIES AND SHAREHOLDERS, HELPING TEAM MEMBERS REACH THEIR FULL POTENTIAL AND CREATING AN INCLUSIVE WORK ENVIRONMENT TO MEET AND EXCEED THE NEEDS OF OUR DIVERSE WORLD.\n\nARE YOU READY TO FEEL A TREMENDOUS SENSE OF PRIDE AND SATISFACTION AS YOU DO YOUR PART TO KEEP THE LARGEST AIRLINE IN THE WORLD RUNNING SMOOTHLY AS WE CARE FOR PEOPLE ON LIFE’S JOURNEY? FEEL FREE TO BE YOURSELF AT AMERICAN.\n\nADDITIONAL LOCATIONS: NONE\n\nREQUISITION ID: 72705",
    "job_skill_set": [
      "SAP",
      "forecasting techniques",
      "variance analysis",
      "microsoft office software",
      "data analysis",
      "adaptability",
      "teamwork",
      "ownership",
      "influence change",
      "prioritization",
      "communication",
      "project management",
      "advanced excel modeling",
      "hyperion",
      "discounted cash flow analysis"
    ],
    "short_keywords": [
      "adaptability",
      "advanced",
      "analysis",
      "analyst",
      "analystsr",
      "cash",
      "change",
      "communication",
      "data",
      "discounted",
      "division",
      "excel",
      "finance",
      "flow",
      "forecasting",
      "hyperion",
      "influence",
      "management",
      "microsoft",
      "modeling",
      "office",
      "ownership",
      "prioritization",
      "project",
      "sap",
      "software",
      "teamwork",
      "techniques",
      "variance"
    ]
  },
  {
    "job_id": "3902864872",
    "job_title": "Director & Head of Finance",
    "category": "FINANCE",
    "job_description": "ROLE: THE DIRECTOR & HEAD OF FINANCE IS RESPONSIBLE FOR ACCOUNTING AND FINANCIAL OPERATIONS IN A DYNAMIC AND GROWING STARTUP BUSINESS. THIS ROLE WILL HAVE SIGNIFICANT EXPOSURE AND INFLUENCE ON THE EXECUTIVE TEAM AND EXTERNAL STAKEHOLDERS OF VERYABLE. THERE IS OPPORTUNITY FOR A CAPABLE INDIVIDUAL TO QUICKLY TAKE ON BROADER RESPONSIBILITY WITHIN THE FINANCE & ACCOUNTING FUNCTION AND THROUGHOUT THE ORGANIZATION. LONG TERM POTENTIAL TO GROW INTO FULL CFO ROLE. IDEAL CANDIDATES ARE SELF-MOTIVATED, ASSERTIVE, ENJOY A FAST-PACED ENVIRONMENT. THEY WILL HAVE A DEGREE IN ACCOUNTING, FINANCE OR RELATED FIELDS AND LIKELY BRING A FEW YEARS OF PROGRESSIVE WORK EXPERIENCE BOTH IN ACCOUNTING FIELD (SOLIDIFYING ACCOUNTING PROCESSES), AS WELL AS IN INDUSTRY (MANAGING CASH FLOW, AND INFLUENCING LEADERSHIP). THIS IS A FULLY IN-OFFICE ROLE, REPORTING TO CO-FOUNDER AND CEO.\n\nRESPONSIBILITY: \n\nACCOUNTABLE FOR END-TO-END ACCOUNTING, FINANCIAL PLANNING & ANALYSIS, AND TREASURY FUNCTIONS. DEVELOP BOTH STRATEGIC AND TACTICAL FINANCIAL STRATEGIES ACROSS THE BUSINESS. MAINTAIN & DEVELOP RELATIONSHIPS WITH LENDERS, AUDITORS, TAX AUTHORITIES, AND OTHER EXTERNAL STAKEHOLDERS. MENTOR, COACH AND LEAD A SMALL TEAM. \n\n\nEXPERIENCE: \n\nPROGRESSIVE EXPERIENCE IN MULTIPLE FINANCE ROLES (E.G. ACCOUNTING, FP&A, CONTROLLING)EXPERIENCE IN A PUBLIC ACCOUNTING FIRM COMBINED WITH DIVERSE FINANCE ROLES IN INDUSTRY PROVEN SUCCESS MANAGING EXTERNAL PARTNERS E.G. LENDER, AUDIT, ETC. TRACK RECORD OF ACTION THROUGH INFLUENCE AND ENGAGEMENT AMBITIOUS, ASSERTIVE, READY TO EXCEED EXPECTATIONS, TAKE INITIATIVE, AND MORE RESPONSIBILITY IN TIME EXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILL ABILITY TO WORK INDEPENDENTLY AND COLLABORATIVELY IN A FAST-PACED, MATRIXED TEAM ENVIRONMENT CONSISTING OF INTERNAL AND EXTERNAL TEAM MEMBERS BACHELOR’S DEGREE REQUIRED ABILITY TO MANAGE OTHERS, COACH, MENTOR \n\n\nABOUT VERYABLE:\n\nAT VERYABLE, OUR MISSION IS TO ACCELERATE NEXT GENERATION CAPABILITIES IN THE MANUFACTURING AND LOGISTICS SPACE BY ENABLING BUSINESSES TO SCALE PRODUCTION IN REAL-TIME TO CHANGING NEEDS AND CONDITIONS.\n\nTHE JOURNEY TO THE NEXT GENERATION OF MANUFACTURING AND LOGISTICS STARTS WITH ADDRESSING LABOR AS THE FIRST CRITICAL CONSTRAINT IN MEETING PRODUCTION DEMAND. OUR CO-FOUNDERS HAD A VISION OF MAKING THE GIG ECONOMY ACCESSIBLE TO MANUFACTURING AND DISTRIBUTION THROUGH BOTH A MOBILE APP FOR WORKERS AND A SUITE OF BUSINESS TOOLS FOR COMPANIES TO ASSESS THEIR LABOR NEEDS AND ACCESS LABOR WHEN THEY NEED IT. THIS TECHNOLOGICAL INNOVATION HAS ALLOWED BUSINESSES TO ADDRESS THE ROUTINE VARIABILITY OF THEIR PRODUCTION DEMAND WITH LABOR THAT IS AVAILABLE JUST IN TIME.\n\nVERYABLE IS COMMITTED TO CREATING A DIVERSE ENVIRONMENT AND IS PROUD TO BE AN EQUAL OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, GENDER, GENDER IDENTITY OR EXPRESSION, SEXUAL ORIENTATION, NATIONAL ORIGIN, GENETICS, DISABILITY, AGE, OR VETERAN STATUS. VERYABLE ABIDES BY ALL LAWS DEEMED CONSTITUTIONAL AND DOES NOT DISCRIMINATE ON THE BASIS OF VACCINE CHOICES OR VIOLATE YOUR PERSONAL HEALTHCARE PRIVACY.",
    "job_skill_set": [
      "accounting",
      "financial planning & analysis",
      "cash flow management",
      "financial strategies",
      "public accounting experience",
      "mentoring",
      "coaching",
      "relationship management",
      "communication",
      "leadership",
      "initiative",
      "teamwork",
      "self-motivation",
      "independence",
      "collaboration",
      "treasury functions",
      "assertiveness"
    ],
    "short_keywords": [
      "accounting",
      "analysis",
      "assertiveness",
      "cash",
      "coaching",
      "collaboration",
      "communication",
      "director",
      "experience",
      "finance",
      "financial",
      "flow",
      "functions",
      "head",
      "independence",
      "initiative",
      "leadership",
      "management",
      "mentoring",
      "of",
      "planning",
      "public",
      "relationship",
      "selfmotivation",
      "strategies",
      "teamwork",
      "treasury"
    ]
  },
  {
    "job_id": "3884802331",
    "job_title": "Finance Analyst",
    "category": "FINANCE",
    "job_description": "ANALYTICAL MECHANICS ASSOCIATES, INC. (AMA) IS SEEKING AN ORGANIZED AND DETAIL-ORIENTED FINANCE ANALYST WHO RELISHES A DYNAMIC, FAST-PACED ENVIRONMENT TO EXECUTE BUSINESS PROCESSES RELATED TO PLANNING, ESTIMATING, TRACKING, ANALYSIS AND REPORTING ON MULTIPLE PROJECTS OF VARYING CONTRACT TYPE, SIZE, COMPLEXITY, AND LEVEL OF RISK. THIS INDIVIDUAL WILL HAVE A COMPREHENSIVE UNDERSTANDING OF ACCOUNTING PRINCIPLES, FINANCE CONCEPTS, PRACTICES AND STANDARDS AS WELL AS KNOWLEDGE OF GOVERNMENT INDUSTRY PRACTICES. THIS POSITION WILL BE ONSITE IN HAMPTON, VA. THIS POSITION HAS THE OPPORTUNITY TO WORK HYBRID BUT MUST BE AVAILABLE TO SUPPORT ACTIVITY ON SITE AT NASA LANGLEY RESEARCH CENTER AND THE AMA CORPORATE OFFICE IN HAMPTON ON AN AS NEEDED BASIS. \nRESPONSIBILITIES:SIGNIFICANT INTERFACE WITH PROGRAM AND PROJECT MANAGERS, SENIOR TECHNICAL STAFF, AS WELL AS OTHER FUNCTIONAL ORGANIZATIONS INCLUDING CONTRACTS, FINANCE, HUMAN RESOURCES, PAYROLL, ACCOUNTS RECEIVABLE, PROCUREMENT, SUBCONTRACT MANAGEMENT, ETC.ASSIST PROGRAM/PROJECT ANALYST WITH VARIOUS ACCOUNTS PAYABLE TASKS.RECONCILE PROCESSED WORK BY VERIFYING ENTRIES AND COMPARING SYSTEM REPORTS TO BALANCES AND MAINTAINING HISTORICAL RECORDS.RESPONDING TO VENDOR ENQUIRIES. PREPARE ANALYSES OF ACCOUNTS AND PRODUCING MONTHLY REPORTS.SET UP NEW VENDORS/EMPLOYEES IN COSTPOINT AND ASSIST SUB-CONTRACTORS WITH COMPLETION OF TIMESHEETS IN COSTPOINT.INITIATE NEW PROJECT SET-UP PROCESS IN COSTPOINT.COORDINATE APPROPRIATE PROJECT CODES TO INCLUDE START AND TERMINATION DATES FOR EMPLOYEES ASSIGNED TO THE PROJECT.REVIEW NEW TASK ORDERS AND MODIFICATIONS (MODS) FOR ACCURACY AND CONSISTENCY.TRACK ALL COSTS TO VALIDATE THAT ACTUALS PLUS PROJECTED COSTS DO NOT EXCEED BUDGET/FUNDING.ENTER AND TRACK CHANGES OF PURCHASE ORDERS AND RESPECTIVE FUNDING STATUS.MONITOR SUBCONTRACTOR INVOICING AND STATUS AND SUPPORT MONTHLY SUB-CONTRACTOR ACCRUALS.IDENTIFY FINANCIAL DISCREPANCIES AND COORDINATE CORRECTIONS AND ASSIST WITH MONTH END CLOSINGS.ADHOC REPORTING TO SUPPORT EVALUATION AND ANALYSIS OF ANNUAL WORKPLAN.SUPPORT FINANCE MANAGEMENT TEAM IN PREPARATION OF BUDGET FORECASTING.\nREQUIREMENTS:BACHELOR’S DEGREE WITH EMPHASIS IN FINANCE, ACCOUNTING, OR A RELATED DISCIPLINE.MINIMUM OF 3 YEARS OF DIRECT, APPLICABLE WORK-RELATED EXPERIENCE.STRONG KNOWLEDGE OF MICROSOFT OFFICE PROGRAMS.INTERMEDIATE/ADVANCED EXPERIENCE WITH EXCEL INCLUDING PIVOT TABLES AND LOOKUP FORMULAS. PREFERABLY, UNDERSTANDING OF DATA INTEGRATION AND MODELING CONCEPTS. EXPERIENCE WITH DELTEK COSTPOINT IS STRONGLY DESIRED. GENERAL UNDERSTANDING OF MULTIPLE CONTRACT TYPES: FFP, FPLOE, T&M, CPAF, CPFF, AND HYBRID CONTRACTS.ABILITY TO INTEGRATE INTO SMALL TEAMS, WHILE BALANCING REQUIREMENTS ACROSS MANY STAKEHOLDERS.ABILITY TO INTERFACE SUCCESSFULLY WITH CUSTOMERS.EXCELLENT WRITTEN AND ORAL COMMUNICATION SKILLS.ABILITY TO QUICKLY ADAPT TO DYNAMIC WORK REQUIREMENTS AND LEARN NEW DISCIPLINES.KNOWLEDGE OF GOVERNMENT PROJECT MANAGEMENT REQUIREMENTS IS DESIRABLE. \nMUST BE A US CITIZEN OR PERMANENT RESIDENT \nANALYTICAL MECHANICS ASSOCIATES (AMA) IS PROUD OF OUR CUSTOMER RELATIONSHIPS, OUR DIVERSE AND DYNAMIC WORK ENVIRONMENT, AND OUR EMPLOYEES' CAREER SATISFACTION. AMA IS A SMALL BUSINESS WITH A WIDE REACH; HEADQUARTERED IN HAMPTON, VA, AMA HAS OPERATIONS IN GREENBELT, MD; HUNTSVILLE, AL; DALLAS AND HOUSTON, TX; DENVER, CO; MOUNTAIN VIEW, CA; AND EDWARDS AIR FORCE BASE, CA. WITH OVER 60 YEARS OF EXPERIENCE, AMA SPECIALIZES IN AEROSPACE ENGINEERING, SCIENCE, ANALYTICS, INFORMATION TECHNOLOGY, AND VISUALIZATION SOLUTIONS. AMA COMBINES THE BEST OF ENGINEERING, SCIENCE, AND MATHEMATICS CAPABILITIES WITH THE LATEST IN INFORMATION TECHNOLOGIES, VISUALIZATION, AND MULTIMEDIA TO BUILD CREATIVE SOLUTIONS. WE OFFER COMPETITIVE SALARIES AND A SUBSTANTIAL BENEFITS PACKAGE, INCLUDING BUT NOT LIMITED TO PAID PERSONAL AND FEDERALLY RECOGNIZED HOLIDAY LEAVE, SALARY DEFERRALS INTO A 401(K)-MATCHING PLAN WITH IMMEDIATE VESTING, TUITION REIMBURSEMENT, SHORT/LONG TERM DISABILITY PLANS, AND A VARIETY OF MEDICAL, DENTAL, AND VISION INSURANCE OPTIONS. \nAMA IS COMMITTED TO THE PROFESSIONAL GROWTH OF EVERY EMPLOYEE, UNDERSTANDING THAT THE SUCCESSES OF OUR EMPLOYEES DRIVE OUR SUCCESS. WE PROVIDE A WORK ENVIRONMENT THAT IS ENGAGING, COLLABORATIVE, AND SUPPORTIVE. TO LEARN MORE ABOUT OUR COMPANY, PLEASE VISIT OUR WEBSITE AT WWW.AMA-INC.COM AND FOLLOW US ON FACEBOOK AND LINKEDIN. \nAMA IS AN AFFIRMATIVE ACTION/EQUAL OPPORTUNITY EMPLOYER AND DOES NOT DISCRIMINATE AGAINST ANY APPLICANT FOR EMPLOYMENT OR EMPLOYEE BECAUSE OF RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, AGE, DISABILITY, PROTECTED VETERAN STATUS, OR ANY OTHER CHARACTERISTIC PROHIBITED UNDER FEDERAL, STATE, OR LOCAL LAWS",
    "job_skill_set": [
      "finance",
      "accounting",
      "Microsoft Office",
      "Excel",
      "data integration",
      "contract management",
      "budget forecasting",
      "communication",
      "teamwork",
      "adaptability",
      "analytical thinking",
      "problem solving",
      "Deltek Costpoint"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "analyst",
      "analytical",
      "budget",
      "communication",
      "contract",
      "costpoint",
      "data",
      "deltek",
      "excel",
      "finance",
      "forecasting",
      "integration",
      "management",
      "microsoft",
      "office",
      "problem",
      "solving",
      "teamwork",
      "thinking"
    ]
  },
  {
    "job_id": "3895807699",
    "job_title": "Finance Analyst - External Reporting Team",
    "category": "FINANCE",
    "job_description": "CAREERS THAT CHANGE LIVES\n \nTEAM IS WORKING HYBRID AND POSITION WILL BE ONSITE IN FRIDLEY, MN, 3 DAYS/WEEK.\n\nTHIS ROLE SERVES AS A MEMBER OF THE GLOBAL CONTROLLERSHIP TEAM, WHICH IS RESPONSIBLE FOR SYSTEMS, PROCESSES, AND PROCEDURES ASSOCIATED WITH PREPARATION OF FINANCIAL STATEMENTS AND SUPPORTING A STRONG INTERNAL CONTROL ENVIRONMENT.\n\nTHIS POSITION REPORTS TO THE SR. DIRECTOR OF EXTERNAL REPORTING. THE PRIMARY RESPONSIBILITIES FOR THIS POSITION ARE TO SUPPORT MEDTRONIC’S EXTERNAL REPORTING INITIATIVES INCLUDING PREPARATION OF MEDTRONIC PLC’S SEC FILINGS INCLUDING THE ANNUAL 10-K AND QUARTERLY 10-Q FILINGS, BENEFIT AND RETIREMENT PLANS, AND ANNUAL IRISH STATUTORY ACCOUNTS. THE IDEAL CANDIDATE ENJOYS WORKING IN A DYNAMIC ENVIRONMENT, MANAGING SEVERAL COMPETING ASSIGNMENTS, AND BEING PART OF A TEAM. THE IDEAL CANDIDATE IS LOOKING TO PROGRESSIVELY TAKE-ON ADDITIONAL RESPONSIBILITIES AND HELP COMPILE, DOCUMENT, AND PERFORM DETAILED PREPARATION OF FINANCIAL INFORMATION.\n\nTHIS POSITION WILL PROVIDE A WIDE ARRAY OF ASSIGNMENTS AND EXPERIENCES AND WILL REQUIRE THE ABILITY TO WORK WELL AND PARTNER WITH A MULTITUDE OF ORGANIZATIONS AND LEVELS (INCLUDING SENIOR LEVEL EXECUTIVES) WITHIN GLOBAL FINANCE, INVESTOR RELATIONS, LEGAL, PUBLIC RELATIONS, TREASURY, TAX, COMPENSATION & BENEFITS, SUSTAINABILITY, AND MEDTRONIC’S PORTFOLIOS, OPERATING UNITS, AND REGIONS.\n\nWE BELIEVE THAT WHEN PEOPLE FROM DIFFERENT CULTURES, GENDERS, AND POINTS OF VIEW COME TOGETHER, INNOVATION IS THE RESULT — AND EVERYONE WINS. MEDTRONIC WALKS THE WALK, CREATING AN INCLUSIVE CULTURE WHERE YOU CAN THRIVE.\n\nA DAY IN THE LIFE\n\nRESPONSIBILITIES MAY INCLUDE THE FOLLOWING AND OTHER DUTIES MAY BE ASSIGNED.\n\n HELP PREPARATION OF THE ANNUAL 10-K AND QUARTERLY 10-Q FILINGS INCLUDING PREPARATION OF FINANCIAL STATEMENTS, FOOTNOTE DISCLOSURES, MD&A AND SUPPORTING SCHEDULES, TO ENSURE COMPLIANCE WITH SEC REPORTING REQUIREMENTS. PARTICIPATE IN PREPARATION OF ANNUAL IRISH STATUTORY ACCOUNTS REPORTING REQUIREMENTS. REVIEW ANALYSIS AND DISCLOSURES AND PROVIDE MEANINGFUL FEEDBACK. ENSURE HIGH QUALITY WORK IS ACHIEVED WHILE MEETING NECESSARY DEADLINES. PROACTIVELY PARTNER WITH A VARIETY OF BUSINESS, FUNCTIONAL, AND REGIONAL PARTNERS TO PROVIDE FINANCIAL SUPPORT. ACTIVELY PARTICIPATE IN AND LEAD VARIOUS SPECIAL PROJECTS AS ASSIGNED BY MANAGEMENT. SPECIAL PROJECTS INCLUDE A MULTITUDE OF ANALYSIS, REPORTING, BENCHMARKING, AND AD HOC REQUESTS THAT REQUIRE THE ABILITY TO OBTAIN NECESSARY INFORMATION FROM INTERNAL AND EXTERNAL SOURCES AND PREPARE COMPREHENSIVE, COHESIVE, AND UNDERSTANDABLE PRESENTATIONS. ASSIST IN IMPLEMENTATION OF PROCESS IMPROVEMENTS, INCLUDING USAGE OF DMAIC STRATEGY AND TOOLS (A3) FOR IMPROVING PROCESSES. ASSIST WITH PREPARATIONS FOR QUARTERLY FINANCIAL STATEMENT REVIEW WITH CFO, GLOBAL CONTROLLER & CHIEF ACCOUNTING OFFICER, AND VP FINANCIAL SERVICES & SYSTEMS. ASSIST WITH ADDRESSING REPORTING, AND DISCLOSURE QUESTIONS WHICH MAY BE RAISED BY OUR GLOBAL BUSINESS PARTNERS. ASSIST WITH THE PREPARATION OF THE FINANCIAL STATEMENTS FOR THE BENEFIT AND RETIREMENT PLAN AUDITS INCLUDING 11-K FILINGS WHERE APPLICABLE. ASSIST AS LIAISON BETWEEN MEDTRONIC AND THE EXTERNAL AUDITORS (PWC) FOR QUARTERLY REVIEW AND ANNUAL AUDIT PROCEDURES. ASSIST WITH THE CONTINUOUS IMPROVEMENT OF THE GLOBAL FINANCE POLICY PORTAL INCLUDING ASSISTING WITH POSTING OF POLICY UPDATES AS NEEDED. MAINTAIN A HIGH LEVEL OF UNDERSTANDING OF CURRENT AND PROPOSED ACCOUNTING AND REPORTING REQUIREMENTS THAT MAY IMPACT MEDTRONIC THROUGH SELF-STUDY, OUTSIDE/WEB-BASED SEMINARS, AND ACTIVE PARTICIPATION IN PROFESSIONAL ORGANIZATIONS AND PERSONAL NETWORKS.\n\n\nMUST HAVE: MINIMUM REQUIREMENTS\n\n BACHELOR’S DEGREE WITH 2+ YEARS OF WORK EXPERIENCE IN FINANCE AND/OR ACCOUNTING \n\n\nNICE TO HAVE\n\n 4+ YEARS OF BUSINESS EXPERIENCE WITH EMPHASIS IN ACCOUNTING OR FINANCE INCLUDING 4+ YEARS OF PUBLIC ACCOUNTING/SEC REPORTING EXPERIENCE  EXPERIENCE WITH U.S. GENERALLY ACCEPTED ACCOUNTING PRINCIPLES (U.S. GAAP), FINANCIAL CONTROLS, AND OTHER AUTHORITATIVE ACCOUNTING AND REPORTING GUIDANCE  INTEREST IN LEARNING AND BECOMING KNOWLEDGEABLE IN ESG INITIATIVES AND REPORTING AS GLOBAL ESG REPORTING REQUIREMENTS EVOLVE  INTEREST IN LEARNING AND BECOMING KNOWLEDGEABLE IN PREPARATION OF ANNUAL IRISH STATUTORY ACCOUNTS  ACTIVE CPA  INTEREST IN LEARNING AND BECOMING KNOWLEDGEABLE IN LEVERAGING GENERATIVE AI CAPABILITIES WHERE POSSIBLE  SKILLFUL IN DATA ANALYSIS AND ANALYTICS TO DEVELOP FINANCIAL ANALYSIS  ABILITY TO WORK EFFECTIVELY WITH SEVERAL LEVELS OF MANAGEMENT, INCLUDING SENIOR LEVEL EXECUTIVES, AND PARTNER WITH A VARIETY OF BUSINESS, FUNCTIONAL, AND REGIONAL PARTNERS TO PROVIDE FINANCIAL SUPPORT  PROFICIENCY WITH MICROSOFT OFFICE APPLICATIONS (TEAMS, EXCEL, WORD, POWERPOINT) AND DESIRE AND ABILITY TO LEARN FINANCIAL APPLICATIONS (WORKIVA WDESK, SAP, HYPERION ESSBASE)  DRIVE FOR CONTINUOUS IMPROVEMENT INCLUDING THE ABILITY TO INNOVATE AND SIMPLIFY BOTH FINANCE AND OPERATIONAL PROCESSES  STRONG WRITTEN, VERBAL, AND INTERPERSONAL SKILLS  STRONG ORGANIZATION AND ANALYTICAL SKILLS AND ABILITY TO WORK IN A FAST-PACED ENVIRONMENT AND ADAPT TO RAPIDLY CHANGING PRIORITIES WHILE CONSISTENTLY DELIVERING ON TIME/HIGH QUALITY RESULTS, INCLUDING ACTIVE USAGE OF VISUAL MANAGEMENT TOOLS AND PROCESSES  MUST DEMONSTRATE GOOD JUDGMENT, TACT, DISCRETION, AND DIPLOMACY IN DECISION MAKING SUPPORT  MBA/POTENTIAL INTEREST IN PURSUING MBA OR OTHER PROFESSIONAL DEGREES \n\n\nABOUT MEDTRONIC\n\nTOGETHER, WE CAN CHANGE HEALTHCARE WORLDWIDE. AT MEDTRONIC, WE PUSH THE LIMITS OF WHAT TECHNOLOGY, THERAPIES AND SERVICES CAN DO TO HELP ALLEVIATE PAIN, RESTORE HEALTH AND EXTEND LIFE. WE CHALLENGE OURSELVES AND EACH OTHER TO MAKE TOMORROW BETTER THAN YESTERDAY. IT IS WHAT MAKES THIS AN EXCITING AND REWARDING PLACE TO BE.\n\nWE WANT TO ACCELERATE AND ADVANCE OUR ABILITY TO CREATE MEANINGFUL INNOVATIONS - BUT WE WILL ONLY SUCCEED WITH THE RIGHT PEOPLE ON OUR TEAM. LET’S WORK TOGETHER TO ADDRESS UNIVERSAL HEALTHCARE NEEDS AND IMPROVE PATIENTS’ LIVES. HELP US SHAPE THE FUTURE.\n\nPHYSICAL JOB REQUIREMENTS\n\nTHE PHYSICAL DEMANDS DESCRIBED WITHIN THE RESPONSIBILITIES SECTION OF THIS JOB DESCRIPTION ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY AN EMPLOYEE TO SUCCESSFULLY PERFORM THE ESSENTIAL FUNCTIONS OF THIS JOB. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS. FOR OFFICE ROLES: WHILE PERFORMING THE DUTIES OF THIS JOB, THE EMPLOYEE IS REGULARLY REQUIRED TO BE INDEPENDENTLY MOBILE. THE EMPLOYEE IS ALSO REQUIRED TO INTERACT WITH A COMPUTER, AND COMMUNICATE WITH PEERS AND CO-WORKERS. CONTACT YOUR MANAGER OR LOCAL HR TO UNDERSTAND THE WORK CONDITIONS AND PHYSICAL REQUIREMENTS THAT MAY BE SPECIFIC TO EACH ROLE. (ADA-UNITED STATES OF AMERICA)\n\n A COMMITMENT TO OUR EMPLOYEES LIVES AT THE CORE OF OUR VALUES. WE RECOGNIZE THEIR CONTRIBUTIONS. THEY SHARE IN THE SUCCESS THEY HELP TO CREATE.  WE OFFER A WIDE RANGE OF BENEFITS, RESOURCES, AND COMPETITIVE COMPENSATION PLANS DESIGNED TO SUPPORT YOU AT EVERY CAREER AND LIFE STAGE. LEARN MORE ABOUT OUR BENEFITS   HERE   . \n\n THIS POSITION IS ELIGIBLE FOR A SHORT-TERM INCENTIVE PLAN.  LEARN MORE ABOUT MEDTRONIC INCENTIVE PLAN (MIP) ON PAGE 6   HERE  .\n\n THE PROVIDED BASE SALARY RANGE IS USED NATIONALLY (EXCEPT IN CERTAIN CA LOCATIONS). THE RATE OFFERED IS COMPLIANT WITH FEDERAL/LOCAL REGULATIONS AND MAY VARY BY EXPERIENCE, CERTIFICATION/EDUCATION, MARKET CONDITIONS, LOCATION, ETC.",
    "job_skill_set": [
      "financial reporting",
      "data analysis",
      "Microsoft Office",
      "financial statements preparation",
      "SEC filings",
      "financial controls",
      "process improvement",
      "financial analysis",
      "teamwork",
      "communication",
      "organization",
      "adaptability",
      "interpersonal skills",
      "problem solving",
      "judgment",
      "time management",
      "leadership",
      "U.S. GAAP",
      "ESG reporting",
      "SAP",
      "Hyperion Essbase",
      "Workiva Wdesk",
      "A3 strategy",
      "diplomacy"
    ],
    "short_keywords": [
      "a3",
      "adaptability",
      "analysis",
      "analyst",
      "communication",
      "controls",
      "data",
      "diplomacy",
      "esg",
      "essbase",
      "external",
      "filings",
      "finance",
      "financial",
      "gaap",
      "hyperion",
      "improvement",
      "interpersonal",
      "judgment",
      "leadership",
      "management",
      "microsoft",
      "office",
      "organization",
      "preparation",
      "problem",
      "process",
      "reporting",
      "sap",
      "sec",
      "skills",
      "solving",
      "statements",
      "strategy",
      "team",
      "teamwork",
      "time",
      "us",
      "wdesk",
      "workiva"
    ]
  },
  {
    "job_id": "3901693237",
    "job_title": "Associate, Strategic Finance ",
    "category": "FINANCE",
    "job_description": "THE ASSOCIATE WILL BE A KEY MEMBER OF FOCUS’S FINANCE TEAM, WITH IMMEDIATE RESPONSIBILITIES FOR FINANCIAL ANALYSIS, SUPPORTING THE COMPANY’S FUTURE CAPITAL RAISES, AND ONGOING PERFORMANCE REPORTING TO SENIOR MANAGEMENT AND THE BOARD OF DIRECTORS. THE ASSOCIATE WILL SUPPORT THE VP – FINANCE IN RUNNING THE COMPANY’S FINANCIAL MODEL AND WILL INTERACT REGULARLY WITH THE PE OWNERS, AND THE BROADER FINANCE AND M&A TEAMS TO CAPTURE UP-TO-DATE CHANGES IN BUSINESS PERFORMANCE AND CAPITAL ALLOCATION DECISIONS. THE COMPANY REGULARLY RAISES CAPITAL FROM THE DEBT CAPITAL MARKETS AND THE ASSOCIATE WILL SUPPORT THESE EFFORTS, WORKING WITH THE SPONSORS, SYNDICATE BANKS, AND RATINGS AGENCIES. THE IDEAL CANDIDATE IS HIGHLY ANALYTICAL, INTELLECTUALLY CURIOUS WITH A BACKGROUND IN FINANCE / INVESTMENT BANKING. THE ASSOCIATE WILL WORK IN A FAST-PACED ENVIRONMENT AND BE GIVEN IMMEDIATE RESPONSIBILITIES.\nTHIS ROLE IS BASED IN NEW HYDE PARK, NY WITH FLEXIBILITY TO WORK IN OUR MANHATTAN OFFICE.\nPRIMARY RESPONSIBILITIESOPERATE AND MAINTAIN FOCUS’ CONSOLIDATED FINANCIAL MODELTAKE OWNERSHIP FOR SHORT-TERM AND LONG-TERM BUSINESS FORECASTINGCOLLABORATE WITH SPONSORS AND SYNDICATE BANKS TO SUPPORT CAPITAL STRUCTURE DECISION-MAKINGPREPARE MARKETING MATERIALS FOR LENDERS FOR FUTURE CAPITAL RAISESLEAD PREPARATION OF REGULAR MONTHLY / QUARTERLY REPORTING TO SPONSORS, SENIOR MANAGEMENT AND THE BOARDSUPPORT M&A TEAM AS NEEDED ON CAPITAL DEPLOYMENT PROCESS / DECISION-MAKING\nQUALIFICATIONSBACHELOR’S DEGREE FROM A TOP UNIVERSITY OR COLLEGE1+ YEAR(S) FULL-TIME WORK EXPERIENCE IN INVESTMENT BANKING OR SIMILAR FIELDFLUENCY IN FINANCIAL STATEMENT ANALYSIS AND STRONG ANALYTICAL SKILLS IS A MUSTEXCELLENT COMMUNICATION AND ORGANIZATIONAL SKILLSEXPERIENCE IN DEBT CAPITAL TRANSACTIONS IS A PLUS\nABOUT FOCUS FINANCIAL PARTNERSAS A FAST-GROWING COMPANY IN THE WEALTH MANAGEMENT INDUSTRY, FOCUS IS THE LEADING PARTNERSHIP OF INDEPENDENT FIDUCIARY WEALTH MANAGEMENT FIRMS IN THE COUNTRY. FOCUS ACQUIRES AND OWNS GROWTH-ORIENTED AND CLIENT-CENTRIC WEALTH MANAGEMENT FIRMS, CHALLENGING THE TRADITIONAL BROKER/DEALER AND BANKING MODELS.\nFOCUS HAS A HIGHLY DIFFERENTIATED AND SUCCESSFUL BUSINESS MODEL. SINCE ITS INCEPTION IN JANUARY 2006, IT HAS COMPLETED OVER 290 M&A TRANSACTIONS AND LARGE-SCALE WIREHOUSE LIFT-OUTS, MAKING IT THE LARGEST INVESTOR IN THE REGISTERED INVESTMENT ADVISOR (“RIA”) SPACE. PARTNER FIRMS GET ACCESS NOT ONLY TO CAPITAL FOR GROWTH BUT ALSO TO RESOURCES THAT ASSIST IN SUCCESSION PLANNING, TALENT MANAGEMENT, MARKETING, PRICING, COMPLIANCE, OPERATIONS, TECHNOLOGY, VENDOR MANAGEMENT AND, MOST IMPORTANTLY, ACQUISITIONS OF OTHER RIAS.\nFOCUS’S ROBUST BUSINESS MODEL HAS RESULTED IN PHENOMENAL GROWTH IN THE LAST 15+ YEARS, AND TODAY THEY HAVE OVER 85 PARTNER FIRMS. ITS PROFITABILITY, CAPITAL STRUCTURE AND RESOURCES ALLOW IT TO SUSTAIN AND EXPAND A LEADERSHIP POSITION IN THE INDUSTRY.\nTHE ANNUALIZED BASE PAY RANGE FOR THIS ROLE IS EXPECTED TO BE BETWEEN $100,000-$125,000. ACTUAL BASE PAY COULD VARY BASED ON FACTORS INCLUDING BUT NOT LIMITED TO EXPERIENCE, SUBJECT MATTER EXPERTISE, GEOGRAPHIC LOCATION WHERE WORK WILL BE PERFORMED AND THE APPLICANT’S SKILL SET. THE BASE PAY IS JUST ONE COMPONENT OF THE TOTAL COMPENSATION PACKAGE FOR EMPLOYEES. OTHER COMPONENTS MAY INCLUDE AN ANNUAL CASH BONUS AND A COMPREHENSIVE BENEFITS PACKAGE.",
    "job_skill_set": [
      "financial analysis",
      "financial statement analysis",
      "analytical skills",
      "communication skills",
      "organizational skills",
      "collaboration",
      "adaptability",
      "financial modeling",
      "capital raising",
      "debt capital transactions",
      "business forecasting",
      "M&A support",
      "intellectual curiosity"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "analytical",
      "associate",
      "business",
      "capital",
      "collaboration",
      "communication",
      "curiosity",
      "debt",
      "finance",
      "financial",
      "forecasting",
      "intellectual",
      "ma",
      "modeling",
      "organizational",
      "raising",
      "skills",
      "statement",
      "strategic",
      "support",
      "transactions"
    ]
  },
  {
    "job_id": "3888489415",
    "job_title": "Finance & Investor Relations Intern (Summer 2024)",
    "category": "FINANCE",
    "job_description": "ABOUT GLOBALFOUNDRIES\n\nGLOBALFOUNDRIES (GF) IS A LEADING FULL-SERVICE SEMICONDUCTOR FOUNDRY PROVIDING A UNIQUE COMBINATION OF DESIGN, DEVELOPMENT, AND FABRICATION SERVICES TO SOME OF THE WORLD’S MOST INSPIRED TECHNOLOGY COMPANIES. WITH A GLOBAL MANUFACTURING FOOTPRINT SPANNING THREE CONTINENTS, GF MAKES POSSIBLE THE TECHNOLOGIES AND SYSTEMS THAT TRANSFORM INDUSTRIES AND GIVE CUSTOMERS THE POWER TO SHAPE THEIR MARKETS. FOR MORE INFORMATION, VISIT WWW.GF.COM.\n\nINTERNSHIP PROGRAM OVERVIEW\n\nOUR INTERNS & CO-OPS ARE OUR ENTRY-LEVEL TALENT PIPELINE FOR GF ACROSS THE GLOBE. OUR GOAL IS TO PROVIDE STUDENTS WITH A MEANINGFUL WORK EXPERIENCE THAT WILL EQUIP THEM WITH THE SKILLS TO EMBARK ON A CAREER IN THE FAST-PACED AND GROWING SEMICONDUCTOR INDUSTRY AFTER GRADUATION. AS AN INTERN AT GF, YOU’LL EXPERIENCE ONE-ON-ONE MENTORSHIP, WORK ASSIGNMENTS THAT PRIORITIZE YOUR GROWTH AND POTENTIAL, PROFESSIONAL DEVELOPMENT OPPORTUNITIES, AND THE CHANCE TO NETWORK WITH EXECUTIVES.\n\nSUMMARY OF ROLE\n\nTHE GF INVESTOR RELATION’S TEAM IS A FINANCE OR BUSINESS STUDENT TO JOIN THEIR TEAM AS AN INVESTOR RELATIONS INTERN FOR THE SUMMER OF 2024.\n\nESSENTIAL RESPONSIBILITIES INCLUDE\n\nSUPPORT INTERNAL PROCESS WORKSTREAMS FOR THE QUARTERLY REPORTING CYCLEDEVELOP IMPROVEMENTS TO INTERNAL MODELING TOOLSSUPPORT WITH PREPARING AND PRESENTING MARKET UPDATES TO INTERNAL STAKEHOLDERS DEVELOP SOLUTIONS-DRIVEN IDEAS TO IMPROVING SYSTEMS, PROCESSES AND DATA ANALYTICSTRACKING OF PEER GROUP AND CUSTOMER FINANCIAL REPORTING CYCLES AND KEY EVENTS SUPPORT WITH INVESTOR TARGETING, CONFERENCE PLANNING, PRESENTATION MATERIAL PREPARATION AND ASSISTING WITH INVESTOR QUERIESWORK AND COLLABORATE ON OTHER PROJECTS AND/OR ASSIGNMENTS AS NEEDED\n\nOTHER RESPONSIBILITIES\n\nPERFORM ALL ACTIVITIES IN A SAFE AND RESPONSIBLE MANNER AND SUPPORT ALL ENVIRONMENTAL, HEALTH, SAFETY & SECURITY REQUIREMENTS AND PROGRAMS.\n\nREQUIRED QUALIFICATIONS\n\nEDUCATION – AT LEAST A SOPHOMORE AT TIME OF APPLICATION AND ACTIVELY PURSUING A BACHELOR’S IN FINANCE, BUSINESS, ECONOMICS OR RELATED FIELD THROUGH AN ACCREDITED DEGREE PROGRAM DURING THE TIME OF INTERNSHIP.MUST HAVE AT LEAST AN OVERALL 3.0 GPA AND BE IN GOOD ACADEMIC STANDING.LANGUAGE FLUENCY - ENGLISH (WRITTEN & VERBAL)ABILITY TO WORK AT LEAST 40 HOURS PER WEEK DURING THE INTERNSHIP.\n\nPREFERRED QUALIFICATIONS\n\nPRIOR RELATED INTERNSHIP OR CO-OP EXPERIENCEDEMONSTRATED PRIOR LEADERSHIP EXPERIENCE IN THE WORKPLACE, SCHOOL PROJECTS, COMPETITIONS, ETC.PROJECT MANAGEMENT SKILLS, I.E., THE ABILITY TO INNOVATE AND EXECUTE ON SOLUTIONS THAT MATTER; THE ABILITY TO NAVIGATE AMBIGUITY.STRONG WRITTEN AND VERBAL COMMUNICATION SKILLSSTRONG PLANNING & ORGANIZATIONAL SKILLS\n\n#INTERNSHIPPROGRAMUS\n\nEXPECTED SALARY RANGE\n\n$0.00 - $0.00\n\nTHE EXACT SALARY WILL BE DETERMINED BASED ON QUALIFICATIONS, EXPERIENCE AND LOCATION.\n\nIF YOU NEED A REASONABLE ACCOMMODATION FOR ANY PART OF THE EMPLOYMENT PROCESS, PLEASE CONTACT US BY EMAIL AT USACCOMMODATIONS@GF.COM AND LET US KNOW THE NATURE OF YOUR REQUEST AND YOUR CONTACT INFORMATION. REQUESTS FOR ACCOMMODATION WILL BE CONSIDERED ON A CASE-BY-CASE BASIS. PLEASE NOTE THAT ONLY INQUIRIES CONCERNING A REQUEST FOR REASONABLE ACCOMMODATION WILL BE RESPONDED TO FROM THIS EMAIL ADDRESS.\n\nAN OFFER WITH GLOBALFOUNDRIES IS CONDITIONED UPON THE SUCCESSFUL COMPLETION OF PRE-EMPLOYMENT CONDITIONS, AS APPLICABLE, AND SUBJECT TO APPLICABLE LAWS AND REGULATIONS.\n\nGLOBALFOUNDRIES IS FULLY COMMITTED TO EQUAL OPPORTUNITY IN THE WORKPLACE AND BELIEVES THAT CULTURAL DIVERSITY WITHIN THE COMPANY ENHANCES ITS BUSINESS POTENTIAL. GLOBALFOUNDRIES GOAL OF EXCELLENCE IN BUSINESS NECESSITATES THE ATTRACTION AND RETENTION OF HIGHLY QUALIFIED PEOPLE. ARTIFICIAL BARRIERS AND STEREOTYPIC BIASES DETRACT FROM THIS OBJECTIVE AND MAY BE ILLEGALLY DISCRIMINATORY.\n\nALL POLICIES AND PROCESSES WHICH PERTAIN TO EMPLOYEES INCLUDING RECRUITMENT, SELECTION, TRAINING, UTILIZATION, PROMOTION, COMPENSATION, BENEFITS, EXTRACURRICULAR PROGRAMS, AND TERMINATION ARE CREATED AND IMPLEMENTED WITHOUT REGARD TO AGE, ETHNICITY, ANCESTRY, COLOR, MARITAL STATUS, MEDICAL CONDITION, MENTAL OR PHYSICAL DISABILITY, NATIONAL ORIGIN, RACE, RELIGION, POLITICAL AND/OR THIRD-PARTY AFFILIATION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, VETERAN STATUS, OR ANY OTHER CHARACTERISTIC OR CATEGORY SPECIFIED BY LOCAL, STATE OR FEDERAL LAW",
    "job_skill_set": [
      "communication",
      "teamwork",
      "problem solving",
      "organizational skills",
      "leadership",
      "adaptability",
      "financial modeling",
      "data analytics",
      "project management",
      "market analysis",
      "presentation preparation",
      "reporting",
      "Microsoft Excel",
      "financial reporting"
    ],
    "short_keywords": [
      "2024",
      "adaptability",
      "analysis",
      "analytics",
      "communication",
      "data",
      "excel",
      "finance",
      "financial",
      "intern",
      "investor",
      "leadership",
      "management",
      "market",
      "microsoft",
      "modeling",
      "organizational",
      "preparation",
      "presentation",
      "problem",
      "project",
      "relations",
      "reporting",
      "skills",
      "solving",
      "summer",
      "teamwork"
    ]
  },
  {
    "job_id": "3902931404",
    "job_title": "Finance Project Leader",
    "category": "FINANCE",
    "job_description": "JOB TITLE: FINANCE PROJECT LEADERTERM: CONTRACT REMOTE STATUS: ONSITE HOURS: 30 HOUR/ WEEK  \n\nTOP SKILLS: A MINIMUM OF 3 YEARS MANAGING PROJECTS.EXPERIENCE WITH TECHNOLOGY AND / OR OPERATIONAL PROJECTS.PROVEN EXPERIENCE IN PROJECT MANAGEMENT TOOLS.KNOWLEDGE OF PROJECT MANAGEMENT FRAMEWORKS AND BEST PRACTICES.\n\nRESPONSIBILITIES: \nTHE ROLE WILL FACILITATE THE PLANNING AND EXECUTION OF ALL FACETS OF THE PROJECT INCLUDING DEBT PLACEMENT CRITERIA, NEW BUSINESS RULES FOR CHANGE ORDER, TESTING, HYPER CARE, VENDOR AND CUSTOMER COMMUNICATIONS, VENDOR, AND CUSTOMER SERVICE REPRESENTATIVE TRAINING, AND SETTING UP MEETINGS WITH INTERNAL PARTICIPANTS AND EXTERNAL VENDORS AS NEEDED.· COORDINATES ALL ASPECTS OF PROJECT-ORIENTED WORK EFFORTS.· SETS AND MANAGES STAKEHOLDER EXPECTATIONS INTERNALLY AND EXTERNALLY.· UTILIZES PROJECT MANAGEMENT PROCESSES AND METHODOLOGIES.· DEVELOPS PROJECT PLANS, DIRECTS, AND MONITORS WORK EFFORTS DAILY, IDENTIFIES RESOURCE NEEDS, PERFORMS QUALITY REVIEW; AND ESCALATES FUNCTIONAL, QUALITY, TIMELINE ISSUES APPROPRIATELY.· TRACKS KEY PROJECT MILESTONES AND ADJUSTS PROJECT PLANS AND/OR RESOURCES AS NEEDED.· DEFINES AND DOCUMENTS PROJECT SCOPE, OBJECTIVES, AND DESIRED OUTCOMES.· DEVELOPS AND MONITORS CHANGE MANAGEMENT REQUEST.· SUPPORTS DEVELOPING BUSINESS REQUIREMENT DOCUMENTS AND VERIFIES ALIGNMENT WITH THE RESPECTIVE PROJECT CHARTERS.· ENSURES PROJECTS ARE DELIVERED ON TIME, WITHIN BUDGET, AND ADHERES TO HIGH QUALITY STANDARDS.· COMMUNICATES WITH ALL AREAS OF THE ENTERPRISE THAT IMPACTS THE SCOPE, BUDGET, RISK, AND RESOURCES OF THE WORK EFFORT BEING MANAGED.",
    "job_skill_set": [
      "project management",
      "project management tools",
      "business rules",
      "quality review",
      "change management",
      "resource management",
      "communication",
      "stakeholder management",
      "planning",
      "execution",
      "problem solving",
      "team coordination",
      "project management frameworks",
      "debt placement criteria",
      "customer service"
    ],
    "short_keywords": [
      "business",
      "change",
      "communication",
      "coordination",
      "criteria",
      "customer",
      "debt",
      "execution",
      "finance",
      "frameworks",
      "leader",
      "management",
      "placement",
      "planning",
      "problem",
      "project",
      "quality",
      "resource",
      "review",
      "rules",
      "service",
      "solving",
      "stakeholder",
      "team",
      "tools"
    ]
  },
  {
    "job_id": "3898166536",
    "job_title": "Vice President of Finance",
    "category": "FINANCE",
    "job_description": "ABOUT US\nPAM TRANSPORT WAS FOUNDED IN TONTITOWN, ARKANSAS, IN 1980 AND OVER THE PAST 40+ YEARS OF BEING IN BUSINESS, WE HAVE BECOME AN INTERNATIONAL COMPANY WITH MORE THAN 2,200 TRUCKS AND 8,500 TRAILERS. WE ARE LOCATED IN THE HEART OF NORTHWEST ARKANSAS, ONE OF THE FASTEST AND HIGHEST RANKED PLACES TO LIVE IN THE COUNTRY. OUR GOAL IS TO PROVIDE EXCEPTIONAL SERVICE TO OUR CUSTOMERS. WE BELIEVE IT ALL STARTS WITH HAVING EXCEPTIONAL EMPLOYEES WHO ARE PASSIONATE ABOUT THEIR WORK. OUR CULTURE IS UNIQUE IN THAT WE OFFER THE GROWTH OPPORTUNITIES OF A LARGE COMPANY, BUT WE STILL MAINTAIN THAT “SMALL TOWN FEEL” AND STRONG COMMUNITY HERE AT PAM.\nABOUT THIS OPPORTUNITY\nWE ARE LOOKING FOR A STRONG, EMPOWERING LEADER TO CHAMPION THE EFFORTS OF OUR FINANCE DEPARTMENT. THIS POSITION WILL WORK CLOSELY WITH THE CEO, CFO, COO AND OTHER EXECUTIVE LEADERS TO HELP PAM REACH THE GROWTH GOALS WE HAVE SET FOR OURSELVES.\nPAY AND SCHEDULE\nMONDAY - FRIDAY 7:00AM TO 5:00PM. THE PAY RANGE IS $150,000 - $200,000/YEAR BASE SALARY DEPENDENT ON EXPERIENCE. THE POSITION IS ALSO ELIGIBLE FOR THE EXECUTIVE BONUS PLAN. *RELOCATION ASSISTANCE AVAILABLE FOR THE RIGHT CANDIDATE*\nHOW WILL YOU CONTRIBUTE TO THE SUCCESS OF THE TEAM?\nYOU WILL BE RESPONSIBLE FOR THE OVERSIGHT, MANAGEMENT, AND STRATEGIC DIRECTION FOR A WIDE ARRAY OF FINANCIAL FUNCTIONS INCLUDING:\nFINANCIAL STATEMENT GENERATION, DISTRIBUTION AND VARIANCE ANALYSISANNUAL PLANNINGFINANCIAL STATEMENT FORECASTING & MODELINGPARTNERING WITH BUSINESS LEADERS TO HELP UNDERSTAND AND DRIVE RESULTSANALYSIS AND EXECUTION OF STRATEGIC INITIATIVES AND AD-HOC DECISION SUPPORTFINANCIAL PROJECT MANAGEMENT, INCLUDING PARTICIPATION IN THE EVALUATION, SELECTION AND INTEGRATION OF A NEW FINANCIAL/ACCOUNTING SYSTEM\nWHAT MAKES YOU A STRONG CANDIDATE FOR THIS POSITION?\nCPA (PREFERRED)SUPERIOR FINANCIAL, ANALYTICAL, AND ACCOUNTING SKILLS; FULL UNDERSTANDING OF FINANCING STRATEGIES AND THE IMPACT ON THE BUSINESS AND FINANCIAL STRUCTURE.STRONG INTERPERSONAL AND COLLABORATION SKILLS, ABILITY TO INFLUENCE WITHOUT POSITIONAL AUTHORITY.ABILITY TO PRESENT TO HIGH LEVEL LEADERSHIP.WILLINGNESS AND CONFIDENCE TO HAVE DIFFICULT CONVERSATIONS WITH EMPLOYEES AS WELL AS KEY INTERNAL AND EXTERNAL STAKEHOLDERS.ABILITY TO TRAIN, DEVELOP, AND MOTIVATE EMPLOYEES.HIGH-CHARACTER INDIVIDUAL WHO CONDUCTS HIMSELF/HERSELF WITH INTEGRITY AND WINS THE TRUST OF OTHERS.ABILITY TO THINK STRATEGICALLY WHILE IDENTIFYING AREAS OF ORGANIZATIONAL IMPROVEMENT.STRONG STRESS TOLERANCE AND ABILITY TO HANDLE CHANGING PRIORITIES.\nPAM TRANSPORT IS PROUD TO BE AN EQUAL OPPORTUNITY EMPLOYER AND DRUG FREE WORKPLACE. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, RELIGION, COLOR, NATIONAL ORIGIN, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, AGE, STATUS AS A PROTECTED VETERAN, AMONG OTHER THINGS, OR STATUS AS A QUALIFIED INDIVIDUAL WITH DISABILITY.",
    "job_skill_set": [
      "financial statement generation",
      "variance analysis",
      "annual planning",
      "financial forecasting",
      "financial modeling",
      "financial project management",
      "accounting system integration",
      "CPA",
      "financial analysis",
      "financing strategies",
      "leadership",
      "interpersonal skills",
      "collaboration",
      "influence without authority",
      "presentation skills",
      "difficult conversations",
      "employee training and development",
      "integrity",
      "strategic thinking",
      "stress tolerance",
      "adaptability"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "analysis",
      "and",
      "annual",
      "authority",
      "collaboration",
      "conversations",
      "cpa",
      "development",
      "difficult",
      "employee",
      "finance",
      "financial",
      "financing",
      "forecasting",
      "generation",
      "influence",
      "integration",
      "integrity",
      "interpersonal",
      "leadership",
      "management",
      "modeling",
      "of",
      "planning",
      "presentation",
      "president",
      "project",
      "skills",
      "statement",
      "strategic",
      "strategies",
      "stress",
      "system",
      "thinking",
      "tolerance",
      "training",
      "variance",
      "vice",
      "without"
    ]
  },
  {
    "job_id": "3904513245",
    "job_title": "Structured Finance Associate",
    "category": "FINANCE",
    "job_description": "STRUCTURED CREDIT SERVICES (SCS) OFFERS TRUSTEE, CALCULATION AGENT, COLLATERAL ADMINISTRATION, AND CUSTODIAL SERVICES FOR OVER 400 SPECIAL PURPOSE VEHICLES (SPVS) GLOBALLY. THE STRUCTURED CREDIT SERVICES SPECIALIST WILL SERVE AS THE MAIN POINT OF CONTACT FOR CLIENTS, MANAGING RELATIONSHIPS AND OVERSEEING MONTHLY COMPLIANCE AND QUARTERLY NOTE VALUATION REPORTING. ADDITIONALLY, THEY MAY HANDLE CASH TRANSACTIONS FOR HIGH-PROFILE CLIENTS WITH INTRICATE CASH RELATIONSHIPS. THE ROLE PROMISES A DIVERSE AND INCLUSIVE ENVIRONMENT, A HYBRID WORK MODEL, COMPETITIVE COMPENSATION, AND VARIOUS BENEFITS INCLUDING HEALTH, RETIREMENT PLANS, AND EDUCATIONAL RESOURCES.\nRESPONSIBILITIES INCLUDE BEING THE PRIMARY CONTACT FOR AROUND 10 COLLATERALIZED LOAN OBLIGATIONS (CLO) SPVS, SUPERVISING PORTFOLIO ACCOUNTING ANALYSTS, AND PRODUCING MONTHLY/QUARTERLY INVESTOR REPORTING PACKAGES. EFFECTIVE COMMUNICATION WITH UNDERWRITERS, INVESTMENT MANAGERS, RATING AGENCIES, AND BONDHOLDERS IS CRUCIAL. THIS POSITION ENTAILS LEADERSHIP WITHIN THE TEAM, CLOSE COLLABORATION WITH DEUTSCHE BANK OPERATIONS, AND ENSURING SPVS MEET ANNUAL COMPLIANCE REQUIREMENTS. REQUIRED SKILLS INCLUDE A BA/BS, PREFERABLY IN ACCOUNTING, FINANCE, BUSINESS, OR ECONOMICS, PROFICIENCY IN GENERAL ACCOUNTING PRINCIPLES, KNOWLEDGE OF STRUCTURED CREDIT PRODUCTS, AND ADVANCED MS EXCEL ABILITIES.",
    "job_skill_set": [
      "accounting",
      "finance",
      "MS Excel",
      "compliance reporting",
      "communication",
      "relationship management",
      "leadership",
      "collaboration",
      "problem solving",
      "structured credit products",
      "portfolio accounting"
    ],
    "short_keywords": [
      "accounting",
      "associate",
      "collaboration",
      "communication",
      "compliance",
      "credit",
      "excel",
      "finance",
      "leadership",
      "management",
      "ms",
      "portfolio",
      "problem",
      "products",
      "relationship",
      "reporting",
      "solving",
      "structured"
    ]
  },
  {
    "job_id": "3885112179",
    "job_title": "Director of Finance And Accounting",
    "category": "FINANCE",
    "job_description": "DIRECTOR OF FINANCE- TOP ACCOUNTING AND FINANCE ROLEA RAPIDLY GROWING TECHNOLOGY TIED ORGANIZATION IS LOOKING TO HIRE A DIRECTOR OF FINANCE TO LEAD THEIR ACCOUNTING AND FINANCE FUNCTION AND SUPPORT THE CEO. WITH THE ORGANIZATION SCALING QUICKLY THE COMPANY NEEDS A HANDS-ON FINANCE LEADER WHO CAN BOTH LEAD A SMALL ACCOUNTING AND REPORTING TEAM WHILE ALSO BUILDING A MORE FORMAL BUDGETING, FORECASTING, CASH MANAGEMENT AND OPERATIONAL ANALYSIS PROCESS. THE COMPANY NEEDS SOMEONE WHO HAS BEEN THROUGH RAPID GROWTH WITH AN ORGANIZATION AND LED THE BUILD OUT OF AN ACCOUNTING AND FINANCE FUNCTION TO SUPPORT IT. THIS IS MORE OF A CONTROLLER+ TYPE CAPACITY WITH THE ABILITY TO MOVE MORE TOWARD CFO WORK WITH CONTINUED GROWTH. CHICAGO BASED HEADQUARTERS WITH PREFERRED CANDIDATE BEING LOCAL BUT REMOTE SET UP OUTSIDE OF OCCASIONAL TRAVEL. \nOBJECTIVES OF THIS ROLE:OVERSIGHT OF FINANCIAL REPORTING, GENERAL ACCOUNTING AND OPERATIONAL ACCOUNTING POINT PERSON FOR OUTSIDE AUDIT AND TAX FIRMFORMALIZING BUDGETING, FORECASTING AND CASH MANAGEMENT PROCESSDEVELOPING KPIS AND OPERATIONAL ANALYSIS TO ENABLE THE CEO AND BUSINESS TO MAKE DECISIONS AD HOC ANALYSIS AND SPECIAL PROJECTS AROUND EXPANSION AND PROFITABILITY ENHANCEMENTLEVERAGE NETSUITE TO GET MORE OUT OF THE SYSTEM \nREQUIRED SKILLS:10+ YEARS OF EXPERIENCE INCLUDING AN ACCOUNTING FOUNDATION AND SEVERAL YEARS OF FINANCE EXPERIENCE ACCOUNTING OR FINANCE DEGREE REQUIRED, CPA PREFERREDEXPERIENCE WITH A HIGH GROWTH ORGANIZATION GREATER THAN $50MILLEXPERIENCE SUPPORTING A CEO OR WORKING IN A HIGHLY ENTREPRENEURIAL ENVIRONMENTEXPERIENCE WITH SERVICES, TECHNOLOGY OR AN INDUSTRY WITH A RE-OCCURRING REVENUE MODEL PREFERREDNETSUITE EXPERIENCE HIGHLY PREFERRED\nIF YOU ARE INTERESTED IN THIS DIRECTOR OF FINANCE ROLE OR WANT TO CONNECT ON THE MARKET, PLEASE EMAIL YOUR RESUME TO BRIAN.ESKO@LHH.COM OR APPLY HERE.\nEQUAL OPPORTUNITY EMPLOYER MINORITIES/WOMEN/VETERANS/DISABLED",
    "job_skill_set": [
      "financial reporting",
      "general accounting",
      "operational accounting",
      "cash management",
      "operational analysis",
      "CPA",
      "accounting degree",
      "finance degree",
      "leadership",
      "communication",
      "problem solving",
      "team management",
      "adaptability",
      "analytical skills",
      "budgeting",
      "forecasting",
      "KPI development",
      "Netsuite",
      "high growth organization experience",
      "entrepreneurial environment experience",
      "strategic thinking"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "analysis",
      "analytical",
      "and",
      "budgeting",
      "cash",
      "communication",
      "cpa",
      "degree",
      "development",
      "director",
      "entrepreneurial",
      "environment",
      "experience",
      "finance",
      "financial",
      "forecasting",
      "general",
      "growth",
      "high",
      "kpi",
      "leadership",
      "management",
      "netsuite",
      "of",
      "operational",
      "organization",
      "problem",
      "reporting",
      "skills",
      "solving",
      "strategic",
      "team",
      "thinking"
    ]
  }
]