[
  {
    "job_id": "3903183717",
    "job_title": "Information Technology Project Coordinator",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOB TITLE: OPERATION ANALYST/PROJECT COORDINATORDURATION: 6 MONTHSLOCATION: HERNDON VA (ONSITE)\n • WILL TRAVEL BE REQUIRED FOR THIS POSITION? IF SO, HOW OFTEN? NO • WHAT SCHEDULE IS THE CANDIDATE REQUIRED TO WORK? 6:30-15:00 WILLING TO WORK WITH THEM, MONDAY THRU FRIDAY • AT ANY TIME IS OVERTIME REQUIRED OR WOULD YOU SAY IT IS JUST AVAILABLE AS A FUNCTION OF THE JOB? NO GUARANTEE ON OVERTIME, BUT WILL BE BASED ON PROJECT NEEDS AND STORMS.\n• QUICK DESCRIPTION OF THE ROLE OR PROJECT STORY (WHAT THIS ROLE WILL BE DOING): GATHERS AND ANALYZES CUSTOMER CALLS AND VARIOUS COMPUTER DATA TO DETERMINE LOCATION AND CAUSE OF POWER OUTAGES. PERFORMS CALLOUTS IN ARCOS FOR SERVICE RESTORATION, EMERGENCIES, PLANNED OVERTIME, AND FILL-SHIFTS. DUTIES MAY EXTEND TO STANDBY LIST MANAGEMENT/MAINTENANCE, PERFORMING COMPLEX OUT-OF-TOWN CALLOUTS AND/OR MAINTAINING ACCURATE INFORMATION AND MOVEMENT IN CREW MANAGER. PERFORMS AS LOCAL STORM ANALYST AND MAINTAINS AN ABILITY TO TRAVEL TO IMPACTED OFFICES.\n ACCURATELY REPORTS OUTAGES TO CUSTOMERS' ACCOUNTS. DUTIES MAY EXTEND TO EDITING AND APPROVAL OF COMPLEX SRRS REPORTS. PROVIDES ACCURATE AND TIMELY INFORMATION TO CUSTOMERS AND FIRST LINE RESOLUTION TO CUSTOMER COMPLAINTS. DUTIES MAY EXTEND TO DIRECT CUSTOMER CORRESPONDENCE AND/OR DIRECT SUPPORT FOR POWER QUALITY AND EMF FIELD INVESTIGATIONS. PRIORITIZES, SCHEDULES, AND MANAGES NON-EMERGENCY PREVENTATIVE MAINTENANCE AND CUSTOMER-REQUESTED WORK IN A TIMELY AND COST-EFFECTIVE MANNER. DUTIES MAY EXTEND TO FULL CREATION, SET UP, PACKAGING, PERMITTING, JOINT-USE INTERACTION, AS-BUILTING AND RECONCILING DISCREPANCIES FOR ARM AND TROUBLE WORK.\n RECOGNIZES THE FINANCIAL IMPACT OF GATHERING AND MAINTAINING ACCURATE INFORMATION IN ALL SYSTEMS. FINANCIAL RESPONSIBILITY MAY EXTEND TO MONTHLY BUDGET REVIEWS, FINANCIAL REPORT ANALYSIS, EVIDENCE COLLECTION AND SUBMISSION OF CROSS-CHARGE REQUESTS WHERE APPLICABLE.\n DUTIES MAY EXTEND TO FULL SET-UP, PACKAGING, PERMIT WORK, AS-BUILTING, RECONCILIATION, BILLING INTERACTION, AND JOB CLOSING.\n•WHAT ARE THE TOP (AT LEAST 3 IF POSSIBLE) “MUST HAVE” SKILL SETS (TECHNICAL/FUNCTIONAL) WHICH ARE REQUIRED? 1. CUSTOMER BUSINESS MANAGEMENT SYSTEM 2. SCHEDULING MANAGEMENT TOOLS 3. PROJECT COORDINATION\n • WHAT ARE THE TOP “NICE TO HAVE” SKILL SETS? ABILITY TO ADDRESS MULTIPLE PROJECTS. ABILITY TO WORK ON VARIOUS SOFTWARE APPLICATIONS, I.E. MICROSOFT, SAP, VMS\n • WHAT EDUCATION AND CERTIFICATIONS/LICENSURES ARE REQUIRED? HIGH SCHOOL DIPLOMA",
    "job_skill_set": [
      "Project Coordination",
      "Microsoft",
      "VMS",
      "Data Analysis",
      "Communication",
      "Problem Solving",
      "Time Management",
      "Customer Service",
      "Teamwork",
      "Adaptability",
      "Customer Business Management System",
      "Scheduling Management Tools",
      "SAP",
      "Financial Reporting",
      "Callout Management (ARCOS)",
      "Preventative Maintenance Management"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "arcos",
      "business",
      "callout",
      "communication",
      "coordination",
      "coordinator",
      "customer",
      "data",
      "financial",
      "information",
      "informationtechnology",
      "maintenance",
      "management",
      "microsoft",
      "preventative",
      "problem",
      "project",
      "reporting",
      "sap",
      "scheduling",
      "service",
      "solving",
      "system",
      "teamwork",
      "technology",
      "time",
      "tools",
      "vms"
    ]
  },
  {
    "job_id": "3902948188",
    "job_title": "Information Technology Specialist 2 (NY HELPs) - 5138",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "MINIMUM QUALIFICATIONS\n\nOPEN COMPETITIVE: A BACHELOR'S OR HIGHER-LEVEL DEGREE INCLUDING OR SUPPLEMENTED BY 15 SEMESTER CREDIT HOURS IN COMPUTER SCIENCE.\n\nOR\n\nA BACHELOR'S OR HIGHER-LEVEL DEGREE IN ANY FIELD AND ONE YEAR OF EXPERIENCE IN INFORMATION TECHNOLOGY; OR 60 SEMESTER CREDIT HOURS INCLUDING OR SUPPLEMENTED BY 15 SEMESTER CREDIT HOURS IN COMPUTER SCIENCE AND ONE YEAR OF PROFESSIONAL EXPERIENCE IN INFORMATION TECHNOLOGY.\n\nOR\n\nTWO YEARS OF PROFESSIONAL EXPERIENCE IN INFORMATION TECHNOLOGY.\n\nTRANSFER: OPEN TO NYS EMPLOYEES WITH ONE YEAR OF PERMANENT COMPETITIVE SERVICE AS AN INFORMATION TECHNOLOGY SPECIALIST 2 OR INFORMATION TECHNOLOGY SPECIALIST 2 PROGRAMMING, G-18; OR IN A TITLE G-16 OR ABOVE DEEMED ADMINISTRATIVE UNDER SECTION 52.6 OF THE CIVIL SERVICE LAW.\n\n55B/C APPOINTMENT: THIS POSITION IS ELIGIBLE FOR 55B/C DESIGNATION AND CANDIDATES ARE ENCOURAGED TO APPLY.\n\nNYS HELPS: THIS TITLE IS PART OF THE NEW YORK HIRING FOR EMERGENCY LIMITED PLACEMENT STATEWIDE PROGRAM (NY HELPS).\n\nDUTIES DESCRIPTION\n\nUNDER THE DIRECTION OF THE INFORMATION TECHNOLOGY SPECIALIST 3 DATABASE, SG-23, WITHIN THE CHIEF TECHNOLOGY OFFICE, SHARED PLATFORM SERVICES, DATA MANAGEMENT SERVICES (DMS) SECTION, THE INFORMATION TECHNOLOGY SPECIALIST 2, SG-18, WILL DESIGN AND IMPLEMENT DATA MANAGEMENT SOLUTIONS FOR THE PUBLIC SAFETY PORTFOLIO.\n\nDUTIES INCLUDE, BUT ARE NOT LIMITED TO\n\n DATABASE DESIGN AND DEVELOPMENT SQL PERFORMANCE TUNING ADHOC REPORTING DATA ANALYSIS PROVIDE PRODUCTION DATABASE DATA TROUBLESHOOTING\n\nADDITIONAL COMMENTS\n\nSOME POSITIONS MAY REQUIRE FINGERPRINTING.\n\nSOME POSITIONS MAY REQUIRE UP TO 25% TRAVEL AND/OR LIFTING UP TO 50 LBS. SOME POSITIONS ARE PENDING CIVIL SERVICE APPROVAL. DETAILS OF POSITION(S) WILL BE DESCRIBED FURTHER IF YOU ARE SELECTED FOR AN INTERVIEW.\n\nPOSITIONS LOCATED IN NEW YORK CITY, WILL RECEIVE AN ADDITIONAL $3,400 DOWNSTATE ADJUSTMENT LOCATION PAY WITH REGULAR ANNUAL SALARY. POSITIONS LOCATED IN THE MID-HUDSON WILL RECEIVE AN ADDITIONAL $1,650 ADJUSTMENT LOCATION PAY.\n\nFOR THE DURATION OF THE NY HELPS PROGRAM, THIS TITLE MAYBE FILLED VIA A NON- COMPETITIVE APPOINTMENT, WHICH MEANS NO EXAMINATION IS REQUIRED BUT ALL CANDIDATES MUST MEET THE MINIMUM QUALIFICATIONS OF THE TITLE FOR WHICH THEY APPLY. AT THIS TIME, AGENCIES MAY RECRUIT AND HIRE EMPLOYEES BY MAKING TEMPORARY APPOINTMENTS. IN MAY 2024, IF A TEMPORARY NY HELPS EMPLOYEE IS SATISFACTORILY PERFORMING IN THE POSITION, THE APPOINTMENT WILL BE CHANGED FROM TEMPORARY PENDING CIVIL SERVICE COMMISSION ACTION TO PERMANENT NON-COMPETITIVE AND THE OFFICIAL PROBATIONARY PERIOD WILL BEGIN.\n\nAT A FUTURE DATE (WITHIN ONE YEAR OF PERMANENT APPOINTMENT), IT IS EXPECTED EMPLOYEES HIRED UNDER NY HELPS WILL HAVE THEIR NON-COMPETITIVE EMPLOYMENT STATUS CONVERTED TO COMPETITIVE STATUS, WITHOUT HAVING TO COMPETE IN AN EXAMINATION. EMPLOYEES WILL THEN BE AFFORDED WITH ALL OF THE SAME RIGHTS AND PRIVILEGES OF COMPETITIVE CLASS EMPLOYEES OF NEW YORK STATE. WHILE SERVING PERMANENTLY IN A NY HELPS TITLE, EMPLOYEES MAY TAKE PART IN ANY PROMOTION EXAMINATION FOR WHICH THEY ARE QUALIFIED.\n\nBENEFITS OF WORKING FOR NYS GENEROUS BENEFITS PACKAGE, WORTH 65% OF SALARY, INCLUDING:\n\nHOLIDAY & PAID TIME OFF\n\n THIRTEEN (13) PAID HOLIDAYS ANNUALLY UP TO THIRTEEN (13) DAYS OF PAID VACATION LEAVE ANNUALLY UP TO FIVE (5) DAYS OF PAID PERSONAL LEAVE ANNUALLY UP TO THIRTEEN (13) DAYS OF PAID SICK LEAVE ANNUALLY FOR PEF. UP TO THREE (3) DAYS OF PROFESSIONAL LEAVE ANNUALLY TO PARTICIPATE IN PROFESSIONAL DEVELOPMENT\n\nHEALTH CARE BENEFITS\n\n ELIGIBLE EMPLOYEES AND DEPENDENTS CAN PICK FROM A VARIETY OF AFFORDABLE HEALTH INSURANCE PROGRAMS FAMILY DENTAL AND VISION BENEFITS AT NO ADDITIONAL COST\n\nADDITIONAL BENEFITS\n\n NEW YORK STATE EMPLOYEES’ RETIREMENT SYSTEM (ERS) MEMBERSHIP NYS DEFERRED COMPENSATION ACCESS TO NY 529 AND NY ABLE COLLEGE SAVINGS PROGRAMS, AS WELL AS U.S. SAVINGS BONDS PUBLIC SERVICE LOAN FORGIVENESS (PSLF) AND MANY MORE.\n\n",
    "job_skill_set": [
      "Database Design",
      "SQL",
      "Performance Tuning",
      "Data Analysis",
      "Adhoc Reporting",
      "Troubleshooting",
      "Communication",
      "Problem Solving",
      "Teamwork",
      "Adaptability"
    ],
    "short_keywords": [
      "2",
      "5138",
      "adaptability",
      "adhoc",
      "analysis",
      "communication",
      "data",
      "database",
      "design",
      "helps",
      "information",
      "informationtechnology",
      "ny",
      "performance",
      "problem",
      "reporting",
      "solving",
      "specialist",
      "sql",
      "teamwork",
      "technology",
      "troubleshooting",
      "tuning"
    ]
  },
  {
    "job_id": "3905818819",
    "job_title": "Information Technology Support Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "TRIOTECH CORPORATION IS LOOKING FOR AN EXPERIENCED, SELF-MOTIVATED IT SUPPORT SPECIALIST TO ASSIST A WIDE RANGE OF CUSTOMERS.\nRESPONSIBILITIESPOSITION IS RESPONSIBLE FOR DUTIES THAT RANGE FROM DESKTOP SUPPORT TO MICROSOFT SERVER INSTALLATION/ADMINISTRATION TO VOIP INSTALLATION/ADMINISTRATION.POSITION WILL REQUIRE TRAVELING LOCALLY TO CLIENT LOCATIONS AS WELL AS REMOTE SUPPORT.\nQUALIFICATIONSCANDIDATES SHOULD HAVE 1-2 YEARS EXPERIENCE WITH ACTIVE DIRECTORY MANAGEMENT, HYPER-V ADMINISTRATION, NETWORKING/ROUTING/VLANS, MICROSOFT 365 ADMINISTRATION AND VOIP. A COLLEGE DEGREE IN IT ADMINISTRATION PREFERRED BUT NOT REQUIRED.",
    "job_skill_set": [
      "Hyper-V Administration",
      "Networking",
      "Microsoft 365 Administration",
      "Self-Motivated",
      "Customer Service",
      "Problem Solving",
      "Communication",
      "Adaptability",
      "Active Directory Management",
      "Routing",
      "VLANs",
      "VOIP Installation/Administration"
    ],
    "short_keywords": [
      "365",
      "active",
      "adaptability",
      "administration",
      "communication",
      "customer",
      "directory",
      "hyperv",
      "information",
      "informationtechnology",
      "installationadministration",
      "management",
      "microsoft",
      "networking",
      "problem",
      "routing",
      "selfmotivated",
      "service",
      "solving",
      "specialist",
      "support",
      "technology",
      "vlans",
      "voip"
    ]
  },
  {
    "job_id": "3899930726",
    "job_title": "Information Technology Project Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "AS OUR IT PROJECT MANAGER, YOU WILL BE RESPONSIBLE FOR MANAGING A VARIETY OF CONCURRENT IT PROJECTS, INCLUDING THE ESTABLISHMENT OF NEW NETWORKS, DATA SEGREGATION BY PRODUCT LINE, DUPLICATION OF EXISTING APPLICATIONS FOR SEGREGATED DATA, COORDINATION WITH AN INTEGRATOR FOR ERP SYSTEM MODIFICATIONS, AND DATA EXTRACTION. THIS ROLE REQUIRES A STRATEGIC THINKER WITH A STRONG BACKGROUND IN PROJECT MANAGEMENT WITHIN THE IT SECTOR, EXCLUDING SOFTWARE DEVELOPMENT.\nESSENTIAL JOB FUNCTIONS:PLAN, EXECUTE, AND FINALIZE PROJECTS ACCORDING TO STRICT DEADLINES AND WITHIN BUDGET, INCLUDING ACQUIRING RESOURCES AND COORDINATING THE EFFORTS OF TEAM MEMBERS AND THIRD-PARTY CONTRACTORS OR CONSULTANTS.DEFINE THE PROJECT’S OBJECTIVES AND OVERSEE QUALITY CONTROL THROUGHOUT ITS LIFE CYCLE.LEAD AND MANAGE A BLENDED ONSITE-OFFSHORE PROJECT TEAM INCLUDING INTERNAL IT STAFF AND VENDOR STAFFMANAGE THE PROJECT SCOPE, PROJECT SCHEDULE, AND PROJECT COSTS EFFECTIVELY.COORDINATE WITH INTERNAL AND EXTERNAL STAKEHOLDERS TO ENSURE SEAMLESS EXECUTION OF PROJECTS.OVERSEE THE ESTABLISHMENT OF A NEW NETWORK INFRASTRUCTURE AND ENSURE ITS ALIGNMENT WITH COMPANY OBJECTIVES.LEAD THE DATA SEGREGATION PROJECT BY PRODUCT LINE, ENSURING DATA INTEGRITY AND ACCESSIBILITY.SUPERVISE THE DUPLICATION OF EXISTING APPLICATIONS FOR SEGREGATED DATA LINES, COORDINATING CLOSELY WITH TECHNICAL TEAMS.IDENTIFY, ASSESS, AND MITIGATE POTENTIAL RISKS AND ISSUES THROUGHOUT THE PROJECT LIFECYCLEWORK WITH INTEGRATORS FOR NECESSARY CHANGES TO OUR ERP SYSTEM, ENSURING MINIMAL DISRUPTION TO BUSINESS OPERATIONS.MANAGE THE EXTRACTION OF DATA TO BUYERS FOR CERTAIN PRODUCT LINE BUSINESSES, ENSURING COMPLIANCE WITH LEGAL AND BUSINESS REQUIREMENTS.PREPARE REPORTS FOR UPPER MANAGEMENT REGARDING THE STATUS OF PROJECTS.\nREQUIRED EDUCATION / EXPERIENCE:BACHELOR’S DEGREE IN INFORMATION TECHNOLOGY, COMPUTER SCIENCE, BUSINESS ADMINISTRATION, OR A RELATED FIELD.PROVEN EXPERIENCE (7+ YEARS) IN PROJECT MANAGEMENT IN THE IT SECTOR, PARTICULARLY IN INFRASTRUCTURE AND DATA MANAGEMENT PROJECTS.\nKNOWLEDGE, SKILLS AND ABILITIES:STRONG UNDERSTANDING OF PROJECT MANAGEMENT PRINCIPLES, METHODOLOGIES, AND TOOLS (E.G., PMP/PRINCE2 CERTIFICATION IS A PLUS).EXPERIENCE IN MANAGING LARGE-SCALE IT PROJECTS, COORDINATING WITH CROSS-FUNCTIONAL TEAMS AND EXTERNAL VENDORS.ABILITY TO MANAGE MULTIPLE PROJECTS SIMULTANEOUSLY UNDER TIGHT DEADLINES.PROFICIENCY IN PROJECT MANAGEMENT SOFTWARE TOOLS.EXPERIENCE IN THE AEROSPACE INDUSTRY WITH MANUFACTURING AND MRO FAMILIARITY A PLUS\n“BENEFIT OFFERINGS INCLUDE MEDICAL, DENTAL, VISION, TERM LIFE INSURANCE, SHORT-TERM DISABILITY INSURANCE, ADDITIONAL VOLUNTARY BENEFITS, COMMUTER BENEFITS AND 401K PLAN. OUR PROGRAM PROVIDES EMPLOYEES THE FLEXIBILITY TO CHOOSE THE TYPE OF COVERAGE THAT MEETS THEIR INDIVIDUAL NEEDS. AVAILABLE PAID LEAVE MAY INCLUDE PAID SICK LEAVE, WHERE REQUIRED BY LAW; ANY OTHER PAID LEAVE REQUIRED BY FEDERAL, STATE OR LOCAL LAW; AND HOLIDAY PAY UPON MEETING ELIGIBILITY CRITERIA.DISCLAIMER: THESE BENEFIT OFFERINGS DO NOT APPLY TO CLIENT-RECRUITED JOBS AND JOBS WHICH ARE DIRECT HIRE TO A CLIENT”EQUAL OPPORTUNITY EMPLOYER/VETERANS/DISABLED.TO READ OUR CANDIDATE PRIVACY INFORMATION STATEMENT, WHICH EXPLAINS HOW WE WILL USE YOUR INFORMATION, PLEASE VISIT HTTPS://WWW.MODIS.COM/EN-US/CANDIDATE-PRIVACY.THE COMPANY WILL CONSIDER QUALIFIED APPLICANTS WITH ARREST AND CONVICTION RECORDS.",
    "job_skill_set": [
      "data management",
      "data extraction",
      "team leadership",
      "communication",
      "problem solving",
      "stakeholder management",
      "cross-functional collaboration",
      "adaptability",
      "project management",
      "network infrastructure",
      "ERP systems",
      "project management software",
      "risk management",
      "PMP certification",
      "PRINCE2 certification",
      "IT infrastructure",
      "strategic thinking",
      "time management"
    ],
    "short_keywords": [
      "adaptability",
      "certification",
      "collaboration",
      "communication",
      "crossfunctional",
      "data",
      "erp",
      "extraction",
      "information",
      "informationtechnology",
      "infrastructure",
      "it",
      "leadership",
      "management",
      "manager",
      "network",
      "pmp",
      "prince2",
      "problem",
      "project",
      "risk",
      "software",
      "solving",
      "stakeholder",
      "strategic",
      "systems",
      "team",
      "technology",
      "thinking",
      "time"
    ]
  },
  {
    "job_id": "3901959141",
    "job_title": "Information Technology Security Administrator",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "PROVISUR IS AN INDUSTRY LEADER THAT PUSHES THE BOUNDARIES OF INGENUITY, BRINGING PRECISION-ENGINEERED FOOD PROCESSING EQUIPMENT, AFTERMARKET PARTS AND SERVICE TO LOCATIONS AROUND THE WORLD. AS A GLOBAL LEADER WITH A CLOSE-KNIT FAMILY FEEL, WE TAKE PRIDE IN TAKING CARE OF OUR PEOPLE. CHECK OUT OUR VIDEOS AT JOBS.JOBVITE.COM/PROVISUR AND SEE FOR YOURSELF!\nOUR IT SECURITY ADMINISTRATOR WILL BE SELF-MOTIVATED, TEAM-ORIENTED, AND POSSESS THE ABILITY TO COMMUNICATE EFFECTIVELY. THIS ROLE INVOLVES OVERSEEING NETWORK SECURITY, IMPLEMENTING PROTECTIVE MEASURES AGAINST UNAUTHORIZED ACCESS, AND MANAGING SECURITY PROJECTS AND MONITORING. RESPONSIBILITIES ALSO INCLUDE HANDLING SECURITY ALERTS, TROUBLESHOOTING NETWORK ACCESS ISSUES, AND ENFORCING SECURITY POLICIES AND PROCEDURES.\nWHAT YOU'LL DO:LEAD SECURITY-RELATED PROJECTS AND COMMUNICATE EFFECTIVELY WITH ALL INVOLVED PARTIES.MANAGE THE COMPANY'S CROWDSTRIKE DEPLOYMENT TO ENSURE SECURITY ACROSS ALL DEVICES, IDENTIFYING VULNERABILITIES AND REMEDIATING. MAINTAIN ALL FORTIGATE FIREWALLS AND ACCESS POINTS ACROSS OFFICES.MONITOR AND MAINTAIN GLOBAL ACTIVE DIRECTORY SECURITY, BOTH ON-PREMISE AND IN THE CLOUD.SERVE AS THE OKTA ADMINISTRATOR FOR COMPANY-WIDE ACCESS MANAGEMENT.COORDINATE KNOWBE4 SECURITY TRAINING AND TESTING ACROSS THE ORGANIZATION.TRAVEL TO REMOTE OFFICES AND DATA CENTERS AS NEEDED.\nWHO YOU ARE:A SOLUTIONS-ORIENTED THINKER AND TROUBLESHOOTER WHO ENJOYS SOLVING PROBLEMS AND IMPLEMENTING SOLUTIONS.A LIFELONG LEARNER WITH A PASSION FOR CONTINUOUS IMPROVEMENT.\nWHAT YOU’LL NEED:BACHELORS IN IT OR 4 YEARS OR EQUIVALENT EXPERIENCE3+ YEARS IN CYBERSECURITY IS A MUSTCYBERSECURITY CERTIFICATIONS ARE A PLUSSTRONG PROBLEM SOLVING AND TROUBLESHOOTING SKILLSEXCELLENT WRITTEN AND PHONE COMMUNICATION SKILLSEXPERIENCE WITH MANAGING CROWDSTRIKE OR A COMPARABLE EDR SOLUTIONUNDERSTANDING OF ON-PREMISES AND CLOUD SECURITY\nWHAT YOU’LL ENJOY:HEALTHY WORK/LIFE BALANCE ON A TEAM THAT COLLABORATES WELL AND TRULY ENJOYS WORKING TOGETHER.ENVIRONMENT WHERE WE PROMOTE FROM WITHIN, CROSS-TRAIN AND PROVIDE ONGOING SKILL DEVELOPMENT.ROBUST BENEFITS PACKAGE INCLUDING GREAT HEALTH INSURANCE, HOLIDAY PAY, EMPLOYEE REFERRAL BONUSES, AND EVEN PET INSURANCE!RETIREMENT SAVINGS (401K) OPPORTUNITIESA HYBRID WORK POLICY AND AMPLE PAID TIME OFF (PTO)CONTINUING EDUCATION ASSISTANCE\nPROVISUR IS PROUD TO BE AN EQUAL OPPORTUNITY EMPLOYER - WE EMBRACE DIVERSITY AND WELCOME INDIVIDUALS FROM ALL WALKS OF LIFE. WE DO NOT DISCRIMINATE ON THE BASIS OF RACE, RELIGION, COLOR, NATIONAL ORIGIN, GENDER, SEXUAL ORIENTATION, AGE, MARITAL STATUS, VETERAN STATUS, OR DISABILITY STATUS.",
    "job_skill_set": [
      "network security",
      "Fortigate firewalls",
      "cybersecurity",
      "cloud security",
      "problem solving",
      "troubleshooting",
      "communication",
      "teamwork",
      "self-motivation",
      "solutions-oriented thinking",
      "continuous improvement",
      "CrowdStrike",
      "Active Directory",
      "Okta",
      "EDR solutions",
      "security policies",
      "security training"
    ],
    "short_keywords": [
      "active",
      "administrator",
      "cloud",
      "communication",
      "continuous",
      "crowdstrike",
      "cybersecurity",
      "directory",
      "edr",
      "firewalls",
      "fortigate",
      "improvement",
      "information",
      "informationtechnology",
      "network",
      "okta",
      "policies",
      "problem",
      "security",
      "selfmotivation",
      "solutions",
      "solutionsoriented",
      "solving",
      "teamwork",
      "technology",
      "thinking",
      "training",
      "troubleshooting"
    ]
  },
  {
    "job_id": "3904980941",
    "job_title": "Information Technology Technician",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "OUR CLIENT, ONE OF THE WORLD'S LARGEST PHARMACEUTICAL COMPANIES, IS ACTIVELY HIRING A WINDOWS LAB TECHNICIAN TO JOIN THEIR TEAM! THIS ROLE WILL BE ONSITE IN THEIR CAMBRIDGE, MA/FENWAY LAB ENVIRONMENT.\n***THIS IS A 6 MONTH W2 CONTRACT WITH BENEFITS***\nIN THIS ROLE, YOU WILL PROVIDE CRITICAL SUPPORT FOR THE LAB IT SERVICE TEAM. THEY ARE LOOKING FOR SOMEONE TO ADMINISTER AND ASSURE CONNECTIVITY OF THE CUSTOMER'S WINDOWS PLATFORM WHILE ALSO SUPPORTING THE OPERATING SYSTEM, DESKTOP HARDWARE, INSTRUMENT-CONTROLLED SOFTWARE, AND THE IMAGING OF COMPUTERS.\nRESPONSIBILITIESIMPLEMENT, MONITOR, AND PROVIDE TECHNICAL SUPPORT FOR THEIR CUSTOMER LABORATORY IT ENVIRONMENTSADMINISTER AND ASSURE CONNECTIVITY OF THE WINDOWS PLATFORM CREATE AND MAINTAIN A PHYSICAL INVENTORY OF LAB EQUIPMENT, PC'S, SOFTWARE, AND ANY OTHER INFORMATION SPECIFIED BY THE CLIENT MANAGE ONBOARDING, RETIREMENT, AND RELOCATION OF EQUIPMENTIMPLEMENT WINDOWS SECURITY INCLUDING USER/GROUP PERMISSIONS, FILE/FOLDER PERMISSIONS, GROUP POLICIES, ETC\nDESIRED SKILLS & EXPERIENCEBACHELOR'S DEGREE2+ YEARS OF TECHNICAL SUPPORT EXPERIENCE IN A WINDOWS ENVIRONMENTPRIOR EXPERIENCE WORKING IN THE LIFE SCIENCE/BIOTECH/HEALTH CARE INDUSTRYEXPERIENCE WORKING IN A RESEARCH LABORATORY ENVIRONMENT\nMOTION RECRUITMENT PARTNERS IS AN EQUAL OPPORTUNITY EMPLOYER, INCLUDING DISABILITY/VETS. ALL APPLICANTS MUST BE CURRENTLY AUTHORIZED TO WORK ON A FULL-TIME BASIS IN THE COUNTRY FOR WHICH THEY ARE APPLYING, AND NO SPONSORSHIP IS CURRENTLY AVAILABLE. EMPLOYMENT IS SUBJECT TO THE SUCCESSFUL COMPLETION OF A PRE-EMPLOYMENT SCREENING. ACCOMMODATION WILL BE PROVIDED IN ALL PARTS OF THE HIRING PROCESS AS REQUIRED UNDER MOTION RECRUITMENT EMPLOYMENT ACCOMMODATION POLICY. APPLICANTS NEED TO MAKE THEIR NEEDS KNOWN IN ADVANCE.",
    "job_skill_set": [
      "Physical Inventory Management",
      "Communication",
      "Problem Solving",
      "Teamwork",
      "Adaptability",
      "Windows Administration",
      "Technical Support",
      "Desktop Hardware Support",
      "Instrument-Controlled Software",
      "Imaging of Computers",
      "Windows Security",
      "User/Group Permissions Management",
      "Group Policies Management",
      "Attention to Detail"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "attention",
      "communication",
      "computers",
      "desktop",
      "detail",
      "group",
      "hardware",
      "imaging",
      "information",
      "informationtechnology",
      "instrumentcontrolled",
      "inventory",
      "management",
      "of",
      "permissions",
      "physical",
      "policies",
      "problem",
      "security",
      "software",
      "solving",
      "support",
      "teamwork",
      "technical",
      "technician",
      "technology",
      "to",
      "usergroup",
      "windows"
    ]
  },
  {
    "job_id": "3902808076",
    "job_title": "Information Technology Project Coordinator",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "PROJECT COORDINATOR\n$22.81 PR12 MONTHSONSITE/HYBRID - 1 DAY IN OFFICE (FRIDAY'S)LOCATION: MINNEAPOLIS MN\nJOB DETAILS AND REQUIREMENTS SECTIONEXPLAIN WHAT THE SCOPE OF THE WORK/PROJECT IS? PROJECT OVERVIEW, DELIVERABLES (WHAT IS THIS PERSON RESPONSIBLE FOR). THIS RESOURCE WILL BE RESPONSIBLE FOR HEAVY DATA ENTRY VIA SALESFORCE. ALSO RESPONSIBLE FOR PROCESSING REBATES THAT ARE COMING IN THROUGH PDF, ONLINE IN ADDITION TO PAPER. THIS ROLE WILL INCLUDE VERIFICATION OF PRODUCTS WHICH DOES COME WITH A HEAVY LEARNING CURVE. THIS RESOURCE WILL BE WORKING WITHIN TEAM OF 13. THE RESOURCE WILL BE WORKING FROM A SHARED QUEUE WITHIN SALESFORCE, WORKING FROM THE OLDEST DATE TO THE NEWEST. THIS RESOURCE WILL ALSO SUPPORT THE GREATER TEAM IN WORKING/CORRESPONDING USING A SHARED INBOX. SALESFORCE DASHBOARDS ARE RESPONSIBLE FOR TRACKING WORK/PRODUCTIVITY. WHAT DOES A TYPICAL DAY LOOK LIKE? RESOURCE WILL BE WORKING FROM A SHARED QUEUE WITHIN SALESFORCE TO PROCESS TO VERIFY PRODUCTS AND PROCESS REBATES ON THOSE PRODUCTS. RESOURCE WILL WORK WITH LARGER TEAM OF 13 TO COMPLETE WORK. THERE MAY BE SHORT TEAM MEETINGS AT THE BEGINNING ON THE WEEK TO DISCUSS WORK, PRIORITIES AND WHAT THE TEAM IS WORKING ON. WHAT IS THE SIZE OF THE GROUP THIS POSITION WILL BE SUPPORTING? WHO ARE SOME OF THE KEY PLAYERS THIS PERSON WILL BE WORKING WITH? 10-15. THE GREATER TEAM CONSISTS OF 2 SR SPECIALISTS; HOWEVER, THEY DON’T TYPICALLY PROCESS REBATES. WILL THIS RESOURCE SUPPORT INTERNAL (BUSINESS), OR EXTERNAL CUSTOMERS? THIS RESOURCE WILL ASSIST THE TEAM TO PROCESS REBATES FOR RESIDENTIAL CUSTOMERS; NO COMMERCIAL. WHAT ARE THE MAIN TECHNOLOGY APPLICATION/SOFTWARE SKILLS/EXPERIENCE THIS RESOURCE WILL BE REQUIRED TO POSSESS? EXPERIENCE WITH SALESFORCE IS A PLUS. PROFICIENCY WITH MICROSOFT OFFICE SUITE. RESOURCE WILL ALSO BE USING AN INTERNAL TOOL CALLED CRS, WHICH HOUSES USAGE DATA. DESCRIBE WORK ENVIRONMENT / TEAM CULTURE (SUPPORTIVE/COLLABORATIVE, TEAMWORK OR INDIVIDUAL CONTRIBUTOR)? THE WORK ENVIRONMENT IS HIGHLY COLLABORATIVE, HOWEVER, THIS RESOURCE WILL BE RESPONSIBLE FOR WORKING AS AN INDIVIDUAL CONTRIBUTOR AS WELL TO PROCESS WORK FROM THE SHARED QUEUE. WHAT IS THE RAMP UP TIME/PROCESS FOR THIS ROLE? ASIDE FROM HAVING THE REQUIRED SKILL SET, APPROXIMATELY HOW LONG WILL IT TAKE TO TRAIN ON XCEL’S PROCESS, PROCEDURES/POLICY? 1-3 MONTHS. WHAT ARE THE WORK HOURS/SHIFT (STANDARD, EVENING, FULL TIME/PART TIME, OT REQUIRED, ON-CALL FOR 24/7 OPERATION)? STANDARD HOURS WILL BE FLEXIBLE FROM 6 AND 6 ONCE THE RESOURCE IS PROFICIENT ENOUGH. TRAINING WILL BE CONDUCTED DURING STANDARD HOURS.",
    "job_skill_set": [
      "Microsoft Office Suite",
      "PDF Processing",
      "Teamwork",
      "Collaboration",
      "Communication",
      "Adaptability",
      "Problem Solving",
      "Salesforce",
      "Data Entry",
      "Internal Tool (CRS)"
    ],
    "short_keywords": [
      "adaptability",
      "collaboration",
      "communication",
      "coordinator",
      "crs",
      "data",
      "entry",
      "information",
      "informationtechnology",
      "internal",
      "microsoft",
      "office",
      "pdf",
      "problem",
      "processing",
      "project",
      "salesforce",
      "solving",
      "suite",
      "teamwork",
      "technology",
      "tool"
    ]
  },
  {
    "job_id": "3905291797",
    "job_title": "Information Technology Project Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "ENGINE BUILDS TECHNICAL TEAMS. WE ARE A SOLUTIONS AND PLACEMENT FIRM SHAPED BY DECADES OF INTERACTION WITH TECHNICAL PROFESSIONALS. OUR INSPIRATION IS CONTINUOUS LEARNING AND ENGAGEMENT WITH THE MARKETS WE SERVE, THE TALENT WE REPRESENT, AND THE TEAMS WE BUILD. OUR CONSULTING WORKFORCE IS ENCOURAGED TO ENJOY CAREER FULFILLMENT IN THE FORM OF CHALLENGING PROJECTS, SCHEDULE FLEXIBILITY, AND PAID TRAINING/CERTIFICATIONS. SUCCESSFUL OUTCOMES START AND FINISH WITH ENGINE.\nENGINE IS HIRING A PITTSBURGH-BASED PROJECT MANAGER WITH EXPERIENCE WORKING ON APPLICATION DEVELOPMENT PROJECTS IN AN AGILE ENVIRONMENT. HAVING PRIOR EXPOSURE TO FINANCIAL SERVICES IS A PLUS!\nTHE POSITION:MID-LEVEL PM (5-7 YEARS OF EXPERIENCE)DAY TO DAY INCLUDES WORKING CLOSELY WITH PROGRAM MANAGER/STAKEHOLDERS, RESOURCE ALLOCATION WITHIN PPM SOFTWARE, UPDATING SENIOR MANAGEMENT (STATUS REPORTING), REGULAR TOUCH POINTS WITH SCRUM TEAM ENSURING SPRINTS/AGILE FRAMEWORK ARE CARRIED OUT.WILL MANAGE APPLICATION DEVELOPMENT PROJECTS FOCUSED ON MODERNIZATION AND MOVING TO THE CLOUD.CANDIDATE WILL USE CONFLUENCE, JIRA, SHAREPOINT.\nSKILLS:WORK DIRECTLY WITH THE TEAM TO CREATE SPRINT PLANS THAT ALIGNS TO THE OVERALL PROJECT PLAN.FOLLOW THE COMPANIES SDLC PROCESSES TO ENSURE ALL ARTIFACTS ARE MAINTAINED.MANAGE PROJECT RISKS AND ISSUES ON A DAILY BASIS AND WORKED WITH THE STAKEHOLDER ON RISK MITIGATIONS AND MANAGEMENT.MANAGE THE PROJECT RESOURCES, BUDGET AND SCOPE OF THE RELEASES WITHIN THE PROJECT.MANAGE COMMUNICATIONS TO ALL STAKEHOLDERS AND WORK WITH SCRUM LEADS TO RESOLVE IMPEDIMENTS.MANAGE THE DEPENDENCIES AND ASSUMPTIONS TO CLOSURE.\nFOR MORE INFORMATION ON HOW ENGINE CAN IMPACT YOUR CAREER, PLEASE APPLY TODAY! NO C2C FOR THIS ROLE, PLEASE.",
    "job_skill_set": [
      "Application Development",
      "Project Management",
      "Risk Management",
      "Resource Allocation",
      "Cloud Technologies",
      "Communication",
      "Team Collaboration",
      "Problem Solving",
      "Stakeholder Management",
      "Adaptability",
      "Leadership",
      "Time Management",
      "Agile",
      "Confluence",
      "JIRA",
      "SharePoint",
      "SDLC",
      "Budget Management"
    ],
    "short_keywords": [
      "adaptability",
      "agile",
      "allocation",
      "application",
      "budget",
      "cloud",
      "collaboration",
      "communication",
      "confluence",
      "development",
      "information",
      "informationtechnology",
      "jira",
      "leadership",
      "management",
      "manager",
      "problem",
      "project",
      "resource",
      "risk",
      "sdlc",
      "sharepoint",
      "solving",
      "stakeholder",
      "team",
      "technologies",
      "technology",
      "time"
    ]
  },
  {
    "job_id": "3902931012",
    "job_title": "Senior Information Technology Project Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "REMOTE OPPORTUNITY\nTHE TALENT SOURCE IS PLEASED TO PARTNER WITH A GLOBAL ENTERPRISE CLIENT TO ENGAGE A SENIOR PROJECT MANAGER TO LEAD THE IMPLEMENTATION OF A SUITE OF CYBERSECURITY TOOLS.THIS ROLE REQUIRES A PROVEN PROJECT MANAGER WHO BRINGS TEN PLUS YEARS PROVEN EXPERIENCE DELIVERING PROJECTS WITHIN COMPLEX GLOBAL ENTERPRISE ENVIRONMENTS, LEADING MULTIDISCIPLINARY TEAMS AND EXTERNAL VENDOR PARTNERS.\nCERTIFICATIONS: PMP, APMP OR EQUIVALENT PREFERRED. BACHELORS DEGREE REQUIRED.\nSUCCESS IN THIS ROLE REQUIRES A DETAILED ORIENTATED PROFESSIONAL WHO DEMONSTRATES:STRONG COMMUNICATION, NEGOTIATION, ANALYTIC, AND CRITICAL THINKING SKILLS .PROVEN FACILITATION AND PRESENTATION SKILLS WITH THE ABILITY TO WORK COLLABORATIVELY. DEMONSTRATES CULTURAL ADAPTABILITY.VIRTUAL AND REMOTE TEAM MANAGEMENT ABILITY.INDEPENDENT, ACTION ORIENTATED, PROBLEM SOLVING BIAS.FLEXIBLE AND RESPONSIVE TO INPUT.\nSCOPE OF THE ROLE: RESPONSIBLE FOR FULL LIFE- CYCLE OF PROJECTS FROM INITIATION TO COMPLETION.PROJECT BUDGET, MULTIPLE PROJECTS OR MANAGE SMALL PROGRAMAPPLY IT PROJECT MANAGEMENT METHODOLOGY AND APPROPRIATE PROJECT MANAGEMENT FRAMEWORK FOR ALL PROJECTS (USING ESTABLISHED PROJECT STANDARDS). SUCCESSFULLY INITIATE, PLAN, EXECUTE AND CLOSE ALL PROJECT DELIVERABLES AS COMMITTED.\nAS A PROJECT MANAGEMENT CONSULTANT WITH THE TALENT SOURCE YOU WILL ENJOY A COMPETITIVE HOURLY RATE, HEALTH, DENTAL & VISION BENEFITS AND ELIGIBILITY TO PARTICIPATE IN OUR 401K PROGRAM WITH MATCH.PLEASE EXPRESS YOUR INTEREST ASAP AS INTERVIEWS ARE TAKING PLACE.",
    "job_skill_set": [
      "Communication",
      "Analytic Skills",
      "Critical Thinking",
      "Facilitation Skills",
      "Presentation Skills",
      "Collaboration",
      "Team Management",
      "Problem Solving",
      "Flexibility",
      "Responsiveness to Input",
      "Project Management",
      "Cybersecurity Tools Implementation",
      "PMP Certification",
      "APMP Certification",
      "Project Budget Management",
      "IT Project Management Methodology",
      "Project Standards Application",
      "Negotiation",
      "Cultural Adaptability"
    ],
    "short_keywords": [
      "adaptability",
      "analytic",
      "apmp",
      "application",
      "budget",
      "certification",
      "collaboration",
      "communication",
      "critical",
      "cultural",
      "cybersecurity",
      "facilitation",
      "flexibility",
      "implementation",
      "information",
      "informationtechnology",
      "input",
      "it",
      "management",
      "manager",
      "methodology",
      "negotiation",
      "pmp",
      "presentation",
      "problem",
      "project",
      "responsiveness",
      "senior",
      "skills",
      "solving",
      "standards",
      "team",
      "technology",
      "thinking",
      "to",
      "tools"
    ]
  },
  {
    "job_id": "3898173401",
    "job_title": "Information Technology Operations Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "HYBRID: 2-3 DAYS ONSITEDURATION: 3 YEAR LONG CONTRACTSTART: ASAP NO RELOCATION ACCEPTED \nREQUIRED SKILLS & EXPERIENCE\nTHE IDEAL CANDIDATE WILL HAVE AT LEAST FOUR YEARS OF PRIOR MANAGEMENT EXPERIENCE IN A RETAIN TECHNICAL CUSTOMER SUPPORT ENVIRONMENT, DESKTOP SUPPORT, SERVICE DESK AND TECHNICAL LEADERSHIP. DEMONSTRATED LEADERSHIP, ORAL, AND WRITTEN COMMUNICATION SKILLS, INCLUDING THE ABILITY TO INFLUENCE OTHER LEVELS OF MANAGEMENT.\n· THOROUGH KNOWLEDGE OF SUPPORT POLICIES AND PROCEDURES, A SOLID UNDERSTANDING OF GENERAL BUSINESS MANAGEMENT IS HIGHLY DESIRED. DEMONSTRATED ABILITY TO HANDLE DIFFICULT AND SENSITIVE SITUATIONS, ABILITY TO LEAD PROJECTS AND MOTIVATE OTHERS, AND PROVEN ORGANIZATIONAL AND PLANNING SKILLS REQUIRED.\n· TECHNICAL PROFICIENCY IN RELEVANT OPERATING SYSTEMS, APPLICATIONS, AND/OR LANGUAGES IS REQUIRED.\n· RELEVANT TECHNOLOGY:\nJOB DESCRIPTION\nTHE SERVICE DESK OPERATIONS IS RESPONSIBLE FOR MANAGING THE DAILY OPERATIONS OF THE RETAIL SERVICE DESK, MANAGING THE SERVICE DESK TEAM, REPRESENTING THE TEAM TO OTHER STAKEHOLDERS, AND HELPING TO ENSURE THE SERVICE DESK IS CONSTANTLY DEVELOPING AND IMPROVING. TO MEET THESE MANY DEMANDS THE RIGHT CANDIDATE FOR THIS POSITION SHOULD HAVE THE ABILITY TO BUILD A COHESIVE TEAM AND MANAGE PEOPLE EFFECTIVELY, UNDERSTAND THE STRATEGIC VISION OF THE SERVICE PROVIDED, AND BE ABLE TO SET LONG-TERM DIRECTION FOR THE TEAM. KNOWLEDGE OF BEST PRACTICES, AND ABILITY TO THINK CRITICALLY ABOUT SYSTEMS, PROCESSES, AND PROCEDURES WITH A COMPLETE UNDERSTANDING OF THE ORGANIZATION'S BUSINESSES AND NEEDS. WE ARE LOOKING FOR A LEADER THAT CAN DELIVER WHITE-GLOVE TECHNICAL SUPPORT TO ALL THE LUXURY CLIENT'S BOUTIQUES, STORES, AND CORPORATE OFFICE. AS AN IDEAL CANDIDATE, YOU ARE ADAPTABLE, PROACTIVE, THRIVES FROM PROBLEM-SOLVING, AND FOSTERS A HEALTHY AND PLEASANT ENVIRONMENT FOR THE TEAM AND ALL END USERS. WE ARE LOOKING FOR A TECH ENTHUSIAST, CUSTOMER-CENTRIC, AND CRITICAL THINKER",
    "job_skill_set": [
      "management experience",
      "technical customer support",
      "desktop support",
      "service desk",
      "technical leadership",
      "operating systems",
      "applications",
      "project management",
      "business management",
      "technical support",
      "leadership",
      "communication",
      "influencing",
      "organizational skills",
      "planning skills",
      "team building",
      "critical thinking",
      "adaptability",
      "problem-solving",
      "customer-centric"
    ],
    "short_keywords": [
      "adaptability",
      "applications",
      "building",
      "business",
      "communication",
      "critical",
      "customer",
      "customercentric",
      "desk",
      "desktop",
      "experience",
      "influencing",
      "information",
      "informationtechnology",
      "leadership",
      "management",
      "manager",
      "operating",
      "operations",
      "organizational",
      "planning",
      "problemsolving",
      "project",
      "service",
      "skills",
      "support",
      "systems",
      "team",
      "technical",
      "technology",
      "thinking"
    ]
  },
  {
    "job_id": "3891071402",
    "job_title": "Entry-level Information Technology (IT) Role",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "YEAR UP IS A ONE-YEAR OR LESS, INTENSIVE JOB TRAINING PROGRAM THAT PROVIDES YOUNG ADULTS WITH IN-CLASSROOM SKILL DEVELOPMENT, ACCESS TO INTERNSHIPS AND/OR JOB PLACEMENT SERVICES, AND PERSONALIZED COACHING AND MENTORSHIP. YEAR UP PARTICIPANTS ALSO RECEIVE AN EDUCATIONAL STIPEND.\n\nTHE PROGRAM COMBINES TECHNICAL AND PROFESSIONAL TRAINING WITH ACCESS TO INTERNSHIPS AND JOB PLACEMENT SUPPORT THROUGH OUR INDUSTRY-LEADING TALENT PLACEMENT FIRM YUPRO PLACEMENT. IF YOU RECEIVE AN INTERNSHIP, IT MAY BE AT HARVARD UNIVERSITY, WAYFAIR, SALESFORCE, OR WELLINGTON MANAGEMENT AMONG OTHER LEADING ORGANIZATIONS IN THE GREATER BOSTON AREA.\n\nARE YOU ELIGIBLE? YOU CAN APPLY TO YEAR UP IF YOU ARE:\n\n18-29 YEARS OLDA HIGH SCHOOL GRADUATE OR GED RECIPIENTELIGIBLE TO WORK IN THE U.S.AVAILABLE MONDAY-FRIDAY THROUGHOUT THE DURATION OF THE PROGRAMHIGHLY MOTIVATED TO LEARN TECHNICAL AND PROFESSIONAL SKILLSHAVE NOT OBTAINED A BACHELORʼS DEGREE\n\nWHAT WILL YOU GAIN? PROFESSIONAL BUSINESS AND COMMUNICATION SKILLS, INTERVIEWING AND NETWORKING SKILLS, RESUME BUILDING, ONGOING SUPPORT AND GUIDANCE TO HELP YOU LAUNCH YOUR CAREER. SOME COURSEWORK IS ELIGIBLE FOR COLLEGE CREDIT. DURING THE INTERNSHIP PHASE, YEAR UP STUDENTS EARN AN EDUCATIONAL STIPEND OF $525 PER WEEK.\n\nIN-DEPTH CLASSES INCLUDE:\n\nBANKING & CUSTOMER SUCCESSDATA ANALYTICSHELPDESK/DESKTOP SUPPORTINVESTMENT OPERATIONSPROJECT MANAGEMENT SUPPORT\n\nGET THE SKILLS AND OPPORTUNITY YOU NEED TO LAUNCH YOUR PROFESSIONAL CAREER. 80% OF YEAR UP GRADUATES ARE EMPLOYED AND/OR ENROLLED IN POSTSECONDARY EDUCATION WITHIN 4 MONTHS OF GRADUATION. EMPLOYED GRADUATES EARN AN AVERAGE STARTING SALARY OF FIFTY-TWO THOUSAND DOLLARS PER YEAR. PANDOLOGIC. KEYWORDS: IT ASSISTANT, LOCATION: BOSTON, MA\n\n02108",
    "job_skill_set": [
      "data analytics",
      "project management",
      "customer success",
      "communication",
      "networking",
      "motivation",
      "helpdesk support",
      "banking operations",
      "interviewing skills",
      "resume building"
    ],
    "short_keywords": [
      "analytics",
      "banking",
      "building",
      "communication",
      "customer",
      "data",
      "entrylevel",
      "helpdesk",
      "information",
      "informationtechnology",
      "interviewing",
      "it",
      "management",
      "motivation",
      "networking",
      "operations",
      "project",
      "resume",
      "role",
      "skills",
      "success",
      "support",
      "technology"
    ]
  },
  {
    "job_id": "3884438248",
    "job_title": " Information Technology Epic Beaker Application Analyst 2",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "INFORMATION TECHNOLOGY-EPIC BEAKER APPLICATION ANALYST 2 - HYBRID/REMOTE SUB SPECIALTY(S): EPIC SUPPORT , FACILITY NAME: SAMARITAN HEALTH SERVICES FACILITY ADDRESS: CORVALLIS, OR 97330PAY RATE $83/HROVERTIME PAY RATE $99.60/HRWEEKLY PAY RATE :-$3320NUMBER OF WEEKS: 26SHIFT INFORMATION: DAYS (0800-1630) NO WEEKENDSEMR USED: EPICGUARANTEED HOURS: 40OVERTIME START AFTER 40 HOURJOB DESCRIPTION:DEPARTMENT DESCRIPTIONINFORMATION SERVICES IS COMMITTED TO PROVIDING LEADERSHIP, SUPPORT AND COORDINATION OF TECHNOLOGY AT SAMARITAN HEALTH SERVICES. THE IS APPS DELIVERY AND OPS FUNCTION MANAGES THE OPERATIONS OF OUR EXISTING SERVICES AND IMPLEMENTS NEW TECHNOLOGY INTO THE ORGANIZATION ON BEHALF OF OUR BUSINESS CUSTOMERS. OUR TEAM INCLUDES THE 24/7 SERVICE DESK, APPLICATION OPERATIONS AND IMPLEMENTATION TEAMS.EXPERIENCE/EDUCATION/QUALIFICATIONS1. ONE (1) OF THE FOLLOWING REQUIRED:A. BACHELOR'S DEGREE (PREFERABLY IN A RELATED FIELD) OR EQUIVALENT WORK EXPERIENCE PLUS THREE (3) YEARS EXPERIENCE IN INFORMATION TECHNOLOGY AND/OR PROJECT MANAGEMENT.B. SIX (6) YEARS OF RELEVANT HEALTHCARE EXPERIENCE.2. ONE (1) EPIC CERTIFICATION/ACCREDITATION/PROFICIENCY REQUIRED. OBTAINING ADDITIONAL PROFICIENCIES, ACCREDITATIONS, OR CERTIFICATIONS RELATED TO ASSIGNED MODULES MAY BE REQUIRED BASED ON DEPARTMENT’S OPERATIONAL NEEDS AND AT MANAGER DISCRETION.\n3. EXPERIENCE IN A HEALTHCARE ENVIRONMENT PREFERRED.WE ARE LOOKING FOR CANDIDATES WHO TAKE INITIATIVE, ENJOY A TEAM ATMOSPHERE, WHO ARE ENGAGED AND READY TO SUPPLY GREAT CUSTOMER SERVICE WHILE TRIAGING AND RESOLVING INCIDENTS AND REQUESTS. PROJECT WORK WILL BE ASSIGNED AS NEEDED.\n\nEPICBEAKER CP CERTIFICATION REQUIRED; WITH EPIC BEAKER AP CERTIFICATIONPREFERRED. LAB OPERATIONS EXPERIENCE PREFERRED.",
    "job_skill_set": [
      "Information Technology",
      "Project Management",
      "Healthcare experience",
      "Application Operations",
      "Implementation",
      "Customer Service",
      "Teamwork",
      "Initiative",
      "Problem Solving",
      "Engagement",
      "Communication",
      "EPIC certification",
      "Lab Operations"
    ],
    "short_keywords": [
      "2",
      "analyst",
      "application",
      "beaker",
      "certification",
      "communication",
      "customer",
      "engagement",
      "epic",
      "experience",
      "healthcare",
      "implementation",
      "information",
      "informationtechnology",
      "initiative",
      "lab",
      "management",
      "operations",
      "problem",
      "project",
      "service",
      "solving",
      "teamwork",
      "technology"
    ]
  },
  {
    "job_id": "3904965070",
    "job_title": "Information Technology Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "IT MANAGER THE IT MANAGER WILL LEAD A SMALL TEAM RESPONSIBLE FOR PROVIDING END USER SUPPORT TO INTERNAL USERS AND VENDORS. THE IDEAL CANDIDATE WILL HAVE EXPERIENCE TROUBLESHOOTING VARIOUS HARDWARE AND SOFTWARE PROBLEMS. THEY SHOULD BE COMFORTABLE PROVIDING TECHNOLOGY SOLUTIONS TO EMPLOYEES AND WORKING CLOSELY WITH THIRD PARTY SOFTWARE COMPANIES TO ADOPT NEW TECHNOLOGIES AND EFFICIENTLY USE EXISTING ONES. THIS ROLE IS HYBRID 3 DAYS A WEEK IN OFFICE IN QUINCY, MA. \nRESPONSIBILITIESMANAGE TECHNOLOGIES AND PROVIDE ADMINISTRATIVE ASSISTANCE FOR VARIOUS SYSTEMSUNDERSTAND VARIOUS IT TROUBLESHOOTING AND PROVIDE TECHNICAL SUPPORTNEGOTIATE AND COMMUNICATE WITH THIRD-PARTY SOFTWARE PROVIDERS FOR NEW SOFTWARE'S AND TROUBLESHOOTINGA GOOD UNDERSTANDING OF PROPERTY AND CASUALTY INSURANCE AND INSURANCE RELATED TECHNOLOGY.KEEP THE IT DEPARTMENT, BUSINESS ANALYSTS, AND EXECUTIVES APPRISED OF THE STATUS OF PROJECTS, ASKING FOR SUPPORT AS NEEDED, WHILE BALANCING THE IT PROJECT LISTS WITH OTHER DEPARTMENTS’ LISTS.DEVELOP PROJECT PLANS AND MANAGE PROJECT THROUGH COMPLETION. FOLLOW PROJECT POST-MORTEMS TO IDENTIFY AREAS THAT WORKED WELL OR NEED IMPROVEMENT.SUPPORT VARIOUS DEPARTMENTS IN DEVELOPING PROTOTYPES OF SPECIFIED IDEAS AND IN WRITING FINAL SPECIFICATIONS.ASSIST OTHER IT MANAGEMENT WITH THE DEVELOPMENT OF STANDARDS AND PROCEDURES INCLUDING BUT NOT LIMITED TO CONTROLS, FLOWCHARTS, AND DOCUMENTATION.SERVE AS THE LIAISON BETWEEN THE IT DEPARTMENT AND THE BUSINESS ANALYSTS FOR SYSTEM INVESTIGATION REPORT REQUESTS.\nQUALIFICATIONS\nBACHELOR'S DEGREE IN COMPUTER SCIENCE OR RELEVANT FIELD5+ YEARS OF EXPERIENCE IN RELATED FIELD2 YEARS OF EXPERIENCE WITH INSURANCE RELATED TECHNOLOGIES2 YEARS AS A LEAD OR SUPERVISOR. STRONG TECHNICAL PROBLEM SOLVING AND COMMUNICATION SKILLS",
    "job_skill_set": [
      "troubleshooting",
      "technical support",
      "project management",
      "technology solutions",
      "system investigation",
      "documentation",
      "communication",
      "team leadership",
      "problem solving",
      "negotiation",
      "collaboration",
      "adaptability",
      "project planning",
      "administrative assistance",
      "insurance technology"
    ],
    "short_keywords": [
      "adaptability",
      "administrative",
      "assistance",
      "collaboration",
      "communication",
      "documentation",
      "information",
      "informationtechnology",
      "insurance",
      "investigation",
      "leadership",
      "management",
      "manager",
      "negotiation",
      "planning",
      "problem",
      "project",
      "solutions",
      "solving",
      "support",
      "system",
      "team",
      "technical",
      "technology",
      "troubleshooting"
    ]
  },
  {
    "job_id": "3884806586",
    "job_title": "Information Technology Project Coordinator",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOB DESCRIPTIONWE ARE MOVING TO S/4HANA AND RETIRING OUR LEGACY ECC, BW AND BPC SYSTEMS. THIS MIGRATION WILL ALSO ENABLE THE DELIVERY OF ENHANCED CAPABILITIES, WHILE STANDARDIZING AND SIMPLIFYING OUR LANDSCAPE. IN THIS ROLE, YOU WILL SUPPORT PROGRAM/PROJECT MANAGERS ON A LARGE MULTI-YEAR MIGRATION / TRANSFORMATION PROJECT CALLED RETIRE ECC WITHIN THE PROPEL PROGRAM AND REPORT INTO THE IT PORTFOLIO MANAGEMENT OFFICE (PMO).\nJOB RESPONSIBILITIESLOOKING FOR A HIGHLY MOTIVATED SELF-STARTER WHO CAN THRIVE UNDER GENERAL DIRECTION AND GUIDANCE. RESPONSIBLE FOR SUPPORTING ALL PROJECT MANAGEMENT AND COORDINATION ASPECTS OF ASSIGNED PROJECTS. COORDINATES AND SCHEDULES TECHNICAL, FUNCTIONAL, AND/OR EXTERNAL PROJECT TEAM RESOURCES. COLLABORATES WITH PROJECT MANAGERS, PROJECT LEADERS, AND PROJECT TEAM MEMBERS.MAINTAINS PROJECT PLANS AND SCHEDULES. SETS UP AND MAINTAINS DOCUMENTATION AND PROJECT ARTIFACTS. COORDINATES WORKSHOPS, MEETINGS, AND PROJECT ACTIVITIES. GATHERS AND REPORTS ON STATUS OF ACTIVITIES AND MILESTONES. ENSURES ADHERENCE TO QUALITY STANDARDS.EDUCATION• ASSOCIATES DEGREE OR EQUIVALENT EXPERIENCE IS REQUIRED\nEXPERIENCE• MINIMUM OF TWO (2) TO FIVE (5) YEARS OF PROGRESSIVE, RELEVANT INFORMATION TECHNOLOGY PROJECT COORDINATOR/ANALYST EXPERIENCE• HIGHLY PROFICIENT WITH SMARTSHEET (OR EQUIVALENT PROJECT MANAGEMENT TOOLS) AND MANAGEMENT AND TRACKING OF PROJECT SCHEDULES/ACTIVITIES IS REQUIRED• HIGHLY PROFICIENT IN POWERPOINT AND CREATION OF PRESENTATION MATERIALS IS REQUIRED• HIGHLY PROFICIENT IN EXCEL AND TRACKING OF PROJECT BUDGETS IS REQUIRED• EXPERIENCE WITH SAP PROJECTS AND OR FAMILIARITY WITH SAP IS PREFERREDQUALIFICATIONS• HIGHLY MOTIVATED SELF-STARTER WHO CAN THRIVE UNDER GENERAL DIRECTION AND GUIDANCE.• EXCELLENT COLLABORATION SKILLS IN WORKING TOGETHER WITH ALL MEMBERS OF THE TEAM• POSSESSES MID-LEVEL TECHNICAL PROJECT MANAGEMENT SKILLS• HAS SERVED IN A PROJECT COORDINATOR/ANALYST ROLE ON LARGE PROJECTS.• PROFICIENT IN EXECUTING A PROJECT MANAGEMENT METHODOLOGY, CONDUCTING SCHEDULE AND RESOURCE ANALYSIS, AND COORDINATING PROJECT ACTIVITIES FROM BEGINNING TO END (WITH GENERAL GUIDANCE AND DIRECTION)• STRONG ORAL AND WRITTEN COMMUNICATION SKILLS• PROFICIENT IN COMMUNICATING TECHNICAL TOPICS TO NON-TECHNICAL AUDIENCES• ACTS ON, AND DISPLAYS COMMITMENT TO, SELF-DEVELOPMENT, AND SHARES KNOWLEDGE PROACTIVELY WITH OTHERS• PROFICIENT IN SOLVING MODERATELY COMPLEX PROBLEMS AND TECHNICAL ISSUES• PROFICIENT IN PERFORMING MODERATELY COMPLEX ANALYSIS• DEMONSTRATES ABILITY TO IDENTIFY AND IMPLEMENT IMPROVEMENTS IN PROJECT MANAGEMENT METHODS• PROFICIENT IN DEMONSTRATING ABILITY TO WORK WITH HIGH LEVEL OF AUTONOMY• EXPERIENCE WITH WATERFALL AND AGILE PROJECT METHODOLOGIES• DEMONSTRATED PROFICIENCY IN PM TOOLS INCLUDING SMARTSHEET, MS PROJECT, MS OFFICE, SHAREPOINT, TEAMS, AND FORMS",
    "job_skill_set": [
      "Project Management Tools",
      "SharePoint",
      "Waterfall Methodology",
      "Collaboration",
      "Communication",
      "Problem Solving",
      "Analytical Skills",
      "Autonomy",
      "Knowledge Sharing",
      "Project Coordination",
      "Smartsheet",
      "Excel",
      "PowerPoint",
      "SAP",
      "MS Project",
      "Teams",
      "Forms",
      "Agile Methodology",
      "Self-Motivation",
      "Commitment to Self-Development"
    ],
    "short_keywords": [
      "agile",
      "analytical",
      "autonomy",
      "collaboration",
      "commitment",
      "communication",
      "coordination",
      "coordinator",
      "excel",
      "forms",
      "information",
      "informationtechnology",
      "knowledge",
      "management",
      "methodology",
      "ms",
      "powerpoint",
      "problem",
      "project",
      "sap",
      "selfdevelopment",
      "selfmotivation",
      "sharepoint",
      "sharing",
      "skills",
      "smartsheet",
      "solving",
      "teams",
      "technology",
      "to",
      "tools",
      "waterfall"
    ]
  },
  {
    "job_id": "3891072419",
    "job_title": "Information Technology Intern",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOIN OUR TEAM AS AN INTERN AT HIG, AN ESTEEMED INSURANCE BROKERAGE, AND EMBARK ON AN EXCITING JOURNEY TOWARD A REWARDING CAREER IN THE INDUSTRY. AS AN ENTRY-LEVEL POSITION, THIS ROLE OFFERS AN INVALUABLE OPPORTUNITY TO GAIN PRACTICAL EXPERIENCE AND EXPLORE VARIOUS ASPECTS OF OUR AGENCY FUNCTIONS.\nAS A GENERAL ASSISTANT, YOU'LL HANDLE DIVERSE TASKS THAT CONTRIBUTE TO THE SMOOTH OPERATION OF OUR ORGANIZATION. FROM ANSWERING HELP DESK CALLS, ASSISTING WITH IT TASKS, SETTING UP COMPUTERS, ETC., YOU'LL BE AN INTEGRAL PART OF OUR TEAM. \nAT HIG, WE BELIEVE IN FOSTERING A SUPPORTIVE LEARNING ENVIRONMENT. WE AIM TO EXPOSE INTERNS TO A REAL-WORLD PROFESSIONAL SETTING WHERE THEY CAN DEVELOP THEIR OWN PROFESSIONAL ACUMEN. OUR GOAL IS TO IGNITE YOUR PASSION FOR IT AND DEMONSTRATE ITS POTENTIAL AS A VIABLE AND FULFILLING CAREER PATH.IF YOU'RE A COLLEGE STUDENT SEEKING HANDS-ON EXPERIENCE, GROWTH, AND EXPLORATION, THIS INTERNSHIP IS THE PERFECT OPPORTUNITY FOR YOU. JOIN US AT HIG AND UNLOCK YOUR POTENTIAL IN THE DYNAMIC WORLD OF INSURANCE. \nAPPLY NOW TO SHAPE YOUR FUTURE!\nEDUCATION AND/OR EXPERIENCEPURSUING A BACHELOR'S DEGREE FROM A FOUR-YEAR COLLEGE OR UNIVERSITY; OR TWO TO THREE YEARS RELATED EXPERIENCE AND/OR TRAINING, OR EQUIVALENT COMBINATION OF EDUCATION AND EXPERIENCE.\nREASONING ABILITYABILITY TO APPLY COMMON SENSE UNDERSTANDING TO CARRY OUT DETAILED BUT UNINVOLVED INSTRUCTIONS.\nCOMPUTER SKILLSTO PERFORM THIS JOB SUCCESSFULLY, AN INDIVIDUAL SHOULD HAVE KNOWLEDGE OF MICROSOFT WINDOWS OPERATING SYSTEMS, MICROSOFT OFFICE PRODUCTS, MOBILE DEVICES (I.E., SMARTPHONES AND TABLETS), AND GENERAL COMPUTER HARDWARE AND PERIPHERAL KNOWLEDGE.\nCERTIFICATES, LICENSES, REGISTRATIONSMUST HAVE A VALID DRIVER'S LICENSE.",
    "job_skill_set": [
      "Computer Hardware",
      "Help Desk Support",
      "Problem Solving",
      "Communication",
      "Teamwork",
      "Adaptability",
      "Attention to Detail",
      "Reasoning Ability",
      "Microsoft Windows",
      "Microsoft Office",
      "Mobile Devices"
    ],
    "short_keywords": [
      "ability",
      "adaptability",
      "attention",
      "communication",
      "computer",
      "desk",
      "detail",
      "devices",
      "hardware",
      "help",
      "information",
      "informationtechnology",
      "intern",
      "microsoft",
      "mobile",
      "office",
      "problem",
      "reasoning",
      "solving",
      "support",
      "teamwork",
      "technology",
      "to",
      "windows"
    ]
  },
  {
    "job_id": "3902346349",
    "job_title": "Information Technology Operations Engineer",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "MUST HAVES:\n5+ YEARS OF EXPERIENCE WITHIN THE ITSM SPACE SPECIFICALLY HANDLING PRODUCTION READINESS ISSUES AND AREASHANDS ONE EXPERIENCE CREATING PRODUCTION READINESS REVIEWS (PRR) OR CHECKLISTS TO DOUBLE CHECK THINGS ARE CORRECTEXPERIENCE WORKING WITH DIFFERENT TEAMS TO ENSURE ENVIRONMENTAL READINESS FOR ANY APPLICATION OR PRODUCT RELEASESSTRONG KNOWLEDGE OF INCIDENT, CHANGE, PROBLEM, AND REQUEST LIFECYCLESSTRONG DOCUMENTATION EXPERIENCE INCLUDING CREATING RUNBOOKS, KNOWLEDGEBASE ARTICLES, ETC. PLUSSES:\nEXPERIENCE IN THE FINTECH SPACE OR BANKING SPACEFAMILIARITY WITH JIRA INCLUDING ADMINISTRATION OF THE VARIOUS MODULES AND PLATFORMS LIKE SERVICE MANAGEMENT, CONFLUENCE, ETC.DAY TO DAY:\nA CLIENT OF INSIGHT GLOBAL IS LOOKING FOR AN IT OPERATIONS ENGINEER TO JOIN THEIR GROWING ORGANIZATION. THIS PERSON WILL BE WORKING WITH VARIOUS TEAMS TO ENSURE THAT THE STANDARDS AND PROCESSES FOR THE ITSM ENVIRONMENT ARE READY TO HANDLE ANY AND ALL RELEASES. ADDITIONALLY, THIS PERSON WILL BE THEN DOING HEAVY DOCUMENTATION OF VARIOUS PROCESS AND PROCEDURES INCLUDING CREATING RUNBOOKS, KNOWLEDGEBASE ARTICLES, ETC. TO ENSURE CONSISTENCY. THIS PERSON WILL SERVE AS THE LIAISON BETWEEN IT OPERATION AND OTHER BUSINESS UNITS TO IDENTIFY PAIN POINTS AND OPPORTUNITIES FOR EFFICIENCY. THIS PERSON WILL BE DOUBLE CHECKING EVERYTHING IS ORDER AND RAISING THEIR HAND WHEN THINGS ARE NOT SET UP PROPERLY. THIS PERSON WILL ALSO HELP OPTIMIZE THE ITSM PROCESSES OVERALL AND HELP IMPLEMENT ITIL STANDARDS ACROSS THE DIFFERENT DISCIPLINES.",
    "job_skill_set": [
      "Request Management",
      "Documentation",
      "Collaboration",
      "Communication",
      "Attention to Detail",
      "Problem Solving",
      "Efficiency Optimization",
      "Liaison Skills",
      "ITSM",
      "Production Readiness Reviews (PRR)",
      "Incident Management",
      "Change Management",
      "Problem Management",
      "Runbooks",
      "Knowledgebase Articles",
      "JIRA",
      "ITIL Standards"
    ],
    "short_keywords": [
      "articles",
      "attention",
      "change",
      "collaboration",
      "communication",
      "detail",
      "documentation",
      "efficiency",
      "engineer",
      "incident",
      "information",
      "informationtechnology",
      "itil",
      "itsm",
      "jira",
      "knowledgebase",
      "liaison",
      "management",
      "operations",
      "optimization",
      "problem",
      "production",
      "prr",
      "readiness",
      "request",
      "reviews",
      "runbooks",
      "skills",
      "solving",
      "standards",
      "technology",
      "to"
    ]
  },
  {
    "job_id": "3905228029",
    "job_title": "Healthcare Information Technology Consultant",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "EXPERIENCE, ATTRIBUTES, AND EDUCATION REQUIREMENTS:A MINIMUM OF THREE (3) YEARS MANAGEMENT EXPERIENCE IN IT, MANAGING VENDOR IMPLEMENTATIONS, CLIENT INTEGRATIONS OR DEVELOPMENT PROJECTS.EXPERIENCE IN A HEALTHCARE, HIPAA COMPLIANT ENVIRONMENT.DEADLINE ORIENTED WORK ETHIC WITH SUPERIOR MANAGEMENT AND ORGANIZATIONAL SKILLS.ABILITY TO WORK ACROSS THE ENTIRE ORGANIZATION AT ALL LEVELS AND TO MOTIVATE OTHERS TO ACCOMPLISH COMPLIANCE AND SECURITY RELATED GOALS.ABILITY TO LEARN AND UNDERSTAND OUR TECHNICAL ENVIRONMENT AND APPLY PROCESSES TO MITIGATE RISK.SUPPORT THE VENDOR RELATIONSHIPS FOR SYSTEMS, ENSURING THAT SYSTEM ISSUES ARE COMMUNICATED IN AN ACCURATE, COMPLETE AND TIMELY MANNER.ADEPT AT NEGOTIATING ISSUES AND RESOLVING PROBLEMS.ABILITY TO DEVELOP NEW PROCESSES AND CONTROLS AND/OR ADJUST THE PROCESS AND PRODUCTS AS SITUATION DICTATES.SELF-STARTER, ABLE TO WORK INDEPENDENTLY DIRECTLY WITH CLIENTS AND IN TEAMS.STRONG TECHNICAL SKILLS IN A VARIETY OF APPLICATIONS AND WEB TOOLS.BACHELOR’S DEGREE REQUIRED; COMPUTER SCIENCE, INFORMATION TECHNOLOGY PREFERRED.MINIMUM OF 5-8 YEARS OF TOTAL WORK-RELATED EXPERIENCE",
    "job_skill_set": [
      "IT Management",
      "Vendor Implementations",
      "Client Integrations",
      "Development Projects",
      "Technical Skills",
      "Process Development",
      "Risk Mitigation",
      "Web Tools",
      "Organizational Skills",
      "Deadline Orientation",
      "Motivational Skills",
      "Problem Solving",
      "Negotiation Skills",
      "Self-Starter",
      "Teamwork",
      "Communication",
      "HIPAA Compliance"
    ],
    "short_keywords": [
      "client",
      "communication",
      "compliance",
      "consultant",
      "deadline",
      "development",
      "healthcare",
      "hipaa",
      "implementations",
      "information",
      "informationtechnology",
      "integrations",
      "it",
      "management",
      "mitigation",
      "motivational",
      "negotiation",
      "organizational",
      "orientation",
      "problem",
      "process",
      "projects",
      "risk",
      "selfstarter",
      "skills",
      "solving",
      "teamwork",
      "technical",
      "technology",
      "tools",
      "vendor",
      "web"
    ]
  },
  {
    "job_id": "3884440568",
    "job_title": "Hybrid - Data & Analytics Manager (Information Technology Manager 1)",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "ABOUT US\n\nTHE MISSION OF THE OHIO DEPARTMENT OF MENTAL HEALTH AND ADDICTION SERVICES (OHIOMHAS) IS TO PROVIDE STATEWIDE LEADERSHIP OF A HIGH-QUALITY MENTAL HEALTH AND ADDICTION PREVENTION, TREATMENT AND RECOVERY SYSTEM THAT IS EFFECTIVE AND VALUED BY ALL OHIOANS.\n\nOHIOMHAS VALUES\n\nCONTRIBUTE AND COLLABORATESERVE COMPASSIONATELYDELIVER QUALITYBE ACCOUNTABLE\n\nAT OHIOMHAS WE STRIVE TO ATTRACT AND SUSTAIN A DIVERSE WORKFORCE BY RECRUITING, HIRING, DEVELOPING, AND RETAINING HIGH-PERFORMING EMPLOYEES WHO WORK COLLABORATIVELY TO BALANCE EFFORTS TOWARD PROVIDING PREVENTION AND RECOVERY SUPPORTS AND FOSTERING INCLUSION THAT INSPIRES INNOVATION, ENCOURAGES RESPECT AND PROMOTES UNLIMITED SUCCESS.\n\nOHIOMHAS INFORMATION SERVICES IS THE TECHNOLOGY ARM OF THE THIRD LARGEST CABINET LEVEL AGENCY IN THE STATE OF OHIO. WE SUPPORT MORE THAN 3,200 EMPLOYEES WITHIN SIX REGIONAL INPATIENT BEHAVIORAL HEALTH HOSPITALS, OHIO PHARMACY SERVICES, AND CENTRAL OFFICE. WE DEVELOP AND SUPPORT TECHNOLOGY FOR SEVERAL CRITICAL BUSINESS SOLUTIONS USED BY THE AGENCY AS WELL AS BY COUNTY AND LOCAL BEHAVIORAL HEALTH CARE PROVIDERS ACROSS THE STATE.\n\nROLE OVERVIEW\n\nAS A DATA & ANALYTICS MANAGER (INFORMATION TECHNOLOGY MANAGER 1) [PRIMARY TECHNOLOGY: SQL] AT OHIOMHAS, MANY OPPORTUNITIES ARE OFFERED TO IMPACT FAMILY, FRIENDS, AND THE RESIDENTS OF THE STATE OF OHIO. WE ARE A CLOSE-KNIT COMMUNITY OF IT STAFF AND DEVELOP APPLICATIONS WHICH ALLOW MENTAL HEALTH AND ADDICTION PROVIDERS TO SERVE OUR COMMUNITY IN NEED. OUR APPLICATIONS SUPPORT, REGULATE, FUND, AND COLLECT DATA TO ALLOW OUR ORGANIZATION THE ABILITY TO RESPOND TO THOSE IN CRISIS AS WELL AS THOSE NEEDING CONTINUITY OF CARE.\n\nAT OHIOMHAS, OUR IT STAFF IS MOTIVATED BY THE AGENCY'S MISSION, AND WE ARE ACCEPTING APPLICATIONS FOR ONE INFORMATION TECHNOLOGY MANAGER 1 POSITION WITHIN THE OFFICE OF INFORMATION TECHNOLOGY, HEADQUARTERED AT THE JAMES RHODES STATE OFFICE TOWER, 30 EAST BROAD STREET, 33RD FLOOR, COLUMBUS, OHIO 43215.\n\nOUR OFFICE OF INFORMATION SERVICES HAS ACCESS TO\n\nIN-DEPTH RESEARCH REPORTS.TAILORED IT ARCHITECTURE RECOMMENDATIONS.BEST PRACTICES GUIDANCE TO SUCCESSFULLY IMPLEMENT TECHNOLOGY.PERSPECTIVES OF HOW OTHER IT ORGANIZATIONS ARE DEPLOYING AND MANAGING NEW TECHNOLOGIES.REUSABLE TEMPLATES FOR INTERNAL ARCHITECTURE AND DOCUMENTATION.\n\nWHAT YOU'LL DO\n\nRESPONSIBILITIES INCLUDE BUT ARE NOT LIMITED TO:\n\nMANAGE A TEAM OF DATA BASE ADMINISTRATORS AND DATA AND ANALYTICS RESOURCES RESPONSIBLE FOR THE LEADERSHIP AND DELIVERY OF DATA SOLUTIONS FOR THE ORGANIZATION.SERVE IN A LEADERSHIP AND ADVISORY CAPACITY FOR THE GOVERNANCE OF DATA AND FULLY INTEGRATE THE GOVERNANCE AND UTILIZATION OF INFORMATION AS AN ASSET.IMPLEMENT STRATEGIES THAT ALLOW EASY ACCESS FOR TRADITIONAL EXTRACTS AS WELL AS DATA VISUALIZATION.BUILD DATABASE STRUCTURES, ANALYSIS, EXTRACT, AND MINING OF INFORMATION TO BE USED IN TRADITIONAL EXTRACTS AS WELL AS DATA VISUALIZATION TOOLS.ALIGN DATA WITH THE DEPARTMENTS BUSINESS METRICS WHICH WILL BE USED AS AN OVERALL DELIVERY CAPABILITY FOR THE AGENCY.SERVE AS A KEY LEADER IN THE MATURITY MODEL OF OHIOMHAS DATA GOVERNANCE STRUCTURE AND WORK WITH THE IT BUSINESS ARCHITECT TO DEFINE AND DELIVER AN ARCHITECTURE AND REFERENCE MODEL USED TO UNDERSTAND THE DATA LANDSCAPE AND MAKE DECISIONS AROUND DATA MOVING FORWARD.PROVIDE RECOMMENDATIONS AS A PART OF THE DATA GOVERNANCE WORKGROUPS RESPONSIBLE FOR INTAKE, DATA CURATION, DEFINITION, PRIORITIZATION, AND APPROVAL OF DATA REQUESTS.PROVIDE GUIDANCE TO THE TEAM ON USING DATA TO CREATE MEANINGFUL BUSINESS INSIGHTS OUT OF CLIENT, TRANSACTIONAL, AND OTHER BEHAVIORAL DATA.BUILD RELATIONSHIPS AND COMMUNICATE REGULARLY WITH BUSINESS.CREATE NOVEL SOLUTIONS WHEN ANALYZING DATA.APTITUDE FOR MOVING BEYOND THE SIMPLE ASK AND SURFACE THE UNDERLYING \"WHY.\"\n\nCURRENTLY TELEWORKING UP TO 90% OF THE TIME, SUBJECT TO CHANGE.\n\nWHAT’S IN IT FOR YOU\n\nAT THE STATE OF OHIO, WE TAKE CARE OF THE TEAM THAT CARES FOR OHIOANS. WE PROVIDE A VARIETY OF QUALITY, COMPETITIVE BENEFITS TO ELIGIBLE FULL-TIME AND PART-TIME EMPLOYEES. FOR A LIST OF ALL THE STATE OF OHIO BENEFITS, VISIT OUR TOTAL REWARDS WEBSITE! OUR BENEFITS PACKAGE INCLUDES:\n\nMEDICAL COVERAGE\n\nQUALITY, AFFORDABLE, AND COMPETITIVE MEDICAL BENEFITS ARE OFFERED THROUGH THE AVAILABLE OHIO MED PLANS. \n\nDENTAL, VISION AND BASIC LIFE INSURANCE\n\nDENTAL, VISION, AND BASIC LIFE INSURANCE PREMIUMS ARE FREE AFTER COMPLETED ELIGIBILITY PERIOD. LENGTH OF ELIGIBILITY PERIOD IS DEPENDENT ON UNION REPRESENTATION.\n\nTIME AWAY FROM WORK AND WORK/LIFE BALANCE\n\nPAID TIME OFF, INCLUDING VACATION, PERSONAL, AND SICK LEAVE 11 PAID HOLIDAYS PER YEARCHILDBIRTH/ADOPTION LEAVE\n\nEMPLOYEE DEVELOPMENT FUNDS\n\nTHE STATE OF OHIO OFFERS A VARIETY OF EDUCATIONAL AND PROFESSIONAL DEVELOPMENT FUNDING THAT VARIES BASED ON WHETHER YOU ARE A UNION-EXEMPT EMPLOYEE OR A UNION-REPRESENTED EMPLOYEE.\n\nOHIO PUBLIC EMPLOYEES RETIREMENT SYSTEM\n\nOPERS IS THE RETIREMENT SYSTEM FOR STATE OF OHIO EMPLOYEES. THE EMPLOYEE CONTRIBUTES 10% OF THEIR SALARY TOWARDS THEIR RETIREMENT. THE EMPLOYER CONTRIBUTES AN AMOUNT EQUAL TO 14% OF THE EMPLOYEE’S SALARY. VISIT THE OPERS WEBSITE FOR MORE INFORMATION.\n\nDEFERRED COMPENSATION\n\nTHE OHIO DEFERRED COMPENSATION PROGRAM IS A 457(B) VOLUNTARY RETIREMENT SAVINGS PLAN. VISIT THE OHIO DEFERRED COMPENSATION WEBSITE FOR MORE INFORMATION.\n\nTHE FOLLOWING ARE THE MINIMUM QUALIFICATIONS FOR THIS POSITION. FOR FURTHER CONSIDERATION, APPLICANTS MUST CLEARLY IDENTIFY HOW QUALIFICATIONS ARE MET WITHIN THE EDUCATION AND/OR EXPERIENCE SECTIONS OF THE APPLICATION.\n\nALTERNATIVE 1\n\nTHE IDEAL CANDIDATE, AT MINIMUM, MUST HAVE THE FOLLOWING:\n\n8 1/2 YEARS (102 MOS.) EXP. COMMENSURATE WITH JOB DUTIES TO BE PERFORMED & KNOWLEDGES & SKILLS REQUIRED AS OUTLINED IN APPROVED POSITION DESCRIPTION ON FILE FOR POSITION TO BE FILLED AS ADVERTISED IN JOB POSTING; 18 MONTHS EXP. IN PERFORMING PROJECT MANAGEMENT FUNCTIONS AS DEFINED IN SERIES PURPOSE.\n\nALTERNATIVE 2 \n\nCOMPLETION OF UNDERGRADUATE CORE COURSEWORK IN COMPUTER SCIENCE, OR COMPLETION OF UNDERGRADUATE CORE COURSEWORK IN ANY ACADEMIC MAJOR WHICH INCLUDED AT LEAST ONE COURSE IN EACH OF THE FOLLOWING:ADVANCED-LEVEL COMPUTER PROGRAMMING LANGUAGE (FOR EXAMPLE, COBOL, DELPHI, JAVA, POWERBUILDER, VISUAL BASIC, PL 1, SAS PCS, PACBASE, FULL VISUAL SUITE, DESIGNER 2000, DEVELOPER 2000, C, C++, VISUAL C, ECL, OR VISUAL STUDIO), LOGIC-BASED MATHEMATICS, DATA BASE CONCEPTS (FOR EXAMPLE, ORACLE, MICROSOFT ACCESS, PARADOX, SYBASE, IMS DB, DB2, CACHE, DMS, OR RDMS), COMPUTER SYSTEMS ANALYSIS & DESIGN, & BASIC DATA PROCESSING CONCEPTS; ADDITIONAL 6 1/2 YEARS (78 MOS.) EXP. COMMENSURATE WITH JOB DUTIES TO BE PERFORMED & KNOWLEDGES & SKILLS REQUIRED AS OUTLINED IN APPROVED POSITION DESCRIPTION ON FILE FOR POSITION TO BE FILLED AS ADVERTISED IN JOB POSTING.; 18 MOS. EXP. IN PERFORMING PROJECT MANAGEMENT FUNCTIONS AS DEFINED IN SERIES PURPOSE. \nALTERNATIVE 3\n\n12 MOS. EXP. AS INFORMATION TECHNOLOGY SUPERVISOR 3, 64119, OR EQUIVALENT.\n\nALTERNATIVE 4 \n\nOR IN OFFICES OF STATEWIDE INFORMATION TECHNOLOGY POLICY & PLANNING, POSITIONS REQUIRE COMPLETION OF UNDERGRADUATE CORE COURSEWORK IN COMPUTER SCIENCE, OR COMPLETION OF UNDERGRADUATE CORE COURSEWORK IN ANY ACADEMIC MAJOR WHICH INCLUDED AT LEAST ONE COURSE IN EACH OF THE FOLLOWING:ADVANCED-LEVEL COMPUTER PROGRAMMING LANGUAGE (FOR EXAMPLE, COBOL, DELPHI, JAVA, POWERBUILDER, VISUAL BASIC, PL 1, SAS PCS, PACBASE, FULL VISUAL SUITE, DESIGNER 2000, DEVELOPER 2000, C, C++, VISUAL C, ECL, OR VISUAL STUDIO), LOGIC-BASED MATHEMATICS, DATA BASE CONCEPTS (FOR EXAMPLE, ORACLE, MICROSOFT ACCESS, PARADOX, SYBASE, IMS DB, DB2, CACHE, DMS, OR RDMS), COMPUTER SYSTEMS ANALYSIS & DESIGN, & BASIC DATA PROCESSING CONCEPTS; 3 YRS. EXP. IN UTILIZING WORD PROCESSING SOFTWARE; 3 YRS. EXP. IN UTILIZING INTERNET BROWSER(S) FOR RESEARCH; 54 MOS. EXP. WHICH INCLUDED FOLLOWING: KNOWLEDGE OF INFORMATION TECHNOLOGY ARCHITECTURE COMPONENTS, DEVELOPING INFORMATION TECHNOLOGY STRATEGIC PLANS, PREPARING & MAKING PRESENTATIONS/PUBLIC SPEAKING, WRITING INFORMATION TECHNOLOGY RELATED POLICY & PROCEDURES, PREPARING & MONITORING BUDGET, PROVIDING COST & RESOURCES ESTIMATES, & CONTRACT MANAGEMENT; 2 YRS. EXP. IN UTILIZING E-MAIL SYSTEM; 18 MOS. EXP. IN PROJECT MANAGEMENT OR LEAD ROLE ON INFORMATION TECHNOLOGY PROJECT;12 MOS. EXP. IN UTILIZING SPREADSHEET SOFTWARE; 12 MOS. EXP. AS INFORMATION TECHNOLOGY SUPERVISOR 3, 64119, OR EQUIVALENT.\nALTERNATIVE 5\n\nEQUIVALENT OF MINIMUM CLASS QUALIFICATIONS FOR EMPLOYMENT NOTED ABOVE.\n\nJOB SKILLS: INFORMATION TECHNOLOGY\n\nTECHNICAL SKILLS: INFORMATION TECHNOLOGY\n\nPROFESSIONAL SKILLS: CUSTOMER FOCUS, DEVELOPING OTHERS, WRITTEN COMMUNICATION\n\nPRIMARY LOCATION\n\nUNITED STATES OF AMERICA-OHIO-FRANKLIN COUNTY-COLUMBUS\n\nWORK LOCATIONS\n\nJAMES A RHODES OFFICE TOWER 33\n\nORGANIZATION\n\nMENTAL HEALTH & ADDICTION SERVICES\n\nCLASSIFIED INDICATOR\n\nUNCLASSIFIED\n\nBARGAINING UNIT / EXEMPT\n\nEXEMPT\n\nSCHEDULE\n\nFULL-TIME\n\nWORK HOURS\n\nMON. - FRI., FIRST SHIFT\n\nCOMPENSATION\n\n$43.29 - $61.89 PER HOUR\n\nUNPOSTING DATE\n\nAPR 15, 2024, 10:59:00 PM\n\nPRIMARY JOB SKILL\n\nINFORMATION TECHNOLOGY\n\nTECHNICAL SKILLS\n\nINFORMATION TECHNOLOGY\n\nPROFESSIONAL SKILLS\n\nCUSTOMER FOCUS, DEVELOPING OTHERS, WRITTEN COMMUNICATION\n\nPRIMARY TECHNOLOGY\n\nSQL\n\nAGENCY CONTACT NAME\n\nVICKI COX, HUMAN CAPITAL MANAGEMENT SENIOR ANALYST\n\nAGENCY CONTACT INFORMATION\n\nVICKI.COX@MHA.OHIO.GOV",
    "job_skill_set": [
      "Project Management",
      "Leadership",
      "Communication",
      "Collaboration",
      "Problem Solving",
      "Customer Focus",
      "Relationship Building",
      "Critical Thinking",
      "SQL",
      "Data Governance",
      "Data Visualization",
      "Database Management",
      "Data Analysis",
      "Information Technology Architecture",
      "Data Mining",
      "Business Metrics Alignment",
      "Data Curation",
      "Data Extraction",
      "Developing Others",
      "Written Communication",
      "Innovation"
    ],
    "short_keywords": [
      "1",
      "alignment",
      "analysis",
      "analytics",
      "architecture",
      "building",
      "business",
      "collaboration",
      "communication",
      "critical",
      "curation",
      "customer",
      "data",
      "database",
      "developing",
      "extraction",
      "focus",
      "governance",
      "hybrid",
      "information",
      "informationtechnology",
      "innovation",
      "leadership",
      "management",
      "manager",
      "metrics",
      "mining",
      "others",
      "problem",
      "project",
      "relationship",
      "solving",
      "sql",
      "technology",
      "thinking",
      "visualization",
      "written"
    ]
  },
  {
    "job_id": "3905834461",
    "job_title": "Information Technology Risk Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "ROLE: SENIOR IT RISK MANAGER LOCATION: IRVING, TX **MUST WORK ONSITE 4 DAYS A WEEK**DIRECT HIRE\nRESPONSIBILITIES:OVERSIGHT OF IT OPERATIONAL FUNCTIONS IN THE ENTERPRISE APPLICATION SERVICES, INCLUDING AUTOMATION SOLUTIONS, INTEGRATION SOLUTIONS, DEVELOPMENT ARCHITECTURE AND COMMON SERVICES.OVERSIGHT OF DATA MANAGEMENT AND DATA GOVERNANCE, INCLUDING DATA RETENTION, DATA ANALYTICS, ETC.PERFORM REVIEWS OF RELEVANT CONTROLS AND RISKS FOR FIRST LINE, AS WELL AS RCSA.PREPARE REGULAR STATUS REPORTING FOR AREAS OF RISK OVERSIGHT.PERFORM TARGETED ASSESSMENTS FOR RELEVANT 1LOD FUNCTIONS. THIS WOULD LEVERAGE INDUSTRY FRAMEWORKS (NIST, ITIL, COBIT, ETC.), AND RELEVANT REGULATIONS TO DEVELOP A SECOND LINE OPINION REGARDING THE OVERALL EFFECTIVENESS OF ASSESSED FIRST LINE FUNCTIONS.REVIEW RELEVANT REGULATORY REQUIREMENTS FOR FIRST LINE TECHNOLOGY AND SECURITY FUNCTIONS.RISK IDENTIFICATION AND REPORTING FOR 1LOD FUNCTIONS.KRI DEVELOPMENT FOR RELEVANT 1LOD FUNCTIONS.MANAGING ISSUES FOR RELEVANT 1LOD FUNCTIONS.SUBJECT MATTER EXPERT FOR 2LOD CONTROLS TESTING.REVIEW AND CHALLENGE FIRST LINE POLICIES, STANDARDS, AND REGULATORY PACKAGES AS APPLICABLE.\nREQUIRED SKILLS: KNOWLEDGE OF TECHNOLOGY AND INFORMATION SECURITY CORE FUNCTIONS AND PRINCIPALS – SPECIFICALLY INDUSTRY BEST PRACTICES AND TECHNOLOGY TRENDS.MUST HAVE STRONG DATA RISK MANAGEMENT SKILLS AND EXPERIENCE.KNOWLEDGE OF OPERATIONAL RISK, INCLUDING RISK IDENTIFICATION, RISK MITIGATION AND RISK REPORTINGDEEP KNOWLEDGE OF APPLICABLE REGULATIONS FOR TECHNOLOGY AND CYBERSECURITY AND THE ABILITY TO EFFECTIVELY GUIDE 1LOD IN HOW TO MATURE THEIR PROGRAM TO ALIGN WITH REGULATORY GUIDANCEABILITY TO INFLUENCE WITHOUT DIRECT AUTHORITY IN THIS ROLE IS CRITICAL FOR SUCCESS. THE CANDIDATE MUST BE ABLE TO ESTABLISH GOOD WORKING RELATIONSHIPS AND CREDIBILITY ACROSS THE THREE LINES OF DEFENSE.THE CANDIDATE SHOULD BE ABLE TO COMMUNICATE THEIR PERSPECTIVE EFFECTIVELY AND CLEARLY, INCLUDING TRANSLATING TECHNICAL RISKS TO ANYONE IN THE COMPANY.THE CANDIDATE MUST BE ABLE TO ESTABLISH CREDIBILITY WITH THEIR 1LOD AND BCT PARTNERS TO EFFECTIVELY PROVIDE RISK OVERSIGHT TO TECHNOLOGY AND INFORMATION SECURITY TEAMS.",
    "job_skill_set": [
      "Data Analytics",
      "Influencing Skills",
      "Communication Skills",
      "Relationship Building",
      "Credibility Establishment",
      "Collaboration",
      "Problem Solving",
      "Data Risk Management",
      "Operational Risk Management",
      "Regulatory Compliance",
      "Data Governance",
      "Risk Identification",
      "Risk Reporting",
      "NIST Framework",
      "ITIL Framework",
      "COBIT Framework",
      "Automation Solutions",
      "Integration Solutions",
      "Development Architecture",
      "Technology Trends",
      "Information Security Principles"
    ],
    "short_keywords": [
      "analytics",
      "architecture",
      "automation",
      "building",
      "cobit",
      "collaboration",
      "communication",
      "compliance",
      "credibility",
      "data",
      "development",
      "establishment",
      "framework",
      "governance",
      "identification",
      "influencing",
      "information",
      "informationtechnology",
      "integration",
      "itil",
      "management",
      "manager",
      "nist",
      "operational",
      "principles",
      "problem",
      "regulatory",
      "relationship",
      "reporting",
      "risk",
      "security",
      "skills",
      "solutions",
      "solving",
      "technology",
      "trends"
    ]
  },
  {
    "job_id": "3905237946",
    "job_title": "Information Technology Engineer",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "IT ENGINEER - BOCA RATON, FL - ONSITE \nSUMMARY:THE IT ENGINEER WILL BE RESPONSIBLE FOR MANAGING AND PROVIDING DIRECT HANDS-ON SUPPORT TO ALL OF OUR LOCATIONS. THE INDIVIDUAL WILL MANAGE AND SUPPORT NETWORK, SECURITY, AND VIRTUAL SERVER INFRASTRUCTURE USING BEST-OF-BREED TECHNOLOGIES. WE ARE LOOKING FOR AN INDIVIDUAL WHO SHOWS A TRACK RECORD OF BEING PASSIONATE ABOUT LEADING-EDGE TECHNOLOGIES, ENTHUSIASTIC, AND FORWARD-THINKING. SKILLS: VMWARE VSPHERE 6/7/8 AND STORAGE AREA NETWORKS (SANS), VSANSERVERS, HP PROLIANT (OR EQUIVALENT)WINDOWS ACTIVE DIRECTORY (2012+)OFFICE 365 ENVIRONMENTSQL SERVER (2012+) ADMINISTRATIONMICROSOFT AZURENETWORKING / INFRASTRUCTURECISCO / DELL SWITCHES/ JUNIPER, NEXT-GEN FIREWALLS (PALO ALTO) AND ENDPOINT SECURITY MANAGEMENTWORKSTATIONS: WINDOWS 10 /11 PCS, MACINTOSH AND LINUXPOWERSHELL SCRIPTINGA BIG PLUS!!APP INSIGHTS, STREAM ANALYTICS, AND MACHINE LEARNING-AI APPLIED TO IT TASKSPRINCIPAL ACCOUNTABILITIES & RESPONSIBILITIES:· NETWORK ADMINISTRATION, FIREWALL ADMINISTRATION AND SECURITY· SERVERS & VIRTUALIZATION (VMWARE, WINDOWS, AND LINUX) ADMINISTRATION· MICROSOFT ACTIVE DIRECTORY / OFFICE 365 ENVIRONMENT & SERVERS ADMINISTRATIONWORKSTATIONS (PCS / MAC) / MOBILE DEVICES / PRINTERSMANAGE AND MAINTAIN WIRELESS INFRASTRUCTURE AND MOBILE DEVICES (APPLE & ANDROID-BASED)SUPPORT AND RECOMMEND NETWORKING IMPROVEMENTS TO ENSURE MAXIMUM PROTECTION OF COMPANY IP ASSETS AND THE PERFORMANCE OF THE NETWORK.MANAGEMENT OF SECURITY SYSTEMS (ENDPOINT SECURITY (ANTIVIRUS, EDR) AND PHYSICAL SECURITY SYSTEMS (DVR, ACCESS CONTROL, ETC.)DISASTER RECOVERY/BUSINESS CONTINUANCE MANAGEMENT EXPERIENCE:- MANAGING & MAINTAINING NETWORKS, AND SERVERS IN A HETEROGENEOUS ENVIRONMENT (5+ YEARS)- MICROSOFT SQL SERVER ADMINISTRATION (BACKUPS, MONITORING, O/S HEALTH) EDUCATION:- BACHELOR'S DEGREE OR ABOVE IN COMPUTER ENGINEERING OR RELATED DISCIPLINE PREFERRED (BUT NOT REQUIRED) SOFT SKILLS:- STRONG SENSE OF RESPONSIBILITY AND ABILITY TO WORK INDEPENDENTLY- GOOD INTERPERSONAL AND COMMUNICATION SKILLS, SELF-MOTIVATED, DETAIL-MINDED, AND RESULT-ORIENTED.- TEAM PLAYER WHO VALUES TEAM SUCCESS OVER INDIVIDUAL RECOGNITION- A WIDE DEGREE OF CREATIVITY AND LATITUDE IS EXPECTED- EXCELLENT VERBAL & WRITTEN SKILLS DAY TO DAY TASKS:- OPTIMIZING IT INFRASTRUCTURE- SOLVING PERFORMANCE ISSUES- ENSURING THE RELIABILITY OF INFORMATION SYSTEMS ",
    "job_skill_set": [
      "SQL Server (2012+) Administration",
      "Strong sense of responsibility",
      "Ability to work independently",
      "Good interpersonal skills",
      "Communication skills",
      "Self-motivated",
      "Detail-minded",
      "Result-oriented",
      "Team player",
      "Creativity",
      "Excellent verbal skills",
      "Excellent written skills",
      "VMware vSphere 6/7/8",
      "Storage Area Networks (SANs)",
      "Windows Active Directory (2012+)",
      "Office 365",
      "Microsoft Azure",
      "Networking / Infrastructure",
      "Cisco / Dell Switches",
      "Juniper",
      "Next-Gen Firewalls (Palo Alto)",
      "Endpoint Security Management",
      "Windows 10/11 PCs",
      "Macintosh",
      "Linux",
      "PowerShell Scripting",
      "App Insights",
      "Stream Analytics",
      "Machine Learning - AI",
      "Disaster Recovery/Business Continuance Management"
    ],
    "short_keywords": [
      "1011",
      "2012",
      "365",
      "678",
      "ability",
      "active",
      "administration",
      "ai",
      "alto",
      "analytics",
      "app",
      "area",
      "azure",
      "cisco",
      "communication",
      "continuance",
      "creativity",
      "dell",
      "detailminded",
      "directory",
      "disaster",
      "endpoint",
      "engineer",
      "excellent",
      "firewalls",
      "good",
      "independently",
      "information",
      "informationtechnology",
      "infrastructure",
      "insights",
      "interpersonal",
      "juniper",
      "learning",
      "linux",
      "machine",
      "macintosh",
      "management",
      "microsoft",
      "networking",
      "networks",
      "nextgen",
      "of",
      "office",
      "palo",
      "pcs",
      "player",
      "powershell",
      "recoverybusiness",
      "responsibility",
      "resultoriented",
      "sans",
      "scripting",
      "security",
      "selfmotivated",
      "sense",
      "server",
      "skills",
      "sql",
      "storage",
      "stream",
      "strong",
      "switches",
      "team",
      "technology",
      "to",
      "verbal",
      "vmware",
      "vsphere",
      "windows",
      "work",
      "written"
    ]
  },
  {
    "job_id": "3898161326",
    "job_title": "Information Technology Support Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "IDR IS SEEKING AN EXPERIENCED EXECUTIVE-LEVEL IT SUPPORT SPECIALIST TO JOIN ONE OF TOP HEALTHCARE CLIENTS. IF YOU ARE LOOKING FOR AN OPPORTUNITY TO JOIN A FAST-GROWING, TEAM-ORIENTED ORGANIZATION, PLEASE APPLY TODAY! \nPOSITION OVERVIEW / DAY TO DAY RESPONSIBILITIES: IN THIS ROLE, YOU WILL PROVIDE DEDICATED SUPPORT TO OUR EXECUTIVE-LEVEL STAFF, ENSURING THEIR DESKTOP AND MOBILE DEVICES OPERATE EFFICIENTLY AND SECURELY.EXECUTIVE SUPPORT: DELIVER HIGH-QUALITY DESKTOP AND MOBILE DEVICE SUPPORT TO OUR EXECUTIVE-LEVEL STAFF, ADDRESSING THEIR UNIQUE NEEDS AND ENSURING MINIMAL DOWNTIME.DESKTOP SUPPORT: TROUBLESHOOT AND RESOLVE DESKTOP-RELATED ISSUES, INCLUDING HARDWARE AND SOFTWARE ISSUES, TO MAINTAIN OPTIMAL PERFORMANCE AND FUNCTIONALITY.MOBILE DEVICE SUPPORT: ASSIST IN SETTING UP AND TROUBLESHOOTING MOBILE DEVICES, ENSURING THEY ARE SECURELY INTEGRATED INTO OUR CORPORATE ENVIRONMENT.PRINTER SETUP AND MANAGEMENT: CONFIGURE AND MANAGE PRINTER SETUPS, ADDRESSING ANY ISSUES THAT ARISE TO ENSURE SEAMLESS PRINTING CAPABILITIES.MICROSOFT TEAMS SETUP AND SUPPORT: ASSIST WITH MICROSOFT TEAMS SETUP FOR EXECUTIVES AND ADDRESS ANY ISSUES RELATED TO ITS USAGE TO FACILITATE EFFECTIVE COMMUNICATION AND COLLABORATION.COMPUTER AND SOFTWARE SKILLS: PROVIDE GUIDANCE AND SUPPORT ON VARIOUS COMPUTER AND SOFTWARE APPLICATIONS, HELPING EXECUTIVES UTILIZE THEM EFFICIENTLY.INTUNE MANAGEMENT: MANAGE AND ADMINISTER MICROSOFT INTUNE, ENSURING DEVICES ARE COMPLIANT WITH COMPANY POLICIES, IMPLEMENTING APP PROTECTION POLICIES, AND ADDRESSING ANY INTUNE-RELATED ISSUES.TOP SKILLS:5+ EXPERIENCE IN IT SUPPORT ROLEPROVEN SUPPORT FOR EXECUTIVE-LEVEL LEADERSHIPSKILLED IN BOTH DESKTOP AND MOBILE DEVICE SUPPORTRECENT EXPERTISE IN DEVICE MIGRATIONS AND SETUPHANDS-ON EXPERIENCE WITH INTUNE & MDM MANAGEMENTPROFICIENT IN WINDOWS 10 SUPPORTWHAT’S IN IT FOR YOU?COMPETITIVE COMPENSATION PACKAGEFULL BENEFITS; MEDICAL, VISION, DENTAL, AND MORECLOSE-KNIT AND TEAM-ORIENTED CULTURE???????WHY IDR?25+ YEARS OF PROVEN INDUSTRY EXPERIENCE IN 4 MAJOR MARKETSEMPLOYEE STOCK OWNERSHIP PROGRAMDEDICATED ENGAGEMENT MANAGER WHO IS COMMITTED TO YOU AND YOUR SUCCESSMEDICAL, DENTAL, VISION, AND LIFE INSURANCECLEARLYRATED’S BEST OF STAFFING® CLIENT AND TALENT AWARD WINNER 11 YEARS IN A ROW",
    "job_skill_set": [
      "computer and software skills",
      "troubleshooting",
      "hardware and software issues resolution",
      "team-oriented",
      "communication",
      "problem solving",
      "customer service",
      "adaptability",
      "desktop support",
      "mobile device support",
      "printer setup and management",
      "Microsoft Teams setup and support",
      "Intune management",
      "Windows 10 support",
      "device migrations and setup"
    ],
    "short_keywords": [
      "10",
      "adaptability",
      "and",
      "communication",
      "computer",
      "customer",
      "desktop",
      "device",
      "hardware",
      "information",
      "informationtechnology",
      "intune",
      "issues",
      "management",
      "microsoft",
      "migrations",
      "mobile",
      "printer",
      "problem",
      "resolution",
      "service",
      "setup",
      "skills",
      "software",
      "solving",
      "specialist",
      "support",
      "teamoriented",
      "teams",
      "technology",
      "troubleshooting",
      "windows"
    ]
  },
  {
    "job_id": "3903807715",
    "job_title": "Information Technology Specialist(Desktop Support)",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "TITLE: NETWORK SITE COORDINATORLOCATION: BINGHAMTON, NYDURATION: 30 MONTHSONSITE FROM DAY 1NOTE: TRAVEL REQUIRED. 3 OUT OF 5 DAYS THROUGHOUT THE BINGHAMTON-SYRACUSE AREA\nDESCRIPTION:THE CONSULTANT WILL WORK ON EQUIPMENT INSTALLATION, RELOCATION AND REMOVAL. THE CONSULTANT WILL BE WORKING ON VOIP PHONES, WAPS, AND DATA COMMUNICATIONS EQUIPMENT FOR SUPPORTING THE DEPARTMENT. THE CONSULTANT WILL PARTICIPATE IN THE PLANNING AND EXECUTION OF ALL PHASES OF THE PROJECT INCLUDING: REQUEST ANALYSIS, SITE SURVEYS, SITE PREPARATION, CABLE TROUBLESHOOTING AND INSTALLATION, ASSET MANAGEMENT, INVENTORY CONTROL, AND NETWORK ASSISTANCE. MANDATORY QUALIFICATION:• WORKS IN THE FIELD OF INFORMATION TECHNOLOGY, EXPERIENCED IN THE USAGE AND SUPPORT OF A COLLECTION OF DEVELOPMENT PLATFORMS, TECHNICAL ARCHITECTURES OR BUSINESS APPLICATIONS AND PRODUCTS THAT RUN ON THOSE PLATFORMS - BEYOND THAT OF A PROGRAMMER.• CANDIDATE IS ABLE TO WORK INDEPENDENTLY, WITHOUT ASSISTANCE AND PROVIDES GUIDANCE TO OTHERS. MAY HAVE AN ADVANCED EDUCATION. • 60 MONTHS OF EXPERIENCE INSTALLING/TROUBLESHOOTING PCS AND PRINTERS• 60 MONTHS OF EXPERIENCE INSTALLING/TROUBLESHOOTING SERVERS• 12 MONTHS OF EXPERIENCE INSTALLING/TROUBLESHOOTING VOIP PHONES• 60 MONTHS OF EXPERIENCE INSTALLING/TROUBLESHOOTING DATA COMMUNICATIONS EQUIPMENT• 60 MONTHS OF EXPERIENCE CONDUCTING TECHNICAL SITE SURVEYS• 60 MONTHS OF EXPERIENCE DATA CABLE INSTALLATION/TROUBLESHOOTING• 36 MONTHS OF EXPERIENCE CONDUCTING INVENTORY CONTROL• 36 MONTHS OF EXPERIENCE IN DESKTOP SUPPORT.",
    "job_skill_set": [
      "Independent work",
      "Guidance to others",
      "Planning",
      "Execution",
      "Communication",
      "VOIP phones",
      "Data communications equipment",
      "PC installation",
      "Printer installation",
      "Server installation",
      "Technical site surveys",
      "Data cable installation",
      "Troubleshooting",
      "Inventory control",
      "Desktop support"
    ],
    "short_keywords": [
      "cable",
      "communication",
      "communications",
      "control",
      "data",
      "desktop",
      "equipment",
      "execution",
      "guidance",
      "independent",
      "information",
      "informationtechnology",
      "installation",
      "inventory",
      "others",
      "pc",
      "phones",
      "planning",
      "printer",
      "server",
      "site",
      "specialistdesktop",
      "support",
      "surveys",
      "technical",
      "technology",
      "to",
      "troubleshooting",
      "voip",
      "work"
    ]
  },
  {
    "job_id": "3894299307",
    "job_title": "Information Technology Desktop Support",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "WE ARE SEEKING A SKILLED AND EXPERIENCED IT DESKTOP SUPPORT TECHNICIAN TO JOIN OUR TEAM IN BERWYN, PA. THE IDEAL CANDIDATE WILL HAVE AT LEAST 3 YEARS OF EXPERIENCE IN PROVIDING HIGH-LEVEL DESKTOP SUPPORT IN AN ENTERPRISE-LEVEL, MICROSOFT ENVIRONMENT. THIS ROLE REQUIRES DAILY ON-SITE PRESENCE AND INVOLVES A RANGE OF RESPONSIBILITIES FROM TROUBLESHOOTING HARDWARE AND SOFTWARE ISSUES TO SUPPORTING OUR NETWORK INFRASTRUCTURE.\nFULLY ONSITE IN BERWYN, PAHEALTHCARE EXPERINCE DESIRED, BUT NOT REQUIREDCONTRACT TO HIRE - $26.00/HRHEALTH BENEFITS AVAILABLE WHILE ON CONTRACT\nKEY RESPONSIBILITIESPROVIDE TIER 1 AND TIER 2 DESKTOP SUPPORT, RESOLVING TECHNICAL ISSUES RELATED TO MICROSOFT OPERATING SYSTEMS, OFFICE SUITE, AND OTHER SOFTWARE APPLICATIONS.PERFORM HARDWARE AND SOFTWARE INSTALLATIONS, CONFIGURATIONS, AND UPDATES.ASSIST IN MAINTAINING AND MONITORING NETWORK INFRASTRUCTURE, INCLUDING WIRELESS AND WIRED NETWORKS.TROUBLESHOOT ISSUES RELATED TO PRINTERS, SCANNERS, AND OTHER PERIPHERAL DEVICES.SUPPORT MOBILE DEVICES, INCLUDING CONFIGURATION AND TROUBLESHOOTING OF IOS AND ANDROID DEVICES.COLLABORATE WITH IT TEAM MEMBERS TO DIAGNOSE AND RESOLVE COMPLEX ISSUES.MAINTAIN ACCURATE RECORDS OF ISSUES, REPAIRS, AND RESOLUTIONS IN THE IT TICKETING SYSTEM.CONDUCT REGULAR SYSTEM BACKUPS AND PERFORM DATA RECOVERY TASKS AS NEEDED.ASSIST IN THE IMPLEMENTATION OF NEW TECHNOLOGIES AND SYSTEM UPGRADES.PROVIDE USER EDUCATION AND SUPPORT, INCLUDING CREATING USER GUIDES AND CONDUCTING TRAINING SESSIONS.ENSURE COMPLIANCE WITH COMPANY POLICIES AND IT BEST PRACTICES.\nQUALIFICATIONSMINIMUM OF 3 YEARS OF EXPERIENCE IN AN IT DESKTOP SUPPORT ROLE, PREFERABLY IN AN ENTERPRISE-LEVEL ENVIRONMENT.STRONG KNOWLEDGE OF MICROSOFT ENVIRONMENTS, INCLUDING WINDOWS OPERATING SYSTEMS, OFFICE SUITE, AND ACTIVE DIRECTORY.EXPERIENCE WITH HARDWARE AND SOFTWARE TROUBLESHOOTING.FAMILIARITY WITH NETWORKING CONCEPTS, INCLUDING TCP/IP, DNS, DHCP, AND VPN.EXCELLENT PROBLEM-SOLVING SKILLS AND THE ABILITY TO WORK INDEPENDENTLY.STRONG COMMUNICATION AND INTERPERSONAL SKILLS, CAPABLE OF EXPLAINING TECHNICAL CONCEPTS TO NON-TECHNICAL USERS.RELEVANT CERTIFICATIONS (E.G., COMPTIA A+, MICROSOFT CERTIFIED PROFESSIONAL) ARE PREFERRED.ABILITY TO HANDLE MULTIPLE TASKS SIMULTANEOUSLY AND PRIORITIZE EFFECTIVELY.HIGH SCHOOL DIPLOMA OR EQUIVALENT; HIGHER EDUCATION OR CERTIFICATIONS IN IT OR RELATED FIELD ARE A PLUS.",
    "job_skill_set": [
      "Microsoft Operating Systems",
      "Office Suite",
      "Active Directory",
      "Hardware Troubleshooting",
      "Software Troubleshooting",
      "Networking Concepts",
      "TCP/IP",
      "VPN",
      "Mobile Device Support",
      "IT Ticketing System",
      "System Backups",
      "Data Recovery",
      "User Education",
      "Problem Solving",
      "Communication",
      "Interpersonal Skills",
      "Independence",
      "Multi-tasking",
      "Prioritization",
      "DNS",
      "DHCP",
      "Technical Certifications"
    ],
    "short_keywords": [
      "active",
      "backups",
      "certifications",
      "communication",
      "concepts",
      "data",
      "desktop",
      "device",
      "dhcp",
      "directory",
      "dns",
      "education",
      "hardware",
      "independence",
      "information",
      "informationtechnology",
      "interpersonal",
      "it",
      "microsoft",
      "mobile",
      "multitasking",
      "networking",
      "office",
      "operating",
      "prioritization",
      "problem",
      "recovery",
      "skills",
      "software",
      "solving",
      "suite",
      "support",
      "system",
      "systems",
      "tcpip",
      "technical",
      "technology",
      "ticketing",
      "troubleshooting",
      "user",
      "vpn"
    ]
  },
  {
    "job_id": "3890895296",
    "job_title": "Information Technology Project Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "WE HAVE A GREAT OPPORTUNITY FOR AN IT PROJECT MANAGER TO WORK WITH ONE OF OUR LARGEST CLIENTS IN THE CHARLOTTE AREA. THIS IT PROJECT MANAGER WILL BE PARTNERING WITH TECHNICAL AND NONTECHNICAL TEAMS TO DRIVE THE DEVELOPMENT FOR PRODUCTS/ONLINE SERVICES.\n\nTHE IDEAL IT PROJECT MANAGER WILL HAVE STRONG EXPERIENCE OVERSEEING THE DEVELOPMENT OF WEBSITE, MOBILE OR ONLINE SERVICES PROJECTS FROM BEGINNING TO END. THIS IT PROJECT MANAGER WILL ALSO HAVE EXTENSIVE KNOWLEDGE OF THE FULL SDLC AND ABILITY TO WORK WITH MULTIPLE TEAMS ACROSS AN ENTERPRISE ORGANIZATION. OUR CLIENT IS A TECHNOLOGY FOCUS COMPANY BASED IN THE HEART OF CHARLOTTE. THEY WORK STRICTLY OFF A DIGITAL PLATFORM AND SPENDS MILLIONS OF DOLLARS A YEAR ON PROVIDING THE MOST CUTTING-EDGE TECHNOLOGY FOR ITS ENVIRONMENT AND EMPLOYEES\n.\nTHIS IS A LONG-TERM OPPORTUNITY THAT CAN OFFER A STRONG COMPENSATION PACKAGE PLUS FULL COVERAGE. PMP IS HIGHLY DESIRED BUT NOT REQUIRED FOR THIS ROL\nE.\nKEY RESPONSIBILITIES:LEAD AND MANAGE SOFTWARE DEVELOPMENT PROJECTS FROM INCEPTION TO DEPLOYMENTDEVELOP AND MAINTAIN DETAILED PROJECT PLANS, INCLUDING ALL RELEVANT DOCUMENTATION AND TIMELINESCOORDINATE WITH CROSS-FUNCTIONAL TEAMS (DEVELOPERS, DESIGNERS, QA) TO ENSURE PROJECT OBJECTIVES AND TIMELINES ARE METMANAGE PROJECT BUDGETS, INCLUDING RESOURCE ALLOCATION AND COST ESTIMATIONIDENTIFY, ASSESS, AND MITIGATE PROJECT RISKS THROUGHOUT THE PROJECT LIFECYCLEENSURE QUALITY STANDARDS ARE MET THROUGH PROPER QA METHODOLOGIESCOMMUNICATE PROJECT STATUS, ISSUES, AND SUCCESSES REGULARLY TO STAKEHOLDERS AND TEAM MEMBERSFACILITATE PROBLEM-SOLVING AND CONFLICT RESOLUTION WITHIN THE PROJECT T\nEAM",
    "job_skill_set": [
      "Project Management",
      "Budget Management",
      "Risk Management",
      "Quality Assurance",
      "Documentation",
      "Cross-Functional Coordination",
      "Communication",
      "Problem Solving",
      "Conflict Resolution",
      "Team Leadership",
      "Collaboration",
      "Adaptability",
      "SDLC",
      "Software Development",
      "PMP Certification"
    ],
    "short_keywords": [
      "adaptability",
      "assurance",
      "budget",
      "certification",
      "collaboration",
      "communication",
      "conflict",
      "coordination",
      "crossfunctional",
      "development",
      "documentation",
      "information",
      "informationtechnology",
      "leadership",
      "management",
      "manager",
      "pmp",
      "problem",
      "project",
      "quality",
      "resolution",
      "risk",
      "sdlc",
      "software",
      "solving",
      "team",
      "technology"
    ]
  },
  {
    "job_id": "3904388966",
    "job_title": "Information Technology Vice President",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "STANTON CHASE IS OUR SOLE RECRUITMENT SOURCE FOR THIS POSITION. TO BE CONSIDERED AN APPLICANT FOR THIS POSITION, EMAIL YOUR RESUME TO  J.TORRES@STANTONCHASE.COM  , AND INCLUDE POSITION CODE XM24038 IN THE SUBJECT LINE. \n\n JOB #  XM24038\n\n JOB TITLE \n\nINFORMATION TECHNOLOGY VICE PRESIDENT\n\n OFFICE LOCATION \n\nHOUSTON, TX\n\n BUSINESS/DEPARTMENT \n\nINFORMATION TECHNOLOGY\n\n SALES TERRITORY, IF APPLICABLE \n\nN/A\n\nGENERAL ROLE DESCRIPTION\n\nDESIGN, DEVELOP, IMPLEMENT, AND MANAGE THE COMPANY'S COMPREHENSIVE INFORMATION TECHNOLOGY STRATEGY TO ACHIEVE THE SHORT AND MID-TERM OBJECTIVES (1-3 YEARS) OF THE MID-RANGE PLAN (MRP), THE LONG TERM (3-7 YEARS) STRATEGY, AND THE HEALTHY, SUSTAINABLE, AND PROFITABLE GROWTH OF THE COMPANY.\n\nROLE ACCOUNTABILITIES\n\n BUILD AND LEAD A WORLD-CLASS TEAM BY PROMOTING AND INSTILLING A CULTURE OF SUPERIOR PERFORMANCE, ETHICAL CONDUCT, PROFESSIONAL DEVELOPMENT, AND PERSONAL LEARNING, THROUGH EFFECTIVE MANAGERIAL LEADERSHIP ENSURE THE TEAM HAS A CLEAR AND COMPELLING VISION OF 'WHAT GREAT LOOKS LIKE' AND A PLAN TO ACHIEVE IT ENSURE THE FUNCTION’S STRUCTURE, PROCESSES, TECHNOLOGY, SERVICES, AND PRODUCTS ARE DESIGNED TO DELIVER THE STRATEGIC INTENT OF THE FUNCTION GUIDE THE EFFORTS OF DIRECT REPORTS IN THE DEVELOPMENT AND IMPLEMENTATION OF CURRENT AND LONG-RANGE OBJECTIVES, POLICIES, AND PROCEDURES POSITION THE FUNCTION TO SUPPORT THE ACHIEVEMENT OF THE COMPANY’S VISION, STRATEGIC INITIATIVES, AND BUSINESS STRATEGY AND OBJECTIVES ON A GLOBAL BASIS, BY COLLABORATING WITH BUSINESS LEADERSHIP TO DEFINE REQUIREMENTS FOR ACHIEVEMENT REPORT ALL ASPECTS OF THE FUNCTION’S PERFORMANCE AND RESULTS AS SCHEDULED, REQUESTED, OR NEEDED TO COMPANY AND PARENT COMPANY MANAGEMENT, AS APPLICABLE, INCLUDING BUT NOT LIMITED TO, RESEARCH, ANALYSIS AND COMMENTARY, IDENTIFICATION OF KEY ITEMS REQUIRING MANAGEMENT ATTENTION, EVALUATION, AND RECOMMENDATIONS DETERMINE THE BUDGET AND BUSINESS RESOURCES REQUIRED FOR THE SUCCESSFUL MANAGEMENT OF THE FUNCTION, IN COORDINATION WITH APPROPRIATE COMPANY, PARENT COMPANY, AND GROUP COMPANY PERSONNEL DIRECT THE DEVELOPMENT, PROCUREMENT, AND DELIVERY OF NEW AND ENHANCED SYSTEMS, IN COORDINATION WITH APPROPRIATE COMPANY, PARENT COMPANY, AND GROUP COMPANY PERSONNEL ENSURE APPROPRIATE RISK MITIGATION THROUGH SYSTEMATIC RISK ASSESSMENT AND RISK MITIGATION TOOLS AND PROCESSES MONITOR, INVESTIGATE, AND ANALYZE INDUSTRY TRENDS, THE COMPANY’S POSITION, AND RECOMMEND NEW, VIABLE PROCESSES, SYSTEMS, AND SERVICES DETERMINE KEY WANTS AND NEEDS OF THE BUSINESS UNITS AND SHARED SERVICES, ASSESS THE COMPANY’S POSITION ON THESE RELATIVE TO COMPETITORS, AND DEVELOP AND IMPLEMENT PLANS TO STRENGTHEN POSITION AND BRIDGE GAPS ASSESS THE COMPANY’S CAPABILITIES, AND RECOMMEND NEW AND ENHANCED SYSTEMS, SECURITY, AND TECHNOLOGIES TO THAT POSITION THE COMPANY TO ACHIEVE LONG TERM OBJECTIVES MONITOR AND IDENTIFY EXTERNAL GLOBAL, REGIONAL, AND LOCAL TRENDS AND ISSUES, SUCH AS POLITICAL, ECONOMIC, SOCIAL, TECHNOLOGICAL, AND LEGAL, WITH POTENTIAL IMPACT ON THE BUSINESS; RECOMMEND, DEVELOP, AND IMPLEMENT AS APPROVED, APPROPRIATE STRATEGIES FOR IMPLEMENTATION BY THE COMPANY, PARENT COMPANY, AND OTHER GROUP COMPANIES, AS APPLICABLE BUILD AND SUSTAIN PRODUCTIVE RELATIONSHIPS WITH COMPANY, PARENT COMPANY, AND GROUP COMPANY CONTACTS TO ENSURE TIMELY AND ACCURATE COMMUNICATION OF ISSUES, CONCERNS, AND REQUESTS FOR ASSISTANCE ARE ACKNOWLEDGED AND SUBSEQUENTLY ADDRESSED COOPERATE WITH COMPANY, PARENT COMPANY, AND OTHER GROUP COMPANY EXECUTIVE LEADERSHIP AND PEERS TO DEVELOP AND EXECUTE GLOBAL BUSINESS STRATEGIES AND INITIATIVES BUILD AND SUSTAIN A WORLD-WIDE EXECUTIVE NETWORK OF CONTACTS TO INFLUENCE AND MAINTAIN A FAVORABLE BUSINESS CLIMATE DEVELOP AND MAINTAIN STRONG BUSINESS RELATIONSHIPS WITH INTERNAL AND EXTERNAL CLIENTS AND SUPPLIERS DEVELOP RELATIONSHIPS WITHIN A NETWORK OF INTERNAL, DOMESTIC AND INTERNATIONAL COMPANY CONTACTS TO COORDINATE AND INFLUENCE SECURING THE RESOURCES NEEDED FOR IMPLEMENTING THE COMPANY'S STRATEGIES FORMULATE AND EXECUTE COMPANY STRATEGIC OBJECTIVES AND INITIATIVES, CONSISTENT WITH COMPANY VISION, MISSION, STRATEGIC GUIDELINES, AND CORE VALUES, AS A MEMBER OF THE STRATEGIC PROCESS TEAM PROACTIVELY AND POSITIVELY PROMOTE AND EXEMPLIFY THE COMPANY BRAND TO INTERNAL AND EXTERNAL CONTACTS, AND THE GENERAL PUBLIC ENSURE COMPLIANCE WITH ALL COMPANY AND PARENT COMPANY POLICIES, PRACTICES, AND PROCEDURES, AND ALL REGULATIONS AND LAWS IN ALL AREAS WHERE THE COMPANY, PARENT AND GROUP COMPANIES OPERATE, AS APPLICABLE PLAN AND EXECUTE PROJECTS TO AID IN IMPROVING AND GROWING THE COMPANY AND PARENT COMPANY TO MEET GOALS SET BY THE COMPANY AND PARENT COMPANY EXECUTIVE LEADERSHIP\n\nGENERAL EMPLOYEE ACCOUNTABILITIES\n\n BRING FULL EFFORT TO BEAR ON TASKS ASSIGNED BY MANAGER GIVE MANAGER BEST ADVICE GIVE EARLIEST NOTICE WHEN WORK CANNOT BE DELIVERED AS SPECIFIED COOPERATE AND COLLABORATE WITH PEERS AND INTERACT CROSS-ORGANIZATIONALLY AS SPECIFIED BY MANAGER EXEMPLIFY COMPANY CORE VALUES:INTEGRITY, CLIENT FOCUS, TEAM ORIENTATION, AND PERSONAL COMMITMENT COMPLY WITH ALL COMPANY POLICIES, PRACTICES, AND PROCEDURES AND ALL REGULATIONS AND LAWS FORMULATE RECOMMENDATIONS FOR IMPROVEMENT PROACTIVELY ENSURE EFFECTIVE UTILIZATION OF BUSINESS TOOLS AND PROCESSES\n\nMANAGER ACCOUNTABILITIES\n\n BUILD AND LEAD A TEAM OF COMMITTED AND CAPABLE EMPLOYEES PLAN FOR, APPROPRIATELY ASSIGN, RESOURCE, AND INTEGRATE THE WORK OF THE TEAM LEAD, EXPECT, AND IMPLEMENT CONTINUOUS IMPROVEMENT OWN THE OUTPUT OF THE TEAM EXERCISE EFFECTIVE MANAGERIAL LEADERSHIP TO INCLUDE TWO-WAY MANAGERIAL TEAM WORKING FAIR AND JUST TREATMENT OF DIRECT REPORTS CONTEXT SETTING PLANNING TASK ASSIGNMENT ONGOING PERFORMANCE MANAGEMENT COACHING SELECTION AND ORIENTATION DE-SELECTION AND DISMISSAL\n\nMANAGER-ONCE-REMOVED ACCOUNTABILITIES\n\n E NSURE EFFECTIVE LEADERSHIP AND FAIR AND JUST TREATMENT FOR DIRECT REPORTS-ONCE-REMOVED ENSURE TALENT POOL DEVELOPMENT AT THE DIRECT REPORT-ONCE-REMOVED LEVEL DECIDE APPEALS INITIATED BY DIRECT REPORTS-ONCE-REMOVED\n\nMINIMUM QUALIFICATIONS\n\n BACHELOR OF SCIENCE DEGREE IN COMPUTER SCIENCE, INFORMATION TECHNOLOGY, COMPUTER ENGINEERING OR RELATED ENGINEERING OR TECHNICAL DISCIPLINE OR EQUIVALENT VIA EDUCATION AND/OR WORK EXPERIENCE 5 YEARS LEADING INFORMATION TECHNOLOGY TEAM(S) IN A TECHNICAL, PROJECT-BASED OR MANUFACTURING BUSINESS 10 YEARS TOTAL MANAGEMENT EXPERIENCE IN A TECHNICAL, PROJECT-BASED OR MANUFACTURING BUSINESS DEMONSTRATED SUCCESS DEVELOPING, IMPLEMENTING, MEASURING, AND IMPROVING EFFECTIVE SYSTEMS IN AREA OF ACCOUNTABILITY DEMONSTRATED SUCCESS LEADING TEAMS TO ACHIEVE BUSINESS GOALS AND OBJECTIVES DEMONSTRATED SUCCESS COLLABORATING CROSS-FUNCTIONALLY DEMONSTRATED CONTINUOUS IMPROVEMENT IN AREAS OF RESPONSIBILITY DEMONSTRATED SUCCESSFUL AND POSITIVE PERSONAL LEADERSHIP, INTERPERSONAL, ORGANIZATIONAL, ADMINISTRATIVE, AND COMMUNICATION SKILLS DEMONSTRATED SUCCESSFUL WORKING RELATIONSHIPS WITH CLIENTS, SUPPLIERS, AND OTHER INTERNAL AND EXTERNAL CONTACTS PROFICIENCY IN MS OFFICE SUITE AVAILABILITY TO TRAVEL, DOMESTICALLY AND INTERNATIONALLY, UP TO 15%, SOMETIMES WITH LIMITED NOTICE\n\nPREFERRED QUALIFICATIONS\n\n ADVANCED DEGREE IN COMPUTER SCIENCE, INFORMATION TECHNOLOGY, COMPUTER ENGINEERING OR TECHNICAL DISCIPLINE EXPERIENCE IN A BUSINESS WITH FOREIGN OWNERSHIP, PREFERABLY JAPANESE\n\n LINK TO TMEIC CORPORATION WEBSITE:  HTTPS://WWW.TMEIC.COM/ .IN ORDER TO BE CONSIDERED FOR A JOB OPENING, ALL APPLICANTS MUST COMPLETE AN ON-LINE JOB APPLICATION, IN FULL, FOR EACH JOB OPENING.A RESUME CAN BE ATTACHED TO THE ON-LINE APPLICATION BUT IS NOT CONSIDERED A SUBSTITUTE FOR THE INFORMATION IN THE APPLICATION.APPLICATIONS ARE NOT ACCEPTED FOR POSITIONS NOT POSTED.CURRENT JOB LISTINGS, ALONG WITH OUR APPLICATION, CAN BE FOUND ON OUR WEBSITE.SELECT “CAREER OPPORTUNITIES” ON THE “CAREERS” TAB OF OUR WEBSITE. PLEASE, NO TELEPHONE CALLS.\n\nEEO/AA/M/F/VET/DISABILITY EMPLOYER",
    "job_skill_set": [
      "Information Technology Strategy",
      "Team Leadership",
      "Project Management",
      "Budget Management",
      "Risk Assessment",
      "System Development",
      "Technical Proficiency",
      "Collaboration",
      "Communication",
      "Interpersonal Skills",
      "Organizational Skills",
      "Problem Solving",
      "Continuous Improvement",
      "Visionary Leadership",
      "Client Focus",
      "Adaptability",
      "Data Analysis",
      "MS Office Suite",
      "Ethical Conduct",
      "Cultural Awareness"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "assessment",
      "awareness",
      "budget",
      "client",
      "collaboration",
      "communication",
      "conduct",
      "continuous",
      "cultural",
      "data",
      "development",
      "ethical",
      "focus",
      "improvement",
      "information",
      "informationtechnology",
      "interpersonal",
      "leadership",
      "management",
      "ms",
      "office",
      "organizational",
      "president",
      "problem",
      "proficiency",
      "project",
      "risk",
      "skills",
      "solving",
      "strategy",
      "suite",
      "system",
      "team",
      "technical",
      "technology",
      "vice",
      "visionary"
    ]
  },
  {
    "job_id": "3904511283",
    "job_title": "Information Technology Support Analyst",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "AKKODIS IS SEEKING AN IT SUPPORT ANALYST FOR OUR CLIENT BASED IN COLUMBIA MD\nPAY RANGE: $25-$27/HR ON W2 WITHOUT BENEFITS. THE SALARY MAY BE NEGOTIABLE BASED ON EXPERIENCE, EDUCATION, GEOGRAPHIC LOCATION, AND OTHER FACTORS.\nTOP 3-5 TECHNICAL SKILLSEXPERIENCE IN WORKING WITH DESKTOPS, LAPTOPS, & IOS DEVICES AND RESOLVING USER-RELATED ISSUES.EXPERIENCE WITH TROUBLESHOOTING MICROSOFT NETWORKING AND WINDOWS OS, MAC OS, MS OFFICE, MS 365, MS TEAMS, SHAREPOINT, ANTI-VIRUS, E-MAIL AND INTERNET BROWSERS.EXPERIENCE WORKING ON A TICKETING SYSTEM ON INCIDENT AND REQUEST MODULES (PREFERABLY SERVICENOW).A+ OR MCP CERTIFICATION WILL BE PREFERRED.EXPERIENCE WORKING AS PART OF AN IT SERVICE DESK TEAM SUPPORTING GLOBAL LOCATIONS OR MULTIPLE LOCATIONS IN THE USA.TECHNICAL DEGREE IN ENGINEERING / COMPUTER SCIENCE /INFORMATION SYSTEMS OR EQUIVALENT WORK EXPERIENCE.TO BE CONSIDERED, CANDIDATES MUST HAVE US CITIZENSHIP OR PERMANENT WORK AUTHORIZATION.\nEQUAL OPPORTUNITY EMPLOYER/VETERANS/DISABLED\nBENEFIT OFFERINGS INCLUDE MEDICAL, DENTAL, VISION, TERM LIFE INSURANCE, SHORT-TERM DISABILITY INSURANCE, ADDITIONAL VOLUNTARY BENEFITS, COMMUTER BENEFITS, AND A 401K PLAN. OUR PROGRAM ALLOWS EMPLOYEES TO CHOOSE THE TYPE OF COVERAGE THAT MEETS THEIR INDIVIDUAL NEEDS. AVAILABLE PAID LEAVE MAY INCLUDE PAID SICK LEAVE, WHERE REQUIRED BY LAW; ANY OTHER PAID LEAVE REQUIRED BY FEDERAL, STATE, OR LOCAL LAW; AND HOLIDAY PAY UPON MEETING ELIGIBILITY CRITERIA. DISCLAIMER: THESE BENEFIT OFFERINGS DO NOT APPLY TO CLIENT-RECRUITED JOBS AND JOBS THAT ARE DIRECT HIRES TO A CLIENT.\nTO READ OUR CANDIDATE PRIVACY INFORMATION STATEMENT, WHICH EXPLAINS HOW WE WILL USE YOUR INFORMATION, PLEASE VISIT HTTPS://WWW.AKKODIS.COM/EN/PRIVACY-POLICYTHE COMPANY WILL CONSIDER QUALIFIED APPLICANTS WITH ARREST AND CONVICTION RECORDS.",
    "job_skill_set": [
      "desktop support",
      "laptop support",
      "iOS devices support",
      "troubleshooting",
      "Microsoft Networking",
      "Windows OS",
      "Mac OS",
      "MS Office",
      "MS 365",
      "SharePoint",
      "email support",
      "internet browsers",
      "technical degree",
      "teamwork",
      "communication",
      "problem solving",
      "customer service",
      "adaptability",
      "MS Teams",
      "anti-virus software",
      "ticketing system",
      "ServiceNow",
      "A+ certification",
      "MCP certification"
    ],
    "short_keywords": [
      "365",
      "a",
      "adaptability",
      "analyst",
      "antivirus",
      "browsers",
      "certification",
      "communication",
      "customer",
      "degree",
      "desktop",
      "devices",
      "email",
      "information",
      "informationtechnology",
      "internet",
      "ios",
      "laptop",
      "mac",
      "mcp",
      "microsoft",
      "ms",
      "networking",
      "office",
      "os",
      "problem",
      "service",
      "servicenow",
      "sharepoint",
      "software",
      "solving",
      "support",
      "system",
      "teams",
      "teamwork",
      "technical",
      "technology",
      "ticketing",
      "troubleshooting",
      "windows"
    ]
  },
  {
    "job_id": "3902776458",
    "job_title": "Information Technology Project Coordinator",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "PROJECT COORDINATOR POSITIONHYBRID IN IRVING, TEXAS - 3 DAYS PER WEEK IN OFFICECONTRACT TO HIRE5 YEARS RELEVANT EXPERIENCE REQUIRED, SOLID BUDGET/FORECASTING EXPERIENCE IS REQUIRED \nREQUIRES EXPERIENCE WITH IT PROJECT MANAGEMENT & TECHNOLOGY OPERATIONS PROCESSES IN ORDER TO BE SUCCESSFUL. THIS INDIVIDUAL WILL NEED TO BE HIGHLY ACCOUNTABLE, PROACTIVE, ABLE TO WORK AUTONOMOUSLY AND CAPABLE OF APPLYING CRITICAL THINKING TO A WIDE RANGE OF SUPPORT ACTIVITIES. POSITION REQUIRES INDIVIDUAL TO REGULARLY APPLY ANALYTICAL SKILLS TO MAKE RECOMMENDATIONS TO IT LEADERSHIP REGARDING SYSTEM ADMINISTRATION, BUDGET OR PROCESS IMPROVEMENTS.\nTHIS TEAM IS SEEKING A PROFESSIONAL THAT IS DETAILED, ALREADY PREFORMS BASIC FUNCTIONS AND OPEN TO CONTINUED LEARNING AND GROWING.\nRESPONSIBILITIESMANAGE IT PROJECT FINANCIALS INCLUDING BUDGETS, FORECASTS, AND ACTUALS.PERFORM SYSTEM ADMINISTRATION (WORKDAY FINANCIALS, SHAREPOINT, POWERBI, POWERAPPS)LOAD & MAINTAIN DATA FROM A VARIETY OF SOURCESMANAGE AND TRACK VENDOR CONTRACTS AND SOWS TO ENSURE COMPLIANCE WITH INTERNAL POLICIES AND SLASASSIST WITH STAFF PLANNING, RESOURCE CAPACITY TRACKING, AND NEW HIRE ONBOARDINGREVIEW TIMESHEETS, CREATE PURCHASE REQUISITIONS AND CODE INVOICES IN WORKDAY, AS NEEDEDCREATE END USER TRAINING MANUALS AND UPDATE PROCEDURE GUIDESLOOK FOR EFFICIENCIES AND STREAMLINE BUSINESS OPERATIONS PROCESSESPREPARE FINANCIAL REPORTS AND ASSIST WITH PLANNING, TRACKING, AND FORECASTING ON A PROJECT LEVEL ROLLING UP TO AN ORGANIZATION VIEWMAY SERVE AS LIAISON WITH THE FINANCE/ACCOUNTING TEAMS TO ENSURE ALIGNMENT ON DEPARTMENT BUDGETS\nREQUIREMENTS 5+ YEARS RELEVANT PM EXPERIENCEKNOWLEDGE OF SDLC AND AGILE PROJECT MANAGEMENT PRACTICESEXPERIENCE WITH SOFTWARE DEVELOPMENT BUDGETING, FORECASTING, AND FINANCIAL REPORTINGPRIOR EXPERIENCE WITH ERP SYSTEMS AND REPORTING TOOL, PREFERABLY WORKDAY AND POWERBIUNDERSTANDING OF FINANCIALS STATEMENTS INCLUDING P&L AND BALANCE SHEETWORKED IN IMPROVING PROCESSES AND CREATING EFFICIENCIESADVANCED EXCEL AND POWERPOINT SKILLSABILITY TO BE HIGHLY COLLABORATIVE IN A TEAM SETTINGEXCELLENT COMMUNICATION SKILLS, VERBALLY AND WRITTENGREAT ATTENTION TO DETAILS & STRONG ANALYTICS ABILITIESSERVICE AND SUPPORT ORIENTED\nEDUCATION: BACHELOR DEGREE",
    "job_skill_set": [
      "IT Project Management",
      "Budgeting",
      "System Administration",
      "Data Management",
      "Accountability",
      "Proactivity",
      "Critical Thinking",
      "Attention to Detail",
      "Collaboration",
      "Communication",
      "Analytical Skills",
      "Service Orientation",
      "Continuous Learning",
      "Forecasting",
      "Workday Financials",
      "PowerBI",
      "PowerApps",
      "SDLC",
      "Agile Project Management",
      "Excel",
      "PowerPoint",
      "Financial Reporting",
      "ERP Systems"
    ],
    "short_keywords": [
      "accountability",
      "administration",
      "agile",
      "analytical",
      "attention",
      "budgeting",
      "collaboration",
      "communication",
      "continuous",
      "coordinator",
      "critical",
      "data",
      "detail",
      "erp",
      "excel",
      "financial",
      "financials",
      "forecasting",
      "information",
      "informationtechnology",
      "it",
      "learning",
      "management",
      "orientation",
      "powerapps",
      "powerbi",
      "powerpoint",
      "proactivity",
      "project",
      "reporting",
      "sdlc",
      "service",
      "skills",
      "system",
      "systems",
      "technology",
      "thinking",
      "to",
      "workday"
    ]
  },
  {
    "job_id": "3905326659",
    "job_title": "Strategic Sourcing Manager: Cyber Defense & Engineering + Information Technology - USDS",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "RESPONSIBILITIES\n\n ABOUT TIKTOK U.S. DATA SECURITY\nTIKTOK IS THE LEADING DESTINATION FOR SHORT-FORM MOBILE VIDEO. OUR MISSION IS TO INSPIRE CREATIVITY AND BRING JOY. U.S. DATA SECURITY (“USDS”) IS A SUBSIDIARY OF TIKTOK IN THE U.S. THIS NEW, SECURITY-FIRST DIVISION WAS CREATED TO BRING HEIGHTENED FOCUS AND GOVERNANCE TO OUR DATA PROTECTION POLICIES AND CONTENT ASSURANCE PROTOCOLS TO KEEP U.S. USERS SAFE. OUR FOCUS IS ON PROVIDING OVERSIGHT AND PROTECTION OF THE TIKTOK PLATFORM AND U.S. USER DATA, SO MILLIONS OF AMERICANS CAN CONTINUE TURNING TO TIKTOK TO LEARN SOMETHING NEW, EARN A LIVING, EXPRESS THEMSELVES CREATIVELY, OR BE ENTERTAINED. THE TEAMS WITHIN USDS THAT DELIVER ON THIS COMMITMENT DAILY SPAN ACROSS TRUST & SAFETY, SECURITY & PRIVACY, ENGINEERING, USER & PRODUCT OPS, CORPORATE FUNCTIONS AND MORE.\n\nWHY JOIN US\nCREATION IS THE CORE OF TIKTOK'S PURPOSE. OUR PLATFORM IS BUILT TO HELP IMAGINATIONS THRIVE. THIS IS DOUBLY TRUE OF THE TEAMS THAT MAKE TIKTOK POSSIBLE. \nTOGETHER, WE INSPIRE CREATIVITY AND BRING JOY - A MISSION WE ALL BELIEVE IN AND AIM TOWARDS ACHIEVING EVERY DAY. \nTO US, EVERY CHALLENGE, NO MATTER HOW DIFFICULT, IS AN OPPORTUNITY; TO LEARN, TO INNOVATE, AND TO GROW AS ONE TEAM. STATUS QUO? NEVER. COURAGE? ALWAYS. \nAT TIKTOK, WE CREATE TOGETHER AND GROW TOGETHER. THAT'S HOW WE DRIVE IMPACT - FOR OURSELVES, OUR COMPANY, AND THE COMMUNITIES WE SERVE. \nJOIN US.\n\nTEAM INTRO\nWE ARE A PROGRESSIVE PROCUREMENT ORGANIZATION PUSHING THE BOUNDARIES OF TRADITIONAL PROCUREMENT REPUTATION AND METHODOLOGIES. WE ARE LOOKING FOR INDIVIDUALS WHO CAN THINK OUTSIDE THE BOX TO ACHIEVE COMPANY OBJECTIVES REGARDING VALUE AND PARTNERSHIPS WITH OUR SUPPLIERS. OUR ORGANIZATION MOVES QUICKLY, AND YOU MUST TOO. AS A STRATEGIC SOURCING MANAGER WITHIN THE TIKTOK U.S. DATA SECURITY PROCUREMENT GROUP, YOU WILL BE RESPONSIBLE FOR ESTABLISHING AND EXECUTING SOURCING STRATEGIES AND PLANS FOR OUR CYBER DEFENSE & ENGINEERING + INFORMATION TECHNOLOGY DEPARTMENT.\n\nIN ORDER TO ENHANCE COLLABORATION AND CROSS-FUNCTIONAL PARTNERSHIPS, AMONG OTHER THINGS, AT THIS TIME, OUR ORGANIZATION FOLLOWS A HYBRID WORK SCHEDULE THAT REQUIRES EMPLOYEES TO WORK IN THE OFFICE 3 DAYS A WEEK, OR AS DIRECTED BY THEIR MANAGER/DEPARTMENT. WE REGULARLY REVIEW OUR HYBRID WORK MODEL, AND THE SPECIFIC REQUIREMENTS MAY CHANGE AT ANY TIME.\n\nRESPONSIBILITIES\n-MANAGE THE CYBER DEFENSE & ENGINEERING AND INFORMATION TECHNOLOGY SOURCING PORTFOLIO (E.G., CLOUD SOFTWARE, INFRASTRUCTURE, NETWORK SECURITY HARDWARE / SOFTWARE, ETC.)\n- YOU WILL FOCUS ON DRIVING ADOPTION AND EFFICIENT USE OF THE SOURCE-TO-PAY PROCESS THROUGH SYSTEM OPTIMIZATION AND PROACTIVE PARTNER OUTREACH ALONG WITH SOURCING MANAGEMENT, CONTRACT MANAGEMENT, AND NEGOTIATION SUPPORT WHERE APPLICABLE.\n- ESTABLISH AND MAINTAIN EFFECTIVE RELATIONSHIPS WITH BUSINESS UNITS AND INTERNAL SUPPORT ORGANIZATIONS ,AND EXTERNALLY WITH SUPPLIERS.\n- ESTABLISH SERVICE LEVEL AGREEMENTS WITH INTERNAL CUSTOMERS AND KEY PERFORMANCE INDICATORS FOR THE ORGANIZATION TO MEET ANNUAL OBJECTIVES AND LONG-TERM STRATEGIES.\n- DEFINE PROCESSES, DEVELOP PROCUREMENT POLICIES, AND CONTRIBUTE TO DIGITAL TRANSFORMATION INITIATIVES.\n- CONDUCT THOROUGH RESEARCH AND ANALYSIS TO IDENTIFY POTENTIAL CYBER DEFENSE & ENGINEERING AND INFORMATION TECHNOLOGY VENDORS THAT ALIGN WITH THE ORGANIZATION'S NEEDS AND STRATEGIC OBJECTIVES.\n- DEVELOP AND MANAGE REQUESTS FOR PROPOSALS, QUOTES, AND INFORMATION.\n- COLLABORATE WITH LEGAL AND PROCUREMENT TEAMS TO DEVELOP AND NEGOTIATE ALL DEPARTMENT VENDOR CONTRACTS, ENSURING OPTIMAL VALUE AND FAVORABLE TERMS, SERVICE LEVEL AGREEMENTS (SLAS), AND COST STRUCTURES THAT ALIGN WITH DEPARTMENT OBJECTIVES\n- PREPARE ALL EXECUTIVE SUMMARIES AND BUSINESS CASES FOR REVIEW AND MANAGEMENT APPROVAL.\n- WORK CLOSELY WITH FINANCE AND PROCUREMENT TEAMS TO ESTABLISH AND MANAGE DEPARTMENT SPEND BUDGETS EFFECTIVELY.\n- BENCHMARK SPEND, RFP DATA AND RETURN ON INVESTMENT.\n- OPTIMIZE VENDOR SPENDING FOR THE DEPARTMENT TO ACHIEVE COST SAVINGS WITHOUT COMPROMISING ON QUALITY. \n\nQUALIFICATIONS\n\n MINIMUM QUALIFICATIONS\n- EXCELLENT TIME MANAGEMENT AND NEGOTIATION SKILLS, A DEEP UNDERSTANDING OF STANDARD CYBER DEFENSE & ENGINEERING AND INFORMATION TECHNOLOGY TRENDS AND EMERGING TECHNOLOGIES, AND A PROVEN TRACK RECORD OF SUCCESSFUL VENDOR MANAGEMENT.\n- BACHELOR'S DEGREE IN BUSINESS, CYBER DEFENSE & ENGINEERING, INFORMATION TECHNOLOGY AND / OR A RELATED FIELD.\n- PROVEN EXPERIENCE AS A VENDOR MANAGER, CYBERSECURITY AND / OR IT PROCUREMENT MANAGER, STRATEGIC SOURCING MANAGER, OR A RELATED ROLE WITHIN THE INDUSTRY.\n- DEMONSTRATED ABILITY TO MANAGE MULTIPLE VENDORS AND COMPLEX CONTRACTS SIMULTANEOUSLY.\n- WILLING TO TRAVEL DOMESTICALLY 2-3 TIMES PER QUARTER AS STAKEHOLDERS ARE DISTRIBUTED ACROSS THE COUNTRY.\n\nPREFERRED QUALIFICATIONS\n- KNOWLEDGE OF CONTRACT MANAGEMENT PRINCIPLES AND BEST PRACTICES.\n- FAMILIARITY WITH RISK ASSESSMENT AND MITIGATION STRATEGIES IN VENDOR MANAGEMENT.\n- STRONG ORGANIZATIONAL AND TIME MANAGEMENT SKILLS.\n\n\nD&I STATEMENT\nTIKTOK IS COMMITTED TO CREATING AN INCLUSIVE SPACE WHERE EMPLOYEES ARE VALUED FOR THEIR SKILLS, EXPERIENCES, AND UNIQUE PERSPECTIVES. OUR PLATFORM CONNECTS PEOPLE FROM ACROSS THE GLOBE AND SO DOES OUR WORKPLACE. AT TIKTOK, OUR MISSION IS TO INSPIRE CREATIVITY AND BRING JOY. TO ACHIEVE THAT GOAL, WE ARE COMMITTED TO CELEBRATING OUR DIVERSE VOICES AND TO CREATING AN ENVIRONMENT THAT REFLECTS THE MANY COMMUNITIES WE REACH. WE ARE PASSIONATE ABOUT THIS AND HOPE YOU ARE TOO.\n\nACCOMMODATION STATEMENT\nTIKTOK IS COMMITTED TO PROVIDING REASONABLE ACCOMMODATIONS IN OUR RECRUITMENT PROCESSES FOR CANDIDATES WITH DISABILITIES, PREGNANCY, SINCERELY HELD RELIGIOUS BELIEFS OR OTHER REASONS PROTECTED BY APPLICABLE LAWS. IF YOU NEED ASSISTANCE OR A REASONABLE ACCOMMODATION, PLEASE REACH OUT TO US AT HTTPS://SHORTURL.AT/KTJP6\n\nDATA SECURITY STATEMENT\nTHIS ROLE REQUIRES THE ABILITY TO WORK WITH AND SUPPORT SYSTEMS DESIGNED TO PROTECT SENSITIVE DATA AND INFORMATION. AS SUCH, THIS ROLE WILL BE SUBJECT TO STRICT NATIONAL SECURITY-RELATED SCREENING. \n\nJOB INFORMATION:\n\n【FOR PAY TRANSPARENCY】COMPENSATION DESCRIPTION (ANNUALLY) THE BASE SALARY RANGE FOR THIS POSITION IN THE SELECTED CITY IS $88000 - $142200 ANNUALLY.COMPENSATION MAY VARY OUTSIDE OF THIS RANGE DEPENDING ON A NUMBER OF FACTORS, INCLUDING A CANDIDATE’S QUALIFICATIONS, SKILLS, COMPETENCIES AND EXPERIENCE, AND LOCATION. BASE PAY IS ONE PART OF THE TOTAL PACKAGE THAT IS PROVIDED TO COMPENSATE AND RECOGNIZE EMPLOYEES FOR THEIR WORK, AND THIS ROLE MAY BE ELIGIBLE FOR ADDITIONAL DISCRETIONARY BONUSES/INCENTIVES, AND RESTRICTED STOCK UNITS.OUR COMPANY BENEFITS ARE DESIGNED TO CONVEY COMPANY CULTURE AND VALUES, TO CREATE AN EFFICIENT AND INSPIRING WORK ENVIRONMENT, AND TO SUPPORT OUR EMPLOYEES TO GIVE THEIR BEST IN BOTH WORK AND LIFE. WE OFFER THE FOLLOWING BENEFITS TO ELIGIBLE EMPLOYEES: WE COVER 100% PREMIUM COVERAGE FOR EMPLOYEE MEDICAL INSURANCE, APPROXIMATELY 75% PREMIUM COVERAGE FOR DEPENDENTS AND OFFER A HEALTH SAVINGS ACCOUNT(HSA) WITH A COMPANY MATCH. AS WELL AS DENTAL, VISION, SHORT/LONG TERM DISABILITY, BASIC LIFE, VOLUNTARY LIFE AND AD&D INSURANCE PLANS. IN ADDITION TO FLEXIBLE SPENDING ACCOUNT(FSA) OPTIONS LIKE HEALTH CARE, LIMITED PURPOSE AND DEPENDENT CARE. OUR TIME OFF AND LEAVE PLANS ARE: 10 PAID HOLIDAYS PER YEAR PLUS 17 DAYS OF PAID PERSONAL TIME OFF (PPTO) (PRORATED UPON HIRE AND INCREASED BY TENURE) AND 10 PAID SICK DAYS PER YEAR AS WELL AS 12 WEEKS OF PAID PARENTAL LEAVE AND 8 WEEKS OF PAID SUPPLEMENTAL DISABILITY. WE ALSO PROVIDE GENEROUS BENEFITS LIKE MENTAL AND EMOTIONAL HEALTH BENEFITS THROUGH OUR EAP AND LYRA. A 401K COMPANY MATCH, GYM AND CELLPHONE SERVICE REIMBURSEMENTS. THE COMPANY RESERVES THE RIGHT TO MODIFY OR CHANGE THESE BENEFITS PROGRAMS AT ANY TIME, WITH OR WITHOUT NOTICE.",
    "job_skill_set": [
      "information technology",
      "data analysis",
      "network security",
      "collaboration",
      "problem solving",
      "communication",
      "organizational skills",
      "creativity",
      "cyber defense",
      "vendor management",
      "contract management",
      "negotiation",
      "procurement policies",
      "cloud software",
      "RFP management",
      "budget management",
      "digital transformation",
      "time management",
      "adaptability",
      "strategic thinking"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "budget",
      "cloud",
      "collaboration",
      "communication",
      "contract",
      "creativity",
      "cyber",
      "data",
      "defense",
      "digital",
      "engineering",
      "information",
      "informationtechnology",
      "management",
      "manager",
      "negotiation",
      "network",
      "organizational",
      "policies",
      "problem",
      "procurement",
      "rfp",
      "security",
      "skills",
      "software",
      "solving",
      "sourcing",
      "strategic",
      "technology",
      "thinking",
      "time",
      "transformation",
      "usds",
      "vendor"
    ]
  },
  {
    "job_id": "3900962717",
    "job_title": "Information Technology Specialist - Data Operations",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "COME BE A PART OF SOMETHING BIG! SMART MINDS, COOL JOBS AND AWESOME REWARDS! FUELED BY INNOVATION, TALENT AND AMBITION, THE AIR FORCE CIVILIAN SERVICE (AFCS) IS SEEKING CIVILIAN PROFESSIONALS PREPARED TO DEPLOY WAR-WINNING CAPABILITIES FOR THE UNITED STATES AIR FORCE.\nTHE AIR FORCE CIVILIAN SERVICE (AFCS) IS LOOKING FOR A FULL-TIME DATA OPERATIONS SPECIALIST (IT SPECIALIST DATAMGT), GS-2210-12, LOCATED AT THE A1 DIGITAL TRANSFORMATION ACTIVITY (A1 DTA), DATA SERVICES DIVISION, JB SAN ANTONIO - RANDOLPH AFB, IN UNIVERSAL CITY, TEXAS.\nTHIS POSITION SERVES AS A DATA OPERATIONS SPECIALIST/DATA ANALYST, RESPONSIBLE FOR CREATING, INTEGRATING, AND MAINTAINING A ROBUST DATA MANAGEMENT ENVIRONMENT. THE ROLE INVOLVES ESTABLISHING AND ENFORCING DATA QUALITY STANDARDS, AND MANAGING A CLOUD-ENABLED, SECURED REPORTING AND ANALYTICS CAPABILITY. THE CANDIDATE WILL ALSO BE RESPONSIBLE FOR REPRESENTING THE ORGANIZATION AT CONFERENCES AND MEETINGS, LEADING SPECIAL IT PROJECTS, AND STAYING UP-TO-DATE WITH RAPIDLY CHANGING TECHNOLOGY. THE ULTIMATE GOAL IS TO ESTABLISH A “SINGLE SOURCE OF TRUTH” REGARDING HR-RELATED DATA FOR TOTAL FORCE AIRMEN, PROVIDING SECURE, VISIBLE, ACCESSIBLE, UNDERSTANDABLE, TRUSTED, AND COST-EFFECTIVE INFORMATION FOR DECISION-MAKERS.\nIF THIS DESCRIBES YOU, APPLY NOW OR SHARE WITH A COLLEAGUE! THIS POSITION CAN CLOSE AT ANY TIME!\nSALARY RANGE: $88,205.00 – $114,663.00 (SALARY NEGOTIABLE)\nRELOCATION & RECRUITMENT INCENTIVES MAY OR MAY NOT APPLY BASED ON QUALIFICATIONS\nU.S. CITIZENSHIP\nMUST BE ABLE TO OBTAIN AND MAINTAIN A SECRET SECURITY CLEARANCE\nMUST BE ABLE TO OBTAIN AND MAINTAIN INFORMATION ASSURANCE CERTIFICATION SUCH AS SEC+\nKNOWLEDGE OF THE SOURCES, CHARACTERISTICS, AND USES OF THE ORGANIZATION’S DATA ASSETS.\nKNOWLEDGE OF DATABASE MANAGEMENT SYSTEMS, QUERY LANGUAGES, TABLE RELATIONSHIPS AND VIEWS.\nKNOWLEDGE OF DATA MINING AND DATA WAREHOUSING PRINCIPLES.\nKNOWLEDGE OF SYSTEM ARCHITECTURE, INTEGRATION TECHNIQUES, AND TESTING METHODS.\nABILITY TO ANALYZE COMPLEXITIES OF EXISTING TECHNOLOGY, REVIEW/REVISE/DEVELOP POLICY, INITIATE PLANS FOR ENHANCEMENTS, AND PROVIDE MANAGEMENT SUFFICIENT TECHNICAL AND COST ANALYSIS INFORMATION, THROUGH WRITTEN DOCUMENTATION AND ORAL BRIEFINGS, TO RENDER INFORMED JUDGMENTS.\nABILITY TO MAINTAIN AN UP-TO-DATE AWARENESS OF TECHNOLOGICAL ADVANCES AND PREDICT HOW MANAGEMENT CAN MEET FUTURE REQUIREMENTS.\nDESIRED SKILLS AND PREVIOUS ROLES HELD: DATA ANALYSIS, DATA QUALITY STANDARDS, DATA SECURITY, CLOUD ENABLED REPORTING AND ANALYTICS, DATABASE MGT SYSTEMS, DATA GOVERNANCE ANALYST, DATA MGT SPECIALIST, IT SPECIALIST, DATA ANALYST\nYOU WILL BE EVALUATED FOR THIS JOB BASED ON HOW WELL YOU MEET THE QUALIFICATIONS ABOVE.\nYOUR APPLICATION PACKAGE (RESUME, SUPPORTING DOCUMENTS) WILL BE USED TO DETERMINE YOUR ELIGIBILITY, AND QUALIFICATIONS.\nCLICK THE APPLY BUTTON TO COMPLETE AN APPLICATION AND UPLOAD RESUME (PDF OR WORD DOC) MUST INCLUDE NAME AND CONTACT INFORMATION AND/OR ADDITIONAL DOCUMENTS (TRANSCRIPTS, CERTIFICATIONS, VET DOCS (DD214), SF-50).\nFOR TIPS ON HOW TO WRITE A FEDERAL RESUME, CHECKOUT THE FOLLOWING LINK(S): HTTPS://AFCIVILIANCAREERS.COM/PDF/FEDERALRESUMEWRITING.PDF\nTO RECEIVE ADDITIONAL INFORMATION ABOUT CURRENT AND FUTURE JOB OPENINGS WITH AFCS VIA EMAIL NOTIFICATION, PLEASE SUBSCRIBE AT HTTPS://AFCIVILIANCAREERS.COM/FIND-A-JOB/ AND SIGN UP TO “GET CAREER UPDATES.”\nU.S. CITIZENSHIP REQUIRED. AFCS IS EQUAL OPPORTUNITY EMPLOYER. MUST BE OF LEGAL WORKING AGE.",
    "job_skill_set": [
      "data management",
      "database management systems",
      "data security",
      "system architecture",
      "integration techniques",
      "testing methods",
      "communication",
      "problem solving",
      "analytical thinking",
      "adaptability",
      "project management",
      "team collaboration",
      "technical documentation",
      "data analysis",
      "cloud reporting and analytics",
      "data quality standards",
      "data mining",
      "data warehousing",
      "information assurance certification (e.g., Sec+)"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "analytical",
      "analytics",
      "and",
      "architecture",
      "assurance",
      "certification",
      "cloud",
      "collaboration",
      "communication",
      "data",
      "database",
      "documentation",
      "eg",
      "information",
      "informationtechnology",
      "integration",
      "management",
      "methods",
      "mining",
      "operations",
      "problem",
      "project",
      "quality",
      "reporting",
      "sec",
      "security",
      "solving",
      "specialist",
      "standards",
      "system",
      "systems",
      "team",
      "technical",
      "techniques",
      "technology",
      "testing",
      "thinking",
      "warehousing"
    ]
  },
  {
    "job_id": "3891069919",
    "job_title": "Information Technology Support Technician",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "IT SUPPORT HELP DESKDENVER, CO (ONSITE)$20 - $25/HR ON W2  REQUIREMENTS:1/2 YEARS DESKTOP SUPPORT EXPERIENCE SUPPORTING MICROSOFT WINDOWS 1/2 YEARS SUPPORTING MOBILE USERS IN A CORPORATE OFFICE ENVIRONMENT. ABILITY TO DIAGNOSE AND REPAIR PC AND LAPTOP HARDWARE COMPONENTS. ABILITY TO IDENTIFY, ISOLATE AND RESOLVE IT PROBLEMS / REQUESTS.MICROSOFT OFFICE 2016/OFFICE 365EXPERIENCE OF CONFIGURING MOBILE DEVICES E.G. IOS, ANDROID AND BLACKBERRY UTILIZING MOBILE DEVICE MANAGEMENT PLATFORMS. RESPONSIBILITIES:ENSURE SUPPORT CALLS ARE RESOLVED AND USERS ARE INFORMED OF PROGRESS AT AGREED INTERVALS TO EMPLOYEES BOTH IN THE OFFICE, AT REMOTE LOCATIONS, AND DURING BUSINESS TRAVEL; MEETING SLAS.CONDUCT USER TRAINING ON INTERNAL APPLICATIONS AS REQUIRED.MAINTAIN DOCUMENTATION AND ASSET TRACKING INFORMATION WHERE APPROPRIATE.ASSUMES ADDITIONAL DUTIES AS ASSIGNED.WILL REQUIRE OCCASIONAL OUT OF HOURS WORK INCLUDING BANK HOLIDAYS AND WEEKENDS.PARTICIPATES IN ON-CALL ROTATION. THE DESKTOP SERVICES TECHNICIAN WILL BE PART OF A TEAM ENGAGED IN DAILY SUPPORT, PROBLEM DIAGNOSIS AND PROJECT WORK TO BOTH IT AND THE BUSINESS. THE ANALYST WILL WORK WITHIN THE IT INFRASTRUCTURE TEAM USING TECHNOLOGY MANAGEMENT TOOLS TO ENSURE THE INFRASTRUCTURE ENVIRONMENT PROVIDES A RELIABLE AND SECURE PLATFORM THAT IS FIT FOR BUSINESS PURPOSE.  EQUAL OPPORTUNITY EMPLOYER/VETERANS/DISABLEDBENEFIT OFFERINGS INCLUDE MEDICAL, DENTAL, VISION, TERM LIFE INSURANCE, SHORT-TERM DISABILITY INSURANCE, ADDITIONAL VOLUNTARY BENEFITS, COMMUTER BENEFITS AND 401K PLAN. OUR PROGRAM PROVIDES EMPLOYEES THE FLEXIBILITY TO CHOOSE THE TYPE OF COVERAGE THAT MEETS THEIR INDIVIDUAL NEEDS. AVAILABLE PAID LEAVE MAY INCLUDE PAID SICK LEAVE, WHERE REQUIRED BY LAW; ANY OTHER PAID LEAVE REQUIRED BY FEDERAL, STATE OR LOCAL LAW; AND HOLIDAY PAY UPON MEETING ELIGIBILITY CRITERIA. DISCLAIMER: THESE BENEFIT OFFERINGS DO NOT APPLY TO CLIENT-RECRUITED JOBS AND JOBS WHICH ARE DIRECT HIRE TO A CLIENT TO READ OUR CANDIDATE PRIVACY INFORMATION STATEMENT, WHICH EXPLAINS HOW WE WILL USE YOUR INFORMATION, PLEASE VISIT HTTPS://WWW.MODIS.COM/EN-US/CANDIDATE-PRIVACY/THE COMPANY WILL CONSIDER QUALIFIED APPLICANTS WITH ARREST AND CONVICTION RECORDS.",
    "job_skill_set": [
      "Microsoft Office 2016",
      "documentation",
      "communication",
      "customer service",
      "problem solving",
      "time management",
      "desktop support",
      "Microsoft Windows",
      "PC hardware repair",
      "Office 365",
      "mobile device management",
      "iOS",
      "Android",
      "Blackberry",
      "IT problem diagnosis",
      "teamwork",
      "training",
      "flexibility"
    ],
    "short_keywords": [
      "2016",
      "365",
      "android",
      "blackberry",
      "communication",
      "customer",
      "desktop",
      "device",
      "diagnosis",
      "documentation",
      "flexibility",
      "hardware",
      "information",
      "informationtechnology",
      "ios",
      "it",
      "management",
      "microsoft",
      "mobile",
      "office",
      "pc",
      "problem",
      "repair",
      "service",
      "solving",
      "support",
      "teamwork",
      "technician",
      "technology",
      "time",
      "training",
      "windows"
    ]
  },
  {
    "job_id": "3889439746",
    "job_title": "Information Technology Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "HELPDESK MANAGER | HYBRID IN CT | UP TO $140,000\n🌐 ARE YOU AN EXPERIENCED IT MANAGER?\n🌐 DO YOU ENJOY SHARING YOUR KNOWLEDGE AND DEVELOPING YOUR STAFF?\nCLIENT: IT CONSULTANCY OPERATING ACROSS MULTIPLE INDUSTRIES, PROVIDING MANAGED IT SERVICES, CYBER SECURITY, NETWORKING AND CLOUD SERVICES.\nYOU WILL BE RESPONSIBLE FOR OWNING AND DRIVING THE SERVICE DESK FUNCTION, CREATING ROADMAPS, AND MANAGING A TEAM OF 25+ PEOPLE. YOU WILL LEAD, DEVELOP AND TRAIN YOUR DIRECT REPORTS, WHILST REMAINING HANDS ON AND TECHNICAL.\nWHAT DO YOU NEED?EXPERIENCE MANAGING A TEAM OF IT PROFESSIONALSOFFICE 365ACTIVE DIRECTORY / ENTRA IDEXCELLENT COMMUNICATION\nWHAT WILL I GET?STARTING ANNUAL SALARY UP TO $140,000FULL BENEFITS PACKAGE IN FULL FLEX PTOHYBRID WORKING SCHEDULEPOSITIVE & SUPPORTIVE ENVIRONMENT\nIF THIS INTERESTS YOU, CLICK APPLY OR REACH OUT TO ME WITH YOUR LATEST RESUME AS SOON AS POSSIBLE. 📩",
    "job_skill_set": [
      "IT Management",
      "Cyber Security",
      "Networking",
      "Team Management",
      "Technical Skills",
      "Communication",
      "Leadership",
      "Training",
      "Knowledge Sharing",
      "Problem Solving",
      "Service Desk Management",
      "Office 365",
      "Active Directory",
      "Cloud Services"
    ],
    "short_keywords": [
      "365",
      "active",
      "cloud",
      "communication",
      "cyber",
      "desk",
      "directory",
      "information",
      "informationtechnology",
      "it",
      "knowledge",
      "leadership",
      "management",
      "manager",
      "networking",
      "office",
      "problem",
      "security",
      "service",
      "services",
      "sharing",
      "skills",
      "solving",
      "team",
      "technical",
      "technology",
      "training"
    ]
  },
  {
    "job_id": "3902828671",
    "job_title": "Information Technology Support Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "SUMMARY:REPORTING TO THE MANAGER, IT HELP DESK, THE TECHNICAL ANALYST IS PRIMARILY RESPONSIBLE FOR TROUBLESHOOTING AND RESOLVING ALL ASSIGNED TECHNICAL ISSUES. ALL CLIENT-LEVEL ISSUES AND REQUESTS ARE TO BE ADDRESSED BY THE TECHNICAL ANALYST. IN THE EVENT AN ISSUE OR REQUEST IS DETERMINED TO BE OUTSIDE THE TECHNICAL ANALYSTS ABILITIES TO RESOLVE THEY ARE REQUIRED TO DOCUMENT ALL TROUBLESHOOTING STEPS PERFORMED AND ESCALATE THE ISSUE USING ESTABLISHED PROCEDURES. THE TECHNICAL ANALYST IS RESPONSIBLE FOR COMPLETING RECURRING MAINTENANCE TASKS AND ASSIGNED PROJECTS IN A TIMELY AND ACCURATE FASHION.THE NATIONALS ARE A MILITARY-FRIENDLY ORGANIZATION ACTIVELY RECRUITING VETERANS AND SPOUSES.ESSENTIAL DUTIES AND RESPONSIBILITIES: SERVE AS A FUNCTIONAL BACKUP AND ADDITIONAL QUALITY CHECK FOR ALL EQUIPMENT LIFECYCLE PROCESSES.RECEIVE AND DOCUMENT SUPPORT REQUESTS/INQUIRIES MADE TO THE IT DEPARTMENT VIA EMAIL, PHONE OR OTHER MEDIUM AND LOGGING AND ASSIGNING THOSE REQUESTS IN A TICKET MANAGEMENT SYSTEM.COLLABORATE WITH THE OTHER MEMBERS OF THE IT DEPARTMENT TO SUCCESSFULLY COMPLETE ENTERPRISE TECHNOLOGY PROJECTS ON TIME AND WITHIN BUDGET.RESPOND TO AND RESOLVE ALL SUPPORT REQUESTS/INQUIRIES IN A TIMELY FASHION UTILIZING ESTABLISHED PROCEDURES AND ESCALATIONS.COLLABORATE WITH INTERNAL AND EXTERNAL RESOURCES AS NECESSARY TO ACHIEVE DESIRED RESULTS.DEVELOP AND MAINTAIN DOCUMENTATION INCLUDING, BUT NOT LIMITED TO, STANDARD OPERATING PROCEDURES, EQUIPMENT INSTALLATION METHODOLOGIES, PROJECT PLANS AND ENVIRONMENT CONFIGURATIONS.BECOME INTIMATELY FAMILIAR WITH AND ADHERE TO COMPANY AND DEPARTMENTAL OPERATING POLICIES AND PROCEDURES.OTHER DUTIES AS ASSIGNED.\nWORKING RELATIONSHIPSMUST EFFECTIVELY AND EFFICIENTLY COMMUNICATE WITH OTHER MEMBERS OF THE IT DEPARTMENT AT ALL LEVELS OF THE ORGANIZATIONAL CHART TO PROVIDE SUPPORT; INTERACT WITH THE USER COMMUNITY IN A PROFESSIONAL, COURTEOUS AND HELPFUL MANNER; AND INTERACT WITH OUTSIDE IT HARDWARE, SOFTWARE AND SUPPORT VENDORS.REQUIREMENTS:MINIMUM EDUCATION AND EXPERIENCE REQUIREMENTS:ASSOCIATE’S DEGREE OR EQUIVALENT BUSINESS OR MILITARY EXPERIENCEMINIMUM OF 4 YEARS HANDS ON EXPERIENCE WORKING IN A TECHNOLOGY CUSTOMER SERVICE ENVIRONMENTPREFERRED:RELEVANT INDUSTRY RECOGNIZED CERTIFICATIONSEXPERIENCE WORKING IN A DECENTRALIZED MULTI-SITE ORGANIZATIONEXPERIENCE WITH CALL CENTER APPLICATIONS AND FUNCTIONSEXPERIENCE WITH SERVICE DESK TICKETING/SERVICE APPLICATIONS AND FUNCTIONSKNOWLEDGE, SKILLS, AND ABILITIES NECESSARY TO PERFORM ESSENTIAL FUNCTIONS:FAMILIARITY WITH COMMON OPERATING SYSTEMS AND SOFTWARE SUITESABILITY TO QUICKLY LEARN NEW TECHNOLOGIES AND PROVIDE TECHNICAL SUPPORT AND USER TRAININGHIGHLY MOTIVATED WITH A STRONG WORK ETHICEXTRAORDINARY ORGANIZATIONAL AND PRIORITIZATION SKILLSCAPABLE OF FOLLOWING INSTRUCTIONS AND RESPONDS WELL TO DIRECTIONSENSITIVE TO DEADLINES AND COMPLETES TASKS ON TIMEABILITY TO UTILIZE GOOD JUDGEMENT TO ANTICIPATE NEEDS AND COMPLETE TASKSEFFICIENT AT MULTITASKING IN A FAST-PACED AND DEMANDING ENVIRONMENTWELL SUITED FOR PARTICIPATION IN MULTIDISCIPLINARY, HIGH-PERFORMANCE WORK TEAMSEXCELLENT VERBAL, WRITTEN, PRESENTATION AND INTERPERSONAL SKILLSABILITY TO READ AND COMPREHEND TECHNICAL DOCUMENTS, SHORT CORRESPONDENCE AND MEMOSPROFICIENT AT TYPING AND IN THE USE OF COMPUTER SOFTWARE PROGRAMSCAPABLE OF DOCUMENTING ALL DUTIES PERFORMED IN RELEVANT SYSTEMS USING CLEAR AND DETAILED LANGUAGEUPHOLD CORE VALUES: EXCELLENCE, PERFORMANCE, AND ACCOUNTABILITY. THESE CORE VALUES SET THE TONE IN EVERYTHING WE DO, HELP US SUCCEED ON AND OFF THE FIELD, MAKE A DIFFERENCE IN THE COMMUNITY AND PROVIDE THE BEST GUEST EXPERIENCE IN SPORTS. IT IS IMPORTANT THAT THE PERSON IN THE POSITION COMMITS THEMSELVES TO THESE CORE VALUES SO THAT WE CAN CONSTANTLY MOVE FORWARD IN THE SAME DIRECTION – TOGETHER",
    "job_skill_set": [
      "customer service",
      "computer software",
      "communication",
      "teamwork",
      "organization",
      "judgment",
      "motivation",
      "interpersonal skills",
      "adaptability",
      "troubleshooting",
      "ticket management system",
      "technical support",
      "documentation",
      "operating systems",
      "call center applications",
      "service desk applications",
      "multitasking",
      "time management"
    ],
    "short_keywords": [
      "adaptability",
      "applications",
      "call",
      "center",
      "communication",
      "computer",
      "customer",
      "desk",
      "documentation",
      "information",
      "informationtechnology",
      "interpersonal",
      "judgment",
      "management",
      "motivation",
      "multitasking",
      "operating",
      "organization",
      "service",
      "skills",
      "software",
      "specialist",
      "support",
      "system",
      "systems",
      "teamwork",
      "technical",
      "technology",
      "ticket",
      "time",
      "troubleshooting"
    ]
  },
  {
    "job_id": "3891079268",
    "job_title": "Information Technology Business Analyst",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "ENCORE TALENT IS SEEKING AN IT BUSINESS ANALYST (SAP FINANCE & ACCOUNTING) TO COLLABORATE WITH INTERNAL AND EXTERNAL STAKEHOLDERS. RESPONSIBILITIES INCLUDE IDENTIFYING AND DOCUMENTING REQUIREMENTS LINKED TO BUSINESS AND IT INITIATIVES, SPEARHEADING TECHNICAL PROJECTS, DELINEATING TEST SCENARIOS AND USE CASES, VALIDATING TECHNICAL DELIVERABLES, EXPLORING TECHNICAL SOLUTIONS, AND OFFERING SUPPORT AND CONSULTATION TO BUSINESS AREAS TO ENSURE IT AND BUSINESS ALIGNMENT.\nRESPONSIBILITIES:\nWORK WITH INTERNAL AND EXTERNAL CUSTOMERS TO GATHER, ORGANIZE, AND DOCUMENT STAKEHOLDER REQUIREMENTS FOR PROJECTS AND APPLICATION ENHANCEMENTS.DELIVER SAP CONFIGURATION SUPPORT WITHIN ALL FINANCE-RELATED MODULES INCLUDING GENERAL LEDGER, ACCOUNTS PAYABLE, ACCOUNTS RECEIVABLE, FIXED ASSETS, COST CENTER ACCOUNTING, PROFIT CENTER ACCOUNTING, AND INTERNAL ORDERS.DEVELOP AND MAINTAIN A STRONG SAP USER COMMUNITY THROUGH END-USER TRAINING, SUPPORT, AND KNOWLEDGE SHARING TO KEEP SOLUTION ALIGNED WITH THE BUSINESS.PERFORM STAKEHOLDER, IMPACT, AND GAP ANALYSIS.FACILITATE REQUIREMENTS GATHERING SESSIONS AND PROJECT STATUS MEETINGS.DEVELOP BUSINESS CASES AND SCOPE FOR PROPOSED PROJECTS.CONSTRUCT AND MANAGE DETAILED PROJECT PLANS, WORK BREAKDOWN STRUCTURES, AND MASTER TEST PLANS.CREATE AND EXECUTE TEST SCENARIOS.COORDINATE QUALITY ACCEPTANCE TESTING AND USER ACCEPTANCE TESTING.DEVELOP AND EXECUTE TRAINING PLANS FOR CURRENT APPLICATION CHANGES AND NEW APPLICATION RELEASES.CREATE AND MANAGE CHANGE REQUESTS AND SOFTWARE ENHANCEMENT REQUESTS.ASSIST IN TROUBLESHOOTING POST-IMPLEMENTATION ISSUES FOR PROJECTS.MANAGE POC (PROOF OF CONCEPT), RFP (REQUEST FOR PROPOSAL), AND RFQ (REQUEST FOR PROPOSAL) PROCESS.FACILITATE ROOT CAUSE ANALYSIS AND SOLUTION DEVELOPMENT ACTIVITIES; ANALYZE AND QUANTIFY THE POTENTIAL VALUE OF THE SOLUTION OPTIONS.PROVIDE SUPPORT AND CONSULTING SERVICES FOR VARIOUS TECHNOLOGY SYSTEMS.FUNCTION AS THE LIAISON BETWEEN IT AND THE BUSINESS TO ENSURE THE SUCCESSFUL DELIVERY OF PROJECTS AND APPLICATION ENHANCEMENTS, TIMELY IDENTIFICATION AND RESOLUTION OF TECHNOLOGY-RELATED ISSUES, DELIVERY OF QUALITY IT SERVICES, AND STRATEGIC ALIGNMENT BETWEEN IT AND THE BUSINESS.CULTIVATE AND MANAGE RELATIONSHIPS WITH VENDORS TO ENSURE EXPECTATIONS ARE CLEARLY COMMUNICATED, PROJECT DELIVERABLES ARE PROVIDED IN A TIMELY MANNER, QUALITY STANDARDS ARE MET, AND SLA ARE ADHERED TO. REVIEW, EVALUATE, AND DEVELOP RECOMMENDATIONS FOR ENHANCEMENTS AND SUPPORT OF APPLICATIONS.IDENTIFY OPPORTUNITIES FOR PROCESS IMPROVEMENT, COST REDUCTION, AND AUTOMATION WITHIN IT AND THE VARIOUS LINES OF BUSINESS. CONDUCT RESEARCH, ANALYZE DATA, AND DEVELOP INSIGHTS TO ASSIST IN PROJECT PLANNING AND DECISION-MAKING.WORK WITH PROGRAMMING RESOURCES TO ENSURE SYSTEM ENHANCEMENTS FOLLOW THE APPROPRIATE IT GUIDELINES, MEET OR EXCEED USER REQUIREMENTS, AND ARE COMPLETED ON TIME.PREPARE TECHNICAL REPORTS BY COLLECTING, ANALYZING, AND SUMMARIZING INFORMATION AND TRENDS.RUN AD-HOC REPORTS USING SQL QUERIES, SAP TOOLS, OR OTHER REPORTING TOOLS.PERFORM JOB DUTIES IN COMPLIANCE WITH ALL LOCAL, STATE, AND FEDERAL REGULATIONS AND COMPANY POLICIES.\nQUALIFICATIONS:\nUS CITIZEN OR GREEN CARD HOLDERFOCUSED EXPERIENCE WORKING DIRECTLY WITH FINANCE AND ACCOUNTING DEPARTMENTS.3+ YEARS OF RELEVANT BUSINESS ANALYSIS EXPERIENCE.EXPERIENCE WITH SAP S4 REQUIRED.3-5 YEARS OF EXPERIENCE WITH SAP FI (GL, AP, AR, FA), CO (CCA, PCA, INTERNAL ORDERS)EXPERIENCE WITH LARGE SOFTWARE IMPLEMENTATIONS AND SYSTEMS INTEGRATIONS.EXPOSURE TO VARIOUS PROJECT METHODOLOGIES (AGILE, WATERFALL, OR HYBRID OF BOTH).EXPERIENCE CREATING TEST PLANS AND FACILITATING USER ACCEPTANCE TESTING.EXPERIENCE CONSTRUCTING BUSINESS CASES AND PROVIDING TECHNOLOGY SUPPORT.FOCUSED EXPERIENCE WORKING DIRECTLY WITH EXTERNAL VENDORS.EXPERIENCE WITH SAC ANALYTICS AND SAC PLANNING PREFERRED.2+ YEARS OF RELEVANT PROJECT MANAGEMENT EXPERIENCE PREFERRED.1-3 YEARS OF WORKING WITH ERP APPLICATIONS PREFERRED.FAMILIARITY WITH ALL TYPES OF TECHNICAL DOCUMENTATION (BUSINESS REQUIREMENT DOCUMENTS, PROCESS MAPS, SYSTEM DIAGRAMS, USER EXPERIENCE, USES CASES, USER STORIES, TEST PLANS, TEST CASES, ETC.)EXCELLENT COMMUNICATION AND PRESENTATION SKILLS; ABLE TO EFFECTIVELY CONVEY INFORMATION TO STAKEHOLDERS AT ALL LEVELS OF THE ORGANIZATION.FAMILIARITY WITH PROJECT MANAGEMENT TOOLS, METHODOLOGIES, AND BEST PRACTICESSTRONG INTERPERSONAL SKILLS WITH THE ABILITY TO WORK INDEPENDENTLY OR AS PART OF A TEAM.ABILITY TO MULTI-TASK, EFFECTIVELY PRIORITIZE WORK, AND MANAGE MULTIPLE ASSIGNMENTS CONCURRENTLY.STRONG ANALYTICAL AND PROBLEM-SOLVING SKILLS WITH ATTENTION TO DETAIL.ABILITY TO DIRECT AND PRIORITIZE THE WORKLOAD OF A TEAM.STRONG PLANNING AND ORGANIZATION SKILLS.PASSION FOR CUSTOMER SERVICE, EFFICIENCY, EFFECTIVENESS, PRECISION, AND QUALITY.TEAM PLAYER WITH A WILLINGNESS TO ASSIST OTHERS AND SHARE EXPERTISE.ABLE TO WORK FLEXIBLE HOURS; EXPECTED TO WORK NIGHTS AND WEEKENDS AS NEEDED.ABILITY TO TRAVEL BETWEEN OFFICES, AS REQUIRED.\nENCORE TALENT SOLUTIONS IS AN EQUAL OPPORTUNITY EMPLOYER. WE RESPECT AND SEEK TO EMPOWER EACH INDIVIDUAL AND SUPPORT THE DIVERSE CULTURES, PERSPECTIVES, SKILLS, AND EXPERIENCES WITHIN OUR WORKFORCE.",
    "job_skill_set": [
      "SQL",
      "Project Management",
      "Technical Documentation",
      "Communication",
      "Interpersonal Skills",
      "Analytical Skills",
      "Problem Solving",
      "Teamwork",
      "Time Management",
      "Customer Service",
      "Organizational Skills",
      "Leadership",
      "SAP Finance & Accounting",
      "SAP S4",
      "SAP FI (GL, AP, AR, FA)",
      "SAP CO (CCA, PCA, Internal Orders)",
      "SAC Analytics",
      "SAC Planning",
      "Business Case Development",
      "Test Plan Creation",
      "User Acceptance Testing",
      "Reporting Tools",
      "Flexibility"
    ],
    "short_keywords": [
      "acceptance",
      "accounting",
      "analyst",
      "analytical",
      "analytics",
      "ap",
      "ar",
      "business",
      "case",
      "cca",
      "co",
      "communication",
      "creation",
      "customer",
      "development",
      "documentation",
      "fa",
      "fi",
      "finance",
      "flexibility",
      "gl",
      "information",
      "informationtechnology",
      "internal",
      "interpersonal",
      "leadership",
      "management",
      "orders",
      "organizational",
      "pca",
      "plan",
      "planning",
      "problem",
      "project",
      "reporting",
      "s4",
      "sac",
      "sap",
      "service",
      "skills",
      "solving",
      "sql",
      "teamwork",
      "technical",
      "technology",
      "test",
      "testing",
      "time",
      "tools",
      "user"
    ]
  },
  {
    "job_id": "3901942048",
    "job_title": "Director of Information Technology",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "EXECUTIVE SEARCH PARTNERS IS A FORBES-RECOGNIZED NATIONWIDE IT SEARCH COMPANY.\nOUR CLIENT IS A $400M CONSTRUCTION PRODUCTS COMPANY.\nTHEY ARE SEEKING A DIRECTOR OF IT TO DEVELOP AND IMPLEMENT IT CAPABILITIES ACROSS ALL LOCATIONS INCLUDING CLOUD MIGRATION, COMMON INFRASTRUCTURE, ROBUST CYBERSECURITY SECURITY, AND ERP. HERE ARE SOME MORE SPECIFICS:1. LOCATION: EASTERN PART OF THE US2. COMPENSATION: SALARY, BENEFITS. SALARY RANGE IS $190,000 TO $210,000 DEPENDING UPON EXPERIENCE. FULL BENEFITS INCLUDING HEALTH, DENTAL, VISION, AND PTO: 3 WEEKS VACATION AND 12 COMPANY HOLIDAYS.3. TRAVEL: UP TO 50% - PRIMARILY TO EAST COAST LOCATIONS.4. REPORT TO: CFO/COO5. IT STAFFING AND SUPPORT: 8 (GROWING TO 17) PEOPLE PLUS MANAGED SERVICE PROVIDER\nQUALIFICATIONS· BACHELOR'S DEGREE IN INFORMATION TECHNOLOGY OR A RELATED FIELD· 10+ YEARS' OF EXPERIENCE WITH IT LEADERSHIP· EXPERIENCED IN IMPLEMENTING M365 DYNAMICS ERP SYSTEM FOR A MANUFACTURING OR DISTRIBUTION OR CONSTRUCTION COMPANY· CLOUD MIGRATION EXPERIENCE· CYBERSECURITY EXPERIENCE. INFRASTRUCTURE DESIGN AND IMPLEMENTATION EXPERIENCE",
    "job_skill_set": [
      "cybersecurity",
      "communication",
      "strategic planning",
      "team management",
      "problem solving",
      "adaptability",
      "cloud migration",
      "ERP implementation",
      "infrastructure design",
      "M365 Dynamics ERP",
      "IT leadership",
      "IT staffing and support"
    ],
    "short_keywords": [
      "adaptability",
      "and",
      "cloud",
      "communication",
      "cybersecurity",
      "design",
      "director",
      "dynamics",
      "erp",
      "implementation",
      "information",
      "informationtechnology",
      "infrastructure",
      "it",
      "leadership",
      "m365",
      "management",
      "migration",
      "of",
      "planning",
      "problem",
      "solving",
      "staffing",
      "strategic",
      "support",
      "team",
      "technology"
    ]
  },
  {
    "job_id": "3903453569",
    "job_title": "Information Technology Asset Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOB TITLE: IT ASSET SYSTEM ANALYSTLOCATION: PLANO, TXDURATION: FULL TIME JOB RESPONSIBILITIES: · STORE/UPDATE SOPS PULL REPORTS OUT OF SNOW, MEET WITH APPLICATION OWNERS TO GATHER DATA AND COORDINATE WORK· PERFORM DAILY AND LONG-TERM OPERATIONAL AND STRATEGIC MANAGEMENT OF HARDWARE AND SOFTWARE· PLAN, MONITOR, AND RECORD HARDWARE ASSETS AND/OR SOFTWARE LICENSE TO MAKE SURE THEY COMPLIED WITH VENDOR CONTRACTS IN DIFFERENT SOFTWARE TOOLS· APPLY A CONTINUOUS IMPROVEMENT APPROACH IN ENHANCING THE STRATEGIES EMPLOYED IN TECHNOLOGY SPENDING, AS WELL AS IN TRACKING COMPANY ASSETS WITHIN THE CONFIGURATION MANAGEMENT DATABASE (CMDB) THROUGHOUT THEIR LIFECYCLE· ENSURE EFFECTIVE MANAGEMENT OF THE CMDB AND THAT THE CONTENT CONTAINED IS ACCURATE· PROVIDE SUPERVISION TO STAFF OF PROCUREMENT ANALYSTS· PROVIDE KPI/METRIC INFORMATION AND STANDARDIZED REPORTING ON A SCHEDULED BASIS TOGETHER WITH UNSCHEDULED REPORTING DEMANDED BY MANAGEMENT· TAKE PART IN VARIOUS PROJECTS, PROVIDING SUPPORT TO VPS OF INFRASTRUCTURE AND FINANCE· RECRUIT A SMALL TEAM OF ASSET ANALYSTS AND SUPERVISE THEIR PERFORMANCE· DEFINE AND ENHANCE SCHEME FOR IDENTIFYING HARDWARE AND SOFTWARE-RELATED ASSETS AS WELL AS CIS, INCLUDING VERSIONING AND DEPENDENCIES IN THE ASSET MANAGEMENT TOOLS, ATTRIBUTES, THE CONTRACT MANAGEMENT LIBRARY, AND THE CMDB· MANAGE INVENTORY OF CIS AND ASSETS, INCLUDING DEPENDENCIES AND ATTRIBUTES), MAKING SURE THAT MODIFICATIONS, WITHDRAWALS, AND ADDITIONS OF EXISTING ONES ARE CORRECTLY RECORDED BY THE TEAMS IN CHARGE IN THE TOOLS TO ENSURE THAT THE VENDOR CONTRACTS ARE COMPLIED WITH· RESPONSIBLE FOR MANAGING LIFECYCLE OF HARDWARE AND SOFTWARE MODELS IN THE DML RIGHT FROM THEIR INTRODUCTION TO THEIR RETIREMENT· GENERATE AND DISTRIBUTE VARIOUS REPORTS, INCLUDING COMPLIANCE REPORTS ON CURRENT ASSETS AND CIS AND THEIR STATUS; ALSO PERFORM TREND ANALYSIS· PERFORM VERIFICATION AND AUDIT OF DML AND CMDB CONTENT; VERIFY SOFTWARE ASSETS WITH LICENSE CONTRACTS, CONFIRM HARDWARE ASSETS WITH ACTUAL INVENTORY, AND INITIATE CORRECTIVE ACTIONS AND TRACT THEM· MANAGE ACTIVITIES CONCERNING LICENSE COMPLIANCE AUDITS TO BE ABLE TO ANSWER TO REQUESTS FROM SOFTWARE EDITORS EFFECTIVELY· ENSURE PROCESS EFFICIENCY BY IMPLEMENTING THE KEY PERFORMANCE INDICATORS; SUGGEST IMPROVEMENTS TO THE PROCESS CONTINUOUSLY· DESIGN PROCESSES RELATING TO SOFTWARE AND HARDWARE ASSET MANAGEMENT, EXECUTE AND ENHANCE THEM· ESTABLISH AND MAINTAIN DOCUMENTATION OF PROCEDURES, PROCESSES, AND REPORTS CONCERNING ASSET AND CONFIGURATION MANAGEMENT· TAKE PART IN OTHER ITSM PROCESSES, OR AS REQUIRED PERFORM AS A BACK UP TO MAINTAIN OPERATIONAL ACTIVITIES· CREATE AND EXECUTE GOVERNANCE AND STRATEGIC ASSET MANAGEMENT FUNCTION· COLLABORATE WITH INFRASTRUCTURE TEAMS TO DETERMINE TRENDS IN ASSET PERFORMANCE· PERFORM RESEARCH ON INDUSTRY BEST PRACTICE AND INCORPORATE IT WITH ORGANIZATIONAL PRACTICES· ESTABLISH AND MAINTAIN HARDWARE AND SOFTWARE MAINTENANCE DATABASES. REQUIRED SKILLS: · STRONG KNOWLEDGE OF IT SOFTWARE AND HARDWARE AS WELL AS FIVE OR MORE YEARS EXPERIENCE WORKING AS AN IT ASSET ANALYST· FIVE YEARS OR MORE EXPERIENCE MANAGING STAFF· STRONG KNOWLEDGE AND FIVE YEARS PLUS EXPERIENCE WORKING WITH A CMDB AND THE SPECIFIC BUSINESS SERVICES THAT IT SUPPORTS· FIVE YEARS OR MORE ITSM TOOL EXPERIENCE, AS WELL AS SERVICENOW EXPERIENCE· PROVEN ABILITY AND EXPERIENCE IN EXECUTING STRATEGIC ASSET MANAGEMENT PROCESSES SUCCESSFULLY· PROFOUND KNOWLEDGE OF LICENSING AGREEMENTS INVOLVING SOFTWARE, INCLUDING MICROSOFT, IBM, AND ORACLE· STRONG VENDOR MANAGEMENT AND NEGOTIATION SKILLS· STRONG KNOWLEDGE OF IT SERVICE MANAGEMENT PROCESSES, AS WELL AS EXPERIENCE WITH DISCOVERY TOOL· POSSESS BACHELOR’S DEGREE IN INFORMATION TECHNOLOGY, COMPUTER SCIENCE, OR BUSINESS ADMINISTRATION, OR IN OTHER RELATED FIELD· STRONG ABILITY TO CARRY OUT ASSIGNED TASKS INDEPENDENTLY WITH LITTLE SUPERVISION· EXCELLENT AT PERFORMING MULTIPLE TASKS AT THE SAME TIME WITHOUT ERRING· EXCELLENT COMMUNICATION AND INTERPERSONAL SKILLS\nPOSSESS IAITAM CERTIFICATION, SUCH AS CHAMP, CSAM, AND CITAM",
    "job_skill_set": [
      "hardware management",
      "project management",
      "database management",
      "documentation",
      "communication",
      "interpersonal skills",
      "independence",
      "multitasking",
      "leadership",
      "problem solving",
      "collaboration",
      "attention to detail",
      "time management",
      "IT asset management",
      "CMDB",
      "ServiceNow",
      "ITSM tools",
      "vendor management",
      "licensing agreements",
      "data analysis",
      "reporting",
      "process design",
      "configuration management",
      "software management",
      "trend analysis",
      "auditing",
      "governance",
      "research",
      "negotiation",
      "team recruitment",
      "continuous improvement",
      "strategic planning",
      "supervision"
    ],
    "short_keywords": [
      "agreements",
      "analysis",
      "asset",
      "attention",
      "auditing",
      "cmdb",
      "collaboration",
      "communication",
      "configuration",
      "continuous",
      "data",
      "database",
      "design",
      "detail",
      "documentation",
      "governance",
      "hardware",
      "improvement",
      "independence",
      "information",
      "informationtechnology",
      "interpersonal",
      "it",
      "itsm",
      "leadership",
      "licensing",
      "management",
      "manager",
      "multitasking",
      "negotiation",
      "planning",
      "problem",
      "process",
      "project",
      "recruitment",
      "reporting",
      "research",
      "servicenow",
      "skills",
      "software",
      "solving",
      "strategic",
      "supervision",
      "team",
      "technology",
      "time",
      "to",
      "tools",
      "trend",
      "vendor"
    ]
  },
  {
    "job_id": "3902921025",
    "job_title": "Information Technology Developer",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "IT DEVELOPER & REPORTING ANALYST IIONSITE @ SPRING TXDURATION: 12+ MONTHSPAY RATE: $35-$42/HR\nDESCRIPTION:AS PART OF THE OFFICE OF THE CHIEF INFORMATION OFFICE CENTER OF EXCELLENCE (OCIO COE) TEAM AND UNDER THE DIRECTION OF THE COE MANAGER, THIS POSITION WILL BE RESPONSIBLE FOR SUPPORTING THE TEAM’S SCOPE OF APPLICATIONS, INCLUDING SHAREPOINT-BASED TOOLS, MICROSOFT PROJECT SERVER (MSPS), POWER PLATFORM (POWER BI, POWER AUTOMATE, AND POWER APPS) SOLUTIONS, AND REPORTING SOLUTIONS BASED ON POWER BI, QLIK, EXCEL, ETC. THIS POSITION WILL RESEARCH, DESIGN, DEVELOP, CONFIGURE, INTEGRATE, TEST, AND MAINTAIN EXISTING AND NEW SOLUTIONS BY INTEGRATING TECHNICAL AND BUSINESS REQUIREMENTS. APPLICATIONS. REPORTING, AND INFRASTRUCTURE SOLUTIONS INCLUDE BOTH 3RD PARTY SOFTWARE AND INTERNALLY DEVELOPED APPLICATIONS/REPORTS/TOOLS. A STRONG SENSE OF OWNERSHIP, CUSTOMER SERVICE, SELF-MOTIVATION, AND INTEGRITY DEMONSTRATED BY THE ABILITY TO COLLABORATIVELY INTERACT WITH A WIDE ARRAY OF HIGHLY SKILLED TEAMS IS REQUIRED.\nRESPONSIBILITIES:• PARTICIPATES AS A MEMBER OF AND LEADS DEVELOPMENT EFFORTS.• PERFORMS ANALYSIS OF COMPLEX FUNCTIONAL AND BUSINESS REQUIREMENTS.• PERFORMS SOLUTION DESIGN. APPLIES THE COMPANY AND 3RD PARTY TECHNOLOGIES AND LEADS THE DESIGN OF HIGHLY COMPLEX INFRASTRUCTURE AND SOFTWARE SOLUTIONS.• COMPLETES CODE TO IMPLEMENT SOLUTIONS.• PARTICIPATES IN CROSS-FUNCTIONAL TEAMS.• LEADS DESIGN ACTIVITIES, PARTICIPATES IN PEER DESIGN REVIEWS AND MAY PROVIDE GUIDANCE TO OTHER DEVELOPERS.• DESIGNS, PREPARES, AND EXECUTES SOLUTION TESTING.• APPLIES IN-DEPTH OR BROAD TECHNICAL KNOWLEDGE TO PROVIDE SOLUTIONS ACROSS ONE OR MORE TECHNOLOGY AREAS (E.G., DATABASE ADMINISTRATION).• CONSULTS WITH TEAM MEMBERS AND OTHER ORGANIZATIONS, STAKEHOLDERS, AND VENDORS ON COMPLEX ISSUES.• IDENTIFY OPPORTUNITIES FOR AUTOMATION AND IMPLEMENT AUTOMATION SOLUTIONS.\nEDUCATION AND EXPERIENCE REQUIRED:• TYPICALLY, A TECHNICAL BACHELOR'S DEGREE OR EQUIVALENT EXPERIENCE AND A MINIMUM OF 6 YEARS OF RELATED EXPERIENCE OR A MASTER'S DEGREE AND A MINIMUM OF 4 YEARS OF EXPERIENCE.• EXPERIENCE IN SHAREPOINT (ADMIN, DESIGN, FORMS, WORKFLOWS, FOLDERS/LISTS, PERMISSIONS, VIEWS, ETC)• EXPERIENCE IN WEB DEVELOPMENT - HTML, JAVASCRIPT, JQUERY, XML, INFOPATH, POWER APPS.• EXPERIENCE IN VARIOUS REPORTING TECHNOLOGIES SUCH AS POWER BI, QLIK, EXCEL, SQL, ETC.• EXPERIENCE WITH AUTOMATION TOOLS SUCH AS POWERAUTOMATE, UIPATH, ETC.• HAVE FAMILIARITY WITH AGILE, SPRINTS, AND DEVOPS APP DEV METHODS.• EXPERIENCE IN DATA EXTRACTION USING APIS FROM SAAS TOOLS SUCH AS SERVICENOW, ANAPLAN, ARIBA, CLIENT, WORKDAY, ETC.• CLIENTSA SQL SERVER AND/OR CLIENTSE DATA PLATFORM SOLUTIONS EXPERT CERTIFICATIONS ARE A PLUS.• EXPERIENCE WITH JIRA OR SIMILAR AGILE PLANNING TOOLS AND/OR MSPS A PLUS.• EXPERIENCE IN API AND DATA CONNECTOR DEVELOPMENT IS A BIG PLUS.\nKNOWLEDGE AND SKILLS:DATABASE• EXPERIENCE WITH RELATIONAL DATABASES AND QUERY LANGUAGES SUCH AS SQL AND SQL SERVER TOOLS.• BE ABLE TO AUTOMATE DATA EXPORTS AND IMPORTS FROM A DATABASE UTILIZING ETL TOOLS.• MONITOR AND OPTIMIZE DATABASE PERFORMANCE AND TUNING OF DATABASE OPERATIONS.• WORKING KNOWLEDGE OF DATABASE SECURITY.• PRODUCE DATABASE DESIGN SCHEMA FOR INTEGRATING SOURCE DATA INTO DATA MANAGEMENT SYSTEMS.• PLAN, COORDINATE, AND SUPPORT THE MIGRATION OF DATA.• PERFORM VARIOUS DATABASE ADMINISTRATION FUNCTIONS, INCLUDING RUNNING TEST QUERIES, TROUBLESHOOTING DATABASE PROBLEMS, ADVISING ON NEW DATABASE FEATURES, AND IMPROVING EFFICIENCY AND PERFORMANCE.\nSHAREPOINT• SOLID UNDERSTANDING OF SHAREPOINT ARCHITECTURE AND SERVICES AND GOOD EXPERIENCE IN SHAREPOINT ONLINE AND THE MICROSOFT OFFICE SUITE.O MS POWER PLATFORM SUITES (POWERAPPS, POWER BI, POWER QUERY, POWER AUTOMATE/FLOW)O SHAREPOINT DESIGNERO INFOPATH FORMS• EXPERIENCE DESIGNING IN SHAREPOINT ONLINE (O365) AND ON-PREMISE SHAREPOINT TEAM SITES.• DESIGN, ENHANCE, IMPLEMENT, AND MAINTAIN SHAREPOINT SITES AND APPLICATIONS, ENSURING ACCESS, RELIABILITY, AVAILABILITY, AND USABILITY TO CURRENT AND NEW USERS.• DEVELOP AND INTEGRATE SHAREPOINT WITH PROCESSES, WORKFLOWS, AND E-MAIL ALERTS.\nREPORTING• EXPERIENCE IN POWER BI, QLIKSENSE, NPRINT, EXCEL, ACCESS, AND POWERPOINT• GOOD KNOWLEDGE OF OTHER REPORTING TECHNOLOGIES SUCH AS SMARTSHEETS, TABLEAU, ZOHO, ETC.• DESIGN, ENHANCE, IMPLEMENT, AND MAINTAIN REPORTING SOLUTIONS, ENSURING ACCESS, RELIABILITY, AVAILABILITY, AND USABILITY TO CURRENT AND NEW USERS.• EXPERIENCE WITH USING REST API DATA SOURCES AND DATA CONNECTORS.",
    "job_skill_set": [
      "SharePoint",
      "Teamwork",
      "Problem Solving",
      "Customer Service",
      "Self-Motivation",
      "Integrity",
      "Collaboration",
      "Communication",
      "Leadership",
      "Power BI",
      "SQL",
      "HTML",
      "JavaScript",
      "Power Automate",
      "ETL",
      "API Development",
      "Database Administration",
      "Reporting Technologies",
      "Microsoft Project Server",
      "JIRA",
      "Qlik",
      "Excel",
      "Data Extraction",
      "Automation Tools",
      "Agile"
    ],
    "short_keywords": [
      "administration",
      "agile",
      "api",
      "automate",
      "automation",
      "bi",
      "collaboration",
      "communication",
      "customer",
      "data",
      "database",
      "developer",
      "development",
      "etl",
      "excel",
      "extraction",
      "html",
      "information",
      "informationtechnology",
      "integrity",
      "javascript",
      "jira",
      "leadership",
      "microsoft",
      "power",
      "problem",
      "project",
      "qlik",
      "reporting",
      "selfmotivation",
      "server",
      "service",
      "sharepoint",
      "solving",
      "sql",
      "teamwork",
      "technologies",
      "technology",
      "tools"
    ]
  },
  {
    "job_id": "3900961193",
    "job_title": "Information Technology/Assurance Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "SECURE OUR NATION, IGNITE YOUR FUTURE\n\nBECOME AN INTEGRAL PART OF A DIVERSE TEAM WHILE WORKING AT AN INDUSTRY LEADING ORGANIZATION, WHERE OUR EMPLOYEES COME FIRST. AT MANTECH INTERNATIONAL CORPORATION, YOU’LL HELP PROTECT OUR NATIONAL SECURITY WHILE WORKING ON INNOVATIVE PROJECTS THAT OFFER OPPORTUNITIES FOR ADVANCEMENT.\n\nCURRENTLY, MANTECH IS SEEKING A MOTIVATED, CAREER AND CUSTOMER-ORIENTED INFORMATION TECHNOLOGY / ASSURANCE SPECIALIST TO JOIN OUR TEAM IN THE LOS ANGELES, CA AREA.\n\nRESPONSIBILITIES INCLUDE BUT NOT LIMITED TO: \n\nTHE PRIMARY FUNCTION OF THE INFORMATION TECHNOLOGY / ASSURANCE SPECIALIST IS TO WORK WITH SPECIAL ACCESS PROGRAMS (SAPS) SUPPORTING SMC DIRECTORATES AND/OR AFSPC OPERATIONAL UNITS. THE POSITION WILL PROVIDE “DAY-TO-DAY” SUPPORT FOR COLLATERAL, SENSITIVE COMPARTMENTED INFORMATION (SCI) AND SPECIAL ACCESS PROGRAM (SAP) ACTIVITIES.\n\nESTABLISH COMPLEX OPERATIONAL SOFTWARE CONFIGURATION CONTROLS AND SYSTEM INTERFACES FOR ASSIGNED COMPUTER SYSTEM(S)MAINTAIN FILE SERVERS, FIREWALLS, NETWORK ACCESS, SECURITY MONITORING SYSTEMS AND SYSTEM DOCUMENTATION AS REQUIREDANALYZE AND TROUBLESHOOT SYSTEM ANOMALIES TO ENSURE OPTIMUM EQUIPMENT PERFORMANCEREVIEW, PREPARE, AND UPDATE AIS ACCREDITATION PACKAGE AND PERFORM AIS SELF-INSPECTIONSPROVIDE SECURITY COORDINATION AND REVIEW OF ALL SYSTEM TEST PLANSIDENTIFY AIS VULNERABILITIES AND IMPLEMENT COUNTERMEASURESENSURE AIS AND NETWORK NODES ARE OPERATED, MAINTAINED, AND DISPOSED OF IN ACCORDANCE WITH SECURITY POLICIES AND PRACTICESPERFORM VTC SYSTEM ADMINISTRATION, SCHEDULING, & CONFIGURATIONPERFORM HARDWARE/SOFTWARE SYSTEM CONFIGURATION, UPGRADES AND MODIFICATIONS\n\nBASIC QUALIFICATIONS: \n\nBACHELOR’S DEGREE FROM AN ACCREDITED COLLEGE OR UNIVERSITY; FOUR (4) ADDITIONAL YEARS OF EXPERIENCE MAY BE ACCEPTED IN LEU OF DEGREE5+ YEARS TOTAL RELATED EXPERIENCE, INCLUDING A MINIMUM OF THREE (3) YEARS OF RELEVANT SCI OR SAP EXPERIENCEEXPERIENCE WITH PL1 & PL2 SYSTEMSMUST POSSESS OR OBTAIN A DOD APPROVED 8570 BASELINE IAT LEVEL 2 CERTIFICATION WITHIN 6 MONTHS OF HIRE DATE. MUST COMPLETE TRAINING ON JOINT SECURITY IMPLEMENTATION GUIDANCE (JSIG), RISK MANAGEMENT FRAMEWORK (RMF), AND INFORMATION SECURITY CONTINUOUS MONITORING (ISCM) WITHIN 6 MONTHS OF HIRE DATE (IF SUPPORTED ORGANIZATION REQUIRES DEVELOPMENT OF AIS ACCREDITATION PACKAGES). APPLICABLE WINDOWS PROFESSIONAL CERTIFICATIONS, BASED ON OS REQUIREMENTS FOR SUPPORTED ORGANIZATIONTHOROUGH KNOWLEDGE OF MICROSOFT WINDOWS 2000/2003/2007 SERVER, MICROSOFT EXCHANGE SERVER 2003, MICROSOFT WINDOWS XP/VISTA OPERATING SYSTEMS (OS) ADMINISTRATION AND ASSOCIATED HARDWAREWORKING KNOWLEDGE OF LOCAL AREA NETWORK (LAN) AND WIDE AREA NETWORK (WAN) TECHNOLOGIES AND DATA BACKUP TECHNOLOGIES TO INCLUDE COMMUNICATION SECURITY (COMSEC) INTEGRATIONWORKING KNOWLEDGE OF JAFAN 6/0, DCID/JAFAN 6/3, DCID/JAFAN 6/9, AND JOINT DODIIS/CRYPTOLOGIC SCI INFORMATION SYSTEMS SECURITY STANDARDS, COMMON CRITERIA, AND SYSTEM SECURITY POLICY AS THEY RELATE TO C&A FOR LEGACY SYSTEMSMUST BE FAMILIAR WITH SECURITY POLICY/MANUALS AND THE APPROPRIATE ICDS/JAFANS/DOD MANUALS AND OTHER GUIDING POLICY DOCUMENTSMUST BE WILLING TO TRAVEL WITHIN THE ORGANIZATIONAL AREA OF RESPONSIBILITY (AOR) (NOTE - COULD BE EXTENSIVE, AND WILL INCLUDE BOTH AIR AND GROUND TRANSPORTATION)\n\nPREFERRED QUALIFICATIONS: \n\nMINIMUM 1 YEAR OF SAP-RELATED EXPERIENCE HIGHLY DESIREDEXPERIENCE WITH PL3 & PL4 CROSS DOMAIN SOLUTIONS DESIRED\n\nSECURITY CLEARANCE REQUIREMENTS:\n\nMUST POSSESS A CURRENT ACTIVE U.S. GOVERNMENT TOP SECRET CLEARANCE WITH SCI ELIGIBILITY. MUST SUBMIT TO A COUNTERINTELLIGENCE POLYGRAPH FOR ELIGIBILITY TO ACCESS SPECIAL ACCESS PROGRAM INFORMATION\n\nPHYSICAL REQUIREMENTS:\n\nMUST BE ABLE TO REMAIN IN A STATIONARY POSITION 50%THE PERSON IN THIS POSITION FREQUENTLY COMMUNICATES WITH CO-WORKERS, MANAGEMENT AND CUSTOMERS, WHICH MAY INVOLVE DELIVERING PRESENTATIONS. MUST BE ABLE TO EXCHANGE ACCURATE INFORMATION IN THESE SITUATIONSCONSTANTLY OPERATES A COMPUTER AND OTHER OFFICE PRODUCTIVITY MACHINERY, SUCH AS A CALCULATOR, COPY MACHINE AND COMPUTER PRINTER\n\nTHE PROJECTED COMPENSATION RANGE FOR THIS POSITION IS $109,100-$181,100. THERE ARE DIFFERENTIATING FACTORS THAT CAN IMPACT A FINAL SALARY/HOURLY RATE, INCLUDING, BUT NOT LIMITED TO, CONTRACT WAGE DETERMINATION, RELEVANT WORK EXPERIENCE, SKILLS AND COMPETENCIES THAT ALIGN TO THE SPECIFIED ROLE, GEOGRAPHIC LOCATION (FOR REMOTE OPPORTUNITIES), EDUCATION AND CERTIFICATIONS AS WELL AS FEDERAL GOVERNMENT CONTRACT LABOR CATEGORIES. IN ADDITION, MANTECH INVESTS IN IT’S EMPLOYEES BEYOND JUST COMPENSATION. MANTECH’S BENEFITS OFFERINGS INCLUDE, DEPENDENT UPON POSITION, HEALTH INSURANCE, LIFE INSURANCE, PAID TIME OFF, HOLIDAY PAY, SHORT TERM AND LONG TERM DISABILITY, RETIREMENT AND SAVINGS, LEARNING AND DEVELOPMENT OPPORTUNITIES, WELLNESS PROGRAMS AS WELL AS OTHER OPTIONAL BENEFIT ELECTIONS.\n\nFOR ALL POSITIONS REQUIRING ACCESS TO TECHNOLOGY/SOFTWARE SOURCE CODE THAT IS SUBJECT TO EXPORT CONTROL LAWS, EMPLOYMENT WITH THE COMPANY IS CONTINGENT ON EITHER VERIFYING U.S.-PERSON STATUS OR OBTAINING ANY NECESSARY LICENSE. THE APPLICANT WILL BE REQUIRED TO ANSWER CERTAIN QUESTIONS FOR EXPORT CONTROL PURPOSES, AND THAT INFORMATION WILL BE REVIEWED BY COMPLIANCE PERSONNEL TO ENSURE COMPLIANCE WITH FEDERAL LAW. MANTECH MAY CHOOSE NOT TO APPLY FOR A LICENSE FOR SUCH INDIVIDUALS WHOSE ACCESS TO EXPORT-CONTROLLED TECHNOLOGY OR SOFTWARE SOURCE CODE MAY REQUIRE AUTHORIZATION AND MAY DECLINE TO PROCEED WITH AN APPLICANT ON THAT BASIS ALONE.\n\nMANTECH INTERNATIONAL CORPORATION, AS WELL AS ITS SUBSIDIARIES PROACTIVELY FULFILLS ITS ROLE AS AN EQUAL OPPORTUNITY EMPLOYER. WE DO NOT DISCRIMINATE AGAINST ANY EMPLOYEE OR APPLICANT FOR EMPLOYMENT BECAUSE OF RACE, COLOR, SEX, RELIGION, AGE, SEXUAL ORIENTATION, GENDER IDENTITY AND EXPRESSION, NATIONAL ORIGIN, MARITAL STATUS, PHYSICAL OR MENTAL DISABILITY, STATUS AS A DISABLED VETERAN, RECENTLY SEPARATED VETERAN, ACTIVE DUTY WARTIME OR CAMPAIGN BADGE VETERAN, ARMED FORCES SERVICES MEDAL, OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW.\n\nIF YOU REQUIRE A REASONABLE ACCOMMODATION TO APPLY FOR A POSITION WITH MANTECH THROUGH ITS ONLINE APPLICANT SYSTEM, PLEASE CONTACT MANTECH'S CORPORATE EEO DEPARTMENT AT (703) 218-6000. MANTECH IS AN AFFIRMATIVE ACTION/EQUAL OPPORTUNITY EMPLOYER - MINORITIES, FEMALES, DISABLED AND PROTECTED VETERANS ARE URGED TO APPLY. MANTECH'S UTILIZATION OF ANY EXTERNAL RECRUITMENT OR JOB PLACEMENT AGENCY IS PREDICATED UPON ITS FULL COMPLIANCE WITH OUR EQUAL OPPORTUNITY/AFFIRMATIVE ACTION POLICIES. MANTECH DOES NOT ACCEPT RESUMES FROM UNSOLICITED RECRUITING FIRMS. WE PAY NO FEES FOR UNSOLICITED SERVICES.\n\nIF YOU ARE A QUALIFIED INDIVIDUAL WITH A DISABILITY OR A DISABLED VETERAN, YOU HAVE THE RIGHT TO REQUEST AN ACCOMMODATION IF YOU ARE UNABLE OR LIMITED IN YOUR ABILITY TO USE OR ACCESS HTTP://WWW.MANTECH.COM/CAREERS/PAGES/CAREERS.ASPX AS A RESULT OF YOUR DISABILITY. TO REQUEST AN ACCOMMODATION PLEASE CLICK CAREERS@MANTECH.COM AND PROVIDE YOUR NAME AND CONTACT INFORMATION.",
    "job_skill_set": [
      "System Administration",
      "Troubleshooting",
      "Teamwork",
      "Communication",
      "Customer Orientation",
      "Problem Solving",
      "Attention to Detail",
      "Adaptability",
      "Time Management",
      "Analytical Thinking",
      "Motivation",
      "Security Clearance",
      "Information Assurance",
      "Network Security",
      "Windows Server Administration",
      "Local Area Network (LAN) Technologies",
      "Wide Area Network (WAN) Technologies",
      "Configuration Management",
      "AIS Accreditation",
      "Risk Management Framework (RMF)",
      "Joint Security Implementation Guidance (JSIG)",
      "Data Backup Technologies",
      "Communication Security (COMSEC)",
      "PL1 & PL2 Systems",
      "PL3 & PL4 Cross Domain Solutions",
      "Microsoft Exchange Server",
      "System Security Policy",
      "Countermeasures Implementation",
      "Presentation Skills"
    ],
    "short_keywords": [
      "accreditation",
      "adaptability",
      "administration",
      "ais",
      "analytical",
      "area",
      "assurance",
      "attention",
      "backup",
      "clearance",
      "communication",
      "comsec",
      "configuration",
      "countermeasures",
      "cross",
      "customer",
      "data",
      "detail",
      "domain",
      "exchange",
      "framework",
      "guidance",
      "implementation",
      "information",
      "informationtechnology",
      "joint",
      "jsig",
      "lan",
      "local",
      "management",
      "microsoft",
      "motivation",
      "network",
      "orientation",
      "pl1",
      "pl2",
      "pl3",
      "pl4",
      "policy",
      "presentation",
      "problem",
      "risk",
      "rmf",
      "security",
      "server",
      "skills",
      "solutions",
      "solving",
      "specialist",
      "system",
      "systems",
      "teamwork",
      "technologies",
      "technologyassurance",
      "thinking",
      "time",
      "to",
      "troubleshooting",
      "wan",
      "wide",
      "windows"
    ]
  },
  {
    "job_id": "3891252828",
    "job_title": "Senior Information Technology Project Manager- Financials",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "HTC GLOBAL SERVICES WANTS YOU. COME BUILD NEW THINGS WITH US AND ADVANCE YOUR CAREER. AT HTC GLOBAL YOU'LL COLLABORATE WITH EXPERTS. YOU'LL JOIN SUCCESSFUL TEAMS CONTRIBUTING TO OUR CLIENTS' SUCCESS. YOU'LL WORK SIDE BY SIDE WITH OUR CLIENTS AND HAVE LONG-TERM OPPORTUNITIES TO ADVANCE YOUR CAREER WITH THE LATEST EMERGING TECHNOLOGIES.\nAT HTC GLOBAL SERVICES OUR CONSULTANTS HAVE ACCESS TO A COMPREHENSIVE BENEFITS PACKAGE. BENEFITS CAN INCLUDE PAID-TIME-OFF, PAID HOLIDAYS, 401K MATCHING, LIFE AND ACCIDENTAL DEATH INSURANCE, SHORT & LONG TERM DISABILITY INSURANCE, AND A VARIETY OF OTHER PERKS.\nONSITE 4 DAYS A WEEK IN ORLANDO. NO RELO OFFERED.\nFINANCIAL CHAMPION FOR OUR TECHNOLOGY PORTFOLIO\nWE'RE SEEKING A SEASONED SENIOR TECHNOLOGY PROJECT MANAGER - FINANCIALS TO JOIN OUR DYNAMIC AND COLLABORATIVE TEAM. YOU'LL BE THE FINANCIAL EXPERT, OVERSEEING THE HEALTH AND TRACKING THE FINANCIALS FOR OUR DIVERSE TECHNOLOGY PROGRAMS, PROJECTS, AND WORKSTREAMS.\nWHAT YOU'LL DO:MANAGE THE MONEY: OVERSEE BUDGETING, COST CONTROL, AND FINANCIAL REPORTING FOR ALL TECHNOLOGY PROJECTS, ENSURING TIMELY AND ACTIONABLE INSIGHTS.DRIVE FINANCIAL TRANSPARENCY: CONSOLIDATE AND REPORT ON FINANCIALS ACROSS THE WORKFORCE TECHNOLOGY (WFT) PLATFORMS AND SERVICES.PROCESS IMPROVEMENT CHAMPION: COLLABORATE WITH PROJECT MANAGERS TO CREATE AND STANDARDIZE FINANCIAL PROCESSES AND TOOLS.FINANCIAL ANALYST: ANALYZE PROJECT FINANCIALS, IDENTIFY KEY ISSUES, AND MAINTAIN ACCURATE BUDGET TRACKING.MENTOR AND COACH: PROVIDE GUIDANCE AND SUPPORT TO OTHER TECHNOLOGY PROJECT MANAGERS.EVOLVE FINANCIAL PRACTICES: DEVELOP BEST PRACTICES AND LEAD THE ADOPTION OF IMPROVED FINANCIAL REPORTING TOOLS AND PROCESSES.\nYOU'RE A PERFECT FIT IF YOU HAVE:10+ YEARS OF EXPERIENCE MANAGING PROJECT FINANCIALS IN TECHNOLOGY, PREFERABLY WITH A FOCUS ON COST CONTROL, PROJECT CONTROLS, AND FINANCIAL REPORTING.PROVEN TRACK RECORD OF IMPLEMENTING FINANCIAL PROCESS IMPROVEMENTS AND TOOLS.EXPERTISE IN PROJECT ACCOUNTING, GAAP PRINCIPLES, AND MANAGING BUDGETS ACROSS MULTIPLE PROJECTS.STRONG FINANCIAL SKILLS: ADVANCED EXCEL (VLOOKUP, PIVOTTABLES, ETC.), SAP EXPERIENCE (DATA ANALYSIS, REPORTING), AND KNOWLEDGE OF ACCRUALS, PURCHASE ORDERS, ETC.EXCELLENT COMMUNICATION AND COLLABORATION SKILLS: PARTNER EFFECTIVELY WITH EXECUTIVES, PROJECT MANAGERS, AND TEAM MEMBERS.CHANGE CHAMPION: IDENTIFY PAIN POINTS AND ADVOCATE FOR PROCESS IMPROVEMENTS.PROBLEM-SOLVING SKILLS: ANALYZE DATA AND IDENTIFY SOLUTIONS TO ACHIEVE BUSINESS GOALS.\nBONUS POINTS:EXPERIENCE WITH LARGE COMPANIES AND MATRIX ORGANIZATIONS.EXPERIENCE WITH AGILE METHODOLOGIES AND SMARTSHEETS.\nDIVERSITY & INCLUSION OUR SUCCESS AS A COMPANY IS BUILT ON PRACTICING INCLUSION AND EMBRACING DIVERSITY. HTC GLOBAL SERVICES IS COMMITTED TO PROVIDING A WORK ENVIRONMENT FREE FROM DISCRIMINATION AND HARASSMENT, WHERE ALL EMPLOYEES ARE TREATED WITH RESPECT AND DIGNITY. TOGETHER WE WORK TO CREATE AND MAINTAIN AN ENVIRONMENT WHERE EVERYONE FEELS VALUED, INCLUDED, AND RESPECTED. AT HTC GLOBAL SERVICES, OUR DIFFERENCES ARE EMBRACED AND CELEBRATED. HTC IS AN EQUAL OPPORTUNITY EMPLOYER. WE RESPECT AND SEEK TO EMPOWER EACH INDIVIDUAL AND SUPPORT THE DIVERSE CULTURES, PERSPECTIVES, SKILLS, AND EXPERIENCES WITHIN OUR WORKFORCE. HTC IS PROUD TO BE RECOGNIZED AS A NATIONAL MINORITY SUPPLIER",
    "job_skill_set": [
      "financial reporting",
      "advanced Excel",
      "SAP",
      "data analysis",
      "reporting tools",
      "purchase orders",
      "communication",
      "collaboration",
      "mentoring",
      "problem-solving",
      "process improvement",
      "budgeting",
      "cost control",
      "financial analysis",
      "project accounting",
      "GAAP principles",
      "accruals",
      "Agile methodologies",
      "Smartsheets",
      "change management"
    ],
    "short_keywords": [
      "accounting",
      "accruals",
      "advanced",
      "agile",
      "analysis",
      "budgeting",
      "change",
      "collaboration",
      "communication",
      "control",
      "cost",
      "data",
      "excel",
      "financial",
      "financials",
      "gaap",
      "improvement",
      "information",
      "informationtechnology",
      "management",
      "manager",
      "mentoring",
      "methodologies",
      "orders",
      "principles",
      "problemsolving",
      "process",
      "project",
      "purchase",
      "reporting",
      "sap",
      "senior",
      "smartsheets",
      "technology",
      "tools"
    ]
  },
  {
    "job_id": "3901352795",
    "job_title": "Information Technology Project Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "PROJECT MANAGERTRANSITION AND TRANSFORMATION (T&T)LOCATION: REMOTE CANDIDATES.PLEASE DO NOT SUBMIT WITHOUT TRANSITION AND TRANSFORMATION (T&T) EXPERIENCE.\nPM EXPERIENCE – 5-8 YEARSPMP WOULD BE NICE, BUT NOT AN ABSOLUTE REQUIREMENT.EXPERIENCE• MUST HAVE TRANSITION AND TRANSFORMATION (T&T) EXPERIENCE ON LARGE PROGRAMS THAT INCLUDE INTEGRATIONS ACROSS THE MAJOR PROGRAM INITIATIVES• MUST HAVE TECH INFRASTRUCTURE KNOWLEDGE/EXPERIENCESKILLS:• MS PROJECT OR SMARTSHEET• SHAREPOINT• MS OFFICE TOOLS, INCLUDING BEING PROFICIENT IN POWERPOINT AND EXCELCOMMUNICATIONS:• PROFICIENT IN ENGLISH• PROFICIENT IN COMMUNICATING AND FOLLOWING UP.OVERALL COMMENTS:• NEEDS TO DRIVE TO PLANS• NEEDS TO PROPERLY STATUS AND UNDERSTAND RAID (RISKS, ASSUMPTIONS, ISSUES, DEPENDENCIES) AND CHANGE MANAGEMENT• NEED TO ESCALATE EARLY• NEEDS TO BE OUTGOING AND SELF-MANAGED WITH LITTLE SUPERVISION• SOME UNDERSTANDING OF PROJECT FINANCIALS WOULD BE GREAT, BUT NOT A SHOWSTOPPER\nTHANKS,HARIHARI.C@TECHNOGENINC.COM",
    "job_skill_set": [
      "Project Management",
      "MS Office (PowerPoint, Excel)",
      "Tech Infrastructure Knowledge",
      "Project Financials Understanding",
      "Communication",
      "Self-management",
      "Problem Solving",
      "Teamwork",
      "Proactivity",
      "Transition and Transformation (T&T) experience",
      "MS Project",
      "Smartsheet",
      "SharePoint"
    ],
    "short_keywords": [
      "and",
      "communication",
      "excel",
      "experience",
      "financials",
      "information",
      "informationtechnology",
      "infrastructure",
      "knowledge",
      "management",
      "manager",
      "ms",
      "office",
      "powerpoint",
      "proactivity",
      "problem",
      "project",
      "selfmanagement",
      "sharepoint",
      "smartsheet",
      "solving",
      "teamwork",
      "tech",
      "technology",
      "transformation",
      "transition",
      "tt",
      "understanding"
    ]
  },
  {
    "job_id": "3905298038",
    "job_title": "Threat Hunting Analyst /Information Technology Specialist 3 (Information Security), ref 5776-10AR",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "MINIMUM QUALIFICATIONS\n\nBACHELOR’S DEGREE* WITH AT LEAST 15 CREDIT HOURS IN CYBER SECURITY, INFORMATION ASSURANCE, OR INFORMATION TECHNOLOGY; AND TWO YEARS OF INFORMATION TECHNOLOGY EXPERIENCE, INCLUDING ONE YEAR OF INFORMATION SECURITY OR INFORMATION ASSURANCE EXPERIENCE**.\n\n SUBSTITUTION: BACHELOR’S DEGREE CANDIDATES WITHOUT AT LEAST 15 COURSE CREDITS IN CYBER SECURITY, INFORMATION ASSURANCE, OR INFORMATION TECHNOLOGY REQUIRE AN ADDITIONAL YEAR OF GENERAL INFORMATION TECHNOLOGY EXPERIENCE TO QUALIFY. APPROPRIATE INFORMATION SECURITY OR INFORMATION ASSURANCE EXPERIENCE MAY SUBSTITUTE FOR THE BACHELOR’S DEGREE ON A YEAR-FOR-YEAR BASIS; AN ASSOCIATE’S DEGREE REQUIRES AN ADDITIONAL TWO YEARS OF GENERAL INFORMATION TECHNOLOGY EXPERIENCE. EXPERIENCE SOLELY IN INFORMATION SECURITY OR INFORMATION ASSURANCE MAY SUBSTITUTE FOR THE GENERAL INFORMATION TECHNOLOGY EXPERIENCE.\n\nPREFERRED QUALIFICATIONS\n\n CERTIFICATIONS IN ONE OR MORE OF THE FOLLOWING:CYBER DEFENSE (E.G., GCIA, GCIH, GCED, GSOM, GSOC, GMON, GCDA)CYBER THREAT INTELLIGENCE (E.G., GCTI, CTIA, CCIP, GOSI)INFORMATION SECURITY MANAGEMENT (E.G., CISSP, CISM, CCISO) 1+ YEARS’ EXPERIENCE IN ONE OR MORE OF THE FOLLOWING:WORKING AS A SOC ANALYSTCONDUCTING LOG ANALYSIS (E.G., FIREWALL LOGS, DNS LOGS, PROXY LOGS, IDS/IPS LOGS)USING SIEM TECHNOLOGIES TO SUPPORT IN-DEPTH INVESTIGATIONSPARTICIPATING IN CYBER INCIDENT RESPONSE STRONG UNDERSTANDING OF ENTERPRISE IT ENVIRONMENTS, INCLUDING BUT NOT LIMITED TO SYSTEM ADMINISTRATION, NETWORK ARCHITECTURE, OPERATING SYSTEMS, ENDPOINT DETECTION AND RESPONSE TOOLS, AND NETWORK-BASED SECURITY SOLUTIONS (E.G., IDS/IPS, FIREWALLS). STRONG UNDERSTANDING OF THE FOUNDATIONS OF INFORMATION SECURITY, SUCH AS THE CIA TRIAD, INFORMATION CLASSIFICATION, IDENTITY AND ACCESS MANAGEMENT, RISK MANAGEMENT, VULNERABILITY MANAGEMENT, SECURE ARCHITECTURE AND ENGINEERING, NETWORK SECURITY, SOFTWARE DEVELOPMENT SECURITY, ETC. EXCELLENT ORAL AND WRITTEN COMMUNICATION SKILLS INCLUDING THE ABILITY TO CLEARLY ARTICULATE INFORMATION TECHNOLOGY AND INFORMATION SECURITY CONCEPTS TO A VARIED AUDIENCE TO FACILITATE WIDE UNDERSTANDING. DEMONSTRATED CRITICAL THINKING, PROBLEM SOLVING AND ANALYTICAL SKILLS.\n\nDUTIES DESCRIPTION\n\nUNDER THE DIRECTION OF SENIOR LEADERSHIP WITHIN THE OFFICE OF INFORMATION TECHNOLOGY SERVICES\\CHIEF INFORMATION SECURITY OFFICE\\CYBER COMMAND CENTER\\ NEW YORK SECURITY OPERATIONS CENTER (NYSOC), THE INCUMBENT WILL BE A THREAT HUNTING ANALYST WORKING IN THE NYSOC. THE INCUMBENT WILL LEVERAGE A VARIETY OF THREAT INTELLIGENCE SOURCES AND INDICATORS OF COMPROMISE (IOCS) TO PERFORM BOTH PROACTIVE AND REACTIVE THREAT HUNTING ACROSS A LARGE AND DIVERSE MULTI-ENTITY ENVIRONMENT. THE INCUMBENT WILL PARTICIPATE IN THE INGESTION AND RESPONSE TO ALL FORMS OF THREAT INTELLIGENCE AND VULNERABILITY ANNOUNCEMENTS RECEIVED FROM MANY THIRD PARTIES SUCH AS VENDORS, DHS CISA, MS-ISAC, NYSP, AND OTHER SOURCES OF OPEN-SOURCE INTELLIGENCE.\n\nTHIS POSITION REQUIRES THE INCUMBENT TO POSSESS A SOLID UNDERSTANDING OF THE CURRENT CYBER THREAT LANDSCAPE, THE TACTICS, TECHNIQUES, TOOLS, AND PROCEDURES COMMONLY LEVERAGED, AND THE STEPS NECESSARY TO SWIFTLY IDENTIFY AND CONTAIN A POTENTIAL CYBER THREAT. ADDITIONALLY, THIS POSITION REQUIRES AN INCUMBENT TO ACT WITH A GREAT DEAL OF INDEPENDENCE IN ALIGNMENT WITH AGENCY AND UPPER-LEVEL MANAGEMENT STRATEGIC DIRECTION.\n\nDUE TO THE NATURE OF THE WORK PERFORMED BY THE SOC, THIS POSITION REQUIRES AVAILABILITY DURING OFF-SHIFT HOURS TO ENSURE APPROPRIATE RESPONSE TO SECURITY INCIDENTS OR OTHER CRITICAL ACTIVITIES AS NEEDED.\n\nDUTIES INCLUDE, BUT ARE NOT LIMITED TO\n\n MONITOR AND REPORT ON CURRENT AND EMERGING THREATS INCLUDING EXPLOITABLE VULNERABILITIES, AND DETAILS OF THOSE VULNERABILITIES CONDUCT RESEARCH, ANALYSIS, AND CORRELATION ACROSS A WIDE VARIETY OF ALL SOURCE DATA SETS SUCH AS IOCS, IOAS AND WARNINGS PERFORM THREAT HUNTING ACROSS A MULTI-OS/MULTI-CLOUD ENVIRONMENT TO ENSURE A TIMELY AND EFFECTIVE RESPONSE TO NEW CYBER THREATS IDENTIFY TACTICS, TECHNIQUES, AND PROCEDURES (TTPS) FOR INTRUSION SETS RESPOND TO AD-HOC REQUEST, RESEARCH, THREAT HUNTS, AND ASSIST WITH OTHER BUSINESS UNITS AS NEEDED ASSIST WITH CREATING DETECTION CONTENT BASED ON THREAT HUNTING FINDINGS DOCUMENT ALL THREAT HUNT, TRACK, AND CREATE TRENDS BASED ON THE FINDINGS CLASSIFY/CATEGORIZE HUNTING USE CASES BASED ON MITRE ATT&CK FRAMEWORK AND CYBER KILL CHAIN CREATE DAILY, MONTHLY, AND YEARLY INTELLIGENCE INFORMATION IN SUPPORT OF NYSOC BUSINESS NEEDS CREATE TECHNICAL REPORTS AND EXECUTIVE SUMMARIES RELATED TO CYBER SECURITY INCIDENTS AND EVENTS PARTICIPATE IN ACTIVE PROJECTS TO HELP IDENTIFY AND RESOLVE ISSUES/PROBLEMS TO ENSURE SUCCESSFUL OUTCOMES ARE ACHIEVED PERFORM THE FULL RANGE OF SUPERVISORY RESPONSIBILITIES, AS ASSIGNED\n\nADDITIONAL COMMENTS\n\nADDITIONAL DETAILS ON WORK SHIFT WILL BE DISCUSSED AT TIME OF INTERVIEW.\n\nBACKGROUND CHECK AND FINGERPRINTING ARE REQUIRED.\n\nBENEFITS OF WORKING FOR NYS\n\nGENEROUS BENEFITS PACKAGE, WORTH 65% OF SALARY, INCLUDING:\n\n HOLIDAY & PAID TIME OFF THIRTEEN (13) PAID HOLIDAYS ANNUALLY UP TO THIRTEEN (13) DAYS OF PAID VACATION LEAVE ANNUALLY UP TO FIVE (5) DAYS OF PAID PERSONAL LEAVE ANNUALLY UP TO THIRTEEN (13) DAYS OF PAID SICK LEAVE ANNUALLY FOR PEF UP TO THREE (3) DAYS OF PROFESSIONAL LEAVE ANNUALLY TO PARTICIPATE IN PROFESSIONAL DEVELOPMENT\n\nHEALTH CARE BENEFITS\n\n ELIGIBLE EMPLOYEES AND DEPENDENTS CAN PICK FROM A VARIETY OF AFFORDABLE HEALTH INSURANCE PROGRAMS FAMILY DENTAL AND VISION BENEFITS AT NO ADDITIONAL COST\n\nADDITIONAL BENEFITS\n\n NEW YORK STATE EMPLOYEES’ RETIREMENT SYSTEM (ERS) MEMBERSHIP NYS DEFERRED COMPENSATION ACCESS TO NY 529 AND NY ABLE COLLEGE SAVINGS PROGRAMS, AS WELL AS U.S. SAVINGS BONDS PUBLIC SERVICE LOAN FORGIVENESS (PSLF) UP TO 50% TELECOMMUTING AND MANY MORE.\n\n",
    "job_skill_set": [
      "Cyber Security",
      "Information Technology",
      "Technical Reporting",
      "Critical Thinking",
      "Analytical Skills",
      "Communication",
      "Problem Solving",
      "Independence",
      "Teamwork",
      "Research Skills",
      "Information Assurance",
      "Log Analysis",
      "SIEM Technologies",
      "Threat Intelligence",
      "Incident Response",
      "Network Security",
      "Vulnerability Management",
      "Operating Systems",
      "System Administration",
      "Endpoint Detection and Response",
      "Network Architecture",
      "MITRE ATT&CK Framework",
      "Cyber Kill Chain",
      "Threat Hunting"
    ],
    "short_keywords": [
      "3",
      "577610ar",
      "administration",
      "analysis",
      "analyst",
      "analytical",
      "and",
      "architecture",
      "assurance",
      "attck",
      "chain",
      "communication",
      "critical",
      "cyber",
      "detection",
      "endpoint",
      "framework",
      "hunting",
      "incident",
      "independence",
      "information",
      "informationtechnology",
      "intelligence",
      "kill",
      "log",
      "management",
      "mitre",
      "network",
      "operating",
      "problem",
      "ref",
      "reporting",
      "research",
      "response",
      "security",
      "siem",
      "skills",
      "solving",
      "specialist",
      "system",
      "systems",
      "teamwork",
      "technical",
      "technologies",
      "technology",
      "thinking",
      "threat",
      "vulnerability"
    ]
  },
  {
    "job_id": "3901981623",
    "job_title": "Information Technology Administrator",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "***FOR IMMEDIATE CONSIDERATION, PLEASE MESSAGE VALERIE NIELSEN (QUICKEST IS EMAIL - IT'S ON THE FRONT PAGE OF MY LINKEDIN)** I DON'T WANT YOU TO GET LOST IN THE SEA OF APPLICANTS!\nFUNCTIONAL ROLE: IT ADMINISTRATOR / SYSTEMS ADMINISTRATORSALARY: 85,000 - 100,000LOCATION: CENTURY CITY, CA \nOUR CLIENT IN THE HOSPITALITY INDUSTRY IS SEEKING A HANDS-ON IT SUPPORT ADMINISTRATOR TO JOIN THE TEAM! THE IDEAL CANDIDATE WILL BE A HANDS ON IN POS SYSTEMS. YOU WILL OVERSEE AND CREATE SCALABLE SOLUTIONS AND MAKE A HUGE IMPACT IN THE COMPANY. IF YOU HAVE WHAT IT TAKES, THEN LOOK NO FURTHER!\nMUST HAVES:KNOWLEDGE OF NETWORK INFRASTRUCTURE, INCLUDING CAT5 / 6 CABLING, WIRELESS NETWORKS, NETWORK SWITCHES, WAN/LAN, DOMAIN CONTROLLERPOS EXPERIENCE (OPERA IS THE PREFERRED SYSTEM)MSP EXPERIENCE IS NICE TO HAVEACTIVE DIRECTORY, FIREWALL AND VPN APPLICATIONS. EXTENSIVE KNOWLEDGE OF ACTIVE DIRECTORY, MANAGEMENT, AND IMPLEMENTATIONS",
    "job_skill_set": [
      "network infrastructure",
      "CAT5/6 cabling",
      "domain controller",
      "Active Directory",
      "management and implementations",
      "hands-on support",
      "problem solving",
      "communication",
      "teamwork",
      "scalable solutions",
      "wireless networks",
      "network switches",
      "WAN/LAN",
      "POS systems",
      "MSP experience",
      "firewall applications",
      "VPN applications"
    ],
    "short_keywords": [
      "active",
      "administrator",
      "and",
      "applications",
      "cabling",
      "cat56",
      "communication",
      "controller",
      "directory",
      "domain",
      "experience",
      "firewall",
      "handson",
      "implementations",
      "information",
      "informationtechnology",
      "infrastructure",
      "management",
      "msp",
      "network",
      "networks",
      "pos",
      "problem",
      "scalable",
      "solutions",
      "solving",
      "support",
      "switches",
      "systems",
      "teamwork",
      "technology",
      "vpn",
      "wanlan",
      "wireless"
    ]
  },
  {
    "job_id": "3905826143",
    "job_title": "Corporate Information Technology Manager Hotels",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "OUR CLIENT IS LOOKING FOR A CORPORATE IT MANAGER TO WORK OUT OF CHARLOTTE, NC. THE IDEAL CANDIDATE MUST COME FROM HOSPITALITY AND BE IN ABLE TO WORK IN THE UNITED STATES\nRESPONSIBILITIES AND DUTIES:LEAD AND MANAGE THE IT DEPARTMENT, INCLUDING STAFF RECRUITMENT, TRAINING, AND DEVELOPMENT.PARTICIPATE AND OVERSEE IT BUDGETS, ENSURING COST-EFFECTIVENESS.CONSULT SENIOR-LEVEL STAKEHOLDERS ACROSS THE ENTIRE ORGANIZATION TO IDENTIFY BUSINESS AND TECHNOLOGY NEEDS AND TO OPTIMIZE THE USE OF INFORMATION TECHNOLOGY.DESIGN, IMPLEMENT, AND MAINTAIN IT INFRASTRUCTURE AND SYSTEMS, WITH A FOCUS ON ENHANCING HOSPITALITY OPERATIONS AND PROPERTY MANAGEMENT EFFICIENCY.IDENTIFY AND RECOMMEND NEW TECHNOLOGY SOLUTIONS, PARTICULARLY THOSE BENEFICIAL TO THE HOSPITALITY SECTOR.MANAGE AND OVERSEE MAJOR IT PROJECTS, INCLUDING INTEGRATION AND OPTIMIZATION OF PROPERTY MANAGEMENT SYSTEMS.DEVELOP AND IMPLEMENT IT POLICY AND BEST PRACTICE GUIDES FOR THE ORGANIZATION, WITH AN EMPHASIS ON HOSPITALITY INDUSTRY STANDARDS.CONDUCT REGULAR SYSTEM AUDITS AND ENSURE COMPLIANCE WITH HOSPITALITY INDUSTRY REGULATIONS.MAINTAIN VENDOR RELATIONSHIPS AND MANAGE IT SERVICE CONTRACTS RELEVANT TO THE HOSPITALITY INDUSTRY.STAY UPDATED WITH THE LATEST TECHNOLOGY TRENDS AND DEVELOPMENTS, ESPECIALLY IN HOSPITALITY AND PROPERTY MANAGEMENT.ENSURE SMOOTH DELIVERY AND OPERATION OF IT SERVICES BY MONITORING THE SYSTEM’S PERFORMANCE.CREATE PROCESSES AND STANDARDS FOR SELECTION, IMPLEMENTATION, AND SUPPORT OF SYSTEMSASSESS VENDORS AND DEVELOP TEST STRATEGIES FOR NEW HARDWARE AND SOFTWAREQUALIFICATIONS:BACHELOR’S DEGREE IN INFORMATION TECHNOLOGY, COMPUTER SCIENCE, OR RELATED FIELD.5 YEARS OF IT MANAGEMENT EXPERIENCE WORKING IN IT OPERATIONS, SUPERVISING TECHNOLOGY TEAMS, AND OVERSEEING LARGE INFORMATION TECHNOLOGY PROJECTSPROVEN EXPERIENCE AS AN IT MANAGER OR SIMILAR ROLE, SPECIFICALLY WITHIN THE HOSPITALITY INDUSTRY.EXTENSIVE KNOWLEDGE AND EXPERIENCE WITH PROPERTY MANAGEMENT SYSTEMS.STRONG UNDERSTANDING OF COMPUTER SYSTEMS, NETWORKS, AND DATA SECURITY.OUTSTANDING COMMUNICATION AND INTERPERSONAL ABILITIES.EXPERIENCE IN MANAGING BUDGETS AND IT PROJECTS.ABILITY TO THINK STRATEGICALLY AND TO LEAD.EXCELLENT UNDERSTANDING OF COMPUTER SYSTEMS, SECURITY, NETWORK AND SYSTEMS ADMINISTRATION, DATABASES AND DATA STORAGE SYSTEMS, AND TELECOMMUNICATIONS SYSTEMSSTRONG INTERPERSONAL SKILLS AND ABILITY TO EFFECTIVELY COMMUNICATE WITH TEAMS ACROSS THE ENTIRE ORGANIZATION.EXCELLENT LEADERSHIP AND DECISION-MAKING SKILLS",
    "job_skill_set": [
      "budget management",
      "data security",
      "project management",
      "database management",
      "leadership",
      "communication",
      "interpersonal skills",
      "strategic thinking",
      "team management",
      "decision-making",
      "problem-solving",
      "adaptability",
      "IT management",
      "hospitality industry knowledge",
      "property management systems",
      "IT infrastructure design",
      "system administration",
      "network management",
      "vendor management",
      "technology solutions identification",
      "system audits",
      "IT policy development",
      "telecommunications systems",
      "hardware and software testing",
      "training and development",
      "stakeholder engagement"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "and",
      "audits",
      "budget",
      "communication",
      "corporate",
      "data",
      "database",
      "decisionmaking",
      "design",
      "development",
      "engagement",
      "hardware",
      "hospitality",
      "hotels",
      "identification",
      "industry",
      "information",
      "informationtechnology",
      "infrastructure",
      "interpersonal",
      "it",
      "knowledge",
      "leadership",
      "management",
      "manager",
      "network",
      "policy",
      "problemsolving",
      "project",
      "property",
      "security",
      "skills",
      "software",
      "solutions",
      "stakeholder",
      "strategic",
      "system",
      "systems",
      "team",
      "technology",
      "telecommunications",
      "testing",
      "thinking",
      "training",
      "vendor"
    ]
  },
  {
    "job_id": "3900962646",
    "job_title": "Information Technology - Data Management Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "COME BE A PART OF SOMETHING BIG! SMART MINDS, COOL JOBS AND AWESOME REWARDS! FUELED BY INNOVATION, TALENT AND AMBITION, THE AIR FORCE CIVILIAN SERVICE (AFCS) IS SEEKING CIVILIAN PROFESSIONALS PREPARED TO DEPLOY WAR-WINNING CAPABILITIES FOR THE UNITED STATES AIR FORCE.\nTHE AIR FORCE CIVILIAN SERVICE (AFCS) IS LOOKING FOR A FULL-TIME DATA INTEGRATION MANAGEMENT ANALYST (IT SPECIALIST DATAMGT), GS-2210-12, LOCATED AT THE A1 DIGITAL TRANSFORMATION ACTIVITY (A1 DTA), DATA SERVICES DIVISION, JB SAN ANTONIO - RANDOLPH AFB, IN UNIVERSAL CITY, TEXAS.\nTHIS POSITION IS FOR AN IT SPECIALIST/DATA MANAGEMENT ANALYST WHO WILL BE SUPPORT THE CREATION AND MAINTENANCE OF A ROBUST DATA MANAGEMENT ENVIRONMENT. THE ROLE INVOLVES SOURCING AND INTEGRATING DATA FROM VARIOUS SYSTEMS, ENSURING DATA QUALITY STANDARDS, AND ESTABLISHING A CLOUD-ENABLED, SECURE REPORTING AND ANALYTICS CAPABILITY. THE GOAL IS TO ESTABLISH A “SINGLE SOURCE OF TRUTH” REGARDING HR-RELATED DATA FOR TOTAL FORCE AIRMEN. THE ROLE REQUIRES A DEEP UNDERSTANDING OF IT PRINCIPLES, DATABASE MANAGEMENT SYSTEMS, DATA MINING AND WAREHOUSING PRINCIPLES, AND SYSTEM ARCHITECTURE. THE INCUMBENT WILL ALSO NEED TO STAY INFORMED ABOUT RAPIDLY CHANGING TECHNOLOGY AND PREDICT HOW MANAGEMENT CAN MEET FUTURE REQUIREMENTS. THIS ROLE IS CRUCIAL IN MAKING INFORMED DECISIONS AND ADOPTING CHANGING TECHNOLOGY WITHIN THE ORGANIZATION.\nIF THIS DESCRIBES YOU, APPLY NOW OR SHARE WITH A COLLEAGUE! THIS POSITION CAN CLOSE AT ANY TIME!\nSALARY RANGE: $88,205.00 – $114,663.00 (SALARY NEGOTIABLE)\nRELOCATION & RECRUITMENT INCENTIVES MAY OR MAY NOT APPLY BASED ON QUALIFICATIONS\nU.S. CITIZENSHIP\nMUST BE ABLE TO OBTAIN AND MAINTAIN A SECRET SECURITY CLEARANCE\nMUST BE ABLE TO OBTAIN AND MAINTAIN INFORMATION ASSURANCE CERTIFICATION SUCH AS SEC+\nKNOWLEDGE OF A WIDE RANGE OF IT PRINCIPLES, CONCEPTS, METHODS, INCLUDING DATABASE LOGICAL AND PHYSICAL DESIGN, NORMALIZATION, STORAGE CAPACITY MANAGEMENT AND BACKUP AND RECOVERY.\nKNOWLEDGE OF SOURCES, CHARACTERISTICS AND USES OF THE ORGANIZATION’S DATA ASSETS\nKNOWLEDGE OF THE ORGANIZATION’S POLICY AND PLANNING FORMULATION PROCESS ALONG WITH ITS MISSIONS, GOALS, AND OBJECTIVES TO PREPARE DATA ADMINISTRATION, STANDARDIZATION AND MANAGEMENT POLICIES AND PLANS.\nKNOWLEDGE OF DATABASE MANAGEMENT SYSTEMS, QUERY LANGUAGES, TABLE RELATIONSHIPS AND VIEWS; DATA MINING AND DATA WAREHOUSING PRINCIPLES AS WELL AS THE CHARACTERISTICS OF PHYSICAL AND VIRTUAL DATA STORAGE MEDIA\nKNOWLEDGE OF SYSTEMS ARCHITECTURE, INTEGRATION TECHNIQUES, AND TESTING METHODS SUFFICIENT TO CONDUCT FEASIBILITY STUDIES.\nABILITY TO PERFORM FEASIBILITY STUDIES, PERFORM COST ANALYSIS REVIEW, DEVELOP INVESTMENT PLANS, AND RECOMMEND A BEST COURSE OF ACTION ALONG WITH SUITABLE ALTERNATIVES.\nABILITY TO DEVELOP AND ADMINISTER DATA AND METADATA MANAGEMENT STANDARDS, POLICIES AND PROCEDURES.\nABILITY TO STAY WELL INFORMED ON RAPIDLY CHANGING TECHNOLOGY, TO EVALUATE ITS POSSIBLE IMPACT ON ORGANIZATION MISSIONS, AND TO DEVELOP PLANS TO SATISFY REQUIREMENTS.\nDESIRED SKILLS AND PREVIOUS ROLES HELD: DATA ANALYSIS, DATA QUALITY STANDARDS, DATA SECURITY, CLOUD ENABLED REPORTING AND ANALYTICS, DATABASE MGT SYSTEMS, DATA GOVERNANCE ANALYST, DATA MGT SPECIALIST, IT SPECIALIST, DATA ANALYST\nYOU WILL BE EVALUATED FOR THIS JOB BASED ON HOW WELL YOU MEET THE QUALIFICATIONS ABOVE.YOUR APPLICATION PACKAGE (RESUME, SUPPORTING DOCUMENTS) WILL BE USED TO DETERMINE YOUR ELIGIBILITY, AND QUALIFICATIONS.\nCLICK THE APPLY BUTTON TO COMPLETE AN APPLICATION AND UPLOAD RESUME (PDF OR WORD DOC) MUST INCLUDE NAME AND CONTACT INFORMATION AND/OR ADDITIONAL DOCUMENTS (TRANSCRIPTS, CERTIFICATIONS, VET DOCS (DD214), SF-50).\nFOR TIPS ON HOW TO WRITE A FEDERAL RESUME, CHECKOUT THE FOLLOWING LINK(S): HTTPS://AFCIVILIANCAREERS.COM/PDF/FEDERALRESUMEWRITING.PDF\nTO RECEIVE ADDITIONAL INFORMATION ABOUT CURRENT AND FUTURE JOB OPENINGS WITH AFCS VIA EMAIL NOTIFICATION, PLEASE SUBSCRIBE AT HTTPS://AFCIVILIANCAREERS.COM/FIND-A-JOB/ AND SIGN UP TO “GET CAREER UPDATES.”\nU.S. CITIZENSHIP REQUIRED. AFCS IS EQUAL OPPORTUNITY EMPLOYER. MUST BE OF LEGAL WORKING AGE.",
    "job_skill_set": [
      "database management systems",
      "data integration",
      "problem solving",
      "communication",
      "analytical thinking",
      "teamwork",
      "organizational skills",
      "data management",
      "data quality standards",
      "cloud reporting and analytics",
      "data mining",
      "data warehousing",
      "information assurance certification (SEC+)",
      "query languages",
      "systems architecture",
      "cost analysis",
      "metadata management",
      "feasibility studies",
      "data governance",
      "backup and recovery",
      "normalization",
      "storage capacity management",
      "adaptability",
      "decision making",
      "attention to detail",
      "time management",
      "strategic planning"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "analytical",
      "analytics",
      "and",
      "architecture",
      "assurance",
      "attention",
      "backup",
      "capacity",
      "certification",
      "cloud",
      "communication",
      "cost",
      "data",
      "database",
      "decision",
      "detail",
      "feasibility",
      "governance",
      "information",
      "informationtechnology",
      "integration",
      "languages",
      "making",
      "management",
      "metadata",
      "mining",
      "normalization",
      "organizational",
      "planning",
      "problem",
      "quality",
      "query",
      "recovery",
      "reporting",
      "sec",
      "skills",
      "solving",
      "specialist",
      "standards",
      "storage",
      "strategic",
      "studies",
      "systems",
      "teamwork",
      "technology",
      "thinking",
      "time",
      "to",
      "warehousing"
    ]
  },
  {
    "job_id": "3903458683",
    "job_title": "Information Technology Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "POSITION OVERVIEWOUR INNOVATION AND TECHNOLOGY TEAM IS CONTINUALLY EXPANDING TO SUPPORT OUR STUDENTS, FACULTY AND STAFF. LOOKING TO JOIN AND INNOVATIVE TEAM THAT IS CHANGING THE WORLD? APPLY TODAY!SPECIAL NOTE: THIS JOB POSTING SERVES AS A PIPELINE/REPOSITORY FOR POTENTIAL IT EMPLOYEES FOR THE UNIVERSITY. THIS DOES NOT REPRESENT AN ACTUAL JOB OPENING.\nKNOWLEDGE & EXPERIENCE:BACHELOR’S DEGREE IN COMPUTER APPLICATION, COMPUTER SCIENCE OR A RELATED IT FIELD.\nSKILLS & ABILITIES:PROFICIENCY IN PROGRAMMING LANGUAGES AND SOFTWARE DEVELOPMENT.EXPERIENCE IN HELP DESK SUPPORT AND CUSTOMER SERVICE.STRONG UNDERSTANDING OF NETWORKING PRINCIPLES AND SYSTEMS. ANY EXPERIENCE WITH EXTREME NETWORKS IS PREFERRED.KNOWLEDGE OF DATA SCIENCE, MACHINE LEARNING, AND AI TOOLS. PROFICIENCY WITH POWERBI AND PYTHON IS PREFERRED.ANY EXPERIENCE THE FOLLOWING IS A PLUS:ELLUCIAN BANNER SYSTEMSALESFORCE,JAVA, PEARL, R, PYTHONORACLE DATABASE AND SERVER ADMINISTRATIONORACLE DATABASE AND SERVER ADMINISTRATIONSSL CERTIFICATE MAINTENANCEINTERNAL APPLICATION DEVELOPMENT/MAINTENANCE PROGRAMMING**LINUX SYSTEM ADMINISTRATIONDNS ADMINISTRATIONMUST HAVE ABILITY TO WORK IN A TEAM.ADAPTABLE TO NEW TECHNOLOGIES AND ABLE TO GUIDE OTHERS IN THEIR ADOPTION.SOFT SKILLS - MUST ALSO POSSESS EXCELLENT ORGANIZATIONAL, ORAL, AND WRITTEN COMMUNICATION, AND CUSTOMER SERVICE SKILLS.MULTI-TASK WITH LITTLE TO NO SUPERVISIONKNOWLEDGE OF SYSTEMS ENGINEERING SOFTWARE TOOLS.MUST MAINTAIN A HIGH LEVEL OF CONFIDENTIALITY OF INFORMATION.MUST HAVE THE ABILITY TO EFFECTIVELY DEAL WITH PERSONS FROM A VARIETY OF CULTURAL BACKGROUNDS.MAINTAINS COMPLIANCE WITH THE FAMILY EDUCATIONAL RIGHTS AND PRIVACY ACT (FERPA).\n",
    "job_skill_set": [
      "help desk support",
      "customer service",
      "networking principles",
      "teamwork",
      "adaptability",
      "organizational skills",
      "oral communication",
      "written communication",
      "multi-tasking",
      "confidentiality",
      "cultural sensitivity",
      "compliance knowledge",
      "programming languages",
      "software development",
      "data science",
      "machine learning",
      "AI tools",
      "PowerBI",
      "Python",
      "Ellucian Banner",
      "Salesforce",
      "Java",
      "Perl",
      "R",
      "Oracle Database",
      "server administration",
      "SSL certificate maintenance",
      "Linux system administration",
      "DNS administration",
      "systems engineering software tools"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "ai",
      "banner",
      "certificate",
      "communication",
      "compliance",
      "confidentiality",
      "cultural",
      "customer",
      "data",
      "database",
      "desk",
      "development",
      "dns",
      "ellucian",
      "engineering",
      "help",
      "information",
      "informationtechnology",
      "java",
      "knowledge",
      "languages",
      "learning",
      "linux",
      "machine",
      "maintenance",
      "multitasking",
      "networking",
      "oracle",
      "oral",
      "organizational",
      "perl",
      "powerbi",
      "principles",
      "programming",
      "python",
      "r",
      "salesforce",
      "science",
      "sensitivity",
      "server",
      "service",
      "skills",
      "software",
      "specialist",
      "ssl",
      "support",
      "system",
      "systems",
      "teamwork",
      "technology",
      "tools",
      "written"
    ]
  },
  {
    "job_id": "3906074575",
    "job_title": "Senior Oracle Database Administrator (Senior Information Technology Systems Specialist)",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "ABOUT THIS POSITIONWITH MORE THAN 14,000 EMPLOYEES WORKING ACROSS 41 DEPARTMENTS, THE CITY OF PHOENIX OFFERS OPPORTUNITY FOR CAREER GROWTH AND ADVANCEMENT. WHETHER YOU'RE AN EXPERIENCED PROFESSIONAL OR JUST STARTING YOUR CAREER, WORKING IN PUBLIC SERVICE OFFERS MANY REWARDS! BE A PART OF BUILDING THE PHOENIX OF TOMORROW.\nTHE INFORMATION TECHNOLOGY DEPARTMENT HAS A VACANCY FOR A SENIOR ORACLE DATABASE ADMINISTRATOR (DBA). IN THIS ROLE YOU WILL BE RESPONSIBLE FOR PROVIDING TECHNICAL SUPPORT FOR THE ORACLE DATABASE ENVIRONMENTS. YOU WILL CONFIGURE AND MAINTAIN THE DATABASES TO ENSURE ACCURACY, AVAILABILITY, CONSISTENCY, AND ACCEPTABLE RESPONSE TIMES.\nADDITIONAL RESPONSIBILITIES INCLUDE:COLLABORATION WITH APPLICATION AND MANAGEMENT TEAMS TO ENSURE PROJECT WORK COMPLIES WITH STANDARDS, EXPECTATIONS, AND TIMELY DELIVERY.UPDATE AND MAINTAIN DOCUMENTATION TO ENSURE DATABASE MANAGEABILITY.PARTICIPATE IN AN ACTIVE ON-CALL ROTATION AND PROVIDE AFTER-HOURS SUPPORT WHEN NEEDED TO ENSURE DATABASE AVAILABILITY DURING NORMAL BUSINESS HOURS.OTHER RESPONSIBILITIES AS REQUESTED BY LEADERSHIP.DEPENDING ON ASSIGNMENT, THIS POSITION MAY BE ELIGIBLE FOR A TELEWORK SCHEDULE AT THE DISCRETION OF THE CHIEF INFORMATION OFFICER. YOU WILL BE REQUIRED TO COME INTO THE OFFICE FOR MEETINGS IN THE PHOENIX METRO AREA OR TO WORK ON-SITE WHEN ASSIGNED. TELEWORK IS SUBJECT TO DEPARTMENT NEED AND COULD CHANGE IN THE FUTURE.\n\nIDEAL CANDIDATEKNOWLEDGE AND UNDERSTANDING OF DISASTER RECOVERY PROCEDURES AND DATABASE BACKUP/RECOVERY UTILITIES INCLUDING RECOVERY MANAGER (RMAN), DATA PUMP, FLASHBACK TECHNOLOGIES, AND MEDIA MANAGEMENT INTEGRATION.KNOWLEDGE AND UNDERSTANDING OF DATABASE SECURITY MANAGEMENT PRACTICES AND ADVANCED TECHNOLOGIES INCLUDING TRANSPARENT DATA ENCRYPTION (TDE), LIGHTWEIGHT DIRECTORY ACCESS PROTOCOL (LDAP) AUTHENTICATION, AND DATA MASKING.SKILLED IN SCRIPTING LANGUAGES SUCH AS SHELL, PERL, OR PYTHON.SELF-MOTIVATED WITH ATTENTION TO DETAIL.\n\nSALARYPAY RANGE: $93,121.60 TO $131,040.00/ANNUALLY.HIRING RANGE: $93,121.60 TO $118,872.00/ANNUALLY.\nPAY RANGE EXPLANATION:PAY RANGE IS THE ENTIRE COMPENSATION RANGE FOR THE POSITION CLASSIFICATION.HIRING RANGE IS AN ESTIMATE OF WHERE YOU CAN RECEIVE AN OFFER. THE ACTUAL SALARY OFFER WILL CAREFULLY CONSIDER A WIDE RANGE OF FACTORS, INCLUDING YOUR SKILLS, QUALIFICATIONS, EXPERIENCE, EDUCATION, LICENSES, TRAINING, AND INTERNAL EQUITY.\n\nBENEFITSA COMPREHENSIVE BENEFITS PACKAGE IS OFFERED WHICH INCLUDES:TRADITIONAL PENSION WITH EMPLOYER AND EMPLOYEE CONTRIBUTIONS, CLICK HERE FOR MORE DETAILS: PENSION INFORMATION401(A) AND 457 PLANS WITH EMPLOYER CONTRIBUTIONSCHOICE OF GENEROUS MEDICAL HMO, PPO, OR HSA/HDHP PLANSMEDICAL ENROLLMENT INCLUDES A MONTHLY $150 CITY CONTRIBUTION TO A POST-EMPLOYMENT HEALTH PLANWELLNESS INCENTIVE OF UP TO $720 ANNUALLYDENTAL, VISION, AND LIFE INSURANCE OPTIONSEMPLOYER PAID LONG-TERM DISABILITYFREE BUS/LIGHT RAIL PASSTUITION REIMBURSEMENT PROGRAM UP TO $6,500 PER YEARPAID TIME OFF INCLUDES 13.5 PAID HOLIDAYS, 12 VACATION DAYS, AND 15 SICK DAYS AND PERSONAL LEAVE DAYSPAID PARENTAL LEAVE FOR ELIGIBLE EMPLOYEES UP TO 480 HOURS (12 WEEKS) OF PAID LEAVE FOR THE BIRTH, ADOPTION, OR FOSTER CARE PLACEMENT OF A CHILD DURING A 12-MONTH PERIODFEDERAL STUDENT LOAN FORGIVENESS OFFERED THROUGH SAVIFOR MORE DETAILS, VISIT: UNIT 007 BENEFITS\n\nMINIMUM QUALIFICATIONSTWO YEARS OF EXPERIENCE AS AN INFORMATION TECHNOLOGY SYSTEMS SPECIALIST INVOLVING DATABASE MANAGEMENT AND ON-LINE TELECOMMUNICATIONS.BACHELOR'S DEGREE IN COMPUTER SCIENCE, MATH, OR A RELATED FIELD.OTHER COMBINATIONS OF EXPERIENCE AND EDUCATION THAT MEET THE MINIMUM REQUIREMENTS MAY BE SUBSTITUTED.THE CITY JOB DESCRIPTION CAN BE FOUND HERE.ALL FINALISTS FOR POSITIONS ARE SUBJECT TO A CRIMINAL BACKGROUND CHECK APPLICABLE TO THE DEPARTMENT OR POSITION.THIS POSITION IS SUBJECT TO CRIMINAL JUSTICE INFORMATION SYSTEMS (CJIS) BACKGROUND STANDARDS. CANDIDATES WHO RECEIVE A CONDITIONAL OFFER OF EMPLOYMENT MUST BE FINGERPRINTED AND WILL HAVE THEIR FINGERPRINTS USED TO CHECK THE CRIMINAL HISTORY RECORDS OF THE STATE OF ARIZONA DEPARTMENT OF PUBLIC SAFETY AND THE FEDERAL BUREAU OF INVESTIGATION. ANY RECORDS RETURNED WILL BE REVIEWED TO DETERMINE THE CANDIDATE’S SUITABILITY FOR THE JOB. FOR INFORMATION REGARDING PRE-SCREENING AND DRIVING POSITIONS, CLICK HERE. \nPREFERRED QUALIFICATIONSTHE MINIMUM QUALIFICATIONS LISTED ABOVE, PLUS:FIVE YEARS OF EXPERIENCE SUPPORTING ORACLE RELATIONAL DATABASE MANAGEMENT SYSTEMS (RDBMS).FIVE YEARS OF EXPERIENCE WITH ORACLE REAL APPLICATION CLUSTERS (RAC), GRID INFRASTRUCTURE, AND AUTOMATED STORAGE MANAGER (ASM).TWO YEARS OF EXPERIENCE ADMINISTERING EXADATA/EXACC ENVIRONMENTS INCLUDING UPGRADE, PATCHING, AND SYSTEM ADMINISTRATION.TWO YEARS OF EXPERIENCE WITH ADVANCED DATABASE REPLICATION SOLUTIONS INCLUDING MATERIALIZED VIEWS, DATAGUARD, AND GOLDENGATE.EXPERIENCE PROGRAMMING IN SQL AND PL/SQL.\n\nRECRUITMENT DATESRECRUITMENT CLOSES MAY 1, 2024. ALL MATERIALS MUST BE RECEIVED BY 11:59 P.M. ON THIS DATE.THIS IS A POSITION-BASED RECRUITMENT AND WILL NOT RESULT IN ANY ONGOING ELIGIBILITY LIST. THIS RECRUITMENT AND ANY SELECTION PROCESSES RESULTING FROM THIS RECRUITMENT MAY BE USED TO FILL OTHER RELATED VACANCIES WITHIN THE ORGANIZATION NOW OR IN THE NEAR FUTURE.\n\nHOW TO APPLYAPPLY ONLINE BY COMPLETING THE REQUIRED INFORMATION AND ATTACHING, AS ONE DOCUMENT, YOUR COVER LETTER AND RESUME. PLEASE INCLUDE YOUR EXPERIENCE AS IT RELATES TO THE QUALIFICATIONS STATED ABOVE. ONLY THE HIGHEST QUALIFIED MAY BE POSTED TO THE ELIGIBLE TO HIRE LIST. THE RESULTS OF THE RESUME SCREENING PROCESS WILL BE SENT TO YOUR PRIMARY EMAIL ADDRESS.DURING THE ONLINE APPLICATION PROCESS, YOU WILL PROVIDE RESPONSES TO QUESTIONS REGARDING YOUR EXPERIENCE AND QUALIFICATIONS. INFORMATION YOU PROVIDE IN THESE QUESTIONS SHOULD ALIGN TO THE INFORMATION IN YOUR RESUME. INFORMATION NOT CONSISTENT WITH YOUR RESUME MAY NOT BE CONSIDERED WHEN DETERMINING YOUR EDUCATION AND/OR EXPERIENCE LEVEL.\n\nWE ARE HERE TO HELPJOB INTERVIEWS MAY BE HELD BY VIDEO OR AUDIO CONFERENCE.IF YOU ARE IN NEED OF COMPUTER RESOURCES, CLICK HERE FOR FREE OPTIONS.ARIZONA AT WORK HAS FREQUENT CLASSES TO HELP WITH RESUME WRITING, INTERVIEWING SKILLS, AND GENERAL CAREER GUIDANCE. CLICK HERE FOR MORE INFORMATION.EXPLORE OTHER EMPLOYMENT OPPORTUNITIES WITH THE CITY OF PHOENIX.SUBSCRIBE TO RECEIVE E-MAIL NOTIFICATIONS ABOUT NEW EMPLOYMENT OPPORTUNITIES.IF YOU NEED ASSISTANCE APPLYING FOR THIS JOB, PLEASE CONTACT OUR HR CONNECTION CENTER AT (602) 495-5700.\n\nREFERENCESENIOR INFO TECH SYSTEMS SPEC, JC:09570, ID# 54125, 4/16/2024, USM, KA, BENEFITS:007.BUILDING THE PHOENIX OF TOMORROW.#DOWORKTHATMAKESPHOENIXWORKCITY OF PHOENIX IS AN EQUAL OPPORTUNITY EMPLOYER. AMERICORPS, PEACE CORPS, AND OTHER NATIONAL SERVICE ALUMNI WHO MEET THE REQUIRED QUALIFICATIONS ARE ENCOURAGED TO APPLY.",
    "job_skill_set": [
      "Attention to Detail",
      "Self-Motivated",
      "Collaboration",
      "Communication",
      "Problem Solving",
      "Time Management",
      "Adaptability",
      "Oracle Database Administration",
      "Disaster Recovery Procedures",
      "Database Backup/Recovery Utilities",
      "Recovery Manager (RMAN)",
      "Data Pump",
      "Flashback Technologies",
      "Media Management Integration",
      "Database Security Management",
      "Transparent Data Encryption (TDE)",
      "Lightweight Directory Access Protocol (LDAP) Authentication",
      "Data Masking",
      "Scripting Languages (Shell, Perl, Python)",
      "SQL",
      "PL/SQL",
      "Oracle Real Application Clusters (RAC)",
      "Grid Infrastructure",
      "Automated Storage Manager (ASM)",
      "Advanced Database Replication Solutions",
      "Materialized Views",
      "DataGuard",
      "GoldenGate"
    ],
    "short_keywords": [
      "access",
      "adaptability",
      "administration",
      "administrator",
      "advanced",
      "application",
      "asm",
      "attention",
      "authentication",
      "automated",
      "backuprecovery",
      "clusters",
      "collaboration",
      "communication",
      "data",
      "database",
      "dataguard",
      "detail",
      "directory",
      "disaster",
      "encryption",
      "flashback",
      "goldengate",
      "grid",
      "information",
      "informationtechnology",
      "infrastructure",
      "integration",
      "languages",
      "ldap",
      "lightweight",
      "management",
      "manager",
      "masking",
      "materialized",
      "media",
      "oracle",
      "perl",
      "plsql",
      "problem",
      "procedures",
      "protocol",
      "pump",
      "python",
      "rac",
      "real",
      "recovery",
      "replication",
      "rman",
      "scripting",
      "security",
      "selfmotivated",
      "senior",
      "shell",
      "solutions",
      "solving",
      "specialist",
      "sql",
      "storage",
      "systems",
      "tde",
      "technologies",
      "technology",
      "time",
      "to",
      "transparent",
      "utilities",
      "views"
    ]
  },
  {
    "job_id": "3905655160",
    "job_title": "Information Technology Help Desk Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "HELP DESK MANAGER | HYBRID | NEWINGTON, CT | $100,000 - $150,000 + UNLIMITED PTO + BENEFITS \nDO YOU WANT TO BE THE FACE OF A COMPANY?ARE YOU WANTING TO DELIVER EXCELLENT CUSTOMER SERVICE?ARE YOU LOOKING TO WORK IN A COMPANY THAT VALUES YOUR WORK/LIFE BALANCE?\n⭐ LOOK NO FURTHER!⭐\nYOU WOULD BE WORKING IN A PRESTIGIOUS IT COMPANY WHO PROVIDES IT SOLUTIONS TO BUSINESSES FOR OVER A DECADE. THIS COMPANY PUSHES ITS CORE VALUES AND CULTURE INTO EVERYTHING THEY DO TO ENABLE THE COMPANY AND MOST IMPORTANTLY THE EMPLOYEES TO GROW.\nYOU WILL BE THE COMMUNICATOR BETWEEN CUSTOMER AND CLIENT, ENSURING ALL THEIR NEEDS HAVE BEEN MET TO A HIGH STANDARD. THIS ROLE WILL BE LARGELY CLIENT-FACING AND WILL REQUIRE FREQUENT DAY-TO-DAY INTERACTION WITH EXECUTIVES, JUNIOR ENGINEERS, AND VENDORS. YOU WILL OFTEN BE HANDS-ON WHEN NECESSARY RESOLVING ESCALATED ISSUES FROM JUNIORS.\nEXPERIENCED DESIRED:\nEXPERIENCE HANDLING ESCALATED ISSUES THAT INVOLVE ACTIVE DIRECTORY, WINDOWS SERVERS AND O365.STAKEHOLDER AND VENDOR MANAGEMENT EXPERIENCE PREVIOUS MANAGEMENT EXPERIENCEEXCELLENT CUSTOMER SERVICE SKILLSWHAT YOU WILL RECEIVE:\nMEDICAL, DENTAL AND VISION INSURANCE401K PLANUNLIMITED PTOTUITION REIMBURSEMENTABILITY TO WORK IN A GROWING ENVIRONMENT\nTHE COMPANY ARE LOOKING TO BEGIN CONVERSATIONS AND INTERVIEWS FROM THIS WEEK, TO SECURE AN INTERVIEW SLOT, SEND IN AN APPLICATION, SEND ME OVER A MESSAGE OR SEND YOUR RESUME INTO THE DETAILS BELOW!\nJ.ELLIS@FRANKLINFITCH.COM+1 212 970 7606\nHELP DESK MANAGER | HYBRID | NEWINGTON, CT | $100,000 - $150,000 + UNLIMITED PTO + BENEFITS",
    "job_skill_set": [
      "Management Experience",
      "Customer Service",
      "Communication",
      "Problem Solving",
      "Teamwork",
      "Active Directory",
      "Windows Servers",
      "O365",
      "Stakeholder Management",
      "Vendor Management"
    ],
    "short_keywords": [
      "active",
      "communication",
      "customer",
      "desk",
      "directory",
      "experience",
      "help",
      "information",
      "informationtechnology",
      "management",
      "manager",
      "o365",
      "problem",
      "servers",
      "service",
      "solving",
      "stakeholder",
      "teamwork",
      "technology",
      "vendor",
      "windows"
    ]
  },
  {
    "job_id": "3905871177",
    "job_title": "Information Technology Project Coordinator",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "*4-6 MONTH CONTRACT, 2 DAYS A WEEK ONSITE*\nESSENTIAL DUTIES AND RESPONSIBILITIES:ASSIST WITH IMPLANTATION OF NEW SOFTWARE AND APPLICATIONS AS WELL AS MAINTENANCE AND TESTING OF CURRENT APPLICATIONSFAMILIARITY WITH PROJECT MANAGEMENT TOOLS (IDEALLY MONDAY.COM).FAMILIARITY WITH APPLICATIONS DEVELOPMENT PROCESS.FAMILIARITY WITH SOFTWARE DEVELOPMENT METHODOLOGIES AS REQUIRED BY ASSOCIATED DEVELOPMENT TEAM.IDENTIFIES AND HELPS TO IMPLEMENTS STRATEGIES AND EFFICIENCIES TO ENHANCE CUSTOMER EXPERIENCE AND ALIGN WITH BUSINESS OPERATIONS\nEDUCATION/EXPERIENCE:A BACHELOR'S DEGREE IN INFORMATION SYSTEMS, COMPUTER SYSTEMS, COMPUTER SCIENCE, BUSINESS ADMINISTRATION, OR EQUIVALENT COMBINATION OF EDUCATION AND EXPERIENCE IS A PLUS.3+ YEARS RELATED EXPERIENCE.\nREQUIRED SKILLS AND ABILITIES:EXCELLENT COMMUNICATION AND INTERPERSONAL SKILLSFAMILIARITY WITH STANDARD PROJECT MANAGEMENT PROCESS AND PROCEDURESANALYTICAL APPROACH TO PROBLEM SOLVING AND ABILITY TO THINK OUTSIDE THE BOX.STRONG ORGANIZATIONAL SKILLS, ABILITY TO MANAGE MULTIPLE TASKS WITH MINIMAL SUPERVISION2-3 YEARS OF EXPERIENCE WORKING IN A TECHNICAL SERVICES ENVIRONMENTPROJECT AND TIME MANAGEMENT SKILLSGENERATE AND MAINTAIN ORGANIZED TECHNICAL DOCUMENTATIONMUST BE SELF-MOTIVATED AND ORGANIZED WITH A STRONG DESIRE TO LEARN NEW SKILLSABILITY TO MOVE BETWEEN PROJECTS QUICKLY AS CLIENTS' DEMANDS AND COMPANY NEEDS EVOLVEKNOWLEDGE OF LABORATORY PROCEDURES AND WORKFLOW PREFERRED",
    "job_skill_set": [
      "software development methodologies",
      "applications development process",
      "communication",
      "interpersonal skills",
      "analytical problem solving",
      "organizational skills",
      "time management",
      "self-motivation",
      "adaptability",
      "project management tools",
      "technical documentation",
      "laboratory procedures"
    ],
    "short_keywords": [
      "adaptability",
      "analytical",
      "applications",
      "communication",
      "coordinator",
      "development",
      "documentation",
      "information",
      "informationtechnology",
      "interpersonal",
      "laboratory",
      "management",
      "methodologies",
      "organizational",
      "problem",
      "procedures",
      "process",
      "project",
      "selfmotivation",
      "skills",
      "software",
      "solving",
      "technical",
      "technology",
      "time",
      "tools"
    ]
  },
  {
    "job_id": "3901979134",
    "job_title": "Information Technology Support Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "LHH IS WORKING WITH A CLIENT IN DALLAS, TX THAT IS SEEKING A IT SUPPORT SPECIALIST FOR A LONG TERM CONTRACT. THE ROLE IS ON SITE 5 DAYS A WEEK CLOSE TO UPTOWN IN DALLAS.\nAS THE IT SUPPORT SPECIALIST YOU WILL BE RESPONSIBLE FOR:RESPONSIBLE FOR PROVIDING A HIGH LEVEL OF SUPPORT FOR 100+ END USERS IN MULTIPLE LOCATIONSPROVIDE HARDWARE/SOFTWARE SUPPORT FOR ALL WORKSTATIONS, SYSTEMS, AND SERVERSRESPOND AND ESCALATE AS NEEDED TO ANY NETWORK AND SECURITY ISSUESRESPOND TO ALL SUPPORT ISSUES VIA MESSENGER, PHONE, AND EMAIL IN A TIMELY MANNER THAT\nREQUIREMENTS FOR THE IT SUPPORT SPECIALIST:3 YEARS OF HELP DESK EXPERIENCE HIGH LEVEL OF PROFICIENCY WITH MICROSOFT OFFICE APPLICATIONSSTRONG LEVEL OF KNOWLEDGE ON WINDOWS, MAC, AND SERVER OPERATING SYSTEMSEXPERIENCE WORKING WITH VPN’S, MULTI-FACTOR AUTHENTICATION (DUO), ACCESS CONTROL SYSTEMS, AND CCTV SYSTEMS\nIF YOU MEET THE ABOVE CRITERIA PLEASE APPLY TO THE CONTRACT IT SUPPORT SPECIALIST ROLE. MUST BE LOCAL TO DALLAS,TX.",
    "job_skill_set": [
      "Help Desk Support",
      "Microsoft Office",
      "Windows Operating System",
      "Mac Operating System",
      "Server Operating Systems",
      "CCTV Systems",
      "Communication",
      "Problem Solving",
      "Time Management",
      "Customer Service",
      "Teamwork",
      "VPNs",
      "Multi-Factor Authentication (Duo)",
      "Access Control Systems"
    ],
    "short_keywords": [
      "access",
      "authentication",
      "cctv",
      "communication",
      "control",
      "customer",
      "desk",
      "duo",
      "help",
      "information",
      "informationtechnology",
      "mac",
      "management",
      "microsoft",
      "multifactor",
      "office",
      "operating",
      "problem",
      "server",
      "service",
      "solving",
      "specialist",
      "support",
      "system",
      "systems",
      "teamwork",
      "technology",
      "time",
      "vpns",
      "windows"
    ]
  },
  {
    "job_id": "3902362545",
    "job_title": "Hybrid - Information Technology Manager 1",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "WHO WE ARE…\n\nTHE MISSION OF THE OHIO DEPARTMENT OF MENTAL HEALTH AND ADDICTION SERVICES (OHIOMHAS) IS TO PROVIDE STATEWIDE LEADERSHIP OF A HIGH-QUALITY MENTAL HEALTH AND ADDICTION PREVENTION, TREATMENT AND RECOVERY SYSTEM THAT IS EFFECTIVE AND VALUED BY ALL OHIOANS.\n\nOHIOMHAS VALUES\n\nCONTRIBUTE AND COLLABORATESERVE COMPASSIONATELYDELIVER QUALITYBE ACCOUNTABLE\n\nAT OHIOMHAS WE STRIVE TO ATTRACT AND SUSTAIN A DIVERSE WORKFORCE BY RECRUITING, HIRING, DEVELOPING AND RETAINING HIGH-PERFORMING EMPLOYEES WHO WORK COLLABORATIVELY TO BALANCE EFFORTS TOWARD PROVIDING PREVENTION AND RECOVERY SUPPORTS AND FOSTERING INCLUSION THAT INSPIRES INNOVATION, ENCOURAGES RESPECT AND PROMOTES UNLIMITED SUCCESS.\n\nOHIOMHAS INFORMATION SERVICES IS THE TECHNOLOGY ARM OF THE THIRD LARGEST CABINET LEVEL AGENCY IN THE STATE OF OHIO. WE SUPPORT MORE THAN 3,200 EMPLOYEES WITHIN SIX REGIONAL INPATIENT BEHAVIORAL HEALTH HOSPITALS, OHIO PHARMACY SERVICES, AND CENTRAL OFFICE. WE DEVELOP AND SUPPORT TECHNOLOGY FOR SEVERAL CRITICAL BUSINESS SOLUTIONS USED BY THE AGENCY AS WELL AS BY COUNTY AND LOCAL BEHAVIORAL HEALTH CARE PROVIDERS ACROSS THE STATE.\n\nWE ARE ACCEPTING APPLICATIONS FOR A HYBRID - INFORMATION TECHNOLOGY MANAGER 1 WITHIN THE OFFICE OF INFORMATION TECHNOLOGY, HEADQUARTERED AT THE JAMES RHODES STATE OFFICE TOWER, 30 EAST BROAD STREET, 33RD FLOOR, COLUMBUS, OHIO 43215.\n\nWHAT YOU'LL DO\n\nWE ARE ACCEPTING APPLICATIONS FOR AN INFRASTRUCTURE MANAGER (INFORMATION TECHNOLOGY MANAGER 1) WITHIN THE OFFICE OF INFORMATION SERVICES. AS THE IT INFRASTRUCTURE MANAGER, YOU WILL BE PLANNING, COORDINATING, AND SUPERVISING ACTIVITIES OF ALL NETWORKS, DESKTOP, AND TELECOMMUNICATIONS SYSTEMS AND ITS ASSOCIATED ADMINISTRATIVE ACTIVITIES, INCLUDING DESIGN, IMPLEMENTATION, AND NETWORK ADMINISTRATION OF HARDWARE AND SOFTWARE, AND PROVIDING COST-EFFECTIVE SOLUTIONS FOR INFRASTRUCTURE AND END-USER NEEDS.\n\nRESPONSIBILITIES INCLUDE, BUT ARE NOT LIMITED TO\n\nOVERSEE THE DESIGN AND IMPLEMENTATION OF THE AGENCY’S IT INFRASTRUCTURE TO ENSURE IT MEETS THE ORGANIZATION'S NEEDS AND GOALS.MANAGING THE DAY TO DAY OPERATIONAL AND PROJECTS TASKS WITHIN THE INFRASTRUCTURE AND DESKTOP SUPPORT TEAM.MONITORING AND MAINTAINING THE PERFORMANCE, SECURITY, AND RELIABILITY OF THE AGENCY’S INFRASTRUCTURE, IMPLEMENTING NECESSARY UPDATES AND FIXES AS NEEDED.COMMUNICATE EFFECTIVELY WITH STAKEHOLDERS TO PROVIDE UPDATES ON THE INFRASTRUCTURE AND ADDRESS ANY CONCERNS OR QUESTIONS.SELECTING AND PURCHASING NEW AND REPLACEMENT HARDWARE AND SOFTWARE, FOR OUR REGIONAL PSYCHIATRIC HOSPITALS AND OTHER SITES.EVALUATING TECHNOLOGY RISKS IN ORDER TO DEVELOP A NETWORK DISASTER RECOVERY PLAN AND BACKUP PROCEDURES.LEADS/SUPPORTS CROSS-FUNCTIONAL PROJECTS AS REQUIRED.\n\nWHAT’S IN IT FOR YOU\n\nAT THE STATE OF OHIO, WE TAKE CARE OF THE TEAM THAT CARES FOR OHIOANS. WE PROVIDE A VARIETY OF QUALITY, COMPETITIVE BENEFITS TO ELIGIBLE FULL-TIME AND PART-TIME EMPLOYEES. FOR A LIST OF ALL THE STATE OF OHIO BENEFITS, VISIT OUR TOTAL REWARDS WEBSITE! OUR BENEFITS PACKAGE INCLUDES:\n\nMEDICAL COVERAGE\n\nQUALITY, AFFORDABLE, AND COMPETITIVE MEDICAL BENEFITS ARE OFFERED THROUGH THE AVAILABLE OHIO MED PLANS. \n\nDENTAL, VISION AND BASIC LIFE INSURANCE\n\nDENTAL, VISION, AND BASIC LIFE INSURANCE PREMIUMS ARE FREE AFTER COMPLETED ELIGIBILITY PERIOD. LENGTH OF ELIGIBILITY PERIOD IS DEPENDENT ON UNION REPRESENTATION.\n\nTIME AWAY FROM WORK AND WORK/LIFE BALANCE\n\nPAID TIME OFF, INCLUDING VACATION, PERSONAL, AND SICK LEAVE 11 PAID HOLIDAYS PER YEARCHILDBIRTH/ADOPTION LEAVE\n\nEMPLOYEE DEVELOPMENT FUNDS\n\nTHE STATE OF OHIO OFFERS A VARIETY OF EDUCATIONAL AND PROFESSIONAL DEVELOPMENT FUNDING THAT VARIES BASED ON WHETHER YOU ARE A UNION-EXEMPT EMPLOYEE OR A UNION-REPRESENTED EMPLOYEE.\n\nOHIO PUBLIC EMPLOYEES RETIREMENT SYSTEM\n\nOPERS IS THE RETIREMENT SYSTEM FOR STATE OF OHIO EMPLOYEES. THE EMPLOYEE CONTRIBUTES 10% OF THEIR SALARY TOWARDS THEIR RETIREMENT. THE EMPLOYER CONTRIBUTES AN AMOUNT EQUAL TO 14% OF THE EMPLOYEE’S SALARY. VISIT THE OPERS WEBSITE FOR MORE INFORMATION.\n\nDEFERRED COMPENSATION\n\nTHE OHIO DEFERRED COMPENSATION PROGRAM IS A 457(B) VOLUNTARY RETIREMENT SAVINGS PLAN. VISIT THE OHIO DEFERRED COMPENSATION WEBSITE FOR MORE INFORMATION.\n\n8 1/2 YEARS (102 MOS.) EXP. COMMENSURATE WITH JOB DUTIES TO BE PERFORMED & KNOWLEDGES & SKILLS REQUIRED AS OUTLINED IN APPROVED POSITION DESCRIPTION ON FILE FOR POSITION TO BE FILLED AS ADVERTISED IN JOB POSTING; 18 MONTHS EXP. IN PERFORMING PROJECT MANAGEMENT FUNCTIONS AS DEFINED IN SERIES PURPOSE.\n\nOR COMPLETION OF UNDERGRADUATE CORE COURSEWORK IN COMPUTER SCIENCE, OR COMPLETION OF UNDERGRADUATE CORE COURSEWORK IN ANY ACADEMIC MAJOR WHICH INCLUDED AT LEAST ONE COURSE IN EACH OF THE FOLLOWING: ADVANCED-LEVEL COMPUTER PROGRAMMING LANGUAGE (FOR EXAMPLE, COBOL, DELPHI, JAVA, POWERBUILDER, VISUAL BASIC, PL 1, SAS PCS, PACBASE, FULL VISUAL SUITE, DESIGNER 2000, DEVELOPER 2000, C, C++, VISUAL C, ECL, OR VISUAL STUDIO), LOGIC-BASED MATHEMATICS, DATA BASE CONCEPTS (FOR EXAMPLE, ORACLE, MICROSOFT ACCESS, PARADOX, SYBASE, IMS DB, DB2, CACHE, DMS, OR RDMS), COMPUTER SYSTEMS ANALYSIS & DESIGN, & BASIC DATA PROCESSING CONCEPTS; ADDITIONAL 6 1/2 YEARS (78 MOS.) EXP. COMMENSURATE WITH JOB DUTIES TO BE PERFORMED & KNOWLEDGES & SKILLS REQUIRED AS OUTLINED IN APPROVED POSITION DESCRIPTION ON FILE FOR POSITION TO BE FILLED AS ADVERTISED IN JOB POSTING.; 18 MOS. EXP. IN PERFORMING PROJECT MANAGEMENT FUNCTIONS AS DEFINED IN SERIES PURPOSE.OR 12 MOS. EXP. AS INFORMATION TECHNOLOGY SUPERVISOR 3, 64119, OR EQUIVALENT. OR IN OFFICES OF STATEWIDE INFORMATION TECHNOLOGY POLICY & PLANNING, POSITIONS REQUIRE COMPLETION OF UNDERGRADUATE CORE COURSEWORK IN COMPUTER SCIENCE, OR COMPLETION OF UNDERGRADUATE CORE COURSEWORK IN ANY ACADEMIC MAJOR WHICH INCLUDED AT LEAST ONE COURSE IN EACH OF THE FOLLOWING: ADVANCED-LEVEL COMPUTER PROGRAMMING LANGUAGE (FOR EXAMPLE, COBOL, DELPHI, JAVA, POWERBUILDER, VISUAL BASIC, PL 1, SAS PCS, PACBASE, FULL VISUAL SUITE, DESIGNER 2000, DEVELOPER 2000, C, C++, VISUAL C, ECL, OR VISUAL STUDIO), LOGIC-BASED MATHEMATICS, DATA BASE CONCEPTS (FOR EXAMPLE, ORACLE, MICROSOFT ACCESS, PARADOX, SYBASE, IMS DB, DB2, CACHE, DMS, OR RDMS), COMPUTER SYSTEMS ANALYSIS & DESIGN, & BASIC DATA PROCESSING CONCEPTS; 3 YRS. EXP. IN UTILIZING WORD PROCESSING SOFTWARE; 3 YRS. EXP. IN UTILIZING INTERNET BROWSER(S) FOR RESEARCH; 54 MOS. EXP. WHICH INCLUDED FOLLOWING: KNOWLEDGE OF INFORMATION TECHNOLOGY ARCHITECTURE COMPONENTS, DEVELOPING INFORMATION TECHNOLOGY STRATEGIC PLANS, PREPARING & MAKING PRESENTATIONS/PUBLIC SPEAKING, WRITING INFORMATION TECHNOLOGY RELATED POLICY & PROCEDURES, PREPARING & MONITORING BUDGET, PROVIDING COST & RESOURCES ESTIMATES, & CONTRACT MANAGEMENT; 2 YRS. EXP. IN UTILIZING E-MAIL SYSTEM; 18 MOS. EXP. IN PROJECT MANAGEMENT OR LEAD ROLE ON INFORMATION TECHNOLOGY PROJECT;12 MOS. EXP. IN UTILIZING SPREADSHEET SOFTWARE; 12 MOS. EXP. AS INFORMATION TECHNOLOGY SUPERVISOR 3, 64119, OR EQUIVALENT.OR EQUIVALENT OF MINIMUM CLASS QUALIFICATIONS FOR EMPLOYMENT NOTED ABOVE.\n\nJOB SKILLS: INFORMATION TECHNOLOGY, PROJECT MANAGEMENT, PROGRAMMING, CUSTOMER FOCUS, DEVELOPING OTHERS, WRITTEN COMMUNICATION\n\nPRIMARY LOCATION\n\nUNITED STATES OF AMERICA-OHIO-FRANKLIN COUNTY-COLUMBUS\n\nWORK LOCATIONS\n\nJAMES A RHODES OFFICE TOWER 33\n\nORGANIZATION\n\nMENTAL HEALTH & ADDICTION SERVICES\n\nCLASSIFIED INDICATOR\n\nUNCLASSIFIED\n\nBARGAINING UNIT / EXEMPT\n\nEXEMPT\n\nSCHEDULE\n\nFULL-TIME\n\nWORK HOURS\n\n8:00 AM - 5:00 PM\n\nCOMPENSATION\n\n$43.29 - $61.89 PER HOUR\n\nUNPOSTING DATE\n\nAPR 28, 2024, 11:59:00 PM\n\nPRIMARY JOB SKILL\n\nINFORMATION TECHNOLOGY\n\nTECHNICAL SKILLS\n\nPROGRAMMING, INFORMATION TECHNOLOGY, PROJECT MANAGEMENT\n\nPROFESSIONAL SKILLS\n\nCUSTOMER FOCUS, DEVELOPING OTHERS, WRITTEN COMMUNICATION\n\nPRIMARY TECHNOLOGY\n\nNOT APPLICABLE\n\nAGENCY CONTACT NAME\n\nVICKI COX, HUMAN CAPITAL MANAGEMENT SENIOR ANALYST\n\nAGENCY CONTACT INFORMATION\n\nVICKI.COX@MHA.OHIO.GOV",
    "job_skill_set": [
      "information technology",
      "project management",
      "cost-effective solutions",
      "communication",
      "collaboration",
      "customer focus",
      "problem solving",
      "accountability",
      "leadership",
      "adaptability",
      "programming",
      "network administration",
      "hardware and software implementation",
      "disaster recovery planning",
      "database concepts",
      "IT infrastructure design",
      "telecommunications systems",
      "developing others"
    ],
    "short_keywords": [
      "1",
      "accountability",
      "adaptability",
      "administration",
      "and",
      "collaboration",
      "communication",
      "concepts",
      "costeffective",
      "customer",
      "database",
      "design",
      "developing",
      "disaster",
      "focus",
      "hardware",
      "hybrid",
      "implementation",
      "information",
      "informationtechnology",
      "infrastructure",
      "it",
      "leadership",
      "management",
      "manager",
      "network",
      "others",
      "planning",
      "problem",
      "programming",
      "project",
      "recovery",
      "software",
      "solutions",
      "solving",
      "systems",
      "technology",
      "telecommunications"
    ]
  },
  {
    "job_id": "3905855841",
    "job_title": "Information Technology Infrastructure Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "HYBRID SCHEDULE IS 3 DAYS ON-SITE AND 2 REMOTE.\nIT INFRASTRUCTURE MANAGER\nAS A MEMBER OF THE IT TEAM, THE INFRASTRUCTURE MANAGER PROVIDES LEADERSHIP AND TECHNOLOGY VISION IN THE SUPPORT, DEVELOPMENT, AND IMPLEMENTATION OF INFORMATION TECHNOLOGY. THE INFRASTRUCTURE MANAGER IS RESPONSIBLE FOR MANAGING, ADMINISTERING, MONITORING, AND SUPPORTING THE INFRASTRUCTURE RELATED COMPONENTS AND ENVIRONMENTS. THEY WORK DIRECTLY WITH THE IT HELP DESK, SUPPORTING TECHNOLOGY AND APPLICATIONS PROVIDED TO THE BUSINESS. THE INFRASTRUCTURE MANAGER POSITION REQUIRES STRONG KNOWLEDGE AND HANDS ON EXPERIENCE WITH NETWORK ADMINISTRATION, DATA CENTER OPERATIONS, OFFICE 365, AND MICROSOFT SYSTEMS. \nGENERAL RESPONSIBILITIES:LEAD AND DIRECTS PERFORMANCE OF THE INFRASTRUCTURE TEAMREVIEWS, EVALUATES, AND DEVELOPS RECOMMENDATIONS FOR ENHANCEMENTS AND SUPPORT OF IT INFRASTRUCTURE AND APPLICATIONSDOCUMENT, PLAN, DESIGN, IMPLEMENT, SUPPORT, AND MAINTAIN ALL ASPECT OF THE ENTERPRISE INFRASTRUCTURE INCLUDING SERVERS, STORAGE, NETWORK, AND TELECOMMUNICATION COMPONENTSESTABLISHES AND IMPLEMENTS POLICIES, STANDARDS, AND GUIDELINES FOR THE IT DEPARTMENTDEVELOPMENT AND STANDARDIZATION OF INFRASTRUCTURE SERVICES AND PROCEDURES ALONG WITH STREAMLINING ANY DISCOVERED INEFFICIENCIESMANAGE THE TEAM IN CHARGE OF DAY-TO-DAY OPERATIONS TO KEY PERFORMANCE METRICS DEFINED FOR SYSTEM SECURITY, NETWORK AVAILABILITY AND CRITICAL SYSTEM INCIDENTSMANAGES PERSONNEL INCLUDING MENTORING AND/OR WORKING WITH EMPLOYEES TO ENHANCE THEIR PERFORMANCE, CAREER DEVELOPMENT, AND WORK PRODUCTIONWORKS WITH DIRECTOR AND MANAGERS TO DETERMINE STAFFING REQUIREMENTS, INTERVIEWS, HIRE NEW EMPLOYEES, AND OVERSEES PERSONNEL PROCESSESRESEARCH AND DOCUMENT NEW TECHNOLOGIES, TOOLS, AND METHODOLOGIES TO IMPROVE SYSTEM STABILITY AND RELIABILITYOVERSEAS, PLANS, AND MANAGES LARGE/COMPLEX PROJECTSLEAD AND COORDINATE INNOVATION EFFORTS TO IMPLEMENT NEW TECHNOLOGY SOLUTIONS AND SERVICES FOR EMPLOYEES AND CUSTOMERSSELECTS AND MANAGES, AND CONTROLS IT PROVIDERS AND OUTSOURCED SERVICE PROVIDERSADMINISTRATES NETWORKS AND SERVERS AND PROVIDES SUPPORT TO THE IT HELP DESK AND EMPLOYEES AS NEEDEDASSISTS WITH THE PREPARATION AND PRESENTATION OF THE ANNUAL TECHNOLOGY BUDGETREVIEWS AND MAINTAINS APPLICABLE SERVICE LEVEL AGREEMENTS\nEXPERIENCE AND EDUCATION REQUIREMENTS:BACHELOR'S DEGREE IN COMPUTER SCIENCE OR RELATED FIELD PREFERRED3-5 YEARS OF INFRASTRUCTURE LEAD OR MANAGEMENT EXPERIENCE PREFERRED7+ YEARS OF EXPERIENCE WITH FUNCTIONAL AND TECHNICAL ASPECTS OF IT SUPPORT SERVICES AND RELATED INFRASTRUCTURE SOLUTIONS, CAPABILITIES AND TECHNOLOGIES INCLUDING THE FOLLOWING: VIRTUALIZATION (VMWARE), NETWORK MANAGEMENT, SAN STORAGE, PROJECT MANAGEMENT, AND CISCO TELEPHONYADVANCED KNOWLEDGE OF MICROSOFT SERVER 2008/2012/2016 AND MICROSOFT SQL 2008/2014/2016ADVANCED KNOWLEDGE OF MICROSOFT EXCHANGE AND OFFICE 365STRONG KNOWLEDGE AND EXPERIENCE WITH ACTIVE DIRECTORY, POWERSHELL AND GROUP POLICYEXPERIENCE WITH AWS, AZURE, AND OTHER PAAS TECHNOLOGIES IS DESIRED\nNON-TECHNICAL REQUIREMENTS:PASSION FOR CUSTOMER SERVICE, EFFICIENCY, EFFECTIVENESS, PRECISION AND QUALITYABILITY TO FORM A DIVERSE TEAM WITH DIFFERENT TALENTS THAT COMPLEMENT EACH OTHER (CONSISTING OF IT PROFESSIONALS AND THIRD PARTIES)EXCELLENT INTERPERSONAL, VERBAL, AND WRITTEN COMMUNICATION SKILLS EXCELLENT ANALYTICAL AND PROBLEM RESOLUTION SKILLSSTRONG LEADERSHIP SKILLSBUILD AND NURTURE POSITIVE WORKING RELATIONSHIPS WITH THE TEAM, INTERNAL CLIENTS, AND VENDORSABILITY TO ORGANIZE AND DELIVER PRESENTATIONS IN FRONT OF GROUPSABILITY TO TRAIN IT TEAM AND BUSINESS EMPLOYEESPOSSESS PERSONAL DRIVE AND INITIATIVE REGARDING CAREER GROWTHSTRONG PLANNING AND ORGANIZATIONAL SKILLSABILITY TO DIRECT AND PRIORITIZE THE WORKLOAD OF THE TEAMABILITY TO WORK INDEPENDENTLY, PRIORITIZE OWN TASKS, AND TASKS OF OTHERSABLE TO WORK FLEXIBLE HOURS; EXPECTED TO WORK NIGHTS AND WEEKENDS AS NEEDEDABILITY TO TRAVEL BETWEEN OFFICES, AS REQUIRED",
    "job_skill_set": [
      "network administration",
      "Microsoft systems",
      "network management",
      "project management",
      "Cisco telephony",
      "customer service",
      "team building",
      "communication",
      "analytical skills",
      "problem resolution",
      "leadership",
      "relationship building",
      "presentation skills",
      "training",
      "initiative",
      "planning and organizational skills",
      "workload prioritization",
      "independence",
      "flexibility",
      "data center operations",
      "Office 365",
      "virtualization (VMware)",
      "SAN storage",
      "Microsoft Server 2008/2012/2016",
      "Microsoft SQL 2008/2014/2016",
      "Microsoft Exchange",
      "Active Directory",
      "PowerShell",
      "Group Policy",
      "AWS",
      "Azure",
      "PaaS technologies",
      "travel readiness"
    ],
    "short_keywords": [
      "200820122016",
      "200820142016",
      "365",
      "active",
      "administration",
      "analytical",
      "and",
      "aws",
      "azure",
      "building",
      "center",
      "cisco",
      "communication",
      "customer",
      "data",
      "directory",
      "exchange",
      "flexibility",
      "group",
      "independence",
      "information",
      "informationtechnology",
      "infrastructure",
      "initiative",
      "leadership",
      "management",
      "manager",
      "microsoft",
      "network",
      "office",
      "operations",
      "organizational",
      "paas",
      "planning",
      "policy",
      "powershell",
      "presentation",
      "prioritization",
      "problem",
      "project",
      "readiness",
      "relationship",
      "resolution",
      "san",
      "server",
      "service",
      "skills",
      "sql",
      "storage",
      "systems",
      "team",
      "technologies",
      "technology",
      "telephony",
      "training",
      "travel",
      "virtualization",
      "vmware",
      "workload"
    ]
  }
]