[
  {
    "job_id": "3902326947",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "POSITION PURPOSE\nTHE BUSINESS DEVELOPMENT REPRESENTATIVE IS THE PRIMARY CONTACT FOR NEW AND EXISTING CUSTOMERS OF ALLIED RELIABILITY. THE BUSINESS DEVELOPMENT MANAGER WILL WORK WITH ALLIED RELIABILITY BUSINESS DEVELOPMENT AND OPERATIONS TEAMS TO DEVELOP NEW BUSINESS, COMMUNICATE WITH INTERNAL AND EXTERNAL CONTACTS. PREPARE AND DELIVER PROPOSALS, NEGOTIATE WITH CUSTOMERS, AND SECURE BUSINESS WITH NEW AND EXISTING CUSTOMERS WITHIN THE SPECIFIED REGION. THE BUSINESS DEVELOPMENT MANAGER IS RESPONSIBLE FOR MEETING THE ASSIGNED SALES GROWTH TARGET WITHIN THE REGION.\nESSENTIAL FUNCTIONS AND BASIC DUTIES\nPRESENT AND SELL COMPANY PRODUCTS AND SERVICES TO CURRENT AND POTENTIAL CLIENTS. PREPARE ACTION PLANS AND SCHEDULES TO IDENTIFY SPECIFIC TARGET ACCOUNT NEEDS AND OPPORTUNITIES.FOLLOW UP ON NEW LEADS AND REFERRALS RESULTING FROM FIELD ACTIVITY, WEB, OR MARKETING LEADS. IDENTIFY SALES PROSPECTS AND CONTACT THESE AND OTHER ACCOUNTS WITHIN THE ASSIGNED TERRITORY. PREPARE CLIENT PROPOSALS FOR IDENTIFIED PRODUCTS AND SERVICE OFFERINGS.PREPARE AND PRESENT CLIENT PRESENTATIONS.ESTABLISH AND MAINTAIN CURRENT CLIENT AND POTENTIAL CLIENT RELATIONSHIPS. IDENTIFY AND RESOLVE CLIENT CONCERNS.PREPARE AND SUBMIT A WEEKLY/ QUARTERLY AND YEARLY STATUS REPORTS, INCLUDING ACTIVITY, CLOSINGS, FOLLOW-UP, AND ADHERENCE TO GOALS. COMMUNICATE NEW PRODUCT AND SERVICE OPPORTUNITIES, SPECIAL DEVELOPMENTS, INFORMATION, OR FEEDBACK GATHERED THROUGH FIELD ACTIVITY TO APPROPRIATE COMPANY STAFF. MAINTAIN UP-TO-DATE INFORMATION ON ALL CLIENT INTERACTIONS WITHIN ARG’S ACTIVE CLIENT RESOURCE MANAGER SYSTEM (CRM).SUPPORT OPERATIONS IN BILLABLE ASSIGNMENTS AS NEED.WORK WITH CROSS FUNCTIONAL TEAM TO ENSURE CUSTOMER SATISFACTION.OTHER DUTIES AS ASSIGNED\nPERFORMANCE MEASUREMENTS\nREPORTS ARE ACCURATE, NEAT, AND PROMPTLY COMPLETED. INQUIRIES ARE COURTEOUSLY ATTENDED TO. MAINTAIN GOOD BUSINESS RELATIONSHIPS WITH OUTSIDE PROFESSIONALS, CUSTOMERS AND PERSPECTIVE CUSTOMERS.A PROFESSIONAL IMAGE IS PROJECTED AND MAINTAINED.\nQUALIFICATIONS /COMPETENCIES /POSITION REQUIREMENTSKNOWLEDGE/SKILLS/ABILITIES SALES SKILLS TO INCLUDE DEMONSTRATED CLOSING SKILLS. EXPOSURE TO FORMAL SALES TRAINING.EXCELLENT VERBAL, WRITTEN, VIDEO CONFERENCING AND TELEPHONE SKILLS SUPPORTED BY STRONG INTERPERSONAL SKILLS AND ABILITY TO WORK WITHIN A TEAM STRUCTURE. STRONG COMFORT LEVEL WITH PRESENTING TO GROUPS. ABILITY TO FULLY MANAGE A SALES CYCLE FROM START TO FINISH.PROVEN RECORD OF ACHING REVENUE GOALS.DEMONSTRATED CAREER PROGRESSION AND INCREASE IN RESPONSIBILITIES, INCREASED DURING PREVIOUS POSITIONS PREFERRED.KNOWLEDGE OF COMMERCIAL BUILDING AND MANUFACTURING SECTOR PREFERRED.\nEDUCATION AND EXPERIENCEBACHELOR’S DEGREE PREFERRED. 3+ YEARS SALES TERRITORY OR EQUIVALENT EXPERIENCE.EXPERIENCE IN SOLUTION AND SERVICE SELLING.EXPERIENCE INTERFACING WITH ENGINEERS AND DECISION MAKERS.",
    "job_skill_set": [
      "sales skills",
      "client presentations",
      "negotiation",
      "solution selling",
      "market analysis",
      "reporting",
      "communication",
      "interpersonal skills",
      "teamwork",
      "problem solving",
      "customer relationship management",
      "presentation skills",
      "adaptability",
      "professionalism",
      "CRM",
      "proposal preparation",
      "commercial building knowledge",
      "manufacturing sector knowledge",
      "time management"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "building",
      "business",
      "businessdevelopment",
      "client",
      "commercial",
      "communication",
      "crm",
      "customer",
      "development",
      "interpersonal",
      "knowledge",
      "management",
      "manufacturing",
      "market",
      "negotiation",
      "preparation",
      "presentation",
      "presentations",
      "problem",
      "professionalism",
      "proposal",
      "relationship",
      "reporting",
      "representative",
      "sales",
      "sector",
      "selling",
      "skills",
      "solution",
      "solving",
      "teamwork",
      "time"
    ]
  },
  {
    "job_id": "3901359222",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "CUNARD IS AN INTERNATIONAL LUXURY CRUISE LINE, STEEPED IN BRITISH HERITAGE WITH A HISTORY SPANNING MORE THAN 183 YEARS. A COMPANY WITHIN THE CARNIVAL CORPORATION FAMILY OF CRUISE BRANDS, CUNARD HAS PIONEERED TRANSATLANTIC CROSSINGS AND WORLD CRUISING FOR GENERATIONS. THE CUNARD EXPERIENCE IS BUILT ON FINE DINING, HAND-SELECTED ENTERTAINMENT, AND RENOWNED WHITE STAR SERVICE. FROM FIVE-STAR RESTAURANTS AND IN-SUITE DINING TO INSPIRING GUEST SPEAKERS, THE LIBRARY AND FILM SCREENINGS, EVERY DETAIL HAS BEEN METICULOUSLY CRAFTED TO MAKE THE EXPERIENCE UNFORGETTABLE. DESTINATIONS INCLUDE EUROPE, THE CARIBBEAN, THE FAR EAST AND AUSTRALIA.\nWE’RE LOOKING FOR AN AMAZING BUSINESS DEVELOPMENT MANAGER, NATIONAL AND STRATEGIC ACCOUNTS, WHICH WILL BE REMOTE BASED. THE CANDIDATE MUST RESIDE IN THE SOUTHEAST PART OF THE US IDEALLY IN FLORIDA. YOU’LL BE RESPONSIBLE FOR MANAGING THE BUSINESS DEVELOPMENT (SALES) OF A DEFINED LIST OF TRAVEL AGENCY ACCOUNTS AND CONSORTIA’S THROUGHOUT NORTH AMERICA. THE OBJECTIVE IS TO ACHIEVE SALES GOALS FOR CUNARD LINE IN ALIGNMENT WITH THE COMPANY'S BUSINESS OBJECTIVES AND CULTURAL ESSENTIALS. AS THE SALES CUNARD NATIONAL ACCOUNTS MANAGER, YOU WILL BE RESPONSIBLE FOR MANAGING AND DEVELOPING RELATIONSHIPS WITH KEY NATIONAL ACCOUNTS WITHIN THE TRAVEL INDUSTRY. YOUR PRIMARY GOAL WILL BE TO DRIVE SALES AND REVENUE FOR CUNARD LINE, THROUGH EFFECTIVE ACCOUNT MANAGEMENT STRATEGIES AND IN DEPTH UNDERSTANDING OF THE CUNARD PRODUCTS. THIS ROLE REQUIRES A STRONG UNDERSTANDING OF THE TRAVEL INDUSTRY, EXCEPTIONAL COMMUNICATION SKILLS, AND THE ABILITY TO COLLABORATE WITH VARIOUS INTERNAL AND EXTERNAL STAKEHOLDERS.\nHERE’S A SUMMARY OF WHAT CUNARD IS LOOKING FOR IN ITS BUSINESS DEVELOPMENT MANAGER, NATIONAL AND STRATEGIC ACCOUNTS. IS THIS YOU?\nRESPONSIBILITIESACCOUNT MANAGEMENT:DEVELOP AND MAINTAIN STRONG RELATIONSHIPS WITH KEY NATIONAL ACCOUNTS WITHIN THE TRAVEL INDUSTRY.ACT AS THE MAIN POINT OF CONTACT FOR DESIGNATED ACCOUNTS, ADDRESSING INQUIRIES, PROVIDING SUPPORT, AND RESOLVING ISSUES PROMPTLY.IMPLEMENT STRATEGIES TO MAXIMIZE SALES AND REVENUE OPPORTUNITIES WITH EACH ACCOUNT.SALES DEVELOPMENT:CREATE AND EXECUTE SALES PLANS TAILORED TO EACH NATIONAL ACCOUNT BASED ON THEIR BUSINESS MODEL TO ACHIEVE REVENUE TARGETS.IDENTIFY NEW BUSINESS OPPORTUNITIES WITHIN EXISTING ACCOUNTS AND PURSUE STRATEGIES TO EXPAND CUNARD'S MARKET SHARE.COLLABORATE WITH MARKETING AND PROMOTIONAL TEAMS TO DEVELOP INITIATIVES TO DRIVE SALES AND INCREASE BRAND AWARENESS.MARKET ANALYSIS AND REPORTING:STAY INFORMED ABOUT MARKET TRENDS, COMPETITOR ACTIVITIES, AND INDUSTRY DEVELOPMENTS TO IDENTIFY OPPORTUNITIES.ANALYZE REPORTS REGULARLY OUTLINING SALES PERFORMANCE, MARKET INSIGHTS, AND ACCOUNT ACTIVITIES FOR REVIEW WITH ACCOUNTS AND MANAGEMENT.TRAINING AND SUPPORT:PROVIDE TRAINING AND SUPPORT TO NATIONAL ACCOUNTS ON CUNARD'S PRODUCTS, SERVICES, AND SALES TOOLS.COORDINATE WITH INTERNAL DEPARTMENTS TO ADDRESS ACCOUNT-SPECIFIC NEEDS AND REQUIREMENTS.EVENT PARTICIPATION:REPRESENT CUNARD LINE AT INDUSTRY EVENTS, TRADE SHOWS, AND CONFERENCES TO PROMOTE BRAND VISIBILITY AND NETWORKING OPPORTUNITIES.PARTICIPATION IN SHIP INSPECTIONS AND FAMILIARIZATION SAILINGS– USUALLY INCLUDES WEEKENDS.\nREQUIREMENTSBACHELOR’S DEGREE IN BUSINESS, MARKETING, COMMUNICATIONS3 YEARS OF BUSINESS TO BUSINESS (B2B) SALES EXPERIENCE. PREFERRED 5 YEARS OF BUSINESS TO BUSINESS (B2B) SALES EXPERIENCE IN THE TRAVEL INDUSTRYSTRONG IN-PERSON AND VIRTUAL PRESENTATION SKILLSSTRONG MICROSOFT OFFICE SKILLS- EXCEL, WORD, AND POWERPOINTEXCELLENT VERBAL AND WRITTEN COMMUNICATIONSTRONG CONSULTATIVE SELLING SKILLSSOLID COMPUTER LITERACYSALESFORCE OR OTHER SIMILAR CRM KNOWLEDGEABILITY TO PLAN, SCHEDULE, AND PRIORITIZE WORKLOADADAPTABLE TO CHANGEPERSEVERANCE IN WORKING WITH AGENCY DECISION-MAKERSWORKS WELL IN A TEAM WILLINGNESS TO TAKE ON AD-HOC PROJECTS SELF-DIRECTED AND ABILITY TO WORK INDEPENDENTLYENTREPRENEURIAL SPIRITABILITY TO TRAVEL UP TO 25-50% OF TIME*PREFERRED LOCATIONS FOR HIRE: FLORIDA OR SOUTHEAST US.\nWHAT YOU CAN EXPECT CRUISE AND TRAVEL PRIVILEGES FOR YOU AND YOUR FAMILYHEALTH BENEFITS401(K) EMPLOYEE STOCK PURCHASE PLAN TRAINING & PROFESSIONAL DEVELOPMENTTUITION & PROFESSIONAL CERTIFICATION REIMBURSEMENTREWARDS & INCENTIVES BASE SALARY RANGE: $83,200.00 TO $112,300.00. THE RANGE IS APPLICABLE FOR THE LABOR MARKET WHERE THE ROLE IS INTENDED TO BE HIRED. FINAL BASE SALARY IS DIRECTLY RELATED TO EACH CANDIDATES' QUALIFICATIONS AND EXPERIENCE UNIQUELY.\nOUR CULTURE… STRONGER TOGETHEROUR HIGHEST RESPONSIBILITY AND TOP PRIORITY IS COMPLIANCE, ENVIRONMENTAL PROTECTION AND THE HEALTH, SAFETY AND WELL-BEING OF OUR GUESTS, THE PEOPLE IN THE COMMUNITIES WE TOUCH AND SERVE, AND OUR SHIPBOARD AND SHORESIDE EMPLOYEES. PLEASE VISIT OUR SITE TO LEARN MORE ABOUT OUR CULTURE ESSENTIALS, CORPORATE VISION STATEMENT AND OUR CORE VALUES AT: HTTPS://WWW.PRINCESS.COM/ABOUTUS/CULTURE-FRAMEWORK/.\nCUNARD IS AN EQUAL-OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO AGE, ANCESTRY, COLOR, FAMILY OR MEDICAL CARE LEAVE, GENDER IDENTITY OR EXPRESSION, GENETIC INFORMATION, MARITAL STATUS, MEDICAL CONDITION, NATIONAL ORIGIN, PHYSICAL OR MENTAL DISABILITY, POLITICAL AFFILIATION, PROTECTED VETERAN STATUS, RACE, RELIGION, SEX (INCLUDING PREGNANCY), SEXUAL ORIENTATION, OR ANY OTHER CHARACTERISTIC PROTECTED BY APPLICABLE LAWS, REGULATIONS AND ORDINANCES.\nAMERICANS WITH DISABILITIES ACT (ADA) CUNARD WILL PROVIDE REASONABLE ACCOMMODATIONS WITH THE APPLICATION PROCESS, UPON YOUR REQUEST, AS REQUIRED TO COMPLY WITH APPLICABLE LAWS. IF YOU HAVE A DISABILITY AND REQUIRE ASSISTANCE IN THIS APPLICATION PROCESS, PLEASE CONTACT RECRUITING@HOLLANDAMERICAGROUP.COM",
    "job_skill_set": [
      "B2B Sales",
      "Account Management",
      "Market Analysis",
      "Microsoft Office",
      "Consultative Selling",
      "Presentation Skills",
      "Communication",
      "Teamwork",
      "Adaptability",
      "Self-Directed",
      "Perseverance",
      "Entrepreneurial Spirit",
      "Networking",
      "Problem Solving",
      "Salesforce",
      "CRM Knowledge",
      "Travel Industry Knowledge",
      "Training and Support"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "analysis",
      "and",
      "b2b",
      "business",
      "businessdevelopment",
      "communication",
      "consultative",
      "crm",
      "development",
      "entrepreneurial",
      "industry",
      "knowledge",
      "management",
      "manager",
      "market",
      "microsoft",
      "networking",
      "office",
      "perseverance",
      "presentation",
      "problem",
      "sales",
      "salesforce",
      "selfdirected",
      "selling",
      "skills",
      "solving",
      "spirit",
      "support",
      "teamwork",
      "training",
      "travel"
    ]
  },
  {
    "job_id": "3905669193",
    "job_title": "Business Development Specialist (PR-1258349:MAS)",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ABOUT:\nOUR CLIENT IS A MULTI-AWARD-WINNING COMPANY THAT'S GROWING RAPIDLY BECAUSE OF THEIR INNOVATION. THEY'RE A KEY PLAYER IN THEIR INDUSTRY PIONEERING TECHNOLOGY THAT HAS CHANGED BUSINESSES FOR THE BETTER. THEY'RE BASED IN A GORGEOUS OFFICE SPACE IN A HIGHLY DESIRABLE LOCATION AND PRIDE THEMSELVES ON A MOTIVATING AND INCLUSIVE CULTURE!\nWHY WORK WITH OUR CLIENT?: ON TRACK EARNINGS BRINGING YOUR TOTAL COMPENSATION TO $80K, WITH A $62K BASECOMPREHENSIVE MEDICAL, DENTAL, AND VISION INSURANCEGREAT TRACK FOR PROGRESSION WITH A STRUCTURED DEVELOPMENT PROGRAMFUN, COMPETITIVE CULTURE THAT REWARDS SUCCESS401K CONTRIBUTIONSAWESOME OFFICE SPACE WITH A FULLY STOCKED KITCHENAT LEAST 10 DAYS PTO!\nTHE ROLE AT A GLANCE:\nIN THIS ROLE, YOU WILL BE HELPING OUR CLIENT BUILD BRAND AWARENESS WHILE ALSO PROVIDING CUSTOMER SUPPORT. THIS ROLE INCLUDES FORMING STRONG RELATIONSHIPS WITH CLIENTS IN ORDER TO MAKE VALUABLE BUSINESS OPPORTUNITIES. YOU WILL BE DEPENDABLE, CONFIDENT, AND DRIVEN IN ORDER TO SUCCEED IN THIS ROLE. THE IDEAL CANDIDATE WILL BE EXTREMELY DRIVEN AND SUCCESS HUNGRY.\nREQUIREMENTS: A FULL 4-YEAR BACHELOR’S DEGREE COMFORTABLE WORKING IN A FAST PACED ENVIRONMENT YOU WILL HAVE A COMPETITIVE NATURE - I.E. DONE COMPETITIVE SPORTSIDEALLY YOU HAVE SOME HOSPITALITY EXPERIENCE YOU’RE CONFIDENT AND PASSIONATEYOU’RE COLLABORATIVE- YOU LOVE WORKING WITH PEOPLE AND ARE SKILLED AT FACILITATING STRONG CLIENT RELATIONSHIPSA GREAT LISTENER – YOU’RE ABLE TO IMPLEMENT FEEDBACK AND ANTICIPATE THE NEEDS OF OTHERSYOU'RE SALES MOTIVATED!\nPARETO IS COMMITTED TO PROMOTING EQUALITY, DIVERSITY AND INCLUSION. WE ENCOURAGE AND WELCOME APPLICATIONS FROM ALL, IRRESPECTIVE OF BACKGROUND OR CIRCUMSTANCE. OUR CONSULTANTS ARE HAPPY TO DISCUSS ANY ADJUSTMENTS YOU REQUIRE IN SUPPORT OF YOUR APPLICATION.",
    "job_skill_set": [
      "sales",
      "customer support",
      "communication",
      "relationship building",
      "teamwork",
      "driven",
      "competitive nature",
      "collaboration",
      "feedback implementation",
      "brand awareness",
      "hospitality experience",
      "listening"
    ],
    "short_keywords": [
      "awareness",
      "brand",
      "building",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "competitive",
      "customer",
      "development",
      "driven",
      "experience",
      "feedback",
      "hospitality",
      "implementation",
      "listening",
      "nature",
      "pr1258349mas",
      "relationship",
      "sales",
      "specialist",
      "support",
      "teamwork"
    ]
  },
  {
    "job_id": "3899536815",
    "job_title": "Business Development and Teaming Coach",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "THE BUSINESS DEVELOPMENT & TEAMING GROUP TAKES A CONSULTATIVE APPROACH TO WORKING WITH AND TRAINING FINANCIAL ADVISORS (FAS), BRANCH OFFICE MANAGERS (BOMS), AND BRANCH SUPPORT STAFF (PCAS). THEIR PRIMARY GOAL IS TO DRIVE ORGANIC GROWTH, HOLISTIC ADVICE CENTERED AROUND FINANCIAL PLANNING, INCREASE PRACTICE EFFICIENCY THROUGH TECHNOLOGY, AS WELL AS SUPPORT TEAMING AND SUCCESSION STRATEGIES. THE BUSINESS DEVELOPMENT & TEAMING COACH IS RESPONSIBLE FOR DRIVING ORGANIC GROWTH, BUSINESS DEVELOPMENT, TEAMING, AND SUCCESSION INITIATIVES WITHIN THEIR ASSIGNED REGION. THEIR PRIMARY RESPONSIBILITY IS TO FOCUS ON DEVELOPING A PERSONALIZED GROWTH PLAN IN PARTNERSHIP WITH TOP JANNEY ADVISORS AND TEAMS TO HELP THEM ACHIEVE THEIR BUSINESS GOALS. AS AN INTEGRAL PART OF THE PRACTICE MANAGEMENT GROUP (PMG), THE COACH WILL PARTNER WITH THEIR REGIONAL CONSULTANT TO HELP THEIR REGION MEET THEIR GROWTH OBJECTIVES.\n\nTHIS ROLE IS HYBRID AND CAN BE LOCATED IN ANY OF THE FOLLOWING JANNEY OFFICES: MIAMI, FL FT. LAUDERDALE, FL, PALM BEACH, FL, BOCA RATON, FL, PONTE VEDRA, FL,CHARLOTTE, NC, COLUMBIA, SC OR ATLANTA, GA\n\nWHAT YOU ARE GOOD AT\n\n COACHING – ABLE TO EFFECTIVELY COACH AND LEAD FINANCIAL ADVISORS AND TEAM AROUND TEAM DYNAMICS, CLIENT SERVICE MODEL, SUCCESSION PLANNING, MARKETING, AND GROWTH STRATEGIES. COMMUNICATION – MUST BE ABLE TO EFFECTIVELY COMMUNICATE VERBALLY AND IN WRITING WITH INTERNAL JANNEY STAKEHOLDERS AND OUR FINANCIAL ADVISORS. INITIATIVE – PROACTIVELY LOOK FOR OPPORTUNITIES TO GROW REVENUE WITHIN YOUR DESIGNATED TERRITORY THROUGH TRAINING, EDUCATION, AND STRATEGIES DESIGNED TO INCREASE NET NEW ASSETS. BUILDING RELATIONSHIPS – CONNECTING WITH OTHERS IN A WAY THAT FOSTERS TRUST, CREATES COLLABORATIVE RELATIONSHIPS, AND PRESERVES ESTABLISHED TEAM CULTURE.\n\nRESPONSIBILITIES\n\nANALYZE REGIONAL BUSINESS DATA TO DEVELOP A PLAN TO SUPPORT ORGANIC GROWTH IN THE REGION IN PARTNERSHIP WITH THE REGIONAL MANAGER.WORK IN COORDINATION AND COLLABORATION WITH THE REGIONAL CONSULTANT AND REGIONAL MANAGER TO DRIVE ORGANIC GROWTH, TEAMING, AND SUCCESSION INITIATIVES WITHIN THE TERRITORY.PARTNER WITH BRANCH MANAGERS AND DEVELOP A PLAN TO SUPPORT THEIR BRANCH GROWTH OBJECTIVES.DEVELOP PERSONALIZED GROWTH PLANS TO SUPPORT THE BUSINESS GOALS FOR TOP ADVISORS AND TEAMS WITHIN THE REGION. CREATE AND IMPLEMENT A COACHING SCHEDULE TO SUPPORT ONGOING PROGRESS TO GOAL CONVERSATIONS THROUGHOUT THE COACHING RELATIONSHIP.SERVE AS THE REGIONAL SUBJECT MATTER EXPERT ON TEAMING AND SUCCESSION STRATEGIES SUPPORTING ADVISORS WHO ARE LOOKING TO RETIRE, GROW THROUGH ACQUISITION, OR TEAM.HOST ONE-TO-MANY TRAINING SESSIONS IN REGION AROUND CORE GROWTH INITIATIVES INCLUDING FINANCIAL PLANNING, ORGANIC GROWTH, CLIENT SERVICE MODEL, PROSPECTING STRATEGIES, TEAMING, AND SUCCESSION. THIS INCLUDES ROUNDTABLES TO SUPPORT PEER SHARE AMONGST TOP ADVISORS.WORK COLLABORATIVELY WITH REGIONAL PEERS TO HELP EDUCATE ADVISORS ON HOLISTIC ADVICE AND PRACTICE MANAGEMENT TOPICS INCLUDING: WEALTH PLANNING, ADVISORY SOLUTIONS, INSURED & LENDING SOLUTIONS, AND HIGH NET WORTH CONSULTING, AND BUSINESS TECHNOLOGY.OTHER DUTIES AS ASSIGNED.\n\nWHAT YOU HAVE\n\nBACHELOR’S DEGREE OR EQUIVALENT WORK EXPERIENCE.THE IDEAL CANDIDATE HAS A MINIMUM OF 7 YEARS OF RELEVANT EXPERIENCE IN FINANCIAL SERVICESAN ADVANCED DEGREE OR CREDENTIALS, SPECIFICALLY IN PLANNING PREFERRED.CLIENT FACING FINANCIAL PLANNING AND/OR INVESTMENT ADVISORY EXPERIENCE PREFERRED.COACHING CERTIFICATIONS A PLUS. INCLUDING: PARETO, HIGH PERFORMANCE, ENSEMBLE COACHING CERTIFICATION AND/OR STRENGTHFINDERS, COLBY, DISC, WORKING GENIUSFINRA SERIES 7 & 66 (63 & 65) REQUIRED (OR ABILITY TO OBTAIN WITHIN 6 MONTHS).THE SUCCESSFUL CANDIDATE WILL HAVE EXCEPTIONAL SKILLS IN THE AREAS OF COACHING, TEAMING BUILDING, AND THE FINANCIAL PLANNING PROCESS WITH THE ABILITY TO INFLUENCE AND INITIATE CHANGE.EXCELLENT COMMUNICATOR (IN BOTH WRITTEN AND VERBAL FORMS) BOTH PROACTIVELY AND REACTIVELY, WITH A TRACK RECORD OF CLIENT RELATIONSHIP MANAGEMENT.HIGH DEGREE OF PROFESSIONALISM IN PERFORMING ALL DUTIES.MUST BE ABLE TO TRAVEL EXTENSIVELY WITHIN THE REGION (40-50%).\n\nWHY WORK FOR US?\n\nBENEFITS: JANNEY BELIEVES THAT ITS EMPLOYEES ARE THE KEY TO WHAT MAKES A GREAT COMPANY. ALTHOUGH WORK MAKES UP A LARGE PORTION OF AN EMPLOYEE’S LIFE, WE BELIEVE THAT A BALANCE BETWEEN WORK AND NON-WORK ACTIVITIES IS ESSENTIAL TO MAINTAIN QUALITY PERFORMANCE AND A POSITIVE WORK ATMOSPHERE. WE OFFER A COMPETITIVE PACKAGE INCLUDING PAID PATERNAL LEAVE, GENEROUS PAID TIME OFF, ELIGIBILITY FOR A $2,000 REFERRAL BONUS AND PROFESSIONAL DEVELOPMENT ASSISTANCE PLAN DESIGNED TO HELP YOU MAKE THE MOST OF YOUR LIFE AT WORK AND AT HOME—TODAY AND IN THE FUTURE. EXPLORE FURTHER.\n\nJANNEY IS AN AWARD-WINNING FULL-SERVICE FINANCIAL SERVICES FIRM COMMITTED TO UNDERSTANDING OUR CLIENTS' NEEDS AND PROVIDING ADVICE BEYOND INVESTMENTS. WE ARE EQUALLY COMMITTED TO BUILDING A DIVERSE WORKFORCE AND INCLUSIVE CULTURE WHERE EMPLOYEES CAN USE THEIR TALENTS TO THRIVE AND GROW PROFESSIONALLY WITH THE FIRM. FOSTERING A POSITIVE WORKPLACE EXPERIENCE REMAINS A TOP PRIORITY. WE’VE EARNED THE GREAT PLACE TO WORK® CERTIFICATION, WHICH RECOGNIZES EMPLOYERS THAT CREATE AN OUTSTANDING EMPLOYEE EXPERIENCE. BASED ENTIRELY ON WHAT CURRENT EMPLOYEES SAY ABOUT THEIR EXPERIENCE WORKING AT JANNEY, THIS PRESTIGIOUS RECOGNITION UNDERSCORES OUR COMMITMENT TO OUR PEOPLE AND CULTURE. PEOPLE ARE OUR STRONGEST ASSET. WE RECOGNIZE THAT WHEN OUR TEAM MEMBERS THRIVE, OUR FIRM IS MORE SUCCESSFUL.",
    "job_skill_set": [
      "business development",
      "teaming",
      "data analysis",
      "client relationship management",
      "training",
      "technology integration",
      "communication",
      "initiative",
      "relationship building",
      "collaboration",
      "influence",
      "professionalism",
      "problem solving",
      "financial planning",
      "coaching",
      "succession planning",
      "investment advisory",
      "FINRA Series 7",
      "FINRA Series 66",
      "coaching certifications"
    ],
    "short_keywords": [
      "66",
      "7",
      "advisory",
      "analysis",
      "and",
      "building",
      "business",
      "businessdevelopment",
      "certifications",
      "client",
      "coach",
      "coaching",
      "collaboration",
      "communication",
      "data",
      "development",
      "financial",
      "finra",
      "influence",
      "initiative",
      "integration",
      "investment",
      "management",
      "planning",
      "problem",
      "professionalism",
      "relationship",
      "series",
      "solving",
      "succession",
      "teaming",
      "technology",
      "training"
    ]
  },
  {
    "job_id": "3902321529",
    "job_title": "Inside Business Development Specialist",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ROLE AND KEY RESPONSIBILITIES:IDENTIFY, INITIATE AND MANAGE SALES CONVERSATIONS WITH POTENTIAL AND EXISTING CLIENT(S) VIA PHONE, EMAIL, AND OTHER COMMUNICATION CHANNELS.WORK WITHIN A DEDICATED TERRITORY AND TEAM AND / OR AS INDIVIDUAL CONTRIBUTOR (“IC”) FOR POTENTIAL CLIENT(S) TO ACHIEVE THE REVENUE-BASED QUOTA BY SELLING SERVICES, MAY OFFER UP- SELL OPPORTUNITIES.PROVIDE ACCURATE WEEKLY/ MONTHLY/ QUARTERLY SALES FORECAST.MASTERY OF PRODUCT KNOWLEDGE AND TECHNICAL UNDERSTANDING OF SERVICES TO ASSESS CLIENT REQUIREMENTS.INITIATE STEPS TO HELP CUSTOMER CONCERNS/ROADBLOCKS PROHIBITING SATISFACTION OR PRODUCT USAGE.MANAGE EXTERNAL COMPETITIVE PRESSURES AND HANDLE OBJECTIONS TO RETAIN CUSTOMERS OR WIN NEW CUSTOMERS.MANAGE HIGH VOLUME OF CUSTOMER CONTACTS THROUGH PHONE AND EMAIL EACH DAY – MAJORITY OF COMMUNICATION IS OUTBOUND.WORK WITH THE TEAM AND MANAGEMENT TO PROVIDE PROFESSIONAL EXPERIENCE DURING ALL INTERACTIONS WITH CUSTOMERS AND PROSPECTS.MAINTAIN THE CUSTOMER MANAGEMENT SYSTEM (CRM) TO ENSURE ALL RELEVANT DATA IS CAPTURED.UNDERTAKE SALES MOTIONS WHICH MIGHT INCLUDE LEAD QUALIFICATION, LEAD CONVERSION, HEALTH CHECKS, BEING THE VOICE OF THE CUSTOMER, OR RENEWING CONTRACTS.\nKEY SKILLS & KNOWLEDGE:2+ YEARS OF EXPERIENCE WORKING IN SALES CAPACITY.PRIOR SUCCESS IN ACHIEVEMENT OF PERSONAL AND COMPANY SALES QUOTA/GOALS.EXPERIENCE IN HIGH-VOLUME CALLING.EXPERIENCE LEARNING NEW TECHNOLOGY AND DATA.PROBLEM SOLVING SKILLS.EXCELLENT KNOWLEDGE OF MS OFFICE PROGRAMS.EXPERIENCE WORKING WITH SALESFORCE.COM OR SIMILAR CRM.PREFERRED EXPERIENCE IN MORTGAGE PRODUCTS.\nWORK HOURS: 8AM TO 5PM EST\nAFFIRMDATA IS AN EQUAL OPPORTUNITY EMPLOYER AND CONSIDERS APPLICANTS FOR ALL POSITIONS WITHOUT REGARD TO RACE, COLOR, RELIGION OR BELIEF, SEX, AGE, NATIONAL ORIGIN, MARITAL STATUS, GENETIC INFORMATION, SEXUAL ORIENTATION, GENDER IDENTITY, PHYSICAL OR MENTAL DISABILITY OR ANY OTHER CHARACTERISTIC PROTECTED BY APPLICABLE LAWS. AFFIRMDATA IS COMMITTED TO CREATING A DYNAMIC WORK ENVIRONMENT THAT VALUES DIVERSITY AND INCLUSION, RESPECT AND INTEGRITY, CUSTOMER FOCUS, AND INNOVATION FOR INDIVIDUAL AND TEAM.\nFOR MORE INFORMATION, YOU MAY ALSO VISIT OUR COMPANY WEBSITE (WWW.AFFIRMDATA.COM).",
    "job_skill_set": [
      "sales",
      "MS Office",
      "lead qualification",
      "lead conversion",
      "communication",
      "problem solving",
      "customer focus",
      "teamwork",
      "adaptability",
      "objection handling",
      "time management",
      "CRM",
      "sales forecasting",
      "mortgage products",
      "technical understanding",
      "high-volume calling"
    ],
    "short_keywords": [
      "adaptability",
      "business",
      "businessdevelopment",
      "calling",
      "communication",
      "conversion",
      "crm",
      "customer",
      "development",
      "focus",
      "forecasting",
      "handling",
      "highvolume",
      "inside",
      "lead",
      "management",
      "mortgage",
      "ms",
      "objection",
      "office",
      "problem",
      "products",
      "qualification",
      "sales",
      "solving",
      "specialist",
      "teamwork",
      "technical",
      "time",
      "understanding"
    ]
  },
  {
    "job_id": "3904963200",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "THE IDEAL CANDIDATE WILL LEAD INITIATIVES TO GENERATE AND ENGAGE WITH BUSINESS PARTNERS IN USA TO BUILD NEW BUSINESS FOR THE COMPANY. THIS CANDIDATE WILL BE FOCUSED AND HAVE STRONG COMMUNICATION SKILLS. THEY SHOULD BE ABLE TO THINK CRITICALLY WHEN MAKING PLANS AND HAVE A DEMONSTRATED ABILITY TO EXECUTE A PARTICULAR STRATEGY.  RESPONSIBILITIESIDENTIFY PARTNERSHIP OPPORTUNITIESDEVELOP NEW RELATIONSHIPS IN AN EFFORT TO GROW BUSINESS AND HELP COMPANY EXPANDMAINTAIN EXISTING BUSINESSTHINK CRITICALLY WHEN PLANNING TO ASSURE PROJECT SUCCESS\nQUALIFICATIONSBACHELOR'S DEGREE OR EQUIVALENT EXPERIENCE3 - 4 YEARS' PRIOR INDUSTRY RELATED BUSINESS DEVELOPMENT EXPERIENCESTRONG COMMUNICATION AND INTERPERSONAL SKILLSPROVEN KNOWLEDGE AND EXECUTION OF SUCCESSFUL DEVELOPMENT STRATEGIESFOCUSED AND GOAL-ORIENTED",
    "job_skill_set": [
      "business development",
      "strategic planning",
      "relationship management",
      "market analysis",
      "execution of strategies",
      "communication",
      "critical thinking",
      "interpersonal skills",
      "goal-oriented",
      "focus"
    ],
    "short_keywords": [
      "analysis",
      "business",
      "businessdevelopment",
      "communication",
      "critical",
      "development",
      "execution",
      "focus",
      "goaloriented",
      "interpersonal",
      "management",
      "manager",
      "market",
      "of",
      "planning",
      "relationship",
      "skills",
      "strategic",
      "strategies",
      "thinking"
    ]
  },
  {
    "job_id": "3894896010",
    "job_title": "Business Development Manager Healthcare",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "PLEASE NOTE THAT THIS IS AN INDEPENDENT CONTRACTOR POSITION WITHOUT A FIXED SALARY OR TRADITIONAL EMPLOYEE BENEFITS. EARNINGS ARE PURELY COMMISSION-BASED, DEPENDENT ON REFERRAL SUCCESS AND CLIENT RETENTION. (POSSIBLE TO EARN SIX FIGURES ON AUTO-PILOT)\nABOUT US: STAFFINGLY, INC. IS RENOWNED FOR ALLEVIATING ADMINISTRATIVE CHALLENGES FACED BY HEALTHCARE PRACTICES, ESPECIALLY DURING STAFF SHORTAGES. OUR COMMITMENT TO EFFICIENCY HAS MADE US A TOP-RATED PROVIDER, KNOWN FOR SIGNIFICANTLY REDUCING DELAYS AND BOOSTING APPROVAL RATES FOR PRIOR AUTHORIZATION.\nJOB OVERVIEW: WE ARE SEEKING DEDICATED HEALTHCARE PROFESSIONALS, INCLUDING NURSES, PHYSICIAN ASSISTANTS ETC., TO JOIN OUR TEAM. THIS ROLE INVOLVES USING YOUR PROFESSIONAL NETWORK TO INTRODUCE HEALTHCARE PROVIDERS TO OUR SERVICES, HELPING THEM OVERCOME ADMINISTRATIVE CHALLENGES. AS AN INDEPENDENT CONTRACTOR, YOU WILL DIRECTLY CONTRIBUTE TO THE GROWTH OF OUR CUSTOMER BASE AND THE OVERALL ENHANCEMENT OF HEALTHCARE DELIVERY. VISIT US AT HTTPS://STAFFINGLY.COM\nKEY RESPONSIBILITIES:\nUTILIZE YOUR PROFESSIONAL NETWORK TO IDENTIFY PROVIDERS IN NEED OF ADMINISTRATIVE SUPPORT.PROMOTE STAFFINGLY, INC.'S SOLUTIONS, TAILORED TO MEET THE SPECIFIC NEEDS OF POTENTIAL CLIENTS.EARN A SUBSTANTIAL COMMISSION FROM EACH NEW CLIENT REFERRAL, WITH THE OPPORTUNITY FOR RECURRING MONTHLY COMMISSIONS BASED ON CLIENT RETENTION.\nBENEFITS:\nFLEXIBLE, WORK-FROM-HOME SETUP TO MAINTAIN A HEALTHY WORK-LIFE BALANCE.COMMISSION-BASED EARNINGS WITH HIGH INCOME POTENTIAL. (SIX FIGURES ON AUTO-PILOT)IMPACT THE HEALTHCARE INDUSTRY POSITIVELY BY EASING THE ADMINISTRATIVE LOAD FOR HEALTHCARE PROVIDERS WITH 70% SAVINGS IN STAFFING COSTS.\nREQUIREMENTS:\nCURRENT OR PRIOR EXPERIENCE IN THE HEALTHCARE INDUSTRY.A ROBUST PROFESSIONAL NETWORK WITHIN THE HEALTHCARE SECTOR.EXCEPTIONAL COMMUNICATION AND INTERPERSONAL SKILLS.\nWE INVITE YOU TO EXPRESS YOUR INTEREST AND LEARN MORE ABOUT THIS EXCITING OPPORTUNITY BY REACHING OUT DIRECTLY. WE ARE EAGER TO ANSWER YOUR QUESTIONS AND ASSIST YOU IN JOINING OUR FREELANCE NETWORK.\nJOIN US AT STAFFINGLY, INC. AND BE PART OF A TEAM TRANSFORMING HEALTHCARE PRACTICES NATIONWIDE. LET'S WORK TOGETHER TO MAKE A SIGNIFICANT IMPACT ON HEALTHCARE DELIVERY.",
    "job_skill_set": [
      "professional network",
      "administrative support solutions",
      "communication",
      "interpersonal skills",
      "networking",
      "sales skills",
      "self-motivation",
      "healthcare industry experience"
    ],
    "short_keywords": [
      "administrative",
      "business",
      "businessdevelopment",
      "communication",
      "development",
      "experience",
      "healthcare",
      "industry",
      "interpersonal",
      "manager",
      "network",
      "networking",
      "professional",
      "sales",
      "selfmotivation",
      "skills",
      "solutions",
      "support"
    ]
  },
  {
    "job_id": "3903480049",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "✨YOUR NEXT “INTRAPRENEUR” CHALLENGE IS JUST ONE CLICK AWAY! THIS IS NOT YOUR AVERAGE SALES JOB -- INSTEAD, THIS IS A LEADERSHIP POSITION THAT IS IN THE FOREFRONT OF MIGSO-PCUBED'S ORGANIZATIONAL GROWTH.OUR MOBILE HUB, IS LOOKING FOR A BUSINESS MANAGER TO KEEP PACE WITH THE RAPID EXPANSION OF THE MARKET. THIS IS YOUR OPPORTUNITY TO JOIN THE LARGEST GLOBAL CONSULTING COMPANY THAT SPECIALIZES IN PROGRAM PROJECT MANAGEMENT SERVICES AND SOLUTIONS, WHERE YOU WILL HAVE THE CHANCE TO GROW AND MANAGE NEW CLIENT ACCOUNTS, BUILD YOUR TEAM, AND MANAGE YOUR PROFIT CENTER.\nYOUR NEXT CHALLENGEYOUR GOAL IS TO DEVELOP AND EXPAND OUR BUSINESS AND YOUR NETWORK WHILE FOSTERING RELATIONSHIPS WITH CLIENTS, CANDIDATES, AND CONSULTANTS ACROSS DIFFERENT INDUSTRIES.\nBUSINESS MANAGERS TAKE OWNERSHIP OF THREE ESSENTIAL ELEMENTS OF THE ORGANIZATION:BUSINESS DEVELOPMENT: MAINTAINING A BUSINESS DEVELOPMENT ‘DRUMBEAT’ IS CRITICAL. BUSINESS MANAGERS ARE RESPONSIBLE FOR BUILDING THEIR TARGET COMPANY PORTFOLIO, IDENTIFYING GROWTH OPPORTUNITIES WITHIN THEIR BUSINESS UNIT, MANAGE THE SCOPE OF ACTIVITY BY BUILDING RELATIONSHIPS WITH KEY ACCOUNT CUSTOMERS, AND SELL EXPERT-LEVEL PROJECT MANAGEMENT SERVICES.MANAGEMENT AND RECRUITMENT: OUR PEOPLE ARE OUR CORE COMPETENCY. YOU WILL PARTNER WITH OUR TALENT ACQUISITION TEAM TO INTERVIEW AND HIRE THE RIGHT CANDIDATES TO SUPPORT AND DEVELOP YOUR HUB’S CONSULTANT TEAM. THEN, AS A MANAGER AND LEADER OF YOUR TEAM, YOU HELP TO IDENTIFY GROWTH AREAS AND EMPOWER YOUR TEAM TO REACH THEIR POTENTIAL THROUGHOUT THEIR CAREER (COACHING, CAREER PATH DEVELOPMENT, ETC.).PROFIT CENTER MANAGEMENT: ENSURE PROJECT SUCCESS IN PARTNERSHIP WITH YOUR CONSULTANTS, DELIVERY MANAGERS, AND CLIENTS. MANAGE REVENUE GROWTH AND PROFITABILITY OBJECTIVES OF YOUR BUSINESS UNIT, WHILE GUARANTEEING CLIENT SATISFACTION.\nWHO ARE YOU?YOU HAVE AT LEAST A BACHELOR’S DEGREE IN ENGINEERING OR IN BUSINESS, WITH 3-5 YEARS OF EXPERIENCE IN EITHER SALES OR CLIENT ACCOUNT MANAGEMENT EXPERIENCE.\nYOU HAVE A KEEN INTEREST IN VARIOUS INDUSTRIAL SECTORS AND THEIR CHALLENGES. YOU LOVE TO HELP CUSTOMERS SOLVE THEIR CRITICAL PROBLEMS WITH OUR PROJECT MANAGEMENT SERVICES AND SOLUTIONS. IDEALLY, YOU HAVE ALREADY HAD THE OPPORTUNITY TO DISCOVER PROJECT MANAGEMENT OVER THE COURSE OF YOUR PAST EXPERIENCES, BUT WE ARE WILLING TO INVEST IN YOU TO QUICKLY DEVELOP YOUR KNOWLEDGE OF OUR SERVICES AND SOLUTIONS AND THE VALUE BENEFITS THOSE SERVICES BRING TO OUR CUSTOMERS.\nYOU ARE BUSINESS-MINDED AND RESULTS-ORIENTED. YOUR SUCCESS IN THIS POSITION RELIES ON YOUR SELF-DISCIPLINE, CONSISTENCY, AND YOUR DESIRE TO LEAD AND UNITE MULTIDISCIPLINARY TEAMS. YOUR ABILITY TO BUILD AND MAINTAIN IMPACTFUL RELATIONSHIPS INTERNALLY AND WITH CLIENTS IS CRITICAL TO YOUR SUCCESS.\nOUR PROMISEBY JOINING OUR COMPANY AS A BUSINESS MANAGER, YOU WILL BE ABLE TAKE ADVANTAGE OF MENTORSHIP, TRAINING AND DEVELOPMENT PROVIDED BY YOUR HUB LEADERSHIP AND A GLOBAL COMMUNITY OF BUSINESS MANAGERS HERE TO SUPPORT YOUR GOALS AND PROGRESSION. WE WILL TAILOR YOUR ONBOARDING AND CONTINUED SUPPORT FOR YOU IN ALL ASPECTS OF YOUR SKILL DEVELOPMENT—MANAGEMENT AND LEADERSHIP, RECRUITMENT, TECHNICAL KNOWLEDGE, OR SALES TACTICS AND STRATEGIES. YOUR METRICS ARE CLEARLY DEFINED FROM THE BEGINNING, AND YOU WILL HAVE VISIBILITY TO YOUR PROGRESS IN ALIGNMENT TO THOSE METRICS. WE OFFER A GENEROUS INCENTIVE REWARD PACKAGE BASED ON THE ACHIEVEMENT OF YOUR RESULTS AGAINST SET TARGETS ON A QUARTERLY BASIS.TODAY, WE ARE RECRUITING OUR LEADERS OF TOMORROW!✨\nBENEFITS AND PERKSMP OFFERS COMPREHENSIVE CONTRIBUTIONS TO MEDICAL, DENTAL, AND VISION FOR YOU AND YOUR DEPENDENTS. WE ALSO INCLUDE A NOTABLE PTO PLAN, PAID HOLIDAYS, A 401K WITH COMPANY MATCH, AND PROFESSIONAL DEVELOPMENT OPPORTUNITIES.\nEQUAL OPPORTUNITY STATEMENTMIGSO-PCUBED RECOGNIZES THE CIVIL RIGHT OF EVERY PERSON TO OBTAIN AND MAINTAIN EMPLOYMENT WITHOUT DISCRIMINATION. WE HAVE A LONGSTANDING POLICY THAT NO INDIVIDUAL MAY BE REFUSED A JOB, DISCHARGED, OR DISCRIMINATED AGAINST IN ANY WAY DUE TO ANY PROTECTED CHARACTERISTICS ESTABLISHED BY LOCAL, STATE AND FEDERAL LAW. IN ALL RESPECTS, MIGSO-PCUBED IS COMMITTED TO A POLICY OF FULL AND FAIR EQUAL EMPLOYMENT UNDER THE LAW AND APPLIES THIS IN ALL EMPLOYMENT DECISIONS, INCLUDING RECRUITMENT, HIRING, COMPENSATION, ENGAGEMENT STAFFING, TRAINING, PROMOTION, TRANSFER, AND TERMINATION.",
    "job_skill_set": [
      "business development",
      "sales",
      "client account management",
      "business degree",
      "leadership",
      "relationship building",
      "team management",
      "self-discipline",
      "results-oriented",
      "communication",
      "problem solving",
      "project management",
      "recruitment",
      "profit center management",
      "engineering",
      "coaching"
    ],
    "short_keywords": [
      "account",
      "building",
      "business",
      "businessdevelopment",
      "center",
      "client",
      "coaching",
      "communication",
      "degree",
      "development",
      "engineering",
      "leadership",
      "management",
      "manager",
      "problem",
      "profit",
      "project",
      "recruitment",
      "relationship",
      "resultsoriented",
      "sales",
      "selfdiscipline",
      "solving",
      "team"
    ]
  },
  {
    "job_id": "3898167131",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "WE ARE LOOKING FOR AN EXPERIENCED BDR TO JOIN OUR CLIENT'S B2B SAAS COMPANY THAT PROVIDES SUPPLY CHAIN MANAGEMENT SOLUTIONS. THEY HELP MANUFACTURERS AND DISTRIBUTORS MANAGE THEIR DIRECT SPEND, STREAMLINE PROCUREMENT, IMPROVE SUPPLIER COLLABORATION, AND ENHANCE SUPPLY CHAIN VISIBILITY. \nTHE IDEAL CANDIDATE WILL CULTIVATE RELATIONSHIPS WITH PROSPECTIVE CLIENTS IN ORDER TO CATALYZE BUSINESS DEVELOPMENT SUCCESS. THIS INDIVIDUAL WILL SCHEDULE MEETINGS WITH CLIENTS IN ORDER TO UNDERSTAND THEIR NEEDS. THEY WILL ALSO WORK CLOSELY WITH SALES AND MARKETING TEAMS TO UNCOVER NEW LEADS.  RESPONSIBILITIESGENERATE APPOINTMENTS BY MEANS OF PROACTIVE OUTBOUND PROSPECTINGWORK DIRECTLY WITH SALES AND MARKETING TO DISCOVER OPPORTUNITIES FROM LEADSDEMONSTRATE AND TEACH STRONG SELLING AND INFLUENCING SKILLS\nQUALIFICATIONS\nBACHELOR'S DEGREE OR EQUIVALENT EXPERIENCE3+ YEARS' OF EXPERIENCE IN BUSINESS DEVELOPMENTSTRONG COMMUNICATION AND TIME MANAGEMENT SKILLS",
    "job_skill_set": [
      "B2B Sales",
      "Outbound Prospecting",
      "Lead Generation",
      "Sales Strategy",
      "Communication",
      "Relationship Building",
      "Time Management",
      "Influencing Skills",
      "Collaboration",
      "Supply Chain Management",
      "CRM Software"
    ],
    "short_keywords": [
      "b2b",
      "building",
      "business",
      "businessdevelopment",
      "chain",
      "collaboration",
      "communication",
      "crm",
      "development",
      "generation",
      "influencing",
      "lead",
      "management",
      "outbound",
      "prospecting",
      "relationship",
      "representative",
      "sales",
      "skills",
      "software",
      "strategy",
      "supply",
      "time"
    ]
  },
  {
    "job_id": "3887106121",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "POSITION: IN/MI BUSINESS DEVELOPMENT MANAGER – PUBLIC MARKETSOPENINGS: 1DURATION: PERMANENT FULL TIMEADDRESS: MICHIGAN OR INDIANA – DAILY TRAVEL TO CLIENTS & PROJECT SITES80% OF TIME SPENT IN PERSON, OTHERWISE WFH – OCCASIONAL OVERNIGHT STAYS (1-2 NIGHTS) A FEW TIMES A MONTH DEPENDING ON LOCATIONMUST HAVES:5+ YEARS OF PROVEN TECHNICAL/ENGINEERING/CONSTRUCTION SALES EXPERIENCE IN PUBLIC MARKETS (STATE/FEDERAL, MUNICIPAL, CIVIL, AIRPORT, RAILROAD, ASPHALT, CONCRETE, STEEL, IRON, PVC, AGGREGATE, ETC.) – EXPERIENCE IN A PRIVATE SECTOR IS NOT A FITEXPERIENCE WITH SALES/DESIGN/PROJECT MANAGEMENT/ESTIMATING IN THE CONSTRUCTION OR ENGINEERING INDUSTRYEXISTING RELATIONSHIPS WITH PUBLIC CONTRACTORS IS A MUST – ABILITY TO BUILD AND GROW RELATIONSHIPS WITH PUBLIC CONTRACTORS ON MUNICIPAL, STATE, & FEDERAL PROJECTS5+ YEARS OF EXPERIENCE WITH ENGINEERING PROPOSALS, READING AND EVALUATING PROJECT PLANSKNOWLEDGE OF DOT (DEPARTMENT OF TRANSPORTATION) DESIGN & LETTING PROCESSEXPERIENCE WITH SALESFORCE OR ANY CRM AND LEAD GENERATION\nPLUSSES: BACHELOR’S DEGREE IS REQUIRED – DEGREE IN ENGINEERING OR CONSTRUCTION VERY HIGHLY DESIRED\nDAY TO DAY: A LARGE WATER SOLUTIONS MANUFACTURING AND ENGINEERING CLIENT OF INSIGHT GLOBAL IS LOOKING FOR A BUSINESS DEVELOPMENT TO JOIN THEIR PUBLIC MARKETS SALES & ENGINEERING TEAM. THROUGH MARKET PENETRATION DRIVEN BY PRODUCT INNOVATION, CUSTOMER APPROVAL AND ACCEPTANCE, WE ARE IN SEARCH OF A BUSINESS DEVELOPMENT REPRESENTATIVE TO ESCALATE MOMENTUM IN PUBLIC MARKETS IN THE REGION. THIS POSITION IS RESPONSIBLE FOR DEVELOPING RELATIONSHIPS IN THE PUBLIC MARKETS (DOT, MUNICIPAL, AIRPORT AND RAIL) WITH CONTRACTORS, THE ENGINEERS, REGULATORS, AND OWNERS.\nPRIMARY JOB RESPONSIBILITIES:IMPLEMENT GROWTH STRATEGY TACTICS SET BY VP OF PUBLIC MARKETS FOR $200 MILLION PORTFOLIO: PARTNER WITH SALES ON EXECUTIONIDENTIFY AND DEVELOP NEW AND MAINTAIN CURRENT CUSTOMER BASE WITHIN THE PUBLIC SECTOR.PROVIDE GREATER COVERAGE IN PUBLIC MARKETS BY BUILDING RELATIONSHIPS WITH TARGET STAKEHOLDERS (REGULATORS, CONTRACTORS, AND ENGINEERS) TO GAIN APPROVAL AND ACCEPTANCE OF OUR PRODUCTS.POSITION US AS THE LEADER IN WATER MANAGEMENT SOLUTIONS, SPECIFICALLY IN THE STORMWATER SEGMENT.LEVERAGE EXISTING APPROVALS AND ACCEPTANCE THROUGH PROMOTION OF NATIONAL, REGIONAL, AND LOCAL PROJECT SUCCESS.DEVELOP A YEARLY ACTION PLAN FOR EACH PRODUCT WITH MBO’S THAT SUPPORT THE ACTION ITEMS. REVIEW AND MODIFY THESE MBO’S AS NECESSARY TO ACHIEVE THE OBJECTIVE IN A TIMELY MATTER.COMMUNICATION WITH THE SALES AND SALES MANAGEMENT IS IMPERATIVE TO POSITION SUCCESS.WORK WITH ALL AVAILABLE DEPARTMENTS USING A “TEAM APPROACH” WITHIN US TO ACCOMPLISH YOUR OBJECTIVES.BUSINESS DEVELOPMENT REPRESENTATIVE WILL WORK DIRECTLY WITH LOCAL SALES AND FIELD ENGINEERING TEAMS TO IDENTIFY AND TRACK ALL PROJECTS THOUGH THE CONCEPTUAL, DESIGN, BIDDING, AND CONSTRUCTION PHASES.WORK IN CONCERT WITH THE SALES AND SALES MANAGEMENT TEAM TO PROTECT AND SECURE PROJECTS. FACILITATE PRICING INQUIRES TO ASSURE THAT PRODUCTS YOU REPRESENT ARE COMPETITIVE.LEVERAGE KEY INDUSTRY ORGANIZATIONS IN YOUR TERRITORY, I.E., ASCE, APWA, AGC, NUCA, ETC.IDENTIFICATION, ORGANIZATION, AND COVERAGE OF LOCAL TRADE SHOWS FOR PUBLIC MARKETS.WORK CLOSELY WITH THE MARKETING AND DIGITAL MARKETING TO DEVELOP AND EXECUTE STRATEGIC CAMPAIGNS TO INCREASE APPROVALS, ACCEPTANCE, AND COVERAGE WITHIN THE PUBLIC MARKETS.OTHER DUTIES AS ASSIGNED",
    "job_skill_set": [
      "technical sales",
      "project management",
      "relationship building",
      "market penetration",
      "communication",
      "teamwork",
      "strategic planning",
      "customer service",
      "problem solving",
      "adaptability",
      "negotiation",
      "leadership",
      "engineering proposals",
      "CRM (Salesforce)",
      "DOT design knowledge",
      "construction estimating",
      "public markets knowledge",
      "water management solutions"
    ],
    "short_keywords": [
      "adaptability",
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "construction",
      "crm",
      "customer",
      "design",
      "development",
      "dot",
      "engineering",
      "estimating",
      "knowledge",
      "leadership",
      "management",
      "manager",
      "market",
      "markets",
      "negotiation",
      "penetration",
      "planning",
      "problem",
      "project",
      "proposals",
      "public",
      "relationship",
      "sales",
      "salesforce",
      "service",
      "solutions",
      "solving",
      "strategic",
      "teamwork",
      "technical",
      "water"
    ]
  },
  {
    "job_id": "3901364174",
    "job_title": "Director, NFL Partnership and Business Development",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "WHO WE ARE\n\nON LOCATION IS A PREMIUM EXPERIENCE PROVIDER, OFFERING WORLD CLASS HOSPITALITY, TICKETING, CURATED GUEST EXPERIENCES, LIVE EVENT PRODUCTION, AND TRAVEL MANAGEMENT ACROSS SPORTS, ENTERTAINMENT, AND FASHION. FROM UNRIVALED ACCESS FOR CORPORATE CLIENTS TO GUESTS LOOKING FOR FULLY IMMERSIVE EXPERIENCES AT MARQUEE EVENTS, ON LOCATION IS THE PREMIER AND OFFICIAL SERVICE PROVIDER TO OVER 150 ICONIC RIGHTS HOLDERS, SUCH AS THE IOC (PARIS 2024, MILANO CORTINA 2026, LA 2028), NFL, NCAA, UFC AND PGA OF AMERICA, AND NUMEROUS MUSICAL ARTISTS AND FESTIVALS. THE COMPANY ALSO OWNS AND OPERATES A NUMBER OF UNIQUE AND EXCLUSIVE EXPERIENCES, TRANSFORMING THE MOST DYNAMIC LIVE EVENTS INTO A LIFETIME OF MEMORIES. ON LOCATION IS A SUBSIDIARY OF ENDEAVOR, A GLOBAL SPORTS AND ENTERTAINMENT COMPANY.\n\nENDEAVOR IS A GLOBAL SPORTS AND ENTERTAINMENT COMPANY, HOME TO MANY OF THE WORLD’S MOST DYNAMIC AND ENGAGING STORYTELLERS, BRANDS, LIVE EVENTS, AND EXPERIENCES. THE ENDEAVOR NETWORK SPECIALIZES IN TALENT REPRESENTATION THROUGH ENTERTAINMENT AGENCY WME; SPORTS OPERATIONS AND ADVISORY, EVENT MANAGEMENT, MEDIA PRODUCTION AND DISTRIBUTION, AND BRAND LICENSING THROUGH IMG; LIVE EVENT EXPERIENCES AND HOSPITALITY THROUGH ON LOCATION; FULL-SERVICE MARKETING THROUGH GLOBAL CULTURAL MARKETING AGENCY 160OVER90; AND SPORTS DATA AND TECHNOLOGY THROUGH IMG ARENA AND OPENBET. ENDEAVOR IS ALSO THE MAJORITY OWNER OF TKO GROUP HOLDINGS (NYSE: TKO), A PREMIUM SPORTS AND ENTERTAINMENT COMPANY COMPRISING UFC AND WWE.\n\nTHE ROLE AND WHAT YOU’LL DO\n\nTHE DIRECTOR, NFL PARTNERSHIP AND BUSINESS DEVELOPMENT AT ON LOCATION PLAYS A VITAL ROLE IN THE STRATEGIC MANAGEMENT AND GROWTH OF ON LOCATION’S PARTNERSHIPS WITH NFL CLUBS. THIS ROLE IS RESPONSIBLE FOR CULTIVATING AND ENHANCING THESE PARTNERSHIPS, ENSURING ALIGNMENT WITH ON LOCATION’S STRATEGIC GOALS AND THE EVOLVING LANDSCAPE OF THE NFL. THE DIRECTOR WILL ACT AS THE PRIMARY LIAISON BETWEEN ON LOCATION AND NFL CLUBS, OVERSEEING RELATIONSHIP MANAGEMENT, PARTNERSHIP ACTIVATIONS, AND STRATEGIC INITIATIVES TO FOSTER LONG-TERM GROWTH AND COLLABORATION. OPTIMIZE SALESFORCE CRM TO ENHANCE FUNCTIONALITY, USABILITY, AND EFFICIENCY, ENSURING IT SERVES AS AN EFFECTIVE TOOL FOR SALES ENABLEMENT AND OPERATIONS. \n\nSTRATEGIC RELATIONSHIP MANAGEMENT: SERVE AS THE PRIMARY LIAISON AND DAY-TO-DAY CONTACT FOR NFL CLUB PARTNERS, OVERSEEING THE ENTIRE RELATIONSHIP LIFECYCLE FROM INITIATION AND ACTIVATION TO RENEWAL AND EXPANSION. ENSURE PARTNERSHIPS DELIVER EXCEPTIONAL VALUE AND MEET THE EVOLVING NEEDS OF BOTH PARTIES.  CROSS-FUNCTIONAL COLLABORATION: LEAD AND COLLABORATE CLOSELY WITH INTERNAL TEAMS ACROSS ON LOCATION, INCLUDING MARKETING, TICKETING, FINANCE, LEGAL, AND MORE. THIS ROLE REQUIRES A PROACTIVE AND INTEGRATIVE APPROACH TO LEVERAGE CROSS-FUNCTIONAL EXPERTISE AND EFFECTIVELY ACTIVATE SPONSORSHIP ELEMENTS AND PROGRAMS.  STRATEGIC DEVELOPMENT: WORK ALONGSIDE SENIOR MANAGEMENT TO STRATEGICALLY DEVELOP, NEGOTIATE, AND MANAGE SPONSORSHIP RELATIONSHIPS WITH NFL CLUBS. FOCUS ON BOTH RENEWING EXISTING PARTNERSHIPS AND IDENTIFYING AS WELL AS DEVELOPING NEW RELATIONSHIP OPPORTUNITIES TO ENHANCE ON LOCATION’S PORTFOLIO.  OPPORTUNITY EXPLORATION: ACTIVELY SEEK AND IDENTIFY NEW OPPORTUNITIES WITH NFL CLUB PARTNERS, WITH A KEEN FOCUS ON HIGH-IMPACT EVENTS SUCH AS THE SUPER BOWL, INTERNATIONAL GAMES, AND REGULAR SEASON ACTIVITIES. ENSURE THESE OPPORTUNITIES ALIGN WITH ON LOCATION’S STRATEGIC GOALS AND ENHANCE PARTNERSHIP VALUE.  EVENT COORDINATION: COORDINATE WITH VARIOUS FUNCTIONAL AREAS WITHIN ON LOCATION DURING KEY TIMES OF THE YEAR, SUCH AS NFL SCHEDULE RELEASES AND END-OF-SEASON PLANNING. ENSURE SEAMLESS EXECUTION AND SUPPORT FOR NFL CLUB PARTNERS, ALIGNING WITH THEIR SCHEDULES AND MAJOR EVENTS.  FINANCIAL PLANNING: COLLABORATE WITH FINANCE AND TICKETING TEAMS TO MODEL CLUB PARTNERSHIPS. CONTRIBUTE TO THE OVERALL BUSINESS STRATEGY AND FINANCIAL HEALTH OF ON LOCATION BY ENSURING THAT PARTNERSHIPS ARE FINANCIALLY VIABLE AND STRATEGICALLY ALIGNED.  ACTIVATION OVERSIGHT: OVERSEE THE ACTIVATION OF SERVICE ELEMENTS WITHIN ON LOCATION’S RELATIONSHIPS WITH NFL CLUBS AS NEEDED. THIS INCLUDES DEVELOPING AND IMPLEMENTING SPECIAL PROGRAMS FOR NFL CLUBS AT ON LOCATION EVENTS, ENSURING A PREMIUM AND DIFFERENTIATED EXPERIENCE IS DELIVERED CONSISTENTLY.  PARTNERSHIP MANAGEMENT: ASSIST WITH THE MANAGEMENT OF OTHER ON LOCATION PARTNERSHIPS AS NEEDED, DEMONSTRATING FLEXIBILITY AND A DEEP UNDERSTANDING OF PARTNERSHIP DYNAMICS ACROSS DIFFERENT CONTEXTS. ENSURE THAT ALL PARTNERSHIPS ARE MANAGED TO THE HIGHEST STANDARDS, CONTRIBUTING TO ON LOCATION’S REPUTATION AS A PREMIER EXPERIENCE PROVIDER.  \n\n    \n\nOTHER DUTIES & RESPONSIBILITIES \n\n THIS JOB DESCRIPTION IS NOT DESIGNED TO COVER OR CONTAIN A COMPREHENSIVE LISTING OF THE EMPLOYEE'S ACTIVITIES, DUTIES, OR RESPONSIBILITIES FOR THIS JOB. DUTIES, OBLIGATIONS, AND ADDITIONAL ACTIVITIES MAY CHANGE AT ANY TIME WITH OR WITHOUT NOTICE. \n\n  \n\nTRAVEL  \n\n \n\nMUST BE ADAPTABLE WITH WORK AND TRAVEL SCHEDULE AND BE AVAILABLE TO TRAVEL FOR WORK WHICH MAY INCLUDE EXTENDED WORK HOURS DURING NIGHTS, WEEKENDS, AND HOLIDAYS. THIS POSITION MAY REQUIRE UP TO 20% TRAVEL IN THE UNITED STATES. \n\nYOU HAVE THESE\n\n6+ YEARS PROVEN EXPERIENCE IN PARTNERSHIP MANAGEMENT, PREFERABLY WITHIN THE SPORTS INDUSTRY OR DIRECTLY WITH NFL CLUBS.  STRONG LEADERSHIP SKILLS WITH THE ABILITY TO WORK CROSS-FUNCTIONALLY AND LEAD COLLABORATIVE EFFORTS.  EXCELLENT RELATIONSHIP-BUILDING SKILLS, WITH A TRACK RECORD OF DEVELOPING AND GROWING PARTNERSHIPS.  EXCELLENT COMMUNICATION SKILLS   \n\n \n\nWE’D LOVE IF YOU ALSO HAVE THESE: \n\nSTRATEGIC THINKER WITH THE ABILITY TO IDENTIFY AND PURSUE NEW OPPORTUNITIES FOR PARTNERSHIP EXPANSION.  SOLID FINANCIAL ACUMEN, WITH EXPERIENCE IN MODELING PARTNERSHIP IMPACTS ON PROFIT AND LOSS.  EXCEPTIONAL ORGANIZATIONAL AND COORDINATION SKILLS, CAPABLE OF MANAGING MULTIPLE PROJECTS SIMULTANEOUSLY.  PASSIONATE ABOUT DELIVERING EXCEPTIONAL EXPERIENCES AND VALUE TO PARTNERS AND CLIENTS.  \n\nHOW WE WORK: \n\nENDEAVOR IS AT THE CENTER OF SPORTS, MEDIA, ENTERTAINMENT, AND FASHION AND IS A LARGELY RELATIONSHIP-BASED BUSINESS. TO FOSTER AN ENVIRONMENT OF COLLABORATION, DEVELOP OUR FUTURE TALENT, AND BUILD ON RELATIONSHIPS ACROSS LEADERSHIP, PEERS, AND TEAMS, WE WORK FROM THE OFFICE 4 DAYS PER WEEK/IN A REMOTE CAPACITY. WE SEE IMMEASURABLE VALUE INTERNALLY AND THROUGHOUT THE CORE OF THE BUSINESSES WE SUPPORT.\n\nDON’T MEET EVERY SINGLE REQUIREMENT? WE ARE DEDICATED TO BUILDING A DIVERSE, INCLUSIVE, AUTHENTIC WORKPLACE, SO IF YOU’RE EXCITED ABOUT THIS ROLE BUT YOUR PAST EXPERIENCE DOESN’T ALIGN PERFECTLY WITH EVERY QUALIFICATION IN THE JOB DESCRIPTION, WE ENCOURAGE YOU TO APPLY ANYWAY. YOU MAY BE JUST THE RIGHT CANDIDATE FOR THIS OR OTHER ROLES.\n\nENDEAVOR UNITES AND BRINGS PEOPLE TOGETHER IN OUR LOVE OF SPORT, CULTURE, AND ENTERTAINMENT. WE UNDERSTAND THIS CAN ONLY BE ACCOMPLISHED WHEN WE LEAD WITH A LENS OF DIVERSITY, EQUITY, AND INCLUSION IN EVERYTHING WE DO. AS A GLOBAL COMPANY THAT DRIVES CULTURE, WE STRIVE TO REFLECT THE WORLD’S DIVERSE VOICES.  \n\nENDEAVOR IS AN EQUAL OPPORTUNITIES EMPLOYER AND ENCOURAGES APPLICATIONS FROM SUITABLY QUALIFIED AND ELIGIBLE CANDIDATES REGARDLESS OF SEX, RACE, DISABILITY, AGE, SEXUAL ORIENTATION, OR RELIGION OR BELIEF.",
    "job_skill_set": [
      "partnership management",
      "event coordination",
      "strategic development",
      "relationship management",
      "cross-functional collaboration",
      "leadership",
      "communication",
      "organizational skills",
      "strategic thinking",
      "relationship-building",
      "adaptability",
      "problem-solving",
      "salesforce CRM",
      "financial modeling"
    ],
    "short_keywords": [
      "adaptability",
      "and",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "coordination",
      "crm",
      "crossfunctional",
      "development",
      "director",
      "event",
      "financial",
      "leadership",
      "management",
      "modeling",
      "nfl",
      "organizational",
      "partnership",
      "problemsolving",
      "relationship",
      "relationshipbuilding",
      "salesforce",
      "skills",
      "strategic",
      "thinking"
    ]
  },
  {
    "job_id": "3902753343",
    "job_title": "Senior Director, Business Development",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "THE SENIOR DIRECTOR OF BUSINESS DEVELOPMENT – ECOMMERCE, IS A SENIOR SALES ROLE FOCUSED ON DRIVING NEW BUSINESS GROWTH THROUGH BOTH INDIVIDUAL CONTRIBUTION AND MANAGING SALESPEOPLE. THE PRIMARY RESPONSIBILITY IS TO DEVELOP AND EXECUTE THE BUSINESS PLAN FOR CONTRACT LOGISTICS GROWTH IN THE ECOMMERCE SEGMENT FOR THE AMERICAS REGION. POSITION WILL WORK IN CONJUNCTION WITH GLOBAL AND REGIONAL TEAMS. THIS POSITION IS GIVEN A HIGH DEGREE OF AUTONOMY TO MANAGE THE SOLUTION SALES PROCESS AND IS SUPPORTED EXTENSIVELY BY THE ORGANIZATION.\n\nABOUT THE ROLE\n\nHOW YOU WILL CONTRIBUTE \n\nDEVELOPS AND EXECUTES A BUSINESS PLAN FOR CONTRACT LOGISTICS GROWTH IN ECOMMERCE FOR THE AMERICAS REGION. BUSINESS PLAN TO LEVERAGE DP WORLD’S ADVANTAGES AND ADDRESSES DP WORLD’S OBSTACLES TO NEW BUSINESS GROWTH IN THE ECOMMERCE SEGMENT.MANAGES A TEAM OF SALESPEOPLE FOCUSED ON SELLING ECOMMERCE CONTRACT LOGISTICS SOLUTIONS. PROJECT MANAGES INITIATIVES THAT ARE REQUIRED TO TRANSFORM THE BUSINESS TO BE SUCCESSFUL IN OFFERING AND OPERATING ECOMMERCE CONTRACT LOGISTICS SOLUTIONS.CREATES A COMPREHENSIVE TERRITORY PLAN AIMED AT IDENTIFYING THE TOP REGIONAL/INDUSTRY OPPORTUNITIES AND EXPANDING BUSINESS TO NEW ACCOUNTS.GENERATES EFFECTIVE LEADS AND OPPORTUNITIES FROM THE TERRITORY PLAN.IDENTIFIES AND DEVELOPS RELATIONSHIPS WITH KEY DECISION MAKERS AT ALL LEVELS WITHIN AN ACCOUNT.UNDERSTANDS THE CUSTOMER'S BUSINESS (STRATEGICALLY, OPERATIONALLY, FINANCIALLY) AND UNDERSTANDS THE CUSTOMER'S BUYING PROCESS AND IDENTIFY ALL INFLUENCES, INTIMATELY UNDERSTANDING THEIR REQUIREMENTS.WORKS ACROSS COMPANY TO CREATE CUSTOM SOLUTIONS THAT DELIVER VALUE TO OUR CUSTOMERS.TAKE OWNERSHIP FOR BIDS/QUOTES AND ENSURE ALL INTERNAL STAKEHOLDERS IN THE COMPANY ARE ALIGNED ON ANY SUCH BIDS AND THAT RESPONSES ARE PROFESSIONALLY ADMINISTERED AND IN LINE WITH OUR INTERNAL FINANCIAL RULES.WORK CLOSELY WITH VARIOUS DOMESTIC AND INTERNATIONAL COLLEAGUES IN A PROFESSIONAL MANNER WHICH REFLECTS THE SENIORITY OF THE ROLE AND ABILITY TO UNDERSTAND AND ACCOUNT FOR VARYING BUSINESS PERSPECTIVES SURROUNDING SOLUTIONS TO THE ASSIGNED CUSTOMER.MAINTAINS AN OPEN DIALOGUE WITH THE ACCOUNT EXECUTIVE SPONSOR AND KEEPS THE SPONSOR ENGAGED IN THE ACCOUNT.MAINTAINS AN UP-TO-DATE PIPELINE OF CURRENT AND FUTURE OPPORTUNITIES, QUANTIFYING NUMBER OF OPPORTUNITIES, VALUE OF THE OPPORTUNITY AND MANAGING THE PROBABILITY TO WIN.OWNS THE COMMERCIAL RELATIONSHIP AND CONTRACT NEGOTIATIONS WITH CUSTOMER FOR NEW BUSINESS WINS AND ENSURES DIRECT REPORTS OWN THE COMMERCIAL RELATIONSHIPS FOR THEIR NEW BUSINESS WINS. \n\nYOUR KEY QUALIFICATIONS\n\n8+ YEARS OF RELEVANT EXPERIENCEBACHELOR'S DEGREE IN BUSINESS OR SUPPLY CHAIN, OR OTHER RELEVANT FIELDSPECIFIC KNOWLEDGE AND EXPERIENCE WORKING IN THE NORTH AMERICA CONTRACT LOGISTICS MARKETRELEVANT WORK EXPERIENCE IN DEVELOPING AND EXECUTING AN E-COMMERCE GROWTH PLAN FOR CONTRACT LOGISTICSPROVEN TRACK RECORD IN WINNING NEW CUSTOMERSWILLINGNESS TO TRAVEL AT 70%\n\nSALARY RANGE: $184,700-$241,000\n\nTHIS INFORMATION REFLECTS THE ANTICIPATED BASE SALARY RANGE FOR THIS POSITION BASED ON CURRENT NATIONAL DATA. MINIMUMS AND MAXIMUMS MAY VARY BASED ON LOCATION. INDIVIDUAL PAY IS BASED ON SKILLS, EXPERIENCE AND OTHER RELEVANT FACTORS.\n\nAS PART OF OUR COMPREHENSIVE BENEFITS PACKAGE, DP WORLD OFFERS A BROAD RANGE OF HEALTH, LIFE, VOLUNTARY LIFESTYLE AND OTHER BENEFITS AND PERKS THAT ENHANCE YOUR PHYSICAL, MENTAL, EMOTIONAL AND FINANCIAL WELLBEING.\n\nTHIS POSITION MAY BE ELIGIBLE FOR EITHER SHORT-TERM INCENTIVES OR SALES COMPENSATION. WE'RE ABLE TO ANSWER ANY ADDITIONAL QUESTIONS YOU MAY HAVE AS YOU MOVE THROUGH THE SELECTION PROCESS\n\nCOMPENSATION\n\nDP WORLD OFFERS EXCITING AND CHALLENGING ROLES WITHIN A GROWING INTERNATIONAL ORGANIZATION. WE STRIVE TO HIRE AND DEVELOP THE RIGHT PEOPLE, LOCALLY AND GLOBALLY, STIMULATING PERSONAL GROWTH AND SELF-DEVELOPMENT WITHIN AN INFORMAL ATMOSPHERE. WE OFFER A MARKET COMPETITIVE COMPENSATION PACKAGE.\n\nABOUT DP WORLD\n\nTRADE IS THE LIFEBLOOD OF THE GLOBAL ECONOMY, CREATING OPPORTUNITIES AND IMPROVING THE QUALITY OF LIFE FOR PEOPLE AROUND THE WORLD. DP WORLD EXISTS TO MAKE THE WORLD’S TRADE FLOW BETTER, CHANGING WHAT’S POSSIBLE FOR THE CUSTOMERS AND COMMUNITIES WE SERVE GLOBALLY.\n\nWITH A DEDICATED, DIVERSE AND PROFESSIONAL TEAM OF MORE THAN 103,000 EMPLOYEES SPANNING 75 COUNTRIES ON SIX CONTINENTS, DP WORLD IS PUSHING TRADE FURTHER AND FASTER TOWARDS A SEAMLESS SUPPLY CHAIN THAT’S FIT FOR THE FUTURE.\n\nWE’RE RAPIDLY TRANSFORMING AND INTEGRATING OUR BUSINESSES -- PORTS AND TERMINALS, MARINE SERVICES, LOGISTICS AND TECHNOLOGY – AND UNITING OUR GLOBAL INFRASTRUCTURE WITH LOCAL EXPERTISE TO CREATE STRONGER, MORE EFFICIENT END-TO-END SUPPLY CHAIN SOLUTIONS THAT CAN CHANGE THE WAY THE WORLD TRADES. THE DP WORLD FAMILY COMPRISES OF SYNCREON, IMPERIAL AND P&O.\n\nWHAT'S MORE, WE'RE RESHAPING THE FUTURE BY INVESTING IN INNOVATION. FROM INTELLIGENT DELIVERY SYSTEMS TO AUTOMATED WAREHOUSE STACKING, WE’RE AT THE CUTTING EDGE OF DISRUPTIVE TECHNOLOGY, PUSHING THE SECTOR TOWARDS BETTER WAYS TO TRADE, MINIMISING DISRUPTIONS FROM THE FACTORY FLOOR TO THE CUSTOMER’S DOOR.\n\nWE MAKE TRADE FLOW\n\nTO CHANGE WHAT'S POSSIBLE FOR EVERYONE\n\nDP WORLD IS COMMITTED TO THE PRINCIPLES OF EQUAL EMPLOYMENT OPPORTUNITY (EEO). WE STRONGLY BELIEVE THAT EMPLOYING A DIVERSE WORKFORCE IS CENTRAL TO OUR SUCCESS AND WE MAKE RECRUITING DECISIONS BASED ON YOUR EXPERIENCE AND SKILLS. WE BELIEVE THAT EMPLOYEES ARE HAPPIEST WHEN THEY’RE EMPOWERED TO BE THEIR TRUE, AUTHENTIC SELVES. SO, PLEASE COME AS YOU ARE. WE CAN’T WAIT TO MEET YOU.\n\nBY SUBMITTING YOUR RESUME AND APPLICATION INFORMATION, YOU AUTHORIZE DP WORLD TO TRANSMIT AND STORE YOUR INFORMATION IN THE WORLD-WIDE RECRUITMENT DATABASE, AND TO CIRCULATE THAT INFORMATION AS NECESSARY FOR THE PURPOSE OF EVALUATING YOUR QUALIFICATIONS FOR THIS OR OTHER JOB VACANCIES.",
    "job_skill_set": [
      "business development",
      "sales management",
      "project management",
      "customer relationship management",
      "negotiation",
      "territory planning",
      "lead generation",
      "financial analysis",
      "leadership",
      "communication",
      "strategic thinking",
      "team collaboration",
      "problem solving",
      "adaptability",
      "customer focus",
      "autonomy",
      "interpersonal skills",
      "contract logistics",
      "ecommerce"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "autonomy",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "contract",
      "customer",
      "development",
      "director",
      "ecommerce",
      "financial",
      "focus",
      "generation",
      "interpersonal",
      "lead",
      "leadership",
      "logistics",
      "management",
      "negotiation",
      "planning",
      "problem",
      "project",
      "relationship",
      "sales",
      "senior",
      "skills",
      "solving",
      "strategic",
      "team",
      "territory",
      "thinking"
    ]
  },
  {
    "job_id": "3887890716",
    "job_title": "Director of Business Development",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "SMITHGROUP IS AN AWARD-WINNING, INTEGRATED DESIGN FIRM THAT BLENDS RESEARCH, DATA AND TECHNOLOGY WITH INNOVATION AND A CREATIVE SPIRIT TO DELIVER RESILIENT, INCLUSIVE SPACES THAT SOLVE OUR CLIENTS' GREATEST CHALLENGES. OUR TEAMS CREATE EXCEPTIONAL DESIGN SOLUTIONS FOR HEALTHCARE, SCIENCE AND TECHNOLOGY, WORKPLACE, MIXED USE, HIGHER EDUCATION, CULTURAL, WATERFRONT, PARKS AND OPEN SPACES, AND URBAN ENVIRONMENTS. WE ARE LOOKING FOR PASSIONATE PROBLEM SOLVERS WHO WANT TO ELEVATE DESIGN, PUSH BOUNDARIES AND MOVE US CLOSER TO A CARBON-FREE FUTURE. CARE TO JOIN US?\n\nTHE HOUSTON OFFICE OF SMITHGROUP IS LOOKING FOR A DIRECTOR OF BUSINESS DEVELOPMENT TO JOIN OUR TEAM.\n\nWORKING WITH US, YOU WILL:\n\nLEAD THE DEVELOPMENT OF BUSINESS DEVELOPMENT STRATEGY BY WORKING ALONGSIDE KEY PARTNERS.MONITOR INDUSTRY TRENDS AND COLLECT MARKET INTELLIGENCE ON CLIENTS AND COMPETITORS BY MONITORING WEBSITES, COLLATERAL PRESENTATIONS, TRADE JOURNALS AND DISCUSSION LISTS.FACILITATE STRATEGIC PARTNER COLLABORATIONS INCLUDING PRE-POSITIONING SESSIONS AND STRATEGIC ALLIANCES WITH PARTNERS LIKE CONTRACTORS, DEVELOPERS, ORGANIZATIONS, OR OTHER KEY CONSULTANTS.PERFORM MARKET TRENDS ANALYSIS AND LEAD COORDINATION OF INTRODUCTORY MEETINGS WITH PROSPECTIVE CLIENTS.ATTEND INDUSTRY EVENTS FOR NETWORKING AND RELATIONSHIP BUILDING.PARTICIPATE IN COMMITTEES OR OTHER ACTIVE ROLES IN EXTERNAL INDUSTRY-RELATED ORGANIZATIONS.ACTIVELY RESEARCH PROJECT OPPORTUNITIES FOR ASSOCIATED STUDIOS THROUGH NETWORKING, PERSONAL RELATIONSHIPS, COLD CALLS, READING OF PUBLICATIONS, ATTENDING COMMUNITY EVENTS, AND PARTICIPATING IN INDUSTRY ORGANIZATIONS.BUILD AND IMPLEMENT CAPTURE PLANS FOR KEY TARGET CLIENTS.COLLABORATE WITH MANAGEMENT AND TECHNICAL STAFF TO IDENTIFY PROJECT OPPORTUNITIES, STRENGTHEN CURRENT BUSINESS TIES AND CLIENT RELATIONSHIPS, AND FORMULATE BUSINESS DEVELOPMENT STRATEGIES TO EXPAND SMITHGROUP MARKET SECTORS.CONDUCT AND ANALYZE DEBRIEF SURVEYS THROUGHOUT THE PURSUIT AND PROJECT PROCESS.UPDATE AND MAINTAIN LEAD TRACKING DATABASES WITH RELEVANT INFORMATION ON TARGETED CLIENTS, CONTACTS, AND OPPORTUNITIES.DEVELOP PROJECT PURSUIT STRATEGIES AND POSITION SMITHGROUP FOR PROJECTS BEFORE REQUESTS FOR PROPOSALS ARE ISSUED.ACTIVELY ENGAGE IN PROPOSAL STRATEGY DEVELOPMENT AND WRITE KEY PROPOSAL SECTIONS FOR TOP PURSUITS.LEAD AND DEVELOP LOCAL EVENTS INCLUDING CLIENT OUTREACH, RELATIONSHIP BUILDING AT EVENTS, AND POST-EVENT FOLLOW UP.BUILD AND IMPLEMENT A STRATEGY FOR CONFERENCE ENGAGEMENT, INDUSTRY/TRADE ORGANIZATIONS, AND MEMBERSHIPS/SPONSORSHIPS.\n\nAN IDEAL CANDIDATE HAS:\n\nBACHELOR’S DEGREE IN MARKETING, COMMUNICATIONS, JOURNALISM, PUBLIC RELATIONS OR RELATED FIELD, PREFERRED.MINIMUM OF 7 YEARS OF EXPERIENCE IN BUSINESS DEVELOPMENT, 3+ IN AEC INDUSTRY.PREFERRED MARKET EXPIERENCE IN HIGHER EDUCATION, HEATH AND SCIENCE & TECHNOLOGY. THE ABILITY TO THINK CREATIVELY AND STRATEGICALLY.STRONG VERBAL, WRITTEN, AND PRESENTATION SKILLS FOR EFFECTIVE PRESENTATIONS AND INTERACTIONS WITH INTERNAL/EXTERNAL CLIENTS.PROFICIENCY IN MICROSOFT OFFICE SUITE AND MICROSOFT TEAMS AS WELL AS EXPERIENCE USING DELTEK VISION.\n\nSMITHGROUP'S COMPETITIVE COMPENSATION AND BENEFIT PACKAGE IS DESIGNED TO MEET THE NEEDS OF A DIVERSE STAFF. IT INCLUDES FLEXIBLE SCHEDULING, A HYBRID WORK ENVIRONMENT, 401(K), PARENTAL LEAVE, WELLBEING RESOURCES, PTO IMMEDIATELY AVAILABLE TO NEW HIRES, PLUS 15 EXTRA FRIDAYS OFF - ON TOP OF HOLIDAYS. JOIN US AND SEE FIRST-HAND HOW THESE AND OTHER PROGRAMS - LIKE ONE-ON-ONE CAREER COACHING AND PROFESSIONAL DEVELOPMENT OPPORTUNITIES - BUILD CULTURE, ENHANCE COLLABORATION AND YIELD RICHER, MORE INCLUSIVE SOLUTIONS.\n\nIF YOU ARE NOT SURE THAT YOU MEET ALL OF THE SUGGESTED QUALIFICATIONS DESCRIBED ABOVE, PLEASE DON'T LEAVE THIS PAGE. YOUR TALENTS AND ATTRIBUTES COULD BE JUST WHAT WE'RE LOOKING FOR - AND WE STRONGLY ENCOURAGE YOU TO APPLY. IF YOU NEED ADDITIONAL ACCOMMODATIONS TO COMPLETE THE APPLICATION PROCESS, PLEASE CONTACT CAREERS@SMITHGROUP.COM",
    "job_skill_set": [
      "business development strategy",
      "market analysis",
      "Microsoft Office Suite",
      "relationship building",
      "data analysis",
      "creativity",
      "strategic thinking",
      "communication",
      "presentation skills",
      "problem solving",
      "collaboration",
      "proposal writing",
      "Microsoft Teams",
      "Deltek Vision",
      "networking"
    ],
    "short_keywords": [
      "analysis",
      "building",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "creativity",
      "data",
      "deltek",
      "development",
      "director",
      "market",
      "microsoft",
      "networking",
      "of",
      "office",
      "presentation",
      "problem",
      "proposal",
      "relationship",
      "skills",
      "solving",
      "strategic",
      "strategy",
      "suite",
      "teams",
      "thinking",
      "vision",
      "writing"
    ]
  },
  {
    "job_id": "3901345859",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "AS OUR BUSINESS DEVELOPMENT MANAGER YOU WILL SERVE AS THE MAIN POINT OF CONTACT BETWEEN TCI AND US CUSTOMERS TO INFLUENCE AND DRIVE NEW PRODUCT DEVELOPMENTS. THIS ROLE REQUIRES SOMEONE WHO UNDERSTANDS THE ODM SKIN-CARE OR NUTRACEUTICALS INDUSTRY AND HAS OUTSTANDING SALES SKILLS - CONNECTING, COMMUNICATING, PROSPECTING, STORYTELLING, RELATIONSHIP BUILDING AND NEGOTIATION. THE DAILY JOB ROUTINE INCLUDES CLIENT ANALYSIS, COMPETITIVE ANALYSIS, CONCEPT DISCUSSION, CONCEPT MODIFICATION, PIPELINE MANAGEMENT, CUSTOMER RELATIONSHIP MANAGEMENT, PURCHASE ORDER MANAGEMENT AND BUSINESS OPPORTUNITY MANAGEMENT.\nWE ARE LOOKING FOR CONSULTATIVE SELLERS WHO ARE SUCCESSFUL IN MANAGING AND EXECUTING ON 7-FIGURE TRANSACTIONS WITH BRANDS WHO SELL THROUGH MULTIPLE MEDIUMS I.E., VIRTUAL, BRICK-AND-MORTAR, DIRECT TO CONSUMER OR DISTRIBUTION. BECAUSE WE ARE A COMPANY MADE OF GLOBAL TEAM PLAYERS, ENRICHED WITH DIVERSE PERSPECTIVES AND MULTI-DISCIPLINARY BACKGROUNDS, WE ARE LOOKING FOR SOMEONE WHO CAN PARTNER WELL WITH AN INTERNATIONAL ECOSYSTEM.\n\nRESPONSIBILITIESCREATE NEW BUSINESS OPPORTUNITIES AND EXPAND BUSINESS WITH EXISTING CUSTOMERS.MANAGE BETWEEN 20-30 CLIENTS ACROSS THE US.MAINTAIN OVER 200 EPISODES OF BUSINESS ACTIVITIES A MONTH.IDENTIFY & ANALYZE CUSTOMER/COUNTRY/MARKET-SPECIFIC OPPORTUNITIES.LEAD AND CONTRIBUTE TO RFP/RFQ RESPONSES AND CONTRACT NEGOTIATIONS.DELIVER PRESENTATIONS AND DISCUSS NEW PRODUCT IDEAS WITH CUSTOMERS.PARTNER WITH PROJECT MANAGERS AND R&D TEAMS TO UNDERSTAND NEW PRODUCTS/TECHNOLOGIES, FACILITATE THE DEVELOPMENT OF PROJECTS AND CREATE NEW BUSINESS OPPORTUNITIES.GATHER MARKET AND CLIENT FEEDBACK FOR MANAGEMENT AND INTERNAL TEAMS.\nMUST HAVE5+ YEARS OF EXPERIENCE IN THE NUTRACEUTICALS OR COSMECEUTICALS INDUSTRY3+ YEARS IN B2B SALES ROLEEXPERIENCE IN PITCHING PRODUCTS/SERVICES, ESPECIALLY NASCENT CONCEPTS, TO CUSTOMERS.WILLINGNESS TO TRAVEL TO CLIENTSDEMONSTRATED CAPABILITY IN TAKING END-TO-END OWNERSHIP TO ACHIEVE AGGRESSIVE SALES GOALS.CONSISTENT AND SUCCESSFUL TRACK RECORD OF HITTING GOALS.A BACHELOR’S DEGREE IN BIOLOGY, FOOD SCIENCE, OR NUTRITION.STRONG BUSINESS ACUMEN.\nNICE TO HAVE2 YEARS OF SALES EXPERIENCE IN THE PRIVATE LABEL/CONTRACTED MANUFACTURER SERVICE OF COSMECEUTICAL/PERSONAL CARE INDUSTRY.EXPERIENCE CLOSING UPWARDS OF 7-FIGURE DEALS.\nBENEFITSMEDICAL, DENTAL, VISION401K WITH COMPANY MATCHPTOTIME OFF TO VOLUNTEER IN THE COMMUNITYCOMPANY-SPONSORED ACTIVITIESEDUCATION AND CERTIFICATION REIMBURSEMENTSLEADERSHIP DEVELOPMENT PROGRAMS\nTCI VALUESHERE AT TCI, WE VALUE WORKING TOGETHER AS A TEAM. WE BELIEVE IN OPEN AND HONEST COMMUNICATION. WE CELEBRATE PEOPLE OF ALL BACKGROUNDS AND STRIVE TO CULTIVATE AN ENVIRONMENT WHERE YOU CAN BRING YOUR AUTHENTIC SELF. TO UPHOLD THESE VALUES, WE HAVE REGULAR CULTURAL CELEBRATIONS, COMMUNITY OUTREACH OPPORTUNITIES, LEADERSHIP DEVELOPMENT, AND ENVIRONMENTAL SUSTAINABILITY PROGRAMS. \nREMOTE WORK AVAILABLE IN THE FOLLOWING LOCATIONS: NEW YORK, NEW JERSEY, CALIFORNIA",
    "job_skill_set": [
      "business development",
      "presentation skills",
      "communication",
      "relationship building",
      "teamwork",
      "problem solving",
      "leadership",
      "sales",
      "client analysis",
      "competitive analysis",
      "pipeline management",
      "customer relationship management",
      "purchase order management",
      "contract negotiation",
      "market analysis",
      "product development",
      "b2b sales",
      "nutraceuticals industry knowledge",
      "cosmeceuticals industry knowledge",
      "project management",
      "storytelling",
      "negotiation",
      "consultative selling",
      "adaptability",
      "cultural awareness"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "awareness",
      "b2b",
      "building",
      "business",
      "businessdevelopment",
      "client",
      "communication",
      "competitive",
      "consultative",
      "contract",
      "cosmeceuticals",
      "cultural",
      "customer",
      "development",
      "industry",
      "knowledge",
      "leadership",
      "management",
      "manager",
      "market",
      "negotiation",
      "nutraceuticals",
      "order",
      "pipeline",
      "presentation",
      "problem",
      "product",
      "project",
      "purchase",
      "relationship",
      "sales",
      "selling",
      "skills",
      "solving",
      "storytelling",
      "teamwork"
    ]
  },
  {
    "job_id": "3904517018",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "JOB DETAILS\n\nLEVEL\n\nMANAGEMENT\n\nJOB LOCATION\n\nMELBOURNE, FL\n\nPOSITION TYPE\n\nFULL TIME\n\nDESCRIPTION\n\nWE ARE LOOKING FOR A BUSINESS DEVELOPMENT REPRESENTATIVE TO JOIN TLC ENGINEERING SOLUTIONS (TLC) IN MELBOURNE, FL . TLC HAS AN AMAZING CULTURE THAT FOCUSES ON OUR EMPLOYEES’ CAREER DEVELOPMENT AND OPPORTUNITIES TO WORK ON SPECTACULAR PROJECTS WE ARE PROUD OF - MANY OF WHICH YOU WILL KNOW! VISIT OUR WEBSITE TO LEARN MORE: .\n\nTHE BUSINESS DEVELOPMENT REPRESENTATIVE PROVIDES THE NECESSARY TECHNICAL LEADERSHIP, MENTORING AND GUIDANCE TO THE STAFF TO ASSURE TOTAL QUALITY OF ALL MARKETING EFFORTS, APPROPRIATE FEE DEVELOPMENT AND CLIENT CONTACT. THE BUSINESS DEVELOPMENT REP ASSISTS REGIONAL/DIVISIONAL LEADERSHIP IN MEETING MARKETING GOALS AND CLIENT EXPECTATIONS.\n\nQUALIFICATIONS, KNOWLEDGE AND EXPERIENCE\n\nCOLLEGE DEGREE IN AREA OF EXPERTISE PREFERRED 8+ YEARS OF EXPERIENCE IN A/E ENVIRONMENT  CPSM PREFERRED  STRONG COMPUTER SKILLS AND SOFTWARE PACKAGE KNOWLEDGE  DEMONSTRATED SUCCESS IN MARKETING EFFORTS  EXCELLENT ORAL AND WRITTEN COMMUNICATION SKILLS \n\nIF THIS SOUNDS LIKE THE ROLE FOR YOU AND YOU'RE READY TO JOIN AN AMAZING TEAM, PLEASE APPLY!\n\nWHY CHOOSE TLC?\n\nWORKING AT TLC ENGINEERING SOLUTIONS\n\nTLC ENGINEERING SOLUTIONS (TLC) IS CONSISTENTLY RANKED AMONG THE LARGEST MULTIDISCIPLINE FIRMS IN THE COUNTRY FOR THE BUILT ENVIRONMENT. WE HAVE OVER 450+ HIGHLY QUALIFIED PROFESSIONALS IN 19 OFFICES AND HAVE GROWN A BIT SINCE OUR START IN 1955! WE KNOW THAT OUR TEAM IS OUR SUCCESS, AND THEIR GROWTH THIS YEAR HAS LANDED TLC AS A HOT 2023 FIRM. EVEN MORE IMPORTANTLY, TLC WAS NAMED AS ONE OF THE “BEST FIRMS” BASED UPON THE FEEDBACK OF OUR STAFF FOR SIX YEARS RUNNING! THANK YOU!\n\nTAKE A LOOK AT SOME OF OUR AMAZING PROJECTS AS YOU WOULD HAVE AN OPPORTUNITY TO WORK ON PROJECTS LIKE THESE!\n\nIN ADDITION TO A REWARDING CAREER, COMPETITIVE SALARY AND BONUS/INCENTIVE PROGRAMS, TLC PROVIDES ITS EMPLOYEES WITH A BENEFITS PACKAGE THAT IS DESIGNED WITH THE EMPLOYEE IN MIND. A FEW OF THESE INCLUDE FLEXIBLE SCHEDULES, WFH OPTIONS, 401K MATCH, MERIT-BASED INCENTIVE BONUS, AND 9 HOLIDAYS. WE ARE JUST CERTIFIED, AND ALONG WITH OUR ANNUAL ESG GOALS WHICH CHALLENGE US TO BE THE BEST WE CAN BE FOR OUR TEAMS AND COMMUNITIES.\n\n OUTSIDE RECRUITERS MAY NOT CONTACT ANY TLC ENGINEERING SOLUTIONS (TLC) EMPLOYEE DIRECTLY TO PRESENT CANDIDATES. PLEASE CONTACT TLC CORPORATE RECRUITING OR TLC DIRECTOR OF HUMAN RESOURCES TO EXECUTE A CONTRACT FOR PLACEMENT OF CANDIDATES. TLC WILL NOT PAY A FEE FOR ANY PLACEMENT RESULTING FROM THE RECEIPT OF AN UNSOLICITED RESUME WITHOUT A PRIOR SIGNED AGREEMENT. \n\nTLC IS AN EQUAL OPPORTUNITY, AFFIRMATIVE ACTION EMPLOYER, DEDICATED TO WORKFORCE DIVERSITY. EOE/M/F/IWD/V – MINORITIES, WOMEN, INDIVIDUALS WITH DISABILITIES AND VETERANS ARE ENCOURAGED TO APPLY. TLC PARTICIPATES IN E-VERIFY. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, VETERAN STATUS, DISABILITY, AGE AND OTHER CLASSIFICATIONS COVERED UNDER FEDERAL, STATE OR LOCAL LAWS. TLC PARTICIPATES IN E-VERIFY.",
    "job_skill_set": [
      "business development",
      "marketing",
      "client contact",
      "computer skills",
      "software knowledge",
      "project management",
      "communication",
      "mentoring",
      "teamwork",
      "problem solving",
      "career development",
      "technical leadership",
      "CPSM"
    ],
    "short_keywords": [
      "business",
      "businessdevelopment",
      "career",
      "client",
      "communication",
      "computer",
      "contact",
      "cpsm",
      "development",
      "knowledge",
      "leadership",
      "management",
      "marketing",
      "mentoring",
      "problem",
      "project",
      "representative",
      "skills",
      "software",
      "solving",
      "teamwork",
      "technical"
    ]
  },
  {
    "job_id": "3894295243",
    "job_title": "National Enterprise Business Development Director",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "WE PROVIDE SOLUTIONS. PATIENTS AND PHYSICIANS RELY ON OUR DIAGNOSTIC TESTING, INFORMATION, AND SERVICES TO HELP THEM MAKE BETTER HEALTHCARE DECISIONS. THESE ARE OFTEN SERIOUS DECISIONS WITH FAR REACHING CONSEQUENCES, AND REQUIRE SENSITIVITY, TACT, AND A CLEAR DEDICATION TO SERVICE. IT’S ABOUT PROVIDING CLARITY AND HOPE. PATIENTS AND PHYSICIANS RELY ON OUR DIAGNOSTIC TESTING, INFORMATION, AND SERVICES TO HELP THEM MAKE BETTER HEALTHCARE DECISIONS. THESE ARE OFTEN SERIOUS DECISIONS WITH FAR REACHING CONSEQUENCES, AND REQUIRE SENSITIVITY, TACT, AND A CLEAR DEDICATION TO SERVICE. IT’S ABOUT PROVIDING CLARITY AND HOPE.\nAS AN ENTERPRISE BUSINESS DEVELOPMENT DIRECTOR, YOU WILL WORK FOR THE WORLD LEADER IN THE INDUSTRY, WITH A CAREER WHERE YOU CAN EXPAND YOUR SKILLS AND KNOWLEDGE. YOU’LL HAVE A ROLE WHERE YOU CAN ACT WITH PROFESSIONALISM, YOU CAN INSPIRE COLLEAGUES, AND YOU CAN CARE ABOUT THE WORK WE DO AND THE PEOPLE WE SERVE.  THE ENTERPRISE BUSINESS DEVELOPMENT DIRECTOR (BDD) REPORTS INTO THE VP, EMERGING MARKETS AND ENTERPRISE ACCOUNTS. THEIR MISSION IS TO UNDERSTAND THE OVERARCHING NEEDS OF COMPLEX NATIONAL ORGANIZATIONS, HELP DEFINE NOVEL BUSINESS MODELS, AND DESIGN MULTI-DISCIPLINARY BUSINESS SOLUTIONS. THE BDD WILL BE RESPONSIBLE FOR CALLING ON THE LARGEST CALLING ON AGGREGATORS AND CONSOLIDATORS. THE BDD WILL WORK CROSS REGIONALLY AND CROSS-FUNCTIONALLY. THE BDD WILL SET STRATEGY FOR KEY CUSTOMERS AND COORDINATE WITH CROSS FUNCTIONAL TEAMS TO EXECUTE TACTICAL PLANS TO DRIVE REVENUE AND GROWTH. SUCCESS WILL BE QUANTIFIED THROUGH OPPORTUNITIES IDENTIFIED TO LEVERAGE NATIONAL SCALE, INCREASE RELATIONSHIPS WITH PRIVATE-EQUITY PARTNERSHIPS, REVENUE GROWTH, NEW BUSINESS REVENUE STREAMS, AND STICKINESS THROUGH PROGRAMS DESIGNED TO INCREASE ATTRITION IMMUNITY. THIS IS A NATIONAL POSITION WITH REGULAR TRAVEL (50%). \nDUTIES AND RESPONSIBILITIES:\nGENERATE REVENUE THROUGH UNDERSTANDING STRATEGIC CLIENT NEEDS AND PROVIDING SOLUTIONS.ESTABLISH AND STRENGTHEN RELATIONSHIPS INCLUDING LARGE MEETING/CORPORATE ENGAGEMENT PLANNING, KEY OPINION LEADER MAPPING, AND GUIDELINES COMMITTEE MEMBERS.COLLABORATION WITH ENTERPRISE & REGIONAL SALES TEAMS.COLLABORATION WITH QUEST COMMERCIAL SALES TEAMS AS NEEDED INCLUDING; CARDIO, ENTERPRISE, WOMEN’S HEALTH, LARGE HEALTH SYSTEMS OUTREACH, ACO’S TO ENSURE MULTI-MODAL REVENUE STREAMS ALIGNED WITH CLIENT NEEDSCONDUCT CLIENT NEEDS ANALYSIS AND DEVELOP AND IMPLEMENT MULTI-DISCIPLINE SOLUTIONS IN COLLABORATION WITH ALL FACETS OF QUEST DIAGNOSTICS.BUILDING VALUE-BASED CARE OFFERINGS.BDD’S WILL ADHERE TO ESTABLISHED BUSINESS ACUMEN METRICS: CALL FREQUENCY, PIPELINE SUFFICIENCY, PRODUCTIVITY, AND CLOSE METRICS. \n\nREQUIRED WORK EXPERIENCE: MINIMUM OF 7 YEARS OF SUCCESSFUL HEALTHCARE, HEALTHCARE/PRIVATE EQUITY, AND BUSINESS DEVELOPMENT EXPERIENCE. HIGH-LEVEL ACCOUNT MANAGEMENT EXPERIENCE.C-SUITE AND DIRECTOR LEVEL NETWORK IS ESSENTIAL.CONTRACT & NEGOTIATION EXPERIENCE ESSENTIAL.\nPREFERRED WORK EXPERIENCE:EXPERIENCE NEGOTIATING WITH AGGREGATORS, CONSOLIDATORS, PROVIDERS, AND PRIVATE EQUITY.\nKNOWLEDGE: DEEP UNDERSTANDING OF DIAGNOSTICS, CAPITAL, AND SUPPLY CHAIN/LOGISTICS MARKET KNOWLEDGE AND RELEVANT HIGH LEVEL RELATIONSHIPS ESSENTIAL.FUNCTIONAL UNDERSTANDING OF HEALTH PLAN ECONOMICS AND INTEGRATIONS.BUSINESS AND FINANCIAL ACUMEN.ENTREPRENEURIAL STRATEGIES.SALES PROCESSES.NATIONAL STRATEGIC ACCOUNT MANAGEMENT AND SOLUTION SELLING IS REQUIRED.ACCOUNTABLE CARE ORGANIZATION; GPO. EDUCATION:BACHELOR’S DEGREE REQUIREDMASTER’S DEGREE PREFERRED \n\nBENEFITS INFORMATION: WE ARE PROUD TO OFFER BEST-IN-CLASS BENEFITS AND PROGRAMS TO SUPPORT EMPLOYEES AND THEIR FAMILIES IN LIVING HEALTHY, HAPPY LIVES. OUR PAY AND BENEFIT PLANS HAVE BEEN DESIGNED TO PROMOTE EMPLOYEE HEALTH IN ALL RESPECTS – PHYSICAL, FINANCIAL, AND DEVELOPMENTAL. DEPENDING ON WHETHER IT IS A PART-TIME OR FULL-TIME POSITION, SOME OF THE BENEFITS OFFERED MAY INCLUDE:MEDICAL/PRESCRIPTION DRUGSDENTALVISIONFLEXIBLE SPENDING ACCOUNTS (FSAS)SUPPLEMENTAL HEALTH PLANS401(K) PLAN – COMPANY MATCH DOLLAR-FOR-DOLLAR UP TO 5%EMPLOYEE STOCK PURCHASE PLAN (ESPP)SUPPLEMENTAL LIFE INSURANCEDEPENDENT LIFE INSURANCESHORT- AND LONG-TERM DISABILITY BUY-UPBLUEPRINT FOR WELLNESSEMOTIONAL WELL-BEING RESOURCESEDUCATIONAL ASSISTANCEPAID TIME OFF / HEALTH TIMEVARIABLE COMPENSATION PLANSSALES INCENTIVE PLANS\n\nWHILE WE APPRECIATE AND VALUE OUR STAFFING PARTNERS, WE DO NOT ACCEPT UNSOLICITED RESUMES FROM AGENCIES. QUEST WILL NOT BE RESPONSIBLE FOR PAYING AGENCY FEES FOR ANY INDIVIDUAL AS TO WHOM AN AGENCY HAS SENT AN UNSOLICITED RESUME.",
    "job_skill_set": [
      "business development",
      "account management",
      "financial acumen",
      "sales processes",
      "strategic account management",
      "relationship building",
      "collaboration",
      "communication",
      "problem solving",
      "strategic thinking",
      "leadership",
      "dedication to service",
      "contract negotiation",
      "healthcare knowledge",
      "diagnostics knowledge",
      "supply chain logistics",
      "entrepreneurial strategies",
      "sensitivity",
      "tact"
    ],
    "short_keywords": [
      "account",
      "acumen",
      "building",
      "business",
      "businessdevelopment",
      "chain",
      "collaboration",
      "communication",
      "contract",
      "dedication",
      "development",
      "diagnostics",
      "director",
      "enterprise",
      "entrepreneurial",
      "financial",
      "healthcare",
      "knowledge",
      "leadership",
      "logistics",
      "management",
      "national",
      "negotiation",
      "problem",
      "processes",
      "relationship",
      "sales",
      "sensitivity",
      "service",
      "solving",
      "strategic",
      "strategies",
      "supply",
      "tact",
      "thinking",
      "to"
    ]
  },
  {
    "job_id": "3901634906",
    "job_title": "Business Development & Community Relations Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "APX CONSTRUCTION GROUP IS SEEKING CANDIDATES WITH PRIOR EXPERIENCE IN DEVELOPING KEY RELATIONSHIPS, DRIVING LARGE PROJECTS AND GENERATING SALES GROWTH WITH CONSTRUCTION INDUSTRY.\nTHE SIOUX FALLS MARKET IS A HUB OF OPPORTUNITY FOR AN AMBITIOUS PROFESSIONAL BUSINESS DEVELOPMENT MANAGER, IF YOU'RE A RESULTS-ORIENTED PROFESSIONAL WHO THRIVES IN A FAST-PACED, DYNAMIC WORK ENVIRONMENT, A CAREER AS A BUSINESS DEVELOPMENT & COMMUNITY RELATIONS MANAGER WITH APX CONSTRUCTION GROUP MIGHT BE YOUR TICKET TO SUCCESS. YOUR KEY RESPONSIBILITIES WILL INVOLVE IDENTIFYING NEW BUSINESS OPPORTUNITIES, DEVELOPING RELATIONSHIPS WITH NEW AND EXISTING CLIENTS AND PARTNERS. WITH YOUR EXPERTISE IN MARKET TRENDS AND COMPETITIVE ANALYSIS, YOU'LL PLAY A CRITICAL ROLE IN EXPANDING APX'S BRAND, BUSINESS AND COMMUNITY RELATIONS. AT APX CONSTRUCTION GROUP, THE GOAL OF SALES AND MARKETING IS TO RAISE THE KIND OF AWARENESS THAT CAN DRIVE SALES FOR OUR COMPANY. FROM DAY ONE, THIS INDIVIDUAL WILL EMBRACE AND CARRY OUT EXISTING MARKETING PROGRAMS, WHILE ASSISTING WITH THE DEVELOPMENT OF NEW INITIATIVES ALIGNED WITH COMPANY AND CLIENT GOALS. JOINING OUR TEAM IN SIOUX FALLS MEANS YOU'LL HAVE ACCESS TO A VIBRANT BUSINESS COMMUNITY, COUNTLESS NETWORKING EVENTS, AND A VAST POOL OF TALENT TO COLLABORATE WITH. \nOBJECTIVES OF THE ROLE\n? ACTIVELY SEEK OUT NEW BUSINESS OPPORTUNITIES, LEVERAGING DIVERSE CHANNELS SUCH AS COLD OUTREACH, NETWORKING PLATFORMS, INDUSTRY AND COMMUNITY EVENTS TO UNCOVER UNTAPPED POTENTIAL.? MAINTAIN UP-TO-DATE RECORDS OF ALL INTERACTIONS IN OUR CRM SYSTEM. ENGAGE LEADS AT VARIOUS STAGES OF THE SALES PIPELINE, ADDRESSING QUERIES, OBJECTIONS, AND OBSTACLES TO MOVE THEM TOWARDS CONVERSION.? DEVELOP, EXECUTE, AND OVERSEE A BUSINESS STRATEGY THAT PRIORITIZES GROWTH AND POSITIVE CUSTOMER RATINGS.? CONDUCT HIGH-LEVER INDUSTRY RESEARCH TO DEVELOP EFFECTIVE SALES SOLUTIONS.? UTILIZE VARIOUS COMMUNICATION AVENUES (PHONE, EMAIL, LINKEDIN, ETC.) TO BUILD AWARENESS AND CONNECT WITH POTENTIAL PROSPECTS. \n THIS JOB POSTING IS ONLY A SUMMARY OF THE TYPICAL FUNCTIONS OF THE JOB, NOT AN EXHAUSTIVE OR COMPREHENSIVE LIST OF ALL POSSIBLE RESPONSIBILITIES, TASKS, AND DUTIES. \nAPX CONSTRUCTION GROUP PROVIDES EQUAL EMPLOYMENT OPPORTUNITIES TO ALL EMPLOYEES AND APPLICANTS FOR EMPLOYMENT AND PROHIBITS DISCRIMINATION AND HARASSMENT OF ANY TYPE WITHOUT REGARD TO RACE, COLOR, RELIGION, AGE, SEX, NATIONAL ORIGIN, DISABILITY STATUS, GENETICS, PROTECTED VETERAN STATUS, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, OR ANY OTHER CHARACTERISTIC PROTECTED BY FEDERAL, STATE, OR LOCAL LAWS. THIS POLICY APPLIES TO ALL TERMS AND CONDITIONS OF EMPLOYMENT, INCLUDING RECRUITING, HIRING, PLACEMENT, PROMOTION, TERMINATION, LAYOFF, RECALL, TRANSFER, LEAVES OF ABSENCE, COMPENSATION, AND TRAINING.",
    "job_skill_set": [
      "CRM systems",
      "sales strategy development",
      "market analysis",
      "business development",
      "project management",
      "communication tools (phone, email, LinkedIn)",
      "relationship building",
      "results-oriented",
      "networking",
      "problem solving",
      "adaptability",
      "team collaboration"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "building",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "community",
      "crm",
      "development",
      "email",
      "linkedin",
      "management",
      "manager",
      "market",
      "networking",
      "phone",
      "problem",
      "project",
      "relations",
      "relationship",
      "resultsoriented",
      "sales",
      "solving",
      "strategy",
      "systems",
      "team",
      "tools"
    ]
  },
  {
    "job_id": "3904087687",
    "job_title": "Director of Business Development",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "🚀 JOIN OUR TEAM: DIRECTOR OF BUSINESS DEVELOPMENT🏭\nLOCATION: PALO ALTO, CASALARY: $220K + BONUS + STOCKS\nARE YOU PASSIONATE ABOUT DRIVING INNOVATION IN INDUSTRIAL TECHNOLOGY? A LEADING TECHNOLOGY COMPANY SPECIALIZING IN LIDAR SYSTEMS FOR ADAS, AUTONOMOUS VEHICLES, AND ROBOTICS APPLICATIONS IS SEEKING AN EXPERIENCED AND GOAL-DRIVEN DIRECTOR OF BUSINESS DEVELOPMENT TO SUPPORT OUR RAPIDLY EXPANDING CUSTOMER BASE IN NORTH AMERICA.\nRESPONSIBILITIES:\nENGAGE IN CONSULTATIVE, RELATIONSHIP-DRIVEN SALES PROCESSES WITH A FOCUS ON 20-30 PROSPECTS/ACCOUNTS, DRIVING AGGRESSIVE SALES GOALS.DEVELOP A ROBUST PIPELINE OF NEW BUSINESS OPPORTUNITIES THROUGH DIRECT OR INDIRECT CUSTOMER CONTACT AND PROSPECTING.QUALIFY INCOMING LEADS FOR THE NORTH AMERICA REGION AND MAINTAIN CUSTOMER INFORMATION IN THE CRM DATABASE.MANAGE EXISTING CUSTOMER RELATIONSHIPS AND DEVELOP PROACTIVE SALES STRATEGIES TO INCREASE REVENUE.COORDINATE LOGISTICS FOR TRADESHOWS AND INDUSTRY CONFERENCES, ENGAGING WITH POTENTIAL PROSPECTS AND STRENGTHENING RELATIONSHIPS.IDENTIFY CUSTOMER REQUIREMENTS AND COMMUNICATE THEM TO INTERNAL TEAMS, ENSURING RESPONSIVENESS AND SATISFACTION.\nQUALIFICATIONS:\nHIGH TECHNICAL PROFICIENCY WITH LIDAR SENSORS AND COMPLEMENTARY SENSORS, WITH A TRACK RECORD OF EXCEEDING SALES TARGETS.CURIOUS AND ANALYTICAL, RESOURCEFUL IN FINDING EFFICIENT SOLUTIONS TO POTENTIAL BARRIERS.RESULTS-ORIENTED WITH A STRONG WORK ETHIC AND MOTIVATION TO LEARN AND DELIVER.ORGANIZED AND DILIGENT, ABLE TO MAINTAIN MOMENTUM AND MANAGE CONVERSATIONS SMOOTHLY.ACCOUNT MANAGEMENT EXPERIENCE WITH A FOCUS ON STRATEGIC ACCOUNTS.\nAPPLY NOW FOR IMMEDIATE CONSIDERATION FOR THIS EXCELLENT DIRECTOR OF BUSINESS DEVELOPMENT OPPORTUNITY!\nUNDERSTANDING RECRUITMENT IS ACTING AS AN EMPLOYMENT AGENCY FOR THIS DIRECTOR OF BUSINESS DEVELOPMENT VACANCY!",
    "job_skill_set": [
      "Sales Strategy Development",
      "Account Management",
      "Business Development",
      "Relationship Building",
      "Analytical Thinking",
      "Problem Solving",
      "Results Orientation",
      "Organizational Skills",
      "Communication",
      "Lidar Sensors",
      "CRM Database Management",
      "Technical Proficiency in Industrial Technology"
    ],
    "short_keywords": [
      "account",
      "analytical",
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "crm",
      "database",
      "development",
      "director",
      "in",
      "industrial",
      "lidar",
      "management",
      "of",
      "organizational",
      "orientation",
      "problem",
      "proficiency",
      "relationship",
      "results",
      "sales",
      "sensors",
      "skills",
      "solving",
      "strategy",
      "technical",
      "technology",
      "thinking"
    ]
  },
  {
    "job_id": "3905203756",
    "job_title": "SVP, Business Development",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ABOUT EXELA\n\nEXELA IS A BUSINESS PROCESS AUTOMATION (BPA) LEADER, LEVERAGING A GLOBAL FOOTPRINT AND PROPRIETARY TECHNOLOGY TO PROVIDE DIGITAL TRANSFORMATION SOLUTIONS ENHANCING QUALITY, PRODUCTIVITY, AND END-USER EXPERIENCE. WITH DECADES OF EXPERTISE OPERATING MISSION-CRITICAL PROCESSES, EXELA SERVES A GROWING ROSTER OF MORE THAN 4,000 CUSTOMERS THROUGHOUT 50 COUNTRIES, INCLUDING OVER 60% OF THE FORTUNE® 100. WITH FOUNDATIONAL TECHNOLOGIES SPANNING INFORMATION MANAGEMENT, WORKFLOW AUTOMATION, AND INTEGRATED COMMUNICATIONS, EXELA'S SOFTWARE AND SERVICES INCLUDE MULTI-INDUSTRY DEPARTMENT SOLUTION SUITES ADDRESSING FINANCE & ACCOUNTING, HUMAN CAPITAL MANAGEMENT, AND LEGAL MANAGEMENT, AS WELL AS INDUSTRY-SPECIFIC SOLUTIONS FOR BANKING, HEALTHCARE, INSURANCE, AND PUBLIC SECTORS. - THROUGH CLOUD-ENABLED PLATFORMS, BUILT ON A CONFIGURABLE STACK OF AUTOMATION MODULES, AND 17,500+ EMPLOYEES OPERATING IN 23 COUNTRIES, EXELA RAPIDLY DEPLOYS INTEGRATED TECHNOLOGY AND OPERATIONS AS AN END-TO-END DIGITAL JOURNEY PARTNER.\n\nHEALTH & WELLNESS\n\nWE OFFER COMPREHENSIVE HEALTH AND WELLNESS PLANS, INCLUDING MEDICAL, DENTAL AND VISION COVERAGE FOR ELIGIBLE EMPLOYEES AND FAMILY MEMBERS; PAID TIME OFF; AND COMMUTER BENEFITS. IN ADDITION, SUPPLEMENTAL INCOME PROTECTION INCLUDING SHORT TERM INSURANCE COVERAGE IS AVAILABLE. WE ALSO OFFER A 401(K)-RETIREMENT SAVINGS PLAN TO ASSIST ELIGIBLE EMPLOYEES IN SAVING FOR THEIR RETIREMENT. PARTICIPANTS ARE PROVIDED ACCESS TO FINANCIAL WELLNESS RESOURCES AND RETIREMENT PLANNING SERVICES.\n\nMILITARY HIRING\n\nEXELA SEEKS JOB APPLICANTS FROM ALL WALKS OF LIFE AND BACKGROUNDS INCLUDING, BUT NOT LIMITED TO, THOSE WHO ARE TRANSITIONING MILITARY MEMBERS, VETERANS, RESERVISTS, NATIONAL GUARD MEMBERS, MILITARY SPOUSES AND THEIR FAMILY MEMBERS. INDIVIDUALS WILL BE CONSIDERED NO MATTER THEIR MILITARY RANK OR SPECIALTY.\n\nSENIOR VICE PRESIDENT (SVP), BUSINESS DEVELOPMENT\n\nABOUT THE ROLE\n\nAS THE SENIOR VICE PRESIDENT OF BUSINESS DEVELOPMENT, YOU WILL PLAY A CRUCIAL ROLE IN SHAPING THE COMPANY'S GROWTH STRATEGY AND DRIVING REVENUE EXPANSION THROUGH THE IDENTIFICATION AND PURSUIT OF NEW BUSINESS OPPORTUNITIES. REPORTING DIRECTLY TO THE CEO OR ANOTHER SENIOR EXECUTIVE, YOU WILL LEAD A HIGH-PERFORMING TEAM OF BUSINESS DEVELOPMENT PROFESSIONALS AND COLLABORATE CLOSELY WITH CROSS-FUNCTIONAL TEAMS TO DRIVE RESULTS. THIS ROLE OFFERS AN EXCITING OPPORTUNITY FOR A STRATEGIC LEADER WITH A PROVEN TRACK RECORD OF SUCCESS IN BUSINESS DEVELOPMENT AND A STRONG ABILITY TO DRIVE GROWTH AND PROFITABILITY.\n\nESSENTIAL JOB RESPONSIBILITIES\n\nDEVELOP AND EXECUTE A COMPREHENSIVE BUSINESS DEVELOPMENT STRATEGY TO DRIVE REVENUE GROWTH AND EXPAND MARKET SHARE ACROSS KEY MARKETS AND INDUSTRIES.LEAD AND MENTOR A TEAM OF BUSINESS DEVELOPMENT PROFESSIONALS, PROVIDING GUIDANCE, COACHING, AND SUPPORT TO DRIVE PERFORMANCE AND ACHIEVE TARGETS.IDENTIFY AND EVALUATE NEW BUSINESS OPPORTUNITIES, INCLUDING STRATEGIC PARTNERSHIPS, ALLIANCES, MERGERS, AND ACQUISITIONS, TO SUPPORT THE COMPANY'S GROWTH OBJECTIVES.CULTIVATE AND MAINTAIN STRONG RELATIONSHIPS WITH KEY CLIENTS, PARTNERS, AND STAKEHOLDERS, SERVING AS THE PRIMARY POINT OF CONTACT AND DRIVING CUSTOMER SATISFACTION AND RETENTION.COLLABORATE WITH CROSS-FUNCTIONAL TEAMS, INCLUDING SALES, MARKETING, PRODUCT MANAGEMENT, AND FINANCE, TO ENSURE ALIGNMENT AND COORDINATION OF BUSINESS DEVELOPMENT EFFORTS.CONDUCT MARKET RESEARCH AND ANALYSIS TO IDENTIFY EMERGING TRENDS, COMPETITIVE DYNAMICS, AND GROWTH OPPORTUNITIES, PROVIDING INSIGHTS AND RECOMMENDATIONS TO SENIOR LEADERSHIP.LEAD NEGOTIATIONS AND CONTRACT DISCUSSIONS WITH POTENTIAL PARTNERS AND CLIENTS, ENSURING FAVORABLE TERMS AND CONDITIONS FOR THE COMPANY.REPRESENT THE COMPANY AT INDUSTRY EVENTS, CONFERENCES, AND NETWORKING FORUMS TO RAISE BRAND AWARENESS, GENERATE LEADS, AND BUILD RELATIONSHIPS WITH KEY INFLUENCERS.DEVELOP AND MAINTAIN A ROBUST PIPELINE OF BUSINESS OPPORTUNITIES, TRACKING PROGRESS AND PERFORMANCE AGAINST TARGETS AND PROVIDING REGULAR UPDATES TO SENIOR LEADERSHIP.\n\nQUALIFICATIONS\n\nBACHELOR'S DEGREE IN BUSINESS ADMINISTRATION, MARKETING, FINANCE, OR A RELATED FIELD; MASTER'S DEGREE PREFERRED. A COMBINATION OF EDUCATION AND RELEVANT EXPERIENCE EQUIVALENT TO THE STATED QUALIFICATIONS MAY BE CONSIDERED.YEARS OF PROGRESSIVE EXPERIENCE IN BUSINESS DEVELOPMENT ROLES, WITH A DEMONSTRATED TRACK RECORD OF SUCCESS IN DRIVING REVENUE GROWTH AND EXPANDING MARKET SHARE.STRONG LEADERSHIP AND MANAGEMENT SKILLS, WITH THE ABILITY TO INSPIRE AND MOTIVATE A DIVERSE TEAM TO ACHIEVE GOALS AND OBJECTIVES.EXCELLENT COMMUNICATION, NEGOTIATION, AND INTERPERSONAL SKILLS, WITH THE ABILITY TO BUILD RAPPORT AND INFLUENCE STAKEHOLDERS AT ALL LEVELS.STRATEGIC THINKER WITH THE ABILITY TO ANALYZE MARKET TRENDS, IDENTIFY OPPORTUNITIES, AND DEVELOP ACTIONABLE STRATEGIES TO DRIVE BUSINESS GROWTH.RESULTS-ORIENTED MINDSET WITH A FOCUS ON ACHIEVING TARGETS AND DELIVERING EXCEPTIONAL RESULTS.ABILITY TO TRAVEL AS NEEDED TO MEET WITH CLIENTS, ATTEND INDUSTRY EVENTS, AND SUPPORT BUSINESS DEVELOPMENT EFFORTS.\n\nEEO STATEMENT\n\nEXELA IS COMMITTED TO CREATING A DIVERSE ENVIRONMENT AND IS PROUD TO BE AN EQUALITY OPPORTUNITY EMPLOYER. QUALIFIED APPLICANTS WILL CONSIDERED FOR EMPLOYMENT WITHOUT REGARD TO THEIR RACE, COLOR, CREED, RELIGION, NATIONAL ORIGIN, ANCESTRY, CITIZENSHIP STATUS, AGE, DISABILITY, GENDER/SEX, MARITAL STATUS, SEXUAL ORIENTATION, GENDER IDENTITY, GENDER EXPRESSION, VETERAN STATUS, GENETIC INFORMATION, OR ANY OTHER CHARACTERISTIC PROTECTED BY APPLICABLE FEDERAL, STATE, OR LOCAL LAWS.\n\nEXELA RECRUITERS OR REPRESENTATIVES WILL ONLY CONTACT YOU FROM EMAILS ENDING WITH @EXELAONLINE.COM, @EXELATECH.COM, @LEXICODE.COM, @RUSTCONSULTING.COM OR @ERSGROUP.COM. WE WOULD NEVER ASK YOU FOR PAYMENT OR ASK YOU TO DEPOSIT A CHECK INTO YOUR PERSONAL BANK ACCOUNT DURING THE RECRUITMENT PROCESS.",
    "job_skill_set": [
      "business development",
      "strategic planning",
      "market analysis",
      "negotiation",
      "leadership",
      "financial analysis",
      "customer relationship management",
      "project management",
      "sales strategy",
      "data analysis",
      "communication",
      "teamwork",
      "problem solving",
      "influencing",
      "mentoring",
      "results-oriented",
      "adaptability",
      "interpersonal skills",
      "strategic thinking",
      "networking"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "business",
      "businessdevelopment",
      "communication",
      "customer",
      "data",
      "development",
      "financial",
      "influencing",
      "interpersonal",
      "leadership",
      "management",
      "market",
      "mentoring",
      "negotiation",
      "networking",
      "planning",
      "problem",
      "project",
      "relationship",
      "resultsoriented",
      "sales",
      "skills",
      "solving",
      "strategic",
      "strategy",
      "svp",
      "teamwork",
      "thinking"
    ]
  },
  {
    "job_id": "3901376470",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "YOUR DAY-TO-DAY AS A BUSINESS DEVELOPMENT MANAGER\nSTRATEGY: WORK CLOSELY WITH PRACTICE DIRECTORS AND THE PROFESSIONAL SERVICES DELIVERY TEAM TO DEVISE STRATEGIES FOR PURSUING AND WINNING NEW PROJECTS AND MANAGED SERVICES ENGAGEMENTS. IDENTIFY PROSPECT TARGET AGENCIES AND PERSONAE.MARKET ANALYSIS: CONDUCT GENERAL MARKET ANALYSIS TO UNDERSTAND STATE GOVERNMENT SECTOR TRENDS, CHALLENGES, AND OPPORTUNITIES. UTILIZE THIS KNOWLEDGE TO INFORM BUSINESS DEVELOPMENT STRATEGIES. PERFORM SPECIFIC INDUSTRY, COMPANY, AND PERSONAE RESEARCH ON TARGETED PROSPECTS.MARKETING CAMPAIGNS AND EVENTS: COLLABORATE WITH THE MARKETING MANAGER AND THE PRACTICE DIRECTOR TO DEVELOP APPROPRIATE MARKETING MESSAGES FOR THE STATE GOVERNMENT SECTOR, AND TO COORDINATE PARTICIPATION IN SECTOR-SPECIFIC CONFERENCES AND OTHER MARKETING EVENTS. SUPPORT THE MARKETING MANAGER WITH MARKETING CAMPAIGNS AND MARKETING CHANNEL IDENTIFICATION.RELATIONSHIP BUILDING: ESTABLISH AND MAINTAIN RELATIONSHIPS WITH KEY STAKEHOLDERS IN PROSPECTIVE CLIENT ORGANIZATIONS. ENGAGE NEW PROSPECTS TO INTRODUCE ACCESS SCIENCES CORPORATION'S SERVICES, HIGHLIGHTING OUR EXPERTISE IN MANAGING AND TRANSFORMING INFORMATION.LEAD GENERATION AND DEVELOPMENT: IDENTIFY, DEVELOP, AND QUALIFY NEW BUSINESS OPPORTUNITIES. UTILIZE STRONG \"HUNTING\" CAPABILITIES TO UNCOVER AND PURSUE LEADS. ENGAGE IN QUALIFYING DISCUSSIONS WITH PROSPECTS TO UNDERSTAND THEIR UNIQUE ISSUES AND PAIN POINTS, THEIR BUDGET THRESHOLDS, AND THEIR DECISION TIMEFRAMES. MAKE INITIAL RECOMMENDATIONS ON WHETHER TO CONTINUE PURSUING THE OPPORTUNITY.OPPORTUNITY SHAPING: FOR QUALIFIED OPPORTUNITIES, TEAM WITH THE PRACTICE DIRECTOR, OTHER PROFESSIONAL SERVICES LEADERSHIP TEAM MEMBERS, AND THE PROSPECT TO COOPERATIVELY DEFINE THE SPECIFIC SCOPE OF THE OPPORTUNITY. THIS REQUIRES A DEEPER DIVE INTO THE ISSUES AND PAIN POINTS TO UNDERSTAND THEIR IMPACT ON BUSINESS, THEIR PRIORITIES, AND THE VALUE PROPOSITION OF THEIR RESOLUTION.PROPOSAL WRITING: PARTICIPATE IN THE DEVELOPMENT OF PROPOSALS FOR PROSPECTS AND CLIENTS. THIS REQUIRES AN IN-DEPTH UNDERSTANDING OF THE PRODUCTS AND SERVICES WE OFFER. PARTICIPATION COULD INCLUDE PROPOSAL PLANNING, PROPOSAL TEAM COORDINATION, CONTENT CONTRIBUTION, CONTENT MANAGEMENT, QUALITY ASSURANCE, PROPOSAL PRODUCTION, AND DEADLINE MANAGEMENT.\nWHAT YOU NEED TO BE SUCCESSFUL\nPROVEN EXPERIENCE IN BUSINESS DEVELOPMENT, PREFERABLY WITHIN THE PROFESSIONAL SERVICES AND STATE AGENCIES SECTORS.STRONG CAPABILITY IN \"HUNTING\" AND LEAD GENERATION WITH A TRACK RECORD OF IDENTIFYING AND PURSUING NEW BUSINESS OPPORTUNITIES.EXCELLENT COMMUNICATION AND INTERPERSONAL SKILLS WITH THE ABILITY TO BUILD AND MAINTAIN RELATIONSHIPS WITH KEY STAKEHOLDERS AT EVERY LEVEL INCLUDING THE C-SUITE.ABILITY TO WORK COLLABORATIVELY WITH CROSS-FUNCTIONAL TEAMS INCLUDING PRACTICE LEADERS MARKETING AND PROFESSIONAL SERVICES DELIVERY TEAMS.WILLINGNESS TO TRAVEL AND ENGAGE WITH PROSPECTS AT THEIR LOCATIONS.BACHELOR’S DEGREE IN BUSINESS, MARKETING, OR A RELATED FIELD PREFERRED",
    "job_skill_set": [
      "business development",
      "marketing campaigns",
      "relationship management",
      "stakeholder engagement",
      "research",
      "cross-functional collaboration",
      "communication",
      "interpersonal skills",
      "teamwork",
      "problem solving",
      "adaptability",
      "negotiation",
      "time management",
      "customer focus",
      "initiative",
      "analytical thinking",
      "lead generation",
      "market analysis",
      "proposal writing",
      "strategic planning"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "analytical",
      "business",
      "businessdevelopment",
      "campaigns",
      "collaboration",
      "communication",
      "crossfunctional",
      "customer",
      "development",
      "engagement",
      "focus",
      "generation",
      "initiative",
      "interpersonal",
      "lead",
      "management",
      "manager",
      "market",
      "marketing",
      "negotiation",
      "planning",
      "problem",
      "proposal",
      "relationship",
      "research",
      "skills",
      "solving",
      "stakeholder",
      "strategic",
      "teamwork",
      "thinking",
      "time",
      "writing"
    ]
  },
  {
    "job_id": "3900950652",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "WE DELIVER THE GOODS:\n\nCOMPETITIVE PAY AND BENEFITS, INCLUDING DAY 1 HEALTH & WELLNESS BENEFITS, EMPLOYEE STOCK PURCHASE PLAN, 401K EMPLOYER MATCHING, EDUCATION ASSISTANCE, PAID TIME OFF, AND MUCH MOREGROWTH OPPORTUNITIES PERFORMING ESSENTIAL WORK TO SUPPORT AMERICA’S FOOD DISTRIBUTION SYSTEMSAFE AND INCLUSIVE WORKING ENVIRONMENT, INCLUDING CULTURE OF REWARDS, RECOGNITION, AND RESPECT\n\nWHY JOIN CORE-MARK?\n\nCORE-MARK EMPHASIZES PERSONAL GROWTH AND DEVELOPMENT FOR ALL ASSOCIATES. WE BELIEVE THAT WHEN YOU SUCCEED, THE COMPANY SUCCEEDS. WE PROMOTE INTERNALLY WHENEVER POSSIBLE AND PROVIDE FREQUENT TRAINING OPPORTUNITIES IN SEVERAL FORMATS TO HELP YOU MEET YOUR PERSONAL AND CAREER GOALS.\n\nSALARY RANGE IS $70K - $80K PLUS UNCAPPED BONUS ELIGIBILITYSCHEDULE IS MONDAY - FRIDAY FROM 8AM - 5PM TERRITORY WILL COVER NORTH TEXAS\n\nPOSITION SUMMARY:\n\nRESPONSIBLE FOR THE DEVELOPMENT OF SALES ACCOUNT BUSINESS, WITH EMPHASIS ON OVERALL PROFITABILITY THROUGH BOTH NEW SALES AND ACCOUNT PENETRATION. ALSO, SUPPORTS CUSTOMER SERVICE ACTIVITIES FOR CUSTOMERS, THEREBY INCREASING VISIBILITY OF THE COMPANY IN THE MARKETPLACE AND MAXIMIZING MARKET SHARE. FUNCTIONS AS A TEAM MEMBER WITHIN THE DEPARTMENT AND ORGANIZATION, AS REQUIRED, AND PERFORMS ANY DUTY ASSIGNED TO BEST SERVE THE COMPANY.\n\nPOSITION RESPONSIBILITIES:\n\nGENERATES ADDITIONAL BUSINESS THROUGH ANALYZING INDIVIDUAL CUSTOMERS; SAMPLES PRODUCTS WITH EXISTING AND POTENTIAL CUSTOMERS; PLANS GENERAL SALES STRATEGY INCLUDING TIME AND TERRITORY MANAGEMENT; PLANS SALES APPROACH WITH INDIVIDUAL CUSTOMERS; AND CONDUCTS EFFECTIVE SALE PRESENTATIONS. GROWS SALES AND PROFIT MARGINS ON AN ONGOING BASIS. SETS UP NEW CUSTOMER ACCOUNTS BY DETERMINING PRICING; WORKS WITH CREDIT DEPARTMENT FOR INITIAL AUTHORIZATION; AND OTHER CENTER PERSONNEL FOR SCHEDULING OF ORDER-TAKING, DELIVERIES, ETC. PERFORMS INITIAL FOLLOW-UP WORK WITH CUSTOMER ENSURING DELIVERY AND PRODUCTS ARE SATISFACTORY. ENSURES CUSTOMER SATISFACTION BY PROVIDING AN EXEMPLARY LEVEL OF SERVICE BY WORKING CLOSELY WITH OTHER CENTER PERSONNEL TO COORDINATE EFFORTS TO PREVENT AND RESOLVE CUSTOMER PROBLEMS. MAY BE PERSONALLY RESPONSIBLE FOR MAKING DELIVERIES IN EMERGENCY SITUATIONS. BUILDS ADDITIONAL BUSINESS WITH CURRENT CUSTOMERS BY SELLING THEM ON ADDITIONAL PRODUCTS IN ORDER TO MAXIMIZE PROFITABILITY OF INDIVIDUAL ACCOUNTS. MINIMIZES ACCOUNTS RECEIVABLE PROBLEMS BY MONITORING ACCOUNTS FOR COMPLIANCE WITH CREDIT TERMS AND FOLLOWS-UP ON ANY PROBLEMS. MAINTAINS AWARENESS OF PRICING TRENDS WITHIN SALES TERRITORY, PARTICULARLY FOR PRODUCTS, TO ENSURE COMPETITIVE PRICING. PERFORMS OTHER RELATED DUTIES AS ASSIGNED. \n\nQUALIFICATIONSHIGH SCHOOL DIPLOMA/GED OR EQUIVALENT EXPERIENCE\n\n1-2 YEARS SELLING/CLOSING SALES SUCCESS FOR A VARIETY OF PRODUCT LINES WITH B2B EXPERIENCE\n\nVALID DRIVER'S LICENSE REQUIRED",
    "job_skill_set": [
      "sales strategy",
      "customer service",
      "account management",
      "B2B sales",
      "market analysis",
      "product knowledge",
      "sales presentations",
      "territory management",
      "communication",
      "teamwork",
      "problem solving",
      "adaptability",
      "customer relationship management",
      "time management",
      "negotiation",
      "interpersonal skills",
      "initiative",
      "attention to detail",
      "pricing strategy",
      "delivery coordination"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "analysis",
      "attention",
      "b2b",
      "business",
      "businessdevelopment",
      "communication",
      "coordination",
      "customer",
      "delivery",
      "detail",
      "development",
      "initiative",
      "interpersonal",
      "knowledge",
      "management",
      "manager",
      "market",
      "negotiation",
      "presentations",
      "pricing",
      "problem",
      "product",
      "relationship",
      "sales",
      "service",
      "skills",
      "solving",
      "strategy",
      "teamwork",
      "territory",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3903432625",
    "job_title": "Director of Business Development",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ZADDY SOLUTIONS IS DOING A SEARCH FOR A CLIENT IN WASHINGTON, DC FOR A DIRECTOR OF BUSINESS DEVELOPMENT. THIS ROLE IS REMOTE BUT YOU MUST LIVE IN DC AREA. THE COMPANY IS THE GLOBAL LEADER IN SOLUTIONS THAT DRIVE MEASURABLE RESULTS FOR THEIR CLIENTS AROUND THE WORLD BY INSPIRING THE PEOPLE WHO IMPACT THEIR SUCCESS. ALTHOUGH THIS IS DIRECTOR LEVEL, IT IS AN INDIVIDUAL CONTRIBUTOR ROLE.\nSUMMARY:WE'RE LOOKING FOR A PASSIONATE AND RESULTS-ORIENTED BUSINESS DEVELOPMENT DIRECTOR TO JOIN OUR TEAM IN WASHINGTON, DC! OUR MISSION IS TO EMPOWER BUSINESSES TO ACHIEVE REAL RESULTS THROUGH INSPIRATION. WE'RE EXPERTS IN ATTRACTING AND RETAINING TOP TALENT, DRIVING SALES THROUGH CONTESTS AND INCENTIVES, BUILDING CUSTOMER LOYALTY PROGRAMS, AND CREATING IMPACTFUL EVENTS.THE ROLE:AS THE BUSINESS DEVELOPMENT DIRECTOR, YOU'LL BE RESPONSIBLE FOR IDENTIFYING NEW BUSINESS OPPORTUNITIES IN THE WASHINGTON, DC AREA.YOU'LL BUILD STRONG RELATIONSHIPS WITH CLIENTS, UNDERSTAND THEIR UNIQUE NEEDS, AND COLLABORATE WITH OUR TEAM OF SPECIALISTS TO CRAFT SOLUTIONS TAILORED TO THEIR SUCCESS.THIS IS A HYBRID ROLE, REQUIRING SOME TIME IN THE OFFICE AND SOME TIME IN THE FIELD.QUALIFICATIONS:MINIMUM 7 YEARS OF B2B SALES EXPERIENCE, CALLING ON FORTUNE 1000 COMPANIES.PROVEN TRACK RECORD OF SUCCESS IN NEW BUSINESS DEVELOPMENT, PARTICULARLY WITHIN MARKETING SOLUTIONS OR PROFESSIONAL SERVICES.DEMONSTRATED ABILITY TO PROSPECT, GROW REVENUE, AND CLOSE LARGE DEALS ($250K+).EXPERIENCE WITH VARIOUS SALES CYCLES (3-12 MONTHS).THRIVES IN A COMMISSION-BASED ENVIRONMENT WITH BONUSES.COLLEGE DEGREE PREFERRED.PROFICIENCY IN MICROSOFT OFFICE SUITE REQUIRED. FAMILIARITY WITH WEB, SAAS, AND MOBILE APPLICATIONS A PLUS.COMPENSATION & BENEFITS:COMPETITIVE BASE SALARY OF $135,000 (NON-NEGOTIABLE) WITH A FIRST-YEAR OTE (ON-TARGET EARNINGS) OF $200,000, WITH POTENTIAL FOR SIGNIFICANTLY HIGHER EARNINGS IN SUBSEQUENT YEARS.COMPREHENSIVE BENEFITS PACKAGE INCLUDING:PERFORMANCE INCENTIVES WITH POTENTIAL FOR PRESIDENT'S CLUB TRAVEL REWARDSCAR ALLOWANCECOMPANY LAPTOP AND MOBILE DEVICE REIMBURSEMENTFULL EXPENSE ACCOUNT FOR CLIENT ENTERTAINMENT",
    "job_skill_set": [
      "B2B Sales",
      "Business Development",
      "Revenue Growth",
      "Microsoft Office Suite",
      "Sales Cycle Management",
      "Marketing Solutions",
      "Web Applications",
      "SaaS Applications",
      "Relationship Building",
      "Collaboration",
      "Communication",
      "Problem Solving",
      "Results Orientation",
      "Adaptability",
      "Negotiation",
      "Time Management",
      "Closing Large Deals",
      "Professional Services",
      "Mobile Applications"
    ],
    "short_keywords": [
      "adaptability",
      "applications",
      "b2b",
      "building",
      "business",
      "businessdevelopment",
      "closing",
      "collaboration",
      "communication",
      "cycle",
      "deals",
      "development",
      "director",
      "growth",
      "large",
      "management",
      "marketing",
      "microsoft",
      "mobile",
      "negotiation",
      "of",
      "office",
      "orientation",
      "problem",
      "professional",
      "relationship",
      "results",
      "revenue",
      "saas",
      "sales",
      "services",
      "solutions",
      "solving",
      "suite",
      "time",
      "web"
    ]
  },
  {
    "job_id": "3901177503",
    "job_title": "Business Development Executive",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "COMPANY DESCRIPTIONCREATIVE TRIPLET IS A LEADING VIDEO CONTENT PROVIDER FOR BUSINESS EXPLANATION BASED IN FORT WORTH, TX. WE HAVE SUCCESSFULLY EXPLAINED BUSINESSES AND CONCEPTS FOR BOTH STARTUPS AND ENTERPRISES. OUR PORTFOLIO INCLUDES TOP FORTUNE 100 ENTERPRISES SUCH AS P&G, J&J, MICROSOFT, AND HUAWEI, AS WELL AS NUMEROUS STARTUPS AND SMES. OUR MISSION IS TO HELP BUSINESSES ARTICULATE THEIR IDEAS THROUGH OUR AWESOMELY HANDCRAFTED VIDEOS.\nROLE DESCRIPTIONTHIS IS A FULL-TIME HYBRID ROLE AS A BUSINESS DEVELOPMENT EXECUTIVE AT CREATIVE TRIPLET. AS A BUSINESS DEVELOPMENT EXECUTIVE, YOUR DAY-TO-DAY TASKS INCLUDE NEW BUSINESS DEVELOPMENT, LEAD GENERATION, ACCOUNT MANAGEMENT, AND EFFECTIVE CLIENT COMMUNICATION. THIS ROLE IS BASED IN FORT WORTH, TX, WITH FLEXIBILITY FOR SOME REMOTE WORK.\nQUALIFICATIONSNEW BUSINESS DEVELOPMENT AND LEAD GENERATION SKILLSSTRONG BUSINESS ACUMEN AND ABILITY TO UNDERSTAND CLIENT NEEDSEXCELLENT COMMUNICATION AND INTERPERSONAL SKILLSEXPERIENCE IN ACCOUNT MANAGEMENTSELF-MOTIVATED AND GOAL-ORIENTEDABILITY TO WORK INDEPENDENTLY AND COLLABORATIVELYSTRONG NEGOTIATION AND PERSUASIVE SKILLSEXPERIENCE IN THE VIDEO PRODUCTION INDUSTRY IS A PLUSBACHELOR'S DEGREE IN BUSINESS, MARKETING, OR RELATED FIELDSTRONG VERBAL, WRITTEN AND PHONE SKILLSABILITY TO MANAGE MULTIPLE PRIORITIES WITH A HIGH LEVEL OF ENERGY TO MAINTAIN ENTHUSIASM AND DRIVE RESULTSABILITY TO ENGAGE AND BUILD RELATIONSHIPS WITH HIGH-LEVEL EXECUTIVES\nBENEFITSCHANCE TO WORK IN A STARTUP ENVIRONMENT AND THE POSSIBILITY TO GROWWORKING HOURS AREN'T STRICT AS LONG AS YOU ARE MEETING YOUR GOALSWE OFFER AMPLE LEARNING OPPORTUNITIES FOR THOSE LOOKING TO EXPAND THEIR SKILLSOPPORTUNITIES TO INTERFACE WITH RESPECTED BUSINESS PROFESSIONALSPERSONAL AND PROFESSIONAL DEVELOPMENT ARE PRIORITIZED IN OUR WORKING CULTURE\n\nAPPLICATION PROCESS:INTERESTED CANDIDATES ARE INVITED TO SUBMIT A RESUME AND A COVER LETTER OUTLINING THEIR QUALIFICATIONS AND WHY THEY BELIEVE THEY ARE THE RIGHT FIT FOR CREATIVE TRIPLET. APPLICATIONS SHOULD BE SENT TO HELLO@CREATIVETRIPLET.COM",
    "job_skill_set": [
      "new business development",
      "lead generation",
      "account management",
      "business acumen",
      "bachelor's degree in business or marketing",
      "communication",
      "interpersonal skills",
      "self-motivated",
      "goal-oriented",
      "independent work",
      "collaborative work",
      "relationship building",
      "multi-tasking",
      "enthusiasm",
      "negotiation",
      "video production experience"
    ],
    "short_keywords": [
      "account",
      "acumen",
      "bachelors",
      "building",
      "business",
      "businessdevelopment",
      "collaborative",
      "communication",
      "degree",
      "development",
      "enthusiasm",
      "executive",
      "experience",
      "generation",
      "goaloriented",
      "in",
      "independent",
      "interpersonal",
      "lead",
      "management",
      "marketing",
      "multitasking",
      "negotiation",
      "new",
      "or",
      "production",
      "relationship",
      "selfmotivated",
      "skills",
      "video",
      "work"
    ]
  },
  {
    "job_id": "3904412043",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "REQUIREMENTS (CANDIDATES WHO DO NOT MEET THESE REQUIREMENTS WILL NOT BE CONSIDERED, PLEASE DO NOT APPLY IF YOU DO NOT MEET THIS CRITERIA):MUST HAVE WORKED AS A FULL TIME EMPLOYEE IN A HOTEL FOR AT LEAST 2 YEARS, IN A ROLE THAT IS HEAVILY INVOLVED WITH THE FRONT DESK AND GUEST RELATIONS.MUST HAVE SALES EXPERIENCE OF AT LEAST 2 YEARS (YOU NEED TO BE A VERY GOOD SALESPERSON).MUST BE BILINGUAL.(KEEP IN MIND OUR COMPANY HAS CLIENTS IN MANY COUNTRIES IN SOUTH AMERICA AS WELL AS IN THE UNITED STATES).YOU NEED TO BE ABLE TO TRAVEL TO THE UNITED STATES (IT WOULD BE PREFERRED IF YOU LIVE IN THE MIAMI, FL AREA, BUT NOT REQUIRED).\nRECOMMENDED QUALIFICATIONS (THESE WOULD MAKE YOU AN IDEAL CANDIDATE):YOU HAVE WORKED IN SALES OF SOFTWARE PRODUCTS FOR THE HOSPITALITY INDUSTRY.YOU ARE WILLING TO WORK IN 'STARTUP MODE'. WE ARE A YOUNG, SMALL COMPANY.YOU HAVE THE SKILLSET TO GROW WITHIN THE COMPANY TO EVENTUALLY TAKE ON A MORE SENIOR ROLE, INCLUDING UP TO THE CEO OF THE COMPANY.\nCOMPANY DESCRIPTIONNORELIAN HAS A SOFTWARE PRODUCT CALLED GUESTHUB, WHICH IS A SAAS HOSPITALITY GUEST EXPERIENCE MANAGEMENT SYSTEM (GEMS) THAT ENHANCES INTERDEPARTMENTAL COMMUNICATIONS, IMPROVES ACCOUNTABILITY, AND OVERAL GUEST EXPERIENCE. GUESTHUB INTEGRATES DIFFERENT MODULES AND SOLUTIONS TO KEEP TRACK OF EVERY GUEST OR INTERNAL REQUIREMENT FROM RESERVATION TO THE FINAL SURVEY. IT HELPS THE HOTEL, RESORT, RESIDENTIAL CONDOMINIUMS, SERVICED APARTMENTS, VACATION RENTAL COMPANIES, AND CONCIERGE COMPANIES DELIVER CONSISTENT EXCELLENT SERVICE.\nROLE DESCRIPTIONTHIS IS A FULL-TIME REMOTE ROLE FOR A BUSINESS DEVELOPMENT MANAGER. FOCUSED ON OUR GUESHUB PRODUCT, THE BUSINESS DEVELOPMENT MANAGER WILL BE RESPONSIBLE FOR IDENTIFYING AND DEVELOPING NEW BUSINESS OPPORTUNITIES, BUILDING AND MAINTAINING CLIENT RELATIONSHIPS, CONDUCTING MARKET RESEARCH, AND CREATING STRATEGIES TO DRIVE SALES GROWTH. THE ROLE ALSO INVOLVES COLLABORATING WITH INTERNAL TEAMS TO ENSURE EFFECTIVE DELIVERY OF SERVICES AND ACHIEVING REVENUE TARGETS.",
    "job_skill_set": [
      "sales",
      "bilingual",
      "market research",
      "client relationship management",
      "SaaS",
      "software sales",
      "strategic planning",
      "communication",
      "team collaboration",
      "problem solving",
      "adaptability",
      "customer service",
      "initiative",
      "growth mindset",
      "hospitality industry knowledge"
    ],
    "short_keywords": [
      "adaptability",
      "bilingual",
      "business",
      "businessdevelopment",
      "client",
      "collaboration",
      "communication",
      "customer",
      "development",
      "growth",
      "hospitality",
      "industry",
      "initiative",
      "knowledge",
      "management",
      "manager",
      "market",
      "mindset",
      "planning",
      "problem",
      "relationship",
      "research",
      "saas",
      "sales",
      "service",
      "software",
      "solving",
      "strategic",
      "team"
    ]
  },
  {
    "job_id": "3894559339",
    "job_title": "Business Development Executive- Carlisle, PA",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "TITLE:  BUSINESS DEVELOPMENT EXECUTIVE\n\n LOCATION:  CARLISLE, PA\n\n RELOCATION OFFERED:  NO\n\nCOMPANY DESCRIPTION: DIGITAL MARKETING\n\nPOSITION DESCRIPTION\n\nTHE BDE IS CHARGED WITH DRIVING DIGITAL MULTI-MEDIA ACCOUNT GROWTH FOR NEW AND EXISTING ACCOUNTS THROUGH PROSPECTING, DEVELOPING, AND CLOSING LEADS USING A VARIETY OF SOURCES.\n\nMUST HAVE'S\n\n1+ YEARS PRIOR DIGITAL MARKETING SALES EXPERIENCE\n\nCURRENT AUTHORIZATION TO WORK IN THE US – NO FUTURE SPONSORSHIP REQUIREMENTS.\n\nLOCATED IN DRIVING DISTANCE TO CARLISLE, PA\n\n SALARY RANGE:  BASE OF $50K WITH REALISTIC YEAR ONE OVERALL COMPENSATION OF $100K\n\n",
    "job_skill_set": [
      "digital marketing",
      "sales",
      "prospecting",
      "lead generation",
      "account management",
      "communication",
      "negotiation",
      "relationship building",
      "time management",
      "problem solving"
    ],
    "short_keywords": [
      "account",
      "building",
      "business",
      "businessdevelopment",
      "carlisle",
      "communication",
      "development",
      "digital",
      "executive",
      "generation",
      "lead",
      "management",
      "marketing",
      "negotiation",
      "pa",
      "problem",
      "prospecting",
      "relationship",
      "sales",
      "solving",
      "time"
    ]
  },
  {
    "job_id": "3901947304",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "DOCKER IS A REMOTE FIRST COMPANY WITH EMPLOYEES ACROSS EUROPE, APAC AND THE AMERICAS THAT SIMPLIFIES THE LIVES OF DEVELOPERS WHO ARE MAKING WORLD-CHANGING APPS. WE RAISED OUR SERIES C FUNDING IN MARCH 2022 FOR $105M AT A $2.1B VALUATION. WE CONTINUED TO SEE EXPONENTIAL REVENUE GROWTH LAST YEAR. JOIN US FOR A WHALE OF A RIDE!\n\nAT DOCKER, WE SIMPLIFY THE LIVES OF DEVELOPERS MAKING WORLD-CHANGING APPS. DOCKER HELPS DEVELOPERS BRING THEIR IDEAS TO REALITY BY CONQUERING THE COMPLEXITY OF APP DEVELOPMENT. WE SIMPLIFY AND ACCELERATE WORKFLOWS WITH AN INTEGRATED DEVELOPMENT PIPELINE AND APPLICATION COMPONENTS. ACTIVELY USED BY MILLIONS OF DEVELOPERS WORLDWIDE, DOCKER DESKTOP AND DOCKER HUB PROVIDE UNMATCHED SIMPLICITY, AGILITY, AND CHOICE. DOCKER IS A FAST-GROWING STARTUP THAT OFFERS A DYNAMIC WORK ENVIRONMENT WITH OPPORTUNITIES TO GROW YOUR CAREER.\n\nABOUT THE ROLE:\n\nWE ARE SEEKING A BUSINESS DEVELOPMENT MANAGER TO LEAD OUR US-BASED BUSINESS DEVELOPMENT TEAM FOCUSED ON OUTBOUND PROSPECTING FOR OUR US COMMERCIAL AND ENTERPRISE SALES TEAM. YOU'LL BE REPORTING TO OUR DIRECTOR OF GLOBAL BUSINESS DEVELOPMENT. YOU WILL BE RESPONSIBLE FOR LEADING AND MANAGING THE PERFORMANCE, METRICS, AND ULTIMATE SUCCESS OF OUR BUSINESS DEVELOPMENT REPRESENTATIVES. YOU WILL PARTNER CLOSELY WITH OUR US SALES MANAGERS TO DRIVE PIPELINE ACTIVITY.\n\nAS THE BUSINESS DEVELOPMENT MANAGER, YOU WILL NEED EXPERIENCE MANAGING A LARGE TEAM OF BUSINESS DEVELOPMENT REPRESENTATIVES IN AN OUTBOUND PROSPECTING CAPACITY. THE IDEAL CANDIDATE WILL HAVE AT LEAST THREE YEARS OF EXPERIENCE SELLING AND MANAGING SAAS / DEVOPS SOLUTIONS TO ENTERPRISE CLIENTS. STRONG CANDIDATES WILL HAVE EXPERIENCE MANAGING A TEAM OF BDRS AND THE ABILITY TO COACH AND LEAD A HIGH-PERFORMING OUTBOUND PROSPECTING TEAM.\n\nIN THIS ROLE, YOU WILL:\n\nCARRY A TEAM QUOTA; REGULARLY MEET AND EXCEED GOALS MONITOR AND REFINE SALES LEAD PROCESSES AND METRICSMANAGE TERRITORY ASSIGNMENTS AND SDR/AE RELATIONSHIPSHIRE, RECRUIT, MENTOR, AND DEVELOP TOP ENTERPRISE AND STRATEGIC SDRSDEVELOP AND OWN THE SALES \"FUNNEL,\" CONTINUOUSLY OPTIMIZING EVERY STEP DEFINE NEW PROCESSES TO INCREASE OVERALL PRODUCTIVITYWORK COLLABORATIVELY WITH SALES, MARKETING, AND REVENUE OPERATIONS TO REFINE A REPEATABLE PROSPECTING MODEL FOR BOTH INBOUND AND OUTBOUND EFFORTS.KEEP UP TO DATE WITH COMPETITION TO PROVIDE COMPETITIVE ANALYSISCOMMUNICATE PROACTIVELY WITH MANAGEMENT, CUSTOMERS, AND SUPPORT STAFFPARTICIPATE IN TEAM-BUILDING AND COMPANY GROWTH ACTIVITIES, INCLUDING STRATEGY SETTING AND TRAINING\n\nWHAT YOU'LL NEED:\n\nAT LEAST THREE YEARS OF ENTERPRISE SALES DEVELOPMENT/LEAD GENERATION EXPERIENCE1-2+ YEARS EXPERIENCE IN A CLOSING ROLE 2+ YEARS OF BUSINESS DEVELOPMENT MANAGEMENT EXPERIENCE EXPERIENCE WORKING FOR A HIGH-GROWTH SOFTWARE/SAAS COMPANYPRIOR SUCCESS BUILDING AND LEADING AN ENTERPRISE BUSINESS DEVELOPMENT TEAM AND EXPERIENCE DEVELOPING/EXECUTING A PLAN TO ACHIEVE GOALSSUPERB INTERPERSONAL AND COMMUNICATION SKILLSABILITY TO INFLUENCE, TRAIN, AND MOTIVATE OTHERSTECHNICALLY SAVVYCOMFORTABLE AND FAMILIAR WITH CROSS-FUNCTIONAL COLLABORATIONENERGY, ENTHUSIASM, AND LOVE OF SELLING\n\nADDITIONAL ATTRIBUTES:\n\nRELEVANT EXPERIENCE IN THE DEVOPS, CLOUD, OR SAAS SPACECOLLABORATION WITH INTERNAL PRODUCT TEAMS TO DRIVE NEW SOLUTIONS THAT MEET BUYERS' NEEDSCOMFORT WITH NEW TECHNOLOGIES AND THE ABILITY TO COMMUNICATE WITH THOSE WHO ARE TECH-SAVVY\n\nWHAT TO EXPECT IN THE FIRST 30 DAYS\n\nYOU WILL BE WELCOMED WITH A FIRST-IN-CLASS ONBOARDING EXPERIENCE THAT INCLUDES EQUIPMENT SETUP, A SWEET SWAG PACKAGE, AND A COLLABORATIVE TRAINING PROGRAMYOU WILL LEARN HOW TO NAVIGATE THROUGH AWARD-WINNING SALES TOOLS SUCH AS SALESFORCE, LEADIQ, OUTREACH, SALES NAVIGATOR, AND DOCKERLEARN KEY PIECES OF INFORMATION (BIRTHDAYS, LOCATIONS, LIKES/DISLIKES, ETC.) ABOUT EVERY TEAM MEMBERDO IN-DEPTH RESEARCH ON THE COMPETITION AND CURRENT MARKET TRENDSSTUDY TEAM REPORTS TO BECOME FAMILIAR WITH INDIVIDUAL STRENGTHS AND WEAKNESSESOBSERVE AND RECORD THE DAILY ACTIVITIES OF TEAM MEMBERSMAKE AT LEAST ONE SMALL CHANGE TO OPERATIONS BASED ON FEEDBACK FROM THE TEAM \n\nWHAT TO EXPECT IN THE FIRST 60 DAYS\n\nIDENTIFY SKILLS GAPS WITHIN THE TEAMSET NEW, MEASURABLE GOALS FOR TEAM MEMBERS BASED ON THE REPORTSMAKE AT LEAST ONE SMALL CHANGE TO SUPPORT THE TEAMWRITE A PLAN OF ACTION FOR THE NEXT 30 DAYS \n\nWHAT TO EXPECT IN THE FIRST 90 DAYS\n\nSTRATEGIZE FOR NEW TRAINING/COACHING SESSIONSCOLLECT THE DATA NEEDED TO PROJECT HOW A NEW STRATEGY COULD GENERATE A GREATER PAYOFFCREATE A STRUCTURED SCHEDULE THAT IMPLEMENTS THE PROPOSED CHANGES\n\nPERKS (FOR FULL TIME EMPLOYEES)\n\nFREEDOM & FLEXIBILITY; FIT YOUR WORK AROUND YOUR LIFEHOME OFFICE SETUP; WE WANT YOU COMFORTABLE WHILE YOU WORK16 WEEKS OF PAID PARENTAL LEAVETECHNOLOGY STIPEND EQUIVALENT TO $100 NET/MONTHPTO PLAN THAT ENCOURAGES YOU TO TAKE TIME TO DO THE THINGS YOU ENJOYQUARTERLY, COMPANY-WIDE HACKATHONSTRAINING STIPEND FOR CONFERENCES, COURSES AND CLASSESEQUITY; WE ARE A GROWING START-UP AND WANT ALL EMPLOYEES TO HAVE A SHARE IN THE SUCCESS OF THE COMPANYDOCKER SWAGMEDICAL BENEFITS, RETIREMENT AND HOLIDAYS VARY BY COUNTRY\n\nDOCKER EMBRACES DIVERSITY AND EQUAL OPPORTUNITY. WE ARE COMMITTED TO BUILDING A TEAM THAT REPRESENTS A VARIETY OF BACKGROUNDS, PERSPECTIVES, AND SKILLS. THE MORE INCLUSIVE WE ARE, THE BETTER OUR COMPANY WILL BE.\n\nDUE TO THE REMOTE NATURE OF THIS ROLE, WE ARE UNABLE TO PROVIDE VISA SPONSORSHIP.\n\n",
    "job_skill_set": [
      "Data Analysis",
      "Team Management",
      "Sales Strategy Development",
      "Market Research",
      "Communication",
      "Leadership",
      "Coaching",
      "Interpersonal Skills",
      "Motivation",
      "Collaboration",
      "Problem Solving",
      "Adaptability",
      "Energy and Enthusiasm",
      "SaaS",
      "DevOps",
      "Salesforce",
      "LeadIQ",
      "Outreach",
      "Sales Navigator"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "and",
      "business",
      "businessdevelopment",
      "coaching",
      "collaboration",
      "communication",
      "data",
      "development",
      "devops",
      "energy",
      "enthusiasm",
      "interpersonal",
      "leadership",
      "leadiq",
      "management",
      "manager",
      "market",
      "motivation",
      "navigator",
      "outreach",
      "problem",
      "research",
      "saas",
      "sales",
      "salesforce",
      "skills",
      "solving",
      "strategy",
      "team"
    ]
  },
  {
    "job_id": "3891073377",
    "job_title": "Business Development Executive",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "AMERICAN ELEVATOR GROUP (AEG) COMPANY, A COLLECTION OF WELL-ESTABLISHED ELEVATOR SERVICE COMPANIES OPERATING ACROSS THE UNITED STATES. BACKED BY ARCLINE INVESTMENT MANAGEMENT, AEG HAS A SIGNIFICANT FOOTPRINT IN THE ELEVATOR INDUSTRY AND IS RAPIDLY GROWING. TO HELP DRIVE OUR CONTINUED GROWTH, WE ARE SEEKING TO ADD A MOD SALES HUNTER IN THE BALTIMORE/DC METRO AREA.\nTHE BUSINESS DEVELOPMENT EXECUTIVE WILL COMMUNICATE THE BENEFITS OF THE COMPANY'S SERVICES TO INCREASE SALES. IN THIS ROLE YOU WILL BE THE POINT OF CONTACT FOR PROSPECTS AND/OR CLIENTS AND HAVE A RANGE OF RESPONSIBILITIES INCLUDING IDENTIFYING AND EDUCATING CURRENT AND FUTURE CUSTOMERS ON PRODUCTS THROUGH CALLS, TRAININGS, AND PRESENTATIONS, WHILE PROVIDING EXISTING CUSTOMERS WITH EXCEPTIONAL SUPPORT, INFORMATION, AND ASSISTANCE.\nTHE SUCCESSFUL CANDIDATE WILL POSSESS A BACHELOR'S DEGREE IN BUSINESS ADMINISTRATION, MARKETING, OR A RELATED FIELD PREFERRED AND 7+ YEARS OF ELEVATOR MOD SALES EXPERIENCE. YOU SHOULD POSSESS A POSITIVE CAN-DO ATTITUDE WITH STRONG INTERPERSONAL/COMMUNICATION/PRESENTATIONS SKILLS AND THE ABILITY TO BUILD STRONG CUSTOMER RELATIONSHIPS AT ALL LEVELS, A WILLINGNESS TO PROSPECT AND IDENTIFY NEW BUSINESS OPPORTUNITIES, WHICH WILL ENTAIL COLD-CALLING AND PROSPECTING FOR NEW CLIENTS. YOU SHOULD BE A HIGHLY ORGANIZED PERSON WHO CAN MONITOR NUMEROUS PROJECTS AT ONCE AND WHO CAN PRIORITIZE OPPORTUNITIES AND HAS THE ANALYTICAL ABILITY AND BUSINESS ACUMEN TO FOCUS ON PROFITABLE WINS AND HAVE THE ABILITY TO UNDERSTAND THE CLIENTS BUSINESS, IDENTIFY SOLUTIONS & COMMUNICATE VALUE BY PROPOSING AND PERSUADING TO BUY AND ASSIST WITH PROJECT MANAGEMENT.\nAEG IS AN EQUAL OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, NATIONAL ORIGIN, ANCESTRY, SEX, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, RELIGION, AGE, PREGNANCY, DISABILITY, WORK-RELATED INJURY, COVERED VETERAN STATUS, POLITICAL IDEOLOGY, MARITAL STATUS, OR ANY OTHER FACTOR THAT THE LAW PROTECTS FROM EMPLOYMENT DISCRIMINATION.",
    "job_skill_set": [
      "Sales",
      "Business Development",
      "Customer Relationship Management",
      "Project Management",
      "Market Analysis",
      "Presentation Skills",
      "Analytical Skills",
      "Communication",
      "Interpersonal Skills",
      "Organizational Skills",
      "Problem Solving",
      "Persuasion",
      "Adaptability",
      "Elevator Industry Knowledge",
      "Cold Calling",
      "Positive Attitude"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "analytical",
      "attitude",
      "business",
      "businessdevelopment",
      "calling",
      "cold",
      "communication",
      "customer",
      "development",
      "elevator",
      "executive",
      "industry",
      "interpersonal",
      "knowledge",
      "management",
      "market",
      "organizational",
      "persuasion",
      "positive",
      "presentation",
      "problem",
      "project",
      "relationship",
      "sales",
      "skills",
      "solving"
    ]
  },
  {
    "job_id": "3888023916",
    "job_title": "Business Development Representative, Legal",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "BUSINESS DEVELOPMENT REPRESENTATIVE, LEGAL\nABOUT OUR COMPANY:AT EMPIRICAL360, WE ARE EXPERTS IN LEGAL ADVERTISING, COMMITTED TO REDEFINING EXCELLENCE. OUR ONE-OF-A-KIND AGENCY DISTINGUISHES ITSELF BY PROVIDING UNPARALLELED VALUE TO CLIENTS. UNLIKE PROFIT-DRIVEN COUNTERPARTS, WE ARE ELITE, INVESTING EXTENSIVELY IN BOTH CLIENTS AND OUR TEAM. OUR FOCUS ON CONTINUOUS INNOVATION SETS NEW STANDARDS FOR SERVICE DELIVERY IN SEM AND SOCIAL MEDIA ADVERTISING.\nFOR YOUR PURPOSES, WE DON'T 'SELL'; WE HELP. OUR MISSION IS TO EMPOWER LAW FIRMS TO 7 AND 8 FIGURES BY OFFERING GENUINE ASSISTANCE AND EXPERTISE. AT EMPIRICAL360, SUCCESS IS NOT JUST A DESTINATION BUT A CONTINUOUS EVOLUTION, WHERE OUR COMMITMENT TO EXCELLENCE AND INNOVATION DEFINES WHO WE ARE IN THE DYNAMIC REALM OF LEGAL ADVERTISING.\n\n\nWHAT YOU'LL DO:\nCALLING, EMAILING & SOCIAL OUTREACH TO INBOUND LEADS TO BUILD VALUE AND POTENTIAL SALES OPPORTUNITIESCOLD CALLING, EMAILING & SOCIAL OUTREACH TO COLD LEADS TO BUILD VALUE & RELATIONSHIPS BY OFFERING FREE RESOURCES & INVITES TO LIVE TRAININGSWORKING WITH POTENTIAL CLIENTS TO EITHER QUALIFY THEM FOR OUR SERVICES OR PROVIDE FREE PROGRAMS THAT CAN EVENTUALLY LEAD THEM BACK TO USUSE GIFTING, MAIL & OUT OF THE BOX IDEAS TO GAIN THE ATTENTION OF KEY CLIENTSONCE A PROSPECT IS QUALIFIED, BOOK STRATEGY SESSIONS WITH AN ACCOUNT EXECUTIVE.USE CRM & DIALING SOFTWARE LIKE HUBSPOT TO MAKE OUTBOUND COMMUNICATIONS.BUILDING RAPPORT WITH TARGETED PROSPECTIVE LAW FIRMS BY UTILIZING OUR CONTENT LIBRARY AND LEVERAGING MARKETING RESOURCES (WEBINAR INVITES, WHITEPAPERS AND EBOOKS, CASE STUDIES, SAMPLE VIDEOS, BLOG ARTICLES, PODCASTS, ETC.).MAKE A MINIMUM OF 50 - 70 PERSONALIZED OUTBOUND ACTIVITIES A DAYFIND & QUALIFY COLD ACCOUNTS USING SOFTWARE & OTHER TOOLS FOR LEAD DEVELOPMENT\nWHAT WE'RE LOOKING FOR:\nSOMEONE WITH OUTBOUND EXPERIENCE THAT IS NOT AFRAID OF GETTING THEIR HANDS DIRTY2-3 YEARS OF OUTBOUND/ SALES EXPERIENCE1+ YEARS OF LEGAL SALES EXPERIENCE, PREFERABLY IN DIGITAL MEDIA OR MARKETINGSOMEONE WHO HAS EXPERIENCE SELLING TO LAWYERS SPECIFICALLY EITHER MARKETING OR SOFTWARE SERVICES.SOMEONE WHO HAS BDR/ SDR EXPERIENCE.\n\nCOMPENSATION\nBASE SALARY $45,000ON TARGET EARNINGS AFTER COMMISSIONS - $75K - $95K - DEPENDENT ON SHOW RATE AND CLOSED APPOINTMENTS. WE PROVIDE INBOUND LEADS & YOU ARE RESPONSIBLE FOR PROSPECTING INTO COLD ACCOUNTS.",
    "job_skill_set": [
      "outbound sales",
      "CRM software",
      "lead qualification",
      "email outreach",
      "communication",
      "relationship building",
      "problem solving",
      "teamwork",
      "initiative",
      "legal sales",
      "digital media marketing",
      "social media advertising",
      "cold calling",
      "strategy sessions",
      "content marketing",
      "adaptability",
      "creativity"
    ],
    "short_keywords": [
      "adaptability",
      "advertising",
      "building",
      "business",
      "businessdevelopment",
      "calling",
      "cold",
      "communication",
      "content",
      "creativity",
      "crm",
      "development",
      "digital",
      "email",
      "initiative",
      "lead",
      "legal",
      "marketing",
      "media",
      "outbound",
      "outreach",
      "problem",
      "qualification",
      "relationship",
      "representative",
      "sales",
      "sessions",
      "social",
      "software",
      "solving",
      "strategy",
      "teamwork"
    ]
  },
  {
    "job_id": "3884807419",
    "job_title": "Business Development Manager - US",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "THE ROLE\n\nCLIMATE IMPACT PARTNERS IS A LEADING PROVIDER OF HIGH-QUALITY CLIMATE SOLUTIONS, DEDICATED TO CREATING A MORE SUSTAINABLE WORLD. WE ARE CURRENTLY SEEKING A BUSINESS DEVELOPMENT MANAGER TO JOIN OUR CLIENT SOLUTIONS TEAM, FOCUSING ON EXPANDING OUR MARKET-BASED ENVIRONMENTAL SOLUTIONS IN THE US. AS A BUSINESS DEVELOPMENT MANAGER WITH CLIMATE IMPACT PARTNERS, YOU WILL PLAY A CRUCIAL ROLE IN DRIVING CLIMATE ACTION BY BUILDING STRONG PARTNERSHIPS WITH US-BASED CLIENTS AND PROMOTING OUR SUSTAINABLE SOLUTIONS.\n\nCLIMATE ACTION COMMITMENTS AMONG THE FORTUNE GLOBAL 500 ARE SURGING AT AN UNPRECEDENTED PACE, WITH CARBON NEUTRALITY EMERGING AS THE MOST IMPACTFUL COMMITMENT TODAY. CLIMATE IMPACT PARTNERS PROVIDES A WORLD-LEADING CARBON NEUTRALITY FRAMEWORK, TRUSTED BY TOP ORGANIZATIONS SUCH AS MICROSOFT, VMWARE AND KPMG. TO BUILD ON THIS SUCCESS, WE ARE SEEKING AN EXPERIENCED AND MOTIVATED SALES PROFESSIONAL.\n\nAS A SKILLED COMMUNICATOR AND TRANSLATOR, YOU BRIDGE THE GAP BETWEEN CLIMATE IMPACT PARTNERS' UNIQUE CAPABILITIES AND THE MARKETPLACE'S NEEDS. YOU REPRESENT THE FACE OF OUR COMPANY TO CLIENTS AND PROSPECTS, INCLUDING ESTEEMED SUSTAINABILITY LEADERS. YOUR ENTHUSIASM LIES IN ASSISTING LEADING COMPANIES TO ACHIEVE THEIR SUSTAINABILITY OBJECTIVES AND DRIVE BUSINESS VALUE.\n\nRESPONSBILITIES\n\nAS A BUSINESS DEVELOPMENT MANAGER, YOU WILL BE RESPONSIBLE FOR THREE KEY AREAS:\n\n BUSINESS DEVELOPMENT:COLLABORATE WITH VARIOUS TEAMS TO DEVELOP MARKET-SPECIFIC STRATEGIES THAT ATTRACT AND SECURE CLIENTS. IDENTIFY AND PURSUE OPPORTUNITIES WITH COMPANIES SEEKING MARKET-BASED ENVIRONMENTAL SOLUTIONS ACROSS DIVERSE INDUSTRIES. CONSULT WITH PROSPECTS (THE MAJORITY OF WHICH HAVE LIMITED UNDERSTANDING OF MARKET-BASED INSTRUMENTS) TO DEVELOP STRATEGIES, PROGRAMS, AND PORTFOLIOS THAT GENERATE BUSINESS VALUE AND ALIGN WITH THEIR SUSTAINABILITY GOALS. WORK CLOSELY WITH PROJECT SOURCING, TECHNICAL, COMMERCIAL, AND LEGAL TEAMS TO DELIVER TAILORED CLIMATE SOLUTIONS.  CLIENT DEVELOPMENT:STRENGTHEN RELATIONSHIPS WITH EXISTING CLIENTS INTERESTED IN ENHANCING THEIR CLIMATE ACTION. CONSULT WITH CLIENTS TO DEVELOP STRATEGIES, PROGRAMS, AND PORTFOLIOS THAT DRIVE IMPACT AND SUSTAINABILITY. RETAIN AND BUILD UPON RELATIONSHIPS WITH OUR EXISTING CLIENTS.  MARKET RESEARCH:STAY UPDATED ON THE LATEST TRENDS AND OPPORTUNITIES IN ENVIRONMENTAL MARKETS TO DELIVER IMPACTFUL CLIMATE SOLUTIONS. \n\nSPECIFIC TASKS INCLUDE\n\nDEVELOPING SALES STRATEGIES AND GO-TO-MARKET PROPOSITIONS. CREATING DETAILED PLANS FOR EFFECTIVE SOLUTION DELIVERY. ACHIEVING REVENUE\n\nEXPERIENCE\n\nWHAT WE ARE LOOKING FOR\n\nBACHELOR'S DEGREE OR EQUIVALENT EXPERIENCE. RELEVANT COMMERCIAL AND SALES EXPERIENCE. FAMILIARITY WITH CARBON AND/OR RENEWABLE ENERGY MARKETS AND/OR CORPORATE SUSTAINABILITY. EXPERIENCE IN BUILDING AND MAINTAINING NETWORKS WITH DECISION-MAKERS. ABILITY TO MANAGE COMPLEX PROJECTS AND CLIENT RELATIONSHIPS. PROFICIENCY IN USING CRM SOFTWARE (WE USE SALESFORCE). \n\nSKILLS\n\nADAPTABILITY IN FAST-PACED, HIGH-GROWTH TECHNICAL ENVIRONMENTS. STRONG COMMERCIAL ACUMEN AND PROBLEM-SOLVING SKILLS. EXCEPTIONAL VERBAL AND WRITTEN COMMUNICATION ABILITIES. QUICK THINKING AND PERSUASIVE COMMUNICATION SKILLS. CAPACITY TO PRIORITIZE WORK AND HANDLE MULTIPLE TASKS EFFICIENTLY. METICULOUS ATTENTION TO DETAIL, TIMELY REPORTING, AND RECORD-KEEPING. POISE AND PROFESSIONALISM IN ENGAGING BUSINESS LEADERS. \n\nPERSON SPECIFICATION\n\nINTEREST IN CORPORATE SUSTAINABILITY AND THE PRIVATE SECTOR'S ROLE IN ADDRESSING CLIMATE CHANGE. PRAGMATIC WITH A FOCUS ON INTEGRITY AND ETHICAL PRACTICES. PROACTIVE AND ACCOUNTABLE. COLLABORATIVE ATTITUDE WITH AN EMPHASIS ON TEAMWORK. STRONG WORK ETHIC, HIGH ENERGY, FLEXIBILITY, AND A SENSE OF HUMOUR. EXCELLENT INTERPERSONAL AND COMMUNICATION SKILLS. AN ADVOCATE FOR DIVERSITY, EQUITY, AND INCLUSION. \n\nPERKS \n\nREMOTE WORKINGMEDICAL INSURANCE*VISION AND/ OR DENTAL BENEFITS*ADOPTION ASSISTANCE PROGRAM*FLEXIBLE SPENDING ACCOUNT*HEALTH SAVINGS ACCOUNT*BASIC TERM LIFE INSURANCE (UP TO 1 X SALARY)*OTHER VOLUNTARY INSURANCES*ACCESS TO PERKS AND DISCOUNTS SUCH AS GYM MEMBERSHIPS, NUTRITION COACHING, CHILDCARE, PET HEALTH INSURANCE*24/7 WELL-BEING AND SUPPORT HELPLINES*401K PLAN WITH INVESTMENT OPTIONSBONUS SCHEME, SUBJECT TO COMPANY AND INDIVIDUAL PERFORMANCEBENEFITS PROVIDED BY INSPERITY.\n\nCLIMATE IMPACT PARTNERS IS AN EQUAL OPPORTUNITIES EMPLOYER. OUR GOAL IS TO BE A DIVERSE AND INCLUSIVE WORKFORCE, THAT EMBRACES OUR DIFFERENCES, AND SO ALL ASPECTS OF EMPLOYMENT INCLUDING THE DECISION TO HIRE AND PROMOTE, WILL BE BASED ON MERIT, COMPETENCE, PERFORMANCE, AND BUSINESS NEED. WE DO NOT DISCRIMINATE ON THE BASIS OF CHARACTERISTICS PROTECTED UNDER FEDERAL, STATE, OR LOCAL LAW. TO SUPPORT THIS, ALL APPLICATIONS ARE ANONYMISED UNTIL THE INTERVIEW STAGE WHICH MEANS THAT REGARDLESS OF WHO HAS APPLIED, YOUR CHARACTERISTICS ARE TOTALLY ANONYMOUS.\n\nABOUT CLIMATE IMPACT PARTNERS\n\nCLIMATE IMPACT PARTNERS DELIVERS SOLUTIONS FOR ACTION ON CLIMATE. WE BELIEVE THAT CARBON MARKETS HAVE A CRITICAL ROLE TO PLAY IN DELIVERING ACTION BY PUTTING A PRICE ON CARBON AND FUNDING CARBON REDUCTION ACTIVITIES TO MEET OUR GLOBAL CLIMATE GOALS.\n\nTOGETHER WITH THE WORLD’S LEADING COMPANIES AND QUALITY PROJECT PARTNERS WE WILL CUT 1 BILLION TONNES OF CO2 TO TRANSFORM THE GLOBAL ECONOMY, IMPROVE HEALTH AND LIVELIHOODS AND RESTORE A THRIVING PLANET.\n\nWE DO THIS BY DELIVERING THE HIGHEST QUALITY CARBON FINANCED PROJECTS, FROM WHICH WE CREATE CARBON CREDIT AND ENERGY ATTRIBUTE CERTIFICATE PORTFOLIOS. THIS ENABLES ORGANISATIONS TO OFFSET THE EMISSIONS THEY CAN’T REDUCE, PUT A PRICE ON CARBON TO INCENTIVISE CHANGE, AND MEET THEIR AMBITIOUS CLIMATE GOALS.\n\nCLIMATE IMPACT PARTNERS BUILDS ON THE EXPERTISE, INTEGRITY, AND INNOVATION OF TWO COMPANIES THAT HAVE LED THE VOLUNTARY CARBON MARKET – NATURAL CAPITAL PARTNERS AND CLIMATECARE. FUELLED BY A RELENTLESS DRIVE FOR RAPID ACTION AND RESULTS, OUR GLOBAL TEAM CONTINUES TO PIONEER THE MARKET’S GROWTH, AND SET THE STANDARDS FOR QUALITY THAT WILL MAXIMISE ITS IMPACT.",
    "job_skill_set": [
      "CRM software",
      "sales strategies",
      "market research",
      "project management",
      "communication",
      "problem solving",
      "teamwork",
      "adaptability",
      "interpersonal skills",
      "attention to detail",
      "proactivity",
      "integrity",
      "carbon markets",
      "renewable energy"
    ],
    "short_keywords": [
      "adaptability",
      "attention",
      "business",
      "businessdevelopment",
      "carbon",
      "communication",
      "crm",
      "detail",
      "development",
      "energy",
      "integrity",
      "interpersonal",
      "management",
      "manager",
      "market",
      "markets",
      "proactivity",
      "problem",
      "project",
      "renewable",
      "research",
      "sales",
      "skills",
      "software",
      "solving",
      "strategies",
      "teamwork",
      "to",
      "us"
    ]
  },
  {
    "job_id": "3891297808",
    "job_title": "Director Business Development Pharma - Plainsboro, NJ",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "DIRECTOR BUSINESS DEVELOPMENT PHARMA\n\nLOCATION: PLAINSBORO, NJ\n\nPLACE OF WORK: HYBRID* \n\nDIRECTOR BUSINESS DEVELOPMENT PHARMA DRIVES PHARMACEUTICAL PIPELINE DEVELOPMENT, DRIVING MID-TO-LONG TERM BUSINESS GROWTH IN THE PHARMA SEGMENT. YOU WILL WORK CLOSELY WITH THE GLOBAL AND REGIONAL MARKETING AND SALES TEAMS, THE PHARMA SEGMENT, AND INNOVATION TEAMS, BECOMING THE VOICE OF CUSTOMER TO CONTINUOUSLY STRENGTHEN THE PHARMA PROJECT PIPELINE AND VALUE PROPOSITION. THE ROLE IS ACCOUNTABLE FOR ALL TECHNICAL AND SCIENTIFIC CUSTOMER IDENTIFICATION, DEVELOPMENT AND SUPPORT IN THE PHASE OF PIPELINE DEVELOPMENT (PRE-LAUNCH) AND OWNS PIPELINE RELATED CUSTOMER-SPECIFIC PROJECT MANAGEMENT ACTIVITIES.\n\nKEY RESPONSIBILITIES:\n\nFURTHER BROADEN THE CUSTOMER BASE, PROSPECTING, AND LEAD GENERATION AMONG THE PHARMACEUTICAL AND BIOTECH INDUSTRIESDEVELOP THOUGHT LEADERSHIP ON SCIENTIFIC, TECHNICAL, AND INDUSTRY TREND-RELEVANT ASPECTS THAT DIFFERENTIATE AND POSITION DSM-FIRMENICH AND ITS OFFERING, INCLUDING THROUGH BUILDING A NETWORK OF SCIENTIFIC & TECHNICAL EXPERTSBUILD AN INTEGRATED NETWORK OF RELATIONSHIPS WITH KEY DECISION MAKERS AND THE TECHNICAL ORGANIZATIONS AT KEY CUSTOMERS LEAD NEGOTIATOR FOR COMMERCIALIZATION STRATEGY OF MID-TO-LONG TERM CUSTOMER PIPELINE PROJECTSOWN REVENUE TARGETS AND MARKET PENETRATION STRATEGY FOR INNOVATION GROWTH PILLARS IN PHARMA, INCLUDING, AS A PRIORITY, CANNABINOIDSLEAD COLLABORATION PROJECTS WITH PHARMA CUSTOMERS ENSURING A SPEEDY EXECUTION AND PROPER CUSTOMER SUPPORTTHIS POSITION IS ELIGIBLE FOR THE DSM HYBRID WORKING MODEL, SPENDING 2 DAYS PER WEEK IN THE PLAINSBORO, NJ OFFICE AND THE BALANCE OF THE WEEK IN A HOME OFFICE. REMOTE LOCATION IN THE EASTERN OR CENTRAL TIME ZONES MAY BE CONSIDERED. \n\nWE BRING\n\nA RICH HISTORY AND A PROMISING FUTURE OF BOLD SCIENTIFIC INNOVATION AND PASSIONATE CREATION WITH OUR CUSTOMERS, IN A CATEGORY OF ONEA SPACE TO GROW BY ENCOURAGING AND SUPPORTING CURIOSITY AND AN OPEN MINDSETTHE OPPORTUNITY TO WORK FOR A COMPANY WHERE SUSTAINABILITY IS MUCH MORE THAN A CLAIM AND IS CORE TO OUR STRATEGY AND PURPOSEA FLEXIBLE WORK ENVIRONMENT THAT EMPOWERS PEOPLE TO TAKE ACCOUNTABILITY FOR THEIR WORK AND OWN THE OUTCOMEBARRIER-FREE COMMUNITIES WITHIN OUR ORGANIZATION WHERE EVERY EMPLOYEE IS EQUALLY VALUED AND RESPECTED – REGARDLESS OF THEIR BACKGROUND, BELIEFS, OR IDENTITYA FIRM BELIEF THAT WORKING TOGETHER WITH OUR CUSTOMERS IS THE KEY TO ACHIEVING GREAT THINGSAN EAGERNESS TO BE ONE TEAM AND LEARN FROM EACH OTHER TO BRING PROGRESS TO LIFE AND CREATE A BETTER FUTURE\n\nYOU BRING:\n\nMINIMUM 7 YEARS OF TECHNICAL MARKETING AND/OR TECHNICAL SALES REQUIREDEXPERIENCE IN PHARMACEUTICAL INGREDIENTS SALES AND/OR BUSINESS DEVELOPMENT REQUIRED; KNOWLEDGE OF CANNABINOIDS A PLUSSTRONG PROJECT MANAGEMENT AND PRESENTATION SKILLSABILITY TO INFLUENCE WITHOUT AUTHORITYRESILIENCY AND SELF-MOTIVATIONBACHELOR’S DEGREE REQUIRED; MBA, PHD OR ADVANCED DEGREE A PLUS\n\nOUR RECRUITMENT PROCESS\n\nINTERESTED IN THIS POSITION? PLEASE APPLY ONLINE BY UPLOADING YOUR RESUME IN ENGLISH VIA OUR CAREER PORTAL.\n\nABOUT DSM-FIRMENICH\n\nAS INNOVATORS IN NUTRITION, HEALTH, AND BEAUTY, DSM-FIRMENICH REINVENTS, MANUFACTURES, AND COMBINES VITAL NUTRIENTS, FLAVORS, AND FRAGRANCES FOR THE WORLD’S GROWING POPULATION TO THRIVE. WITH OUR COMPREHENSIVE RANGE OF SOLUTIONS, WITH NATURAL AND RENEWABLE INGREDIENTS AND RENOWNED SCIENCE AND TECHNOLOGY CAPABILITIES, WE WORK TO CREATE WHAT IS ESSENTIAL FOR LIFE, DESIRABLE FOR CONSUMERS, AND MORE SUSTAINABLE FOR THE PLANET. DSM-FIRMENICH IS A SWISS-DUTCH COMPANY, LISTED ON THE EURONEXT AMSTERDAM, WITH OPERATIONS IN ALMOST 60 COUNTRIES AND REVENUES OF MORE THAN €12 BILLION. WITH A DIVERSE, WORLDWIDE TEAM OF NEARLY 30,000 EMPLOYEES, WE BRING PROGRESS TO LIFE™ EVERY DAY, EVERYWHERE, FOR BILLIONS OF PEOPLE.\n\nWWW.DSM-FIRMENICH.COM\n\nDSM-FIRMENICH IS FULLY DEDICATED TO INCLUSION BECAUSE WHEN PEOPLE FEEL ENGAGED AND EMPOWERED, THEIR CREATIVITY AND INNOVATION DRIVES UNPRECEDENTED PROGRESS. WE AIM TO BUILD A WORKPLACE WHERE OPPORTUNITY REALLY IS EQUAL, SO EVERYONE CAN THRIVE. WE DO NOT DISCRIMINATE: THERE’S A PLACE FOR EVERYONE AT DSM-FIRMENICH.\n\nDSM-FIRMENICH IS AN EQUAL OPPORTUNITY AND AFFIRMATIVE ACTION EMPLOYER. DSM-FIRMENICH PEOPLE ARE AS DIVERSE AS OUR CUSTOMERS. FOR US THAT INCLUDES A COMMITMENT TO ENSURING EQUAL EMPLOYMENT OPPORTUNITIES FOR ALL JOB APPLICANTS AND EMPLOYEES. EMPLOYMENT DECISIONS ARE BASED UPON JOB-RELATED REASONS REGARDLESS OF AN APPLICANT'S RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, AGE, NATIONAL ORIGIN, DISABILITY, MARITAL STATUS, GENETIC INFORMATION, PROTECTED VETERAN STATUS, OR ANY OTHER STATUS PROTECTED BY LAW.\n\nWE ARE COMMITTED TO PROVIDING REASONABLE SUPPORT FOR DISABLED APPLICANTS IN OUR RECRUITING PROCESS. SHOULD YOU NEED ASSISTANCE, AND ARE COMFORTABLE SHARING THIS, PLEASE LET US KNOW.\n\nAGENCY NOTE\n\nPLEASE NOTE THIS IS A DIRECT SEARCH LED BY DSM-FIRMENICH. WE ONLY ACCEPT APPLICATIONS FROM CANDIDATES, NOT FROM AGENCIES NOR SUBJECT TO AGENCY’S FEES, PERCENTAGES OR SIMILAR.\n\n#EXT",
    "job_skill_set": [
      "technical marketing",
      "technical sales",
      "project management",
      "presentation skills",
      "business development",
      "influence without authority",
      "resiliency",
      "self-motivation",
      "networking",
      "customer relationship management",
      "team collaboration",
      "pharmaceutical ingredients sales",
      "cannabinoids knowledge"
    ],
    "short_keywords": [
      "authority",
      "business",
      "businessdevelopment",
      "cannabinoids",
      "collaboration",
      "customer",
      "development",
      "director",
      "influence",
      "ingredients",
      "knowledge",
      "management",
      "marketing",
      "networking",
      "nj",
      "pharma",
      "pharmaceutical",
      "plainsboro",
      "presentation",
      "project",
      "relationship",
      "resiliency",
      "sales",
      "selfmotivation",
      "skills",
      "team",
      "technical",
      "without"
    ]
  },
  {
    "job_id": "3887105208",
    "job_title": "Business Development Staffing Executive",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "***PLEASE READ THE REQUIRED MUST HAVE SPECS OF THIS POSITION BEFORE APPLYING!***\nARE YOU READY TO EARN A 6 FIGURE PAY CHECK YOUR FIRST YEAR?\nTHE FRONTLINE SOURCE GROUP'S STAFFING AND RECRUITING TEAM IS GROWING IN DALLAS, TEXAS. HERE’S YOUR CHANCE TO JOIN THE TOP PERFORMING RECRUITING FIRM IN DALLAS! WE ARE LOOKING TO ADD TWO TOP SALES PRODUCERS TO OUR TEAM IN DALLAS. IF YOU ARE AN EXPERIENCED STAFFING PROFESSIONAL WITH AT LEAST 3 YEARS EXPERIENCE OF RECENT SUCCESSFUL SALES AND ACCOUNT MANAGEMENT WITHIN THE STAFFING INDUSTRY IN THE DALLAS FORT WORTH MARKET (THIS IS REQUIRED), IT'S YOUR LUCKY DAY!\nDAY TO DAY TASKS WOULD INCLUDE:RECRUITING HIGHLY QUALIFIED TALENT FOR A LARGE VARIETY OF CLIENTS.BUILDING DYNAMIC RELATIONSHIPS WITH HIRING MANAGERS.MANAGING THE ENTIRE HIRING PROCESS (FROM SOURCING TO OFFER STAGE) IN AN EFFICIENT AND EFFECTIVE MANNER.\nMUST HAVE SKILLS WOULD INCLUDE:STRONG SALES SKILLSCREATIVE THINKINGDIRECT COMMUNICATION SKILLSSENSE OF URGENCY3+ YEARS OF RECENT SUCCESSFUL SALES WITHIN THE STAFFING AND RECRUITING EXPERIENCE IS REQUIRED!\nTHE IDEAL CANDIDATE WILL BE A DECISIVE SELF-STARTER WHO CAPABLE OF HANDLING A MULTITUDE OF TASKS IN A FAST-PACED ENVIRONMENT. THIS IS A PERFECT JOB FOR SOMEONE WHO IS ENERGETIC, OUTGOING, FRIENDLY, AND RESULTS-ORIENTED.\nIF YOU HAVE RECRUITING AND/OR SALES EXPERIENCE AND THINK YOU HAVE WHAT IT TAKES TO JOIN OUR TEAM, WE'D LOVE TO HEAR FROM YOU. THIS IS AN AMAZING OPPORTUNITY TO TAKE ON A SALES ROLE OR EVEN LEADERSHIP WITH OUR GROWING STAFFING AGENCY AND DIRECT HIRE FIRM. \nCOMPANY PROFILE:FRONTLINE SOURCE GROUP IS A REGULAR AWARD WINNER OF THE DALLAS BUSINESS JOURNAL'S \"BEST PLACES TO WORK,\" THE INAVERO \"BEST OF STAFFING,\" STAFFING INDUSTRY ANALYST'S \"BEST STAFFING FIRMS TO WORK FOR\" AND \"INC 500/5000\". RECENTLY WE WERE NAMES #32 FOR FORBES’ “AMERICA’S BEST RECRUITING FIRMS”\nWELL RESPECTED STAFFING FOR PROFESSIONAL SERVICESESTABLISHED IN 2004 AND GROWING LIKE CRAZY WORKING WITH CLIENTS THROUGHOUT THE UNITED STATES.\nCOMPANY BENEFITS - THE GOOD STUFF:THERE’S PLENTY OF AWESOMENESS THAT COMES FROM TAKING ON A STAFFING ACCOUNT EXECUTIVE ROLE WITH FRONTLINE. FRONTLINE SOURCE GROUP'S COMMISSION STRUCTURE OFFERS LIMITLESS EARNING POTENTIAL, CREATING REWARDING OPPORTUNITIES FOR OUR EMPLOYEES, BUT THAT’S NOT ALL. OUR EMPLOYEES ARE OFFERED A SOLID BENEFITS PACKAGE, HAVE THE CHANCE TO WIN A VARIETY OF INCENTIVE TRIPS EACH YEAR, AND ARE BACKED WITH A SOLID TEAM AND SOME OF THE BEST TECHNOLOGY IN THE INDUSTRY. WE OFFER A SOLID ENTREPRENEURIAL ENVIRONMENT WITH TRIED AND TRUE ETHICAL RECRUITING PRACTICES. AND OF COURSE, THERE IS THE GREAT MEDICAL/DENTAL/VISION INSURANCE, PAID PARKING, CHOICE TIME OFF AND A 401K... THESE BENEFITS REALLY ROCK!\nTHINK YOU HAVE WHAT IT TAKES?\nWE ARE LOOKING FOR SOMEONE WITH STAFFING INDUSTRY SALES EXPERIENCE WHO IS TIRED OF THE \"SAME-OLD, SAME-OLD\" STAFFING CULTURE WITH A TRUE DRIVE TO PERFORM AND COLLABORATE.\nTELL ME MORE…WE'RE AN EXCEPTIONAL RECRUITING FIRM THAT SPECIALIZES IN MATCHING TOP TALENT WITH COMPANIES FOR DIRECT, CONTRACT, AND CONTRACT-TO-HIRE PLACEMENTS. \nPLEASE VISIT US AT HTTPS://WWW.FRONTLINESOURCEGROUP.COM FRONTLINE SOURCE GROUP IS AN EQUAL OPPORTUNITY EMPLOYER, M/F/V/D. CANDIDATES MUST HAVE AUTHORIZATION TO WORK IN THE U.S. CLIENTS WILL NOT SPONSOR VISAS. ",
    "job_skill_set": [
      "sales",
      "communication",
      "sense of urgency",
      "decisiveness",
      "self-starter",
      "team collaboration",
      "results-oriented",
      "adaptability",
      "account management",
      "recruiting",
      "client relationship management",
      "sourcing",
      "offer negotiation",
      "staffing industry knowledge",
      "creative thinking"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "business",
      "businessdevelopment",
      "client",
      "collaboration",
      "communication",
      "creative",
      "decisiveness",
      "development",
      "executive",
      "industry",
      "knowledge",
      "management",
      "negotiation",
      "of",
      "offer",
      "recruiting",
      "relationship",
      "resultsoriented",
      "sales",
      "selfstarter",
      "sense",
      "sourcing",
      "staffing",
      "team",
      "thinking",
      "urgency"
    ]
  },
  {
    "job_id": "3901393491",
    "job_title": "Business Development Executive",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "OUR CLIENT IS A LEADING INDEPENDENT OFFICE TECHNOLOGY DEALER SERVICING THE NEW YORK CITY METRO AREA (NYC, WESTCHESTER, NEW JERSEY, AND LONG ISLAND). THEY ARE A LOCALLY RECOGNIZED DISTRIBUTOR OF COPIER (CANON, KYOCERA, AND KONICA MINOLTA) AND HIGH-END PRODUCTION EQUIPMENT. (PRINT SERVICES, BUSINESS PHONE SERVICES, MAILING SOLUTIONS, AND OFFICE WATER SOLUTIONS, PLUS EQUIPMENT LEASING, SERVICE, AND MANAGED SERVICES COMPANY).\nPOSITIONS ARE AVAILABLE IN NYC, LONG ISLAND, WESTCHESTER AND ROCKLAND COUNTIES, AND NEW JERSEY (NORTH & CENTRAL). REPORTING TO THE SALES MANAGER YOU WILL HAVE THE OPPORTUNITY TO WORK IN A HYBRID MODEL.\nMAIN RESPONSIBILITIES:DEVELOPS NEW BUSINESS BY IDENTIFYING AND QUALIFYING POTENTIAL ACCOUNTS; INITIATING, DEVELOPING, AND CLOSING SALESEXPLAINING DOCUMENT MANAGEMENT SOLUTIONS AND IT SERVICE CAPABILITIESEXPANDS SALES IN EXISTING ACCOUNTS BY INTRODUCING NEW PRODUCTS AND SERVICES; AND DEVELOPING NEW APPLICATIONS.MAINTAINS RELATIONSHIPS WITH CLIENTS BY PROVIDING SUPPORT, INFORMATION, AND GUIDANCE; RESEARCHING AND RECOMMENDING NEW OPPORTUNITIES; AND RECOMMENDING PROFIT AND SERVICE IMPROVEMENTS.RECOMMENDS CHANGES IN PRODUCTS, SERVICES, AND POLICY BY EVALUATING RESULTS AND COMPETITIVE DEVELOPMENTS.CONTRIBUTES INFORMATION TO MARKET STRATEGY BY MONITORING COMPETITIVE PRODUCTS AND REACTIONS FROM ACCOUNTS.TRAIN AND MOTIVATE THE DEALER SALES FORCE.\nMAIN REQUIREMENTS:ABILITY TO BRING A BOOK OF BUSINESS.HEAVY COLD CALLING EXPERIENCE.EXCELLENT COMMUNICATION SKILLS\nCOMPENSATION: SALARY IS BETWEEN 50-65K WITH OTE GETTING YOU TO 2X YOUR SALARY.",
    "job_skill_set": [
      "sales",
      "business development",
      "market strategy",
      "client relationship management",
      "competitive analysis",
      "communication",
      "relationship building",
      "motivation",
      "problem solving",
      "teamwork",
      "cold calling",
      "document management solutions",
      "IT service capabilities",
      "product knowledge",
      "research"
    ],
    "short_keywords": [
      "analysis",
      "building",
      "business",
      "businessdevelopment",
      "calling",
      "capabilities",
      "client",
      "cold",
      "communication",
      "competitive",
      "development",
      "document",
      "executive",
      "it",
      "knowledge",
      "management",
      "market",
      "motivation",
      "problem",
      "product",
      "relationship",
      "research",
      "sales",
      "service",
      "solutions",
      "solving",
      "strategy",
      "teamwork"
    ]
  },
  {
    "job_id": "3904396398",
    "job_title": "Business Development Executive",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "CAVALIER LOGISTICS CONTINUES TO BUILD ITS SALES TEAM IN THE INTERNATIONAL & DOMESTIC LOGISTICS INDUSTRY. - FOCUSING ON GENERAL CARGO, AS WELL AS THE PHARMACEUTICAL AND GOVERNMENT VERTICALS.THIS IS AN ENTREPRENEURIAL SALES POSITION, REWARDING SUCCESS WITH BOTH A COMPETITIVE BASE SALARY AND UNCAPPED COMMISSIONS.\nTHE IDEAL CANDIDATE WILL LEAD INITIATIVES TO GENERATE AND ENGAGE WITH BUSINESS PARTNERS TO BUILD NEW BUSINESS FOR THE COMPANY. THIS CANDIDATE WILL BE FOCUSED AND HAVE STRONG COMMUNICATION SKILLS. THEY SHOULD BE ABLE TO THINK CRITICALLY WHEN MAKING PLANS AND HAVE A DEMONSTRATED ABILITY TO EXECUTE A PARTICULAR STRATEGY.\nRESPONSIBILITIESIDENTIFY PARTNERSHIP OPPORTUNITIESDEVELOP NEW RELATIONSHIPS IN AN EFFORT TO GROW BUSINESS AND HELP COMPANY EXPANDMAINTAIN EXISTING BUSINESSTHINK CRITICALLY WHEN PLANNING TO ASSURE PROJECT SUCCESS\nQUALIFICATIONS\nBACHELOR'S DEGREE OR EQUIVALENT EXPERIENCE3 - 4 YEARS' PRIOR INDUSTRY RELATED BUSINESS DEVELOPMENT EXPERIENCESTRONG COMMUNICATION AND INTERPERSONAL SKILLSPROVEN KNOWLEDGE AND EXECUTION OF SUCCESSFUL DEVELOPMENT STRATEGIESFOCUSED AND GOAL-ORIENTED",
    "job_skill_set": [
      "business development",
      "sales",
      "relationship building",
      "strategic planning",
      "logistics knowledge",
      "market analysis",
      "communication",
      "critical thinking",
      "interpersonal skills",
      "goal-oriented",
      "focus"
    ],
    "short_keywords": [
      "analysis",
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "critical",
      "development",
      "executive",
      "focus",
      "goaloriented",
      "interpersonal",
      "knowledge",
      "logistics",
      "market",
      "planning",
      "relationship",
      "sales",
      "skills",
      "strategic",
      "thinking"
    ]
  },
  {
    "job_id": "3906227812",
    "job_title": "Business Development Representative - First Aid & Safety",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "REQUISITION NUMBER: 169701\n\nJOB DESCRIPTION\n\nCINTAS IS SEEKING A BUSINESS DEVELOPMENT REPRESENTATIVE - FIRST AID & SAFETY TO FOCUS ON PRODUCT LINE GROWTH WITHIN EXISTING CUSTOMER ACCOUNTS. RESPONSIBILITIES INCLUDE PROSPECTING, COLD CALLING, SETTING APPOINTMENTS WITH CUSTOMERS, PRESENTING PROGRAMS, AND MEETING A SALES QUOTA. BUSINESS DEVELOPMENT REPRESENTATIVES WILL ALSO TRANSPORT SAMPLES OF PRODUCTS FOR PRESENTATIONS.\n\nRESPONSIBILITIES\n\n MEET OR EXCEEDS REVENUE GOALS CONSISTENTLY. MEETS OR EXCEEDS SALES ACTIVITY REQUIREMENTS. WORKS CLOSELY WITH CINTAS SERVICE REPRESENTATIVE TO LEVERAGE THEIR RELATIONSHIP TO INCREASE SALES & PROFITS. WORKS UNDER THE GUIDANCE OF SALES MANAGER TO SELL A RANGE OF PRODUCTS AND SERVICES TO SIGNIFICANT CUSTOMERS TO ACHIEVE SALES TARGETS. MAKES EFFECTIVE USE OF SALES TOOLS, COLLATERAL MATERIAL, AND PRODUCT SAMPLES. DEVELOPS AN ANNUAL SALES & MARKETING STRATEGY TO ACCOMPLISH SALES GOALS AND BUDGET FOR FISCAL YEAR. WORKS INDEPENDENTLY TO COLLECT AND ANALYZE DATA FROM CUSTOMERS USING PRE-DETERMINED TOOLS, METHODS, AND FORMATS.\n\nSKILLS/QUALIFICATIONS\n\nREQUIRED\n\n HIGH SCHOOL DIPLOMA/GED; BACHELOR'S DEGREE PREFERRED  VALID DRIVER'S LICENSE  PROFICIENCY WITH MICROSOFT OFFICE (WORD, EXCEL, POWERPOINT, OUTLOOK) AND INTRANET/INTERNET \n\nPREFERRED\n\n 1+ YEARS OF SALES EXPERIENCE  EXPERIENCE IN A SIMILAR SALES OR CUSTOMER SERVICE ROLE  AVAILABILITY TO START WITHIN TWO WEEKS AFTER OFFER MADE/ACCEPTED \n\nCINTAS OFFERS COMPREHENSIVE AND COMPETITIVE MEDICAL, DENTAL AND VISION BENEFITS, FEATURING EMPLOYEE HEALTH CARE PREMIUMS THAT ARE 30% LOWER THAN THE NATIONAL AVERAGE FOR OUR INDUSTRY. ONE OF OUR MEDICAL PLAN OPTIONS IS EVEN OFFERED AT ZERO COST TO OUR PARTNERS.\n\nADDITIONALLY, OUR EMPLOYEE-PARTNERS ENJOY\n\n COMPETITIVE PAY 401(K)/PROFIT SHARING/EMPLOYEE STOCK OWNERSHIP PROGRAM DISABILITY AND LIFE INSURANCE PACKAGES PAID TIME OFF AND HOLIDAYS CAREER ADVANCEMENT OPPORTUNITIES\n\nCOMPENSATION\n\nTHIS COMPENSATION INFORMATION IS A GOOD FAITH ESTIMATE AND PROVIDED IN ACCORDANCE WITH CALIFORNIA LOCAL CITY OR STATE LAW. SIMILAR POSITIONS LOCATED OUTSIDE OF THIS JURISDICTION MAY NOT NECESSARILY RECEIVE THE SAME COMPENSATION.\n\nTHE TOTAL COMPENSATION GENERALLY RANGES BETWEEN $66,560/YEAR - $155,000/YEAR AND IS A COMBINATION OF BASE SALARY PLUS MONTHLY EARNED COMMISSIONS. THE RANGE IS AN ESTIMATE BASED ON AN APPLICANT’S SKILLS AND EXPERIENCE.\n\nHEADQUARTERED IN CINCINNATI, CINTAS IS A PUBLICLY HELD COMPANY TRADED OVER THE NASDAQ GLOBAL SELECT MARKET UNDER THE SYMBOL CTAS AND IS A COMPONENT OF BOTH THE STANDARD & POOR’S 500 INDEX AND NASDAQ-100 INDEX.\n\nCINTAS CORPORATION HELPS MORE THAN 900,000 BUSINESSES OF ALL TYPES AND SIZES GET READY™ TO OPEN THEIR DOORS WITH CONFIDENCE EVERY DAY BY PROVIDING A WIDE RANGE OF PRODUCTS AND SERVICES THAT ENHANCE OUR CUSTOMERS’ IMAGE AND HELP KEEP THEIR FACILITIES AND EMPLOYEES CLEAN, SAFE AND LOOKING THEIR BEST. WITH PRODUCTS AND SERVICES INCLUDING UNIFORMS, MATS, MOPS, RESTROOM SUPPLIES, FIRST AID AND SAFETY PRODUCTS, FIRE EXTINGUISHERS AND TESTING, AND SAFETY AND COMPLIANCE TRAINING, CINTAS HELPS CUSTOMERS GET READY FOR THE WORKDAY®.\n\nTO SUPPORT OUR GROWTH ACROSS NORTH AMERICA, WE’RE SEEKING DRIVEN PROFESSIONALS WITH AMBITION TO MOVE UP WITHIN OUR COMPANY. OUR PROFESSIONAL CULTURE, OUR DEDICATION TO OUR EMPLOYEE-PARTNERS AND LIMITLESS CAREER OPPORTUNITIES—THESE ARE JUST A FEW BENEFITS WE’RE PROUD TO OFFER. OUR EMPLOYEE-PARTNERS KNOW EVERY JOB IS CRITICAL, AND THAT TEAMWORK DRIVES INNOVATION. LET’S TALK ABOUT HOW YOU’LL FIT INTO OUR TEAM AND HOW YOUR HARD WORK WILL BE RECOGNIZED THROUGH COMPETITIVE PAY, WORLD-CLASS BENEFITS AND ONGOING CAREER DEVELOPMENT. ARE YOU READY™ FOR LIMITLESS OPPORTUNITIES AT CINTAS?\n\nCINTAS CORPORATION IS AN EEO/AFFIRMATIVE ACTION EMPLOYER AND WILL MAKE ALL EMPLOYMENT-RELATED DECISIONS WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY OR PROTECTED VETERAN STATUS.\n\nJOB CATEGORY: SALES\n\nORGANIZATION: FIRST AID AND SAFETY\n\nEMPLOYEE STATUS: REGULAR\n\nSCHEDULE: FULL TIME\n\nSHIFT: 1ST SHIFT\n\n",
    "job_skill_set": [
      "sales experience",
      "data analysis",
      "prospecting",
      "presentation skills",
      "customer service",
      "teamwork",
      "communication",
      "independence",
      "goal-oriented",
      "relationship building",
      "strategic thinking",
      "Microsoft Office",
      "cold calling",
      "valid driver's license"
    ],
    "short_keywords": [
      "aid",
      "analysis",
      "building",
      "business",
      "businessdevelopment",
      "calling",
      "cold",
      "communication",
      "customer",
      "data",
      "development",
      "drivers",
      "experience",
      "first",
      "goaloriented",
      "independence",
      "license",
      "microsoft",
      "office",
      "presentation",
      "prospecting",
      "relationship",
      "representative",
      "safety",
      "sales",
      "service",
      "skills",
      "strategic",
      "teamwork",
      "thinking",
      "valid"
    ]
  },
  {
    "job_id": "3902788334",
    "job_title": "Business Development Intern",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "COMPANY DESCRIPTIONNAVI PROTOCOL(WWW.NAVIPROTOCOL.IO) IS THE NO.1 DEFI INFRASTRUCTURE ON #SUI WITH THE LEADING LENDING + LSDEFI PLATFORMS. INVESTED BY OKX VENTURES, HASHED, AND DAO5, NAVI PROTOCOL ACCUMULATED 200M TVL AND 800K USERS SINCE LAUNCHING MAINNET 10 MONTHS AGO. NAVI IS CO-FOUNDED BY SILICON VALLEY ENGINEERS AND TRADERS WITH AN EXTENSIVE BACKGROUND IN DEFI AND BLOCKCHAIN SPACE. THE INTERN OFFER COULD BE EXTENDED TO AN FULLTIME OFFER UPON FINISH OF THIS INTERNSHIP.\nROLE DESCRIPTIONWE ARE SEEKING A BUSINESS-SAVVY INTERN POSITION WHO IS CURIOUS AND PASSIONATE ABOUT DECENTRALIZED FINANCE AND BLOCKCHAIN TECHNOLOGY. THE BUSINESS DEVELOPMENT INTERN IS EXPECTED TO WORK CLOSELY WITH THE FOUNDER TO DRIVE BUSINESS INITIATIVES, CO-ORGANIZE SOCIAL NETWORKING EVENTS AND ATTEND NETWORKING SESSIONS IN NYC THROUGHOUT THE SUMMER TIME. THIS JOB RESPONSIBILITY INCLUDES UNDERSTANDING THE BUSINESS'S CORE VALUES, WORKING WITH POTENTIAL PARTNERS, AND EXECUTING BUSINESS INITIATIVES FROM IDEAS TO FINALITY. HE/SHE IS ALSO RESPONSIBLE FOR SUPPORTING DAILY BUSINESS DEVELOPMENT ACTIVITIES, INCLUDING LEAD GENERATION, MARKET RESEARCH, AND CUSTOMER SERVICE.\nTHIS ROLE IS IN NEW YORK, NY, BUT SOME REMOTE WORK IS ACCEPTABLE.\nQUALIFICATIONSPASSIONS ABOUT DEFI/BLOCKCHAIN AND TECHNOLOGYBASIC UNDERSTANDING OF BLOCKCHAIN, DEFI AND TRADEFIORGANIZATION SKILLS OF HOSTING EVENTS AND SOCIAL NETWORKING THINGSANALYTICAL SKILLS, COMMUNICATION, AND CUSTOMER SERVICE SKILLSEXPERIENCE IN LEAD GENERATION AND MARKET RESEARCHEXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLSABILITY TO WORK INDEPENDENTLY AND IN A TEAMATTENTION TO DETAIL AND PROBLEM-SOLVING SKILLSPROFICIENCY IN MICROSOFT OFFICE SUITESTRONG ORGANIZATIONAL AND TIME MANAGEMENT SKILLSBACHELOR'S DEGREE IN BUSINESS ADMINISTRATION, MARKETING, OR RELATED FIELD",
    "job_skill_set": [
      "lead generation",
      "market research",
      "customer service",
      "Microsoft Office Suite",
      "communication",
      "analytical skills",
      "teamwork",
      "problem solving",
      "time management",
      "independence",
      "blockchain",
      "decentralized finance (DeFi)",
      "event organization",
      "attention to detail"
    ],
    "short_keywords": [
      "analytical",
      "attention",
      "blockchain",
      "business",
      "businessdevelopment",
      "communication",
      "customer",
      "decentralized",
      "defi",
      "detail",
      "development",
      "event",
      "finance",
      "generation",
      "independence",
      "intern",
      "lead",
      "management",
      "market",
      "microsoft",
      "office",
      "organization",
      "problem",
      "research",
      "service",
      "skills",
      "solving",
      "suite",
      "teamwork",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3902928877",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "JOB TITLE: BUSINESS DEVELOPMENT MANAGER (BDR)COMPANY: TRIM DOCSLOCATION: REMOTE IN MARYLANDABOUT TRIM DOCS:TRIM DOCS CONNECTS PATIENTS TO WEIGHT LOSS DOCTORS VIA TELEHEALTH FOR GLP-1 PRESCRIPTIONS AND MEDICATION. YOU’VE PROBABLY HEARD OF OZEMPIC, WEGOVY AND OTHER GLP-1 DRUGS AND TRIM DOCS IS AT THE CUTTING EDGE OF THIS RAPIDLY GROWING INDUSTRY. WE ARE CURRENTLY SEEKING A HIGHLY DRIVEN BUSINESS DEVELOPMENT MANAGER TO JOIN OUR TEAM AND SPEARHEAD OUR EXPANSION EFFORTS IN MARYLAND AND POSSIBLY NATIONWIDE. THIS POSITION IS BEST SUITED FOR A HIGHLY DRIVEN SALES PROFESSIONAL WHO THRIVES ON CHALLENGES AND SEEKS OUT OPPORTUNITIES TO DRIVE GROWTH.KEY RESPONSIBILITIES:BUILD AND LEAD OUTBOUND SALES TEAM:DEVELOP AND LEAD A DEDICATED OUTBOUND SALES TEAM FOCUSED ON TARGETING MARYLAND-BASED GYMS.STRATEGIZE AND EXECUTE SALES INITIATIVES TO ESTABLISH PARTNERSHIPS WITH GYMS FOR THE PROMOTION AND IMPLEMENTATION OF TRIM DOCS' WEIGHT LOSS SERVICES.ESTABLISH PARTNERSHIPS WITH MD BUSINESSES:BUILD AND MANAGE AN OUTBOUND SALES TEAM AIMED AT ENGAGING MARYLAND BUSINESSES TO OFFER TRIM DOCS' SERVICES TO THEIR EMPLOYEES.IDENTIFY AND CULTIVATE RELATIONSHIPS WITH BUSINESSES TO PROMOTE EMPLOYEE WELLNESS THROUGH OUR WEIGHT LOSS PROGRAM.LEAD GENERATION AND PROSPECTING:UTILIZE VARIOUS ONLINE RESOURCES AND TOOLS TO SCRAPE THE INTERNET FOR LISTS OF GYMS AND BUSINESSES WITHIN MARYLAND.DEVELOP EFFECTIVE STRATEGIES FOR LEAD GENERATION AND PROSPECTING TO ENSURE A STEADY PIPELINE OF POTENTIAL PARTNERS.CONDUCT OUTBOUND SALES ACTIVITIES:UTILIZE EXISTING EMAIL AND PHONE LISTS TO CONDUCT OUTBOUND CALLS AND EMAILS TO PROSPECTS ACROSS MARYLAND.PRESENT COMPELLING VALUE PROPOSITIONS TO POTENTIAL PARTNERS, HIGHLIGHTING THE BENEFITS OF COLLABORATING WITH TRIM DOCS FOR THEIR CLIENTELE OR EMPLOYEES.QUALIFICATIONS:BACHELOR'S DEGREE IN BUSINESS OR SIMILAR FIELD PREFERRED.PREVIOUS EXPERIENCE IN BUSINESS DEVELOPMENT, SALES, OR A RELATED FIELD IS REQUIRED.MUST HAVE A PROVEN TRACK RECORD OF BUILDING AND LEADING SUCCESSFUL OUTBOUND SALES TEAMS.HIGHLY MOTIVATED AND RESULTS-DRIVEN INDIVIDUAL WITH A PASSION FOR PROMOTING HEALTH AND WELLNESS.EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS.FAMILIARITY WITH THE MARYLAND MARKET AND EXISTING CONNECTIONS WITHIN THE LOCAL BUSINESS COMMUNITY IS PREFERRED.PROFICIENCY IN UTILIZING ONLINE TOOLS AND RESOURCES FOR LEAD GENERATION AND PROSPECTING.MUST BE SELF-DRIVEN WITH A HEALTHY COMPETITIVE SPIRIT.JOIN US AT TRIM DOCS AND BE PART OF A DYNAMIC TEAM DEDICATED TO MAKING A POSITIVE IMPACT ON INDIVIDUALS' LIVES THROUGH INNOVATIVE WEIGHT LOSS SOLUTIONS. IF YOU'RE READY TO TAKE ON THE CHALLENGE OF DRIVING BUSINESS GROWTH AND PROMOTING WELLNESS IN MARYLAND, WE WANT TO HEAR FROM YOU! APPLY NOW WITH YOUR RESUME AND COVER LETTER DETAILING YOUR RELEVANT EXPERIENCE AND WHY YOU'RE THE IDEAL CANDIDATE FOR THIS ROLE.JOB TYPE: FULL-TIME\nPAY: $77,141.00 - $86,267.00 PER YEAR\nBENEFITS:EMPLOYEE DISCOUNTFLEXIBLE SCHEDULEPAID TIME OFFPAID TRAININGWORK FROM HOMESHIFT:8 HOUR SHIFTSUPPLEMENTAL PAY TYPES:BONUS OPPORTUNITIESCOMMISSION PAY\n",
    "job_skill_set": [
      "business development",
      "sales",
      "lead generation",
      "prospecting",
      "team leadership",
      "communication",
      "online tools utilization",
      "market familiarity",
      "motivation",
      "results-driven",
      "relationship building",
      "self-driven",
      "competitive spirit",
      "problem solving"
    ],
    "short_keywords": [
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "competitive",
      "development",
      "familiarity",
      "generation",
      "lead",
      "leadership",
      "manager",
      "market",
      "motivation",
      "online",
      "problem",
      "prospecting",
      "relationship",
      "resultsdriven",
      "sales",
      "selfdriven",
      "solving",
      "spirit",
      "team",
      "tools",
      "utilization"
    ]
  },
  {
    "job_id": "3895214241",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "DO YOU LOVE CONNECTING WITH NEW PEOPLE AND BUILDING LASTING RELATIONSHIPS? DO YOU HAVE A KNACK FOR PLANNING AND HOSTING AMAZING EVENTS? DO YOU ENJOY FINDING NEW OPPORTUNITIES AND SOLVING CHALLENGES FOR YOUR CLIENTS?\n\nIF YOU SAID YES TO THESE QUESTIONS, THEN YOU MIGHT BE THE SUPERSTAR WE ARE LOOKING FOR!\n\nWE ARE LOOKING FOR A BUSINESS DEVELOPMENT REPRESENTATIVE TO JOIN OUR WONDERFUL AND DIVERSE TEAM. YOU WILL BE RESPONSIBLE FOR FINDING NEW LEADS, WARMING THEM UP, AND SETTING UP MEETINGS WITH POTENTIAL CLIENTS. YOU WILL ALSO PLAN AND ORGANIZE VARIOUS EVENTS, SUCH AS WEBINARS, WORKSHOPS, NETWORKING SESSIONS, AND TRADE SHOWS, TO SHOWCASE OUR PRODUCTS AND SERVICES AND ATTRACT NEW CUSTOMERS.\n\nTO ACE THIS ROLE, YOU SHOULD HAVE EXCELLENT COMMUNICATION, INTERPERSONAL, AND CUSTOMER SERVICE SKILLS. YOU SHOULD ALSO BE CREATIVE, PROACTIVE, AND RESULTS-ORIENTED. YOU SHOULD HAVE PREVIOUS EXPERIENCE IN SALES, MARKETING, OR BUSINESS DEVELOPMENT, PREFERABLY IN A B2B ENVIRONMENT. YOU SHOULD ALSO BE FAMILIAR WITH CRM SOFTWARE AND SOCIAL MEDIA PLATFORMS.\n\nAS A BUSINESS DEVELOPMENT REPRESENTATIVE, YOU WILL\n\nRESEARCH AND IDENTIFY NEW MARKETS AND CUSTOMER NEEDSCONTACT POTENTIAL CLIENTS THROUGH COLD CALLS, EMAILS, AND SOCIAL MEDIAPRESENT OUR COMPANY AND PRODUCTS/SERVICES IN A PROFESSIONAL AND ENGAGING MANNERQUALIFY LEADS AND SCHEDULE MEETINGS OR CALLS WITH DECISION-MAKERSPLAN AND EXECUTE EVENTS, SUCH AS WEBINARS, WORKSHOPS, NETWORKING SESSIONS, AND TRADE SHOWS, TO SHOWCASE OUR BRAND AND GENERATE LEADSFOLLOW UP WITH ATTENDEES AND PROSPECTS AND PROVIDE FEEDBACK TO THE SALES TEAMCOLLABORATE WITH THE MARKETING AND SALES TEAMS TO DEVELOP AND IMPLEMENT EFFECTIVE STRATEGIES AND CAMPAIGNSTRACK AND REPORT ON YOUR PERFORMANCE AND PROGRESS USING CRM SOFTWARE AND OTHER TOOLSSTAY UP-TO-DATE WITH INDUSTRY TRENDS, BEST PRACTICES, AND COMPETITORS’ ACTIVITIES\n\nREQUIREMENTS\n\nBACHELOR’S DEGREE IN MARKETING, BUSINESS ADMINISTRATION, OR RELEVANT FIELD PREFERRED BUT NOT REQUIREDPROVEN WORK EXPERIENCE AS A BUSINESS DEVELOPMENT REPRESENTATIVE, SALES ACCOUNT EXECUTIVE, OR SIMILAR ROLEHANDS-ON EXPERIENCE WITH MULTIPLE SALES TECHNIQUES, INCLUDING COLD CALLS, EMAILS, AND SOCIAL SELLINGTRACK RECORD OF ACHIEVING SALES QUOTAS AND KPISEXPERIENCE WITH CRM SOFTWARE, SUCH AS SALESFORCE, HUBSPOT, OR ZOHOFAMILIARITY WITH SOCIAL MEDIA PLATFORMS, SUCH AS LINKEDIN, TWITTER, AND FACEBOOKEXCELLENT COMMUNICATION, NEGOTIATION, AND PRESENTATION SKILLSABILITY TO WORK INDEPENDENTLY AND AS PART OF A TEAMABILITY TO MULTITASK, PRIORITIZE, AND MANAGE TIME EFFECTIVELYCREATIVITY, ENTHUSIASM, AND PASSION FOR SALES AND MARKETINGWILLINGNESS TO TRAVEL AND ATTEND EVENTS AS NEEDED\n\nBENEFITS\n\nCOMPETITIVE SALARY AND COMMISSION STRUCTUREFLEXIBLE WORK HOURS AND LOCATIONHEALTH INSURANCE AND WELLNESS PROGRAMSPAID VACATION AND SICK LEAVETRAINING AND CAREER DEVELOPMENT OPPORTUNITIESFUN AND SUPPORTIVE WORK ENVIRONMENTRECOGNITION AND REWARDS FOR YOUR ACHIEVEMENTS\n\nIF YOU ARE INTERESTED IN THIS POSITION, PLEASE SEND YOUR RESUME AND COVER LETTER TO [EMAIL]. WE ARE EXCITED TO HEAR FROM YOU!\n\n$65,000 - $75,000 BASE SALARY + COMMISSION + GREAT BENEFITS/401K\n\n#IND2",
    "job_skill_set": [
      "sales techniques",
      "event planning",
      "communication",
      "interpersonal skills",
      "customer service",
      "creativity",
      "proactivity",
      "results-oriented",
      "negotiation",
      "teamwork",
      "time management",
      "multitasking",
      "CRM software",
      "social media platforms",
      "market research",
      "data tracking and reporting"
    ],
    "short_keywords": [
      "and",
      "business",
      "businessdevelopment",
      "communication",
      "creativity",
      "crm",
      "customer",
      "data",
      "development",
      "event",
      "interpersonal",
      "management",
      "market",
      "media",
      "multitasking",
      "negotiation",
      "planning",
      "platforms",
      "proactivity",
      "reporting",
      "representative",
      "research",
      "resultsoriented",
      "sales",
      "service",
      "skills",
      "social",
      "software",
      "teamwork",
      "techniques",
      "time",
      "tracking"
    ]
  },
  {
    "job_id": "3904391522",
    "job_title": "Director, Business Development",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "DO YOU WANT TO HELP REVOLUTIONIZE A MAJOR INDUSTRY? AT UNIBAIL-RODAMCO-WESTFIELD (URW), YOU’LL HAVE THE OPPORTUNITY TO IMPACT THE FUTURE OF REAL ESTATE BY DEVELOPING INNOVATIVE AND ENGAGING PLACES THAT REINVENT BEING TOGETHER. COME JOIN A TEAM THAT BUILDS EXCITEMENT ABOUT WORKING AT URW. YOU’LL GET TO WORK WITH LEADERS WHO ARE PASSIONATE ABOUT TACKLING CHANGING CONSUMER BEHAVIOR WITH INNOVATIVE EXPERIENCES. ALL THIS BOLD VISION MEANS THE COMPANY CULTURE EMBRACES EVOLUTION AND CHANGE. WE BELIEVE THERE IS NO \"PERFECT\" CANDIDATE AND WANT TO ENCOURAGE APPLYING EVEN IF ALL THE REQUIREMENTS LISTED AREN’T MET. IF YOU'RE PASSIONATE ABOUT URW AND LOOKING TO LEARN AND GROW, THEN WE LOOK FORWARD TO REVIEWING YOUR APPLICATION!\n\nWE ARE CURRENTLY LOOKING FOR OUR\n\nDIRECTOR, BUSINESS DEVELOPMENT\n\nWHAT WE OFFER\n\nURW’S MEDIA AND EXPERIENTIAL SALES DIVISION IS A FIRST-TO-MARKET DOOH INNOVATOR THAT CONTINUES TO LEAD THE INDUSTRY IN REAL-TIME AUDIENCE MEASUREMENT. THIS POSITION IS IDEAL FOR A STRATEGIC DIRECTOR WITH YEARS OF INTEGRATED SALES EXPERIENCE WHO ENJOYS A DYNAMIC MULTI-CHANNEL SELL. BECOME PART OF A NATIONAL SALES TEAM WHOSE PRIMARY FOCUS IS ON ENTICING TENANTS AND BRANDS THROUGH CREATIVE MARKET-ORIENTED SOLUTIONS THAT LEVERAGE URW’S WIDE-RANGE OF ASSETS, INVESTMENTS, AND RESOURCES WHICH ENABLE UNIQUE AND IMMEDIATE RESULTS.\n\nCOMPREHENSIVE SALES OFFERINGS INCLUDE\n\nSTATE OF THE ART DESIGN & TECHNOLOGY FORWARD DIGITAL SIGNAGE–THE WESTFIELD NETWORKIN-CENTER STATIC INVENTORYPROMINENT EXTERIOR SIGNAGE/BILLBOARDSEXPERIENTIAL ACTIVATIONS & POP-UPSSTRONG COLLABORATION WITH LEASING, TENANTS, CENTER MARKETING, REAL ESTATE DEVELOPMENT & EVENT PRODUCTION TEAMS\n\nABOUT THE ROLE\n\nDOES THE IDEA OF DISRUPTING THE MEDIA AND RETAIL INDUSTRY BY DEVELOPING NEW, INNOVATIVE PARTNERSHIPS EXCITE YOU? ARE YOU A DREAMER WHO LOVES TO IDEATE ON THE FUTURE AND ITS POSSIBILITIES? ARE YOU A DIFFERENCE-MAKER THAT IS ABLE TO PERSUADE OTHERS TO JOIN YOUR VISION AND DRIVE CREATIVE SOLUTIONS ON HOW TO MAKE THE IMPOSSIBLE POSSIBLE? IF YOU’RE THE TYPE OF DYNAMIC PROFESSIONAL MOTIVATED BY A HIGH ENERGY, FAST-PACED MARKET, THEN WE HAVE A ROLE FOR YOU!\n\nWE ARE SEEKING A DIRECTOR OF BUSINESS DEVELOPMENT TO JOIN OUR MEDIA & EXPERIENTIAL TEAM. REPORTING TO THE VICE PRESIDENT OF BUSINESS DEVELOPMENT, THIS ROLE WILL PLAY A KEY LEAD ROLE IN DEVELOPING AND IMPLEMENTING AN INNOVATIVE GO-TO-MARKET STRATEGY WITH A FOCUS ON ACQUIRING NEW PARTNERSHIPS, MONETIZING EXISTING PARTNERSHIPS AND GENERATING NEW REVENUE CHANNELS.\n\nHERE ARE STRENGTHS YOU POSSESS AND THE BACKGROUND YOU NEED TO BE SUCCESSFUL - \n\nDECISIVE – BLENDING ANALYSIS, WISDOM, EXPERIENCE, AND JUDGMENT, YOU ARE ABLE TO MAKE SOUND DECISIONS TO KEEP THE BUSINESS MOVING FORWARD. \n\nRESULTS DRIVEN – YOU HAVE A TRACK RECORD OF EXCEEDING GOALS. YOU ARE ABLE TO GENERATE A STRATEGY, TRANSFORM IT INTO AN ACTIONABLE PLAN, AND EXECUTE IN A TIMELY FASHION. \n\nA STRONG COMMUNICATOR – YOU ARE DESCRIBED AS OPEN MINDED AND NATURALLY CURIOUS. YOU ARE CUSTOMER, MARKET, AND PRODUCT ORIENTED. YOUR STORYTELLING SKILLS ARE IMPECCABLE SO EFFECTIVELY COMMUNICATING ACROSS DIFFERENT GROUPS WON’T BE A PROBLEM FOR YOU. \n\nA LEARNER – YOU LEARN FROM YOUR FAILURES AND YOUR SUCCESSES. YOU SEEK OPPORTUNITIES AND ASSIGNMENTS THAT BROADEN YOUR CAPABILITIES. \n\nA FORWARD THINKER – YOU ARE ALWAYS LOOKING TO DRIVE NEW BUSINESS OPPORTUNITIES AND REVENUE GROWTH WITH YOUR CLIENTS. YOU ARE ABLE TO EFFECTIVELY GROW REVENUE BY USING A 360 APPROACH IN ALL NEGOTIATIONS.\n\nNEGOTIATING & CLOSING SKILLS – YOU ARE ABLE TO NEGOTIATE AND CAN CREATIVELY FIGURE OUT WAYS TO DRIVE WIN-WIN SOLUTIONS. YOU LOOK FORWARD TO CLOSING EVERY DEAL YOU START.\n\nSCOPE \n\nRIVE NEW REVENUE GROWTH THAT ALIGNS WITH OVERALL COMPANY AND BUSINESS STRATEGY. OWN THE FULL CYCLE SALES PROCESS INCLUDING PROSPECTING NEW LEADS, IDENTIFYING POTENTIAL PARTNERSHIPS, NAVIGATING THE C-SUITE, NEGOTIATING CONTRACTS, AND CLOSING NEW AND RENEWAL BUSINESS WITH CUSTOMERS.IDENTIFY, DEVELOP, SECURE, AND MONETIZE AN EXPANDING ECOSYSTEM OF PARTNERSHIPS BY LEVERAGING INVENTORY ACROSS MULTIPLE LINES OF BUSINESS.ASSIST IN DEVELOPING THE STRATEGIC DIRECTION AND PLAN FOR REVENUE GROWTH THROUGH DIFFERENTIATED VALUE PROPOSITIONS AND SOLUTIONS. ABLE TO GENERATE A STRATEGY, TRANSFORM IT INTO AN ACTIONABLE PLAN AND EXECUTE IN A TIMELY FASHION.CREATE AND DELIVER INSIGHT-BASED, MULTI-CHANNEL SOLUTIONS TO OUR PARTNERS AND CLIENTS TO OPTIMIZE VALUE AND SUCCESS.EXECUTE A GO-TO-MARKET STRATEGY TO SECURE NEW LONG-TERM PARTNERSHIPS IN NEW VERTICALS.DEVELOP DEEP AND COMPREHENSIVE MARKET AND INDUSTRY UNDERSTANDING AND COMPETITIVE ANALYSIS BY UNDERSTANDING SALES, TRAFFIC TRENDS, DEMOGRAPHICS, AND HISTORICAL KNOWLEDGE.PROVEN SUCCESS DRIVING NEW SALES OPPORTUNITIES THROUGH STRATEGIC BUSINESS DEVELOPMENT.LEVERAGE STRATEGIC RELATIONSHIPS AND EXPERIENCE TO SELL ACROSS MULTIPLE SHOPPING CENTERS.CONFIDENTLY PROMOTE THE ADVANTAGES WESTFIELD CAN OFFER A BRAND AS AN OWNER AND OPERATOR OF OUR ASSETS.\n\nWHAT WE ARE LOOKING FOR\n\nMINIMUM OF TEN YEARS’ EXPERIENCE WORKING IN THE MEDIA (OOH, DOOH, VIDEO, OR DIGITAL) INDUSTRY.FOUR-YEAR COLLEGE DEGREE.HIGHLY EXPERIENCED IN BUILDING, GROWING, AND MAINTAINING A LARGE BOOK OF BUSINESS. ABLE TO LEVERAGE KEY INDUSTRY RELATIONSHIPS TO MAXIMIZE REVENUE AND OPPORTUNITIES. PASSIONATE ABOUT DEEPENING ESTABLISHED CUSTOMER RELATIONSHIPS.EXPERIENCE CREATING ENGAGEMENT ACROSS MULTIPLE LINES OF BUSINESS AND ABLE TO LEAD DIRECTLY AND VIA INFLUENCE TO CREATE CHANGE.HISTORY OF THRIVING IN A RAPIDLY CHANGING ENVIRONMENT.EXCELLENT WRITTEN AND ORAL PRESENTATION SKILLS.EXCELLENT ANALYTICAL SKILLS AND A DATA-DRIVEN MINDSET.\n\nCOMPENSATION\n\nEXEMPT\n\n$160,000 – $180,000 + DISCRETIONARY ANNUAL BONUS\n\nWHAT IS IMPORTANT TO US\n\nUNIBAIL-RODAMCO-WESTFIELD (URW) IS DRIVEN BY AN ENTREPRENEURIAL FOUNDATION OF TALENTED AND AMBITIOUS EMPLOYEES WHO EMBRACE CHANGE, STRIVE FOR INNOVATION, AND KNOW WHEN TO VENTURE INTO UNCHARTED TERRAIN. TEAMS WITHIN URW ARE COLLABORATIVE AND THRIVE BY WORKING TOGETHER TO SEIZE OPPORTUNITY AND SOLVE CHALLENGES. EMPLOYEES RECEIVE MENTORSHIP AND GUIDANCE WHILE BEING EMPOWERED TO DRIVE THEIR INITIATIVES, EMBRACING THEIR INDIVIDUALITY AND UNIQUE BACKGROUNDS. URW‘S FLAGSHIP DESTINATIONS ARE INTERWOVEN INTO THE COMMUNITY FABRIC, AND WE GIVE EMPLOYEES THE POWER TO BE IMPACTFUL IN THEIR WORK AND LEAD MEANINGFUL CHANGE IN OUR COMMUNITIES THROUGH VOLUNTEERING, DE&I PROGRAMMING AND LEADING ESG EFFORTS. URW IS AN INNOVATOR AND TREND SETTER IN EXPERIENTIAL ENTERTAINMENT AND IS MAKING BOLD MOVES TO BE A BRAND THAT CREATES INSPIRING CONSUMER EXPERIENCES IN-PERSON AND DIGITALLY. BREAKING BEYOND CONVENTIONAL BELIEFS, URW IS SURPRISING AND DELIGHTING CUSTOMERS BY REINVENTING BEING TOGETHER AND CREATING MEMORABLE MOMENTS.\n\nOUR COMPANY PURPOSE – TO REINVENT BEING TOGETHER – IS ABOUT REIMAGINING HOW INDIVIDUALS AND COMMUNITIES COME TOGETHER, SOCIALIZE, AND ENJOY DYNAMIC EXPERIENCES ALONGSIDE ONE ANOTHER IN ENTIRELY NEW WAYS. WE ARE AT OUR BEST WHEN WE ARE TOGETHER SAFELY AND JOYFULLY. WE ARE PLEASED TO ANNOUNCE OUR NEW HYBRID SCHEDULE WORKING 3 DAYS PER WEEK IN OUR LOS ANGELES AND NEW YORK CORPORATE OFFICES AND UP TO 2 DAYS PER WEEK REMOTELY.\n\nUNIBAIL-RODAMCO-WESTFIELD IS AN EQUAL OPPORTUNITY EMPLOYER THAT EMBRACES DIVERSITY OF BACKGROUNDS, PERSPECTIVES, EXPERIENCE, AND SKILLS. WE BELIEVE THAT DIVERSITY PLAYS AN IMPORTANT PART IN THE SUCCESS OF OUR BUSINESS, AND WE ARE COMMITTED TO CREATING AN ENVIRONMENT WHICH RESPECTS, VALUES, CELEBRATES AND MAKES THE MOST OF PEOPLE’S DIFFERENCES.\n\nWE EVALUATE QUALIFIED APPLICANTS WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, AND OTHER LEGALLY PROTECTED CHARACTERISTICS.\n\nJOIN US IN CREATING SUSTAINABLE PLACES THAT REINVENT BEING TOGETHER.\n\n",
    "job_skill_set": [
      "business development",
      "sales strategy",
      "negotiation",
      "market analysis",
      "revenue generation",
      "data analysis",
      "customer relationship management",
      "contract management",
      "communication",
      "leadership",
      "creativity",
      "decisiveness",
      "adaptability",
      "team collaboration",
      "problem solving",
      "curiosity",
      "persuasion",
      "learning agility",
      "digital signage",
      "multi-channel marketing"
    ],
    "short_keywords": [
      "adaptability",
      "agility",
      "analysis",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "contract",
      "creativity",
      "curiosity",
      "customer",
      "data",
      "decisiveness",
      "development",
      "digital",
      "director",
      "generation",
      "leadership",
      "learning",
      "management",
      "market",
      "marketing",
      "multichannel",
      "negotiation",
      "persuasion",
      "problem",
      "relationship",
      "revenue",
      "sales",
      "signage",
      "solving",
      "strategy",
      "team"
    ]
  },
  {
    "job_id": "3903870699",
    "job_title": "Partner Business Development Manager, Samsung Mobility",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "REQUISITION NUMBER: 96210 \n\nBUSINESS DEVELOPMENT MANAGER\n\nINSIGHT ENTERPRISES IS A FORTUNE 500 SOLUTIONS INTEGRATOR HELPING ORGANIZATIONS ACCELERATE TRANSFORMATION BY UNLOCKING THE POWER OF PEOPLE AND TECHNOLOGY. WITH A 35-YEAR FOUNDATION IN HARDWARE AND SOFTWARE SUPPLY CHAIN AUGMENTING OUR DEEP EXPERTISE IN CLOUD, DATA, AI, CYBERSECURITY, AND INTELLIGENT EDGE, WE GUIDE ORGANIZATIONS THROUGH COMPLEX DIGITAL DECISIONS TO ACHIEVE EXTRAORDINARY RESULTS. \n\nARE YOU A GO-GETTER WITH A HUNGER FOR SUCCESS? DO YOU THRIVE IN A HIGH-ENERGY ENVIRONMENT WHERE YOU CAN TRULY MAKE A DIFFERENCE? INSIGHT HAS AN AMAZING OPPORTUNITY FOR YOU. WE'RE IN SEARCH OF A DYNAMIC BUSINESS DEVELOPMENT MANAGER WHO CAN TAKE US TO THE NEXT LEVEL! AS PART OF OUR TEAM, YOU'LL HAVE THE CHANCE TO WORK COLLABORATIVELY WITH OUR PARTNERS TO IDENTIFY AND BRING IN NEW BUSINESS. YOU'LL ALSO LEVERAGE YOUR SKILLS TO DEVELOP UNIQUE MARKETING PROGRAMS THAT CATER TO EACH CUSTOMER CATEGORY AND SELLING PLATFORM. BY EMPLOYING COMPETITIVE STRATEGIES THAT DRIVE VENDOR PARTNERSHIPS, PRICING, AND MERCHANDISING, YOU'LL BE AN INTEGRAL PART OF OUR GROWTH AND SUCCESS. GET READY TO UNLEASH YOUR POTENTIAL AND JOIN AN EXCITING TEAM AT INSIGHT!\n\nKEY RESPONSIBILITIES\n\nENGAGE WITH VENDOR PARTNERS TO STRENGTHEN RELATIONSHIPS, FACILITATING PARTNERING ACTIVITIES AND PROGRAMS RESULTING IN POSITIVE SALES GROWTH.MEET SALES AND ACTIVITY PERFORMANCE GOALS, INCLUDING PIPELINE REPORTS BY OPPORTUNITY. COMMUNICATE MONTHLY SUMMARIES OF WINS, LOSSES, INHIBITORS, AND NET-NEW OPPORTUNITIES TO MANAGEMENT.MAINTAIN DIRECT COMMUNICATIONS WITH INSIDE AND FIELD SALES MANAGEMENT, PROMOTING COLLABORATION WITH PARTNER SALES TEAMS THROUGH FACE-TO-FACE OR VIRTUAL MEETINGS.IMPLEMENT INTERNALLY CREATED CALL CAMPAIGNS USING BUSINESS INTELLIGENCE TO IDENTIFY NEW AREAS OF OPPORTUNITIES. TRACK, MEASURE, AND REPORT CAMPAIGN SUCCESS.PRESENT INFORMATION TO TOP MANAGEMENT, PUBLIC GROUPS, AND QUARTERLY BUSINESS REVIEWS. ATTEND COMPANY, VENDOR, AND PUBLISHER TRAININGS AND WEBINARS.\n\nWHAT YOU’LL NEED TO SUCCEED \n\nBACHELOR’S DEGREE FROM A 4-YEAR COLLEGE OR UNIVERSITY.5-7+ YEARS OF RELATED PROFESSIONAL WORK EXPERIENCE AND/OR TRAINING.5+ YEARS OF RELATED IT SALES EXPERIENCE AND VENDOR KNOWLEDGE.\n\nINSIGHT IS AN EQUAL OPPORTUNITY EMPLOYER, AND ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, NATIONAL ORIGIN, DISABILITY STATUS, PROTECTED VETERAN STATUS, SEXUAL ORIENTATION OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW. \n\nSALARY: $59,000 - $90,000 + VARIABLE INCENTIVE\n\nTHE POSITION DESCRIBED ABOVE PROVIDES A SUMMARY OF SOME OF THE JOB DUTIES REQUIRED AND WHAT IT WOULD BE LIKE TO WORK AT INSIGHT. FOR A COMPREHENSIVE LIST OF PHYSICAL DEMANDS AND WORK ENVIRONMENT FOR THIS POSITION, CLICK HERE.\n\nINSIGHT IS AN EQUAL OPPORTUNITY EMPLOYER, AND ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, NATIONAL ORIGIN, DISABILITY STATUS, PROTECTED VETERAN STATUS, SEXUAL ORIENTATION OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW.\n\nPOSTING NOTES: REMOTE || ARIZONA (US-AZ) || UNITED STATES (US) || SALES/BUSINESS DEVELOPMENT || NONE || REMOTE ||",
    "job_skill_set": [
      "business development",
      "communication",
      "relationship building",
      "problem solving",
      "initiative",
      "IT sales",
      "vendor management",
      "data analysis",
      "marketing programs",
      "pipeline reporting",
      "business intelligence",
      "sales strategy",
      "presentation skills",
      "collaboration",
      "adaptability",
      "teamwork",
      "time management"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "building",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "data",
      "development",
      "initiative",
      "intelligence",
      "it",
      "management",
      "manager",
      "marketing",
      "mobility",
      "partner",
      "pipeline",
      "presentation",
      "problem",
      "programs",
      "relationship",
      "reporting",
      "sales",
      "samsung",
      "skills",
      "solving",
      "strategy",
      "teamwork",
      "time",
      "vendor"
    ]
  },
  {
    "job_id": "3901494331",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "MISSION ORDERSTHE BUSINESS DEVELOPMENT REPRESENTATIVE WILL SEEK OUT NEW BUSINESS OPPORTUNITIES BY REACHING OUT TO AND DEVELOPING BUSINESS RELATIONSHIPS WITH PROSPECTIVE CUSTOMERS IN ORDER TO BOOK SALES MEETINGS FOR OUR ACCOUNT EXECUTIVES THAT RESULT IN NEW CUSTOMERS. AN IDEAL BDR WOULD HAVE PRIOR BACKGROUND IN A SALES OR TELEMARKETING ENVIRONMENT TARGETING A LARGE VOLUME OF CUSTOMERS/PROSPECTS. \nOUTCOMES\nCONDUCT OUTBOUND PROSPECTING AND WITH OUR SALES, MARKETING & EVENT LEADS THAT DRIVES PIPELINE GROWTH:CONTACT PROSPECTIVE CLIENTS THROUGH CALLS, SOCIAL MEDIA, AND EMAILS.SCHEDULE SALES MEETINGS BETWEEN PROSPECTS AND ACCOUNT EXECUTIVES.\nWITHIN 30 DAYS YOU’RE CONVERSANT IN CREDENTIALING/NETWORK DEVELOPMENT AND ABLE TO HELP CLIENTS UNDERSTAND THEIR OWN NEEDS AND HOW OUR SOLUTIONS SOLVE THEIR BIG CHALLENGES:WHAT CREDENTIALING IS, WHY IT’S IMPORTANT AND HOW IT IMPACTS DIFFERENT CLIENT SEGMENTS DIFFERENTLYWHAT NETWORK DEVELOPMENT IS, WHY IT’S IMPORTANT AND HOW IT IMPACTS DIFFERENT CLIENT SEGMENTS DIFFERENTLY\nMEETING QUOTA METRICS WITHIN 90 DAYS:IDENTIFY, QUALIFY INBOUND LEADS.SCHEDULE INITIAL MEETINGS WITH ACCOUNT EXECUTIVES THAT YIELD OPPORTUNITIES.\nEVERY CLIENT YOU SELL UNDERSTANDS THAT WE’RE NOT JUST ANOTHER SERVICE/SOFTWARE VENDOR. ANDROS IS A PARTNER TO OUR CLIENTS TO HELP THEM RUN AND GROW THEIR BUSINESSES MORE EFFECTIVELY RESULTING IN CONTRACT RENEWALS AND YEAR OVER YEAR GROWTH IN CLIENT REVENUE.\nROLE-SPECIFIC COMPETENCIES \nRESILIENT - ABLE TO WORK THROUGH AND OVERCOME CHALLENGES, EXPERIMENT WITH DIFFERENT APPROACHES TO FIND WHAT WORKS, AND MAINTAIN A POSITIVE SPIRIT.STRATEGIC- ABLE TO CREATE A TACTICAL STRATEGY THAT MEETS THE NEEDS OF THE VARIOUS BUYING INFLUENCES PER OPPORTUNITY FROM QUALIFICATION THROUGHTACTICAL- ABILITY TO DEMONSTRATE HOW OUR PRODUCT WILL MEET A SPECIFIC NEED AND PROCESS, WELL VERSED IN CREDENTIALING/NETWORK DEVELOPMENT AND OUR CAPABILITIESENTHUSIASM — EXHIBITS EXCITEMENT AND PASSION OVER WORK. HAS A CAN-DO ATTITUDE.PERSISTENCE — DEMONSTRATES TENACITY AND WILLINGNESS TO GO THE DISTANCE TO GET THE DEAL DONE.DRIVE — HAS AN INNER FIRE THAT PUSHES HIM/HER TO BYPASS PERSONAL GOALS AND TAKE PRIDE IN ASSISTING CLIENTS AND THE COMPANY TO REACH THEIR GOALSCOACHABLE — ABLE TO RECEIVE CONSTRUCTIVE CRITICISM AND WILLING TO MAKE CHANGES TO INCREASE HIS/HER PERSONAL AND COMPANY SUCCESS.\nDESIRED QUALIFICATIONS:\n3+ YEARS OF EXPERIENCE IN A SALES OR MARKETING ROLEHEALTHCARE EXPERIENCE IS A BONUSEXPERIENCE SELLING SERVICES IS A BONUS\nNOTE: THIS ROLE HAS ADDITIONAL INCENTIVE COMPENSATION.",
    "job_skill_set": [
      "sales",
      "outbound prospecting",
      "email communication",
      "network development",
      "pipeline growth",
      "client relationship management",
      "meeting scheduling",
      "resilience",
      "strategic thinking",
      "enthusiasm",
      "persistence",
      "drive",
      "coachability",
      "telemarketing",
      "social media outreach",
      "credentialing"
    ],
    "short_keywords": [
      "business",
      "businessdevelopment",
      "client",
      "coachability",
      "communication",
      "credentialing",
      "development",
      "drive",
      "email",
      "enthusiasm",
      "growth",
      "management",
      "media",
      "meeting",
      "network",
      "outbound",
      "outreach",
      "persistence",
      "pipeline",
      "prospecting",
      "relationship",
      "representative",
      "resilience",
      "sales",
      "scheduling",
      "social",
      "strategic",
      "telemarketing",
      "thinking"
    ]
  },
  {
    "job_id": "3904057898",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "LOCATION: REMOTE, US\nABOUT US\nGROWTH ENGINE IS A DYNAMIC AND INNOVATIVE GROWTH AGENCY WITH OPERATIONS ACROSS THE US, LATAM, AUSTRALIA, UK, SOUTH AFRICA, GERMANY AND THE MIDDLE EAST. WE ARE LEADERS IN BOTH DIRECT SALES AND CHANNEL PARTNERSHIPS ACROSS SMB, MID-MARKET, AND ENTERPRISE AUDIENCES. WE PARTNER WITH OUR CLIENTS TO IDENTIFY OPPORTUNITIES, OVERCOME CHALLENGES, AND ACHIEVE THEIR GROWTH OBJECTIVES.\nPOSITION OVERVIEW:\nWE ARE SEEKING A MOTIVATED AND RESULTS-DRIVEN BUSINESS DEVELOPMENT REPRESENTATIVE TO JOIN OUR TEAM. THE IDEAL CANDIDATE WILL BE RESPONSIBLE FOR GENERATING LEADS, QUALIFYING PROSPECTS, AND DRIVING NEW BUSINESS OPPORTUNITIES FOR OUR CLIENTS. THE BUSINESS DEVELOPMENT REPRESENTATIVE WILL PLAY A KEY ROLE IN EXPANDING OUR CLIENT BASE AND CONTRIBUTING TO THE OVERALL GROWTH AND SUCCESS OF THE AGENCY.\nKEY RESPONSIBILITIES:\nPROSPECT AND IDENTIFY POTENTIAL CLIENTS THROUGH RESEARCH, NETWORKING, AND OUTREACH EFFORTS.CONDUCT OUTBOUND LEAD GENERATION ACTIVITIES, INCLUDING COLD CALLING, EMAILING, AND SOCIAL SELLING, TO INITIATE CONVERSATIONS WITH DECISION-MAKERS.QUALIFY LEADS BY UNDERSTANDING THEIR BUSINESS NEEDS, CHALLENGES, AND GOALS, AND DETERMINING THEIR FIT FOR OUR CLIENTS SERVICES.COLLABORATE WITH THE SALES AND MARKETING TEAMS TO DEVELOP AND EXECUTE TARGETED OUTREACH CAMPAIGNS AND STRATEGIES.BUILD AND MAINTAIN A PIPELINE OF QUALIFIED LEADS AND OPPORTUNITIES, AND EFFECTIVELY MANAGE LEAD DATA AND ACTIVITIES IN OUR CRM SYSTEM.SCHEDULE AND COORDINATE MEETINGS, PRESENTATIONS, AND DEMOS WITH PROSPECTS TO SHOWCASE OUR CLIENT’S SERVICES AND VALUE PROPOSITION.WORK CLOSELY WITH SENIOR MANAGEMENT TO DEVELOP AND REFINE SALES STRATEGIES, MESSAGING, AND PROCESSES TO OPTIMIZE LEAD GENERATION AND CONVERSION.STAY INFORMED ABOUT INDUSTRY TRENDS, MARKET DEVELOPMENTS, AND COMPETITOR ACTIVITIES TO IDENTIFY NEW OPPORTUNITIES AND MAINTAIN A COMPETITIVE EDGE.\nQUALIFICATIONS:\nBACHELOR'S DEGREE IN BUSINESS ADMINISTRATION, MARKETING, SALES, OR RELATED FIELD.PROVEN TRACK RECORD OF SUCCESS IN A BUSINESS DEVELOPMENT, SALES, OR OUTBOUND PROSPECTING ROLE, PREFERABLY IN A B2B ENVIRONMENT.STRONG COMMUNICATION AND INTERPERSONAL SKILLS, WITH THE ABILITY TO EFFECTIVELY ENGAGE AND BUILD RELATIONSHIPS WITH PROSPECTS AND CLIENTS.SELF-MOTIVATED AND PROACTIVE ATTITUDE, WITH A DRIVE TO ACHIEVE AND EXCEED TARGETS AND OBJECTIVES.EXCELLENT ORGANIZATIONAL AND TIME MANAGEMENT SKILLS, WITH THE ABILITY TO PRIORITIZE TASKS AND MANAGE MULTIPLE PROJECTS SIMULTANEOUSLY.EXPERIENCE USING CRM SOFTWARE (E.G., SALESFORCE, HUBSPOT) AND OTHER SALES AND MARKETING TOOLS IS A PLUS.KNOWLEDGE OF DIGITAL MARKETING, OUTBOUND AND INBOUND MARKETING, OR GROWTH HACKING PRINCIPLES IS DESIRABLE.ABILITY TO WORK INDEPENDENTLY AS WELL AS PART OF A COLLABORATIVE TEAM ENVIRONMENT.\nBENEFITS:\nCOMPETITIVE SALARY, BENEFITS AND COMMISSION STRUCTUREOPPORTUNITIES FOR CAREER GROWTH AND ADVANCEMENT WITHIN A FAST-PACED AND ENTREPRENEURIAL ENVIRONMENTONGOING TRAINING AND PROFESSIONAL DEVELOPMENT OPPORTUNITIESFLEXIBLE WORK SCHEDULE AND REMOTE WORK OPTIONS\nIF YOU ARE A MOTIVATED AND AMBITIOUS INDIVIDUAL WITH A PASSION FOR DRIVING BUSINESS GROWTH AND BUILDING RELATIONSHIPS, WE WANT TO HEAR FROM YOU!\n\n",
    "job_skill_set": [
      "lead generation",
      "CRM software",
      "digital marketing",
      "outbound marketing",
      "inbound marketing",
      "sales strategies",
      "data management",
      "communication",
      "interpersonal skills",
      "self-motivation",
      "organizational skills",
      "time management",
      "team collaboration",
      "problem solving"
    ],
    "short_keywords": [
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "crm",
      "data",
      "development",
      "digital",
      "generation",
      "inbound",
      "interpersonal",
      "lead",
      "management",
      "marketing",
      "organizational",
      "outbound",
      "problem",
      "representative",
      "sales",
      "selfmotivation",
      "skills",
      "software",
      "solving",
      "strategies",
      "team",
      "time"
    ]
  },
  {
    "job_id": "3905365045",
    "job_title": "Director, Business Development, Global Commercial Oncology",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "COMPANY DESCRIPTION\n\nABBVIE'S MISSION IS TO DISCOVER AND DELIVER INNOVATIVE MEDICINES AND SOLUTIONS THAT SOLVE SERIOUS HEALTH ISSUES TODAY AND ADDRESS THE MEDICAL CHALLENGES OF TOMORROW. WE STRIVE TO HAVE A REMARKABLE IMPACT ON PEOPLE'S LIVES ACROSS SEVERAL KEY THERAPEUTIC AREAS – IMMUNOLOGY, ONCOLOGY, NEUROSCIENCE, AND EYE CARE – AND PRODUCTS AND SERVICES IN OUR ALLERGAN AESTHETICS PORTFOLIO. FOR MORE INFORMATION ABOUT ABBVIE, PLEASE VISIT US AT WWW.ABBVIE.COM. FOLLOW @ABBVIE ON TWITTER, FACEBOOK, INSTAGRAM, YOUTUBE AND LINKEDIN.\n\nJOB DESCRIPTION\n\nTHE DIRECTOR, BUSINESS DEVELOPMENT, GLOBAL COMMERCIAL DEVELOPMENT WILL REPORT TO THE DIRECTOR, PIPELINE COMMERCIALIZATION & STRATEGY, ONCOLOGY. THIS PERSON WILL PLAY AN INTEGRAL DRIVING ROLE IN THE SOURCING AND EVALUATION OF NEW INVESTMENT OPPORTUNITIES THROUGH THE LEADERSHIP AND MANAGEMENT OF COMMERCIAL ASSESSMENTS RELATED TO THE TA STRATEGY AND DUE DILIGENCE. THIS INDIVIDUAL WILL ALSO PLAY AN INTEGRAL DRIVING ROLE IN THE THERAPEUTIC AREA’S BUSINESS DEVELOPMENT PROCESS INTERNALLY AND EXTERNALLY WITH OTHER BIOPHARMACEUTICAL COMPANIES TARGETING LICENSING/ACQUISITION OF KEY THERAPEUTIC ASSETS, R&D COLLABORATIONS, AND RELATED ENABLING COLLABORATIONS.\n\nTHE SUCCESSFUL CANDIDATE WILL HAVE A STRONG SCIENTIFIC, COMMERCIAL, AND/OR CLINICAL BACKGROUND AND BE ABLE TO UNDERSTAND BUSINESS PRINCIPLES AND MARKET DYNAMICS ACROSS VARIOUS DISEASE AREAS AND INDICATIONS WITHIN THE ONCOLOGY SOLID TUMORS AND HEMATOLOGY SECTORS. SPECIFIC ACTIVITIES WILL INCLUDE WORKING WITH THE SEARCH & EVALUATION AND BD&A TRANSACTIONS TEAMS TO SUPPORT EXECUTION OF THE BD STRATEGY, PLAN & PREPARE COMMERCIAL DILIGENCE PRESENTATIONS, GUIDING PRODUCT FORECASTING AND P&L GENERATION AND WORK WITH THE BUSINESS INSIGHTS TEAM TO PERFORM MARKET INSIGHTS GENERATION AND GATHER SECONDARY ANALYTICS. THE POSITION PROVIDES THE OPPORTUNITY TO WORK WITH A VARIETY OF KEY STAKEHOLDERS, INCLUDING BUT NOT LIMITED TO: SEARCH AND EVALUATION, LICENSING & ACQUISITION, CLINICAL, DISCOVERY, REGULATORY, MARKET ACCESS, HEALTH ECONOMICS, US & GLOBAL COMMERCIAL, FORECASTING, FINANCE, AND MARKET RESEARCH PARTNERS. DUE TO THE CROSS-PORTFOLIO NATURE OF THE ROLE, THE CANDIDATE WILL ALSO BE INVOLVED IN THE PREPARATION OF OTHER STRATEGIC INITIATIVES, INCLUDING CONTRIBUTIONS FOR BD STRATEGY INTO THE LONG-RANGE PLANNING PROCESS AND INPUT INTO DISEASE AREA STRATEGIES.\n\nKEY RESPONSIBILITIES INCLUDE:\n\nWORK WITH INTERNAL RESEARCH, DEVELOPMENT, SEARCH AND EVALUATION, COMMERCIAL AND FINANCIAL ANALYTICS EXPERTS ON THE EVALUATION, DUE DILIGENCE, AND INITIAL PRODUCT DEVELOPMENT PLAN FOR PROPOSED TRANSACTIONS. THIS INCLUDES SUPPORTING THE OVERALL PRODUCT EVALUATION PROCESS, INCLUDING CLINICAL / SCIENTIFIC ASSESSMENTS, EVALUATION OF THE COMMERCIAL OPPORTUNITY, ANALYSIS OF THE COMPETITIVE LANDSCAPE, AND FINANCIAL MODELINGSERVE AS COMMERCIAL LEAD FOR INTERNAL DUE DILIGENCE PROCESS WITH CLINICAL, COMMERCIAL, REGULATORY, FINANCE, LEGAL & IP, AND MANUFACTURING, TO CONDUCT DETAILED EVALUATION PROCESSLEAD COMMERCIAL DUE DILIGENCE OF EXTERNAL ASSETS AND ENSURE THAT TIGHT TIMELINES ARE ON TRACKPARTNER WITH THE COMMERCIAL DISEASE AREA AND CLINICAL TEAMS TO GENERATE PRODUCT PROFILES FOR EXTERNAL ASSET EVALUATIONSWORK WITH THE BUSINESS INSIGHTS TEAM TO PERFORM ANY NEEDED MARKET ASSESSMENTSPROVIDE INPUT ON CLINICAL DEVELOPMENT PLANS FOR EXTERNAL ASSET EVALUATIONSGUIDE THE FORECASTING TEAM IN EXTERNAL ASSET SALES MODELINGPARTNER WITH BUSINESS DEVELOPMENT COMMERCIAL TEAMS IN P&L GENERATION, INCLUDING OPERATING EXPENSE ASSUMPTIONSFRAME UP STRATEGIC AND FINANCIAL BENEFITS OF DEALS UNDER EVALUATIONGENERATE AND PRESENT CLEAR AND CONCISE COMMERCIAL DILIGENCE DECKS TO SENIOR LEADERSHIPATTEND SCIENTIFIC AND MEDICAL CONFERENCES TO STAY ABREAST OF NEW DEVELOPMENTS IN KEY THERAPEUTIC AREAS\n\nQUALIFICATIONS\n\nBASIC:\n\nBACHELOR'S DEGREE REQUIRED8+ YEARS OF EXPERIENCE IN MANAGEMENT CONSULTING, INVESTMENT BANKING / INVESTING / FINANCE, BIOTECHNOLOGY OR PHARMACEUTICAL COMPANY IS REQUIREDONCOLOGY EXPERIENCE REQUIRED\n\nPREFERRED: \n\nADVANCED DEGREE (MBA, PH.D. OR M.D.)EXPERIENCE IN BD WITHIN A BIOTECH, CONSULTANCY, OR PHARMACEUTICAL COMPANYROBUST UNDERSTANDING OF THE FULL DRUG DEVELOPMENT PROCESS, LIFECYCLE MANAGEMENT AND COMMERCIALIZATION OF THERAPEUTICSSTRONG ONCOLOGY THERAPEUTIC AND CLINICAL KNOWLEDGESTRONG ANALYTIC AND STRATEGIC SKILLSABLE TO BUILD AND OWN A DEAL MODEL, GENERATE REVENUE FORECASTS AND P&L MODELSIMPECCABLE INTEGRITY, WORK ETHIC AND COMMITMENTDEMONSTRATED ABILITY TO WORK COLLABORATIVELY AND PROACTIVELY, POSSESS HIGH DEGREE OF PLANNING, COORDINATION, PROJECT MANAGEMENT SKILLS, WITH DEMONSTRATED ABILITY TO PROBLEM SOLVEABILITY TO PRODUCE CRISP AND COMPELLING PRESENTATIONS THAT ARE EXECUTIVE-READYORGANIZED, DETAIL-ORIENTED PERSONALITY WITH THE ABILITY TO MULTI-TASKTEAM PLAYER WITH STRONG INTERPERSONAL SKILLS WHO ENJOYS WORKING IN A COLLABORATIVE FIRM CULTURE\n\nKEY LEADERSHIP COMPETENCIES:\n\nBUILDS STRONG RELATIONSHIPS WITH PEERS AND CROSS FUNCTIONALLY WITH PARTNERS OUTSIDE OF TEAM TO ENABLE HIGHER PERFORMANCEEXECUTIVE PRESENCE: EXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLS; EXCELLENT LEADERSHIP/INFLUENCING SKILLS; ADEPT AT MANAGING INTERNAL STAKEHOLDERS (E.G., R&D, COMMERCIAL, ETC.) AND EXTERNAL COMMUNICATIONSLEARNS FAST, GRASPS THE 'ESSENCE' AND CAN CHANGE THE COURSE QUICKLY WHERE AND WHEN REQUIREDDEMONSTRATED ABILITY TO WORK COLLABORATIVELY AND PROACTIVELY, POSSESS HIGH DEGREE OF PLANNING, COORDINATION, PROJECT MANAGEMENT SKILLS, WITH DEMONSTRATED ABILITY TO PROBLEM SOLVE AND RESOLVE CONFLICT RAISES THE BAR AND IS NEVER SATISFIED WITH THE STATUS QUOCREATES A LEARNING ENVIRONMENT, OPEN TO SUGGESTIONS AND EXPERIMENTATION FOR IMPROVEMENTINTELLECTUALLY CURIOUS, EMBRACES THE IDEAS OF OTHERS, NURTURES INNOVATION AND MANAGES INNOVATION TO REALITY\n\nADDITIONAL INFORMATION\n\nAPPLICABLE ONLY TO APPLICANTS APPLYING TO A POSITION IN ANY LOCATION WITH PAY DISCLOSURE REQUIREMENTS UNDER STATE OR LOCAL LAW:\n\nTHE COMPENSATION RANGE DESCRIBED BELOW IS THE RANGE OF POSSIBLE BASE PAY COMPENSATION THAT THE COMPANY BELIEVES IN GOOD FAITH IT WILL PAY FOR THIS ROLE AT THE TIME OF THIS POSTING BASED ON THE JOB GRADE FOR THIS POSITION. INDIVIDUAL COMPENSATION PAID WITHIN THIS RANGE WILL DEPEND ON MANY FACTORS INCLUDING GEOGRAPHIC LOCATION, AND WE MAY ULTIMATELY PAY MORE OR LESS THAN THE POSTED RANGE. THIS RANGE MAY BE MODIFIED IN THE FUTURE. WE OFFER A COMPREHENSIVE PACKAGE OF BENEFITS INCLUDING PAID TIME OFF (VACATION, HOLIDAYS, SICK), MEDICAL/DENTAL/VISION INSURANCE AND 401(K) TO ELIGIBLE EMPLOYEES. THIS JOB IS ELIGIBLE TO PARTICIPATE IN OUR SHORT-TERM INCENTIVE PROGRAMS. THIS JOB IS ELIGIBLE TO PARTICIPATE IN OUR LONG-TERM INCENTIVE PROGRAMS \n\nNOTE: NO AMOUNT OF PAY IS CONSIDERED TO BE WAGES OR COMPENSATION UNTIL SUCH AMOUNT IS EARNED, VESTED, AND DETERMINABLE. THE AMOUNT AND AVAILABILITY OF ANY BONUS, COMMISSION, INCENTIVE, BENEFITS, OR ANY OTHER FORM OF COMPENSATION AND BENEFITS THAT ARE ALLOCABLE TO A PARTICULAR EMPLOYEE REMAINS IN THE COMPANY'S SOLE AND ABSOLUTE DISCRETION UNLESS AND UNTIL PAID AND MAY BE MODIFIED AT THE COMPANY’S SOLE AND ABSOLUTE DISCRETION, CONSISTENT WITH APPLICABLE LAW.\n\nABBVIE IS COMMITTED TO OPERATING WITH INTEGRITY, DRIVING INNOVATION, TRANSFORMING LIVES, SERVING OUR COMMUNITY AND EMBRACING DIVERSITY AND INCLUSION. IT IS ABBVIE’S POLICY TO EMPLOY QUALIFIED PERSONS OF THE GREATEST ABILITY WITHOUT DISCRIMINATION AGAINST ANY EMPLOYEE OR APPLICANT FOR EMPLOYMENT BECAUSE OF RACE, COLOR, RELIGION, NATIONAL ORIGIN, AGE, SEX (INCLUDING PREGNANCY), PHYSICAL OR MENTAL DISABILITY, MEDICAL CONDITION, GENETIC INFORMATION, GENDER IDENTITY OR EXPRESSION, SEXUAL ORIENTATION, MARITAL STATUS, STATUS AS A PROTECTED VETERAN, OR ANY OTHER LEGALLY PROTECTED GROUP STATUS.",
    "job_skill_set": [
      "business development",
      "financial modeling",
      "P&L generation",
      "project management",
      "data analysis",
      "revenue forecasting",
      "communication",
      "teamwork",
      "problem solving",
      "leadership",
      "interpersonal skills",
      "planning",
      "collaboration",
      "organizational skills",
      "presentation skills",
      "oncology",
      "market assessment",
      "clinical development",
      "strategic planning",
      "commercial diligence",
      "licensing and acquisition",
      "drug development process",
      "adaptability",
      "integrity",
      "intellectual curiosity"
    ],
    "short_keywords": [
      "acquisition",
      "adaptability",
      "analysis",
      "and",
      "assessment",
      "business",
      "businessdevelopment",
      "clinical",
      "collaboration",
      "commercial",
      "communication",
      "curiosity",
      "data",
      "development",
      "diligence",
      "director",
      "drug",
      "financial",
      "forecasting",
      "generation",
      "global",
      "integrity",
      "intellectual",
      "interpersonal",
      "leadership",
      "licensing",
      "management",
      "market",
      "modeling",
      "oncology",
      "organizational",
      "pl",
      "planning",
      "presentation",
      "problem",
      "process",
      "project",
      "revenue",
      "skills",
      "solving",
      "strategic",
      "teamwork"
    ]
  },
  {
    "job_id": "3902366590",
    "job_title": "Business Development Intern (Remote)",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "WEEX GLOBAL EXCHANGE IS LOOKING FOR A BUSINESS DEVELOPMENT INTERN TO JOIN OUR AFFILIATE RECRUITMENT TEAM.\n\nTHE BUSINESS DEVELOPMENT INTERN WILL PLAY A CRITICAL ROLE IN IDENTIFYING, DEVELOPING, AND MANAGING RELATIONSHIPS WITH KEY INFLUENCERS, CRYPTO TRADING CLUBS, AND CRYPTO COMMUNITY LEADERS WITHIN ALL WESTERN ENGLISH-SPEAKING MARKETS.\n\nTHE IDEAL CANDIDATE IS ALREADY KNOWLEDGEABLE OF THE INFLUENCER AND CRYPTOCURRENCY ECOSYSTEM, HAS ATTENDED MULTIPLE CRYPTO EVENTS OR CRYPTO CONFERENCES IN THE PAST, AND IS PERSONALLY EXPERIENCED WITH TRADING ON BOTH DECENTRALIZED AND CENTRALIZED EXCHANGES FOR AT LEAST 2 YEARS.\n\nRESPONSIBILITIES:\n\nPROACTIVELY GENERATE NEW INFLUENCER LEADS, AND ESTABLISH WIN-WIN PARTNERSHIPS FOR THEIR TRADING COMMUNITIES + OUR EXCHANGE;ENGAGE AND COORDINATE WITH INFLUENCERS TO PROMOTE OUR TIME SENSITIVE MARKETING INITIATIVES;BECOME FULLY IMMERSED IN THE AUDIENCE AND COMMUNITIES SURROUNDING OUR KEY INFLUENCERS AND THE PROJECTS THEY SUPPORT;BE THE FRONT-FACING POINT OF CONTACT IN THE AFFILIATE-PRODUCT RELATIONSHIP;WORK CLOSELY WITH THE OPERATIONS TEAM TO ENSURE EFFECTIVE COMMUNICATION WITH ALL THE PARTNER RELATIONSHIPS YOU MANAGE.\n\nREQUIREMENTS:\n2+ YEARS OF TRADING EXPERIENCE ON DECENTRALIZED AND CENTRALIZED EXCHANGES;DEEP FAMILIARITY OF THE CRYPTO INFLUENCER LANDSCAPE;EXCELLENT COMMUNICATION AND PRESENTATION SKILLS;LOCATED IN NORTH AMERICA, US, CANADA, EUROPE AND MEXICO ONLY.",
    "job_skill_set": [
      "communication",
      "presentation skills",
      "relationship management",
      "market research",
      "proactivity",
      "teamwork",
      "adaptability",
      "networking",
      "customer service",
      "cryptocurrency",
      "trading",
      "influencer marketing",
      "affiliate marketing"
    ],
    "short_keywords": [
      "adaptability",
      "affiliate",
      "business",
      "businessdevelopment",
      "communication",
      "cryptocurrency",
      "customer",
      "development",
      "influencer",
      "intern",
      "management",
      "market",
      "marketing",
      "networking",
      "presentation",
      "proactivity",
      "relationship",
      "remote",
      "research",
      "service",
      "skills",
      "teamwork",
      "trading"
    ]
  },
  {
    "job_id": "3888939786",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "WHY IT’S WORTH IT:\n\nARE YOU A COMPETITIVE SELF-STARTER WHO IS PASSIONATE ABOUT SALES? AS A BUSINESS DEVELOPMENT REPRESENTATIVE, YOU WILL HAVE THE CHANCE TO CONNECT RELIAQUEST TO THE WORLD’S MOST TRUSTED BRANDS AND BUILD RELATIONSHIPS WITH THOUGHT LEADERS IN ONE OF THE FASTEST GROWING INDUSTRIES. IN ADDITION TO THE UNCAPPED COMMISSION AND UNMATCHED SALES TRAINING YOU WILL RECEIVE, YOU WILL MAKE A DIRECT IMPACT ON RELIAQUEST’S EXPONENTIAL GROWTH AND GLOBAL EXPANSION, WHILE YOU GROW YOUR CAREER IN A PROMOTE FROM WITHIN CULTURE. ULTIMATELY, PURSUING THIS POSITION AT RQ WILL HAVE YOU WORK ALONGSIDE SOME OF THE MOST TALENTED PEOPLE IN THE BUSINESS AS WELL AS OPEN THE DOORS TO A LONG AND SUCCESSFUL SALES CAREER.\n\nTHE EVERYDAY HUSTLE:\n\nRESEARCH ACCOUNTS, IDENTIFY KEY PLAYERS, AND GENERATE INTEREST BY LEVERAGING THE KNOWLEDGE OF THE CYBER SECURITY INDUSTRY AND RELIAQUEST’S PLATFORM, GREYMATTER.SOURCE NEW SALES OPPORTUNITIES THROUGH INBOUND LEAD FOLLOW-UP, OUTBOUND COLD CALLS, AND EMAILS WITHIN A GIVEN GEOGRAPHIC MARKET.UNDERSTAND CUSTOMER NEEDS AND REQUIREMENTS AND COMMUNICATE PRODUCT FEATURES/BENEFITS CLEARLY, CONSISTENTLY, AND WITH INTEGRITY.ENTER APPLICABLE DATA INTO CRM DATABASE IN A TIMELY MANNER TO ACTIVELY TRACK, ANALYZE, AND REPORT AGAINST OPPORTUNITIES.ESTABLISH A RANKING FOR EACH PROSPECT IN OUR DATABASE TO REPRESENT THE VALUE THEY SERVE TO THE ORGANIZATION.MAINTAIN AND EXPAND YOUR BOOK OF BUSINESS THROUGH CREATIVE OUTREACH STRATEGIES.ROUTE QUALIFIED OPPORTUNITIES TO THE APPROPRIATE SALES EXECUTIVES WITH URGENCY FOR FURTHER DEVELOPMENT AND CLOSURE.ASSIST WITH PRE-EVENT CONFIRMATIONS AND POST-EVENT FOLLOW UP IN ORDER TO KEEP PROSPECTS ENGAGED.FOLLOW-UP ON REQUESTS FOR INFORMATION (RFI) AND BE ABLE TO EDUCATE PROSPECTS AND PARTNERS ON OUR VALUE AND THEIR RETURN ON INVESTMENT.TEAM WITH CHANNEL PARTNERS TO BUILD PIPELINE AND WORK TO PLAN, IMPLEMENT, AND LEAD THE NEW BUSINESS SALES EXPANSION.ENSURE A CULTURE OF ACCOUNTABILITY, ADAPTABILITY, HELPFULNESS, AND FOCUS TO BETTER SUPPORT OUR CUSTOMERS, PARTNERS, AND FELLOW TEAM MEMBERS.\n\n\nDO YOU HAVE WHAT IT TAKES?\n\nCOMPLETED BACHELOR’S DEGREE OR HIGHER EDUCATION.0 – 1 YEARS OF INSIDE SALES EXPERIENCE OR CUSTOMER SERVICE EXPERIENCE.EXCELLENT VERBAL AND WRITTEN COMMUNICATIONS SKILLS.ABILITY TO MULTI-TASK, PRIORITIZE, AND MANAGE TIME EFFECTIVELY.STRONG SENSE OF URGENCY AND A COMPETITIVE EDGE.\n\n\nWHAT MAKES YOU UNCOMMON? \n\nEXPERIENCE WORKING WITH SALESFORCE.COM OR SIMILAR CRM.TRACK RECORD OF OVER-ACHIEVING QUOTA.STRONG PHONE PRESENCE AND EXPERIENCE IN MAKING 50+ COLD CALLS A DAY.PROFICIENT WITH CORPORATE PRODUCTIVITY AND WEB PRESENTATION TOOLS.FACE TO FACE/B2B SALES EXPERIENCE.",
    "job_skill_set": [
      "sales",
      "communication",
      "time management",
      "multi-tasking",
      "urgency",
      "adaptability",
      "teamwork",
      "relationship building",
      "competitive spirit",
      "CRM",
      "cold calling",
      "data entry",
      "cyber security knowledge",
      "web presentation tools",
      "B2B sales",
      "Salesforce.com"
    ],
    "short_keywords": [
      "adaptability",
      "b2b",
      "building",
      "business",
      "businessdevelopment",
      "calling",
      "cold",
      "communication",
      "competitive",
      "crm",
      "cyber",
      "data",
      "development",
      "entry",
      "knowledge",
      "management",
      "multitasking",
      "presentation",
      "relationship",
      "representative",
      "sales",
      "salesforcecom",
      "security",
      "spirit",
      "teamwork",
      "time",
      "tools",
      "urgency",
      "web"
    ]
  },
  {
    "job_id": "3903877080",
    "job_title": "Business Development Executive - Omaha",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "TITLE:  BUSINESS DEVELOPMENT EXECUTIVE\n\nLOCATION:  OMAHA, NE\n\nRELOCATION OFFERED: NO\n\nCOMPANY DESCRIPTION: DIGITAL MARKETING\n\nPOSITION DESCRIPTION\n\nTHE BDE IS CHARGED WITH DRIVING DIGITAL MULTI-MEDIA ACCOUNT GROWTH FOR NEW AND EXISTING ACCOUNTS THROUGH PROSPECTING, DEVELOPING, AND CLOSING LEADS USING A VARIETY OF SOURCES.\n\nMUST HAVE'S\n\n1+ YEARS PRIOR DIGITAL MARKETING SALES EXPERIENCE\n\nCURRENT AUTHORIZATION TO WORK IN THE US – NO FUTURE SPONSORSHIP REQUIREMENTS.\n\nLOCATED IN DRIVING DISTANCE TO OMAHA, NE\n\nSALARY RANGE: BASE OF $50-85K DEPENDING ON EXPERIENCE - PLUS STRONG COMMISSION.\n\n",
    "job_skill_set": [
      "sales experience",
      "lead development",
      "communication",
      "relationship building",
      "time management",
      "problem solving",
      "digital marketing",
      "prospecting",
      "closing leads",
      "negotiation"
    ],
    "short_keywords": [
      "building",
      "business",
      "businessdevelopment",
      "closing",
      "communication",
      "development",
      "digital",
      "executive",
      "experience",
      "lead",
      "leads",
      "management",
      "marketing",
      "negotiation",
      "omaha",
      "problem",
      "prospecting",
      "relationship",
      "sales",
      "solving",
      "time"
    ]
  },
  {
    "job_id": "3887478002",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ABOUT THE ROLEAT MAGICPLAN, WE ARE ON A MISSION TO REVOLUTIONIZE THE WAY RESTORATION AND RENOVATION PROFESSIONALS OPERATE GLOBALLY. WITH OVER 20 MILLION DOWNLOADS, MAGICPLAN IS THE LEADING MOBILE SKETCHING, REPORTING, AND ESTIMATING SOLUTION FOR RESTORATION, CLAIMS, AND REMODELLING PROFESSIONALS WORLDWIDE. \nAS PART OF OUR CONTINUED GLOBAL SUCCESS, WE’RE LOOKING FOR A BUSINESS DEVELOPMENT REPRESENTATIVE TO JOIN OUR TEAM. THIS FULL-CYCLE SALES ROLE IS FOCUSED ON DEVELOPING NEW BUSINESS OPPORTUNITIES FROM TARGET ACCOUNTS, TRADESHOW PROSPECTS, AND INBOUND LEADS FROM OUR WEBSITE AND PRODUCT. YOU WILL BE WORKING TO QUALIFY THE BIGGEST OPPORTUNITIES FOR OUR ENTERPRISE TEAM WHILE MANAGING AND CLOSING A PIPELINE OF YOUR OWN SMB DEALS.\nHERE YOU HAVE THE OPPORTUNITY TO ACCELERATE YOUR CAREER AND CREATE A TRUE IMPACT WITHIN YOUR FIELD. WORK HOW YOU WORK BEST, AND NEVER STOP LEARNING!\nWHAT YOU'LL DO AS A BDR, YOU WILL RESEARCH AND IDENTIFY HIGH-VALUE LEADS, ENGAGING WITH THEM OVER THE PHONE TO UNDERSTAND THEIR NEEDS AND INTRODUCE OUR SOLUTIONS. THE ROLE WILL INVOLVE:DEVELOPING NEW BUSINESS OVER THE PHONE. (IF YOU DON’T LIKE CALLING, THIS ROLE ISN’T FOR YOU. PROSPECTS IN OUR ICP ALWAYS HAVE THEIR PHONES ON THEM, AND NEVER CHECK THEIR EMAILS).RESEARCHING POTENTIAL PROSPECTS WITHIN OUR TARGET ACCOUNTS LIST AND ICP. (THESE FOLKS AREN’T ON LINKEDIN AND OFTEN AREN’T IN SALES INTELLIGENCE DATABASES. YOU WILL BE CHARMING GATEKEEPERS, DOING LOTS OF DISCOVERY, AND TAKING MULTI-THREADED APPROACHES TO LAND AND EXPAND ENTERPRISE-LEVEL OPPORTUNITIES).ANALYSING AND STRATEGICALLY FOLLOWING UP ON LEADS FROM OUR INBOUND CHANNELS. (IN ADDITION TO PROACTIVELY TARGETING LEADS AT OUR TARGET ACCOUNTS, YOU WILL ALSO BE HANDLING OUTBOUND TRADESHOW LEADS, INBOUND SALES REQUESTS FROM OUR WEBSITE, AND PRODUCT-QUALIFIED LEADS FROM WITHIN OUR APP).BUILDING STRONG RELATIONSHIPS WITH KEY STAKEHOLDERS WITHIN OUR TARGET ACCOUNTS, AND WORKING WITH OUR ENTERPRISE TEAM TO GROW OUR SALES PIPELINE TO MEET REVENUE GOALS.GAINING EXPERIENCE WITH THE FULL SALES CYCLE FOR SMB DEALS, FROM QUALIFICATION TO CLOSING.\nABOUT YOUALTHOUGH WE ARE LOOKING FOR A PASSIONATE, PURPOSE-DRIVEN INDIVIDUAL RATHER THAN A 100% MATCH OF THE JOB DESCRIPTION, THERE IS AN IMPORTANT SKILL SET FOR THIS ROLE. 1-2 YEARS OF DIRECT SALES EXPERIENCE.NO FEAR OF THE PHONE - THIS IS HOW WE MAKE OUR MONEY.THE ABILITY TO DEVELOP STRONG RELATIONSHIPS WITH CLIENTS. EXCELLENT COMMUNICATION SKILLS IN ENGLISH. FLUENCY IN OTHER FOREIGN LANGUAGES IS ADVANTAGEOUS.PRIORITIZATION SKILLS.STRONG LISTENING SKILLS.A DRIVE TO ENSURE THE BEST OUTCOME FOR THE CUSTOMER. YOU WORK WELL AS PART OF A SMALL TEAM.YOU SHOULD BE DATA-DRIVEN AND GOAL-ORIENTED.TRAVEL AVAILABILITY: PRESENCE IN TRADESHOWS EVERY QUARTEROTHER VALUED SKILLS:B2B SAAS SALESWORKING IN A STARTUP/SCALE-UP ENVIRONMENTHUBSPOT (FOR PROSPECTING) AND APOLLO.IO (FOR SALES INTELLIGENCE)THE RESTORATION, CLAIMS OR REMODELLING INDUSTRIES.MULTITHREADING SALES, PARTICULARLY AT THE ENTERPRISE LEVEL\nWHY US?WE AT MAGICPLAN BELIEVE IN TEAMWORK, FUN, SIMPLE SOLUTIONS, AND, MOST IMPORTANTLY, OUR PEOPLE!CONSISTENT PAY WITH BONUS OPPORTUNITIES: WE OFFER YOU A COMPETITIVE BASE SALARY PLUS BONUS OPPORTUNITIES. GREAT WORK-LIFE BALANCE: JUGGLING CAREER, FAMILY, AND SOCIAL LIFE CAN BE CHALLENGING. MAGICPLAN SUPPORTS A HEALTHY WORK-LIFE BALANCE!\nHOLIDAYS / PTO: 20 VACATION DAYS ON TOP OF FEDERAL HOLIDAYS! FLAT HIERARCHIES: SHORT DECISION-MAKING PATHS AND DIRECT COOPERATION WITH LEADERSHIP. NO MICRO-MANAGEMENT, CLEAR AND TRANSPARENT. SUPPORT IN YOUR DEVELOPMENT: LEARNING IS A LIFELONG PURSUIT; WE PROMISE TO TREAT IT LIKE ONE. WE OFFER AN ENVIRONMENT FOR CONTINUED EDUCATION AND THE OPPORTUNITY TO LEARN FROM EACH OTHER. PURPOSE AND RESPONSIBILITY: A JOB SHOULDN'T JUST BE A JOB! AT MAGICPLAN, YOU HAVE THE OPPORTUNITY TO TAKE ON RESPONSIBILITY, WORK ON EXCITING PROJECTS, AND MAKE AN IMPACT.\nMAGICPLAN IS PROUD TO BE AN EQUAL OPPORTUNITY EMPLOYER. WE CELEBRATE DIVERSITY AND ARE COMMITTED TO CREATING AN INCLUSIVE ENVIRONMENT FOR ALL EMPLOYEES. WE DO NOT DISCRIMINATE ON THE BASIS OF RACE, RELIGION, COLOR, NATIONAL ORIGIN, GENDER, SEXUAL ORIENTATION, AGE, MARITAL STATUS, VETERAN STATUS, OR DISABILITY STATUS.PLEASE NOTE, THIS POSITION IS OPEN ONLY TO CANDIDATES AUTHORIZED TO WORK IN THE NAMED LOCATION SINCE IT DOES NOT INCLUDE SPONSORSHIP OR VISA OF ANY KIND.\nJOIN US AT MAGICPLAN AND BE PART OF A TEAM THAT'S TRANSFORMING THE RESTORATION AND RENOVATION INDUSTRY. APPLY NOW TO START YOUR JOURNEY!",
    "job_skill_set": [
      "B2B SaaS Sales",
      "Sales Intelligence",
      "Full Sales Cycle",
      "Data-Driven",
      "Multithreading Sales",
      "Research Skills",
      "Communication",
      "Relationship Building",
      "Listening Skills",
      "Prioritization",
      "Teamwork",
      "Goal-Oriented",
      "Problem Solving",
      "Adaptability",
      "HubSpot",
      "Apollo.io"
    ],
    "short_keywords": [
      "adaptability",
      "apolloio",
      "b2b",
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "cycle",
      "datadriven",
      "development",
      "full",
      "goaloriented",
      "hubspot",
      "intelligence",
      "listening",
      "multithreading",
      "prioritization",
      "problem",
      "relationship",
      "representative",
      "research",
      "saas",
      "sales",
      "skills",
      "solving",
      "teamwork"
    ]
  },
  {
    "job_id": "3884441796",
    "job_title": "Business Development Executive BPO - Hi Tech/New Age",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "WIPRO TECHNOLOGIES, THE GLOBAL IT BUSINESS OF WIPRO LIMITED (NYSE: WIT) IS A LEADING INFORMATION TECHNOLOGY, CONSULTING, AND BUSINESS PROCESS SERVICES COMPANY, THAT DELIVERS SOLUTIONS TO ENABLE ITS CLIENTS DO BUSINESS BETTER. WIPRO TECHNOLOGIES DELIVERS WINNING BUSINESS OUTCOMES THROUGH ITS DEEP INDUSTRY EXPERIENCE AND A 360-DEGREE VIEW OF “BUSINESS THROUGH TECHNOLOGY” – HELPING CLIENTS CREATE SUCCESSFUL AND ADAPTIVE BUSINESSES. A COMPANY RECOGNIZED GLOBALLY FOR ITS COMPREHENSIVE PORTFOLIO OF SERVICES, A PRACTITIONER’S APPROACH TO DELIVERING INNOVATION AND AN ORGANIZATION WIDE COMMITMENT TO SUSTAINABILITY, WIPRO TECHNOLOGIES HAS OVER 220,000 EMPLOYEES AND CLIENTS ACROSS 54 COUNTRIES.\nWE ARE PROUD OF BEING ONE OF THE MOST ETHICAL BUSINESS ORGANIZATIONS IN THE WORLD, OUR COMMITMENT TO DIVERSITY AND INCLUSION, OUR COMMITMENT TO ENVIRONMENT, AND CORPORATE SOCIAL RESPONSIBILITY WITH 67% OF OUR ORGANIZATION OWNED BY AN IRREVOCABLE PHILANTHROPIC TRUST TOUCHING LIVES GLOBALLY.\nWIPRO IS ALSO ONE OF THE LARGEST BUSINESS PROCESS OUTSOURCING PROVIDERS WORLDWIDE. WIPRO PROVIDES COMPREHENSIVE ‘PROCESS FIRST, DIGITAL LED’ BUSINESS PROCESS SOLUTIONS AND SERVICES ACROSS THE AREAS OF FINANCE & ACCOUNTING, HR & PAYROLL, SOURCING AND PROCUREMENT, CUSTOMER SERVICE/CUSTOMER EXPERIENCE TRANSFORMATION, SUPPLY CHAIN/ORDER MANAGEMENT, MASTER DATA MANAGEMENT, LEGAL SERVICES, ANALYTICS, TRUST AND SAFETY AND VARIOUS OTHER INDUSTRY SPECIFIC PROCESSES. WIPRO’S BUSINESS PROCESS SERVICES UNIT, DIGITAL OPERATIONS AND PLATFORMS (DOP) IS AMONG THE FASTEST GROWING UNITS AND IS WELL RECOGNIZED IN THE INDUSTRY. DOP HAS ALSO INVESTED IN CREATING NEW PLATFORMS AND IP SOLUTIONS THAT DIFFERENTIATE US IN THE MARKETPLACE.\nOPPORTUNITY / JOB OPENINGWE ARE LOOKING FOR A CANDIDATE TO LEAD OUR HITECH/NEW AGE BUSINESS DEVELOPMENT EFFORTS ACROSS INDUSTRY SECTORS FOR US, CANADA AND LATAM REGION BASED IN THE USA.EDUCATION QUALIFICATION, JOB SKILLS, EXPERIENCE, EXPERTISE, AND OTHER REQUIREMENTS15-20 YEARS OF RELEVANT CROSS INDUSTRY EXPERIENCE IN BPO WITH END-TO-END PURSUIT/OPPORTUNITY MANAGEMENT, EXECUTION, PROGRAM MANAGEMENT, AND TRANSFORMATIONSUPERVISORY EXPERIENCE OF DIRECTLY MANAGING SENIOR SALES LEADER (S) PREFERRED.ABILITY TO LEAD HITECH/NEW AGE DOMAIN-ORIENTED CONVERSATIONS AND ENGAGE CONSULTATIVELY WITH CLIENT C-SUITE STAKEHOLDERS AND FUNCTIONAL LEADERS.HITECH/NEW AGE DOMAIN SHOULD INCLUDE ROBUST UNDERSTANDING OF ALL ASPECTS IN TRUST AND SAFETY, ECOMMERCE, AND OPERATIONS) AND HORIZONTAL BPO OFFERINGS (I.E. F&A, SUPPLY CHAIN, PROCUREMENT, CONTACT CENTER AND HR)STRONG UNDERSTANDING OF DELIVERY STRATEGIES INCLUDING APPRECIATION OF GLOBAL DELIVERY LOCATIONS, RETAINED VS OUTSOURCED POTENTIAL, BENCHMARKS, TOOLS AND TECHNOLOGY PLATFORMS, AUTOMATION TOOLS, BCP/DR PRACTICES, OPERATIONS PERFORMANCE MANAGEMENT, GOVERNANCE MODELS, COMPLIANCE REQUIREMENTS, AND COMMERCIAL MODELS AMONGST OTHERS.DEMONSTRATED SUCCESS IN HITECH/NEW AGE SALES AND WINNING LARGE DEALS.KNOWLEDGE ABOUT THE BPS INDUSTRY, ANALYSTS, DEAL ADVISORS, PRODUCT PARTNER ECO-SYSTEM, AND COMPETITORS INCLUDING THEIR STRENGTHS AND WEAKNESSES.BRINGS A STRONG ROLODEX OF CONNECTIONS.STRONG INTERPERSONAL AND RELATIONSHIP BUILDING SKILLS.KNOWLEDGE OF CONTRACTUAL CONSTRUCTS IN BUSINESS PROCESS SERVICESDEVELOPED NEGOTIATION AND CONSULTING SKILLS.ABILITY TO NAVIGATE AN ORGANIZATION, WORKING WITH CROSS FUNCTIONAL/GLOBAL TEAMS ACROSS SOLUTION DESIGN, BUSINESS FINANCE, HR, RISK & COMPLIANCE, TRANSITION, TRANSFORMATION, QUALITY, AND DELIVERY AMONGST OTHERS.ABILITY TO WORK IN BOTH STRUCTURED AND UNSTRUCTURED ENVIRONMENTS INCLUDING MAINTAINING FLEXIBLE WORKING HOURS THAT MAY EXTEND BEYOND REGULAR BUSINESS HOURS GIVEN THE NATURE OF BUSINESS AND GEO SPREAD OF TEAMS.OPEN TO TRAVEL (DOMESTIC USA AND/OR INTERNATIONAL) PER REQUIREMENTS TO MEET INTERNAL AND EXTERNAL STAKEHOLDERS AS PART OF BUSINESS DEVELOPMENT EFFORTS.HIGHLY RESPONSIVE, RESPECTFUL, TRUSTWORTHY AND DEMONSTRATES STEWARDSHIP.EXCELLENT ENGLISH LANGUAGE COMMUNICATION SKILLS KEY RESPONSIBILITIES WILL INCLUDE BUT NOT LIMITED TO:DRIVE HITECH/NEW AGE OPPORTUNITIES GROWTH (PIPELINE), WINNING BUSINESS (ORDER BOOKING) AND REVENUE GROWTH FROM EXISTING AND NEW CLIENTS. THIS WILL BE MEASURED AGAINST DEFINED MONTHLY/QUARTERLY/ANNUAL PERFORMANCE TARGETS.DEVELOP AND EXECUTE BUSINESS DEVELOPMENT STRATEGIES.PROACTIVELY SHAPING AND WINNING LARGE DEALS.DRIVE CREATION OF NEW MARKETING COLLATERALS, DOMAIN CONTENT TO AID BUSINESS DEVELOPMENT EFFORTS (MAILERS, PRACTICE BROCHURES, ART OF THE POSSIBLE/PROACTIVE PITCHES, ETC.)QUICKLY DEVELOP IN-DEPTH UNDERSTANDING OF END-TO-END WIPRO HITECH/NEW AGE OFFERINGS, CLIENT LANDSCAPE, RELEVANT CASE STUDIES OF VALUE DELIVERED, DIFFERENTIATORS, AND MAKE SOLUTIONS/PITCHES CONTEXTUALIZED TO PROSPECT CLIENT ORGANIZATION.QUARTERBACK ALL HITECH/NEW AGE SALES INITIATIVES AND PURSUITS (PROACTIVE AND RFXS), WORKING WITH GLOBAL, CROSS FUNCTIONAL TEAMS TO DEVELOP HIGH QUALITY, WINNING BUSINESS PROPOSITIONS. THIS WILL INCLUDE REVIEW OF CONTENT, SHARING FEEDBACK, AND CREATING CONTENT AS MAY BE REQUIRED TAKING COMPLETE OWNERSHIP OF OUTPUT FOR HITECH/NEW AGE PURSUITS.ANCHOR CLIENT PURSUIT MEETINGS, RELATIONSHIP CONNECTS, SOLUTION WORKSHOPS, DUE DILIGENCE WORKSHOPS, ETC. PRESENTING WIPRO’S CREDENTIALS AND VALUE PROPOSITION.ATTENDING ANALYST BRIEFINGS, INDUSTRY CONFERENCES TO PROMOTE WIPRO’S HITECH/NEW AGE SERVICES BUSINESS GROWTH AND TECHNICAL EXPERTISE.LEAD INTERNAL PURSUIT REVIEWS COVERING QUALIFICATION, WIN THEMES, SWOT ANALYSIS, VALUE PROPOSITION, AND SUPPORT REQUIREMENTS AMONGST OTHERS WITH MANAGEMENT AND LARGER PURSUIT TEAMS.DEVELOP REASONABLE UNDERSTANDING OF OTHER WIPRO BUSINESS PROCESS SERVICE OFFERINGS TO IDENTIFY BUSINESS OPPORTUNITIES (DEMONSTRATING STEWARDSHIP)PROVIDE PERIODIC MIS REPORTING FOR THE PRACTICE.",
    "job_skill_set": [
      "business development",
      "sales management",
      "negotiation",
      "automation tools",
      "contractual constructs",
      "market analysis",
      "customer relationship management",
      "marketing collateral development",
      "presentation skills",
      "industry knowledge",
      "interpersonal skills",
      "relationship building",
      "communication",
      "leadership",
      "teamwork",
      "problem solving",
      "adaptability",
      "BPO",
      "program management",
      "consulting",
      "delivery strategies",
      "compliance requirements",
      "data management",
      "financial analysis",
      "risk management",
      "project management",
      "performance management",
      "flexibility",
      "responsiveness",
      "trustworthiness",
      "stewardship"
    ],
    "short_keywords": [
      "adaptability",
      "age",
      "analysis",
      "automation",
      "bpo",
      "building",
      "business",
      "businessdevelopment",
      "collateral",
      "communication",
      "compliance",
      "constructs",
      "consulting",
      "contractual",
      "customer",
      "data",
      "delivery",
      "development",
      "executive",
      "financial",
      "flexibility",
      "hi",
      "industry",
      "interpersonal",
      "knowledge",
      "leadership",
      "management",
      "market",
      "marketing",
      "negotiation",
      "performance",
      "presentation",
      "problem",
      "program",
      "project",
      "relationship",
      "requirements",
      "responsiveness",
      "risk",
      "sales",
      "skills",
      "solving",
      "stewardship",
      "strategies",
      "teamwork",
      "technew",
      "tools",
      "trustworthiness"
    ]
  },
  {
    "job_id": "3902860965",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "RAIN IS A VENTURE-BACKED FINTECH WITH A MISSION TO KILL PREDATORY FINANCIAL PRODUCTS LIKE PAYDAY LOANS. OUR FIRST PRODUCT GIVES EMPLOYEES INSTANT ACCESS TO THEIR WAGES, WHICH SOLVES A MAJOR PROBLEM FOR REAL PEOPLE (115 MILLION AMERICAN WORKERS ARE LIVING PAYCHECK-TO-PAYCHECK). RAIN IS THE FASTEST-GROWING STARTUP IN THE CATEGORY AND WAS INCUBATED WITH QED CAPITAL, A TOP FINTECH VENTURE FUND.\nABOUT THE ROLE: THE IDEAL CANDIDATE IS ACTIVELY SEEKING A CAREER IN TECHNOLOGY SALES. WE ARE LOOKING FOR A BUSINESS DEVELOPMENT REPRESENTATIVE TO HELP US GROW AND PROMOTE OUR BRAND IN THE INDUSTRIES WE SERVE. YOUR ROLE WILL BE TO SEEK OUT NEW BUSINESS OPPORTUNITIES BY CONNECTING AND DEVELOPING RELATIONSHIPS WITH POTENTIAL EMPLOYER PARTNERS.\nTHE IDEAL CANDIDATE IS A COMPETITIVE, SELF-STARTER THAT BRINGS DYNAMIC THINKING AND WELL-HONED WORK ETHIC TO THE TABLE. THE INDIVIDUAL MUST BE ABLE TO LEVERAGE CRM DATA TO SEGMENT TARGET AUDIENCES, TRIGGER CAMPAIGNS AND PERSONALIZE CONTENT TO EXECUTE OUTREACH. BUSINESS DEVELOPMENT REPRESENTATIVE WILL SOURCE POTENTIAL EMPLOYER PARTNERS IN TARGET INDUSTRIES, GENERATE INTEREST, QUALIFY PROSPECTS, AND PRESENT KEY ASPECTS OF RAIN’S VALUE PROPOSITION. RAIN IS LOOKING FOR SOMEONE WITH A COMPETITIVE NATURE THAT WANTS TO DEVELOP A CAREER IN TECHNOLOGY SALES. IT IS KEY FOR A BDR TO HAVE THE ABILITY TO NOT ONLY SURVIVE, BUT TO THRIVE IN A RAPIDLY CHANGING ENVIRONMENT, AS RAIN IS A NEW COMPANY IN A DISRUPTIVE INDUSTRY. KEEN ORGANIZATIONAL SKILLS, RESOURCEFULNESS AND A DESIRE TO BE ON THE CUTTING EDGE OF NEW TECHNOLOGY ARE MUST-HAVES FOR THIS ROLE.\n\nRESPONSIBILITIES:\nSOURCE NEW LEADS THROUGH CREATIVE RESEARCH, AND CONDUCT PROCESS ORIENTED OUTREACH TO EXECUTIVE-LEVEL PROSPECTS VIA OUTBOUND COLD CALLS AND EMAILSUTILIZE EXISTING LEADS IN CRM AS WELL AS NEWLY SOURCED LEADS TO SET UP CAMPAIGNS TO TEST CONTENT AND OUTREACH STRATEGIES FOR EFFECTIVENESSPREPARE FOR OUTREACH BY DOING BACKGROUND RESEARCH ON THE INDUSTRY, COMPANY, AND CONTACTCOLLABORATE WITH SALES TEAM TO SHARE BEST PRACTICES AND EVOLVE SALES STRATEGIESPROVIDE THOUGHTFUL FEEDBACK TO MANAGEMENT AND PRODUCT TEAM ON MARKET RESPONSEENTER, UPDATE, AND MAINTAIN CRM INFORMATION ON LEADS, PROSPECTS, AND DEALSASSIST IN WRITING TARGETED COPY AND AID IN THE DESIGN AND LAYOUTS OF COMMUNICATIONS, SUCH AS ADVERTISEMENTS, EMAILS, PRESENTATIONS, NEWSLETTERS, EVENT SUPPORT MATERIALS AND BROCHURESUTILIZE RAIN APPROVED WRITTEN AND VIDEO COMMUNICATIONADHERE TO ALL RAIN COMPANY POLICIES AND PROCEDURESEXEMPLIFY RAIN’S RAINBOW RULES\n\nQUALIFICATIONS: BACHELOR'S DEGREE OR EQUIVALENT EXPERIENCE IN SALESAT LEAST 1 YEAR OF SALES EXPERIENCE (OUTBOUND PREFERRED)CONFIDENCE AND HIGH ENERGY ON THE TELEPHONESTRONG WORK ETHIC AND DRIVEEXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLSABILITY TO MULTITASK, ORGANIZE, AND PRIORITIZE WORKABILITY TO HANDLE REJECTIONEXPERIENCE IN USING CRMS (HUBSPOT), SAAS OR HCM IS A PLUS",
    "job_skill_set": [
      "CRM",
      "Sales",
      "Outbound Sales",
      "Market Research",
      "Copywriting",
      "Data Analysis",
      "Communication",
      "Team Collaboration",
      "Organizational Skills",
      "Self-Starter",
      "Competitive Nature",
      "Resourcefulness",
      "Adaptability",
      "Multitasking",
      "Work Ethic",
      "SaaS",
      "HCM",
      "Handling Rejection"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "competitive",
      "copywriting",
      "crm",
      "data",
      "development",
      "ethic",
      "handling",
      "hcm",
      "market",
      "multitasking",
      "nature",
      "organizational",
      "outbound",
      "rejection",
      "representative",
      "research",
      "resourcefulness",
      "saas",
      "sales",
      "selfstarter",
      "skills",
      "team",
      "work"
    ]
  },
  {
    "job_id": "3901354476",
    "job_title": "{Direct Hire, Fulltime} OEM Business Development Manager (Remote)",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "TITLE: BUSINESS DEVELOPMENT MANAGER (BDM) (REMOTE, DIRECT HIRE, FULLTIME)TRAVEL: 20% (ABOUT 1 WEEK A MONTH), ABOUT 50 DAYS IN A YEARLOCATION: REMOTE WITH TRAVEL TO CALIFORNIA (LOS ANGELES), WASHINGTON (SEATTLE), ARIZONA (PHOENIX) AND COLORADO (DENVER)IDEAL CANDIDATES ARE THOSE WHO RESIDE ON THE WEST COAST TO ACCOMMODATE THE TRAVEL REQUIREMENTS TO ABOVE-MENTIONED STATES.\nPOSITION SUMMARY: THE BUSINESS DEVELOPMENT MANAGER (BDM) IS RESPONSIBLE FOR ACHIEVING REVENUE, MARGIN AND KPI GOALS WITHIN HIS/HER ASSIGNED TERRITORY. RESPONSIBLE FOR PLANNING, REPORTING, AND CREATING CUSTOMER SATISFACTION THROUGH DILIGENT FOLLOW-UP AND IDENTIFYING ADDITIONAL AND UNMET CUSTOMER NEEDS, WHILE GROWING THE CURRENT BOOK OF BUSINESS. THE BDM PROACTIVELY MAINTAINS EXISTING CLIENT ACCOUNTS AND DEVELOPS NEW ACCOUNTS BY WORKING CLOSELY WITH THE DESIGNATED CUSTOMER SERVICE ACCOUNT REPRESENTATIVE(S) AND COORDINATING WITH OTHER ORGANIZATIONAL MEMBERS TO ACHIEVE/EXCEED CUSTOMER EXPECTATIONS. ALL CANDIDATES/INCUMBENTS MUST DEMONSTRATE THE ABILITY TO:• RAPIDLY BUILD KNOWLEDGE OF THE CLIENT’S PRODUCTS AND SERVICES• IDENTIFY OPPORTUNITIES, NEGOTIATE AND MANAGE SALES, BUSINESS NEEDS AND COST REQUIREMENTS• UNDERSTAND AND USE BASIC SELLING TECHNIQUES: OPEN, PROBE, PRESENTATION, OVERCOMING OBJECTIONS EXPECTATIONS AND BUSINESS RESULTS. \nPRINCIPAL DUTIES & RESPONSIBILITIES (ESSENTIAL FUNCTIONS): • BUILDS LASTING CUSTOMER RELATIONSHIPS THROUGH CLOSING SALES OPPORTUNITIES• IDENTIFIES NEEDS AND PROPOSES UNIQUE SOLUTIONS TO SOLVE CUSTOMER’S PROBLEMS• COLLABORATES WITH OTHER TEAM MEMBERS TO IMPROVE PERFORMANCE AND PROVIDE GREATER VALUE TO OUR CUSTOMERS • MEETS OR EXCEEDS ALL REVENUE, MARGIN AND KPI GOALS• VISITS CUSTOMERS AND PROVIDES APPROPRIATE VALUE PROPOSITIONS ON AN ONGOING BASIS• CALLS ON CUSTOMERS REGULARLY WITH A WELL-DEFINED VALUE PROPOSITION • CREATES AND EXECUTES ACCOUNT PLANS FOR ALL ASSIGNED ACCOUNTS• PROACTIVELY IDENTIFIES AND EXECUTES NEW OPPORTUNITIES (NPDS) FOR NEW AND EXISTING ACCOUNTS• IDENTIFIES AND SELLS (AND CROSS-SELLS) ALL CLIENT APPLICABLE PRODUCT LINES TO ALL CUSTOMERS (MAXIMIZE SHARE OF WALLET) • GENERATES NEW LEADS BY SOURCING AND CONTACTING KEY DECISION MAKERS SUCH AS ENGINEERS AND PROCUREMENT TEAMS AT CURRENT ACCOUNTS, AS WELL AS, USING OTHER CREATIVE METHODS FOR IDENTIFYING OTHER NEW AND EXISTING SOURCES OF BUSINESS• UTILIZES APPROPRIATE CLIENT RESOURCES AT CUSTOMER MEETINGS AND FOR PRODUCT CUSTOMIZATION NEEDS • BUILDS A SUSTAINABLE PIPELINE OF NEW AND EXISTING BUSINESS• BUILDS LONG-TERM, PRODUCTIVE AND MUTUALLY BENEFICIAL RELATIONSHIPS • REGULARLY ANALYZES AND REVIEWS TRENDS AND OTHER DATA IN THE MARKETPLACE (CUSTOMERS, COMPETITORS), AS WELL AS, CURRENT AND POTENTIAL BOOK OF BUSINESS, TO GAIN INSIGHTS AND KNOWLEDGE TOWARDS INCREASING MARKET PENETRATION AND MAXIMIZING BUSINESS RESULTS• IS ACCOUNTABLE FOR RETAINING AN ASSIGNED CLIENT BASE• DEVELOP CUSTOMIZED SOLUTION-ORIENTED PLANS FOR EACH CLIENT• OWNS ESCALATED PROBLEM MANAGEMENT AND CREATES RESOLUTION PLANS; MUST TROUBLESHOOT, PROBLEM SOLVE AND DOCUMENT ANY INTERNAL PROBLEMS THAT INTERFERE WITH HIGH-QUALITY SERVICE PROVIDED TO OUR CLIENTS• IMPLEMENTS NEW PRODUCT LAUNCHES FOR ASSIGNED TERRITORY; CONDUCTS MILESTONE REVIEWS OF PROGRESS AGAINST BUSINESS PLANS• CONDUCTS AD-HOC POST-MORTEM BUSINESS REVIEWS• ENSURES THAT COMMUNICATIONS TO THE CUSTOMER ARE CLEAR, TIMELY AND APPROPRIATE• ASSISTS IN QUALITY CONTROL AS DETERMINED BY SPECIAL CUSTOMER REQUIREMENTS• PERFORMS OTHER DUTIES AS ASSIGNED  EDUCATION/EXPERIENCE:COLLEGE DEGREE OR EQUIVALENT AND 7+ YEARS OF DIRECT SALES/ACCOUNT MANAGEMENT EXPERIENCE IN AN INDUSTRIAL GOODS, MANUFACTURING ENVIRONMENT (OEMS, FABRICATORS, ETC.). AN ENGINEERING BACKGROUND IS A PLUS.  KNOWLEDGE, SKILLS & ABILITIES: • AN AGGRESSIVE GO-GETTER THAT LOVES MAKING CALLS AND VISITS AND CAN CLOSE DEALS• A DYNAMIC PERSONALITY THAT CAN ESTABLISH AND CULTIVATE GREAT RELATIONSHIPS • AN ASSERTIVE AND POSITIVE ATTITUDE• A PASSION FOR FOLLOW-UP, FOLLOW THROUGH AND FINISHING WHAT S/HE STARTED• STRONG INTERPERSONAL, ANALYTICAL, VERBAL AND WRITTEN COMMUNICATION SKILLS• TECHNICALLY SAVVY AND NATURALLY CURIOUS ABOUT OUR CUSTOMERS, COMPETITORS AND PRODUCTS TO DRIVE VALUE AND RESULTS• A POSITIVE TEAM PLAYER THAT THRIVES IN COLLABORATIVE ENVIRONMENTS • ABILITY TO WORK WITH CRMS (SALESFORCE.COM) AND PROFICIENT IN MICROSOFT OFFICE SUITE (INCLUDING WORD AND EXCEL)• KNOWLEDGE AND COMPETENCE IN THE ELEMENTS OF OUTSIDE SALES (COLD CALLING, BUSINESS DEVELOPMENT, CUSTOMER ACQUISITION, AND RETENTION)• EXCELLENT VERBAL, PRESENTATION AND WRITTEN COMMUNICATION SKILLS • MUST HAVE A STRONG WORK ETHIC AND BE ASSERTIVE, POSITIVE AND RESILIENT; ABLE TO WORK UNDER PRESSURE IN A FAST-PACED ENVIRONMENT WHILE REMAINING COMPOSED AND OBJECTIVE • STRONG TIME MANAGEMENT AND ORGANIZATION SKILLS - ABLE TO MULTI-TASK AND MEET DEADLINES• OUTSTANDING UNDERSTANDING OF THE SALES AND SELLING PROCESS• DEMONSTRATES A COMMITMENT TO HIGH LEVELS OF CUSTOMER SERVICE AND A SENSE OF URGENCY IN SATISFYING AND DELIGHTING CLIENTS• ABLE TO WORK COLLABORATIVELY WITH COLLEAGUES AND STAFF TO CREATE A RESULT-DRIVEN, TEAM=ORIENTED ENVIRONMENT• EXCELLENT PLANNING AND ORGANIZATIONAL SKILLS TO PREPARE FOR AND CONDUCT EFFECTIVE SALES PRESENTATIONS AND SYSTEMATICALLY FOLLOW UP ON MEETINGS, RFPS, AND PROVIDE ACCURATE AND TIMELY REPORTING• WILLINGNESS AND ABILITY TO TRAVEL EXTENSIVELY AS NEEDED (35%+) TO CUSTOMERS AND PROSPECTIVE CLIENTS PHYSICAL DEMANDS:WHILE PERFORMING THE DUTIES OF THIS JOB, THE INDIVIDUAL IS REGULARLY REQUIRED TO STAND, WALK, SIT, TALK, HEAR, AND USE HANDS AND IS FREQUENTLY REQUIRED TO REACH WITH HANDS AND ARMS. ",
    "job_skill_set": [
      "sales",
      "account management",
      "customer relationship management",
      "business development",
      "CRM software (Salesforce.com)",
      "Microsoft Office Suite (Word, Excel)",
      "data analysis",
      "communication",
      "teamwork",
      "problem solving",
      "time management",
      "organizational skills",
      "interpersonal skills",
      "resilience",
      "curiosity",
      "customer service orientation",
      "negotiation",
      "product knowledge",
      "market analysis",
      "assertiveness"
    ],
    "short_keywords": [
      "account",
      "analysis",
      "assertiveness",
      "business",
      "businessdevelopment",
      "communication",
      "crm",
      "curiosity",
      "customer",
      "data",
      "development",
      "direct",
      "excel",
      "fulltime",
      "hire",
      "interpersonal",
      "knowledge",
      "management",
      "manager",
      "market",
      "microsoft",
      "negotiation",
      "oem",
      "office",
      "organizational",
      "orientation",
      "problem",
      "product",
      "relationship",
      "remote",
      "resilience",
      "sales",
      "salesforcecom",
      "service",
      "skills",
      "software",
      "solving",
      "suite",
      "teamwork",
      "time",
      "word"
    ]
  },
  {
    "job_id": "3884947180",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "BDR, SUBSCRIPTION SERVICESSAPINSIDER | CHELMSFORD, MA – HYBRID OFFICETHE COMPANYSAPINSIDER IS THE DOMINANT MULTI-PLATFORM SOURCE OF INFORMATION AND TRAINING FOR BUSINESSPEOPLE WHO SUPPORT, MANAGE, DEPLOY, CONFIGURE, AND CUSTOMIZE SAP SOLUTIONS. THE BUSINESS SERVES ABOUT 900,000 ACTIVE MEMBERS ACROSS 150 COUNTRIES, 60% OF WHOM WORK IN TECH-RELATED FUNCTIONS AND 40% OF WHOM ARE IN RELEVANT END-USER LINES OF BUSINESS. SAPINSIDER PROVIDES INVALUABLE INFORMATION THROUGH ANALYST BRIEFS, EXPERT ARTICLES, IN-PERSON AND VIRTUAL EVENTS, COMMUNITY-DRIVEN CONTENT, CASE STUDIES, WHITEPAPERS, BLOGS AND BENCHMARK RESEARCH REPORTS.SAPINSIDER WAS FOUNDED IN 2001 AND IS OWNED BY PRIVATELY HELD WIS PUBLISHING.THE ROLETHE BDR IS A HANDS-ON SALES AND SERVICE PROFESSIONAL WHO DEVELOPS OPPORTUNITIES FOR A DEDICATED SET OF NAMED ACCOUNTS IN PARTNERSHIP WITH A DEDICATED ACCOUNT EXECUTIVE (AE) AT SAPINSIDER. THE ROLE IS TO WIN NEW BUSINESS, ONBOARD AND SERVICE EXISTING CLIENTS WITHIN A NAMED ACCOUNT TERRITORY FOR TWO CORE PRODUCTS EVENT ATTENDEES AND CONTENT SUBSCRIPTION PROGRAMS. YOU WILL OWN THE OVERALL SUBSCRIBER COMPANY EXPERIENCE FROM INITIAL SALES ENGAGEMENT, CLIENT ONBOARDING, AND DELIVERY OF SERVICE TO BUILD LONG TERM RENEWABLE RELATIONSHIPS.ROLE REPORTS TO THE ACCOUNT EXECUTIVE (AE)SPECIFIC RESPONSIBILITIES INCLUDE: PROSPECT ACROSS ALL KEY PERSONA IN ALL 750 ACCOUNTS TO OPEN DOORS FOR MEETINGS WITH AESCHEDULE AE WITH 20+ MEETINGS/CALLS PER MONTHENROLL ALL “SOLD” MEMBERS INTO THEIR SUBSCRIPTION AND ENABLE THEM FOR PERSONALIZATION OF CONTENT, NEWSLETTER, WEBSITE AND MARKETING COMMUNICATIONS.ENROLL ALL CLIENT MEMBERS INTO EVENTS AND SUMMITS ALIGNED WITH THEIR NEEDS AND REGION – MAKE SURE THAT THEY ARE ALL TOUCHED 90-120 DAYS IN ADVANCE OF EACH EVENT TO GAUGE INTEREST AND SUPPORT.CONDUCT MONTHLY CHECK IN CALLS/EMAILS TO ALL EXISTING MEMBERSSCHEDULE QBR CALLS FOR AE WITH ALL EXISTING MEMBER COMPANIESMAINTAIN ALL SFDC RECORDS TO KEEP THE TERRITORY AND CONTACTS UP TO QA REQUIREMENTS.WHAT YOU WILL NEEDDEGREE CANDIDATES PREFERRED (ALL MAJORS WELCOME)RELEVANT WORK OR INTERNSHIPS IN SALES, SDR, BDR ROLESUNDERSTANDING OF B2B TECHNOLOGY MARKETINGUNMATCHED ABILITY TO ESTABLISH CREDIBILITY WITH SENIOR LEVEL EXECUTIVES.VARSITY-LEVEL COMMUNICATION, WRITING, PROBLEM-SOLVING, AND TIME MANAGEMENT SKILLSABILITY TO PLAN AND PRIORITIZE DAILY TASKS/RESPONSIBILITIES.DEMONSTRATED ABILITY TO WORK WELL UNDER PRESSURE.SHARE IDEAS AND FEEDBACK WITH THE TEAM TO HELP CULTIVATE/MAINTAIN AND INCLUSIVE AND COLLABORATIVE ENVIRONMENT.PROFESSIONAL QUALIFICATIONSAN IDEAL CANDIDATE WILL POSSESS:PASSION FOR WORKING WITH IT AND BUSINESS PROFESSIONALS ON THEIR EDUCATIONAL NEEDS ASSOCIATED TO USING ENTERPRISE SOFTWARE AND TECHNOLOGY SOLUTIONS.PROVEN ABILITY TO DRIVE MEETINGS TO END USER IT AND LINE OF BUSINESS ROLES IN GLOBAL 5,000 COMPANIES.DIRECT EXPERIENCE WITH EVENT ATTENDEE AND CONTENT SUBSCRIPTION SERVICES.COMMITMENT TO ACHIEVING MONTHLY SALES GOALS.EXPERIENCE WITH CUSTOMER SERVICE AND CLIENT ONBOARDINGACCOUNT PROSPECTING, EXPANSION AND ENGAGEMENT EXPERIENCE.EXCEPTIONAL SPEAKING, WRITING AND COMMUNICATION SKILLS.EXCELLENT ORGANIZATIONAL AND TIME MANAGEMENT SKILLS.STRONG EXPERIENCE WORKING WITHIN A CRM ENVIRONMENT WITH SFDC EXPERIENCE REQUIRED.COMPENSATIONTHE BDR ENJOYS A COMPETITIVE BASE SALARY OF $55,000 TO $60,000 AND A PERFORMANCE BONUS POTENTIAL OF $20,000 ANNUALLY. IT IS EXPECTED THAT THE BDR WILL EXCEED AN OTE OF $75,000 IN YEAR ONE AND GROWING YEAR OVER YEAR. THE ROLE PARTICIPATES IN ALL SAPINSIDER EMPLOYEE BENEFIT PROGRAMS INCLUDING ATTENDANCE AT EVERY SAPINSIDER EVENT, COMPREHENSIVE HEALTHCARE COVERAGE, LIFE INSURANCE, UNLIMITED PAID VACATION AND 401K PLAN.",
    "job_skill_set": [
      "Sales",
      "Customer Service",
      "B2B Technology Marketing",
      "Event Management",
      "Account Prospecting",
      "Data Management",
      "Communication",
      "Problem Solving",
      "Time Management",
      "Collaboration",
      "Credibility Establishment",
      "Planning and Prioritization",
      "Adaptability",
      "Teamwork",
      "CRM (SFDC)",
      "Client Onboarding",
      "Content Subscription Services"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "and",
      "b2b",
      "business",
      "businessdevelopment",
      "client",
      "collaboration",
      "communication",
      "content",
      "credibility",
      "crm",
      "customer",
      "data",
      "development",
      "establishment",
      "event",
      "management",
      "marketing",
      "onboarding",
      "planning",
      "prioritization",
      "problem",
      "prospecting",
      "representative",
      "sales",
      "service",
      "services",
      "sfdc",
      "solving",
      "subscription",
      "teamwork",
      "technology",
      "time"
    ]
  }
]