[
  {
    "job_id": "3898173889",
    "job_title": "Intern, Talent Management, Human Resources",
    "category": "HR",
    "job_description": "LOCATION(S)\n\nCHICAGO, ILLINOIS, DORAL, FLORIDA\n\nDETAILS\n\nKEMPER IS ONE OF THE NATION’S LEADING SPECIALIZED INSURERS. OUR SUCCESS IS A DIRECT REFLECTION OF THE TALENTED AND DIVERSE PEOPLE WHO MAKE A POSITIVE DIFFERENCE IN THE LIVES OF OUR CUSTOMERS EVERY DAY. WE BELIEVE A HIGH-PERFORMING CULTURE, VALUABLE OPPORTUNITIES FOR PERSONAL DEVELOPMENT AND PROFESSIONAL CHALLENGE, AND A HEALTHY WORK-LIFE BALANCE CAN BE HIGHLY MOTIVATING AND PRODUCTIVE. KEMPER’S PRODUCTS AND SERVICES ARE MAKING A REAL DIFFERENCE TO OUR CUSTOMERS, WHO HAVE UNIQUE AND EVOLVING NEEDS. BY JOINING OUR TEAM, YOU ARE HELPING TO PROVIDE AN EXPERIENCE TO OUR STAKEHOLDERS THAT DELIVERS ON OUR PROMISES.\n\nKEMPER PROUDLY SERVES GROWING NICHE AND UNDERSERVED MARKETS BY PROVIDING APPROPRIATE AND AFFORDABLE INSURANCE AND FINANCIAL SOLUTIONS. THIS IS ENABLED BY A TEAM OF DYNAMIC, INNOVATIVE EMPLOYEES WHO ACT LIKE OWNERS AND ARE CONTINUALLY DRIVEN BY  INTELLECTUAL CURIOSITY ,  ANALYTICAL SUPERIORITY,  AND  BEING WORLD-CLASS OPERATORS. \n\n KEMPER SCHOLARS INTERNSHIP PROGRAM \n\nKEMPER SCHOLARS INTERNSHIPS WILL ENABLE YOU TO BROADEN YOUR UNDERSTANDING OF THE BUSINESS, MAKE VALUABLE CONNECTIONS, AND SET A COURSE FOR YOUR PROFESSIONAL JOURNEY WITH US. YOU WILL WORK ON SPECIAL PROJECTS THAT POSITIVELY IMPACT OUR BUSINESS AND OUR CUSTOMERS. KEMPER IS LOOKING FOR STUDENTS WHO LOVE TO PROBLEM SOLVE AND ARE WILLING TO MAKE REAL-LIFE IMPACT ON PROJECTS THAT MAY INVOLVE THE SENIOR EXECUTIVES TO FRONT-LINE ASSOCIATES. WE DELIVER MEANINGFUL EXPERIENCES IN VARIOUS INTERNSHIP AREAS LIKE PRODUCT DEVELOPMENT, CLAIMS, OPERATIONS, FINANCE, IT, DATA ANALYTICS, AND MUCH MORE. ARE YOU READY TO CREATE YOUR OWN JOURNEY BY JOINING OURS? DEDICATED PROGRAM MANAGERS AND KNOWLEDGEABLE MENTORS. LASTING CAREER CONNECTIONS WITH FELLOW INTERNS.\n\nWHAT KEMPER’S INTERNSHIP PROVIDES\n\n10 - 12 WEEK PAID FALL/SPRING/SUMMER INTERNSHIPCHALLENGING PROJECTS THAT SUPPORT THE COMPANY'S OBJECTIVESREAL-TIME CONSTRUCTIVE FEEDBACKA RESOURCE TEAM TO ASSIST WITH TRAINING AND CAREER DEVELOPMENTCOLLABORATION WITH MANAGERS WHO HAVE EXCELLENT BUSINESS ACUMENOPPORTUNITIES TO INTERACT WITH THE SENIOR LEADERSHIP TEAMGROUP ACTIVITIES, INCLUDING VIRTUAL NETWORKING EVENTS AND VOLUNTEER ACTIVITIESDEDICATED PROGRAM MANAGERS AND KNOWLEDGEABLE MENTORSLASTING CAREER CONNECTIONS WITH FELLOW INTERNS\n\nINTERN RESPONSIBILITIES\n\nKEMPER INTERNS WILL BE EXPOSED TO THE FOLLOWING CONCEPTS AND EXPERIENCES:\n\nSUPPORT THE PERFORMANCE MANAGEMENT PROCESS BY REVIEWING SOPS, COMMUNICATIONS, AND TRAINING MATERIALS FOR ALL KEY PERFORMANCE MANAGEMENT PROCESSESAID IN THE COORDINATION AND ADMINISTRATION OF LEARNING PROGRAMS, INCLUDING SCHEDULING TRAINING SESSIONS, TRACKING ATTENDANCE, EVALUATING PROGRAM EFFECTIVENESS, AND SERVING AS A MODERATORCONDUCT AN INVENTORY OF ALL CRITICAL PERFORMANCE AND TALENT DOCUMENTATION INCLUDING SOPS, TEMPLATES, COMMUNICATIONS, TRAINING MATERIALS, ETC.ASSIST WITH TALENT MANAGEMENT INTERNAL SHAREPOINT SITE REORGANIZATION PROJECTSUPPORT VARIOUS PROJECTS ACROSS OTHER HR COES, INCLUDING RESEARCH, DATA GATHERING, DOCUMENTATION, AND PRESENTATION PREPARATION INCLUDING EARLY CAREERS AND KEMPER SCHOLARS PROGRAMSPROVIDE DIRECT SUPPORT TO TALENT MANAGEMENT AND TALENT DEVELOPMENT SPECIALIST AS NEEDEDIDENTIFY OPPORTUNITIES TO STREAMLINE AND IMPROVE EXISTING TALENT AND PERFORMANCE MANAGEMENT PROCESSES AND PROCEDURES TO ENHANCE EFFICIENCY AND EFFECTIVENESSMUST ADHERE TO THE ASSIGNED SCHEDULE AND DEMONSTRATE DEPENDABILITY AND RELIABILITY ON A REGULAR BASIS. \n\nINTERN REQUIREMENTS & QUALIFICATIONS\n\nJUNIOR OR SENIOR STATUS ENROLLED AT: {INSERT SCHOOL OF POSTING} CALIFORNIA STATE UNIVERSITY, CLARK ATLANTA UNIVERSITY, FLORIDA INTERNATIONAL UNIVERSITY, HARRIS-STOWE STATE UNIVERSITY, MILES COLLEGE, UNIVERSITY OF TEXAS RIO GRANDE VALLEYQUALIFYING MAJORS IN AN ACADEMIC AREA RELATED TO BUSINESS ADMINISTRATION OR HUMAN RESOURCES INDUSTRY, SUCH AS, HUMAN RESOURCES MANAGEMENT, BUSINESS ADMINISTRATION, ORGANIZATIONAL PSYCHOLOGY, MANAGEMENT, COMMUNICATIONS, OR OTHER RELATED DEGREESA MINIMUM 3.0 GPA ON A 4.0 GPA SCALEPROFICIENT COMPUTER SKILLS, INCLUDING MICROSOFT OFFICE SUITE (WORD, POWERPOINT, EXCEL, & TEAMS).PROOFREADING SKILLS AND ABILITY TO ANALYZE INFORMATION AND APPLY KNOWLEDGECOLLABORATION AND RELATIONSHIP-BUILDING SKILLSENERGETIC AND EAGER TO TACKLE NEW PROJECTSTHIS POSITION IS NOT ELIGIBLE FOR VISA SPONSORSHIPTHIS POSITION IS A HYBRID ROLE AND MAY REQUIRE WORK IN THE OFFICE 2-3 DAYS A WEEK\n\nTHE HOURLY RATE FOR THIS OPPORTUNITY IS $20.00/HOUR. FALL AND SPRING INTERNS COULD BE EXPECTED TO WORK AT LEAST 20/HOURS PER WEEK. INTERNS ARE ELIGIBLE FOR $2000 STIPEND.\n\nKEMPER IS PROUD TO BE AN EQUAL OPPORTUNITY EMPLOYER. ALL APPLICANTS WILL BE CONSIDERED FOR EMPLOYMENT WITHOUT ATTENTION TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, VETERAN, DISABILITY STATUS OR ANY OTHER STATUS PROTECTED BY THE LAWS OR REGULATIONS IN THE LOCATIONS WHERE WE OPERATE. WE ARE COMMITTED TO SUPPORTING DIVERSITY AND EQUALITY ACROSS OUR ORGANIZATION AND WE WORK DILIGENTLY TO MAINTAIN A WORKPLACE FREE FROM DISCRIMINATION. \n\nKEMPER DOES NOT ACCEPT UNSOLICITED RESUMES THROUGH OR FROM SEARCH FIRMS OR STAFFING AGENCIES. ALL UNSOLICITED RESUMES WILL BE CONSIDERED THE PROPERTY OF KEMPER AND KEMPER WILL NOT BE OBLIGATED TO PAY A PLACEMENT FEE.\n\n KEMPER WILL NEVER REQUEST PERSONAL INFORMATION, SUCH AS YOUR SOCIAL SECURITY NUMBER OR BANKING INFORMATION, VIA TEXT OR EMAIL. IF YOU RECEIVE SUCH A MESSAGE, DELETE IT. \n\n]]>",
    "job_skill_set": [
      "Microsoft Office Suite",
      "Performance Management",
      "Project Coordination",
      "Documentation",
      "Training Administration",
      "Collaboration",
      "Communication",
      "Problem Solving",
      "Dependability",
      "Relationship Building",
      "Adaptability",
      "Eagerness to Learn",
      "Data Analysis",
      "SharePoint"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "analysis",
      "building",
      "collaboration",
      "communication",
      "coordination",
      "data",
      "dependability",
      "documentation",
      "eagerness",
      "hr",
      "human",
      "intern",
      "learn",
      "management",
      "microsoft",
      "office",
      "performance",
      "problem",
      "project",
      "relationship",
      "resources",
      "sharepoint",
      "solving",
      "suite",
      "talent",
      "to",
      "training"
    ]
  },
  {
    "job_id": "3901630033",
    "job_title": "Human Resources Generalist",
    "category": "HR",
    "job_description": "HUMAN RESOURCES GENERALIST JOB DESCRIPTION\nPOSITION SUMMARY:THE HUMAN RESOURCES GENERALIST EXECUTES AND SUPPORTS A VARIETY OF HUMAN RESOURCE FUNCTIONS INCLUDING RECRUITING, BENEFITS, TALENT DEVELOPMENT/TRAINING, EMPLOYEE RELATIONS, COMPENSATION, SUCCESSION PLANNING, COMPLIANCE, SAFETY, AND RECORD MANAGEMENT. PROVIDES GUIDANCE TO MANAGEMENT AND EMPLOYEES ON ROUTINE TO MODERATELY COMPLEX HUMAN RESOURCE ISSUES, CONCERNS, POLICIES, AND PRACTICES IN ACCORDANCE WITH APPLICABLE POLICIES, PROCEDURES, STANDARDS, AND REGULATIONS. THIS POSITION WILL SEEK CONSULTATIVE GUIDANCE AND REPORT TO THE DIRECTOR OF HUMAN RESOURCES.\nTHIS POSITION WILL HAVE THE OPPORTUNITY TO WORK FROM HOME ONE DAY PER WEEK.\n ESSENTIAL FUNCTIONS:ASSIST IN RECRUITMENT AND ONBOARDING PROCESSES, INCLUDING JOB POSTING, SCREENING CANDIDATES, CONDUCTING INTERVIEWS, AND FACILITATING NEW EMPLOYEE ORIENTATION.ADMINISTER EMPLOYEE BENEFITS PROGRAMS, INCLUDING HEALTH INSURANCE, RETIREMENT PLANS, AND OTHER PERKS.HANDLE EMPLOYEE RELATIONS ISSUES, INCLUDING CONFLICT RESOLUTION, DISCIPLINARY ACTIONS, AND PERFORMANCE MANAGEMENT.MAINTAIN ACCURATE AND UP-TO-DATE EMPLOYEE RECORDS, INCLUDING ATTENDANCE, LEAVES, AND PERSONAL INFORMATION.ASSIST IN DEVELOPING AND IMPLEMENTING HR POLICIES AND PROCEDURES IN COMPLIANCE WITH LABOR LAWS AND REGULATIONS.COORDINATE TRAINING AND DEVELOPMENT INITIATIVES FOR EMPLOYEES TO ENHANCE SKILLS AND KNOWLEDGE.SUPPORT PAYROLL PROCESSING AND ENSURE ACCURACY IN PAYROLL RECORDS AND DEDUCTIONS.CONDUCT REGULAR AUDITS OF HR PROCESSES TO ENSURE COMPLIANCE AND EFFICIENCY.ASSIST WITH HR REPORTING AND ANALYTICS TO PROVIDE INSIGHTS AND SUPPORT DECISION-MAKING.COLLABORATE WITH THE MANAGEMENT TEAM ON STRATEGIC HR INITIATIVES AND PROJECTS.\nQUALIFICATIONS AND EXPERIENCE: BACHELOR'S DEGREE IN HUMAN RESOURCES, BUSINESS ADMINISTRATION, OR RELATED FIELD.PROVEN EXPERIENCE AS AN HR GENERALIST OR SIMILAR ROLE, PREFERABLY IN A MANUFACTURING ENVIRONMENT.STRONG KNOWLEDGE OF HR PRINCIPLES, PRACTICES, AND EMPLOYMENT LAWS.EXCELLENT COMMUNICATION AND INTERPERSONAL SKILLS.ABILITY TO HANDLE SENSITIVE AND CONFIDENTIAL INFORMATION WITH INTEGRITY.PROFICIENCY IN HRIS (WORKDAY) AND MS OFFICE SUITE.MULTISITE EXPERIENCE A PLUS.",
    "job_skill_set": [
      "recruiting",
      "employee benefits administration",
      "conflict resolution",
      "HR policies and procedures development",
      "payroll processing",
      "HR reporting and analytics",
      "training and development coordination",
      "communication",
      "interpersonal skills",
      "integrity",
      "team collaboration",
      "problem solving",
      "HRIS (Workday)",
      "MS Office Suite",
      "compliance with labor laws"
    ],
    "short_keywords": [
      "administration",
      "analytics",
      "and",
      "benefits",
      "collaboration",
      "communication",
      "compliance",
      "conflict",
      "coordination",
      "development",
      "employee",
      "generalist",
      "hr",
      "hris",
      "human",
      "integrity",
      "interpersonal",
      "labor",
      "laws",
      "ms",
      "office",
      "payroll",
      "policies",
      "problem",
      "procedures",
      "processing",
      "recruiting",
      "reporting",
      "resolution",
      "resources",
      "skills",
      "solving",
      "suite",
      "team",
      "training",
      "with",
      "workday"
    ]
  },
  {
    "job_id": "3905304763",
    "job_title": "Senior Human Resources Business Partner",
    "category": "HR",
    "job_description": "SENIOR HUMAN RESOURCES BUSINESS PARTNER FOR EPIC BROKERS WILL USE THEIR OUTSTANDING PEOPLE SKILLS TO LEAD, PLAN AND DIRECT OUR TALENT POLICIES, ACTIVITIES, AND DRIVE EMPLOYEE ENGAGEMENT AND CULTURE WHERE ALL EMPLOYEES CAN THRIVE BY DEVELOPING AND SUPPORTING PROGRAMS TARGETED THROUGHOUT THE EMPLOYEE LIFECYCLE AND WILL ENSURE THAT OUR HUMAN RESOURCES PROGRAMS AND INITIATIVES ARE EFFECTIVE, EFFICIENT, AND ALIGNED TO OVERALL BUSINESS OBJECTIVES AND TALENT STRATEGY. THIS IS A HYBRID ROLE THAT HAS IN OFFICE REQUIREMENTS 2-3 DAYS A WEEK TO OUR ALPHARETTA LOCATION.\n\nESSENTIAL DUTIES AND RESPONSIBILITIES\n\nABILITY TO ASSIST REGIONAL LEADERS WITH RETAINING AND DEVELOPING TALENT.WORK DIRECTLY WITH HR MANAGEMENT TO HELP WITH REGIONAL FORECASTING OF STAFFING NEEDS.PROVIDE REGIONAL FINANCE WITH COST PARAMETERS ASSOCIATED WITH HIRING, TRAINING, AND RETAINING TOP TALENT.WORKS TO ASSIST MANAGERS WITH MITIGATING CONFLICTS.DRIVE HR PROGRAMS ACROSS THEIR POPULATIONS.PARTICIPATES IN DEVELOPING DEPARTMENT GOALS AND OBJECTIVES.ENSURES COMPLIANCE WITH LAWS AND REGULATIONS.DEVELOPS NEW JOB DESCRIPTIONS WITH MANAGERS AND AMENDS EXISTING JOB DESCRIPTIONS.ABILITY TO PARTNER WITH CENTERS OF EXCELLENCE FOR HR ANALYTICS, TECHNOLOGY, AND CAREER DEVELOPMENT OPPORTUNITIES FOR THEIR POPULATION.PROACTIVELY LEAD AND DRIVE HR PROJECTS AND INITIATIVES.CRITICALLY IDENTIFY AREAS OF OPPORTUNITY WITHIN THE BUSINESS, DIAGNOSIS ISSUES AND PROVIDE STRATEGIC SOLUTIONS TO RESOLVE.MONITORS THE BUSINESS AND TALENT USING A VARIETY OF KPIS AND PRESENTS RELEVANT DATA TO BUSINESS LEADERS.ADMINISTERS AND PROVIDES GUIDANCE FOR THE PERFORMANCE EVALUATION PROGRAM.ASSURES WAGE ADMINISTRATION POLICIES ARE EQUITABLE AND APPROPRIATE WITHIN THE GUIDELINES OF THE CORPORATE BUDGET, MARKETPLACE CONSIDERATIONS AND JOB ANALYSIS.PROVIDES ADVICE AND GUIDANCE ON EMPLOYEE RELATIONS’ ISSUES, PROGRESSIVE DISCIPLINE, AND DOCUMENTATION REQUIREMENTS TO HR MANAGEMENT.ABILITY TO MANAGE FROM START TO END AN EMPLOYEE RELATIONS CASE WHILE PROVIDING GUIDANCE IN CONFIDENTIAL SITUATIONS AND INFORMING HR MANAGEMENT.WORKS WITH LEADERSHIP TO DEVELOP AND MONITOR THE ORGANIZATION’S CULTURE AND HELP SUPPORT INITIATIVES.PROMOTE POSITIVE EMPLOYEE RELATIONSHIPS THROUGH COMMUNICATION AND INTERPRETATION OF HR POLICIESSUPPORT REGIONAL EMPLOYEES BY FIELDING HR QUESTIONS.EDUCATE AND SUPPORT MANAGEMENT ON EMPLOYEE RELATIONS AND EMPLOYEE PERFORMANCE ISSUES.ASSIST IN THE PREPARATION AND DOCUMENTATION OF HR RELATED POLICIES.\n\nKEY COMPETENCIES\n\nCONSIDERABLE KNOWLEDGE OF PRINCIPLES AND PRACTICES OF HUMAN RESOURCESEXCELLENT ORGANIZATIONAL AND ANALYTICAL SKILLS, DECISION-MAKING ABILITY, AND HIGH LEVEL OF INDEPENDENCEDEMONSTRATED PROFICIENCY IN POWERPOINT, PROJECT MANAGEMENT, EXCEL, SMARTSHEET, AND PRESENTATION SKILLS.EXCEPTIONAL VERBAL AND WRITTEN COMMUNICATIONMUST HAVE M&A EXPERIENCE AS IT RELATES TO INTEGRATION OF HR FUNCTIONS.KNOWLEDGE OF ALL FEDERAL, STATE, AND LOCAL EMPLOYMENT LAWS AND FAIR EMPLOYMENT PRACTICESSOLID INTERVIEWING AND ASSESSMENT ABILITYSTRONG ABILITY TO MULTI-TASK AND ASSIGN PRIORITIES.ABILITY TO WORK EFFECTIVELY AND EFFICIENTLY BOTH WITH AND WITHOUT DIRECT SUPERVISION.ABILITY TO WORK EFFECTIVELY AND EFFICIENTLY IN A TEAM ENVIRONMENT ON A LOCAL AND REMOTE LEVEL.MUST BE ABLE TO WORK IN A DEMANDING ENVIRONMENT WITH DEMONSTRATED ABILITY TO MANAGE MULTIPLE COMPETING TASKS AND DEMANDS.MUST BE ABLE TO TRAVEL BY PLANE TO VISIT OFFICE LOCATIONS.MUST HAVE A HIGH LEVEL OF PEOPLE SKILLS TO MANAGE SENSITIVE AND CONFIDENTIAL SITUATIONS.POSITION REQUIRES TEAMWORK WITH REGIONAL BUSINESS LEADERS AND HR COLLEAGUES.STRONG WORK ETHIC, ENCOURAGING EXCELLENCE AND ENTHUSIASM AMONG STAFF.DEDICATED TO THE HR FIELD AND STRONG COMMITMENT TO ACHIEVING RESULTS.\n\nEDUCATION AND/OR PROFESSIONAL REQUIREMENTS\n\nHR MANAGEMENT, BUSINESS OR RELATED DISCIPLINE PREFERRED; BACHELOR’S DEGREE REQUIRED. MASTERS DEGREE PREFERRED.SHRM- SCP, SPHR AND OTHER HR RELATED PROFESSIONAL CERTIFICATIONS PREFERRED.MINIMUM 7+ YEARS WORKING AND DEVELOPING WITHIN A HUMAN RESOURCE ENVIRONMENT WITH PROGRESSIVE ADVANCEMENT IN CAREER.EXPERIENCE DEVELOPING AND MANAGING HUMAN RESOURCE FUNCTIONS.WORKFORCE DEVELOPMENT, CULTURE ALIGNMENT AND INTEGRATION EXPERIENCEEXCELLENT EMPLOYEE ISSUE RESOLUTION SKILLS AND CONFLICT MANAGEMENT SKILLS DESIREDABILITY TO DEVELOP AND MAINTAIN CONSTRUCTIVE RELATIONSHIPS WITH SENIOR LEADERS FROM ALL FUNCTIONAL BACKGROUNDS.\n\nTHE NATIONAL AVERAGE SALARY FOR THIS ROLE IS $90,000 TO $100,000 IN BASE PAY AND EXCLUSIVE OF ANY BONUSES OR BENEFITS. THE BASE PAY OFFERED WILL BE DETERMINED BASED ON YOUR EXPERIENCE, SKILLS, TRAINING, CERTIFICATIONS AND EDUCATION, WHILE ALSO CONSIDERING INTERNAL EQUITY AND MARKET DATA.\n\nWHY JOIN US?\n\n15TH LARGEST BROKER IN USVOTED \" BEST PLACE TO WORK\" IN THE INSURANCE INDUSTRYAWESOME BENEFITS: 401K MATCHING, GENEROUS TIME OFF POLICY, FLEXIBLE WORK OPTIONS, MEDICAL, DENTAL, VISION, PET INSURANCE, CANCER INSURANCE, WELLNESS PROGRAMS, EMPLOYEE AWARD PROGRAMS (TRIPS!).\n\nEPIC EMBRACES DIVERSITY IN ALL ITS VARIOUS FORMS—WHETHER IT BE DIVERSITY OF THOUGHT, BACKGROUND, RACE, RELIGION, GENDER, SKILLS OR EXPERIENCE. WE ARE COMMITTED TO FOSTERING A WORK COMMUNITY WHERE EVERY COLLEAGUE FEELS WELCOMED, VALUED, RESPECTED AND HEARD. IT IS OUR BELIEF THAT DIVERSITY DRIVES INNOVATION AND THAT CREATING AN ENVIRONMENT WHERE EVERY EMPLOYEE FEELS INCLUDED AND EMPOWERED, HELPS US TO DELIVER THE BEST OUTCOME TO OUR CLIENTS. AN EQUAL OPPORTUNITY/AFFIRMATIVE ACTION EMPLOYER.",
    "job_skill_set": [
      "HR Management",
      "Employee Relations",
      "Conflict Management",
      "Talent Development",
      "HR Analytics",
      "Federal and State Employment Laws",
      "Project Management",
      "PowerPoint",
      "Excel",
      "Presentation Skills",
      "Interviewing and Assessment",
      "Workforce Development",
      "Culture Alignment",
      "Communication",
      "Teamwork",
      "Analytical Skills",
      "Decision-Making",
      "Organizational Skills",
      "Independence",
      "Multi-tasking",
      "Work Ethic",
      "People Skills",
      "Relationship Building",
      "Adaptability",
      "Confidentiality",
      "M&A Experience",
      "SmartSheet"
    ],
    "short_keywords": [
      "adaptability",
      "alignment",
      "analytical",
      "analytics",
      "and",
      "assessment",
      "building",
      "business",
      "communication",
      "confidentiality",
      "conflict",
      "culture",
      "decisionmaking",
      "development",
      "employee",
      "employment",
      "ethic",
      "excel",
      "experience",
      "federal",
      "hr",
      "human",
      "independence",
      "interviewing",
      "laws",
      "ma",
      "management",
      "multitasking",
      "organizational",
      "partner",
      "people",
      "powerpoint",
      "presentation",
      "project",
      "relations",
      "relationship",
      "resources",
      "senior",
      "skills",
      "smartsheet",
      "state",
      "talent",
      "teamwork",
      "work",
      "workforce"
    ]
  },
  {
    "job_id": "3891081144",
    "job_title": "Human Resources Director",
    "category": "HR",
    "job_description": "POSITION SUMMARYGEORGETOWN PREPARATORY SCHOOL, THE NATION'S OLDEST JESUIT HIGH SCHOOL, IS CURRENTLY SEEKING A HUMAN RESOURCES DIRECTOR FOR OUR CAMPUS LOCATED IN NORTH BETHESDA, MARYLAND.THE HUMAN RESOURCES DIRECTOR PLANS, DEVELOPS AND IMPLEMENTS STRATEGIES THAT HELP ENSURE THAT GEORGETOWN PREPARATORY SCHOOL’S MISSION IS REFLECTED IN OUR PROFESSIONAL CULTURE, POLICIES AND PEOPLE. THE ROLE ENCOMPASSES VARIOUS HUMAN RESOURCES FUNCTIONS, INCLUDING BENEFITS, COMPENSATION, FACULTY AND STAFF AND ADMINISTRATION RELATIONS, STAFF DEVELOPMENT AND TRAINING, PERFORMANCE MANAGEMENT AND EVALUATION, RECOGNITION PROGRAMS, HIRING AND HR POLICY DEVELOPMENT AND COMPLIANCE. THE HR DIRECTOR PARTNERS WITH SENIOR ADMINISTRATION MEMBERS ON POLICIES AND PROGRAMS TO ENSURE THE SCHOOL IS IN ALIGNMENT WITH BEST PRACTICES IN SCHOOL HUMAN RESOURCES STRATEGIES, SERVES AS AN ACCESSIBLE RESOURCE TO ALL SCHOOL EMPLOYEES ON HR RELATED MATTERS; AND HELPS FOSTER AN OVERALL CULTURE THAT SUPPORTS THE RETENTION AND SATISFACTION OF OUR TALENTED FACULTY AND STAFF. THIS POSITION REPORTS TO THE PRESIDENT, AND IS A MEMBER OF THE PRESIDENT’S CABINET.\nPRIMARY AREAS OF RESPONSIBILITY:\nEMPLOYEE RELATIONS:EMPLOYEES ON BENEFITS, MANAGEMENT ISSUES, PROFESSIONAL DEVELOPMENT, ETC.TRAININGS ON RELEVANT HR AND WORKPLACE ISSUESWITH SCHOOL AND DEPARTMENTAL LEADERSHIP ON EMPLOYEE DEVELOPMENT, EVALUATION, RECOGNITION AND OTHER AREASAS A RESOURCE/MEDIATOR TO HELP ENSURE POSITIVE OUTCOMES TO EMPLOYEE ISSUES\nEMPLOYEE LIFECYCLE:\nPERSONNEL FILES AND PRODUCE REPORTS FOR OUTSIDE ENTITIES TO COMPLY WITH LOCAL GOVERNMENT AND FEDERAL REGULATIONS AS NEEDEDAND MAINTAIN JOB DESCRIPTIONS FOR ALL POSITIONSWITH DEPARTMENTAL HEADS TO PLACE EMPLOYMENT ADS AND SCREEN RESUMES FOR OPEN POSITIONSPERFORMANCE REVIEW AND EVALUATION PROCESSBACKGROUND CHECK PROCESS FOR INCOMING EMPLOYEES, CAMP COUNSELORS AND VOLUNTEERSAND MAINTAIN THE MARYLAND EMPLOYMENT HISTORY REVIEW PROCESS AND RECORDSONBOARDING AND OFFBOARDING FOR ALL EMPLOYEES (FULL TIME, PART TIME AND SEASONAL)MARKETPLACE COMPENSATION AND BENEFITS AND ENSURE PREP REMAINS COMPETITIVE\nHEALTH BENEFITS, WORKERS COMPENSATION, DISABILITY, AND ANCILLARY BENEFIT PROGRAMS:\nBENEFITS ADMINISTRATION INCLUDING ENROLLMENTS, TERMINATIONS AND CLAIMSOPEN ENROLLMENT MEETINGS AND DISTRIBUTE INFORMATION REGARDING BENEFIT CHANGESAS THE CHIEF CONTACT FOR BENEFIT PROGRAMSTO AND MONITOR EMPLOYMENT VERIFICATIONS AND WORKERS COMPENSATION CLAIMS\nOTHER:\nCOMPLIANCE WITH VIRTUS (PROTECTING GOD’S CHILDREN) TRAINING FOR ALL FACULTY, STAFF AND ON-CAMPUS VOLUNTEERS WHO HAVE INTERACTION WITH STUDENTSMANAGE AND MAINTAIN EMPLOYEE HANDBOOK AND RELATED POLICIESPROACTIVE ADHERENCE TO LOCAL AND FEDERAL LAWS AND REGULATIONS RELATING TO EMPLOYMENT MATTERSRELATED DUTIES AS ASSIGNED\nCRUCIAL QUALITIES AND COMPETENCIES:\nLEAST TEN (10) YEARS OF CONSECUTIVE AND CURRENT EXPERIENCE IN A HUMAN RESOURCES LEADERSHIP ROLEAND INITIATIVE, AS WELL AS THE ABILITY TO WORK INDEPENDENTLY, COMBINED WITH THE SKILLS FOR THRIVING IN A TEAM ENVIRONMENTPROFESSIONAL AND ETHICAL STANDARDS FOR HANDLING CONFIDENTIAL INFORMATIONSKILLS AND CLOSE ATTENTION TO DETAIL, WITH ABILITY TO PRIORITIZE TO MEET DEADLINESWRITTEN, ORAL AND INTERPERSONAL SKILLSCOMPUTER SKILLS, AND PROFICIENCY WITH MICROSOFT OFFICE, AS WELL AS PAYROLL AND BENEFIT SYSTEMS, AND OTHER HR RELATED PORTALS, SYSTEMS AND DATABASESADDITIONAL QUALIFICATIONS:B.A./B.S. DEGREE. CERTIFICATION IN HUMAN RESOURCES OR ADVANCED DEGREE PREFERREDRESOURCES EXPERIENCE IN AN INDEPENDENT AND/OR CATHOLIC SCHOOL ENVIRONMENT PREFERRED\nIN ORDER TO BE CONSIDERED FOR THIS POSITION, INTERESTED CANDIDATES MUST APPLY THROUGH THE WEBSITE PORTAL, AND APPLICATION SHOULD INCLUDE A RESUME AND COVER LETTER. INFORMATION SENT THROUGH LINKEDIN, OR EMAIL WILL NOT BE CONSIDERED. NO PHONE INQUIRIES PLEASE.\nHTTPS://WWW.GPREP.ORG/ABOUT/EMPLOYMENT\nCOMPENSATION IS COMMENSURATE WITH EXPERIENCE. GEORGETOWN PREP OFFERS ACOMPREHENSIVE AND COMPETITIVE BENEFIT PACKAGE (INCLUDING HEALTH, DISABILITY, SICKAND VACATION LEAVE, 403B RETIREMENT PLAN WITH MATCH, AND A VARIETY OF OTHEREMPLOYEE VALUED BENEFITS). \nAS A CATHOLIC INSTITUTION, GEORGETOWN PREPARATORY SCHOOL IS AN EQUAL EMPLOYMENTOPPORTUNITY EMPLOYER IN COMPLIANCE WITH ALL APPLICABLE EEO LAWS.",
    "job_skill_set": [
      "human resources management",
      "employee relations",
      "benefits administration",
      "compliance",
      "performance management",
      "training and development",
      "payroll systems",
      "Microsoft Office",
      "data analysis",
      "employment law knowledge",
      "communication",
      "teamwork",
      "initiative",
      "confidentiality",
      "attention to detail",
      "problem solving",
      "interpersonal skills",
      "independence",
      "leadership",
      "adaptability",
      "HR policy development",
      "background check process",
      "job description maintenance"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "analysis",
      "and",
      "attention",
      "background",
      "benefits",
      "check",
      "communication",
      "compliance",
      "confidentiality",
      "data",
      "description",
      "detail",
      "development",
      "director",
      "employee",
      "employment",
      "hr",
      "human",
      "independence",
      "initiative",
      "interpersonal",
      "job",
      "knowledge",
      "law",
      "leadership",
      "maintenance",
      "management",
      "microsoft",
      "office",
      "payroll",
      "performance",
      "policy",
      "problem",
      "process",
      "relations",
      "resources",
      "skills",
      "solving",
      "systems",
      "teamwork",
      "to",
      "training"
    ]
  },
  {
    "job_id": "3902831427",
    "job_title": "Human Resources Director",
    "category": "HR",
    "job_description": "DIRECTOR OF HUMAN RESOURCES - ET GLOBAL  RESPONSIBLE FOR OVERSEEING ALL ASPECTS OF ALL HR MANAGEMENT WITHIN THE COMPANY. THIS INCLUDES RECRUITMENT, EMPLOYEE RELATIONS, BENEFITS AND COMPLIANCE. KEY RESPONSIBILITIES: HRIS SYSTEMS:\nRESEARCH AND IMPLEMENT AN IMPROVED HRIS PLATFORM; WORK IN CONJUNCTION WITH HOME OFFICE TO EVALUATION GLOBAL SYSTEM OPPORTUNITIES\nRECRUITMENT AND STAFFING: DEVELOP AND IMPLEMENT EFFECTIVE RECRUITMENT STRATEGIES.MANAGING ONBOARDING AND ORIENTATION PROCESSES FOR NEW EMPLOYEES  EMPLOYEE RELATIONS:  ADDRESS EMPLOYEE CONCERNS, CONFLICTS, AND GRIEVANCES IN A FAIR AND COMPASSIONATE MANNERPROMOTE A CULTURE OF OPEN COMMUNICATION AND TEAMWORK; DEVISE AND MONITOR EMPLOYEE PERFORMANCE AND PROVIDE FEEDBACK AND COACHING; IMPLEMENT A PERFORMANCE/DEVELOPMENT MANAGEMENT PROCESS.DEVELOP AND IMPROVE JOB DESCRIPTIONS AND A JOB GRADING PROCESS; BENCHMARK AGAINST THE INDUSTRY AND COMPETITION  COMPLIANCE: ENSURE COMPLIANCE WITH FEDERAL, STATE, AND LOCAL LABOR LAWS AND REGULATIONS   BENEFITS ADMINISTRATION: ADMINISTER EMPLOYEE BENEFIT PROGRAMS, INCLUDING HEALTH AND RETIREMENT PLANS; ANNUALLY EVALUATE PROGRAMS AND SEEK COMPETITIVE ALTERNATIVES.DIRECTS THE WORKERS COMP PROGRAMLEAD AND DEVELOP EMPLOYEE RECOGNITION PROGRAMS  QUALIFICATIONS: BACHELOR'S DEGREE IN HR OR RELATED FIELDEXCELLENT COMMUNICATION SKILLS WE ARE AN EQUAL-OPPORTUNITY EMPLOYER. WE CELEBRATE DIVERSITY AND CREATE AN INCLUSIVE ENVIRONMENT FOR ALL EMPLOYEES. ALL QUALIFIED APPLICATIONS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, AGE, PROTECTED VETERAN STATUS, OR DISABILITY STATUS.  BENEFITS:  401(K)401(K) MATCHINGDENTAL INSURANCEHEALTH INSURANCELIFE INSURANCEPAID TIME OFFVISION INSURANCE",
    "job_skill_set": [
      "Employee Relations",
      "Performance Management",
      "Communication",
      "Teamwork",
      "Conflict Resolution",
      "Coaching",
      "Problem Solving",
      "Leadership",
      "HRIS Systems",
      "Recruitment Strategies",
      "Compliance with Labor Laws",
      "Benefits Administration",
      "Job Grading Process",
      "Data Analysis",
      "Empathy"
    ],
    "short_keywords": [
      "administration",
      "analysis",
      "benefits",
      "coaching",
      "communication",
      "compliance",
      "conflict",
      "data",
      "director",
      "empathy",
      "employee",
      "grading",
      "hr",
      "hris",
      "human",
      "job",
      "labor",
      "laws",
      "leadership",
      "management",
      "performance",
      "problem",
      "process",
      "recruitment",
      "relations",
      "resolution",
      "resources",
      "solving",
      "strategies",
      "systems",
      "teamwork",
      "with"
    ]
  },
  {
    "job_id": "3890895200",
    "job_title": "Human Resources Lead",
    "category": "HR",
    "job_description": "WE ARE IN SEARCH OF A PROACTIVE AND STRATEGIC-MINDED HR LEAD, TO PILOT ALL ASPECTS OF HR FOR CM HOLD CO AND ALL OF ITS BRANDS. THIS IS A SINGULAR HR POSITION, SO HAVING A BREADTH OF GENERALIST EXPERIENCE WILL BE VITAL TO MEETING THE NEEDS OF THE COMPANY/S. \nIN THIS ROLE, YOU WILL REPORT DIRECTLY TO THE CEO OF CM HOLD CO AND WILL HAVE ONE EXPERIENCED RECRUITER AS A DIRECT REPORT. IT WILL BE A HYBRID WORK SCHEDULE, REQUIRING UP TO 2 DAYS PER WEEK IN OUR PASADENA OFFICE. \nMOST IMPORTANTLY WE ARE LOOKING FOR SOMEONE WHO WANTS TO BE AN AMBASSADOR FOR OUR CULTURE, ALIGNING OUR VALUES AND ITS PEOPLE, SERVING OUR STAFF BY PROVIDING SYSTEMS AND CLARITY AROUND HOW WE ARE HERE TO EQUIP, PROVIDE FOR, AND SUPPORT OUR STAFF’S GOALS, NEEDS, AND POTENTIAL. THIS ROLE IS AN EXCITING OPPORTUNITY TO MAKE A SIGNIFICANT IMPACT ON OUR COMPANY'S FUTURE. \nROLE RESPONSIBILITIES:LEAD, FACILITATE, AND OPTIMIZE THE DELIVERY OF CONSISTENTLY EXCELLENT HR SERVICES IN THE AREAS OF ONBOARDING, EMPLOYEE COMMUNICATIONS, ORGANIZATIONAL DEVELOPMENT, TRAINING, PERFORMANCE MANAGEMENT, EMPLOYEE RELATIONS, BENEFITS, COMPENSATION, COMPLIANCE, AND MENTORING.PROVIDE MENTORING TO MANAGEMENT AND EMPLOYEES TO RESOLVE CONFLICTS, IMPROVE TEAM EFFECTIVENESS, AND ENSURE SUPPORT OF ORGANIZATIONAL CHANGES AND BUSINESS PLANS. DRIVE DIVERSITY, INCLUSION, AND PEOPLE CULTURE INITIATIVES IN A MULTICULTURAL ENVIRONMENT. PROACTIVELY LEAD THE CREATION AND REFINEMENT OF HR POLICIES, PROCESSES, AND PRACTICES TO ADAPT TO THE EVOLVING NEEDS OF THE BUSINESSES WITHIN CM HOLD CO. OVERSEE THE COMPANY’S HR SYSTEMS AND PROVIDE SOLUTIONS TO IMPROVE THE EMPLOYEE EXPERIENCE AND MINIMIZE HR RISK.PARTNER WITH A THIRD-PARTY BENEFITS BROKER OR COMPANY TO ADMINISTER EMPLOYEE BENEFITS, SUCH AS MEDICAL, DENTAL, VISION, 401K, ETC. ALSO RESPONSIBLE FOR LEADING ANNUAL OPEN ENROLLMENT AND BENEFIT NEGOTIATIONS.MANAGE RELATIONSHIP WITH PAYROLL PROVIDER, PAYLOCITY AS WELL AS ADMINISTER SEMI-MONTHLY PAYROLL IN PARTNERSHIP WITH THE FINANCE TEAM, WHICH INCLUDES SUPPLYING NECESSARY REPORTING, ANALYSIS, AND EMPLOYEE ISSUE RESOLUTION.LEVERAGE DATA AND FEEDBACK TO IDENTIFY OPPORTUNITIES FOR IMPROVEMENT (ENGAGEMENT SURVEYS, ETC).SERVE AS THE ADMINISTRATOR FOR OUR HRIS HIBOB, USED FOR PERFORMANCE MANAGEMENT, PTO TRACKING, ENGAGEMENT SURVEYS, MAINTAINING PHYSICAL AND DIGITAL FILES, ANNIVERSARY TRACKING, ETC.ACT AS AN INTERNAL CONSULTANT TO COMPANY LEADERS ON TOPICS SUCH AS LEADERSHIP DEVELOPMENT, PERFORMANCE MANAGEMENT, CULTURE BUILDING, AND HIRING PRACTICES.ADMINISTERING EXIT INTERVIEWS AND EMPLOYEE SEPARATION PROCESS.WORKS CLOSELY WITH YOUR RECRUITMENT LEAD TO DEVELOP STAFFING STRATEGIES AND IMPLEMENTATION PLANS AND PROGRAMS TO IDENTIFY TALENT WITHIN AND OUTSIDE THE COMPANY. \nQUALIFICATIONS:BACHELOR’S DEGREE IN A RELATED FIELD (MASTERS IS AN ADVANTAGE).PHRCA CERTIFICATION FOR CALIFORNIA (CAN BE EARNED WHILE AN EMPLOYEE).8+ YEARS’ OF HR EXPERIENCE, PREFERABLY IN A CREATIVE INDUSTRY LIKE ADVERTISING, ENTERTAINMENT, ETC.STRONG EXPERIENCE ACROSS THE EMPLOYEE LIFECYCLE FROM ONBOARDING THROUGH PERFORMANCE MANAGEMENT AND LEADERSHIP DEVELOPMENT.A SELF-STARTER WITH THE ABILITY TO WORK EFFECTIVELY WITH LIMITED RESOURCES.HIGH-ENERGY, HANDS-ON, ROLL-UP-THE-SLEEVES MENTALITY WHERE NO TASK IS TOO SMALL OR TOO BIG. AN ENTREPRENEURIAL ORIENTATION IS EXTREMELY IMPORTANT; SOMEONE WHO IS NIMBLE AND QUICK, PROACTIVE, AND WHO ENJOYS AND APPRECIATES THE VALUE OF INNOVATION AND CHANGE.BE HIGHLY ADAPTABLE AND FLEXIBLE, WITH THE ABILITY TO THRIVE IN AN AMBIGUOUS ENVIRONMENT AND ENABLE SIGNIFICANT PROGRESS. ABILITY TO ARTICULATE YOUR POV CONSCIOUSLY AND CONSTRUCTIVELY TO HELP SHAPE AND GUIDE LEADERSHIP DECISION-MAKING.MANAGEMENT SKILLS INCLUDING STRATEGIC PLANNING, BUDGETING, PROCESS FOCUS, AND RISK MANAGEMENT. LEADERSHIP SKILLS INCLUDING COACHING, MENTORING, ACTIVE LISTENING, CLEAR COMMUNICATION, EMPATHY, AND ABILITY TO MOTIVATE.RESULTS FOCUSED WITH A STRONG BIAS TOWARD PROBLEM-SOLVING, THOUGHTFUL ACTION, REPEATABLE AND SCALABLE PROCESSES. \nBENEFITS:MEDICAL, DENTAL, VISION, ETC. 401(K) WITH EMPLOYER MATCHING PROFIT SHARING END OF YEAR BONUS FLEXIBLE PTO",
    "job_skill_set": [
      "data analysis",
      "strategic planning",
      "mentoring",
      "communication",
      "leadership",
      "problem-solving",
      "adaptability",
      "teamwork",
      "self-starter",
      "empathy",
      "motivation",
      "strategic thinking",
      "HR policies",
      "employee onboarding",
      "performance management",
      "employee relations",
      "HRIS (HiBob)",
      "benefits administration",
      "payroll management",
      "compliance",
      "budgeting",
      "risk management",
      "diversity and inclusion initiatives",
      "staffing strategies",
      "employee engagement surveys",
      "entrepreneurial mindset",
      "active listening",
      "cultural ambassador"
    ],
    "short_keywords": [
      "active",
      "adaptability",
      "administration",
      "ambassador",
      "analysis",
      "and",
      "benefits",
      "budgeting",
      "communication",
      "compliance",
      "cultural",
      "data",
      "diversity",
      "empathy",
      "employee",
      "engagement",
      "entrepreneurial",
      "hibob",
      "hr",
      "hris",
      "human",
      "inclusion",
      "initiatives",
      "lead",
      "leadership",
      "listening",
      "management",
      "mentoring",
      "mindset",
      "motivation",
      "onboarding",
      "payroll",
      "performance",
      "planning",
      "policies",
      "problemsolving",
      "relations",
      "resources",
      "risk",
      "selfstarter",
      "staffing",
      "strategic",
      "strategies",
      "surveys",
      "teamwork",
      "thinking"
    ]
  },
  {
    "job_id": "3901483670",
    "job_title": "Human Resources Administrative Assistant",
    "category": "HR",
    "job_description": "MONDAY - FRIDAY 9-5 WITH SOME FLEXIBILITY TO 7-8PM A COUPLE OF TIMES A MONTH.\nIDEAL CANDIDATE MUST HAVE ADMINISTRATIVE SKILLS, SOME HR WOULD BE GOOD, BUT NOT REQUIRED. NEEDS TO BE COMFORTABLE WITH COMPUTERS.\nVERY ADMINISTRATIVE POSITION.\n\nTHIS POSITION SUPPORTS HR MANAGER AND HRBP TO SUCCESSFULLY IMPLEMENT LOCAL INITIATIVES, AND EXECUTE REGIONAL AND CORPORATE PROGRAMS. HELP TO CREATE AN ENVIRONMENT TO ATTRACT, DEVELOP, RETAIN AND ENGAGE TALENT THROUGHOUT THE OPCO TO DELIVER BUSINESS GOALS. RESPONSIBILITIES INCLUDE EXECUTING OF TRANSACTIONAL CORE HR PROCESSES (E.G. COORDINATE AND CONDUCT NEW ASSOCIATE ORIENTATION, UNEMPLOYMENT CLAIMS PROCESSES, ONBOARDING AND EXIT INTERVIEWS, TRANSITIONAL RETURN TO WORK, LEAVE ADMINISTRATION, OSHA REPORTING, ETC.), PROVIDING COACHING AND GUIDANCE TO ASSOCIATES AND SUPERVISORS REGARDING POLICY AND PROCEDURE, SUPPORTING HIRING MANAGERS AND TALENT ACQUISITION TO SUPPORT RECRUITMENT AND STAFFING PLANS, SUPPORTING AND MAINTAINING ETIME SYSTEM AND PAYROLL-RELATED ACTIVITIES, SUPPORTING HRBP TO DRIVE AN INCLUSIVE AND DIVERSE CULTURE, ADMINISTER PROGRAMS TO ENHANCE EMPLOYEE ENGAGEMENT AND SATISFACTION LEVELS.",
    "job_skill_set": [
      "administrative skills",
      "HR processes",
      "computer proficiency",
      "onboarding",
      "communication",
      "teamwork",
      "problem solving",
      "flexibility",
      "organizational skills",
      "interpersonal skills",
      "payroll administration",
      "OSHA reporting",
      "leave administration",
      "employee engagement programs",
      "coaching"
    ],
    "short_keywords": [
      "administration",
      "administrative",
      "assistant",
      "coaching",
      "communication",
      "computer",
      "employee",
      "engagement",
      "flexibility",
      "hr",
      "human",
      "interpersonal",
      "leave",
      "onboarding",
      "organizational",
      "osha",
      "payroll",
      "problem",
      "processes",
      "proficiency",
      "programs",
      "reporting",
      "resources",
      "skills",
      "solving",
      "teamwork"
    ]
  },
  {
    "job_id": "3894877672",
    "job_title": "Human Resources Coordinator",
    "category": "HR",
    "job_description": "SINCE 1946, DAVIS-ULMER SPRINKLER CO. HAS BEEN PROVIDING FULL-SERVICE FIRE SPRINKLER, SUPPRESSION, ALARM, AND SECURITY SYSTEMS TO ITS CUSTOMERS, WHILE MAINTAINING OUR REPUTATION AS BEING ONE OF THE BEST COMPANIES IN THE BUSINESS IN THE NORTHEAST REGION. DAVIS-ULMER CONTRIBUTES ITS SUCCESS TO THEIR LOYAL EMPLOYEES AND CUSTOMERS. THE COMPANY'S OVERALL WORK FORCE HAS GROWN AND AS WE MOVE FORWARD, WE FORESEE CONTINUED EXPANSION THROUGHOUT THE NORTHEAST.\nAT DAVIS-ULMER WE BELIEVE THAT INVESTING AND EMPOWERING OUR EMPLOYEES AS LEADERS DEVELOPS AN ORGANIZATION THAT DELIVERS INNOVATIVE SOLUTIONS AND SERVICES THAT CREATE A SUPERIOR CUSTOMER EXPERIENCE. THE UNIQUE BLEND OF OUR LEADER'S ABILITIES AND THE OWNERSHIP OF THEIR WORK, COMBINED WITH OUR CULTURE AND VALUES, CREATES SOMETHING THAT IS SIMPLY DESCRIBED AS THE DAVIS-ULMER DIFFERENCE.\nDUE TO CONTINUED GROWTH, WE ARE ACTIVELY SEEKING AN EXPERIENCE HR COORDINATOR TO JOIN OUR DAVIS-ULMER SUPPORT TEAM IN ROCHESTER, NY. AS THE HR COORDINATOR, YOU WILL BE RESPONSIBLE FOR PROVIDING ADMINISTRATIVE SUPPORT TO THE PEOPLE TEAM.\nJOB RESPONSIBILITIES:\nHUMAN RESOURCES:\nSETS UP NEW HIRE DRUG TESTING AND COMPLETE THE NEW HIRE BACKGROUND CHECKS FOLLOWING COMPANY AND COLLECTIVE BARGAINING AGREEMENT POLICIES.MAINTAINS ELECTRONIC EMPLOYEE FILES.PROCESSES LEAVE OF ABSENCE AND DISABILITY CLAIMS.UPDATES PAYROLL SYSTEM WITH BENEFIT DEDUCTION CHANGESEMPLOYEE LIAISON FOR BENEFIT QUESTIONS AND OPEN ENROLLMENTUPDATE THE LEARNING MANAGEMENT SYSTEM (LMS) WITH NEW HIRE FOLLOWS-THROUGH TO ENSURE COMPLETION.ASSIST IN POSTING JOBS ON THE APPLICATION TRACKING WEBSITE AND WORK WITH BRANCHES ON SET-UP OF INTERVIEWS, FOLLOW-THROUGH WITH CANDIDATES.FACILITATES NEW HIRE ORIENTATION AND UPDATES AS NEEDED.MAY PERFORM INTERNAL ANNUAL AUDITS OF PROCESSES AND PROCEDURES.OTHER RELATED DUTIES AS ASSIGNED.SAFETY:\nADMINISTER THE SAFETY INCENTIVE PROGRAM TO ENSURE POINTS ARE DISTRIBUTED AS PER THE POLICY.ASSISTS WITH ONBOARDING OF NEW HIRES AND SETS UP TRAINING REMINDERS, AS WELL AS FOLLOW-UP.ORDERS AND RECORDS SAFETY INCENTIVE PROGRAM PURCHASESOTHER RELATED DUTIES AS ASSIGNED.\nQUALIFICATIONS/REQUIREMENTS:\nASSOCIATE DEGREE PREFERRED, OR A COMBINATION OF SCHOOLING AND EXPERIENCE.PREVIOUS EXPERIENCE IN HR PREFERRED.EXPERIENCE IN AN OFFICE SETTING WORKING WITH CONFIDENTIAL INFORMATION.PROVEN COMPUTER PROFICIENCY (OUTLOOK, WORD, EXCEL), WITH ADVANCED EXCEL SKILLS A PLUSHIGH APTITUDE FOR CUSTOMER SERVICEPRIORITIZATION AND MANAGEMENT OF MULTIPLE TASKSDEPENDABLE, ACCURATE, AND DETAIL ORIENTEDMUST BE A SELF-STARTER WHO TAKES INITIATIVE AND ANTICIPATES NEEDS.ABILITY TO EFFECTIVELY AND PROFESSIONALLY COMMUNICATE WITH ALL LEVELS OF MANAGEMENT AND EMPLOYEES.MUST POSSESS A STRONG WORK ETHIC AND BE A TEAM PLAYER, WHILE MAINTAINING A CONFIDENTIAL WORK ENVIRONMENT\nCERTIFICATIONS, LICENSES & REGISTRATIONS:\nSHRM OR PHR CERTIFICATION A PLUS, BUT NOT REQUIRED.\nWHY WORK FOR DAVIS-ULMER FAMILY OF COMPANIES?\nWE OFFER COMPETITIVE PAY FOR EXPERIENCED INDIVIDUALS.WE ARE OWNED BY THE API GROUP, A PUBLICLY TRADED, MULTI-BILLION-DOLLAR CORPORATION BASED IN MINNESOTA. THIS IS A BENEFIT THAT PROVIDES FINANCIAL SUPPORT AND BACKING, WORLD-CLASS TRAINING, AND LEADERSHIP DEVELOPMENT.WE OFFER AN INDUSTRY LEADING BENEFITS PACKAGE THAT INCLUDES MEDICAL, DENTAL, VISION, AND ADDITIONAL VOLUNTARY BENEFITS.WE ARE AN ENGAGED ORGANIZATION WITH STRONG AND AUTHENTIC VALUES, WITH CLEAR EVIDENCE OF TRUST AND FAIRNESS, WHERE TWO-WAY PROMISES AND COMMITMENTS ARE UNDERSTOOD AND FULFILLED.WE HIRE PEOPLE WHOSE VALUES ALIGN WITH OURS. THIS IS A KEY ELEMENT OF OUR PEOPLE/TALENT DEVELOPMENT OPERATING CODE.WE BELIEVE IF YOU INVEST IN THE RIGHT PEOPLE, YOU WILL CREATE LONG-LASTING PROFESSIONAL RELATIONSHIPS THAT BENEFIT EVERYONE.SALAR RANGE: $44,800- $56,000\nDAVIS-ULMER AND OUR FAMILY OF COMPANIES OFFER A COMPETITIVE BENEFITS PACKAGE WHICH INCLUDES HEALTH, DENTAL, AND VISION INSURANCE, A 401K MATCH PROGRAM, EMPLOYER FUNDED PROFIT-SHARING PLAN AND A VARIETY OF VOLUNTARY BENEFITS.\nDAVIS-ULMER AND ITS SUBSIDIARIES ARE AFFIRMATIVE ACTION AND EQUAL OPPORTUNITY EMPLOYERS, AND DO NOT DISCRIMINATE ON THE BASIS OF ANY LEGALLY PROTECTED STATUS OR CHARACTERISTIC. MINORITY/FEMALE/DISABILITY/VETERAN\nDAVIS-ULMER'S ENDURING PURPOSE: \"TO PROTECT WHAT YOU VALUE MOST.\"",
    "job_skill_set": [
      "HR administration",
      "background checks",
      "payroll processing",
      "employee file management",
      "job posting",
      "safety program administration",
      "computer proficiency",
      "confidential information handling",
      "certifications (SHRM, PHR)",
      "customer service",
      "communication",
      "prioritization",
      "initiative",
      "dependability",
      "attention to detail",
      "teamwork",
      "self-starter",
      "leave of absence processing",
      "LMS management",
      "advanced Excel"
    ],
    "short_keywords": [
      "absence",
      "administration",
      "advanced",
      "attention",
      "background",
      "certifications",
      "checks",
      "communication",
      "computer",
      "confidential",
      "coordinator",
      "customer",
      "dependability",
      "detail",
      "employee",
      "excel",
      "file",
      "handling",
      "hr",
      "human",
      "information",
      "initiative",
      "job",
      "leave",
      "lms",
      "management",
      "of",
      "payroll",
      "phr",
      "posting",
      "prioritization",
      "processing",
      "proficiency",
      "program",
      "resources",
      "safety",
      "selfstarter",
      "service",
      "shrm",
      "teamwork",
      "to"
    ]
  },
  {
    "job_id": "3889758336",
    "job_title": "[HYBRID] Human Resources Manager",
    "category": "HR",
    "job_description": "JOB SUMMARY/COMPANY:ARE YOU A PASSIONATE HR LEADER WITH A PROVEN TRACK RECORD IN BUILDING A THRIVING WORKPLACE CULTURE? DO YOU HAVE A STRONG COMMITMENT TO COMPLIANCE AND A KNACK FOR TURNING HIGH-VOLUME RECRUITMENT INTO A SEAMLESS PROCESS? THEN THIS ROLE IS FOR YOU! WE ARE LOOKING FOR A HR MANAGER READY THAT PARTICIPATES IN THE FULL EMPLOYEE LIFE CYCLE FROM RECRUITMENT, HIRING, AND RETENTION. THIS OPPORTUNITY IS LOCATED AT HEALTH SERVICE AGENCY IN THE DISTRICT COLUMBIA. IN ADDITION, THIS POSITION OFFERS A HYBRID SCHEDULE WITH THE OPPORTUNITY TO WORK FROM HOME. \nRESPONSIBILITIES:LEAD ALL ASPECTS OF THE HR FUNCTION, INCLUDING RECRUITMENT AND ONBOARDING, EMPLOYEE RELATIONS, BENEFITS ADMINISTRATION, TRAINING AND DEVELOPMENT, PERFORMANCE MANAGEMENT, POLICY DEVELOPMENT, AND COMPLIANCE.PARTNER WITH THE EXECUTIVE TEAM TO DEVELOP AND IMPLEMENT HR STRATEGIES THAT ALIGN WITH OUR ORGANIZATIONAL GOALS.OVERSEE THE ENTIRE RECRUITMENT PROCESS, FROM ATTRACTING TOP TALENT TO ONBOARDING NEW HIRES, WITH A FOCUS ON EFFICIENCY AND EFFECTIVENESS. MANAGE A HIGH VOLUME OF RECRUITMENT NEEDS, TYPICALLY FILLING 5-7 ROLES PER MONTH, WITH THE ABILITY TO SURGE FOR SPECIAL PROJECTS (UP TO 20 ROLES).CHAMPION A CULTURE OF CONTINUOUS LEARNING AND DEVELOPMENT BY CREATING AND IMPLEMENTING COMPREHENSIVE TRAINING PROGRAMS FOR ALL STAFF.ENSURE ADHERENCE TO ALL FEDERAL, STATE, AND LOCAL EMPLOYMENT LAWS AND REGULATIONS.MAINTAIN STRONG RELATIONSHIPS WITH EMPLOYEES AND CULTIVATE A POSITIVE AND RESPECTFUL WORK ENVIRONMENT.CHAMPION THE USE OF TECHNOLOGY TO STREAMLINE HR PROCESSES AND IMPROVE EFFICIENCY.\nQUALIFICATIONS/BACKGROUND PROFILE:A MINIMUM OF 4 YEARS OF LEADERSHIP EXPERIENCE IN HR FUNCTIONS.A BACHELOR'S DEGREE IN HR MANAGEMENT, BUSINESS ADMINISTRATION, COMMUNICATION, OR A RELATED FIELD (MASTER'S DEGREE PREFERRED).PHR OR SPHR/SCP CERTIFICATION (DESIRABLE).PROVEN ABILITY TO MULTI-TASK EFFECTIVELY IN A FAST-PACED ENVIRONMENT.DEMONSTRATED EXPERIENCE WORKING WITHIN THE NON-PROFIT SECTOR.STRONG UNDERSTANDING OF SHRM PRINCIPLES.PROFICIENCY IN HR TECHNOLOGY PLATFORMS.A PASSION FOR BUILDING A DIVERSE AND INCLUSIVE WORKPLACE. (BONUS POINTS FOR HEALTHCARE CREDENTIALING EXPERIENCE!)\nQUALIFIED CANDIDATES SHOULD APPLY AND CALL JUSTICE AT 202-292-2542 FOR ADDITIONAL DETAILS. PLEASE NOTE, RESUME MUST INCLUDE A VALID EMAIL ADDRESS IN ORDER TO BE CONSIDERED. WE LOOK FORWARD TO DISCUSSING YOUR BACKGROUND, YOUR CURRENT JOB SEARCH, AND YOUR POTENTIAL CAREER PATH WITH SPARKS GROUP!SPARKS GROUP IS AN EQUAL OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, NATIONAL ORIGIN, AGE, PREGNANCY, CITIZENSHIP, FAMILY STATUS, GENETIC INFORMATION, DISABILITY, OR PROTECTED VETERAN STATUS.",
    "job_skill_set": [
      "HR Management",
      "Recruitment",
      "Onboarding",
      "Employee Relations",
      "Benefits Administration",
      "Leadership",
      "Communication",
      "Multi-tasking",
      "Problem Solving",
      "Relationship Building",
      "Adaptability",
      "Teamwork",
      "Training and Development",
      "Performance Management",
      "Policy Development",
      "Compliance",
      "HR Technology Platforms",
      "SHRM Principles",
      "Diversity and Inclusion",
      "Healthcare Credentialing",
      "Cultural Awareness"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "and",
      "awareness",
      "benefits",
      "building",
      "communication",
      "compliance",
      "credentialing",
      "cultural",
      "development",
      "diversity",
      "employee",
      "healthcare",
      "hr",
      "human",
      "hybrid",
      "inclusion",
      "leadership",
      "management",
      "manager",
      "multitasking",
      "onboarding",
      "performance",
      "platforms",
      "policy",
      "principles",
      "problem",
      "recruitment",
      "relations",
      "relationship",
      "resources",
      "shrm",
      "solving",
      "teamwork",
      "technology",
      "training"
    ]
  },
  {
    "job_id": "3905288339",
    "job_title": "Vice President of Human Resources (R1881)",
    "category": "HR",
    "job_description": "THE VICE PRESIDENT OF HUMAN RESOURCES BUSINESS PARTNERS FOR AGRISOMPO IS RESPONSIBLE FOR ALIGNING AGRISOMPO’S BUSINESS OBJECTIVES WITH ITS EMPLOYEES AND LEADERS TO ENABLE STRATEGY, SHAPE BEHAVIORS AND DRIVE RESULTS.  THE ROLE WILL LEAD, PARTNER, AND INFLUENCE THE BUSINESS WITH KEY HR DECISIONS AND ACTIONS AROUND ORGANIZATIONAL DESIGN, PERFORMANCE MANAGEMENT, TALENT ACQUISITION, EMPLOYEE RELATIONS, COMPENSATION, EMPLOYEE ENGAGEMENT AND DIVERSITY AND INCLUSION. MOST IMPORTANTLY, THE VP HRBP WILL MANAGE AND DEVELOP A HIGHLY DYNAMIC, BUSINESS FACING HR TEAM THROUGH OUR NEXT PHASE OF GROWTH AND CHANGE.  THIS ROLE WILL SUPPORT AGRISOMPO NORTH AMERICAN AND AGRISOMPO INTERNATIONAL WHICH CURRENTLY INCLUDES EMPLOYEES IN UNITED STATES, BERMUDA, ITALY AND BRAZIL. \nKEY MEMBER OF THE AGRISOMPO EXECUTIVE GROUP+ THAT WILL DEVELOP, LEAD AND DRIVE PEOPLE INITIATIVES (WORKING LEADER) INCLUDING:EXECUTION OF ALL ASPECTS OF HRBP’S WITHIN THE AGRISOMPO BU INCLUDING TALENT MANAGEMENT, PERFORMANCE MANAGEMENT, TALENT ACQUISITION, EMPLOYEE RELATIONS, COMPENSATION, EMPLOYEE ENGAGEMENT, ORGANIZATIONAL DEVELOPMENT AND DIVERSITY AND INCLUSION. MANAGING THE HEADCOUNT FOR IN LINE WITH THE STRATEGIC GROWTH PLANS. UTILIZING WORKDAY TO ITS FULL POTENTIAL FOR HR PROCESSES AND PROCEDURES. IDENTIFY STAFFING REQUIREMENTS AND SOURCING STRATEGIES NEEDED TO MEET THE GOALS AND OBJECTIVES OF THE BUSINESS. DRIVE SOURCING, RECRUITMENT, INTERVIEW, AND SELECTION PROCESSES IN COORDINATION AND COLLABORATION WITH OUR TALENT ACQUISITION TEAM. ENSURE DIVERSITY & INCLUSION INITIATIVES ARE SUPPORTED AND INTEGRATED INTO HR DELIVERABLES INCLUDING RECRUITING AND DEVELOPMENT. PROVIDE EMPLOYEE RELATIONS MANAGEMENT THAT CREATES A POSITIVE ORGANIZATIONAL CULTURE AND MINIMIZES RISK. INVESTIGATE AND RESOLVE EMPLOYEE COMPLAINTS, ISSUES AND CONCERNS REGARDING EMPLOYMENT PRACTICES. IMPLEMENT AND EXECUTE PERFORMANCE MANAGEMENT PROGRAMS AND PROCEDURES, INCLUDING BUT NOT LIMITED TO PERFORMANCE APPRAISALS AND PERFORMANCE IMPROVEMENT PLANS. PARTNER WITH THE BUSINESS AND THE COMPENSATION TEAM IN ANNUAL COMPENSATION PLANNING PROCESS. ASSIST IN THE ADMINISTRATION, MANAGEMENT, AND IMPLEMENTATION OF TARGETED TRAINING PROGRAMS (FACE-TO-FACE, OR COMPUTER-BASED TRAINING) AS REQUIRED AND IN COLLABORATION WITH OUR TALENT DEVELOPMENT TEAM.  MANAGEMENT AND DEVELOPMENT OF A TEAM OF HUMAN RESOURCE BUSINESS PARTNERS. CULTIVATE LEADERSHIP AND ETHICAL VALUES IN SELF AND OTHERS THROUGH MODELING AND COACHING.  AS A TRUSTED HR BUSINESS PARTNER, BUILD RELATIONSHIPS WITH CLIENTS AND INFLUENCE ACROSS THE ORGANIZATION. ENSURE COMPLIANCE WITH ALL APPLICABLE FEDERAL, STATE AND LOCAL LAWS AND REGULATIONS. ENSURE HIGH DEGREE OF DISCRETION AND CONFIDENTIALITY.  KEY SKILLS: CUSTOMER FOCUS – DRIVE FOR RESULTS THAT ARE ALIGNED WITH BUSINESS NEED. TEAM ORIENTED – PARTNERS AND COLLABORATES WELL WITH OTHERS ACROSS DIFFERENT TEAMS, GEOGRAPHIES AND CULTURES. MANAGING OTHERS – LEADS, DEVELOPS AND SUPPORTS OTHERS. CRITICAL THINKING – SOUND DECISION MAKING THAT IS DATA DRIVEN; EVALUATES AND WEIGHS MULTIPLE INPUTS AND IMPACTS OF ANY DECISION OR COURSE OF ACTION. COMMUNICATION - STRONG WRITTEN AND VERBAL COMMUNICATION SKILLS. PRIORITY SETTING / PROJECT MANAGEMENT - WELL ORGANIZED, WITH THE ABILITY TO THRIVE IN A FAST-PACED WORK ENVIRONMENT, POTENTIALLY MANAGING MULTIPLE PROJECTS OR INITIATIVES SIMULTANEOUSLY. \nPOSITION REQUIREMENTS15 + YEARS EXEMPT-LEVEL HUMAN RESOURCE EXPERIENCE 10+ YEARS MANAGEMENT EXPERIENCE EXPERIENCE WITH HRIS; WORKDAY PREFERRED STRONG EXCEL AND MICROSOFT OFFICE SKILLS REQUIRED EXCELLENT DATA MANAGEMENT AND ANALYTICAL SKILLS WITH STRONG ATTENTION TO DETAIL RECRUITING, EMPLOYEE RELATIONS, COMPENSATION PLANNING, AND PERFORMANCE MANAGEMENT EXPERIENCE REQUIRED STRONG PEOPLE MANAGEMENT SKILLS WITH THE ABILITY TO COMMUNICATE EFFECTIVELY AT ALL LEVELS OF THE ORGANIZATION ABILITY TO LEAD, MANAGE AND THRIVE THROUGH GROWTH AND CHANGE BACHELOR’S DEGREE REQUIRED - HUMAN RESOURCES MANAGEMENT, BUSINESS OR RELATED FIELD OR EQUIVALENT. \nAT SOMPO INTERNATIONAL, WE RECOGNIZE THAT THE TALENT, SKILLS, AND COMMITMENT OF OUR EMPLOYEES DRIVE OUR SUCCESS. THIS IS WHY WE OFFER COMPETITIVE, HIGH-QUALITY COMPENSATION AND BENEFIT PROGRAMS TO ELIGIBLE EMPLOYEES.\nOUR COMPENSATION PROGRAM IS BUILT ON A FOUNDATION THAT PROMOTES A PAY-FOR-PERFORMANCE CULTURE, RESULTING IN HIGHER INCENTIVE AWARDS, ON AVERAGE, WHEN THE COMPANY DOES WELL AND LOWER INCENTIVE AWARDS WHEN THE COMPANY UNDERPERFORMS. THE TOTAL COMPENSATION OPPORTUNITY FOR ALL REGULAR, FULL-TIME EMPLOYEES IS A COMBINATION OF BASE SALARY AND INCENTIVES THAT GETS ADJUSTED UPFRONT BASED ON OVERALL COMPANY PERFORMANCE WITH FINAL AWARDS BASED ON INDIVIDUAL PERFORMANCE. WE CONTINUOUSLY EVALUATE AND UPDATE OUR BENEFIT PROGRAMS TO ENSURE THAT OUR PLANS REMAIN COMPETITIVE AND MEET THE NEEDS OF OUR EMPLOYEES AND THEIR DEPENDENTS. BELOW IS A SUMMARY OF OUR CURRENT COMPREHENSIVE U.S. BENEFIT PROGRAMS:MEDICAL PLANS TO CHOOSE FROM, INCLUDING A TRADITIONAL PPO & A CONSUMER DRIVEN HEALTH PLAN WITH A HEALTH SAVINGS ACCOUNT PROVIDING A COMPETITIVE EMPLOYER CONTRIBUTION.BENEFITS WITH MAIL ORDER OPTIONS.BENEFITS INCLUDING ORTHODONTIA BENEFITS FOR ADULTS AND CHILDREN.BENEFITS.CARE & DEPENDENT CARE FLEXIBLE SPENDING ACCOUNTS.LIFE & AD&D BENEFITS, INCLUDING THE OPTION TO PURCHASE SUPPLEMENTAL LIFE COVERAGE FOR EMPLOYEE, SPOUSE & CHILDREN.DISABILITY BENEFITS WITH VERY COMPETITIVE SALARY CONTINUATION PAYMENTS.RETIREMENT SAVINGS PLAN WITH COMPETITIVE EMPLOYER CONTRIBUTIONS.PAID-TIME-OFF PROGRAMS, INCLUDING COMPANY-PAID HOLIDAYS.PARENTAL LEAVE BENEFITS & ADOPTION ASSISTANCE PROGRAMASSISTANCE PROGRAMCOMMUTER BENEFITREIMBURSEMENT & PROFESSIONAL QUALIFICATION BENEFITS.\nSOMPO INTERNATIONAL IS AN EQUAL-OPPORTUNITY EMPLOYER COMMITTED TO A DIVERSE WORKFORCE. M/F/D/V",
    "job_skill_set": [
      "Excel",
      "Microsoft Office",
      "Analytical Skills",
      "Recruiting",
      "Employee Relations",
      "Performance Management",
      "Organizational Development",
      "Leadership",
      "Communication",
      "Teamwork",
      "Critical Thinking",
      "Project Management",
      "Customer Focus",
      "Managing Others",
      "Change Management",
      "Relationship Building",
      "HRIS",
      "Workday",
      "Data Management",
      "Compensation Planning",
      "Diversity and Inclusion",
      "Coaching"
    ],
    "short_keywords": [
      "analytical",
      "and",
      "building",
      "change",
      "coaching",
      "communication",
      "compensation",
      "critical",
      "customer",
      "data",
      "development",
      "diversity",
      "employee",
      "excel",
      "focus",
      "hr",
      "hris",
      "human",
      "inclusion",
      "leadership",
      "management",
      "managing",
      "microsoft",
      "of",
      "office",
      "organizational",
      "others",
      "performance",
      "planning",
      "president",
      "project",
      "r1881",
      "recruiting",
      "relations",
      "relationship",
      "resources",
      "skills",
      "teamwork",
      "thinking",
      "vice",
      "workday"
    ]
  },
  {
    "job_id": "3905822969",
    "job_title": "Human Resources Specialist",
    "category": "HR",
    "job_description": "FLEXSTAFF IS HIRING A HUMAN RESOURCES SPECIALIST FOR OUR CLIENT IN EASTERN LONG ISLAND, A MEDICAL DEVICE MANUFACTURER. THIS IS A FULL TIME PERMANENT POSITION AND IS 100% ON-SITE.RESPONSIBILITIES:ASSISTS THE SR. HUMAN RESOURCES DIRECTOR IN CARRYING OUT VARIOUS HUMAN RESOURCES PROGRAMS AND PROCEDURES FOR ALL COMPANY EMPLOYEES. ASSISTS IN THE ADMINISTRATION OF THE COMPENSATION PROGRAM; SUPPORTS THE PERFORMANCE APPRAISAL PROCESS.MAINTAINS EEO APPLICANT FLOW LOGS AND OTHERS. RUNS REPORTS AND COMPLETES EEO-1 AND VETS-4212 ANNUALLY FOR MANAGEMENT REVIEW AND FILING.ASSISTS IN THE PREPARATION OF AFFIRMATIVE ACTION PLAN (AAP).CONDUCTS NEW-EMPLOYEE ORIENTATIONS; ADMINISTERS PRE-EMPLOYMENT TESTS; CONDUCTS REFERENCE CHECKS AND MAINTAINS APPLICANT AND CURRENT EMPLOYEE EEO RECORDS. MAINTAINS HUMAN RESOURCES INFORMATION SYSTEM (HRIS) RECORDS AND COMPILES REPORTS FROM THE DATABASE AS NEEDED. PREPARES AND DISCUSSES WITH SR. HUMAN RESOURCES DIRECTOR REPORTS SUCH AS: MONTHLY AND YTD HIRES, PROMOS, TERMS, OVERTIME, AND OTHERS. PROVIDES NEW AND INNOVATIVE IDEAS TO IMPROVE PROCESS.PARTICIPATES IN ADMINISTRATIVE STAFF MEETINGS AND ATTENDS OTHER MEETINGS AND SEMINARS. ASSISTS HR MANAGER WITH PROCESSING WEEKLY AND BI-WEEKLY PAYROLL.QUALIFICATIONS:A BACHELOR’S DEGREE IN HUMAN RESOURCES MANAGEMENT, BUSINESS ADMINISTRATION OR ORGANIZATIONAL DEVELOPMENT.THREE (3) TO FIVE (5) YEARS OF EXPERIENCE IN THE HR FIELD. HUMAN RESOURCE EXPERIENCE IN A MANUFACTURING ENVIRONMENT IS A PLUS.SHRM CERTIFIED PROFESSIONAL (SHRM-CP) OR SHRM SENIOR CERTIFIED PROFESSIONAL (SHRM-SCP) CREDENTIAL DESIRABLE. PROFICIENT IN USING HRIS DATABASES AND MICROSOFT SUITEEXCELLENT COMMUNICATION SKILLS IN BOTH VERBAL AND WRITINGCORE COMPETENCIES: COMMUNICATION, CRITICAL EVALUATION, DATA DRIVEN, HR EXPERTISE (COMPLIANCE AND TALENT MANAGEMENT), RELATIONSHIP MANAGEMENT AND ETHICAL PRACTICE.",
    "job_skill_set": [
      "HRIS",
      "Microsoft Suite",
      "Compensation Administration",
      "Performance Appraisal",
      "EEO Reporting",
      "Affirmative Action Plan (AAP)",
      "Pre-employment Testing",
      "Payroll Processing",
      "Data Analysis",
      "Communication",
      "Critical Evaluation",
      "Relationship Management",
      "Ethical Practice",
      "Innovative Thinking",
      "SHRM-CP or SHRM-SCP Certification"
    ],
    "short_keywords": [
      "aap",
      "action",
      "administration",
      "affirmative",
      "analysis",
      "appraisal",
      "certification",
      "communication",
      "compensation",
      "critical",
      "data",
      "eeo",
      "ethical",
      "evaluation",
      "hr",
      "hris",
      "human",
      "innovative",
      "management",
      "microsoft",
      "or",
      "payroll",
      "performance",
      "plan",
      "practice",
      "preemployment",
      "processing",
      "relationship",
      "reporting",
      "resources",
      "shrmcp",
      "shrmscp",
      "specialist",
      "suite",
      "testing",
      "thinking"
    ]
  },
  {
    "job_id": "3905297820",
    "job_title": "Director, Human Resources",
    "category": "HR",
    "job_description": "ABOUT THE ROLE\n\nJOIN A DYNAMIC HR FUNCTION DEDICATED TO FUELING THE SUCCESS OF OUR ORGANIZATION BY ENSURING OUR PEOPLE STRATEGY SUPPORTS OUR BUSINESS STRATEGY. AS A TARSUS HR BUSINESS PARTNER, YOU'LL DRIVE TALENT STRATEGIES WITHIN THE BUSINESS THAT PROPEL OUR MISSION TO FOCUS ON UNMET NEEDS BY APPLYING PROVEN SCIENCE AND NEW TECHNOLOGY TO REVOLUTIONIZE TREATMENT FOR PATIENTS, STARTING WITH EYE CARE.\n\nLET’S TALK ABOUT SOME OF THE KEY RESPONSIBILITIES OF THE ROLE:\n\nSTRATEGIC BUSINESS PARTNERSHIP\n\nBE A CONSULTATIVE PARTNER AND TRUSTED ADVISOR, WORKING WITH BUSINESS LEADERS ACROSS MULTIPLE FUNCTIONS TO SUPPORT STRATEGIC BUSINESS OBJECTIVES AND ADVISE AND INFLUENCE ON ISSUES INCLUDING TALENT ACQUISITION, COMPENSATION, BENEFITS, ORGANIZATION DESIGN, WORKFORCE PLANNING, ONBOARDING, ENGAGEMENT, EMPLOYEE RELATIONS, PERFORMANCE MANAGEMENT, REGULATORY COMPLIANCE, TALENT DEVELOPMENT, ORGANIZATIONAL EFFECTIVENESS, CHANGE MANAGEMENT, AND OTHER SPECIAL PROJECTS. INCORPORATE BUSINESS PRIORITIES INTO THE HR PLAN TO ENSURE ALIGNMENT WITH CULTURE AND OVERALL BUSINESS OBJECTIVES. MANAGE THROUGH INFLUENCE AND HELP DRIVE ACCOUNTABILITY THROUGHOUT THE ORGANIZATION. MANAGE EMPLOYEE RELATIONS TO ENHANCE WORKFORCE PERFORMANCE AND ENGAGEMENT, AND CONDUCT INVESTIGATIONS AS NEEDED. RECOMMEND AND IMPLEMENT STRATEGIES TO DRIVE ORGANIZATION PERFORMANCE. PULL THROUGH, COMMUNICATION AND DELIVERY OF TALENT DEVELOPMENT AND ENGAGEMENT PROGRAMS TO ENSURE AN EFFECTIVE EMPLOYEE EXPERIENCE, DEVELOPMENT OF OUR PEOPLE, AND SUCCESS OF OUR BUSINESS GOALS. PROVIDE LEADERSHIP IN DRIVING OUR CULTURE AND EMPLOYEE ENGAGEMENT BY DEVELOPING ENGAGEMENT STRATEGIES, DRIVING, AND FOSTERING THE EMPLOYEE VALUE PROPOSITION, PARTNERING WITH LEADERS TO DELIVER TIMELY AND EFFECTIVE COMMUNICATIONS, AND INFLUENCING OPERATING MECHANISMS TO ENSURE ALIGNMENT WITH STRATEGIC GROWTH PLANS. DELIVER PRESENTATIONS AND TRAININGS TO LEADERSHIP AND EMPLOYEES TO COMMUNICATE PEOPLE STRATEGY AND PROGRAMS, AND PROVIDE PEOPLE AND LEADERSHIP DEVELOPMENT. \n\nHR PROJECTS\n\nAPPLY SOUND PROJECT MANAGEMENT, PROBLEM SOLVING AND PROCESS IMPROVEMENT TOOLS OR METHODOLOGIES TO BUILD AND EXECUTE STRATEGIC AND TACTICAL PLANS ACROSS A VARIETY OF HR PROGRAMS, PROCESSES AND SYSTEMS. IDENTIFY, TRACK AND REPORT KEY METRICS AND PERFORMANCE INDICATORS ON HR STRATEGY RELATED AREAS TO ENSURE PROGRESS AND GROWTH AGAINST GOALS AND PLAN. ORGANIZE, LEAD, AND COORDINATE PROJECTS AND CHANGE MANAGEMENT, WHILE WORKING WITH COLLEAGUES AND/OR EXTERNAL CONSULTANTS REGARDING PROJECT DELIVERABLES, ROLES, RESOURCE REQUIREMENTS, TIMELINES AND COSTS. SERVE AS A SUBJECT MATTER EXPERT ON EMPLOYMENT-RELATED POLICY AND PROVIDE COACHING, COUNSELLING, AND ADVICE TO GUIDE LEADERS AND HR TEAM MEMBERS WITH REGARDS TO HR PROGRAMS, PRACTICES, POLICIES, LEGISLATION, INVESTIGATIONS AND REGULATORY REQUIREMENTS. DEVELOP, COMMUNICATE, AND IMPLEMENT INITIATIVES AND PROGRAMS THAT SUPPORT ORGANIZATIONAL GROWTH, DRIVE CHANGE MANAGEMENT AND MAXIMIZE EMPLOYEE ENGAGEMENT. MAY PERFORM OTHER RELATED DUTIES AS REQUIRED AND/OR ASSIGNED. \n\nFACTORS FOR SUCCESS:\n\nBACHELOR’S DEGREE IN HUMAN RESOURCES, BUSINESS ADMINISTRATION, INDUSTRIAL/ORGANIZATIONAL PSYCHOLOGY OR OTHER RELATED DISCIPLINE OR EQUIVALENT KNOWLEDGE AND EXPERIENCE REQUIRED. MASTER’S DEGREE IS A PLUS. MINIMUM 12 YEARS OF RELEVANT HUMAN RESOURCES EXPERIENCE, INCLUDING PROVEN SUCCESS AND AT LEAST 5 YEARS AS A BUSINESS PARTNER, MANAGING EMPLOYEE RELATIONS ISSUES, AND KNOWLEDGE OF SOUND TECHNIQUES IN ALL ASPECTS OF HUMAN RESOURCE MANAGEMENT. PREVIOUS PHARMACEUTICAL/BIOTECH EXPERIENCE IS HIGHLY DESIRED. POSSESS A LEARNING ORIENTATION AND THE ABILITY TO WORK IN A FAST-PACED AND AMBIGUOUS ENVIRONMENT. CAPABILITY TO BE BOTH STRATEGIC AND TACTICAL WITH THE PROVEN EXPERTISE TO THINK, CREATE AND EXECUTE PLANS STRATEGICALLY BEYOND JUST THE TACTICAL EXECUTION. EXPERIENCE IN EVALUATING AND IMPLEMENTING TOOLS, PROCESS, TECHNOLOGY, AND INFRASTRUCTURE REQUIRED TO ATTRACT, RETAIN, DEVELOP TALENT AND GROW THE ORGANIZATION. SUPERIOR WRITTEN AND VERBAL COMMUNICATION SKILLS THAT CAN EFFECTIVELY ADDRESS ALL LEVELS WITHIN THE ORGANIZATION. MUST BE A SKILLED PRESENTER CAPABLE OF CREATING BUSINESS CASE INFORMATION AND INFLUENCING CHANGE ACROSS THE ORGANIZATION. ABILITY TO READ, ANALYZE, AND INTERPRET COMPLEX LEGAL, REGULATORY, DIVERSITY AND HUMAN RESOURCES RELATED DOCUMENTS. SOUND PROJECT MANAGEMENT SKILLS, WITH THE ABILITY TO EFFECTIVELY PLAN, SET PRIORITIES, AND MANAGE SEVERAL COMPLEX PROJECTS SIMULTANEOUSLY WHILE WORKING UNDER PRESSURE TO MEET DEADLINES. ADVANCED COACHING/CONSULTING, CONFLICT RESOLUTION AND FACILITATION SKILLS. INNOVATIVE MINDSET, WITH AN ABILITY TO DEVELOP AND IMPLEMENT INNOVATIVE AND CREATIVE SOLUTIONS TO BOTH HR PROGRAMS AND BUSINESS PROBLEMS THAT DRIVE AN OPTIMAL EMPLOYEE EXPERIENCE. ABILITY TO IMPLEMENT AND USE TECHNOLOGY, TOOLS, AND PROCESSES TO STAY HIGHLY ORGANIZED AND EFFICIENT. MUST BE SELF-MOTIVATED, HIGHLY DETAILED AND ORGANIZED, ABLE TO TAKE INITIATIVE TO MAKE OR ADAPT TO CHANGES. STRONG COMPUTER AND SYSTEMS KNOWLEDGE, INCLUDING WORD, EXCEL, POWERPOINT, OUTLOOK, AND EXPERIENCE WITH HRIS AND OTHER HR SYSTEMS. \n\nA FEW OTHER DETAILS WORTH MENTIONING:\n\nTHE POSITION WILL BE BASED IN OUR BEAUTIFUL IRVINE OFFICE, COMPLETE WITH A COURTYARD, SNACKS, DRINKS, AND OCCASIONAL CATERED MEALS. WE PROVIDE A HYBRID WORK ENVIRONMENT. WE ARE PASSIONATE ABOUT OUR CULTURE! OUR TARSANS LIVE OUR VALUES OF COMMITMENT TO PATIENTS, EMPOWERMENT TO CHAMPION INNOVATION, AND TEAMWORK TO AMPLIFY IMPACT!THIS POSITION REPORTS DIRECTLY TO OUR SR DIRECTOR, HRSOME TRAVEL MAY BE REQUIRED – UP TO 20%\n\nAT TARSUS, WE UNDERSTAND THE IMPORTANCE OF ATTRACTING AND RETAINING TOP TALENT. THE EXPECTED BASE PAY RANGE FOR THIS POSITION IS $174,000 - $243,600 PLUS BONUS, STOCK EQUITY, AND COMPREHENSIVE BENEFITS. THE BASE PAY RANGE REFLECTS THE TARGET RANGE FOR THIS POSITION, BUT INDIVIDUAL PAY WILL BE DETERMINED BY ADDITIONAL FACTORS SUCH AS JOB-RELATED SKILLS, EXPERIENCE AND RELEVANT EDUCATION OR TRAINING. OUR BENEFITS INCLUDE HEALTH, DENTAL AND VISION INSURANCE BENEFITS TO ENSURE YOUR WELL-BEING. WE BELIEVE IN WORK-LIFE BALANCE AND OFFER GENEROUS PAID TIME OFF, INCLUDING VACATION, HOLIDAYS, AND PERSONAL DAYS. FOR MORE DETAILS REGARDING TARSUS BENEFITS, PLEASE VISIT: HTTPS://ALLIANTBENEFITS.CLD.BZ/TARSUS2024BENSNAPSHOT.\n\nTARSUS PHARMACEUTICALS, INC. IS AN EQUAL OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX INCLUDING SEXUAL ORIENTATION AND GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, PROTECTED VETERAN STATUS, OR ANY OTHER CHARACTERISTIC PROTECTED BY APPLICABLE FEDERAL, STATE, OR LOCAL LAW.\n\n",
    "job_skill_set": [
      "Human Resources Management",
      "Project Management",
      "Talent Acquisition",
      "Employee Relations",
      "Data Analysis",
      "Regulatory Compliance",
      "Performance Management",
      "Process Improvement",
      "Coaching and Consulting",
      "Presentation Skills",
      "Microsoft Office Suite",
      "Diversity and Inclusion",
      "Talent Development",
      "Strategic Planning",
      "Problem Solving",
      "Communication Skills",
      "Change Management",
      "HRIS Systems",
      "Compensation and Benefits",
      "Organizational Design",
      "Leadership",
      "Influencing",
      "Teamwork",
      "Adaptability",
      "Initiative",
      "Detail-oriented",
      "Self-motivation",
      "Conflict Resolution",
      "Creativity",
      "Consultative Partnering",
      "Engagement Strategies",
      "Organizational Effectiveness",
      "Communication",
      "Analytical Thinking",
      "Interpersonal Skills"
    ],
    "short_keywords": [
      "acquisition",
      "adaptability",
      "analysis",
      "analytical",
      "and",
      "benefits",
      "change",
      "coaching",
      "communication",
      "compensation",
      "compliance",
      "conflict",
      "consultative",
      "consulting",
      "creativity",
      "data",
      "design",
      "detailoriented",
      "development",
      "director",
      "diversity",
      "effectiveness",
      "employee",
      "engagement",
      "hr",
      "hris",
      "human",
      "improvement",
      "inclusion",
      "influencing",
      "initiative",
      "interpersonal",
      "leadership",
      "management",
      "microsoft",
      "office",
      "organizational",
      "partnering",
      "performance",
      "planning",
      "presentation",
      "problem",
      "process",
      "project",
      "regulatory",
      "relations",
      "resolution",
      "resources",
      "selfmotivation",
      "skills",
      "solving",
      "strategic",
      "strategies",
      "suite",
      "systems",
      "talent",
      "teamwork",
      "thinking"
    ]
  },
  {
    "job_id": "3903477580",
    "job_title": "Human Resources Director",
    "category": "HR",
    "job_description": "TALENT RECRUITING PARTNERS IS SEEKING A SKILLED DIRECTOR OF HUMAN RESOURCES / OPERATIONS LEADER TO OVERSEE ALL EMPLOYEE RELATIONS AS THE LIAISON BETWEEN OUR CLIENT’S CORPORATE OFFICE AND THIS LOCATION IN BLOUNT COUNTY. THIS IS THE GO TO PERSON FOR AROUND 70 - 100 EMPLOYEES FOR ANYTHING RELATED TO EMPLOYEE RELATIONS AND EMPLOYEE RETENTION. THIS IS AN AMAZING OPPORTUNITY TO MAKE A DIFFERENCE WITHIN A NONPROFIT SETTING. AND, FOR SOMEONE THAT WOULD ENJOY BEING EMPOWERED TO MAKE DECISIONS TO IMPROVE THE OVERALL EMPLOYEE EXPERIENCE!\nRESPONSIBILITIES WOULD INCLUDE BUT NOT LIMITED TO:DEVELOP AND IMPLEMENT HR STRATEGIES AND INITIATIVES ALIGNED WITH THE OVERALL BUSINESS STRATEGYMAINTAINING POSITIVE RELATIONSHIPS BETWEEN EMPLOYEES AND THE ORGANIZATION; BRIDGE MANAGEMENT AND EMPLOYEE RELATIONS BY ADDRESSING DEMANDS, GRIEVANCES, OR OTHER ISSUESHANDLING VARIOUS EMPLOYEE-RELATED TASKS SUCH AS COUNSELING, DISPUTES AND ENSURING COMPLIANCE WITH EMPLOYMENT LAWS.WILL LIKELY CONDUCT EMPLOYEE DISPUTE INVESTIGATIONS TO UNDERSTAND THE SITUATION FULLY, GATHER INFORMATION FROM ALL PARTIES INVOLVED, AND REVIEW RELEVANT POLICIES AND PROCEDURES. ONCE THE CAUSE OF THE CONFLICT HAS BEEN IDENTIFIED, CAN THEN DEVELOP AN ACTION PLAN TO RESOLVE THE ISSUE. WILL TAKE CARE OF ANYTHING THAT FALLS WITHIN THE SCOPE OF WHAT THIS NEW HIRE CAN HANDLE WITHOUT ESCALATION. WHEN ESCALATION IS NECESSARY WILL NEED TO BE ABLE TO IDENTIFY THAT AS WELL AND COMPLETE A THOROUGH REPORT TO PROVIDE TO THE CFO TO RESOLVE. THE CFO IS SEEKING A NEW HIRE FOR THIS LOCATION TO ASSIST WITH ANYTHING NEEDED TO BE IMPLEMENTED FROM C SUITE AT CORPORATE TO THE LOCAL EMPLOYEES OF BLOUNT COUNTY WILL ALSO WORK TO IMPROVE EMPLOYEE RETENTION. SUPPORT CURRENT AND FUTURE BUSINESS NEEDS THROUGH THE DEVELOPMENT, ENGAGEMENT, MOTIVATION, AND PRESERVATION OF HUMAN CAPITAL ASSESS TRAINING NEEDS TO APPLY AND MONITOR TRAINING PROGRAMS AS WELL AS WEEKLY ORIENTATIONS\nEXPERIENCE REQUIRED:MUST HAVE BACHELOR’S DEGREE AND BE A GO TO PERSON FOR PROBLEM SOLVING AND EMPLOYEE RELATIONS/ SOLUTIONS.MUST HAVE KNOWLEDGE AND EXPERIENCE EMPLOYMENT LABOR LAW, HR SOURCING, INTERVIEWING, TRAINING DEVELOPMENT, SUPERVISING, HUMAN CAPITAL MANAGEMENT, PROCESS IMPROVEMENT, WORKERS COMPENSATION( WOULD NEED TO POSSESS SKILLSET TO KNOW WHEN TO ESCALATE TO CORPORATE OR WHEN CAN HANDLE WITHIN BLOUNT COUNTY LOCATION).SEEKING A HUMAN RESOURCES PROFESSIONAL WITH A SERVANT’S HEART; HEALTHCARE OR SOME ADULT CARE INDUSTRY EXPERIENCE WOULD BE PREFERRED.\nFOR MORE INFORMATION PLEASE REACH OUT TO CONTACT@TALENTRP.COM OR 205-484-9467 TO SPEAK TO A TRP CAREER MATCHMAKER TODAY!",
    "job_skill_set": [
      "employee relations",
      "HR strategies",
      "employment law",
      "HR sourcing",
      "interviewing",
      "training development",
      "human capital management",
      "process improvement",
      "workers compensation",
      "dispute investigation",
      "problem solving",
      "communication",
      "decision making",
      "relationship building",
      "conflict resolution",
      "empathy",
      "motivation",
      "engagement"
    ],
    "short_keywords": [
      "building",
      "capital",
      "communication",
      "compensation",
      "conflict",
      "decision",
      "development",
      "director",
      "dispute",
      "empathy",
      "employee",
      "employment",
      "engagement",
      "hr",
      "human",
      "improvement",
      "interviewing",
      "investigation",
      "law",
      "making",
      "management",
      "motivation",
      "problem",
      "process",
      "relations",
      "relationship",
      "resolution",
      "resources",
      "solving",
      "sourcing",
      "strategies",
      "training",
      "workers"
    ]
  },
  {
    "job_id": "3906230219",
    "job_title": "Human Resources Coordinator",
    "category": "HR",
    "job_description": "KEY STAFFING IS SEEKING A HUMAN RESOURCES COORDINATOR FOR OUR CLIENT IN THE MEDICAL INDUSTRY, THIS POSITION IS LOCATED IN BAKERSFIELD, CA.\nHUMAN RESOURCES COORDINATOR:\nIMPLEMENTING THE ORGANIZATION’S RECRUITING STRATEGYINTERVIEWING APPLICANTSADMINISTERING PRE-EMPLOYMENT TESTSASSISTING WITH COMPLETING BACKGROUND INVESTIGATIONSPROCESSING TRANSFERS, PROMOTIONS, AND TERMINATIONSPREPARING OR UPDATING EMPLOYMENT RECORDS RELATED TO HIRING, TRANSFERRING, PROMOTING, AND TERMINATINGEXPLAINING HUMAN RESOURCES POLICIES, PROCEDURES, LAWS, AND STANDARDS TO NEW AND EXISTING EMPLOYEESENSURING NEW HIRE PAPERWORK IS COMPLETED AND PROCESSEDINFORMING JOB APPLICANTS OF JOB DUTIES, RESPONSIBILITIES, BENEFITS, SCHEDULES, WORKING CONDITIONS, PROMOTION OPPORTUNITIES, ETC.ADDRESSING ANY EMPLOYMENT RELATIONS ISSUES, SUCH AS WORK COMPLAINTS AND HARASSMENT ALLEGATIONS.PROCESSING ALL PERSONNEL ACTION FORMS AND ENSURING PROPER APPROVALOVERSEEING HIRING PROCESS, WHICH INCLUDES COORDINATING JOB POSTS, REVIEWING RESUMES, AND PERFORMING REFERENCE CHECKSANALYZING JOB DUTIESDRAFTING JOB DESCRIPTIONSASSISTING WITH PROCESSING EMPLOYEE GRIEVANCESOVERSEEING ENGAGEMENT PROGRAMS AND OTHER EMPLOYEE RELATIONS WORK\nPAYROLL DUTIESPERFORM TASKS TO ESTABLISH AND MAINTAIN EMPLOYEE PAYROLL RECORDSINPUT, REVIEW, AND AUDIT TIMEKEEPING AND OTHER PAYROLL-RELATED RECORDSMAINTAIN TIME AND ATTENDANCE RECORDSENTER NEW HIRES INTO THE PAYROLL SYSTEMPOST CHANGES IN PAY, TAX STATUS, AND OTHER MISCELLANEOUS CATEGORIESCOMPUTE WAGE, OVERTIME, AND OTHER TYPES OF PAYCALCULATE AND RECORD PAYROLL DEDUCTIONS (VOLUNTARY AND INVOLUNTARY)PROCESS ADVANCE, TERMINATION, AND OTHER OUT-OF-CYCLE PAYMENTSRECONCILE EARNINGS AND DEDUCTION TOTALSREVIEW OUTPUT REGISTERS AND MAKE NEEDED CORRECTIONSPREPARE AND FILE TAX REPORTSCOMPILE PAYROLL DATA FOR MANAGEMENT, AUDITORS, AND OTHERSSERVE AS BACKUP TO OTHER PAYROLL SPECIALISTSASSURE THAT ALL EMPLOYEES RECEIVE TIMELY RESPONSES TO INQUIRIES, QUESTIONS, ETC.INDEPENDENTLY COORDINATE AND COMMUNICATE WITH ALL INTERNAL GROUPS, HIRING MANAGERS, AND EXTERNAL PARTIES (AS REQUIRED).ADDRESS AND RESOLVE PROBLEMS IN A TIMELY MANNERTAKE INITIATIVE; DEMONSTRATE STRONG DECISION-MAKING AND ORGANIZATIONAL SKILLSINITIATE BEST PRACTICES; DEVELOP EFFICIENCY IMPROVEMENTSPARTICIPATE IN SPECIAL PROJECTS AND OTHER DUTIES AS ASSIGNEDDEMONSTRATED PROFICIENCY IN PAYROLL AND HRIS SOFTWARE, MICROSOFT OFFICE SUITE, AND OTHER DATABASESEXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLSSTRONG ANALYTICAL, HIGH ATTENTION TO DETAIL, EXCELLENT TROUBLESHOOTING SKILLS, AND CREATIVE PROBLEM-SOLVING SKILLSABILITY TO BE SELF-MOTIVATED AND SELF-DIRECTED AND THINK AND ACT INDEPENDENTLY WHILE ALSO BEING TEAM-ORIENTEDGOOD FOLLOW-UP SKILLS: THE ABILITY TO UNDERSTAND; ADAPTABILITY TO PROCESS CHANGES; AND A STRONG SENSE OF IMPORTANCE AND OWNERSHIP\nMINIMUM QUALIFICATIONS:AT LEAST 4 YEARS’ EXPERIENCE IN HR AND/OR PAYROLL REQUIREDASSOCIATE DEGREE IN HUMAN RESOURCES OR RELATED FIELD OR EQUIVALENT COMBINATION OF EDUCATION AND EXPERIENCE.EXPOSURE TO PAYROLL PRACTICESBILINGUAL (ENGLISH AND SPANISH) PREFERREDHIGHLY COMPUTER LITERATE WITH CAPABILITY IN EMAIL, MS OFFICE, AND RELATED BUSINESS AND COMMUNICATION TOOLSFANTASTIC ORGANIZATIONAL AND TIME MANAGEMENT SKILLSABILITY TO FUNCTION WELL IN A HIGH-PACED ENVIRONMENTPROFICIENT WITH MICROSOFT OFFICE SUITE OR RELATED SOFTWARE\nWE ARE AN EQUAL EMPLOYMENT OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, NATIONAL ORIGIN, DISABILITY STATUS, PROTECTED VETERAN STATUS, OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW. WE PARTICIPATE IN E-VERIFY.",
    "job_skill_set": [
      "Microsoft Office Suite",
      "data analysis",
      "background investigation",
      "employee relations",
      "bilingual (English and Spanish)",
      "communication",
      "organizational skills",
      "problem-solving",
      "decision-making",
      "teamwork",
      "adaptability",
      "attention to detail",
      "initiative",
      "follow-up skills",
      "HRIS software",
      "payroll processing",
      "recruiting strategy",
      "timekeeping systems",
      "self-motivation"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "and",
      "attention",
      "background",
      "bilingual",
      "communication",
      "coordinator",
      "data",
      "decisionmaking",
      "detail",
      "employee",
      "english",
      "followup",
      "hr",
      "hris",
      "human",
      "initiative",
      "investigation",
      "microsoft",
      "office",
      "organizational",
      "payroll",
      "problemsolving",
      "processing",
      "recruiting",
      "relations",
      "resources",
      "selfmotivation",
      "skills",
      "software",
      "spanish",
      "strategy",
      "suite",
      "systems",
      "teamwork",
      "timekeeping",
      "to"
    ]
  },
  {
    "job_id": "3905264431",
    "job_title": "Human Resources & Administrative Associate",
    "category": "HR",
    "job_description": "JOB DESCRIPTIONHR & ADMIN ASSOCIATES FOR AN INTERNATIONAL LUXURY REAL ESTATE DEVELOPER BASED IN NYCLOCAL RECRUITING PROCESS AND IN-HOUSE RECRUITMENT EVENTS.LOCAL BENEFIT PROGRAM, TRAINING PROGRAM, ETC.COMPANY EMPLOYEE EVENTS.OFFICE AND ADMINISTRATIVE FUNCTIONS ENSURING SMOOTH DAILY OPERATION. COORDINATE WITH OFFICE BUILDING MANAGER, INSURANCE BROKER AND OTHER RELATED OFFICE SUPPORTER PROVIDER.THE MANAGEMENT OF COMPANY OFFICE BUDGET, AND CASH FLOW PROJECTION.IN ENSURING ALL POLICIES AND PROCEDURE COMPLIANCE WITH LEGAL AND REGULATORY REQUIREMENTS.PROJECT OFFICE MANAGEMENT.STANDARD MANAGEMENT REPORT AS REQUIRED.ALL VISITORS PROVIDING COURTEOUS SERVICE.TELEPHONES AND PROVIDE APPROPRIATE INFORMATION OR TRANSFER INCOMING CALLS TO APPROPRIATE PERSON.AND DISTRIBUTE INCOMING AND OUTGOING MAIL. MANAGE FEDEX ACCOUNT AND BILLS.IN MEETING ARRANGEMENT.CLERICAL TASKS AS ASSIGNED.WITH OFFICE BUILDING MANAGEMENT OFFICE, OFFICE SUPPLY PROVIDER AND OTHER RELATED OFFICE SUPPORTER PROVIDER.ADEQUATE LEVEL OF OFFICE SUPPLIES AND ORDER REPLENISHMENTS AS NECESSARY.INTERNATIONAL AND LOCAL TRAVEL PLANS.IN PLANNING EVENTS AND MAJOR FUNCTIONS.TASKS AS ASSIGNED.\nJOB REQUIREMENTSDEGREE.1 YEAR OF RELATED EXPERIENCE.TIME MANAGEMENT AND MULTI-TASK SKILL.COMMUNICATION.INTERPERSONAL AND COMMUNICATION SKILLS.KNOWLEDGE OF MS OFFICE.",
    "job_skill_set": [
      "local recruiting",
      "office management",
      "MS Office",
      "clerical tasks",
      "time management",
      "multi-tasking",
      "communication",
      "interpersonal skills",
      "customer service",
      "budget management",
      "cash flow projection",
      "compliance",
      "event planning",
      "travel planning"
    ],
    "short_keywords": [
      "administrative",
      "associate",
      "budget",
      "cash",
      "clerical",
      "communication",
      "compliance",
      "customer",
      "event",
      "flow",
      "hr",
      "human",
      "interpersonal",
      "local",
      "management",
      "ms",
      "multitasking",
      "office",
      "planning",
      "projection",
      "recruiting",
      "resources",
      "service",
      "skills",
      "tasks",
      "time",
      "travel"
    ]
  },
  {
    "job_id": "3904364112",
    "job_title": "Human Resources Generalist",
    "category": "HR",
    "job_description": "THE QTI GROUP IS PARTNERING WITH A COTTAGE GROVE-BASED CLIENT WITH AN IMMEDIATE NEED FOR AN HR GENERALIST. THIS CONTRACT ROLE WILL BE RESPONSIBLE FOR MANAGING THE DAY-TO-DAY HR FUNCTIONS AND ASSISTING WITH YEARLY WAGE REVIEWS, ESOP DISTRIBUTION, AND OTHER HR RELATED PROJECTS. THIS IS A HYBRID OPPORTUNITY THAT WILL REQUIRE FREQUENT TRAVEL TO THE COMPANY’S OFFICES LOCATED IN COTTAGE GROVE. \nRESPONSIBILITIES: MANAGE DAY-TO-DAY HR FUNCTIONSSUPPORT VARIOUS PROJECTS INCLUDING ANNUAL WAGE REVIEW AND ESOP DISTRIBUTIONSERVE AS RESOURCE TO MANAGERS TO ASSIST IN MANAGING EMPLOYEE RELATIONS AND FEEDBACKMAINTAIN VISIBILITY AMONG STAFF AND BUILD RELATIONSHIPS TO FOSTER EMPLOYEE CONFIDENCE AND TRUST IN HRDEMONSTRATE KNOWLEDGE OF TRENDS, BEST PRACTICES, REGULATORY CHANGES, AND NEW TECHNOLOGIES IN HUMAN RESOURCES, TALENT MANAGEMENT, AND EMPLOYMENT LAW\nQUALIFICATIONS: BACHELOR'S DEGREE IN HUMAN RESOURCES OR RELATED FIELD REQUIRED3+ YEARS OF PRIOR HR EXPERIENCE, PREFERABLY IN A NON-UNION ENVIRONMENT PRIOR EXPERIENCE IN EMPLOYEE RELATIONS AND EXPERIENCE GUIDING MANAGERSPROFICIENCY WITH OR THE ABILITY TO QUICKLY LEARN HRIS AND TALENT MANAGEMENT SYSTEMS (EXPERIENCE WITH PAYLOCITY IS A PLUS!); PROFICIENCY IN MICROSOFT OFFICE AND EXCEL REQUIRED.",
    "job_skill_set": [
      "Talent Management Systems",
      "Microsoft Office",
      "Excel",
      "Employee Relations",
      "Communication",
      "Relationship Building",
      "Problem Solving",
      "Adaptability",
      "Teamwork",
      "HRIS",
      "Wage Review",
      "ESOP Distribution",
      "Regulatory Knowledge",
      "Trust Building"
    ],
    "short_keywords": [
      "adaptability",
      "building",
      "communication",
      "distribution",
      "employee",
      "esop",
      "excel",
      "generalist",
      "hr",
      "hris",
      "human",
      "knowledge",
      "management",
      "microsoft",
      "office",
      "problem",
      "regulatory",
      "relations",
      "relationship",
      "resources",
      "review",
      "solving",
      "systems",
      "talent",
      "teamwork",
      "trust",
      "wage"
    ]
  },
  {
    "job_id": "3901635707",
    "job_title": "Human Resources Manager",
    "category": "HR",
    "job_description": "FAMILY OWNED AND OPERATED BOSTON AREA AUTOMOTIVE GROUP IS IN SEARCH OF A HUMAN RESOURCES MANAGER WITH PREVIOUS AUTOMOTIVE HUMAN RESOURCES EXPERIENCE PREFERRED.OUR DEALERSHIPS INCLUDE LEXUS OF WATERTOWN, TOYOTA OF WATERTOWN IN WATERTOWN, MAAND MINUTEMAN VOLKSWAGEN IN BEDFORD, MA.RESPONSIBILITIES (INCLUDE BUT NOT LIMITED TO):RESPONSIBLE FOR DAY-TO-DAY EMPLOYMENT ISSUES OR EMPLOYEE CONCERNS FOR OUR ORGANIZATION.RESPONSIBLE FOR RECRUITING AND ON BOARDING.PROVIDE GUIDANCE TO NEW ASSOCIATES IN THE COMPLETION OF ALL REQUIRED FORMS AND PAPERWORK.ASSIST NEW ASSOCIATES BY EXPLAINING AVAILABLE BENEFITS.WORKS WITH 3RD PARTY VENDOR AND RESPONDS TO UNEMPLOYMENT REQUESTS.MAINTAIN AND KEEP UPDATED ASSOCIATE FILES FOR EASY REFERENCE.ADMINISTERS ALL BENEFITS PLANS.MAINTAIN HUMAN RESOURCES INFORMATION SYSTEM (HRIS) RECORDS IN OUR SYSTEM.RESPONSIBLE FOR COMPLIANCE WITH ALL FEDERAL AND STATE LEGISLATION PERTAINING TO HUMAN RESOURCE MATTERS (EEO, ADA, FMLA, ETC.).MANAGES WORKERS COMP CLAIMS AND REPORTS AND MAINTAINS OSHA 300 LOGS AND INVESTIGATION REPORTS.CONDUCTS INTERNAL INVESTIGATIONS AND PROVIDES COUNSEL TO MANAGERS AND SUPERVISORS AND POLICY AND DISCIPLINARY MATTERS TO INSURE FAIR AND CONSISTENT APPLICATION.ASSIST IN COMPLIANCE WITH ACA.MAINTAIN SEPARATE FILE FOR EACH ASSOCIATE CONTAINING ANY MEDICAL, INJURY, OR WORKMAN'S COMPENSATION DETAILS.POSITION REQUIREMENTS:3+ YEARS' EXPERIENCE IN HUMAN RESOURCES IN A SUPERVISORY/MANAGEMENT ROLE.ABILITY TO MAINTAIN A HIGH LEVEL OF CONFIDENTIALITY.EXCELLENT PEOPLE AND LEADERSHIP SKILLS.ABILITY TO MULTI-TASK.EXTENSIVE KNOWLEDGE OF EMPLOYEE BENEFITS AND APPLICABLE LAWS.EXTENSIVE KNOWLEDGE OF THE LEAVE REQUIREMENTS AND OTHER LEGAL PROTECTIONS AFFORDED BY THE FMLA, ADA, AND OTHER APPLICABLE LAWS.EXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLS.EXCELLENT ORGANIZATIONAL AND TIME MANAGEMENT SKILLS.PROFICIENT WITH MICROSOFT OFFICE SUITE OR SIMILAR SOFTWARE.EXCELLENT WORK HISTORY WITH PROVEN TRACK RECORD OF CAREER GROWTH.\n",
    "job_skill_set": [
      "Human Resources Management",
      "Recruiting",
      "Onboarding",
      "HRIS Management",
      "Employee Benefits Administration",
      "Compliance Knowledge (EEO, ADA, FMLA)",
      "Workers Compensation Management",
      "Internal Investigations",
      "Microsoft Office Suite",
      "Time Management",
      "Confidentiality",
      "Leadership",
      "Multi-tasking",
      "Communication",
      "Organizational Skills",
      "Problem Solving"
    ],
    "short_keywords": [
      "ada",
      "administration",
      "benefits",
      "communication",
      "compensation",
      "compliance",
      "confidentiality",
      "eeo",
      "employee",
      "fmla",
      "hr",
      "hris",
      "human",
      "internal",
      "investigations",
      "knowledge",
      "leadership",
      "management",
      "manager",
      "microsoft",
      "multitasking",
      "office",
      "onboarding",
      "organizational",
      "problem",
      "recruiting",
      "resources",
      "skills",
      "solving",
      "suite",
      "time",
      "workers"
    ]
  },
  {
    "job_id": "3899539354",
    "job_title": "Senior Vice President Human Resources",
    "category": "HR",
    "job_description": "OUR CLIENT, A LEADER IN FOOD SERVICE, IS SEEKING IS SEEKING A SENIOR VICE PRESIDENT, HUMAN RESOURCES (SVP, HR) TO SERVE AS A MEMBER OF THEIR EXECUTIVE MANAGEMENT TEAM.\nAS THE SVP, HR YOU WILL BE RESPONSIBLE FOR STRATEGIC DIRECTION OF THE ORGANIZATION, SPECIFICALLY IN THE AREAS OF SUCCESSION PLANNING, TALENT MANAGEMENT, EMPLOYEE ENGAGEMENT, ORGANIZATIONAL AND PERFORMANCE MANAGEMENT, TRAINING AND DEVELOPMENT, AND COMPENSATION.\nRESPONSIBILITIESESTABLISH AND IMPLEMENT HR EFFORTS THAT EFFECTIVELY SUPPORT THE COMPANY'S MISSION AND STRATEGIC VISIONWORK WITH THE HR TEAM TO DEVELOP STRATEGIES TO SUPPORT THE ACHIEVEMENT OF THE OVERALL BUSINESS OPERATIONS OBJECTIVESFUNCTION AS A STRATEGIC BUSINESS ADVISOR TO THE EXECUTIVE MANAGEMENT TEAM REGARDING KEY ORGANIZATIONAL ISSUESWORK WITH THE COMPANY'S EXECUTIVE MANAGEMENT TEAM ON SUCCESSION PLANNINGDEVELOP HR INITIATIVES FOR CHANGE PROCESSES WITH FOCUS ON AGILITY AND GROWTH\nQUALIFICATIONSBACHELOR’S DEGREE IN HUMAN RESOURCES, BUSINESS ADMINISTRATION, OR RELATED FIELD15+ YEARS OF HUMAN RESOURCE EXPERIENCEBROAD EXPERIENCE AND SUBSTANTIVE KNOWLEDGE OF EMPLOYMENT AND LABOR LAW, INCLUDING UNIONSSHRM-CP OR SHRM-SCP (PREFERRED)",
    "job_skill_set": [
      "training and development",
      "leadership",
      "communication",
      "collaboration",
      "problem solving",
      "strategic planning",
      "talent management",
      "employee engagement",
      "organizational management",
      "performance management",
      "compensation management",
      "employment law",
      "labor law",
      "HR certifications (SHRM-CP, SHRM-SCP)",
      "strategic advising",
      "change management",
      "agility"
    ],
    "short_keywords": [
      "advising",
      "agility",
      "and",
      "certifications",
      "change",
      "collaboration",
      "communication",
      "compensation",
      "development",
      "employee",
      "employment",
      "engagement",
      "hr",
      "human",
      "labor",
      "law",
      "leadership",
      "management",
      "organizational",
      "performance",
      "planning",
      "president",
      "problem",
      "resources",
      "senior",
      "shrmcp",
      "shrmscp",
      "solving",
      "strategic",
      "talent",
      "training",
      "vice"
    ]
  },
  {
    "job_id": "3903451207",
    "job_title": "Human Resources Generalist",
    "category": "HR",
    "job_description": "THE HUMAN RESOURCE GENERALIST IS RESPONSIBLE FOR THE DAILY FUNCTIONS OF THE HUMAN RESOURCE (HR) DEPARTMENT INCLUDING HIRING AND INTERVIEWING STAFF, ADMINISTERING PAY, BENEFITS, AND LEAVE, AND ENFORCING COMPANY POLICIES AND PRACTICES. WORKING WITH THE DIRECTOR OF HUMAN RESOURCES TO SUPPORT PROCESSES TO ACCOMPLISH OBJECTIVES IN ALIGNMENT WITH GHHI’S MISSION AND BUSINESS OBJECTIVES. ADDITIONALLY, FOLLOWING TO THE HUMAN RESOURCE BUSINESS PLAN THAT WILL ALIGN WITH THE MISSION AND VISION OF GHHI TO DELIVER HR SERVICES THAT ENABLE ORGANIZATIONAL SUCCESS.\nDUTIES/RESPONSIBILITIES:REVIEWS, TRACKS, AND DOCUMENTS COMPLIANCE WITH MANDATORY AND NON-MANDATORY TRAINING, CONTINUING EDUCATION, AND WORK ASSESSMENTS. THIS MAY INCLUDE SAFETY TRAINING, ANTI-HARASSMENT TRAINING, PROFESSIONAL LICENSURE, AND APTITUDE EXAMS AND CERTIFICATIONS.RECRUITS, INTERVIEWS, AND FACILITATES THE HIRING OF QUALIFIED JOB APPLICANTS FOR OPEN POSITIONS; COLLABORATES WITH DEPARTMENTAL MANAGERS TO UNDERSTAND SKILLS AND COMPETENCIES REQUIRED FOR OPENINGS.COLLECTS AND ANALYZES DATA TO MAINTAIN CURRENT UNDERSTANDING OF FAIR AND COMPETITIVE MARKET SALARIES, CANDIDATE AVAILABILITY, AND DEMAND FOR CANDIDATES IN PARTICULAR FIELDS.CONSULTS DATA AND RECORDS TO IDENTIFY AND SELECT POTENTIAL CANDIDATES FOR VACANT POSITIONS.SCREENS CANDIDATES, SELECTS QUALIFIED AND INTERESTED CANDIDATES FOR THE INTERVIEWING PHASE, AND THEN CONNECTS VIABLE CANDIDATES WITH CLIENTS OR HIRING MANAGERS.CHECKS CANDIDATES’ REFERENCES AND CREDENTIALS, VERIFYING EXPERIENCE AND BACKGROUNDS.COUNSELS CANDIDATES ON THE INTERVIEW AND HIRING PROCESS.FOLLOWS UP WITH CLIENTS OR HIRING MANAGERS AFTER THE INTERVIEW PROCESS TO DETERMINE WHETHER A PLACEMENT CAN BE MADE; COLLECTS FEEDBACK WHEN PLACEMENT IS UNSUCCESSFUL.ARRANGES MEETING LOCATIONS, TRAVEL, AND/OR ACCOMMODATIONS FOR APPLICANTS AND COMPANY MANAGERS WHEN NECESSARY.MAINTAINS AND ENSURES COMPLIANCE WITH APPLICABLE EQUAL EMPLOYMENT OPPORTUNITY (EEO) AND RELATED EMPLOYMENT LAWS AND REGULATIONS. CONDUCTS OR ACQUIRES BACKGROUND CHECKS AND EMPLOYEE ELIGIBILITY VERIFICATIONS.IMPLEMENTS NEW HIRE ORIENTATION AND EMPLOYEE RECOGNITION PROGRAMS.PERFORMS ROUTINE TASKS REQUIRED TO ADMINISTER AND EXECUTE HUMAN RESOURCE PROGRAMS INCLUDING BUT NOT LIMITED TO COMPENSATION, BENEFITS, AND LEAVE; DISCIPLINARY MATTERS; DISPUTES AND INVESTIGATIONS; PERFORMANCE AND TALENT MANAGEMENT; PRODUCTIVITY, RECOGNITION, AND MORALE; OCCUPATIONAL HEALTH AND SAFETY; AND TRAINING AND DEVELOPMENT.HANDLES EMPLOYMENT-RELATED INQUIRIES FROM APPLICANTS, EMPLOYEES, AND SUPERVISORS, REFERRING COMPLEX AND/OR SENSITIVE MATTERS TO THE APPROPRIATE STAFF.ATTENDS AND PARTICIPATES IN EMPLOYEE DISCIPLINARY MEETINGS, TERMINATIONS, AND INVESTIGATIONS.MAINTAINS COMPLIANCE WITH FEDERAL, STATE, AND LOCAL EMPLOYMENT LAWS AND REGULATIONS, AND RECOMMENDED BEST PRACTICES; REVIEWS POLICIES AND PRACTICES TO MAINTAIN COMPLIANCE.MAINTAINS KNOWLEDGE OF TRENDS, BEST PRACTICES, REGULATORY CHANGES, AND NEW TECHNOLOGIES IN HUMAN RESOURCES, TALENT MANAGEMENT, AND EMPLOYMENT LAW.PERFORMS OTHER DUTIES AS ASSIGNED. REQUIRED SKILLS/ABILITIES: EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS. EXCELLENT INTERPERSONAL, NEGOTIATION, AND CONFLICT RESOLUTION SKILLS.EXCELLENT ORGANIZATIONAL SKILLS AND ATTENTION TO DETAIL.EXCELLENT TIME MANAGEMENT SKILLS WITH A PROVEN ABILITY TO MEET DEADLINES.THOROUGH UNDERSTANDING OF EEO, ADA, AND OTHER RELATED EMPLOYMENT LAWS AND GUIDELINES. PROFICIENT IN MICROSOFT OFFICE SUITE OR RELATED SOFTWARE. STRONG ANALYTICAL AND PROBLEM-SOLVING SKILLS.ABILITY TO PRIORITIZE TASKS AND TO DELEGATE THEM WHEN APPROPRIATE.ABILITY TO ACT WITH INTEGRITY, PROFESSIONALISM, AND CONFIDENTIALITY.THOROUGH KNOWLEDGE OF EMPLOYMENT-RELATED LAWS AND REGULATIONS.PROFICIENT WITH MICROSOFT OFFICE SUITE OR RELATED SOFTWARE.PROFICIENCY WITH OR THE ABILITY TO QUICKLY LEARN THE ORGANIZATION’S HRIS AND TALENT MANAGEMENT SYSTEMS.\nEDUCATION AND EXPERIENCE:BACHELOR’S DEGREE IN HUMAN RESOURCES, BUSINESS ADMINISTRATION, OR RELATED FIELD PREFERRED.AT LEAST THREE YEARS OF HUMAN RESOURCE EXPERIENCE PREFERRED.SHRM-CP A PLUS.SHRM’S TALENT ACQUISITION SPECIALTY CREDENTIAL A PLUS. PHYSICAL REQUIREMENTS: PROLONGED PERIODS OF SITTING AT A DESK AND WORKING ON A COMPUTER.MUST BE ABLE TO LIFT 15 POUNDS AT TIMES.  ADDITIONAL INFORMATION: THIS IS A FULL-TIME, EXEMPT POSITION. THE GREEN & HEALTHY HOMES INITIATIVE IS AN EQUAL EMPLOYMENT OPPORTUNITY (EEO) EMPLOYER. GHHI DOES NOT DISCRIMINATE ON THE BASIS OF RACE, COLOR, NATIONAL ORIGIN, RELIGION, GENDER, AGE, VETERAN STATUS, POLITICAL AFFILIATION, SEXUAL ORIENTATION, MARITAL STATUS OR DISABILITY (IN COMPLIANCE WITH THE AMERICANS WITH DISABILITIES ACT) WITH RESPECT TO EMPLOYMENT OPPORTUNITIES. GHHI HAS A DEEP COMMITMENT TO RACIAL, GENDER AND ETHNIC DIVERSITY AND SEEKS APPLICANTS FROM ALL QUALIFIED PERSONS.",
    "job_skill_set": [
      "HRIS",
      "Microsoft Office Suite",
      "Employment Law Knowledge",
      "Recruitment",
      "Interviewing",
      "Compliance Management",
      "Conflict Resolution",
      "Training and Development",
      "Performance Management",
      "Communication",
      "Interpersonal Skills",
      "Organizational Skills",
      "Integrity",
      "Problem Solving",
      "Negotiation",
      "Confidentiality",
      "Delegation",
      "Data Analysis",
      "Time Management",
      "Attention to Detail"
    ],
    "short_keywords": [
      "analysis",
      "and",
      "attention",
      "communication",
      "compliance",
      "confidentiality",
      "conflict",
      "data",
      "delegation",
      "detail",
      "development",
      "employment",
      "generalist",
      "hr",
      "hris",
      "human",
      "integrity",
      "interpersonal",
      "interviewing",
      "knowledge",
      "law",
      "management",
      "microsoft",
      "negotiation",
      "office",
      "organizational",
      "performance",
      "problem",
      "recruitment",
      "resolution",
      "resources",
      "skills",
      "solving",
      "suite",
      "time",
      "to",
      "training"
    ]
  },
  {
    "job_id": "3905862468",
    "job_title": "Manager, Human Resources",
    "category": "HR",
    "job_description": " MANAGER OF HUMAN RESOURCES MIDWEST INDUSTRIAL SUPPLY CANTON, OHIO  REPORTING TO THE VICE PRESIDENT, THIS NEWLY CREATED POSITION WILL LEAD MIDWEST’S HIRING, ONBOARDING, COACHING AND EMPLOYEE DEVELOPMENT EFFORTS. THIS CRITICAL ROLE COMBINES BOTH STRATEGIC PLANNING AND ‘HANDS - ON’ LEADERSHIP AND REQUIRES A PERSON WHO HAS PREVIOUS EXPERIENCE IN A MANUFACTURING OR DISTRIBUTION INDUSTRY. THIS IS A FULL-TIME ROLE THAT WILL REQUIRE YOUR DAILY PRESENCE AT OUR HEADQUARTERS IN CANTON, OHIO  MIDWEST INDUSTRIAL SUPPLY PRIDES ITSELF ON CREATING ENVIRONMENTALLY RESPONSIBLE SOIL STABILIZATION, DUST CONTROL AND INDUSTRIAL LUBRICANTS THAT ARE ECOLOGICALLY SAFE. WE PROVIDE THESE PRODUCTS AND SERVICES FOR OUR CUSTOMERS THROUGHOUT NORTH AMERICA. WE CARE ABOUT ECOLOGY, HEALTH, AND PRODUCTIVITY. VISIT OUR WEB SITE AT WWW.MIDWESTIND.COM AND LEARN MORE ABOUT OUR CULTURE AND OUR COMMITMENT TO EARTH-CONSCIOUS SOLUTIONS.  THE SUCCESSFUL CANDIDATE WILL LEAD IN DEVELOPING TALENT MANAGEMENT SYSTEMS, RECRUITMENT, ONBOARDING, PERFORMANCE EVALUATIONS, COMPENSATION ANALYSIS, EMPLOYEE RETENTION, SUCCESSION PLANNING AND DEVELOPING EMPLOYEE SATISFACTION INITIATIVES. THIS ROLE REQUIRES A PERSON WHO IS COMFORTABLE PERFORMING TACTICAL RESPONSIBILITIES -- ENSURING THAT HR TOOLS, TRAINING AND RESOURCES ARE AVAILABLE TO SUPPORT EVERY EMPLOYEE.    MANAGER OF HR RESPONSIBILITIES INCLUDE:   UNDERSTAND AND IDENTIFY THE CAPABILITIES, SKILL SETS AND INTERESTS OF MIDWEST’S HUMAN RESOURCES AND USE THIS DATA TO DETERMINE STAFF DEVELOPMENT NEEDS AND STAFFING DECISIONS.  MANAGE THE RECRUITMENT PROCESS INCLUDING SOURCING, ASSESSMENTS, INTERVIEWS, AND OFFERS.  MANAGE AND OVERSEE THE DEVELOPMENT OF TALENT MANAGEMENT TOOLS AND TRAINING IN RELATION TO PERFORMANCE, CALIBRATION, AND SUCCESSION PLANNING.  MANAGE AND ADMINISTER THE HRIS - UKG, WHILE OVERSEEING THE DATABASE OF THE ORGANIZATION’S DISTINCT ROLES AND JOB DESCRIPTIONS.  ESTABLISH INNOVATIVE SOURCING STRATEGIES TO ATTRACT TOP CANDIDATES INCLUDING JOB POSTING OPTIMIZATION, JOB BOARD PROCUREMENT, DIGITAL AND NON-DIGITAL EMPLOYMENT MARKETING, COMPREHENSIVE ANNUAL RECRUITMENT CAMPAIGN PLANNING, AND TALENT PLANNING.   PROVIDE LEADERSHIP IN THE DEVELOPMENT AND EXECUTION OF RECRUITMENT STRATEGIES FOR ALL LOCATIONS.  MANAGE CONTRACTUAL RELATIONSHIPS WITH PLACEMENT AGENCIES, CONTRACT RECRUITERS, JOB BOARDS, JOB FAIRS AND VARIOUS INTERNET JOB SEARCH WEBSITES.  DEVELOP A COMPREHENSIVE AND MEANINGFUL ON-BOARDING SYSTEM.  MAINTAIN ADMINISTRATION AND WORKFLOW OF HUMAN RESOURCES PROGRAMS INCLUDING, LEAVE OF ABSENCE, WORKERS COMPENSATION (TIRR WITH SAFETY), FMLA, UNEMPLOYMENT INSURANCE, ETC.  PROVIDE DIRECTION, SUPPORT, AND EXPERTISE FOR INDIVIDUAL DEVELOPMENT PLANNING.  IDENTIFY TALENT AND DEVELOP FUTURE LEADERS THROUGH APPROPRIATE JOB ASSIGNMENTS AND PERSONAL DEVELOPMENT PLANS.  DEVELOP A MENTORSHIP PROGRAM, WITH DEPARTMENT MANAGERS, TO ASSESS AND GROW LEADERSHIP CAPABILITIES OF FRONT-LINE EMPLOYEES.  TAKE A LEADERSHIP ROLE IN DEVELOPING A CULTURE THAT ENABLES EMPLOYEES TO PERFORM IN ACCORDANCE WITH THE COMPANY’S OBJECTIVES.  ENCOURAGE EVERY EMPLOYEE TO PARTICIPATE IN THE WORK PROCESS SO THAT THEY BECOME A PARTNER IN THE IMPLEMENTATION OF PLANS AND OUTCOMES.  INITIATE PROGRAMS THAT INSTILL AN ENVIRONMENT OF TRUST, COOPERATION AND COMMUNICATION FOR PERSONAL GROWTH AND THE ACHIEVEMENT OF THE COMPANY’S GOALS.  MIDWEST’S SUCCESS IS THE RESULT OF OUR EMPLOYEES’ DEDICATION AND PROFESSIONALISM. WE PROVIDE OUR EMPLOYEES WITH EXCITING, FAST-PACED, AND FRIENDLY WORK ENVIRONMENT; A CULTURE OF CARE AND COLLABORATION; OPPORTUNITIES TO GROW; AND COMPETITIVE WAGE AND BENEFITS PACKAGE, MEDICAL (WITH INCENTIVES AVAILABLE TO EARN GENEROUS DISCOUNTS ON PREMIUMS), DENTAL, VISION, EMPLOYER PAID LIFE INSURANCE, EMPLOYER PAID SHORT-TERM DISABILITY, AND VOLUNTARY LONG-TERM DISABILITY. WE OFFER A 401K PLAN THAT INCLUDES AN EMPLOYER MATCH.   QUALIFICATIONS FOR THIS ROLE:  BACHELOR’S DEGREE IN RELATED FIELD; PROVEN INDUSTRY EXPERIENCE WILL BE ACCEPTABLE IN LIEU OF DEGREE.FIVE OR MORE YEARS’ EXPERIENCE IN A VARIETY OF AREAS IN HUMAN RESOURCESHUMAN RESOURCES CERTIFICATION HIGHLY PREFERREDEXCELLENT KNOWLEDGE OF EMPLOYMENT RELATED LAWS AND REGULATIONSPROVEN EXPERIENCE IN HUMAN RESOURCES MANAGEMENTTHOROUGH KNOWLEDGE OF HUMAN RESOURCES MANAGEMENT PRINCIPLES AND BEST PRACTICESABILITY TO EXERCISE CONSIDERABLE JUDGMENT, MAINTAIN CONFIDENTIALITY, AND ACT IN A DIPLOMATIC MANNER.A GOOD EDUCATOR WHO IS TRUSTWORTHY AND WILLING TO SHARE INFORMATION AND SERVE AS A MENTOR.AN INTELLIGENT AND ARTICULATE INDIVIDUAL WHO CAN RELATE TO PEOPLE AT ALL LEVELS OF AN ORGANIZATION AND POSSESSES EXCELLENT COMMUNICATION SKILLS.WELL-ORGANIZED AND SELF-DIRECTED WITH ABILITY TO WORK WITH MINIMAL AMOUNT OF SUPERVISION.PROFICIENT IN MICROSOFT OFFICE AND INDUSTRY RELATED SOFTWARE PROGRAMS HRIS SYSTEM, PREFERABLY UKG.ABILITY TO WORK EXTENDED HOURS, WEEKENDS, AND HOLIDAYS PURSUANT WITH INDUSTRY DEMANDS.OCCASIONAL TRAVELSOUND JUDGMENT, POSITIVE ATTITUDE AND HIGH LEVEL OF ORGANIZATIONAL SKILLS.OTHER SKILLS, EXPERIENCE AND QUALIFICATIONS SPECIFIC TO MANUFACTURING AND OR DISTRIBUTION.INITIATE PROGRAMS THAT INSTILL AN ENVIRONMENT OF TRUST, COOPERATION AND COMMUNICATION FOR PERSONAL GROWTH AND THE ACHIEVEMENT OF THE COMPANY’S GOALS.MIDWEST’S SUCCESS IS THE RESULT OF OUR EMPLOYEES’ DEDICATION AND PROFESSIONALISM. WE PROVIDE OUR EMPLOYEES WITH EXCITING, FAST-PACED, AND FRIENDLY WORK ENVIRONMENT; A CULTURE OF CARE AND COLLABORATION; OPPORTUNITIES TO GROW; AND COMPETITIVE WAGE AND BENEFITS PACKAGE, MEDICAL (WITH INCENTIVES AVAILABLE TO EARN GENEROUS DISCOUNTS ON PREMIUMS), DENTAL, VISION, EMPLOYER PAID LIFE INSURANCE, EMPLOYER PAID SHORT-TERM DISABILITY, AND VOLUNTARY LONG-TERM DISABILITY. WE OFFER A 401K PLAN THAT INCLUDES AN EMPLOYER MATCH.QUALIFICATIONS FOR THIS ROLE:BACHELOR’S DEGREE IN RELATED FIELD; PROVEN INDUSTRY EXPERIENCE WILL BE ACCEPTABLE IN LIEU OF DEGREE.FIVE OR MORE YEARS’ EXPERIENCE IN A VARIETY OF AREAS IN HUMAN RESOURCESHUMAN RESOURCES CERTIFICATION HIGHLY PREFERREDEXCELLENT KNOWLEDGE OF EMPLOYMENT RELATED LAWS AND REGULATIONSPROVEN EXPERIENCE IN HUMAN RESOURCES MANAGEMENTTHOROUGH KNOWLEDGE OF HUMAN RESOURCES MANAGEMENT PRINCIPLES AND BEST PRACTICESABILITY TO EXERCISE CONSIDERABLE JUDGMENT, MAINTAIN CONFIDENTIALITY, AND ACT IN A DIPLOMATIC MANNER.A GOOD EDUCATOR WHO IS TRUSTWORTHY AND WILLING TO SHARE INFORMATION AND SERVE AS A MENTOR.AN INTELLIGENT AND ARTICULATE INDIVIDUAL WHO CAN RELATE TO PEOPLE AT ALL LEVELS OF AN ORGANIZATION AND POSSESSES EXCELLENT COMMUNICATION SKILLS.WELL-ORGANIZED AND SELF-DIRECTED WITH ABILITY TO WORK WITH MINIMAL AMOUNT OF SUPERVISION.PROFICIENT IN MICROSOFT OFFICE AND INDUSTRY RELATED SOFTWARE PROGRAMS HRIS SYSTEM, PREFERABLY UKG.ABILITY TO WORK EXTENDED HOURS, WEEKENDS, AND HOLIDAYS PURSUANT WITH INDUSTRY DEMANDS.OCCASIONAL TRAVELSOUND JUDGMENT, POSITIVE ATTITUDE AND HIGH LEVEL OF ORGANIZATIONAL SKILLS.OTHER SKILLS, EXPERIENCE AND QUALIFICATIONS SPECIFIC TO MANUFACTURING AND OR DISTRIBUTION.ADVANCED KNOWLEDGE OF EMPLOYMENT LAWS  WE OFFER:A CASUAL, FAST-MOVING, AND FRIENDLY WORK ATMOSPHEREA BIG BUSINESS FOOTPRINT, BUT SMALL BUSINESS FAMILY CULTUREA PROVEN TRACK RECORD OF SUCCESSSTABILITYEXCELLENT COMPENSATION PACKAGE + BONUSVACATION, PAID TIME OFF AND HOLIDAYSCOMPREHENSIVE BENEFITS: HEALTH, DENTAL, VISON, PRESCRIPTION AND LIFE AND A 401K RETIREMENT PLAN.   ",
    "job_skill_set": [
      "Human Resources Management",
      "Recruitment",
      "Onboarding",
      "Performance Evaluations",
      "Compensation Analysis",
      "HRIS (UKG)",
      "Employment Laws",
      "Organizational Skills",
      "Mentorship Program Development",
      "Leadership",
      "Communication",
      "Judgment",
      "Trustworthiness",
      "Cooperation",
      "Problem Solving",
      "Self-Directed",
      "Diplomacy",
      "Positive Attitude",
      "Collaboration",
      "Talent Management Systems",
      "Microsoft Office"
    ],
    "short_keywords": [
      "analysis",
      "attitude",
      "collaboration",
      "communication",
      "compensation",
      "cooperation",
      "development",
      "diplomacy",
      "employment",
      "evaluations",
      "hr",
      "hris",
      "human",
      "judgment",
      "laws",
      "leadership",
      "management",
      "manager",
      "mentorship",
      "microsoft",
      "office",
      "onboarding",
      "organizational",
      "performance",
      "positive",
      "problem",
      "program",
      "recruitment",
      "resources",
      "selfdirected",
      "skills",
      "solving",
      "systems",
      "talent",
      "trustworthiness",
      "ukg"
    ]
  },
  {
    "job_id": "3894293970",
    "job_title": "Human Resource Generalist",
    "category": "HR",
    "job_description": "MARMON INDUSTRIAL ENERGY & INFRASTRUCTURE (MIEI) – PEARL MISSISSIPPI IS ONE OF SIX SPECIALTY WIRE, CABLE, AND TUBING SOLUTION MANUFACTURING COMPANIES LOCATED THROUGHOUT NORTH AMERICA. WE HAVE OVER 100 YEARS OF INNOVATIVE ENGINEERED SOLUTIONS FOR CRITICAL, INDUSTRIAL, AND COMMERCIAL APPLICATIONS. \nWE ARE THE EXPERTS IN OUR INDUSTRY.\nGENERAL POSITION SUMMARY: THE HR GENERALIST IS RESPONSIBLE FOR RECRUITMENT EFFORTS, NEW HIRE ORIENTATION AND ONBOARDING, EMPLOYEE TERMINATION, BENEFITS ADMINISTRATION, LEGAL COMPLIANCE, COMPANY POLICY AND PROCEDURE ADHERENCE IN A UNION ENVIRONMENT. IN ADDITION, WILL BUILD STRONG RELATIONSHIPS WITH OUR COMPANY'S MANAGERS AND EMPLOYEES TO HELP THEM WITH THEIR HUMAN RESOURCES NEEDS. \nESSENTIAL DUTIES: ENSURE COMPLIANCE WITH COMPANY POLICIES AND PROCEDURES AS WELL AS FEDERAL AND STATE LEGAL RESPONSIBILITIES.SUPPORT AND ASSIST WITH INTEGRATION ACTIVITIES AS A NEWLY ACQUIRED COMPANY. SUCH AS, BUT NOT LIMITED TO, ALIGNMENT OF POLICIES, SYSTEMS, TRAINING, POSITIVE CULTURE AND ENGAGEMENT ACTIVITIES AND INITIATIVES. PARTNER WITH THE UNION TO MAINTAIN HEALTHY BUSINESS PRACTICES AND COLLABORATION.UNDERSTAND, FOLLOW, AND ENFORCE ALL ESTABLISHED SAFETY, HEALTH, QUALITY, AND COMPANY POLICIES, PROCEDURES, COLLECTIVE BARGAINING AGREEMENT, AND RECOGNIZED PRACTICES. PARTNER WITH THE HR LEADER ON APPLICABLE EMPLOYEE RELATIONS INCLUDING COACHING, COUNSELING, DISCIPLINE, AND ENGAGE THE HUMAN RESOURCES MANAGER WHERE APPLICABLE AND NECESSARY.SUPPORT LOCAL RECRUITING EFFORTS IN CONJUNCTION WITH PLATFORM TALENT ACQUISITION PARTNER. ADMINISTER AND COORDINATE NEW HIRE ORIENTATION, ONBOARDING EFFORTS AND EMPLOYEE TERMINATION PROCESS.COORDINATION OF LOCAL EMPLOYEE COMMUNICATIONS AND EMPLOYEE RELATIONS ITEMS.PROVIDES GENERAL GUIDANCE AND COACHING FOR PLANT LEADERSHIP, RELATING TO EMPLOYEE CONCERNS, PROBLEMS, AND DISCIPLINARY ACTION TO COMPLY WITH COMPANY POLICIES. RESPONSIBLE FOR IMPLEMENTING TRAINING AND DEVELOPMENT OF EMPLOYEES AT EVERY LEVEL.PROMOTES AND SUPPORTS COMPANY CONTINUOUS IMPROVEMENT INITIATIVES. ACTS AS A LOCAL CHANGE AGENT.PROMOTES AND SUPPORTS A CULTURE OF GROWTH AND DEVELOPMENT FOR EMPLOYEES AT ALL LEVELS.PARTNERS WITH OPERATIONS ON ALL RISK MANAGEMENT, SAFETY, AND WORKERS COMPENSATION ITEMS.SERVES AS ONSITE BENEFIT CONTACT AND MANAGES SITE FMLA, STD WC, AND OTHER LEAVES ACCORDING TO POLICIES.COORDINATE AND HOST EMPLOYEE ENGAGEMENT & RECOGNITION EVENTS AND CHAMPION COMPANY RECOGNITION PROGRAMS AND RETENTION INITIATIVES.PARTNER WITH MARMON IEI HR TEAM ON PLATFORM ON PROJECTS AND INITIATIVES.OTHER DUTIES AND PROJECTS AS ASSIGNED.\nEDUCATION AND EXPERIENCE PREFERRED:BACHELOR'S DEGREE OR EQUIVALENT EXPERIENCE IN BUSINESS OR HUMAN RESOURCES IS PREFERRED. 3+ YEARS OF EXPERIENCE WORKING IN HUMAN RESOURCES3+ YEARS OF EXPERIENCE IN EMPLOYEE RELATIONS IN A UNION ENVIRONMENT STRONGLY DESIRED. \nKNOWLEDGE AND SKILLS PREFERRED:KNOWLEDGE OF CURRENT EMPLOYMENT LAW, AAP/EEO, NLRA, FMLA/ADA, FLSA AND GENERAL KNOWLEDGE OF OSHA, DEEP, EPA REQUIRED. STRONG INTERPERSONAL AND COMMUNICATION SKILLSMS OFFICE SUITE EXPERIENCE REQUIRED; WORKDAY EXPERIENCE PREFERRED. BASIC KNOWLEDGE OF ADP OR SIMILAR PAYROLL SYSTEM.MUST BE DETAILED ORIENTATED WITH A HIGH LEVEL OF ACCURACY.ABLE TO ANALYZE WRITTEN INFORMATION AND SITUATIONAL INFORMATION TO MAKE SOUND DECISIONS OR RECOMMENDATIONS.ABILITY TO MAINTAIN STRICT CONFIDENTIALITY WITH SENSITIVE INFORMATION. EXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLS, INCLUDING CONSULTATIVE APPROACH AND LISTENING SKILLS.FUNDAMENTAL UNDERSTANDING OF LEADERSHIP AND TEAM DEVELOPMENT.MUST A TEAM PLAYER DEMONSTRATE RESOURCEFULNESS, INITIATIVE, RESULTS-ORIENTATION, AND A CONSTANT FOCUS ON SERVICE DELIVERY. FLEXIBLE, ADAPTABLE STYLE; COMFORTABLE NAVIGATING THROUGH AMBIGUITY.ABILITY TO TRAVEL APPROPRIATELY 15% OF TIME FOR TRAINING AND STRATEGIC INITIATIVE COLLABORATION. \n\nWORKING CONDITIONS AND/OR PHYSICAL REQUIREMENTS:ABILITY TO WORK LONG HOURS IN A SEDENTARY POSITION SITTING, TALKING, LOOKING AT A COMPUTER, CHARTS/GRAPHS AND PERFORMING REPETITIVE MOTIONS.ABILITY TO MOVE OBJECTS AND MATERIALS OF AT LEAST 25LBS. ABILITY TO COLLABORATE WITH MANUFACTURING TEAM MEMBERS AS NEEDED IN AN ENVIRONMENT THAT CAN BE NOISY. ABILITY TO FOLLOW SAFETY GUIDELINES AND WEAR REQUIRED PPE WHEN ONSITE. \nMARMON INDUSTRIAL ENERGY AND INFRASTRUCTURE PEARL, MISSISSIPPI IS AN EQUAL OPPORTUNITY EMPLOYER AND MAKES EMPLOYMENT DECISIONS WITHOUT REGARD TO, AND PROHIBITS DISCRIMINATION BASED ON, RACE, COLOR, RELIGION, AGE, SEX, PREGNANCY, NATIONAL ORIGIN, SEXUAL ORIENTATION, GENDER IDENTITY, DISABILITY, VETERAN STATUS, OR ANY OTHER CHARACTERISTIC PROTECTED BY APPLICABLE FEDERAL, STATE, OR LOCAL LAW.",
    "job_skill_set": [
      "MS Office Suite",
      "Workday",
      "ADP or similar payroll system",
      "recruitment",
      "onboarding",
      "employee relations",
      "benefits administration",
      "data analysis",
      "communication",
      "interpersonal skills",
      "teamwork",
      "problem solving",
      "initiative",
      "resourcefulness",
      "results orientation",
      "listening skills",
      "adaptability",
      "leadership development",
      "employment law",
      "legal compliance",
      "safety guidelines",
      "FMLA",
      "ADA",
      "FLSA",
      "OSHA",
      "confidentiality",
      "flexibility",
      "consultative approach"
    ],
    "short_keywords": [
      "ada",
      "adaptability",
      "administration",
      "adp",
      "analysis",
      "approach",
      "benefits",
      "communication",
      "compliance",
      "confidentiality",
      "consultative",
      "data",
      "development",
      "employee",
      "employment",
      "flexibility",
      "flsa",
      "fmla",
      "generalist",
      "guidelines",
      "hr",
      "human",
      "initiative",
      "interpersonal",
      "law",
      "leadership",
      "legal",
      "listening",
      "ms",
      "office",
      "onboarding",
      "or",
      "orientation",
      "osha",
      "payroll",
      "problem",
      "recruitment",
      "relations",
      "resource",
      "resourcefulness",
      "results",
      "safety",
      "similar",
      "skills",
      "solving",
      "suite",
      "system",
      "teamwork",
      "workday"
    ]
  },
  {
    "job_id": "3902834350",
    "job_title": "Strategic Global Human Resource Business Partner",
    "category": "HR",
    "job_description": "NEW HAMPSHIRE BASED POSITION, THIS IS NOT A REMOTE OPPORTUNITY.\n\nSIG SAUER, INC. IS A LEADING PROVIDER AND MANUFACTURER OF FIREARMS, ELECTRO-OPTICS, AMMUNITION, AIRGUNS, SUPPRESSORS, REMOTE CONTROLLED WEAPONS STATIONS, AND TRAINING. FOR OVER 250 YEARS SIG SAUER, INC. HAS EVOLVED, AND THRIVED, BY BLENDING AMERICAN INGENUITY, GERMAN ENGINEERING, AND SWISS PRECISION. TODAY, SIG SAUER IS SYNONYMOUS WITH INDUSTRY-LEADING QUALITY AND INNOVATION WHICH HAS MADE IT THE BRAND OF CHOICE AMONGST THE U.S. MILITARY, THE GLOBAL DEFENSE COMMUNITY, LAW ENFORCEMENT, COMPETITIVE SHOOTERS, HUNTERS, AND RESPONSIBLE CITIZENS. ADDITIONALLY, SIG SAUER IS THE PREMIER PROVIDER OF ELITE FIREARMS INSTRUCTION AND TACTICAL TRAINING AT THE SIG SAUER ACADEMY AND IS NAMED HEADQUARTERED IN NEWINGTON, NEW HAMPSHIRE, SIG SAUER HAS OVER 3,200 EMPLOYEES ACROSS TWELVE LOCATIONS IN THREE STATES AND IS A CERTIFIED GREAT PLACE TO WORK™. FOR MORE INFORMATION ABOUT THE COMPANY AND PRODUCT LINE VISIT: SIGSAUER.COM.\n\nPOSITION SUMMARY\n\nTHE STRATEGIC GLOBAL HUMAN RESOURCE BUSINESS PARTNER WILL FILL THE ROLE OF ASSISTING OUR COMPANY IN ACCELERATING ITS’ INTERNATIONAL PRESENCE. THE SUCCESSFUL CANDIDATE WILL LEAD THE ESTABLISHMENT, DEVELOPMENT, DELIVERY, AND COORDINATION OF THE FULL SPECTRUM OF HUMAN RESOURCE SERVICES AND MANAGE THE IMPLEMENTATION OF HUMAN RESOURCE PROGRAMS AND INITIATIVES ACROSS THE COMPANY’S VARIOUS LOCATIONS. IN PARTNERSHIP WITH OTHER TEAMMATES IN THE HR ORGANIZATION, THE SUCCESSFUL APPLICANT WILL MANAGE ALL ASPECTS OF INTERNATIONAL HR INCLUDING COMPENSATION, BENEFITS, EMPLOYEE RELATIONS, DEVELOPMENT AND IMPLEMENTATION OF POLICIES AND PROCEDURES, RECRUITING SUPPORT, STRATEGIC HR PROGRAMS, AS WELL AS HR RESPONSIBILITIES IN OFFICE START UP AND OPERATIONS. THIS IS A HIGH-LEVEL INDIVIDUAL CONTRIBUTOR ROLE REQUIRING SIGNIFICANT EXPERIENCE SERVICING INTERNATIONAL HR REQUIREMENTS IN A HIGHLY ENTREPRENEURIAL ENVIRONMENT.\n\nRESPONSIBILITIES\n\nIN PARTNERSHIP WITH SENIOR MANAGEMENT, DEVELOP POLICIES AND PROCEDURES, ENSURING LEGAL AND REGULATORY COMPLIANCE FOR HEADQUARTERS AND COUNTRY LOCATIONS. CONSULT WITH SIG HR CORPORATE GROUPS WHEN CORPORATE POLICIES REQUIRE LOCAL ADAPTATION TO BE COMPLIANT. LEAD/PRIMARY CONTACT TO ALL INTERNATIONALLY BASED MANAGERS AND EMPLOYEES ON HUMAN RESOURCE RELATED MATTERS INCLUDING COMPENSATION, BENEFITS, HIRING, ONBOARDING, SEPARATION/TERMINATION, PERFORMANCE MANAGEMENT, ORGANIZATIONAL DEVELOPMENT, RECRUITMENT, FRINGE BENEFITS AS WELL AS EMPLOYEE RELATIONS AND ORGANIZATIONAL POLICY.PARTNER WITH STAFF TO ENSURE PROPER ADMINISTRATION OF BENEFITS AND ALLOWANCE, PAY STRUCTURE, AND CHANGES IN EMPLOYEE INFORMATION.IN PARTNERSHIP WITH SIG HR CORPORATE GROUPS, DRIVE THE PERFORMANCE MANAGEMENT PROCESS INCLUDING THE DEVELOPMENT OF JOB DESCRIPTIONS, SALARY SCALES AND SALARY/FRINGE BENEFIT MARKET SURVEYS FOR ASSIGNED LOCATIONS.MONITOR AND ADVISE US STAFF ON ALL INTERNATIONAL CHANGES IN LABOR LAWS, BOTH FEDERAL, STATE AND LOCAL LEVEL.RESPONSIBLE FOR EXPANDING CURRENT DOMESTICALLY FOCUSED HR STRATEGIC PROGRAMS SUCH AS ANNUAL EMPLOYEE ENGAGEMENT SURVEY AND REWARDS & RECOGNITION PROGRAMS TO INCLUDE ALL INTERNATIONAL LOCATIONS. ENCOURAGE A WORKPLACE ENVIRONMENT THAT VALUES TEAMWORK AND FOSTERS COLLABORATION, ACKNOWLEDGE AND REWARD STAFF CONTRIBUTIONS, AND DEVELOP STRATEGIES TO ENHANCE SYNERGIES BETWEEN STAFF AS WELL AS BETWEEN HEADQUARTERS AND THE VARIOUS INTERNATIONAL REGIONS UNDER THEIR AREAS OF RESPONSIBILITY.MOTIVATE STAFF PERFORMANCE AND PROFESSIONAL DEVELOPMENT, DEVELOP SKILLED MANAGERS AND MENTORS, AND EXERCISE SOUND JUDGMENT IN THE HIRING, PROMOTION, TRANSFER AND TERMINATION OF STAFF.RESPOND TO AND INVESTIGATE EMPLOYEE GRIEVANCES AND CONFLICTS AND WORK CLOSELY WITH ALL PARTIES INVOLVED. PROVIDE MANAGERS AND EMPLOYEES WITH TRAINING AND TOOLS TO ACCOMPLISH THESE TASKS.\n\nINTERNATIONAL HR MANAGEMENT\n\nPROVIDE GUIDANCE AND ASSISTANCE RELATED TO THE POSTING OF EXPATRIATE STAFF IN FOREIGN LOCATIONS INCLUDING BUT NOT LIMITED TO TERMS & CONDITIONS AGREEMENTS, RENEWALS AND AMENDMENTS; RELOCATION; ALLOWANCES, COORDINATE ON-BOARDING AND ORIENTATION; AS WELL AS COORDINATING END-OF-ASSIGNMENT (REPATRIATION) PROCESSES.WORK WITH US BASED AND HOST COUNTRY LEGAL ADVISERS TO PREPARE EMPLOYEE AGREEMENTS AND CORRESPONDING LOCAL EMPLOYEE HANDBOOKS INCLUDING CONDUCTING RESEARCH AS NECESSARY.SERVE AS A RESOURCE IN THE DEVELOPMENT AND UPDATING OF LOCAL HR SALARY SCALES, BENEFITS, AND POLICIES.LEAD HR CONTACT FOR COMPANY’S INTERNATIONAL CONTROLLER.MANAGES NETWORK OF LOCAL PROVIDERS TO ENSURE SIG RECEIVES WORLD-CLASS GUIDANCE ON EMPLOYEE RELATIONS, LOCAL LABOR REGULATIONS REQUIREMENTS, AND LOCAL HR PRACTICES.STAYS UP TO DATE ON REGULATORY AND MARKET PRACTICES EVOLUTIONS IMPACTING HR IN COUNTRIES WHERE SIG OPERATES.MANAGE RELATIONSHIP WITH LOCAL HR CONTACTS WITH EOR PARTNER.\n\nRECRUITMENT SUPPORT\n\nWORK WITH THE COMPANY’S RECRUITMENT FUNCTION TO SECURE NEEDED TALENT, INCLUDING WORKING TO HELP PREPARE DESCRIPTIONS, JOB POSTINGS, CONDUCTING INTERVIEWS, ASSISTANCE IN THE INTERVIEW PROCESS, AND OBTAINING REFERENCES FOR APPLICANTS, AS WELL AS NEGOTIATING SALARIES WITH SELECTED CANDIDATES.MAINTAIN NEEDED TALENT PIPELINE TO SUPPORT GROWTH.\n\nPROJECT MANAGEMENT\n\nABILITY TO UNDERTAKE AND MANAGE A VARIETY OF HR RELATED PROJECTS WHETHER DOMESTIC OR INTERNATIONAL.\n\nREQUIREMENTS\n\nBA/BS DEGREE IN HUMAN RESOURCE MANAGEMENT, BUSINESS ADMINISTRATION, OR A FIELD RELEVANT TO HUMAN RESOURCES.SHRM GLOBAL CERTIFICATION PREFERREDMINIMUM 8 TO 10 YEARS AS AN HR BUSINESS PARTNER; OR A MASTER’S DEGREE WITH SEVEN (7) YEARS OF RELEVANT EXPERIENCE IN HUMAN RESOURCES; AT LEAST SIX (6) YEARS OF EXPERIENCE IN INTERNATIONAL HR MANAGEMENT IN A MANUFACTURING ENVIRONMENT.PROVEN RECORD OF SUCCESS IN DEVELOPING AND MAINTAINING EFFECTIVE WORKING RELATIONSHIPS AND PARTNERSHIPS WITH DIVERSE STAKEHOLDERS.PRIOR SUCCESS IN CREATING A STRONG AND EFFECTIVE HR OPERATIONAL PLATFORM THAT IS RESPONSIVE TO ORGANIZATIONAL NEEDS AND PRIORITIES AND DELIVERS SUPERIOR CUSTOMER SERVICE IN A CHANGING AND DYNAMIC ENVIRONMENT.SOLID WORKING KNOWLEDGE OF BEST PRACTICES IN ALL HR FUNCTIONS INCLUDING INTERNATIONAL RECRUITMENT, ONBOARDING, BENEFITS, COMPENSATION, EMPLOYEE RELATIONS, PERFORMANCE MANAGEMENT, LEARNING AND DEVELOPMENT, HUMAN RESOURCE INFORMATION SYSTEMS, PROJECT MANAGEMENT.GUIDANCE TO INTERNAL CLIENTS, DEMONSTRATING CREATIVE PROBLEM-SOLVING SKILLS AND ABILITY TO APPLY THIS KNOWLEDGE APPROPRIATELY TO DIVERSE SITUATIONS AND SETTINGS.KNOWLEDGE OF FEDERAL, STATE (US) AND LOCAL IN COUNTRY HR RELATED LAWS AND ABILITY TO RESEARCH AND ADVISE ON LAWS AND REGULATIONS AFFECTING HR PRACTICES IN THEIR AREAS OF RESPONSIBILITY.STRONG WRITTEN, ORAL AND INTERPERSONAL COMMUNICATION SKILLS.ABILITY TO TRAVEL INTERNATIONALLY UP TO 15%.\n\nWORKING CONDITIONS\n\nABLE TO LIFT UP TO 25 POUNDS.MUST WEAR PERSONAL PROTECTIVE EQUIPMENT (PPE) WHICH IS REQUIRED IN DESIGNATED AREAS.\n\nSIG SAUER, INC. PROVIDES EQUAL EMPLOYMENT OPPORTUNITIES TO ALL EMPLOYEES AND APPLICANTS FOR EMPLOYMENT AND PROHIBITS DISCRIMINATION AND HARASSMENT OF ANY TYPE WITHOUT REGARD TO RACE, COLOR, RELIGION, AGE, SEX, NATIONAL ORIGIN, DISABILITY STATUS, GENETICS, PROTECTED VETERAN STATUS, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, OR ANY OTHER CHARACTERISTIC PROTECTED BY FEDERAL, STATE, OR LOCAL LAWS.",
    "job_skill_set": [
      "Human Resource Management",
      "Project Management",
      "Compensation and Benefits",
      "Employee Relations",
      "Recruitment",
      "Performance Management",
      "Policy Development",
      "Labor Laws Compliance",
      "HR Information Systems",
      "Training and Development",
      "Data Analysis",
      "Negotiation",
      "Communication",
      "Problem Solving",
      "Teamwork",
      "Interpersonal Skills",
      "Adaptability",
      "Leadership",
      "Cultural Awareness",
      "Conflict Resolution",
      "Strategic Thinking",
      "Customer Service Orientation",
      "International HR Management"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "and",
      "awareness",
      "benefits",
      "business",
      "communication",
      "compensation",
      "compliance",
      "conflict",
      "cultural",
      "customer",
      "data",
      "development",
      "employee",
      "global",
      "hr",
      "human",
      "information",
      "international",
      "interpersonal",
      "labor",
      "laws",
      "leadership",
      "management",
      "negotiation",
      "orientation",
      "partner",
      "performance",
      "policy",
      "problem",
      "project",
      "recruitment",
      "relations",
      "resolution",
      "resource",
      "service",
      "skills",
      "solving",
      "strategic",
      "systems",
      "teamwork",
      "thinking",
      "training"
    ]
  },
  {
    "job_id": "3903458736",
    "job_title": "Human Resources Administrator",
    "category": "HR",
    "job_description": "SMALL BUSINESSES ARE THE UNIQUE STAPLE THAT MAKES A COMMUNITY FEEL LIKE HOME. THEIR PASSION, DRIVE, AND CONTRIBUTION TO LOCAL PATRONS AND NEIGHBORS INSPIRED THE OAKLEY GROUP CEO, ALYSSA FREDES, TO CREATE A SMALL BUSINESS THAT SUPPORTS FELLOW SMALL BUSINESS ALONG THEIR JOURNEYS FORWARD. NAMED AFTER THE FAMILY DOG, OAKLEY, THE OAKLEY GROUP PRIDES ITSELF ON QUALITY RELATIONSHIPS WITH CLIENTS THAT STRIVES TO ELEVATE THEIR BUSINESSES THROUGH ACCOUNT MANAGEMENT, BOOKKEEPING, FINANCIAL SERVICES, OPERATION STRATEGY AND HUMAN RESOURCES.\nTHE OAKLEY GROUP: ALWAYS LOYAL. FOREVER VALUED.\nWE ARE LOOKING FOR A HR ADMINISTRATOR WHO SHARES OUR COMMITMENT TO FAMILY, COMMUNITY, AND SMALL BUSINESSES. THE HR ADMINISTRATOR HANDLES A RANGE OF DAILY HR FUNCTIONS FOR THE OAKLEY GROUP AND CLIENTS CONTRACTING WITH THE OAKLEY GROUP FOR STANDARD HUMAN RESOURCES SERVICES. THESE FUNCTIONS MAY INCLUDE HIRING AND INTERVIEWING STAFF, ADMINISTERING PAY, BENEFITS, AND LEAVE, PARTICIPATING IN PERFORMANCE REVIEWS, HANDLING EMPLOYEE RELATIONS INVESTIGATIONS, AND ENFORCING COMPANY POLICIES AND PRACTICES.WORK SCHEDULE: FLEXIBLE 20-28 HOURS/WEEKRESPONSIBILITIES:ACTS AS A RESOURCE FOR EMPLOYEES NAVIGATING THE WORKPLACE, INCLUDING INTERACTIONS WITH COLLEAGUES AND SUPERVISORS, AS WELL AS RELEVANT COMPANY POLICIES AND PROCEDURES.REVIEWS, TRACKS, AND DOCUMENTS COMPLIANCE WITH MANDATORY AND NON-MANDATORY TRAINING, CONTINUING EDUCATION, AND WORK ASSESSMENTS. THIS MAY INCLUDE SAFETY TRAINING, ANTI-HARASSMENT TRAINING, PROFESSIONAL LICENSURE, AND APTITUDE EXAMS AND CERTIFICATIONS.RECRUITS, INTERVIEWS, AND FACILITATES THE HIRING OF QUALIFIED JOB APPLICANTS FOR OPEN POSITIONS; COLLABORATES WITH DEPARTMENTAL MANAGERS TO UNDERSTAND SKILLS AND COMPETENCIES REQUIRED FOR OPENINGS.CONDUCTS OR ACQUIRES BACKGROUND CHECKS AND EMPLOYEE ELIGIBILITY VERIFICATIONS.IMPLEMENTS NEW HIRE ORIENTATION AND EMPLOYEE RECOGNITION PROGRAMS.PERFORMS ROUTINE TASKS REQUIRED TO ADMINISTER AND EXECUTE HUMAN RESOURCE PROGRAMS INCLUDING BUT NOT LIMITED TO COMPENSATION, BENEFITS, AND LEAVE; DISCIPLINARY MATTERS; DISPUTES AND INVESTIGATIONS; PERFORMANCE AND TALENT MANAGEMENT; PRODUCTIVITY, RECOGNITION, AND MORALE; OCCUPATIONAL HEALTH AND SAFETY; AND TRAINING AND DEVELOPMENT.HANDLES EMPLOYMENT-RELATED INQUIRIES FROM APPLICANTS, EMPLOYEES, AND SUPERVISORS, REFERRING COMPLEX AND/OR SENSITIVE MATTERS TO THE APPROPRIATE STAFF.ATTENDS AND PARTICIPATES IN EMPLOYEE DISCIPLINARY MEETINGS, TERMINATIONS, AND INVESTIGATIONS.MAINTAINS COMPLIANCE WITH FEDERAL, STATE, AND LOCAL EMPLOYMENT LAWS AND REGULATIONS, AND RECOMMENDED BEST PRACTICES; REVIEWS POLICIES AND PRACTICES TO MAINTAIN COMPLIANCE.MAINTAINS KNOWLEDGE OF TRENDS, BEST PRACTICES, REGULATORY CHANGES, AND NEW TECHNOLOGIES IN HUMAN RESOURCES, TALENT MANAGEMENT, AND EMPLOYMENT LAW.MAINTAINS TIMESHEETS ON BEHALF OF OAKLEY CLIENTS AND SERVES AS POINT PERSON FOR PAYROLL PROCESSING.PERFORMS OTHER DUTIES AS ASSIGNED.MINIMUM EXPERIENCE: 2+ YEARS OF HUMAN RESOURCES EXPERIENCE AND A BACHELOR'S DEGREE IN HUMAN RESOURCES OR A RELATED FIELDPREFERRED EXPERIENCE: 5+ YEARS OF EXPERIENCE AS A HR ADMINISTRATOR IN AN INDEPENDENT CAPACITY WORKING WITH SMALL BUSINESS AND HR CERTIFICATION THROUGH SHRM OR HRCIKNOWLEDGE/SKILLS:EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS.EXCELLENT INTERPERSONAL, NEGOTIATION, AND CONFLICT RESOLUTION SKILLS.EXCELLENT ORGANIZATIONAL SKILLS AND ATTENTION TO DETAIL.EXCELLENT TIME MANAGEMENT SKILLS WITH A PROVEN ABILITY TO MEET DEADLINES.STRONG ANALYTICAL AND PROBLEM-SOLVING SKILLS.ABILITY TO PRIORITIZE TASKS AND TO DELEGATE THEM WHEN APPROPRIATE.ABILITY TO ACT WITH INTEGRITY, PROFESSIONALISM, AND CONFIDENTIALITY.THOROUGH KNOWLEDGE OF EMPLOYMENT-RELATED LAWS AND REGULATIONS.PROFICIENT WITH MICROSOFT OFFICE SUITE OR RELATED SOFTWAREPROFICIENCY WITH OR THE ABILITY TO QUICKLY LEARN THE ORGANIZATION’S HRIS AND TALENT MANAGEMENT SYSTEMS, INCLUDING A VARIETY OF CLOUD BASED COMMUNICATION AND PROJECT MANAGEMENT SYSTEMSESSENTIAL FUNCTIONS:MUST BE ABLE TO WORK AT A COMPUTER FOR UP TO 8 HOURSJOB TYPE: PART-TIME\nPAY: $20.00 PER HOUR\nEXPECTED HOURS: 20 – 28 PER WEEK\nBENEFITS:401(K)FLEXIBLE SCHEDULEPAID TIME OFFSCHEDULE:MONDAY TO FRIDAYEXPERIENCE:HUMAN RESOURCES: 2 YEARS (REQUIRED)WORK LOCATION: HYBRID REMOTE IN SEWELL, NJ",
    "job_skill_set": [
      "human resources",
      "employment law",
      "payroll processing",
      "Microsoft Office Suite",
      "HRIS",
      "compliance tracking",
      "documentation",
      "communication",
      "interpersonal skills",
      "conflict resolution",
      "organizational skills",
      "time management",
      "analytical skills",
      "problem solving",
      "integrity",
      "professionalism",
      "confidentiality",
      "attention to detail",
      "talent management systems",
      "background checks",
      "performance management",
      "safety training",
      "anti-harassment training",
      "negotiation",
      "delegation"
    ],
    "short_keywords": [
      "administrator",
      "analytical",
      "antiharassment",
      "attention",
      "background",
      "checks",
      "communication",
      "compliance",
      "confidentiality",
      "conflict",
      "delegation",
      "detail",
      "documentation",
      "employment",
      "hr",
      "hris",
      "human",
      "integrity",
      "interpersonal",
      "law",
      "management",
      "microsoft",
      "negotiation",
      "office",
      "organizational",
      "payroll",
      "performance",
      "problem",
      "processing",
      "professionalism",
      "resolution",
      "resources",
      "safety",
      "skills",
      "solving",
      "suite",
      "systems",
      "talent",
      "time",
      "to",
      "tracking",
      "training"
    ]
  },
  {
    "job_id": "3904718244",
    "job_title": "Human Resources Advisor",
    "category": "HR",
    "job_description": "JOIN US AT URENCO USA (UUSA), WHERE WE'RE LEADING THE WAY IN NUCLEAR ENERGY INNOVATION. OUR STATE-OF-THE-ART FACILITY LOCATED IN EUNICE, NM, IS THE SOLE URANIUM ENRICHMENT SITE IN NORTH AMERICA. WE ARE ACTIVELY LOOKING FOR INDIVIDUALS WHO ARE READY TO WORK COLLABORATIVELY ON-SITE IN EUNICE, NM, AND WE'RE PLEASED TO OFFER RELOCATION SUPPORT TO HELP MAKE THIS OPPORTUNITY ACCESSIBLE TO TALENTED INDIVIDUALS LIKE YOU. COME BE A PART OF THE FUTURE OF CLEAN ENERGY.\n\nSUMMARY OF RESPONSIBILITIES\n\nUNDER GENERAL SUPERVISION, THE HUMAN RESOURCES ADVISOR IS RESPONSIBLE FOR PROVIDING HR SUPPORT TO THE ASSIGNED BUSINESS UNIT(S)/DEPARTMENT(S) INCLUDING ASSISTANCE ADMINISTERING URENCO USA PEOPLE & CULTURE PROGRAMS AS WELL AS TO PROVIDE OVERALL SUPPORT TO THE PEOPLE & CULTURE (P&C) DEPARTMENT. THE HUMAN RESOURCES ADVISOR WILL PLAY A KEY ROLE, IN CONJUNCTION WITH THE P&C TEAM AND THE HEAD OF P&C, DEVELOPING, IMPLEMENTING, AND EXECUTING A P&C PLAN THAT IS ALIGNED TO THE COMPANY STRATEGY AND ORGANIZATIONAL GOALS.\n\nEDUCATION AND EXPERIENCE\n\nTHE IDEAL CANDIDATE WILL HAVE A BACHELOR S DEGREE FROM AN ACCREDITED COLLEGE OR UNIVERSITY. THE HIGHLY QUALIFIED CANDIDATE WILL HAVE AN UNDERGRADUATE DEGREE IN A HUMAN RESOURCES RELATED DISCIPLINE, 1 YEAR OF RELEVANT EXPERIENCE AND WILL POSSES A PHR, SHRM-CP, OR SIMILAR HUMAN RESOURCES CERTIFICATION.\n\nSPECIFIC SKILLS\n\nEXPERIENCE WITH MS OFFICE APPLICATIONS. MODERATE TO ADVANCED MS EXCEL SKILLS ARE HIGHLY DESIRABLE. EXPERIENCE WITH SUCCESSFACTORS OR SIMILAR HRIS PLATFORMS IS PREFERRED. EXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLS. \n\n\nJOB DETAILS\n\nHYBRID (A PORTION OF WORK MAY BE DONE REMOTELY). THE WORK LOCATION FOR THIS POSITION IS URENCO USA, EUNICE, NM. EMERGENCY RESPONSE REQUIREMENTS ARE NEGOTIABLE. WORK SCHEDULE: PROFESSIONAL WORK SCHEDULE/ WITH MINIMAL NIGHT/ WEEKEND SUPPORT. SOME NIGHTS AND WEEKEND WORK MAY BE REQUIRED. EMPLOYEES ARE ALSO SUBJECT TO CALL-OUTS AS NEEDED. TRAVEL REQUIRED: 20% OF THE TIME OR LESS AS REQUIRED. SECURITY CLEARANCE REQUIREMENT: CONTROLLED ACCESS AREA (CAA) ACCESS AND AN L OR Q LEVEL SECURITY CLEARANCE IS REQUIRED. WORK ENVIRONMENT: RADIOLOGICAL EXPOSURE EXPECTATIONS OF < 100 MREM/YR. GENERAL OFFICE, PLANT PRODUCTION AREAS. THIS JOB OPERATES IN A PROFESSIONAL OFFICE ENVIRONMENT. THIS ROLE ROUTINELY USES STANDARD OFFICE EQUIPMENT SUCH AS COMPUTERS, PHONES, PHOTOCOPIERS, FILING CABINETS ETC. \n\nPRIMARY FUNCTIONS\n\nASSIST DEVELOPMENT AND IMPLEMENTATION OF THE EMPLOYMENT PROCESS INCLUDING SOURCING, SCREENING, AND OTHER GENERAL RECRUITMENT ACTIVITIES. PARTICIPATE IN UPDATING JOB DESCRIPTIONS FOR ASSIGNED BUSINESS UNITS, INCLUDING CONSULTING WITH MANAGER TO ENSURE COMPLIANCE AND NEEDS ANALYSIS. MAINTAIN CONTACT WITH JOB APPLICANTS AND INDIVIDUALS WHO HAVE A DESIRE TO WORK FOR URENCO USA, CONTACT JOB APPLICANTS TO INFORM THEM OF THE STATUS OF THEIR APPLICATIONS. ANALYZE EMPLOYMENT-RELATED DATA AND PREPARE REQUIRED REPORTS. ASSIST IN DEVELOPMENT AND IMPLEMENTATION OF ON-BOARDING AND OFF-BOARDING PROCESSES. LEARN AND UTILIZE JOB EVALUATION PROCESS FOR GRADING AND COMPENSATION. ASSIST IN THE MANAGEMENT OF THE UUSA TEMPORARY HOUSING AND RELOCATION PROGRAM. WORK CLOSELY WITH P&C BUSINESS PARTNER OR TALENT ACQUISITION PARTNER AS ASSIGNED, WITH STAFFING AND FUNCTIONAL AREA MANAGERS TO ENSURE TIMELY AND ACCURATE DOCUMENTATION FOR RECRUITING, EMPLOYER RELATIONS, TRAINING, PERFORMANCE MANAGEMENT AND OTHER AREAS AS ASSIGNED. PREPARE AND REVIEW PERSONNEL ACTION LETTERS; FOLLOW-THROUGH APPROVAL PROCESS. ASSIST THE COMPENSATION AND BENEFITS FUNCTIONS WITH INVOICING, ENROLLMENTS, AND OTHER DUTIES AS ASSIGNED. MAINTAIN KNOWLEDGE OF RELEVANT EMPLOYMENT LAWS / LEGAL REQUIREMENTS RELATED TO DAY-TO-DAY COMPLIANCE. WORK WITH P&C BUSINESS PARTNER(S) AND DEPARTMENT LEADERSHIP TO HELP EMPLOYEES, SUPERVISORS, AND DEPARTMENT HEADS TO SETTLE WORK-RELATED CONFLICTS THROUGH ADVICE AND RECOMMENDATION. MAINTAIN KNOWLEDGE OF COMPANY PROVIDED BENEFITS, POLICIES, AND PROCEDURES TO ASSIST EMPLOYEES AND MANAGERS. \n\n\nTHE DUTIES AND RESPONSIBILITIES LISTED ABOVE DO NOT REFLECT THE POSITION DESCRIPTION IN FULL AND IN COMPLETE DETAIL.\n\nBENEFITS\n\nFOR BENEFITS INFORMATION CLICK HERE.\n\nPLEASE NOTE THAT WE CONTINUALLY EVALUATE OUR PLANS AND MAKE ADJUSTMENTS AS NECESSARY TO MEET MARKET AND BUSINESS REQUIREMENTS.\n\n\nCOMPENSATION STARTING AT: $72094 - $ 105446 / YEAR AND UP DEPENDENT ON CANDIDATE.\n\nURENCO USA PROVIDES EQUAL EMPLOYMENT OPPORTUNITIES (EEO) TO ALL EMPLOYEES AND APPLICANTS FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, GENDER, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, NATIONAL ORIGIN, AGE, DISABILITY, GENETIC INFORMATION, MARITAL STATUS, AMNESTY, OR STATUS AS A COVERED VETERAN IN ACCORDANCE WITH APPLICABLE FEDERAL, STATE AND LOCAL LAWS. URENCO USA ENCOURAGES MINORITIES, FEMALES, VETERANS AND PERSONS WITH DISABILITIES TO APPLY. URENCO USA SUPPORTS A DRUG FREE ENVIRONMENT.\n\nIF REASONABLE ACCOMMODATION IS NEEDED TO PARTICIPATE IN THE JOB APPLICATION, INTERVIEW PROCESS, AND/OR TO PERFORM ESSENTIAL JOB FUNCTIONS, PLEASE CONTACT UUSA HR AT HRUUSA@URENCO.COM.\n\nURENCO USA | A TRUSTED LEADER IN MEETING THE WORLD S DEMAND FOR SUSTAINABLE ENERGY.\n\nURENCO USA (UUSA) IS PART OF AN INTERNATIONAL COMPANY THAT OPERATES ON THE CUTTING-EDGE OF THE NUCLEAR ENERGY INDUSTRY, UTILIZING THE WORLD S MOST ADVANCED, ENERGY-EFFICIENT, AND COST-EFFECTIVE METHOD TO ENRICH URANIUM. AS THE ONLY ENRICHMENT FACILITY IN NORTH AMERICA, UUSA HELPS PROVIDE CLEAN, SUSTAINABLE ENERGY WHILE OPERATING UNDER A FRAMEWORK OF HIGH ENVIRONMENTAL, SOCIAL RESPONSIBILITY, AND CORPORATE GOVERNANCE STANDARDS. OUR WORLD-CLASS FACILITY IS LOCATED IN THE MIDDLE OF THE ENERGYPLEX. WE STRIVE TO PROMOTE THE PRODUCTION OF NUCLEAR ENERGY TO FACILITATE THE TRANSITION TO A LOW-CARBON ECONOMY WHILE REMAINING DEDICATED TO SAFETY AND INVESTING IN COMMUNITY OUTREACH.\n\nIF YOU ARE ALREADY AN EMPLOYEE OF URENCO USA AND ARE INTERESTED IN APPLYING FOR ANOTHER JOB WITHIN THE COMPANY, PLEASE APPLY AND UPLOAD A COMPLETED INTERNAL CANDIDATE APPLICATION FORM (HR-2-3000-15-F-2), AND YOUR RESUME TO THE INTERNAL CAREER PORTAL. \n\nENRICH YOUR FUTURE!\n\nURENCO USA | HUMAN RESOURCES | HRUUSA@URENCO.COM\n\n]]>",
    "job_skill_set": [
      "Communication",
      "Teamwork",
      "Conflict Resolution",
      "Problem Solving",
      "Organizational Skills",
      "Adaptability",
      "MS Office",
      "MS Excel",
      "SuccessFactors",
      "HRIS",
      "Human Resources Certification (PHR, SHRM-CP)",
      "Data Analysis",
      "Job Evaluation Process"
    ],
    "short_keywords": [
      "adaptability",
      "advisor",
      "analysis",
      "certification",
      "communication",
      "conflict",
      "data",
      "evaluation",
      "excel",
      "hr",
      "hris",
      "human",
      "job",
      "ms",
      "office",
      "organizational",
      "phr",
      "problem",
      "process",
      "resolution",
      "resources",
      "shrmcp",
      "skills",
      "solving",
      "successfactors",
      "teamwork"
    ]
  },
  {
    "job_id": "3902805250",
    "job_title": "Human Resources Manager",
    "category": "HR",
    "job_description": "HYBRID ROLE BASED OUT OF BLYTHEWOOD, SC OR HOUSTON, TX: 2-3 DAYS A WEEK IN THE OFFICE POSITION SUMMARY: REPORTING TO THE VICE PRESIDENT HUMAN RESOURCES, THE INCUMBENT WILL SUPPORT THE EXECUTION OF HUMAN RESOURCE PLANS AND OBJECTIVES FOR SELECTED BUSINESS AREAS, NINE (9) NORTH AMERICAN PRODUCTION LOCATIONS PRODUCING MULTIPLE PRODUCT LINES, AND FIELD OPERATIONS. IN ADDITION TO WORKING CLOSELY WITH OPERATIONS LEADERSHIP, THE MANAGER HUMAN RESOURCES IS ACCOUNTABLE TO LEAD A TEAM OF HUMAN RESOURCES BUSINESS PARTNERS IN THE DELIVERY OF CLIENT SERVICES ACROSS THE DIVISION, AS WELL AS NUMEROUS INTERNAL AND MATTR-WIDE INITIATIVES/PROJECTS (AS DETERMINED ANNUALLY), SUCH AS CREATING ROBUST ONBOARDING PLANS, AUTOMATION, SYSTEMS LAUNCH, BENEFITS CHANGES, COLLECTIVE BARGAINING, FACILITATING ORGANIC AND INORGANIC GROWTH, AND OPENING NEW FACILITIES. ACCOUNTABILITIES WILL INCLUDE DEVELOPING AND IMPLEMENTING HUMAN RESOURCES PROGRAMS AND INITIATIVES AS WELL AS DEVELOPING STRATEGIES AND TACTICS TO ADDRESS SPECIFIC HUMAN RESOURCES ISSUES. THE INCUMBENT WILL ALSO INDIRECTLY OVERSEE THE LEARNING & DEVELOPMENT/TECHNICAL TRAINING TEAMS FOR THEIR RESPECTIVE BUSINESSES.  DUTIES:CLIENT SUPPORT:• PROVIDE QUALITY ADVICE AND INTERPRETATION TO ORGANIZATIONAL LEADERSHIP AND HR SERVICES TEAM RELATED TO JURISDICTIONAL LEGISLATION, ORGANIZATIONAL POLICY, AND HUMAN RESOURCES BEST PRACTICES. • PROVIDE SUBJECT MATTER EXPERTISE ON THE ADMINISTRATION OF THE COLLECTIVE BARGAINING AGREEMENT INCLUDING ADMINISTERING THE GRIEVANCE AND ARBITRATION PROCEDURE, DISCIPLINARY ACTION, AND PAST PRACTICES.• WORK WITH VP HUMAN RESOURCE TO DEVELOP AND IMPLEMENT A LABOR RELATIONS STRATEGY THAT SUPPORTS THE LONG-TERM BUSINESS AND OPERATIONS STRATEGY. • COORDINATE KEY HR ACTIVITIES IN ALIGNMENT WITH ORGANIZATIONAL BUSINESS CYCLES, INCLUDING BUT NOT LIMITED TO STRATEGIC AND ANNUAL HR PLAN, BUSINESS OBJECTIVE SETTING, PERFORMANCE MANAGEMENT, COMPENSATION PLANNING, AS WELL AS CORE HR ADMINISTRATIVE SERVICES. • LEAD THE DEVELOPMENT AND IMPLEMENTATION OF HUMAN RESOURCES POLICIES AND PROCEDURES, ENSURING THAT SOLUTIONS ARE COST EFFECTIVE, PRACTICAL AND APPROPRIATE TO THE NEEDS OF THE BUSINESS. • ADVISE, CONSULT, AND/OR COACH CLIENTS IN EMPLOYEE RELATIONS MATTERS INCLUDING PERFORMANCE MANAGEMENT, WORKPLACE INVESTIGATIONS OR DISCIPLINARY ACTIONS. POINT OF ESCALATION FOR THE RESOLUTION OF COMPLEX WORKPLACE DISPUTES. • LEAD AND SUPPORT CHANGE MANAGEMENT INITIATIVES ACROSS THE DIVISION.• PROVIDE CONSULTATIVE GUIDANCE TO DIVISIONAL LEADERSHIP WITH REGARD TO WORKFORCE PLANNING AND SUCCESSION MANAGEMENT. • PROVIDE GUIDANCE AND SUPPORT WITH REGARD TO POSITION MANAGEMENT AND CLASSIFICATION AS WELL AS COMPENSATION DECISIONS IN ALIGNMENT WITH COMPANY GUIDELINES. • DEVELOP TACTICS AND STRATEGIES TO ADDRESS SPECIFIC HUMAN RESOURCES ISSUES WITHIN CLIENT BUSINESS UNITS (E.G.: RECRUITMENT, RETENTION, LABOR TRENDS, ETC.).• PROVIDE COACHING, SKILL DEVELOPMENT, AND TRAINING TO HUMAN RESOURCES TEAM MEMBERS.• MONITOR, ANALYZING, AND INTERPRETING BUSINESS UNIT HUMAN RESOURCES METRICS. • LEAD LEADERSHIP ACCOUNTABILITIES: • PROVIDING GUIDANCE AND LEADERSHIP TO DIRECT REPORTS AND INDIRECT REPORTS ACROSS THE HR TEAM• ENSURING CLARITY AROUND PRIORITIES AND GOALS FOR THE ENTIRE FUNCTIONAL AREA• APPROVING REQUESTS FOR INVESTMENT TO A CERTAIN LEVEL OF AUTHORITY • MONITORING OF WORK AND PROVIDING CORRECTIVE ACTIONS WHERE NECESSARY• WORKING ACROSS FUNCTIONS WITH PEERS IN OTHER GROUPS TO ENSURE COLLABORATION FOR SHARED GOALS• WORKING WITH SR. MGMT AND OTHER PEERS FOR STRATEGY DEVELOPMENT AND EXECUTION PLANNING• COMMUNICATING FINANCIAL AND GOAL RESULTS AND KEY PERFORMANCE INDICATORS TO DIRECT REPORTSPROJECTS IN SUPPORT OF THE BUSINESS• DELEGATE PROJECT TASKS BASED ON JUNIOR STAFF MEMBERS’ INDIVIDUAL STRENGTHS, SKILL SETS AND EXPERIENCE LEVELS• TRACK PROJECT PERFORMANCE, SPECIFICALLY TO ANALYZE THE SUCCESSFUL COMPLETION OF SHORT- AND LONG-TERM GOALS• LEAD SPECIAL PROJECTS AND INITIATIVES AS REQUIRED• LEAD ORGANIC/INORGANIC GROWTH PROJECTS AS REQUIRED• LEAD DIVESTITURES/LOCATION SHUTDOWNS AS REQUIREDTALENT DEVELOPMENT• COORDINATE WITH ONBOARDING COORDINATORS, TECHNICAL TRAINERS, HSE AND HUMAN RESOURCES FOR NEW HOURLY EMPLOYEE ORIENTATION AND ONBOARDING, AS WELL AS, ASSESSING AND RECORDING PRIOR LEARNING AND CERTIFICATIONS FOR NEW EMPLOYEES• CONDUCT BEST PRACTICES RESEARCH, MEET POTENTIAL VENDORS AND MAKE RECOMMENDATIONS ON POLICIES, PROCESSES, FORMS, PROGRAMS AND SYSTEMS RELATED TO TECHNICAL TRAINING• MANAGE DEPARTMENT-LEVEL ADMINISTRATION OF TALENT AND LEARNING MANAGEMENT SYSTEMS FOR EMPLOYEE DEVELOPMENT IN TECHNICAL, NON-TECHNICAL, AND LEADERSHIP DEVELOPMENT SCHEDULING AND HISTORY REPORTING• LEAD THE SUCCESSION PLANNING PROCESS AND COLLABORATE TO SUPPORT THE MOBILITY OF TALENT TO MEET ORGANIZATIONAL GOALS. • AUDIT THE QUALITY AND EXECUTION OF THE DEPARTMENT'S APPROVED OBJECTIVES TO ENSURE TARGETED DEVELOPMENT GOALS ARE MET.  JOB REQUIREMENTS:• MINIMUM 10 YEARS’ EXPERIENCE IN A HUMAN RESOURCES INCLUDING AT LEAST 2 YEARS IN A LEADERSHIP ROLE• MINIMUM 3 YEARS’ EXPERIENCE AS A PRACTITIONER OF US LABOR RELATIONS IN A MANUFACTURING ENVIRONMENT.• BACHELOR’S DEGREE IN BUSINESS, HUMAN RESOURCES OR OTHER RELATED FIELD.• WORKING KNOWLEDGE OF US EMPLOYMENT-RELATED LEGISLATION - A MUST• WORKING KNOWLEDGE OF CANADIAN EMPLOYEMENT-RELATED LEGISLATION - PREFERRED• STRONG COMPUTER SKILLS INCLUDING FAMILIARITY WITH HUMAN RESOURCES MANAGEMENT SYSTEMS (SUCCESSFACTOR, ADP OR CERIDIAN) AND MICROSOFT OFFICE• BILINGUAL FLUENCY (ENGLISH/FRENCH/SPANISH) - PREFERRED• ABILITY TO TRAVEL WITHIN USA UP TO 30% OF THE TIME & 5% INTERNATIONALLY• EXPERIENCE PROVIDING SUPPORT TO A LARGE MULTI-SITE ORGANIZATION.• CPHR, SHRM DESIGNATION WOULD BE AN ASSET• LEADERSHIP OF A TEAM ACROSS MULTIPLE LOCATIONS.• EXPERIENCE LEADING AND MANAGING ORGANIZATIONAL CHANGES.• EXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLS.• STRONG ORGANIZATIONAL SKILLS AND ATTENTION TO DETAIL.• ABILITY TO DEVELOP POSITIVE WORKING RELATIONSHIPS WITH CUSTOMERS AND COWORKERS.• SELF-MOTIVATED, WITH THE ABILITY TO WORK INDEPENDENTLY.",
    "job_skill_set": [
      "Labor Relations",
      "Human Resources Management Systems",
      "Microsoft Office",
      "Bilingual (English/French/Spanish)",
      "Onboarding Processes",
      "Data Analysis",
      "Leadership",
      "Communication",
      "Problem Solving",
      "Teamwork",
      "Organizational Skills",
      "Coaching",
      "Relationship Building",
      "Self-Motivation",
      "Attention to Detail",
      "US Employment Law",
      "Talent Management Systems",
      "Project Management",
      "Succession Planning",
      "Change Management"
    ],
    "short_keywords": [
      "analysis",
      "attention",
      "bilingual",
      "building",
      "change",
      "coaching",
      "communication",
      "data",
      "detail",
      "employment",
      "englishfrenchspanish",
      "hr",
      "human",
      "labor",
      "law",
      "leadership",
      "management",
      "manager",
      "microsoft",
      "office",
      "onboarding",
      "organizational",
      "planning",
      "problem",
      "processes",
      "project",
      "relations",
      "relationship",
      "resources",
      "selfmotivation",
      "skills",
      "solving",
      "succession",
      "systems",
      "talent",
      "teamwork",
      "to",
      "us"
    ]
  },
  {
    "job_id": "3890898270",
    "job_title": "Human Resources Manager",
    "category": "HR",
    "job_description": "JOIN OUR DYNAMIC AND RAPIDLY EXPANDING GLOBAL SPORTING GOODS MANUFACTURING ORGANIZATION AT THE FOREFRONT OF INNOVATION AND EXCELLENCE. WE ARE DEDICATED TO FOSTERING A CULTURE OF GROWTH, COLLABORATION, AND INCLUSIVITY. WITH A PRESENCE ACROSS THE GLOBE, WE STRIVE TO MAKE A MEANINGFUL IMPACT ON THE WORLD WHILE PROVIDING EXCEPTIONAL OPPORTUNITIES FOR OUR EMPLOYEES.\nPOSITION OVERVIEW:WE ARE SEEKING A TALENTED AND EXPERIENCED HR MANAGER TO JOIN OUR TEAM AND PLAY A PIVOTAL ROLE IN SUPPORTING OUR ORGANIZATION'S GROWTH AND SUCCESS. THE IDEAL CANDIDATE WILL BE PASSIONATE ABOUT BUILDING AND MAINTAINING A POSITIVE WORKPLACE CULTURE, FOSTERING EMPLOYEE DEVELOPMENT, AND DRIVING HR INITIATIVES THAT ALIGN WITH OUR COMPANY'S VALUES AND OBJECTIVES.\nRESPONSIBILITIES:- DEVELOP AND IMPLEMENT HR STRATEGIES AND INITIATIVES ALIGNED WITH THE OVERALL BUSINESS STRATEGY- OVERSEE ALL ASPECTS OF THE EMPLOYEE LIFECYCLE, INCLUDING RECRUITMENT, ONBOARDING, PERFORMANCE MANAGEMENT, AND OFFBOARDING- DRIVE EMPLOYEE ENGAGEMENT INITIATIVES TO ENHANCE MORALE, PRODUCTIVITY, AND RETENTION- PROVIDE GUIDANCE AND SUPPORT TO MANAGERS AND EMPLOYEES ON HR-RELATED MATTERS, INCLUDING EMPLOYEE RELATIONS, CONFLICT RESOLUTION, AND COMPLIANCE- MANAGE AND RESOLVE COMPLEX EMPLOYEE RELATIONS ISSUES IN A FAIR AND CONSISTENT MANNER- ENSURE COMPLIANCE WITH RELEVANT EMPLOYMENT LAWS AND REGULATIONS ACROSS ALL JURISDICTIONS- LEAD AND PARTICIPATE IN HR PROJECTS AND INITIATIVES TO CONTINUOUSLY IMPROVE HR PROCESSES AND PRACTICES- COLLABORATE WITH CROSS-FUNCTIONAL TEAMS TO SUPPORT ORGANIZATIONAL GOALS AND OBJECTIVES\nQUALIFICATIONS:- BACHELOR'S DEGREE IN HUMAN RESOURCES, BUSINESS ADMINISTRATION, OR RELATED FIELD; MASTER'S DEGREE PREFERRED- 5+ YEARS OF PROGRESSIVE HR EXPERIENCE, WITH AT LEAST 2 YEARS IN A MANAGERIAL OR LEADERSHIP ROLE- STRONG KNOWLEDGE OF HR BEST PRACTICES, EMPLOYMENT LAWS, AND REGULATIONS- EXPERIENCE WORKING IN A GLOBAL OR MULTI-NATIONAL ORGANIZATION PREFERRED- EXCELLENT COMMUNICATION, INTERPERSONAL, AND LEADERSHIP SKILLS- PROVEN ABILITY TO BUILD RELATIONSHIPS AND INFLUENCE STAKEHOLDERS AT ALL LEVELS- DEMONSTRATED PROBLEM-SOLVING AND DECISION-MAKING ABILITIES- ABILITY TO THRIVE IN A FAST-PACED, DYNAMIC ENVIRONMENT AND MANAGE MULTIPLE PRIORITIES EFFECTIVELY\nBENEFITS:- COMPETITIVE SALARY COMMENSURATE WITH EXPERIENCE- COMPREHENSIVE HEALTH, DENTAL, AND VISION INSURANCE PLANS- GENEROUS VACATION AND PAID TIME OFF- RETIREMENT SAVINGS PLAN WITH EMPLOYER MATCH- PROFESSIONAL DEVELOPMENT AND TRAINING OPPORTUNITIES- FLEXIBLE WORK ARRANGEMENTS- VIBRANT AND INCLUSIVE COMPANY CULTURE\nIF YOU ARE PASSIONATE ABOUT MAKING A DIFFERENCE, THRIVE IN A COLLABORATIVE ENVIRONMENT, AND ARE COMMITTED TO EXCELLENCE, WE WANT TO HEAR FROM YOU! JOIN OUR TEAM AND BE PART OF A JOURNEY WHERE YOUR CONTRIBUTIONS TRULY MATTER.",
    "job_skill_set": [
      "HR strategies",
      "employee lifecycle management",
      "recruitment",
      "performance management",
      "employee relations",
      "compliance",
      "HR best practices",
      "problem-solving",
      "decision-making",
      "project management",
      "communication",
      "interpersonal skills",
      "leadership",
      "relationship building",
      "influencing stakeholders",
      "collaboration",
      "adaptability",
      "time management",
      "global HR experience"
    ],
    "short_keywords": [
      "adaptability",
      "best",
      "building",
      "collaboration",
      "communication",
      "compliance",
      "decisionmaking",
      "employee",
      "experience",
      "global",
      "hr",
      "human",
      "influencing",
      "interpersonal",
      "leadership",
      "lifecycle",
      "management",
      "manager",
      "performance",
      "practices",
      "problemsolving",
      "project",
      "recruitment",
      "relations",
      "relationship",
      "resources",
      "skills",
      "stakeholders",
      "strategies",
      "time"
    ]
  },
  {
    "job_id": "3904583492",
    "job_title": "VP of Human Resources Americas",
    "category": "HR",
    "job_description": "KEY LEADERSHIP ROLE RESPONSIBLE FOR OVERSEEING AND DRIVING THE TALENT STRATEGY AND INITIATIVES ACROSS THE AMERICAS REGIONLEAD THE HR TEAM IN NA AND LATAM, PROVIDE STRATEGIC GUIDANCE TO SENIOR LEADERS, AND IMPLEMENT BEST PRACTICES IN TALENT MANAGEMENT, EMPLOYEE RELATIONS, COMPENSATION AND BENEFITS, AND COMPLIANCE.CLIENT DETAILSOUR CLIENT IS GLOBAL LEADING COMPANY GROWING IN VERY FAST PACEDESCRIPTIONDEVELOP AND IMPLEMENT HR STRATEGIES ALIGNED WITH THE COMPANY'S BUSINESS GOALS AND OBJECTIVES.PROVIDE STRATEGIC DIRECTION AND GUIDANCE TO THE HR TEAM TO ENSURE THE EFFECTIVE DELIVERY OF HR SERVICES.SEARCHES AND IMPLEMENT IMPROVEMENTS IN HR PROCESSES AND SYSTEMS, INCLUDING AUTOMATION AND USE OF AI, TO ELEVATE PERFORMANCE AND PRODUCTIVITY.ACTS AS TRUE BUSINESS PARTNER TO THE BUSINESS LEADERS, PROVIDING SOUND ADVICE AND TALENT STRATEGIES TO ACCELERATE THE BUSINESS STRATEGY AND PERFORMANCE.LEAD TALENT ACQUISITION EFFORTS, ENSURING THE RECRUITMENT OF TOP TALENT TO SUPPORT BUSINESS GROWTH.OVERSEE PERFORMANCE MANAGEMENT PROCESSES, CONSEQUENCE MANAGEMENT, TALENT DEVELOPMENT INITIATIVES, AND SUCCESSION PLANNING.LEAD STRATEGIC EMPLOYMENT RELATED CONSULTATIONS AND NEGOTIATIONSPROFILESOLID EXPERIENCE IN CORPORATE HR AND PARTNERING WITH SENIOR EXECUTIVES.EXPERIENCE PROVIDING LEADERSHIP TO OTHERS REGARDING WORK RELATED SYSTEMS, PROCESSES AND CHALLENGES.JOB OFFERATTRACTIVE PACKAGERELOCATION COSTSINTERNATIONAL EXPOSURE\nMPI DOES NOT DISCRIMINATE ON THE BASIS OF RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, NATIONAL ORIGIN, AGE, DISABILITY, VETERAN STATUS, MARITAL STATUS, OR BASED ON AN INDIVIDUAL'S STATUS IN ANY GROUP OR CLASS PROTECTED BY APPLICABLE FEDERAL, STATE OR LOCAL LAW. MPI ENCOURAGES APPLICATIONS FROM MINORITIES, WOMEN, THE DISABLED, PROTECTED VETERANS AND ALL OTHER QUALIFIED APPLICANTS.",
    "job_skill_set": [
      "talent management",
      "employee relations",
      "compensation and benefits",
      "HR strategies",
      "talent acquisition",
      "performance management",
      "automation",
      "strategic guidance",
      "leadership",
      "business partnership",
      "communication",
      "negotiation",
      "problem solving",
      "team management",
      "adaptability",
      "compliance",
      "succession planning",
      "AI implementation"
    ],
    "short_keywords": [
      "acquisition",
      "adaptability",
      "ai",
      "americas",
      "and",
      "automation",
      "benefits",
      "business",
      "communication",
      "compensation",
      "compliance",
      "employee",
      "guidance",
      "hr",
      "human",
      "implementation",
      "leadership",
      "management",
      "negotiation",
      "of",
      "partnership",
      "performance",
      "planning",
      "problem",
      "relations",
      "resources",
      "solving",
      "strategic",
      "strategies",
      "succession",
      "talent",
      "team",
      "vp"
    ]
  },
  {
    "job_id": "3902347377",
    "job_title": "Director of Human Resources",
    "category": "HR",
    "job_description": "COMPANY DESCRIPTIONL+R HOTELS IS A GLOBAL PRIVATE INVESTMENT COMPANY HEADQUARTERED IN LONDON. OUR DIVERSE PORTFOLIO INCLUDES SELECT SERVICE HOTELS, AWARD-WINNING FIVE-STAR ASSETS, AND LEISURE RESORTS IN EXCLUSIVE LOCATIONS THROUGHOUT THE UK, CONTINENTAL EUROPE, THE US, AND THE CARIBBEAN. WE ARE COMMITTED TO CREATING LASTING VALUE FOR BOTH INVESTORS AND COMMUNITIES THROUGH INNOVATIVE AND ENTREPRENEURIAL APPROACHES. WITH PATIENT CAPITAL AND A FOCUS ON LONG-TERM VISION, WE RECOGNIZE AND BUILD ON THE STRENGTHS OF OUR PROPERTIES AND PEOPLE.\nROLE DESCRIPTIONTHIS IS A FULL-TIME, ON-SITE ROLE AS THE DIRECTOR OF HUMAN RESOURCES AT PALM HOUSE IN PALM BEACH, FL. PALM HOUSE, SET TO DEBUT Q4 2024 WITH ALL NEW PUBLIC SPACES, ROOMS, SUITES AND SIGNATURE CELEBRITY DINING, WILL RE-DEFINE THE RENOWNED PALM BEACH HOSPITALITY SCENE. WE ARE LOOKING FOR A DYNAMIC HR LEADER WHO CAN CHAMPION OUR CULTURE, HIRE AND DEVELOP THE NEXT GENERATION OF TALENT AND LEADERS. THE DIRECTOR OF HUMAN RESOURCES WILL BE RESPONSIBLE FOR OVERSEEING THE DAY-TO-DAY TASKS RELATED TO HR POLICIES, EMPLOYEE RELATIONS, PERFORMANCE MANAGEMENT, LABOR AND EMPLOYMENT LAW COMPLIANCE, AND OTHER HR FUNCTIONS. THEY WILL COLLABORATE WITH SENIOR MANAGEMENT TO DEVELOP AND IMPLEMENT STRATEGIC HR INITIATIVES AND ENSURE ALIGNMENT WITH ORGANIZATIONAL GOALS.\nQUALIFICATIONSSTRONG KNOWLEDGE AND EXPERIENCE IN HUMAN RESOURCES (HR) MANAGEMENTEXPERTISE IN HR POLICIES AND BEST PRACTICESPROVEN ABILITY IN EMPLOYEE RELATIONS AND CONFLICT RESOLUTIONEXPERIENCE IN PERFORMANCE MANAGEMENT AND TALENT DEVELOPMENTTHOROUGH UNDERSTANDING OF LABOR AND EMPLOYMENT LAWSEXCELLENT COMMUNICATION AND INTERPERSONAL SKILLSSTRONG ORGANIZATIONAL AND PROBLEM-SOLVING ABILITIESABILITY TO MAINTAIN CONFIDENTIALITY AND HANDLE SENSITIVE INFORMATIONRELEVANT CERTIFICATIONS IN HR OR RELATED FIELDS ARE A PLUSEXPERIENCE IN THE HOSPITALITY INDUSTRY IS PREFERREDBACHELOR'S DEGREE IN HUMAN RESOURCES, BUSINESS ADMINISTRATION, OR RELATED FIELD\nCOMPETITIVE COMPENSATION PACKAGE COMMENSURATE WITH EXPERIENCE, INCLUDING GENEROUS FTO POLICY, BONUS, HEALTH, DENTAL, VISION, LIFE INSURANCE AND MORE.\n \n",
    "job_skill_set": [
      "Human Resources Management",
      "Employee Relations",
      "Talent Development",
      "Confidentiality",
      "Hospitality Industry Experience",
      "Communication Skills",
      "Interpersonal Skills",
      "Organizational Skills",
      "Problem-Solving Skills",
      "Leadership",
      "HR Policies and Best Practices",
      "Performance Management",
      "Labor and Employment Law",
      "Relevant HR Certifications",
      "Bachelor's Degree in HR or Related Field",
      "Cultural Championing"
    ],
    "short_keywords": [
      "and",
      "bachelors",
      "best",
      "certifications",
      "championing",
      "communication",
      "confidentiality",
      "cultural",
      "degree",
      "development",
      "director",
      "employee",
      "employment",
      "experience",
      "field",
      "hospitality",
      "hr",
      "human",
      "in",
      "industry",
      "interpersonal",
      "labor",
      "law",
      "leadership",
      "management",
      "of",
      "or",
      "organizational",
      "performance",
      "policies",
      "practices",
      "problemsolving",
      "related",
      "relations",
      "relevant",
      "resources",
      "skills",
      "talent"
    ]
  },
  {
    "job_id": "3898167129",
    "job_title": "Human Resources Business Partner",
    "category": "HR",
    "job_description": "HUMAN RESOURCES BUSINESS PARTNER\nSEEKING EXPERIENCED HR PROFESSIONAL EXCITED ABOUT JOING A COLLABORATIVE AND GROWTH FOCUSED ENVIRONMENT. THIS IS THE IDEAL ROLE FOR A PROFESSIONAL WHOS SKILL SETS IS WORKING WITH CROSS FUNCTIONAL TEAMS TO ESTABLISH AND MEET STRATEGIC GOALS TO CONTINUE TO DRIVE THE COMPANY FORWARD. \n\nRESPONSIBILITIES:PROVIDE ANALYSIS, STRATEGIC DIRECTION, AND SUPPORT ON ALL ISSUES RELATED TO COMPENSATION/REWARDS, EMPLOYEE RELATIONS AND ENGAGEMENT, LEARNING AND DEVELOPMENT, TALENT ACQUISITION DE&I, ETCPARTNER WITH MANAGEMENT ACROSS THE ORGANIZATION TO PROVIDE COACHING AND GUIDANCE IN EMPLOYEE RELATIONS.SERVE AS SUBJECT MATTER EXPERT FOR ALL POLICIES AND PROCEDURES.CONTINUALLY ANALYZE STATISTICAL DATA AND REPORTS TO IDENTIFY TRENDS AND DRIVE CONTINUAL IMPROVEMENT.PARTNER WITH HR LEADERSHIP TO DEVELOP AND EXECUTE PEOPLE STRATEGY FOR NOT ONLY THE ORGANIZATION AND SPECIFIC BUSINESS UNITS.PROVIDE GUIDANCE ON EMPLOYMENT LAW AND COMPLIANCE.SUPPORT CLIENTS THROUGH MERGERS, ACQUISITIONS, LAYOFFS, ETC\n\nQUALIFICATIONS:5 PLUS YEARS’ EXPERIENCEPHR, SPHR, SHRM-CP, OR SHRM-SCP CERTIFICATION PREFERREDPROFICIENT IN MS OFFICE SUITE, AND EXPERIENCE WITH HRIS PLATFORMS\n\nEMPLOYMENT TYPE: FULL-TIMESCHEDULE: HYBRIDSALARY: BETWEEN $80,000- $100,000/YEAR BASED ON EXPERIENCETO LEARN MORE ABOUT THIS POSITION, PLEASE APPLY WITH YOUR CURRENT RESUME FOR IMMEDIATELY CONSIDERATION.",
    "job_skill_set": [
      "HRIS",
      "MS Office Suite",
      "Employee Relations",
      "Talent Acquisition",
      "Learning and Development",
      "Data Analysis",
      "Employment Law Compliance",
      "Coaching",
      "Collaboration",
      "Communication",
      "Problem Solving",
      "Adaptability",
      "Leadership",
      "Analytical Thinking",
      "Interpersonal Skills",
      "Conflict Resolution",
      "Compensation Analysis",
      "Strategic Planning"
    ],
    "short_keywords": [
      "acquisition",
      "adaptability",
      "analysis",
      "analytical",
      "and",
      "business",
      "coaching",
      "collaboration",
      "communication",
      "compensation",
      "compliance",
      "conflict",
      "data",
      "development",
      "employee",
      "employment",
      "hr",
      "hris",
      "human",
      "interpersonal",
      "law",
      "leadership",
      "learning",
      "ms",
      "office",
      "partner",
      "planning",
      "problem",
      "relations",
      "resolution",
      "resources",
      "skills",
      "solving",
      "strategic",
      "suite",
      "talent",
      "thinking"
    ]
  },
  {
    "job_id": "3901392513",
    "job_title": "Human Resources Generalist",
    "category": "HR",
    "job_description": "GENERAL SUMMARY HUMAN RESOURCES POSITION RESPONSIBLE FOR FULL SERVICE HUMAN RESOURCES MANAGEMENT FOR BOTH HOURLY AND SALARIED EMPLOYEES, UNDER THE OVERSIGHT OF THE SR. HUMAN RESOURCES MANAGER FOR THE FACILITY.  DUTIES & RESPONSIBILITIES EMPLOYEE RELATIONS – COORDINATES AND CONDUCTS ORIENTATION AND ONBOARDING PROGRAM FOR NEW HIRES. PROMOTES OPEN DOOR POLICY AND AN ENVIRONMENT FREE OF ORGANIZED LABOR THROUGH EFFECTIVE POSITIVE EMPLOYEE RELATIONS. PLANS, MANAGES, AND TRACKS EMPLOYEE RECOGNITION AND INCENTIVE PROGRAMS. COORDINATES AND LEADS EMPLOYEE ENGAGEMENT CHAMPIONS TO DELIVER QUALITY AND MEANINGFUL ACTIVITIES FOR EMPLOYEES AND THE COMMUNITY. PLANS, PREPARES AND MAINTAINS EMPLOYEE COMMUNICATION CENTERS UTILIZING VARIOUS MEDIA SUCH AS NEWSLETTER, POSTERS, AND MEMORANDUMS. CONDUCTS INVESTIGATIONS, PREPARES INVESTIGATIVE REPORTS AND MAKES RECOMMENDATIONS TO RESOLVE EMPLOYEE ISSUES BASED ON POLICY, PAST PRACTICE AND LEGAL JUSTIFICATIONS. ASSISTS SUPERVISORS TO FORMULATE DISCIPLINARY ACTIONS. CONDUCTS EXIT INTERVIEWS AND MAKE RECOMMENDATIONS BASED ON TRENDS OR NOTABLE COMMENTS FOR ADVISING MANAGEMENT FOR IMPROVEMENT.STAFFING – PLANS AND COORDINATES RECRUITMENT OF NON-EXEMPT APPLICANTS, DEVELOPS AND RECOMMENDS RECRUITING STRATEGIES. SELECTS APPLICANTS FOR INTERVIEWS AND PROVIDES SUPPORT FOR MANAGEMENT PERFORMING THE STEPS OF THE INTERVIEWING AND JOB OFFER PROCESSES AS WELL AS THE AUTOMATED ON-BOARDING PROCESS. MANAGES INTERNAL JOB POSTING PROCESS AND DOCUMENTATION. PARTNERS WITH CONTRACTED AGENCIES TO ALIGN TEMPORARY STAFFING TO MEET BUSINESS NEEDS.PROCESS MANAGEMENT – RESPONSIBLE FOR MAINTAINING HUMAN RESOURCES RECORDS AND LEADS CLERICAL STAFF IN RECORDS MANAGEMENT. PREPARES VARIOUS REPORTS FROM DATA BASES AND SPREADSHEETS FOR THE REPORTING OF STAFF MANAGEMENT. MAINTAINS BUDGET AND EXPENSE CONTROL. MONITORS SUPERVISOR COMPLIANCE TO RECORD MANAGEMENT REQUIREMENTS. AUDITS HUMAN RESOURCES RECORDS TO INSURE DATA INTEGRITY. MAINTAINS LEAVES OF ABSENCES AT THE LOCAL LEVEL IN PARTNERSHIP WITH THIRD PARTY AND STORE SUPPORT CENTER (SSC) STAFF. PREPARES WITNESS DOCUMENTATION AND TESTIFIES AT UNEMPLOYMENT HEARINGS. ADVISES MANAGEMENT ON LEGAL/POLICY COMPLIANCE. MAINTAINS NON-EXEMPT HR STAFF TIME AND ATTENDANCE RECORDS. LEADS NON-EXEMPT HR STAFF IN JOB DUTIES AND PROJECTS. RECOMMENDS AND COORDINATES EMPLOYEE RECOGNITION PROGRAMS AND CELEBRATIONS. ASSISTS HR MANAGER IN PREPARING ANNUAL BUDGET AND MONTHLY EXPENDITURES REPORTS. WORKS DAYS, SHIFTS AND OURS NECESSARY TO ACCOMPLISH OBJECTIVES.TRAINING – PREPARES AND FACILITATES HR LEADERSHIP TRAINING FOR INTERVIEWING, EQUAL EMPLOYMENT OPPORTUNITY, DIVERSITY, FAIR LABOR STANDARDS AND INTERNAL POLICIES. MANAGES FACILITY CERTIFICATION PROGRAMS FOR HOURLY AND SALARIED EMPLOYEES, TO INCLUDE PERFORMANCE MANAGEMENT, LEARNING PLANS AND BIZ LIBRARY PARTICIPATION. TAKES LEAD IN PREPARING AND TRAINING STAFF ON SPECIAL PROJECTS AND PILOT PROGRAMS.COMPLIANCE – MONITORS AND RECOMMENDS ACTIONS TO COMPLY WITH STATE AND FEDERAL EMPLOYMENT LAW AND COMPANY POLICY. PROVIDES ORIENTATION TO NEW EMPLOYEES REGARDING REQUIRED COMPLIANCE. MAINTAINS EMPLOYMENT POSTERS IN COMPLIANCE.SAFETY - ACTIVE ON SAFETY TEAM AND PARTICIPATES IN ACCIDENT REVIEWS. MONITORS COMPLIANCE OF REPORTING REQUIREMENTS AND MAKES RECOMMENDATIONS FOR CORRECTIVE ACTIONS. KNOWLEDGE, SKILLS AND ABILITIES (KSAS):  THOROUGH KNOWLEDGE OF HUMAN RESOURCE PRINCIPLES AND PRACTICES INCLUDING POSITIVE EMPLOYEE RELATIONS, HIRING, TRAINING, PERFORMANCE MANAGEMENT, AND EMPLOYMENT LAW ABILITY TO BUILD EFFECTIVE WORKING RELATIONSHIPS AT ALL LEVELS OF AN ORGANIZATION SKILLS IN RESEARCHING FOR LEGAL COMPLIANCE AND ANALYTIC ABILITY TO FORMULATE BEST PRACTICESEFFECTIVE ORAL AND WRITTEN COMMUNICATION SKILLS, AND ABILITY TO EFFECTIVELY PRESENT REPORTS TO MANAGEMENT COMPUTERS SKILLS: WORD, EXCEL, ACCESS, OUTLOOK AND HRIS SUCH AS LAWSON, KRONOS AND SHAREPOINT. WORK EXPERIENCE &/OR EDUCATION:KNOWLEDGE AND SKILL ARE NORMALLY ACQUIRED THROUGH POST-SECONDARY EDUCATION AT THE BACHELOR’S LEVEL IN AREAS SUCH AS HUMAN RESOURCES MANAGEMENT, INDUSTRIAL PSYCHOLOGY AND BUSINESS ADMINISTRATION.AT LEAST THREE TO FIVE YEARS IN A PROGRESSIVELY RESPONSIBLE HUMAN RESOURCE GENERALIST POSITION IF NO COLLEGE DEGREE; OR AT LEAST THREE YEARS IN A PROFESSIONAL OR MANAGERIAL HUMAN RESOURCES POSITION WITH A BACHELOR’S DEGREE.PROFESSIONAL HUMAN RESOURCES CERTIFICATION (OR DEMONSTRATED PROGRESS TOWARDS CERTIFICATION) PREFERRED BUT NOT REQUIRED.",
    "job_skill_set": [
      "human resources management",
      "employee relations",
      "recruitment",
      "training",
      "data analysis",
      "budget management",
      "report writing",
      "communication",
      "relationship building",
      "problem solving",
      "teamwork",
      "analytical thinking",
      "leadership",
      "adaptability",
      "organizational skills",
      "compliance",
      "performance management",
      "HRIS (Lawson, Kronos, SharePoint)",
      "Microsoft Word",
      "Microsoft Excel",
      "Microsoft Access",
      "Microsoft Outlook",
      "conflict resolution"
    ],
    "short_keywords": [
      "access",
      "adaptability",
      "analysis",
      "analytical",
      "budget",
      "building",
      "communication",
      "compliance",
      "conflict",
      "data",
      "employee",
      "excel",
      "generalist",
      "hr",
      "hris",
      "human",
      "kronos",
      "lawson",
      "leadership",
      "management",
      "microsoft",
      "organizational",
      "outlook",
      "performance",
      "problem",
      "recruitment",
      "relations",
      "relationship",
      "report",
      "resolution",
      "resources",
      "sharepoint",
      "skills",
      "solving",
      "teamwork",
      "thinking",
      "training",
      "word",
      "writing"
    ]
  },
  {
    "job_id": "3903839290",
    "job_title": "Human Resources Workforce Support Specialist",
    "category": "HR",
    "job_description": "COMPANY DESCRIPTION\n\nVESTCOM IS THE INDUSTRY LEADER IN TECHNOLOGY-DRIVEN SHELF-EDGE SOLUTIONS FOR RETAILERS AND CPGS. OUR DATA-INTEGRATED MEDIA SOLUTIONS DRIVE SALES AND LOYALTY, ENGAGING SHOPPERS WHERE IT MATTERS MOST – THE POINT OF DECISION. OUR PATENTED INNOVATION HAS BEEN TRUSTED BY TOP RETAILERS FOR MORE THAN 30 YEARS TO DRIVE PRODUCTIVITY AND PROFITABLE GROWTH. FOR OUR GROWING TEAM OF OVER 1000 EMPLOYEES, VESTCOM OFFERS THE STABILITY OF AN ESTABLISHED COMPANY WITH THE ENTREPRENEURIAL SPIRIT AND FAST-PACED ENVIRONMENT OF A START-UP.\n\nVESTCOM’S CORE VALUES ARE AT THE HEART OF OUR ORGANIZATION, REPRESENTING OUR FUNDAMENTAL BELIEFS AND SERVING AS OUR GUIDING LIGHT IN FOR HOW WE CONDUCT BUSINESS AND INTERACT WITH EACH OTHER.\n\nOUR TEAMS - OUR COLLEAGUES AND OUR CLIENT DEFINE OUR TEAM.OUR INTEGRITY - OUR COLLEAGUES AND CLIENTS RELY UPON US TO DELIVER.OUR INGENUITY - OUR COLLEAGUES AND CLIENTS LOOK TO US FOR UNIQUE SOLUTIONS.OUR PERFORMANCE - OUR COLLEAGUES AND CLIENTS TEAM WITH US TO WIN.\n\n\nVESTCOM IS A STANDALONE BUSINESS UNIT OF AVERY DENNISON, A FORTUNE 500 LEADER IN MATERIALS SCIENCE AND PACKAGING MATERIALS. LEARN MORE AT WWW.VESTCOM.COM.\n\nJOB DESCRIPTION\n\nOPPORTUNITY\n\nTHE HUMAN RESOURCES WORKFORCE SUPPORT SPECIALIST WILL DIRECTLY SUPPORT EMPLOYEES AND LEADERS WITH DAY TO DAY HR SUPPORT. THEY WILL SUPPORT HR POLICIES, PROCEDURES AND PROGRAMS OF A SPECIFIC GROUP OF SITES/FUNCTIONS IN THE US. THEY WILL HAVE PRIMARY SUPPORT ASSIGNMENTS BUT WILL BE ABLE TO SUPPORT ACROSS MULTIPLE GROUPS/SITES AS NEEDED. REPORTING TO THE US WORKFORCE SUPPORT MANAGER, THIS INDIVIDUAL WILL BE THE MAIN POINT OF CONTACT FOR EMPLOYEES AND MANAGERS REGARDING EMPLOYEE RELATIONS INQUIRIES FOR THEIR REGION.\n\nKEY AREAS OF RESPONSIBILITY\n\nPROVIDES POSITIVE EMPLOYEE RELATIONS & MANAGER CAPABILITY SUPPORT ACROSS OUR SITES. USE OBSERVATIONS AND DATA TO RECOMMEND ER STRATEGIES AND INITIATIVES THAT WILL SUPPORT EMPLOYEE MORALE AND ENGAGEMENT. WORKS IN STRONG COLLABORATION WITH OTHER WORKFORCE SUPPORT TIERS TO ENSURE EMPLOYEE INQUIRIES AND ISSUES ARE RESOLVED IN A TIMELY, FRIENDLY AND COMPREHENSIVE WAY. SUPPORTS EMPLOYEES AND MANAGERS W/TRADITIONAL SUPPORT TYPE OF ACTIVITIES SUCH AS PROMOTIONS, INVESTIGATIONS, CORRECTIVE ACTIONS, PIPS TERMS, AND RESTRUCTURING ACTIVITIES.MAIN POINT OF CONTACT FOR EMPLOYEES FOR HR RELATED INQUIRIES, COMPLAINTS AND CUSTOMER SERVICE (E.G. CASE MANAGEMENT, POLICY OR PROTOCOL NAVIGATION).PRIMARY LIAISON WITH HR WORKFORCE SUPPORT LEADERSHIP REGARDING POLICY REVIEWS, POLICY IMPROVEMENTS, TRAINING OPPORTUNITIES ETC. SUPPORT LEADERS ON FINDING AND USING RESOURCES ON CORE PROCESSES SUCH AS GPS, PERFORMANCE MANAGEMENT, DEVELOPMENT ETC. COACH EMPLOYEES LEADERS AS NEEDED ON HOW TO NAVIGATE AND RESOLVE KEY LEADERSHIP PROCESSES, MANAGING CONFLICTS ETC. BUILD AND MAINTAIN RELATIONSHIPS & PARTNERSHIPS WITH ASSIGNED SITES/GROUPS.MASTER OUR DIGITAL TOOLSET, IN PARTICULAR AD.A/SERVICENOW. SUPPORT AND RESOLVE REGIONAL EMPLOYEE RELATIONS ISSUES USING SERVICENOW. CONTINUALLY LOOK FOR WAYS TO USE TECHNOLOGY TO AID HR AND EE EXPERIENCE.SUPPORT KEY PROJECTS FOCUSED ON NEW PROCESS OR CAPABILITY DEVELOPMENT/ENHANCEMENT. \n\n\nQUALIFICATIONS\n\nKEY QUALIFICATIONS\n\nBACHELOR'S DEGREE IN HUMAN RESOURCES, BUSINESS, OR RELATED FIELD REQUIRED.AT LEAST ONE TO FOUR YEARS OF RELATED EXPERIENCE REQUIRED.THE ROLE WILL REQUIRE OCCASIONAL TRAVEL TO VARIOUS MANUFACTURING SITES ACROSS THE US.EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS.THOROUGH UNDERSTANDING OF HUMAN RESOURCES AND LABOR RELATIONS PRINCIPLES, PRACTICES, AND PROCEDURES.ABILITY TO MANAGE MULTIPLE PRIORITIES/CASES AT ONCE, KNOWING WHEN TO REACH OUT FOR SUPPORT AND ESCALATE AS NEEDED. ABILITY TO SUCCESSFULLY USE DIGITAL CASE MANAGEMENT AND WORKFLOW MANAGEMENT TOOLS TO COMPLETE CORE ACTIVITIES.ABILITY TO DEVELOP AND MAINTAIN POSITIVE RELATIONSHIPS WITH EMPLOYEES, FUNCTIONAL LEADERS, AND OTHER STAKEHOLDERS.ABILITY TO COMPILE, RESEARCH, AND ANALYZE INFORMATION.ABILITY TO COMPOSE AND PRESENT COMPREHENSIVE REPORTS.\n\n\nADDITIONAL INFORMATION\n\nADDITIONAL REQUIREMENTS\n\nCOMPLIANCE WITH COMPANY POLICIES CONCERNING MAINTAINING A DRUG FREE WORKPLACE IS REQUIREDCOMPLIANCE WITH ALL COMPANY POLICIES IS REQUIRED INCLUDING ALL SAFETY POLICIES AND PROCEDURES \n\n\nSUPERVISORY RESPONSIBILITIES\n\nNONE.\n\nMANAGEMENT DISCLAIMER\n\nVESTCOM’S MANAGEMENT RESERVES THE RIGHT TO REVISE, CHANGE OR MODIFY THE DUTIES AND RESPONSIBILITIES OF THIS POSITION AT ANY TIME TO MEET BUSINESS AND ORGANIZATIONAL NEEDS. THIS POSITION DESCRIPTION MAY NOT LIST ALL DUTIES FOR THIS POSITION. THE INCUMBENT IN THIS POSITION MAY BE ASKED TO PERFORM OTHER DUTIES. THIS POSITION DESCRIPTION IS NOT A CONTRACT FOR EMPLOYMENT AND EITHER THE INCUMBENT OR VESTCOM MAY TERMINATE EMPLOYMENT AT ANY TIME, FOR ANY REASON.",
    "job_skill_set": [
      "Human Resources",
      "Employee Relations",
      "Policy Navigation",
      "Performance Management",
      "Bachelor's Degree",
      "Communication",
      "Collaboration",
      "Problem Solving",
      "Relationship Building",
      "Time Management",
      "Adaptability",
      "Coaching",
      "Customer Service",
      "Digital Case Management",
      "Data Analysis",
      "Conflict Management",
      "Servicenow",
      "Report Writing",
      "Research Skills"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "bachelors",
      "building",
      "case",
      "coaching",
      "collaboration",
      "communication",
      "conflict",
      "customer",
      "data",
      "degree",
      "digital",
      "employee",
      "hr",
      "human",
      "management",
      "navigation",
      "performance",
      "policy",
      "problem",
      "relations",
      "relationship",
      "report",
      "research",
      "resources",
      "service",
      "servicenow",
      "skills",
      "solving",
      "specialist",
      "support",
      "time",
      "workforce",
      "writing"
    ]
  },
  {
    "job_id": "3901932974",
    "job_title": "Human Resources Generalist",
    "category": "HR",
    "job_description": "HR GENERALIST WILL BE RESPONSIBLE FOR PROVIDING ON-GOING HR OPERATIONAL GUIDANCE AND FUNCTIONAL EXPERTISE, AS WELL AS ADMINISTRATIVE AND PROFESSIONAL LEVEL SUPPORT ACTIVITIES IN THE AREAS OF EMPLOYEE RELATIONS, TALENT ACQUISITION, HR COMPLIANCE, HRIS MAPPING AND INTEGRITY, COACHING AND COUNSELING. THE GENERALIST WILL SUPPORT, FACILITATE, AND INFLUENCE IN PRIMARY FUNCTIONAL AREAS INCLUDING BUT NOT LIMITED TO EMPLOYEE RELATIONS, PERFORMANCE AND TALENT MANAGEMENT, EMPLOYEE AND MANAGER TRAINING AND OTHER CRITICAL HR ACTIVITIES ON A DAY-TO-DAY BASIS.\nJOB RESPONSIBILITIES: • OVERSEEING HRIS DATABASE SOFTWARE AND COMPUTER SYSTEMS: O COLLECTS AND ANALYZES DATA TO IMPROVE HR PROCESSES. O ANALYZING HRIS SYSTEMS AND RESOLVING ISSUES. O SUPPORTING USER ACCOUNTS AND PERFORMING HRIS TRAINING. O PROCESSING EMPLOYEE DATA, GENERATING HR-RELATED REPORTS, AND MAINTAINING DATA INTEGRITY.• SERVE AS POINT OF CONTACT FOR EMPLOYEE INQUIRIES REGARDING HUMAN RESOURCE PROGRAMS, PROCESSES, AND POLICIES. ENSURE PROGRAMS, PROCESSES, POLICIES, AND PRACTICES ARE ADMINISTERED IN A FAIR AND CONSISTENT MANNER. ESCALATES COMPLEX ISSUES TO HRM.• SUPPORT CANADIAN EMPLOYEE POPULATION WITH HR MANAGER SUPPORT.• ADMINISTERS VARIOUS HUMAN RESOURCE PROGRAMS AND ASSISTS IN THE DEVELOPMENT AND IMPLEMENTATION OF EMPLOYEE POLICIES AND PROCEDURES.• PARTNERS WITH TALENT ACQUISITION TEAM ON RECRUITMENT AND INTERVIEWING.• SUPPORT CAREER GROWTH, PERFORMANCE, DEVELOPMENT AND COACHING FOR YOUR DIRECT TEAM AND MANAGERS.• LEADS AND/OR PARTICIPATES IN HR TRANSFORMATION PROJECTS, BUSINESS INITIATIVES AND SPECIAL PROJECTS AS ASSIGNED.• FACILITATES AND PROVIDES TRAINING TO WORKFORCE, INCLUDING MANAGER TRAINING.• SUPPORTS EMPLOYEE RELATIONS ISSUES, E.G., DISCIPLINARY AND PERFORMANCE IMPROVEMENT PLAN SUPPORT.• ENGAGEMENT AND RETENTION; ENSURE ENGAGEMENT AND COMMUNICATION ACTIONS ARE IN PLACE WORKING IN PARTNERSHIP WITH THE MANAGERS AND PROACTIVELY IDENTIFY AND ADDRESS RETENTION RISKS.\nJOB REQUIREMENTS: • BACHELOR’S DEGREE, PREFERABLY IN BUSINESS AND/OR HUMAN RESOURCES.• EXPERIENCE WITH HRIS SYSTEMS REQUIRED.• 3 YEARS OF HUMAN RESOURCE EXPERIENCE, PREFERABLY IN A MANUFACTURING OR SALES ENVIRONMENT.• EXCEPTIONAL ORGANIZATIONAL SKILLS AND ABILITY TO WORK IN A FAST-PACED ENVIRONMENT.• SELF-MOTIVATED WITH AN ABILITY TO WORK INDEPENDENTLY, PRIORITIZE WORKLOADS AND COMPLETE TASKS IN A QUALITY MANNER WITH ATTENTION TO DETAIL. • EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS; STRONG INTERPERSONAL AND FACILITATION SKILLS.• EXPERIENCE WITH SAP PREFERRED.• STRONG CLIENT-SUPPORT ORIENTATION, AND THE ABILITY TO WORK EFFECTIVELY WITH ALL LEVELS OF THE ORGANIZATION.• ABILITY TO MAINTAIN THE HIGHEST LEVEL OF CONFIDENTIALITY.• PROFICIENT COMPUTER SKILLS, INCLUDING MICROSOFT OFFICE AND HRIS TOOLS.\nTHE RIGHT CANDIDATE IF YOU ARE ALIGNED TO OUR VALUES AND CULTURE: • COLLABORATIVE ENTREPRENEURIAL SPIRIT • WINNING THROUGH CUSTOMERS • HIGH ETHICAL STANDARDS, OPENNESS AND TRUST • EXPECTATIONS FOR RESULTS • RESPECT AND VALUE PEOPLE  IF YOU BELIEVE YOU MATCH OUR VALUES AND HAVE THE EXPERIENCE WE’RE LOOKING FOR, APPLY! WE CAN’T WAIT TO HEAR FROM YOU!",
    "job_skill_set": [
      "data analysis",
      "employee relations",
      "talent acquisition",
      "performance management",
      "Microsoft Office",
      "SAP",
      "HR compliance",
      "report generation",
      "communication",
      "interpersonal skills",
      "organizational skills",
      "confidentiality",
      "collaboration",
      "problem-solving",
      "attention to detail",
      "HRIS systems",
      "training facilitation",
      "self-motivation",
      "facilitation",
      "client support orientation"
    ],
    "short_keywords": [
      "acquisition",
      "analysis",
      "attention",
      "client",
      "collaboration",
      "communication",
      "compliance",
      "confidentiality",
      "data",
      "detail",
      "employee",
      "facilitation",
      "generalist",
      "generation",
      "hr",
      "hris",
      "human",
      "interpersonal",
      "management",
      "microsoft",
      "office",
      "organizational",
      "orientation",
      "performance",
      "problemsolving",
      "relations",
      "report",
      "resources",
      "sap",
      "selfmotivation",
      "skills",
      "support",
      "systems",
      "talent",
      "to",
      "training"
    ]
  },
  {
    "job_id": "3905339352",
    "job_title": "Senior Human Resources Clerk",
    "category": "HR",
    "job_description": "ABOUT THE POSITION\n\nTHE RIVERSIDE COUNTY PROBATION DEPARTMENT SEEKS TO FILL TWO SENIOR HUMAN RESOURCES CLERK VACANCIES FOR THEIR ADMINISTRATION AND BACKGROUND UNITS LOCATED IN RIVERSIDE. THE SENIOR HUMAN RESOURCES CLERK PERFORMS THE MOST DIFFICULT CLERICAL FUNCTIONS WHICH ARE ENCOMPASSED IN THE ADMINISTRATION OF COUNTY HUMAN RESOURCES (HR) PROGRAMS, AND SERVES IN A LEAD CAPACITY OVER OTHERS IN THE PERFORMANCE OF THE WORK; PROVIDES LEAD SUPERVISION AND COORDINATES THE PROCESSING OF HR TRANSACTION FORMS, EMPLOYEE INSURANCE FORMS, PAYROLL ATTENDANCE REPORTS, AND MAINTENANCE OF HUMAN RESOURCES RECORDS; INTERPRETS AND APPLIES COMPLEX RULES AND REGULATIONS; SERVES AS THE RESOURCE SPECIALIST AND REPRESENTATIVE TO OPERATING DEPARTMENTS OF AN HR PROGRAM AND FUNCTION; PERFORMS OTHER RELATED DUTIES AS REQUIRED.\n\nCOMPETITIVE CANDIDATES WILL POSSESS EXPERIENCE WORKING IN THE AREAS OF RECRUITMENT PROCESSING, ONBOARDING, EMPLOYEE BENEFITS AND LEAVE ADMINISTRATION, AS WELL AS PAYROLL PRACTICES IN EITHER A LEAD OR SUPERVISORY CAPACITY. THIS EXPERIENCE SHOULD BE ADAMANTLY DISPLAYED ON BOTH APPLICATION AND RESUME.\n\nTHE SENIOR HUMAN RESOURCES CLERK IS THE LEAD LEVEL CLASSIFICATION IN THE HUMAN RESOURCES CLERK SERIES AND REPORTS TO AN APPROPRIATE SUPERVISORY OR MANAGER LEVEL POSITION. INCUMBENTS PROVIDE LEAD SUPERVISION TO HUMAN RESOURCES CLERKS AND CLERICAL SUPPORT STAFF. IN THE HUMAN RESOURCES DEPARTMENT, THE SENIOR HUMAN RESOURCES CLERK IS ALSO RESPONSIBLE FOR MAINTAINING AN EFFECTIVE WORKFLOW WITHIN ONE OR MORE HR PROGRAM FUNCTIONS, (E.G., RETIREMENT AND HEALTH PLAN PROGRAMS). IN OPERATING DEPARTMENTS, THE POSITION IS ALSO RESPONSIBLE FOR PROVIDING CLERICAL HR SUPPORT FOR ADMINISTRATIVE AND OTHER DEPARTMENT STAFF. INCUMBENTS EXERCISE CONSIDERABLE INDEPENDENCE IN SETTING PERSONAL WORK PRIORITIES. THE SENIOR HUMAN RESOURCES CLERK IS DISTINGUISHED FROM DEPARTMENT HUMAN RESOURCES COORDINATOR IN THAT THE FORMER’S RESPONSIBILITIES DO NOT INVOLVE COORDINATION OF THE FULL RANGE OF HR ACTIVITIES.\n\nMEET THE TEAM!\n\nTHE RIVERSIDE COUNTY PROBATION DEPARTMENT IS A PROGRESSIVE CRIMINAL JUSTICE AGENCY THAT BELIEVES IN CONTINUOUS IMPROVEMENT, SEARCHING AND APPLYING EVIDENCE-BASED AND BEST PRACTICES, USING MEASURABLE OUTCOMES TO EVALUATE PROGRAMS, AND DOING OUR UTMOST TO FULFILL OUR MISSION AND MAKE RIVERSIDE COUNTY A SAFE AND LAW-ABIDING COMMUNITY FOR ITS CITIZENS. WE RECOGNIZE THE VALUE OF A QUALIFIED, PROFESSIONAL, DYNAMIC, AND DIVERSE WORKFORCE AND IN BUILDING AN ORGANIZATION THAT REFLECTS THE PROGRESSIVE COMMUNITY WE SERVE.\n\nEXAMPLES OF ESSENTIAL DUTIES\n\n PROVIDE LEAD SUPERVISION AND OVERSEE THE PROCESSING OF HR RECORDS. TRAIN, ADVISE AND REVIEW THE WORK OF EMPLOYEES PERFORMING CLERICAL HR FUNCTIONS. PROCESS ENROLLMENTS AND CHANGES IN EMPLOYEE BENEFITS; SET UP PROCEDURES FOR PERFORMING EMPLOYEE BENEFIT TRANSACTIONS; MAINTAIN HR RECORDS; DESIGN FORMS. ASSIST LINE DEPARTMENTS IN THE PROCESSING OF BENEFIT ENROLLMENT, CHANGES IN EMPLOYEE BENEFITS, PREPARATION OF HR TRANSACTIONS, AND INTERPRETATION OF HR POLICIES, PROCEDURES AND REGULATIONS. DETERMINE WHETHER EMPLOYEES QUALIFY FOR HR BENEFITS ON THE BASIS OF COMPLEX RULES. RESEARCH AND INFORM EMPLOYEES AND/OR ADMINISTRATIVE STAFF ABOUT HR POLICIES AND PROCEDURES AND BENEFIT INFORMATION. DETERMINE OWN WORK PRIORITIES TO MEET DEADLINES. COORDINATE THE IMPACT OF EMPLOYEE ELIGIBILITY OR CHANGE OF STATUS IN BENEFIT PROGRAMS WITH OTHER DIVISIONS, DEPARTMENTS AND ORGANIZATIONS. COMPILE AND CALCULATE DATA AND VERIFY ITS ACCURACY; PREPARE REPORTS AND RECOMMENDATIONS. ADVISE EMPLOYEES AT ALL ORGANIZATIONAL LEVELS OF THE PROCEDURAL PROCESSES OF HR PROGRAMS (E.G., PUBLIC EMPLOYEES' RETIREMENT SYSTEM (PERS)) AND THE BENEFITS AND REQUIREMENTS OF HEALTHCARE PROGRAMS. ASSIST EMPLOYEES IN IDENTIFYING AND COMPARING BENEFIT OPTIONS; INFORM NEW EMPLOYEES OF COUNTY AND DEPARTMENTAL POLICIES AND PROCEDURES REGARDING HR AND PAYROLL REPORTING REQUIREMENTS.\n\nMINIMUM QUALIFICATIONS\n\nOPTION I\n\nEXPERIENCE: THREE YEARS OF CLERICAL EXPERIENCE WHICH MUST HAVE INCLUDED AT LEAST ONE YEAR OF PRIMARILY PERFORMING HR CLERICAL PROCESSES AND WORKING WITH HR RULES AND REGULATIONS.\n\nOPTION II\n\nEXPERIENCE: THREE YEARS OF CLERICAL EXPERIENCE WHICH MUST HAVE INCLUDED AT LEAST ONE YEAR OF PRIMARILY PERFORMING HR CLERICAL PROCESSES AND WORKING WITH HR RULES AND REGULATIONS. (COMPLETION OF 18 SEMESTER OR 27 QUARTER UNITS FROM AN ACCREDITED COLLEGE OR UNIVERSITY IN SECRETARIAL SCIENCES, OFFICE PRACTICES, BUSINESS EDUCATION, OR A CLOSELY RELATED FIELD MAY SUBSTITUTE FOR ONE YEAR OF THE GENERAL CLERICAL EXPERIENCE.)\n\nOPTION III\n\nEXPERIENCE: THREE YEARS OF CLERICAL EXPERIENCE WHICH MUST HAVE INCLUDED AT LEAST ONE YEAR OF PRIMARILY PERFORMING HR CLERICAL PROCESSES AND WORKING WITH HR RULES AND REGULATIONS. (COMPLETION OF 360 HOURS OF TRAINING FROM A RECOGNIZED OCCUPATIONAL TRAINING PROGRAM IN SECRETARIAL SCIENCES, BUSINESS EDUCATION, OR A CLOSELY RELATED FIELD MAY SUBSTITUTE FOR ONE YEAR OF THE GENERAL CLERICAL EXPERIENCE.)\n\nALL OPTIONS\n\nKNOWLEDGE OF: LAWS, RULES, REGULATIONS, AND PROCEDURES PERTAINING TO HR PRACTICES; HR AND PAYROLL RECORDKEEPING PRACTICES; HR PROCEDURES AND FORMS USED TO EFFECT CHANGES IN EMPLOYEE BENEFITS; OFFICE PRACTICES AND PROCEDURES, INCLUDING PREPARING CORRESPONDENCE AND REPORTS, FILING AND OPERATING ELECTRONIC OFFICE EQUIPMENT.\n\nABILITY TO: COACH OTHER EMPLOYEES IN HR CLERICAL WORK; INTERPRET, APPLY AND EXPLAIN COMPLEX RULES, PROCEDURES AND GUIDELINES; DEVELOP AND MODIFY CLERICAL PROCEDURES AND HR RECORDKEEPING SYSTEMS; WORK INDEPENDENTLY IN THE ABSENCE OF SPECIFIC INSTRUCTIONS; COMPILE AND ORGANIZE DATA AND PREPARE STATISTICAL AND OTHER REPORTS; WORK EFFECTIVELY WITH EMPLOYEES AT ALL ORGANIZATIONAL LEVELS AND THE PUBLIC; SPEAK AND WRITE EFFECTIVELY; TYPE 45 NET WORDS PER MINUTE.\n\nSUPPLEMENTAL INFORMATION\n\nVETERAN'S PREFERENCE \n\nTHE COUNTY HAS A VETERAN'S PREFERENCE POLICY. UPLOAD A COPY OF YOUR (OR YOUR SPOUSE'S) MEMBER-4 FORM DD-214 INDICATING DATES OF SERVICE, AND A COPY OF YOUR SPOUSE'S LETTER OF DISABILITY (IF APPLICABLE) WITH YOUR APPLICATION. FOR PRIVACY REASONS, IT IS RECOMMENDED THAT YOU REMOVE YOUR SOCIAL SECURITY INFORMATION FROM THE DOCUMENT(S). A HUMAN RESOURCES REPRESENTATIVE WILL REVIEW THE MATERIALS AND DETERMINE IF YOU QUALIFY FOR VETERANS' PREFERENCE. SEE THE POLICY HERE .\n\nREASONABLE ACCOMMODATIONS\n\nTHE COUNTY OF RIVERSIDE IS COMMITTED TO PROVIDING REASONABLE ACCOMMODATION TO APPLICANTS AS REQUIRED BY THE AMERICANS WITH DISABILITIES ACT (ADA) AND FAIR EMPLOYMENT AND HOUSING ACT (FEHA). QUALIFIED INDIVIDUALS WITH DISABILITIES WHO NEED A REASONABLE ACCOMMODATION DURING THE APPLICATION OR SELECTION PROCESS SHOULD CONTACT THE RECRUITER FOR THE POSITION NOTED ABOVE. FOR ADDITIONAL INFORMATION AND/OR TO OBTAIN THE APPROPRIATE FORM FOR REQUESTING A REASONABLE ACCOMMODATION, PLEASE VISIT THE DISABILITY ACCESS OFFICE WEB PAGE LOCATED AT: HTTP://DAO.RC-HR.COM/.\n\nWHAT’S NEXT?\n\nTHIS RECRUITMENT IS OPEN TO ALL APPLICANTS.\n\nAPPLICANTS WHO ARE CURRENT COUNTY OF RIVERSIDE EMPLOYEES AND/OR CURRENT EMPLOYEES OF THE PROBATION DEPARTMENT MAY BE CONSIDERED BEFORE OTHER APPLICANTS DEPENDING ON THE VOLUME OF APPLICATIONS RECEIVED.\n\nQUALIFIED APPLICANTS MAY BE CONSIDERED FOR FUTURE VACANCIES THROUGHOUT THE COUNTY.\n\nBASED ON THE NUMBER OF APPLICATIONS RECEIVED, THE POSTING MAY CLOSE WITHOUT NOTICE.\n\nIF YOU HAVE QUESTIONS REGARDING THIS POSITION, PLEASE CONTACT ULYSSES GERARDO AT 951-955-5772 OR E-MAIL AT UGERARDO@RIVCO.ORG .\n\nGENERAL APPLICATION INFORMATION\n\nPLEASE READ AND FOLLOW ANY SPECIAL APPLICATION INSTRUCTIONS ON THIS POSTING. CLICK THE 'APPLY' LINK LOCATED ON THIS PAGE TO SUBMIT YOUR APPLICATION. FOR INSTRUCTIONS ON THE APPLICATION PROCESS, EXAMINATIONS, VETERAN'S PREFERENCE, PRE-EMPLOYMENT ACCOMMODATION OR OTHER EMPLOYMENT QUESTIONS, PLEASE REFER TO OUR WEB SITE, WWW.RC-HR.COM . A PRE-EMPLOYMENT PHYSICAL EXAMINATION AND BACKGROUND CHECK MAY BE REQUIRED.",
    "job_skill_set": [
      "HR clerical processes",
      "employee benefits administration",
      "payroll practices",
      "data compilation and reporting",
      "recordkeeping practices",
      "office practices and procedures",
      "interpretation of HR policies",
      "training and advising",
      "typing (45 WPM)",
      "complex rules and regulations",
      "leadership",
      "communication",
      "independence",
      "problem solving",
      "teamwork",
      "organizational skills",
      "coaching",
      "customer service",
      "attention to detail",
      "adaptability"
    ],
    "short_keywords": [
      "45",
      "adaptability",
      "administration",
      "advising",
      "and",
      "attention",
      "benefits",
      "clerical",
      "clerk",
      "coaching",
      "communication",
      "compilation",
      "complex",
      "customer",
      "data",
      "detail",
      "employee",
      "hr",
      "human",
      "independence",
      "interpretation",
      "leadership",
      "of",
      "office",
      "organizational",
      "payroll",
      "policies",
      "practices",
      "problem",
      "procedures",
      "processes",
      "recordkeeping",
      "regulations",
      "reporting",
      "resources",
      "rules",
      "senior",
      "service",
      "skills",
      "solving",
      "teamwork",
      "to",
      "training",
      "typing",
      "wpm"
    ]
  },
  {
    "job_id": "3900066258",
    "job_title": "Human Resources Generalist",
    "category": "HR",
    "job_description": "WHO WE ARE: THE COMPUTING TECHNOLOGY INDUSTRY ASSOCIATION (COMPTIA) IS A LEADING VOICE AND ADVOCATE FOR THE $5 TRILLION GLOBAL INFORMATION TECHNOLOGY ECOSYSTEM; AND THE ESTIMATED 75 MILLION INDUSTRY AND TECH PROFESSIONALS WHO DESIGN, IMPLEMENT, MANAGE, AND SAFEGUARD THE TECHNOLOGY THAT POWERS THE WORLD’S ECONOMY. THROUGH EDUCATION, TRAINING, CERTIFICATIONS, PHILANTHROPY AND MARKET RESEARCH, COMPTIA PROMOTES INDUSTRY GROWTH; THE DEVELOPMENT OF A HIGHLY SKILLED WORKFORCE AND A COMMITMENT TO CREATING AN ENVIRONMENT WHERE INNOVATION HAPPENS, AND THE OPPORTUNITIES AND BENEFITS MADE POSSIBLE THROUGH TECHNOLOGY ARE AVAILABLE TO ALL.  SCOPE SUMMARY: AS A VISIBLE MEMBER OF OUR TALENT SUCCESS TEAM, THE HUMAN RESOURCES GENERALIST PLAYS A VITAL ROLE IN DELIVERING CLIENT-FOCUSED HR SUPPORT TO EMPLOYEES AND MANAGERS ACROSS THE ORGANIZATION. THIS ROLE ENSURES SEAMLESS ACCESS TO INFORMATION, TIMELY RESOLUTION OF INQUIRIES, AND FOSTERS COLLABORATION THROUGHOUT THE BUSINESS.  ESSENTIAL DUTIES AND RESPONSIBILITIES:  COLLABORATE WITH HR BUSINESS PARTNERS TO DELIVER EXCEPTIONAL HR SERVICES TO THE ORGANIZATION.FACILITATE PRE-EMPLOYMENT AND ONBOARDING PROCESSES, INCLUDING JOB DESCRIPTION ALIGNMENT, TIMELY REQUISITION MANAGEMENT, AND INTER-DEPARTMENT COMMUNICATION. ADMINISTER NEW HIRE PAPERWORK, SUCH AS I-9 FORMS, E-VERIFY, AND BACKGROUND CHECKS, ENSURING COMPLIANCE AND EFFICIENCY. MANAGE ONBOARDING AND ORIENTATION PROGRAMS AND ADMINISTRATION, ENSURING A SMOOTH TRANSITION FOR NEW EMPLOYEES. MANAGEHR ADMINISTRATION, INCLUDING METICULOUS DOCUMENTATION, MAINTENANCE AND MANAGEMENT OF EMPLOYEE FILES, JOB DESCRIPTIONS, POLICIES, AND HANDBOOK. ACT AS A RESPONSIVE POINT OF CONTACT FOR HR INQUIRIES, PROVIDING TIMELY AND ACCURATE ASSISTANCE. PROCESS STATE UNEMPLOYMENT REQUESTS. SUPPORT RECRUITMENT EFFORTS BY SCHEDULING INTERVIEWS AND PROVIDING OVERALL ASSISTANCE TO THE RECRUITMENT TEAM. ASSIST WITH QUARTERLY EMPLOYEE PERFORMANCE FEEDBACK AND REVIEW PROCESS. COORDINATE REGULAR HR PROCESSES, SUCH AS THE CONFLICT OF INTEREST PROCESS, WITH DILIGENCE AND ACCURACY. MAINTAIN LABOR LAW NOTIFICATIONS, POSTERS, AND ONLINE ACCESS FOR COMPLIANCE PURPOSES. PROVIDE SUPPORT TO HR TEAM MEMBERS ACROSS VARIOUS FUNCTIONS, INCLUDING RECRUITING, LEARNING AND DEVELOPMENT, BENEFITS, AND EMPLOYEE EXPERIENCE. CONTRIBUTE TO THE DEVELOPMENT AND IMPLEMENTATION OF HR PRACTICES AND PROCESSES TO ENHANCE ORGANIZATIONAL EFFECTIVENESS. FULFILL OTHER DUTIES AS ASSIGNED, DEMONSTRATING ADAPTABILITY AND A PROACTIVE APPROACH TO SUPPORT HR INITIATIVES.  EDUCATION AND/OR EXPERIENCE:  BACHELOR’S DEGREE IN HUMAN RESOURCES OR EQUIVALENT DESIRED. 3 - 5YEARS OF RELATED HR EXPERIENCE INCLUDING PROVEN EXPERIENCE AS AN HR COORDINATOR OR RELEVANT HUMAN RESOURCES/ADMINISTRATIVE POSITION. PHR OR SHRM-CP DESIGNATION PREFERRED. KNOWLEDGE OF HUMAN RESOURCES PROCESSES AND BEST PRACTICES. EXCEPTIONAL ORGANIZATIONAL SKILLS, ATTENTION TO DETAIL, AND TIME MANAGEMENT ABILITIES. STRONG COMMUNICATION AND COLLABORATION SKILLS IN A DYNAMIC ENVIRONMENT. KNOWLEDGE OF EMPLOYMENT LAW. PROFICIENCY IN MS OFFICE AND SLACK; EXPERIENCE WITH HR DATABASES AND HRIS SYSTEMS LIKE CERIDIAN/DAYFORCE. FAMILIARITY WITH ATS SOFTWARE AND SOURCING TOOLS, INCLUDING RESUME DATABASES AND ONLINE COMMUNITIES. ABILITY TO MAINTAIN CONFIDENTIALITY, PROFESSIONALISM, AND EXERCISE SOUND JUDGMENT IN ISSUE IDENTIFICATION AND ESCALATION. NOTE - THIS POSITION WILL NEED TO BE IN THE DOWNERS GROVE OFFICE 1-2 TIMES PER WEEK WHY JOIN US:\nWE'RE A TEAM OF DRIVEN, CREATIVE PROBLEM-SOLVERS WHO ARE PASSIONATE ABOUT EMPOWERING PEOPLE TO REALIZE THEIR FULL POTENTIAL. WE FOSTER A COLLABORATIVE AND INCLUSIVE CULTURE WHERE IDEAS ARE WELCOMED, GROWTH IS ENCOURAGED, AND SUCCESS IS CELEBRATED. WE'RE NOT JUST LOOKING FOR EMPLOYEES, WE'RE LOOKING FOR PARTNERS WHO SHARE OUR VISION AND ARE EAGER TO CONTRIBUTE TO OUR PURPOSE. IF YOU'RE READY TO UNLOCK YOUR POTENTIAL AND REACH NEW HEIGHTS, JOIN US TODAY.  OUR TEAM WORKS HARD AND WE RECOGNIZE THE IMPORTANCE OF TAKING CARE OF OUR OWN. WE OFFER OUR EMPLOYEES A COMPREHENSIVE SUITE OF BENEFIT OFFERINGS INCLUDING: HEALTH, DENTAL, AND VISION INSURANCE & FSA/HSA PLANSUNLIMITED PTO & 15 PAID HOLIDAYSFLEXIBLE SCHEDULES & SUMMER HOURS12 WEEKS OF PAID PARENTAL LEAVEFITNESS STIPENDSPONSORED COSTCO MEMBERSHIP401K RETIREMENT PLAN WITH 6% COMPANY MATCHSPOT BONUSES FOR GOING ABOVE & BEYONDSTUDENT LOAN REPAYMENT  COMPTIA SEEKS EXCELLENCE THROUGH DIVERSITY IN ITS STAFF. WE PROHIBIT DISCRIMINATION BASED ON RACE, COLOR, RELIGION, SEX, AGE, NATIONAL ORIGIN, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, DISABILITY, VETERAN STATUS, OR MARITAL STATUS.",
    "job_skill_set": [
      "HR processes",
      "employment law",
      "MS Office",
      "HRIS systems",
      "background checks",
      "recruitment",
      "onboarding",
      "documentation management",
      "communication",
      "collaboration",
      "organizational skills",
      "attention to detail",
      "time management",
      "problem solving",
      "adaptability",
      "confidentiality",
      "professionalism",
      "sound judgment",
      "ATS software",
      "I-9 forms",
      "E-Verify"
    ],
    "short_keywords": [
      "adaptability",
      "ats",
      "attention",
      "background",
      "checks",
      "collaboration",
      "communication",
      "confidentiality",
      "detail",
      "documentation",
      "employment",
      "everify",
      "forms",
      "generalist",
      "hr",
      "hris",
      "human",
      "i9",
      "judgment",
      "law",
      "management",
      "ms",
      "office",
      "onboarding",
      "organizational",
      "problem",
      "processes",
      "professionalism",
      "recruitment",
      "resources",
      "skills",
      "software",
      "solving",
      "sound",
      "systems",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3905350403",
    "job_title": "Human Resources Coordinator",
    "category": "HR",
    "job_description": "DESCRIPTION\n\nOVERVIEW:\n\nTHE HUMAN RESOURCES COORDINATOR WILL BE RESPONSIBLE FOR PROVIDING ADMINISTRATIVE AND OPERATIONAL\n\nSUPPORT TO THE HUMAN RESOURCES DEPARTMENT INCLUDING BUT NOT LIMITED TO MAINTENANCE OF EMPLOYMENT\n\nRECORDS, BENEFIT AND HRIS ADMINISTRATION, SCHEDULING TRAINING, REPORTING, COMPLIANCE AUDITS/REVIEWS,\n\nRECRUITMENT OUTREACH AND SOURCING. THE IDEAL CANDIDATE WILL BE A SKILLED, MOTIVATED, SELF-STARTER WHO\n\nUNDERSTANDS THE IMPORTANCE OF HANDLING SENSITIVE CONFIDENTIAL INFORMATION AND DERIVES SUCCESS FROM A\n\nCOLLABORATIVE APPROACH AND WORK STYLE.\n\nWHAT YOU WILL DO:\n\n MANAGE, TRACK, AND ENSURE COMPLIANCE ON ALL EMPLOYEE INFORMATION AND DOCUMENTATION AS DICTATED BY GOVERNING AGENCIES AND POLICIES, INCLUDING NEW HIRE REQUIRED DOCUMENTATION, EMPLOYEE ACTIONS, PERFORMANCE REVIEWS, AND TERMINATION. PROVIDE RECRUITMENT SUPPORT INCLUDING CREATING JOB AND EMPLOYEE FILES, GENERATING REQUIRED COMPLIANCE DOCUMENTS, ASSISTING WITH PRE-EMPLOYMENT REQUIREMENTS. MAINTAIN EMPLOYEE RECORDS AND I-9 FILES IN ACCORDANCE WITH STATE AND FEDERAL LAWS. COMPILE DATA IN SUPPORT OF ANNUAL REQUIRED COMPLIANCE REPORTS: EEO, VETS, AND AAP. MAINTAIN MANDATORY TRAINING RECORDS FOR HR AND FACILITATE CORPORATE TRAINING SCHEDULES AND MAINTENANCE OF RECORDS. COORDINATE AND EXECUTE NEW HIRE ONBOARDING AS NECESSARY. CONTRIBUTE TO AND MAINTAIN ACCURATE HRIS DATA. PROVIDE SUPPORT FOR VARIOUS CORPORATE MEETINGS AND FUNCTIONS; SCHEDULE AND PREPARE MEETING SPACE, WORK WITH ORGANIZER ON SUPPLIES AND OTHER ITEMS NEEDED. RESPONSIBLE FOR PLANNING, ARRANGING AND OVERSEEING CALENDARS, WHICH INCLUDES SCHEDULING OF MEETINGS, EVENTS, SOME TRAVEL ARRANGEMENTS, ETC. ADMINISTERS HEALTH AND WELFARE PLANS, INCLUDING ENROLLMENTS, CHANGES AND TERMINATIONS. PROCESSES REQUIRED DOCUMENTS THROUGH PAYROLL AND INSURANCE PROVIDERS TO ENSURE ACCURATE RECORD-KEEPING AND PROPER DEDUCTIONS. ASSIST WITH ALL INTERNAL AND EXTERNAL HR RELATED INQUIRIES OR REQUESTS. PARTICIPATE AND/OR LEAD HR-RELATED COMMITTEES AND/OR SPECIAL PROJECTS. GENERATE AND PREPARE IDENTIFIED HR REPORTS AS REQUIRED. OTHER PROJECTS AND DUTIES AS NEEDED.\n\nWHAT YOU MUST HAVE\n\n 1-3 YEARS HUMAN RESOURCE EXPERIENCE. BACHELOR'S DEGREE IN RELATED DISCIPLINE PREFERRED. BASIC UNDERSTANDING OF HUMAN RESOURCE FUNCTIONS, REPORTING AND RECORD KEEPING REQUIREMENTS. ADEPT AT PROBLEM SOLVING, STRONG INTERPERSONAL SKILLS, EXCELLENT WRITTEN AND ORAL COMMUNICATION SKILLS. UNDERSTAND AND BEHAVE WITH A HIGH LEVEL OF INTEGRITY AND COMPLETE CONFIDENTIALITY AT ALL TIMES. SELF-STARTER WITH INITIATIVE AND ABILITY TO OPERATE WITH MINIMAL SUPERVISION. ABILITY TO PRIORITIZE AND ORGANIZE EFFECTIVELY, WITH A HIGH ATTENTION TO DETAIL. WORKING KNOWLEDGE OF HRIS DATABASE SYSTEMS. KNOWLEDGE OF LOCAL, STATE AND FEDERAL LAWS REGARDING EMPLOYMENT. EXPERIENCE AND PROFICIENCY WORKING BOTH INDEPENDENTLY TO EXECUTE TASKS AND COLLABORATIVELY WITHIN A TEAM ENVIRONMENT TO PURSUE SOLUTIONS TO CHALLENGES.\n\nWHAT WE OFFER:\n\n ENJOY WORK LIFE BALANCE WITH 100% REMOTE WORK OPTION ALL FEDERAL HOLIDAYS MEDICAL/DENTAL/VISION INSURANCE 401K WITH EMPLOYER MATCH OPPORTUNITIES TO OBTAIN FEDERAL SECURITY CLEARANCES OPPORTUNITIES FOR TRAINING AND PROFESSIONAL CERTIFICATIONS\n\nREQ NUMBER NON-24-00008\n\nABOUT THE ORGANIZATION JSL DELIVERS CUSTOMER-CENTRIC IT SOLUTIONS FOR FEDERAL, STATE AND LOCAL GOVERNMENTS. WE OFFER OUR CUSTOMERS THREE DISTINCT ADVANTAGES: EXPERTISE IN OUR SERVICE OFFERINGS, LEADERSHIP THAT DRIVES INNOVATION, AND A CULTURE FOCUSED ON CUSTOMER SATISFACTION. OUR MISSION IS TO CULTIVATE RELATIONSHIPS, RESPONSIBILITY AND RESULTS THROUGH PEOPLE, PURPOSE AND PROCESS.\n\nEOE STATEMENT IN COMPLIANCE WITH THE AMERICANS WITH DISABILITIES ACT (ADA), IF YOU HAVE A DISABILITY AND WOULD LIKE TO REQUEST AN ACCOMMODATION IN ORDER TO APPLY FOR A POSITION WITH JAZZ SOLUTIONS INC., PLEASE CALL 410-905-5084 OR E-MAIL CAREERS@JAZZSOL.COM.\n\nJAZZ SOLUTIONS INC. IS PROUD TO BE AN EQUAL OPPORTUNITY EMPLOYER. WE SEEK INDIVIDUALS FROM A BROAD VARIETY OF BACKGROUNDS WITH VARYING LEVELS OF EXPERIENCE WHO HAVE A DESIRE TO DO MEANINGFUL WORK. WE RECRUIT, EMPLOY, TRAIN, COMPENSATE, AND PROMOTE REGARDLESS OF RACE, COLOR, GENDER, GENDER IDENTITY, RELIGION, NATIONAL ORIGIN, ANCESTRY, DISABILITY, AGE, VETERAN STATUS, SEXUAL ORIENTATION, OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW.",
    "job_skill_set": [
      "HRIS",
      "compliance",
      "reporting",
      "record keeping",
      "recruitment",
      "employee onboarding",
      "data compilation",
      "health and welfare plans administration",
      "knowledge of employment laws",
      "problem solving",
      "communication",
      "interpersonal skills",
      "integrity",
      "confidentiality",
      "self-starter",
      "initiative",
      "organization",
      "attention to detail",
      "teamwork"
    ],
    "short_keywords": [
      "administration",
      "and",
      "attention",
      "communication",
      "compilation",
      "compliance",
      "confidentiality",
      "coordinator",
      "data",
      "detail",
      "employee",
      "employment",
      "health",
      "hr",
      "hris",
      "human",
      "initiative",
      "integrity",
      "interpersonal",
      "keeping",
      "knowledge",
      "laws",
      "of",
      "onboarding",
      "organization",
      "plans",
      "problem",
      "record",
      "recruitment",
      "reporting",
      "resources",
      "selfstarter",
      "skills",
      "solving",
      "teamwork",
      "to",
      "welfare"
    ]
  },
  {
    "job_id": "3903855227",
    "job_title": "Human Resources Specialist",
    "category": "HR",
    "job_description": "HUMAN RESOURCES SPECIALIST/MANAGER | DENVER, CO | $85-105K DOEDIRECT HIREFULL-TIME, ONSITE (POTENTIAL FOR HYBRID)M-F 9AM-6PMARE YOU READY TO EMBARK ON AN EXCITING CAREER JOURNEY WITH ONE OF AMERICA’S TOP EMPLOYERS IN THE CANNABIS INDUSTRY? THIS CUTTING-EDGE ANALYTICAL LABORATORY IS IN SEARCH OF A DYNAMIC HUMAN RESOURCES SPECIALIST TO JOIN THEIR MISSION TO ENSURE SAFETY AND QUALITY IN THE CANNABIS INDUSTRY.\nAS AN HR SPECIALIST, YOU'LL PLAY A PIVOTAL ROLE IN THE ORGANIZATION'S SUCCESS. WE'RE SEEKING A SEASONED PROFESSIONAL WITH A PROVEN TRACK RECORD IN HR, PARTICULARLY IN RECRUITMENT AND EMPLOYEE RELATIONS. WITH OPERATIONS SPANNING ACROSS 5 STATES AND APPROXIMATELY 130 EMPLOYEES, WE’RE LOOKING FOR AN EXPERIENCED PROFESSIONAL READY TO JUMP IN AN LEAD HR FUNCTIONS.\nIF YOU'RE PASSIONATE ABOUT HR, THRIVE IN A FAST-PACED ENVIRONMENT, AND ARE READY TO CONTRIBUTE TO A GROWING ORGANIZATION, THIS OPPORTUNITY MAY BE THE ONE FOR YOU! APPLY NOW AND CALL EDDIE AT 888-303-5627 TO LEARN MORE!\nWHAT YOU’LL DO:EMPLOYEE RELATIONS: SERVE AS A TRUSTED ADVISOR TO MANAGEMENT AND EMPLOYEES ON HR MATTERS, CONDUCT INVESTIGATIONS, AND PROVIDE GUIDANCE ON WORKPLACE PRACTICES.PERFORMANCE MANAGEMENT: OVERSEE PERFORMANCE REVIEW PROCESSES AND PROVIDE COACHING TO MANAGERS AS NEEDED.WORK CULTURE ENHANCEMENT: LEAD EMPLOYEE ENGAGEMENT INITIATIVES, INCLUDING EVENTS AND PROGRAMS AIMED AT FOSTERING A POSITIVE WORK ENVIRONMENT.ONBOARDING: FACILITATE SEAMLESS ONBOARDING PROCESSES FOR NEW HIRES, WHETHER IN-PERSON OR VIRTUALLY.OVERSEE FULL CYCLE RECRUITING: COLLABORATE WITH HIRING MANAGERS TO ENSURE THE ATTRACTION OF TOP TALENT, MANAGEMENT OF JOB POSTINGS, AND SCREENING OF APPLICANTS.COMPLIANCE: ENSURE ADHERENCE TO LABOR LAWS AND COMPANY POLICIES, AND MANAGE BENEFITS ADMINISTRATION. WHAT YOU’LL BRING:3-8 YEARS OF HR EXPERIENCE, WITH A FOCUS ON RECRUITMENT AND EMPLOYEE RELATIONS.STRONG UNDERSTANDING OF HR PRINCIPLES AND REGULATIONS.EXCELLENT COMMUNICATION AND INTERPERSONAL SKILLS.ABILITY TO THRIVE IN A FAST-PACED, DYNAMIC ENVIRONMENT.CREATIVE MINDSET WITH A FOCUS ON CONTINUOUS IMPROVEMENT.EXPERIENCE IN MERGERS AND ACQUISITIONS IS A PLUS. KEY REQUIREMENTS:MINIMUM AGE OF 21.BACHELOR'S DEGREE IN BUSINESS/EMPLOYEE RELATIONS OR EQUIVALENT EXPERIENCE.PROFICIENCY IN GOOGLE SUITE, MICROSOFT OFFICE, AND HRIS PLATFORMS. \n DYNAMIC PROVIDES EQUAL EMPLOYMENT OPPORTUNITIES TO ALL EMPLOYEES AND APPLICANTS FOR EMPLOYMENT AND PROHIBITS DISCRIMINATION AND HARASSMENT OF ANY TYPE WITHOUT REGARD TO RACE, COLOR, RELIGION, AGE, SEX, NATIONAL ORIGIN, DISABILITY STATUS, GENETICS, PROTECTED VETERAN STATUS, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, OR ANY OTHER CHARACTERISTIC PROTECTED BY FEDERAL, STATE, OR LOCAL LAWS. THIS POLICY APPLIES TO ALL TERMS AND CONDITIONS OF EMPLOYMENT, INCLUDING RECRUITING, HIRING, PLACEMENT, PROMOTION, TERMINATION, LAYOFF, RECALL, TRANSFER, LEAVES OF ABSENCE, COMPENSATION, AND TRAINING.",
    "job_skill_set": [
      "HR principles",
      "recruitment",
      "employee relations",
      "performance management",
      "onboarding",
      "compliance",
      "Microsoft Office",
      "communication",
      "interpersonal skills",
      "problem solving",
      "adaptability",
      "teamwork",
      "Google Suite",
      "HRIS platforms",
      "creativity"
    ],
    "short_keywords": [
      "adaptability",
      "communication",
      "compliance",
      "creativity",
      "employee",
      "google",
      "hr",
      "hris",
      "human",
      "interpersonal",
      "management",
      "microsoft",
      "office",
      "onboarding",
      "performance",
      "platforms",
      "principles",
      "problem",
      "recruitment",
      "relations",
      "resources",
      "skills",
      "solving",
      "specialist",
      "suite",
      "teamwork"
    ]
  },
  {
    "job_id": "3904382813",
    "job_title": "Senior Human Resources Generalist",
    "category": "HR",
    "job_description": "INSERO TALENT SOLUTIONS IS RECRUITING A SENIOR HUMAN RESOURCES GENERALIST FOR A FAST GROWING ELECTRONICS DISTRIBUTION COMPANY IN ROCHESTER, NY. \nPOSITION OVERVIEWWE ARE SEEKING AN EXPERIENCED SR. HR GENERALIST WITH A PROVEN TRACK RECORD OF SUCCESS IN RECRUITING AND TALENT ACQUISITION. THE IDEAL CANDIDATE WILL HAVE A DEEP UNDERSTANDING OF THE FULL EMPLOYEE LIFECYCLE, WITH A FOCUS ON ATTRACTING, HIRING AND ONBOARDING TOP TALENT. THIS ROLE WILL BE RESPONSIBLE FOR ASSISTING IN THE DEVELOPMENT OF AND IMPLEMENTING RECRUITING STRATEGIES, MANAGING THE CANDIDATE PIPELINE, AND ENSURING A POSITIVE CANDIDATE EXPERIENCE. THIS ROLE WILL ALSO WORK CLOSELY WITH THE VP OF HR TO DRIVE HR POLICIES AND PROGRAMS THAT DEVELOP OUR EMPLOYEES AND HELP THEM GROW.\nIDEAL CANDIDATETHE IDEAL CANDIDATE MUST BE DETAIL ORIENTED, PROCESS-DRIVEN AND HAVE PREVIOUS EXPERIENCE EFFECTIVELY RECRUITING ACROSS MULTIPLE LEVELS WITHIN A COMPANY. THIS PERSON MUST BE A STRONG, SELF-MOTIVATED PROBLEM SOLVER, ABLE TO WORK UNDER DEADLINES AND PRODUCE CONSISTENT, ACCURATE RESULTS. THE CANDIDATE WILL IDEALLY HAVE KNOWLEDGE AND EXPERIENCE WORKING WITH AN HCM SYSTEM AND RECRUITING SOFTWARE. MUST BE ABLE TO BUILD AND MAINTAIN STRONG POSITIVE RELATIONSHIPS AND DEMONSTRATE A COMMITTED DRIVE TO PROVIDE EXEMPLARY CUSTOMER SERVICE TO ALL EMPLOYEES. THIS ROLE REQUIRES THE USE OF SOUND JUDGEMENT AND DISCRETION IN DEALING WITH HIGHLY CONFIDENTIAL INFORMATION. \nPRIMARY RESPONSIBILITIESRECRUITMENT & STAFFINGASSIST IN DEVELOPING AND EXECUTING COMPREHENSIVE RECRUITING STRATEGIES TO ATTRACT AND HIRE HIGH-QUALITY CANDIDATESMANAGE THE FULL RECRUITMENT LIFECYCLE, FROM JOB REQUISITION TO CANDIDATE ONBOARDINGSOURCE AND SCREEN CANDIDATES THROUGH VARIOUS CHANNELS, INCLUDING JOB BOARDS, SOCIAL MEDIA, AND EMPLOYEE REFERRALSCONDUCT INITIAL PHONE SCREENINGS AND SCHEDULE INTERVIEWSPARTNER WITH HIRING MANAGERS TO DEFINE JOB REQUIREMENTS AND DEVELOP INTERVIEW PLANSASSESS CANDIDATE QUALIFICATIONS THROUGH INTERVIEWS AND REFERENCE CHECKSEXTEND AND NEGOTIATE JOB OFFERS TO SUCCESSFUL CANDIDATES\nTALENT MANAGEMENTONBOARD NEW HIRES AND ENSURE A SMOOTH TRANSITION INTO THE ORGANIZATIONMANAGE EMPLOYEE RELATIONS AND RESOLVE ANY HR-RELATED ISSUESWORK WITH MANAGERS TO HELP PROVIDE GUIDANCE ON PERFORMANCE EVALUATIONSASSIST IN DEVELOPING AND IMPLEMENTING EMPLOYEE TRAINING AND DEVELOPMENT PROGRAMSMAINTAIN EMPLOYEE RECORDS AND ENSURE COMPLIANCE WITH ALL APPLICABLE LAWS AND REGULATIONSPROVIDE GENERAL HR SUPPORT TO EMPLOYEES AND MANAGERS, ESCALATE ANY CONCERNS TO VP OF HR AND/OR SENIOR LEADERSHIP TEAMMAINTAIN A POSITIVE AND PROFESSIONAL WORK ENVIRONMENTSTAY UP TO DATE ON INDUSTRY BEST PRACTICES AND EMERGING TRENDS IN HR \nQUALIFICATIONS5+ YRS EXPERIENCE IN HR WITH A FOCUS ON RECRUITINGSTRONG UNDERSTANDING OF RECRUITING BEST PRACTICES AND TALENT ACQUISITION STRATEGIESEXCELLENT LISTENING, COMMUNICATION, AND INTERPERSONAL SKILLSABILITY TO WORK INDEPENDENTLY AND AS PART OF A TEAMPROFICIENT IN MICROSOFT OFFICE SUITE, HCM SYSTEMS, AND RECRUITMENT SOFTWARE.BACHELOR’S DEGREE IN HUMAN RESOURCE MANAGEMENT, BUSINESS ADMINISTRATION OR A RELATED FIELD",
    "job_skill_set": [
      "recruiting",
      "talent acquisition",
      "Microsoft Office Suite",
      "employee relations",
      "performance evaluations",
      "employee training and development",
      "communication",
      "interpersonal skills",
      "problem solving",
      "attention to detail",
      "customer service",
      "teamwork",
      "sound judgment",
      "HCM systems",
      "recruitment software",
      "compliance",
      "process-driven",
      "independence"
    ],
    "short_keywords": [
      "acquisition",
      "and",
      "attention",
      "communication",
      "compliance",
      "customer",
      "detail",
      "development",
      "employee",
      "evaluations",
      "generalist",
      "hcm",
      "hr",
      "human",
      "independence",
      "interpersonal",
      "judgment",
      "microsoft",
      "office",
      "performance",
      "problem",
      "processdriven",
      "recruiting",
      "recruitment",
      "relations",
      "resources",
      "senior",
      "service",
      "skills",
      "software",
      "solving",
      "sound",
      "suite",
      "systems",
      "talent",
      "teamwork",
      "to",
      "training"
    ]
  },
  {
    "job_id": "3905381062",
    "job_title": "Temporary Human Resources Business Partner (HRBP)",
    "category": "HR",
    "job_description": "WHO WE ARE\n\nAT BROOKS, WE BELIEVE A RUN CAN CHANGE A DAY, A LIFE, THE WORLD. EVERYONE WHO WORKS HERE IS A KEY PART OF OUR OBSESSION TO MAKE THE BEST RUNNING GEAR ON THE PLANET. WE WANT OUR BUSINESS — WHICH ALSO HAPPENS TO BE OUR PASSION — TO BE A PLACE WHERE EVERYONE FEELS WELCOME AND COMFORTABLE BEING THEMSELVES. OUR COMPANY CULTURE DEFINES US, BONDS US TOGETHER, AND DRIVES OUR SUCCESS. WE LIVE THIS CULTURE DAILY THROUGH OUR BRAND VALUES: RUNNER FIRST, WORD IS BOND, CHAMPION HEART, THERE IS NO “I” IN RUN, AND KEEP MOVING. THIS MEANS WE ALWAYS SOLVE FOR THE RUNNER, DO WHAT WE SAY WE WILL, GIVE IT OUR ALL, ARE GENEROUS WITH OUR HUMANITY, AND FIND A WAY TO KEEP MOVING EVERY DAY, BECAUSE JOY IS KINETIC.\n\nARE YOU READY TO HELP CREATE SOMETHING EXTRAORDINARY?\n\nNOTE: THIS IS A TEMPORARY ASSIGNMENT (6-8 MONTHS).\n\nYOUR JOB\n\nAS A BROOKS TEMPORARY HR BUSINESS PARTNER, YOU’LL PLAY A KEY ROLE IN INFLUENCING HOW PEOPLE WORK AT BROOKS. YOU WILL BE RESPONSIBLE FOR INTEGRATING BROOKS’ TALENT MANAGEMENT PROGRAMS AND POLICIES INTO OUR BUSINESS WITH FOCUSED INTENTION ON LINKING TALENT TO OPPORTUNITIES, INCREASING MANAGER CAPABILITIES, AND PROVIDING CAREER DEVELOPMENT SUPPORT TO ALL EMPLOYEES.\n\nIN THIS POSITION, YOU WILL BUILD TRUST AND ESTABLISH PARTNERSHIPS WITH DEPARTMENT LEADERS AS A STRATEGIC CONSULTATIVE THOUGHT PARTNER IN THE DELIVERY OF HR PROGRAMS AND SERVICES THAT DEVELOP ORGANIZATIONAL AND TALENT CAPABILITY IN ASSIGNED CLIENT GROUPS. PROGRAMS INCLUDE, BUT ARE NOT LIMITED TO TALENT /WORKFORCE PLANNING, TALENT IDENTIFICATION, ORG DESIGN, PERFORMANCE MANAGEMENT, AND EMPLOYEE RELATIONS.\n\nIN THIS ROLE, YOU WILL THINK STRATEGICALLY AS WELL AS ROLL UP YOUR SLEEVES AND DIVE DEEP INTO PRACTICAL APPLICATION OF HR PROCESS, PROGRAMS AND BEST PRACTICES YOU WILL BE ASKED TO UNDERSTAND BUSINESS PRIORITIES AND TRANSLATE THEM INTO PEOPLE INITIATIVES THAT SUPPORT BROOKS’ THREE-YEAR ROAD MAP AND RESPOND TO ANY SPECIAL PROJECTS BASED ON EVOLVING BUSINESS NEEDS.\n\nYOUR RESPONSIBILITIES\n\nACT AS AN HR ADVISOR ACROSS MULTIPLE CLIENT GROUPS IN AREAS INCLUDING TALENT MANAGEMENT, PERFORMANCE MANAGEMENT, ORGANIZATIONAL DESIGN, LEADERSHIP DEVELOPMENT, SUCCESSION PLANNING, TALENT ACQUISITION, DIVERSITY EQUITY AND INCLUSION, AND EMPLOYEE RELATIONS.ACT AS A TRUSTED PARTNER AND RELIABLE RESOURCE TO EMPLOYEES BY ADVISING ON PROCESSES, PROCEDURES, OR PROVIDING THE INFORMATION NEEDED ON GENERAL EMPLOYMENT TOPICS.PARTNER WITH ALL OF THE HR DISCIPLINES INCLUDING HR OPERATIONS, COMPENSATION, DEI, PEOPLE PROGRAMS AND RECRUITMENT, TO ENSURE AN INTEGRATED AND HIGH-QUALITY DELIVERY OF PROGRAMS.IDENTIFY, EVALUATE AND PARTICIPATE IN HR PROGRAM DESIGN, PARTNERING WITH COLLEAGUES IN HR, LEGAL AND FINANCE TO EFFECTIVELY COMMUNICATE AND IMPLEMENT PROGRAMS ACROSS THE ORGANIZATION. LEAD THE ANNUAL TALENT REVIEW AND MERIT PROCESS FOR CLIENT GROUPS. CONNECT WITH LEADERS ACROSS ALL LEVELS TO UNDERSTAND TALENT NEEDS ACROSS THE TEAM, PROVIDE GUIDANCE, SUPPORT AND RECOMMENDATIONS TO MANAGE ANNUAL MERIT AND PROMOTIONS IN ALIGNMENT WITHIN AN IDENTIFIED BUDGET. WORK WITH CLIENT GROUPS AND ASSIGNED BUSINESS FUNCTIONS AND DEVELOP A DEEP UNDERSTANDING OF THEIR BUSINESS STRATEGIES, PRIORITIES AND OBJECTIVES TO GAIN INSIGHTS THAT ALLOW YOU TO EFFECTIVELY PARTNER WITH LEADERS ON ORGANIZATIONAL DESIGN, TALENT ASSESSMENT, CHANGE MANAGEMENT STRATEGIES AND TACTICS.PROVIDE ADVICE AND INPUT ON BUSINESS UNIT RESTRUCTURES, WORKFORCE PLANNING, LEADERSHIP SUCCESSION PLANNING, TRAINING, AND RETENTION PLANNING. PARTNER WITH EXECUTIVE LEADERS, MANAGERS, AND TEAMS TO UNDERSTAND THEIR STRATEGIC ROADMAP IN ORDER TO ADVISE ON OPPORTUNITIES TO INFLUENCE TEAM PERFORMANCE AND ORGANIZATIONAL EFFECTIVENESS. CONDUCT REGULAR 1 ON 1 MEETINGS WITH LEADERS TO REVIEW TALENT, ADVISE ON PERFORMANCE MANAGEMENT, CAREER DEVELOPMENT, ORGANIZATIONAL DESIGN, ETC. FACILITATE THE ANNUAL BROOKS CULTURAL STRENGTHS SURVEY FOR YOUR CLIENT GROUPS. PERFORM ANALYSIS, DRAW INSIGHTS, IDENTIFY THEMES AND PUBLISH RESULTS. FACILITATE MEETINGS TO SHARE RESULTS WITH CLIENT GROUPS, AND PARTNER WITH FUNCTIONAL LEADERSHIP TEAMS TO DEVELOP SPECIFIC ACTION PLANS TO RESPOND TO EMPLOYEE FEEDBACK AND TRENDS. USE HR AND BUSINESS METRICS TO ASSESS INTERNAL AND EXTERNAL TALENT NEEDS AND TRENDS AND INFORM HR STRATEGIES.UNDERSTAND AND APPLY HR COMPLIANCE AND EMPLOYMENT LAWS, SUCH AS FMLA, FLSA, PAY EQUITY, ADA, ETC. WHEN ADDRESSING EMPLOYEE RELATIONS ISSUES AND UNIQUE SITUATIONS TO PROVIDE ADVICE, COUNSEL AND SUPPORT TO MANAGERS AND EMPLOYEES. PARTNER WITH HR COMPLIANCE AND LEGAL TEAMS, AS NECESSARY. ACT AS A LEADER FOR BROOKS DIVERSITY & INCLUSION EFFORTS. ADVOCATE FOR DE&I ACROSS ALL LEVELS AND FUNCTIONS. APPROACH EMPLOYEE GROWTH, DEVELOPMENT, AND EMPLOYEE RELATIONS WITH A DE&I LENS. \n\nQUALIFICATIONS\n\nBACHELOR’S DEGREE IN HR OR RELATED FIELD OR EQUIVALENT COMBINATION OF EDUCATION AND EXPERIENCE5+ YEARS OF PROGRESSIVE HR EXPERIENCE, MINIMUM OF 2 IN A GENERALIST OR HRBP ROLEYOU HAVE PRIOR HR EXPERIENCE INCLUDING BUSINESS CONSULTANCY AND COACHING, DIAGNOSING/ASSESSING ORGANIZATIONS, IDENTIFYING ROOT CAUSE, INFLUENCING BUSINESS LEADERS, AND IMPLEMENTING SOLUTIONS THAT INCREASE MANAGER EFFECTIVENESS AND EMPLOYEE ENGAGEMENT. EXPERIENCE SCALING AN ORGANIZATION THROUGH A STEEP RAMP IS ALSO ESSENTIAL.KNOWLEDGE OF CURRENT TRENDS AND PRACTICES RELATING TO EMPLOYMENT LAW, LEARNING, AND TALENT MANAGEMENT.EXCELLENT SOCIAL AND INFLUENCE SKILLS WITH EXPERIENCE ESTABLISHING CREDIBILITY AND WORKING RELATIONSHIPS AT ALL LEVELS THROUGHOUT THE ORGANIZATION.STRONG PROGRAM MANAGEMENT AND FACILITATION SKILLS ALONG WITH THE ABILITY TO SUPPORT AND MENTOR OTHERS IN THESE DOMAINS.EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS, DEMONSTRATING EFFECTIVE LISTENING THROUGH CONCISE, CLEAR VERBAL AND WRITTEN COMMUNICATION.ABILITY TO TRAVEL DOMESTICALLY AND INTERNATIONALLY. EMBRACE AND LIVE THE BROOKS’ VALUES!\n\nCOMPENSATION: PAY IS $43-$60 PER HOUR.\n\nOTHER\n\nBROOKS IS PROUD TO OFFER A ROBUST BENEFITS PACKAGE TO OUR TEMPORARY EMPLOYEES AND THEIR FAMILIES!\n\nBENEFITS - INCLUDING MEDICAL, DENTAL, VISION, HSA AND EMPLOYER CONTRIBUTION, FSA, FAMILY & FERTILITY ASSISTANCE, 401K SAVINGS PLAN AND MATCH, EMPLOYEE ASSISTANCE PROGRAM, AND TRANSPORTATION ASSISTANCE.\n\nPAID TIME OFF - ELEVEN PAID HOLIDAYS AND PAID SICK.\n\nPERKS - INCLUDING PRODUCT DISCOUNTS, EMPLOYEE RECOGNITION, AND FITNESS DISCOUNTS.\n\nLOCATION- YOU WILL SPEND 3 DAYS PER WEEK IN OUR SEATTLE OFFICES, AS WE BELIEVE OUR ORGANIZATION FLOURISHES WHEN CONNECTIONS, COLLABORATION, CREATIVITY, PROBLEM-SOLVING, AND CELEBRATIONS HAPPEN IN PERSON.\n\nAT BROOKS, WE CELEBRATE DIVERSITY & EQUITY. WE ARE COMMITTED TO CREATING AN INCLUSIVE ENVIRONMENT, AND ENCOURAGE PEOPLE OF ALL BACKGROUNDS, PERSPECTIVES, EXPERIENCES, AND SKILLS TO APPLY. BROOKS IS PROUD TO BE AN EQUAL EMPLOYMENT OPPORTUNITY EMPLOYER. ALL EMPLOYMENT DECISIONS ARE MADE WITHOUT REGARD TO RACE, RELIGION, CREED, COLOR, NATIONAL ORIGIN, AGE, SEX, GENDER, GENDER IDENTITY OR EXPRESSION, TWO-SPIRIT IDENTITY, SEXUAL ORIENTATION, GENETIC INFORMATION, SENSORY, PHYSICAL, OR MENTAL DISABILITY, MARITAL STATUS, PREGNANCY (INCLUDING CHILDBIRTH AND RELATED CONDITIONS), HONORABLE DISCHARGE OR MILITARY STATUS, PROTECTED CITIZEN STATUS, ACTUAL OR PERCEIVED VICTIMS OF DOMESTIC VIOLENCE, SEXUAL ASSAULT OR STALKING, HIV OR HEPATITIS C INFECTION, POLITICAL IDEOLOGY, USE OF A TRAINED GUIDE DOG BY A PERSON WITH A DISABILITY, OR ON ANY OTHER BASIS PROTECTED BY FEDERAL, STATE OR LOCAL LAW, OR ANY OTHER NON-MERIT BASED FACTORS.",
    "job_skill_set": [
      "Talent Management",
      "Performance Management",
      "Leadership Development",
      "Succession Planning",
      "Talent Acquisition",
      "Employee Relations",
      "HR Compliance",
      "Employment Law",
      "Program Management",
      "Communication",
      "Relationship Building",
      "Strategic Thinking",
      "Problem Solving",
      "Collaboration",
      "Adaptability",
      "Organizational Design",
      "Diversity, Equity, and Inclusion (DEI)",
      "Facilitation Skills",
      "HR Metrics Analysis",
      "Influencing Skills",
      "Trust Building",
      "Mentoring",
      "Listening Skills"
    ],
    "short_keywords": [
      "acquisition",
      "adaptability",
      "analysis",
      "and",
      "building",
      "business",
      "collaboration",
      "communication",
      "compliance",
      "dei",
      "design",
      "development",
      "diversity",
      "employee",
      "employment",
      "equity",
      "facilitation",
      "hr",
      "hrbp",
      "human",
      "inclusion",
      "influencing",
      "law",
      "leadership",
      "listening",
      "management",
      "mentoring",
      "metrics",
      "organizational",
      "partner",
      "performance",
      "planning",
      "problem",
      "program",
      "relations",
      "relationship",
      "resources",
      "skills",
      "solving",
      "strategic",
      "succession",
      "talent",
      "temporary",
      "thinking",
      "trust"
    ]
  },
  {
    "job_id": "3905876643",
    "job_title": "Human Resources/Business Office Manager",
    "category": "HR",
    "job_description": "HUMAN RESOURCES/BUSINESS OFFICE MANAGER | FRENCH CREEK RECOVERY CENTER | MEADVILLE, PENNSYLVANIA\n\nABOUT THE JOB:\n\nTHE MANAGER OF HUMAN RESOURCES LEADS AND MANAGES THE OVERALL PROVISION OF HUMAN RESOURCES SERVICES, POLICIES, AND PROGRAMS FOR THE FACILITY INCLUDING EMPLOYMENT AND COMPLIANCE; RECRUITING AND STAFFING; EMPLOYEE ORIENTATION, ONBOARDING, AND TRAINING; PERFORMANCE MANAGEMENT AND IMPROVEMENT; EMPLOYEE RETENTION AND ENGAGEMENT; POLICY DEVELOPMENT; EMPLOYEE RELATIONS; AND COMPENSATION, PAYROLL AND BENEFITS ADMINISTRATION. PROVIDES SUPPORT AND GUIDANCE TO FACILITY MANAGEMENT AND EMPLOYEES WITH A FOCUS ON CONSISTENT EMPLOYMENT PRACTICES.\n\nSUMMARY OF BUSINESS OFFICE DUTIES - THE BUSINESS OFFICE MANAGER LEADS AND PROVIDES OPERATIONAL DIRECTIVES FOR ALL BUSINESS OFFICE ACTIVITIES RELATED TO THE CLAIM’S MANAGEMENT AND COLLECTIONS OF THE FACILITY RECEIVABLES AND ENSURES TIMELY, EFFICIENT CASH COLLECTIONS TO SUPPORT THE OVERALL FINANCIAL GOALS OF THE FACILITY. PLANS, DEVELOPS, ORGANIZES, IMPLEMENTS, EVALUATES AND SUPERVISES BUSINESS OFFICE ACTIVITIES INCLUDING THE FINANCIAL COUNSELLING, BILLING, AND COLLECTIONS FUNCTIONS FOR ALL SERVICE LINES.\n\nBACHELOR'S DEGREE IN HUMAN RESOURCES, BUSINESS OR RELATED FIELD REQUIRED OR HIGH SCHOOL DIPLOMA PLUS RELATED COMPARABLE EXPERIENCE.\n\nFOUR OR MORE YEARS OF EXPERIENCE IN A PROGRESSIVELY RESPONSIBLE HR ROLE REQUIRED.\n\nDEMONSTRABLE KNOWLEDGE OF PRINCIPLES AND PROCEDURES FOR RECRUITMENT, SELECTION, TRAINING, COMPENSATION AND BENEFITS, EMPLOYEE RELATIONS AND NEGOTIATION, ENGAGEMENT AND RETENTION AND HUMAN RESOURCES INFORMATION SYSTEMS REQUIRED.\n\nEXPERIENCE WITH REGULATORY AGENCIES (JOINT COMMISSION, CMS, ETC.) PREFERRED.\n\nROLES AND RESPONSIBILITIES:\n\n PROVIDES EXPERTISE AND SUPPORT IN HUMAN RESOURCES ADMINISTRATION INCLUDING POLICY AND PROCEDURE, EMPLOYER/EMPLOYEE RELATIONS, HR STRATEGY, REGULATORY COMPLIANCE, AND EMPLOYMENT LAW. PROVIDES GUIDANCE ON INTERPRETATION OF POLICIES AND PROCEDURES. TRANSLATES COMPLEX INFORMATION AND PROVIDES HIGHLY SPECIALIZED ADVICE IN A SPECIFIC HUMAN RESOURCES DISCIPLINE. DEVELOPS AND MAINTAINS TRACKING SYSTEM FOR OPEN POSITIONS. RECRUITS, SCREENS, ONBOARDS, AND ORIENTS NEW HIRES ACCORDING TO FACILITY NEEDS AND BUDGET. DEVELOPS, AND CONDUCTS STAFF DEVELOPMENT PROGRAM INCLUDING TRAINING AND EDUCATION. ENSURES LICENSE AND REQUIRED CERTIFICATIONS ARE APPROPRIATE AND CURRENT. DESIGNS AND IMPLEMENTS RETENTION INITIATIVES INCLUDING REWARDS AND RECOGNITION AND ENGAGEMENT. DEVELOPS AND RECOMMENDS EMPLOYEE RELATIONS PRACTICES NECESSARY TO ESTABLISH A POSITIVE EMPLOYER-EMPLOYEE RELATIONSHIP AND PROMOTE A HIGH LEVEL OF EMPLOYEE MORALE, MOTIVATION AND ENGAGEMENT. PROVIDES COACHING AND CONFLICT RESOLUTION FOR MANAGERS AND EMPLOYEES. CONDUCTS INVESTIGATIONS OF EMPLOYEE COMPLAINTS OR INCIDENTS. ADMINISTERS BENEFIT PROGRAMS INCLUDING TIMELY ENROLLMENT, PROCESSES UNEMPLOYMENT AND WORKER’S COMPENSATION CLAIMS AND LEAVE BENEFITS. LEADS A TEAM OF HIGHLY ENGAGED MEMBERS THRU HIRING, ORIENTING, PERFORMANCE ASSESSMENT AND MANAGEMENT, MOTIVATING, TRAINING, SCHEDULING, AND COACHING TO MEET DEPARTMENT GOALS AND ENSURE EFFECTIVE AND EFFICIENT DEPARTMENT OPERATION. MANAGES EMPLOYEE PERFORMANCE THRU UPDATED JOB DESCRIPTIONS AND COMPETENCIES, TIMELY EVALUATIONS, AND MERIT INCREASES AS APPROPRIATE. MANAGES AN EQUITABLE AND COMPETITIVE COMPENSATION PROGRAM. DEVELOPS AND MAINTAINS COMPANY SALARY/WAGE SCALE. ENTERS EMPLOYEE DATA ACCURATELY. ENSURES EMPLOYEE FILES/RECORDS ARE COMPLIANT AND MAINTAINED ACCORDING TO REGULATORY STANDARDS AND COMPANY POLICIES. RESPONDS TO AGENCY SURVEYS. IDENTIFIES DATA NEEDED FOR REPORTS AND ENSURES REPORTS ACCURATELY CAPTURE AND PRESENT INFORMATION APPROPRIATE TO THE AUDIENCE.\n\n\nBUSINESS OFFICE JOB DUTIES.\n\nWHY FRENCH CREEK RECOVERY CENTER?FRENCH CREEK RECOVERY CENTER OFFERS A COMPREHENSIVE BENEFIT PLAN AND A COMPETITIVE SALARY COMMENSURATE WITH EXPERIENCE AND QUALIFICATIONS. QUALIFIED CANDIDATES SHOULD APPLY BY SUBMITTING A RESUME. FRENCH CREEK RECOVERY CENTER IS AN EOE.\n\nVETERANS AND MILITARY SPOUSES ARE HIGHLY ENCOURAGED TO APPLY. SUMMIT BHC IS DEDICATED TO SERVING VETERANS WITH SPECIALIZED PROGRAMMING AT OUR TREATMENT CENTERS ACROSS THE COUNTRY. WE RECOGNIZE AND VALUE THE UNIQUE STRENGTHS OF THE MILITARY COMMUNITY IN SUPPORTING OUR MISSION TO SERVE THOSE WHO HAVE SERVED.",
    "job_skill_set": [
      "human resources management",
      "employee relations",
      "compliance",
      "training and development",
      "payroll administration",
      "benefits administration",
      "HR information systems",
      "data analysis",
      "conflict resolution",
      "regulatory compliance",
      "communication",
      "leadership",
      "teamwork",
      "problem solving",
      "coaching",
      "adaptability",
      "organizational skills",
      "interpersonal skills",
      "attention to detail",
      "recruitment",
      "performance management",
      "financial management",
      "policy development",
      "billing and collections",
      "employee engagement",
      "negotiation"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "analysis",
      "and",
      "attention",
      "benefits",
      "billing",
      "coaching",
      "collections",
      "communication",
      "compliance",
      "conflict",
      "data",
      "detail",
      "development",
      "employee",
      "engagement",
      "financial",
      "hr",
      "human",
      "information",
      "interpersonal",
      "leadership",
      "management",
      "manager",
      "negotiation",
      "office",
      "organizational",
      "payroll",
      "performance",
      "policy",
      "problem",
      "recruitment",
      "regulatory",
      "relations",
      "resolution",
      "resources",
      "resourcesbusiness",
      "skills",
      "solving",
      "systems",
      "teamwork",
      "to",
      "training"
    ]
  },
  {
    "job_id": "3905202804",
    "job_title": "Human Resources Manager",
    "category": "HR",
    "job_description": "JOB PURPOSE\n\nTHE HR MANAGER WILL WORK WITH THE FACILITY LEADERSHIP AND THE BUSINESS UNIT HR FUNCTION TO PROVIDE THE FACILITY WITH HUMAN RESOURCE SERVICES. HE/SHE IS RESPONSIBLE FOR UNDERSTANDING THE BUSINESS NEEDS OF THE FACILITY AND THEN TRANSLATING THOSE NEEDS INTO HR SERVICES TO ENSURE THE FACILITY BENEFITS FROM STRATEGIC HUMAN RESOURCE SERVICES AND STANDARDIZED PROCESSES. HE/SHE IS RESPONSIBLE FOR ENSURING BOTH THE NEEDS OF THE BUSINESS AND THE NEEDS OF THE PEOPLE ARE MET WHILE DRIVING COMPANY’S STANDARDIZED PROCESSES INTO THE FACILITY. HE/SHE IS ALSO RESPONSIBLE FOR DRIVING THE STRATEGIC LABOR ACTIVITIES AND INITIATIVES AS IT RELATES TO UNION MANAGEMENT AND LABOR RELATIONS.\n\nJOB DUTIES AND RESPONSIBILITIES\n\nJOB DUTIES AND RESPONSIBILITIES\n\nSPECIFIC DUTIES INCLUDE, BUT ARE NOT LIMITED TO:\n\n COORDINATE STAFFING ACTIVITIES (INCLUDING RECRUITING, SELECTIONS, AND PLACEMENT) FOR THE LOCATION OVERSEE IMPLEMENTATION OF COMPANY POLICIES AND STANDARDIZED PROCESSES WITHIN THE COMPANY FACILITY ENSURE DEVELOPMENT AND IMPLEMENTATION FACILITY STRATEGIES (I.E. TRAINING, SAFETY, COMPLIANCE, LABOR) DEPLOY STRATEGIES AND PROGRAMS AS DESIGNED BY THE COMPANY (E.G. COMPENSATION PLANNING, TALENT MANAGEMENT PROCESSES) PROVIDE FEEDBACK TO THE FACILITY LEADERSHIP, FUNCTION AND CUSTOMERS TO ENSURE BUSINESS NEEDS ARE MET LEAD POSITIVE EMPLOYEE RELATIONS PROGRAMS IN THE FACILITY PROVIDE STRATEGIC HR SOLUTIONS TO PLANT MANAGER AND STAFF FACILITATE ISSUE RESOLUTION BETWEEN EMPLOYEES AND MANAGERS, AS REQUIRED PERFORM EMPLOYEE AND LABOR RELATIONS DUTIES, INCLUDING GRIEVANCE PROCEDURES, WHERE APPLICABLE COORDINATE STAFFING ACTIVITIES (INCLUDING RECRUITING, SELECTIONS, AND PLACEMENT) FOR THE LOCATION ACT AS A CONSULTANT TO BUSINESS LEADERS FOR HUMAN RESOURCE ISSUES (I.E., CAREER DEVELOPMENT, STAFFING, DISCIPLINE, PERFORMANCE AND TALENT MANAGEMENT) ANALYZE HR METRICS AND CREATE AND IMPLEMENT ACTION PLANS BASED ON THOSE METRICS IN LINE WITH THE FUNCTION AND/OR BUSINESS OBJECTIVES ENSURE DEVELOPMENT AND IMPLEMENTATION OF TRAINING STRATEGY WORK COLLABORATIVELY WITH LEAN INITIATIVES TO ENSURE SUCCESS OF CONTINUOUS IMPROVEMENT HELP COORDINATE EMPLOYEE INVOLVEMENT AND COMMUNITY INVOLVEMENT TEAMS AND/OR PROGRAMS ENSURE THAT AFFIRMATIVE ACTION PLANS ARE IN PLACE AND IMPLEMENTED: PARTICIPATE IN ANY OFCCP AUDITS (US ONLY) COORDINATE FACILITY(S)’S COMMUNICATION EFFORTS (I.E., NEWSLETTERS, PLANT MEETINGS, ETC) ENSURE ORIENTATION AND INDUCTION FOR NEWLY HIRED EMPLOYEES AND CONTRACTORS IS COMPLETED PERFORM INTERNAL INVESTIGATIONS, PREPARE NECESSARY DOCUMENTATION, AND TESTIFY AT HEARINGS, AS REQUIRED WORK WITH HEALTH & SAFETY PROFESSIONAL TO ENSURE IMPLEMENTATION OF HEALTH & SAFETY PROGRAMS WORK COLLABORATIVELY WITH GEOGRAPHIC LEAD TO ENSURE ALIGNMENT PROCESS TO REGION IMPLEMENT DIVERSITY STRATEGY WITHIN THE FACILITY\n\nREQUIREMENTS:\n\n 5-7 YEARS OF PROGRESSIVE EXPERIENCE AS HR GENERALIST IN MANUFACTURING FACILITY. UNION FACILITY EXPERIENCE REQUIRED. BACHELOR’S DEGREE IN HUMAN RESOURCES OR RELATED FIELD OR EQUIVALENT EXPERIENCE EXPERIENCED WITH NEGOTIATIONS, UNION RELATIONSHIPS, GRIEVANCES, CONTRACT ADMINISTRATION STRONG UNDERSTANDING OF HR LAW INCLUDING FMLA, ADA, HIPPA, EEOC, ADEA NATURAL ABILITY TO BUILD STRONG WORKING RELATIONSHIPS WITH ORGANIZATIONAL LEADERS ABILITY TO COMMUNICATE EFFECTIVELY WITH INTERNAL AND EXTERNAL CUSTOMER CERTIFICATION IN PROFESSIONAL HUMAN RESOURCES (I.E. PHR) PREFERRED.",
    "job_skill_set": [
      "HR Generalist",
      "Recruiting",
      "Employee Relations",
      "Grievance Procedures",
      "Training Strategy",
      "Bachelor’s Degree in Human Resources",
      "Communication",
      "Relationship Building",
      "Problem Solving",
      "Collaboration",
      "Consultation",
      "Leadership",
      "Adaptability",
      "Conflict Resolution",
      "Union Management",
      "Labor Relations",
      "HR Law",
      "Negotiations",
      "HR Metrics Analysis",
      "Diversity Strategy Implementation",
      "Certification in Professional Human Resources (PHR)"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "bachelors",
      "building",
      "certification",
      "collaboration",
      "communication",
      "conflict",
      "consultation",
      "degree",
      "diversity",
      "employee",
      "generalist",
      "grievance",
      "hr",
      "human",
      "implementation",
      "in",
      "labor",
      "law",
      "leadership",
      "management",
      "manager",
      "metrics",
      "negotiations",
      "phr",
      "problem",
      "procedures",
      "professional",
      "recruiting",
      "relations",
      "relationship",
      "resolution",
      "resources",
      "solving",
      "strategy",
      "training",
      "union"
    ]
  },
  {
    "job_id": "3894550753",
    "job_title": "Human Resources Coordinator (Entry Level) ",
    "category": "HR",
    "job_description": "ORGANIZATION- HYATT REGENCY SALT LAKE CITY\n\nSUMMARY\n\nARE YOU READY TO JOIN A GORGEOUS, AND COOL HOTEL IN THE HEART OF DOWNTOWN SALT LAKE CITY? IF SO, WE ARE SEEKING THE BEST; INDIVIDUALS WHO ARE ENERGETIC, PASSIONATE TO SERVE/HELP OTHERS, AND ENJOY INTERACTING WITH PEOPLE FROM ALL OVER THE GLOBE! OUR IDEAL TEAM PLAYER IS ONE WHO WILL PROUDLY REPRESENT OUR BRAND AND ELEVATE OUR EXPERIENCES WITH US, AS WE GRACIOUSLY WELCOME OUR GUESTS!\n\nAPPLY TODAY, AS THE FIRST STEP TOWARDS JOINING A GLOBAL CORPORATION THAT STILL FEELS LIKE FAMILY!\n\nAT HYATT, WE BELIEVE OUR GUESTS SELECT HYATT BECAUSE OF OUR CARING AND ATTENTIVE COLLEAGUES WHO ARE FOCUSED ON PROVIDING EFFICIENT SERVICE AND MEANINGFUL EXPERIENCES.\n\nHYATT COLLEAGUES WORK IN AN ENVIRONMENT THAT DEMANDS EXCEPTIONAL PERFORMANCE YET REAPS GREAT REWARDS. WHETHER IT’S CAREER OPPORTUNITIES, JOB ENRICHMENT OR A SUPPORTIVE WORK ENVIRONMENT, IF YOU ARE READY FOR THIS CHALLENGE, THEN WE ARE READY FOR YOU!\n\nWHY HYATT REGENCY SALT LAKE CITY?\n\nBENEFITS AND PERKS INCLUDE BUT ARE NOT LIMITED TO:\n\n DISCOUNTED & COMPLIMENTARY HOTEL ROOM NIGHTS RECEIVE UP TO 8 PAID FLOAT DAYS UPON HIRE! *DEPENDENT ON HIRE DATE ENJOY COMPLIMENTARY MEALS IN OUR COLLEAGUE CAFE FOR EVERY SHIFT WORKED MEDICAL, DENTAL, VISION INSURANCE – FULL-TIME COLLEAGUES CAN ENROLL AFTER JUST 30 DAYS! 401K RETIREMENT SAVINGS PLAN AND COMPANY MATCH UP TO $1,000 IN EDUCATIONAL ASSISTANCE PER YEAR OPPORTUNITIES TO WORK AND VISIT HYATT HOTELS AND RESORTS AROUND THE WORLD!\n\nFOR MORE DETAIL AND AN EXCLUSIVE LIST OF BENEFITS APPLY TODAY!\n\nTHE HUMAN RESOURCES FUNCTION PRIDES ITSELF ON EXCELLENCE, SERVICE, INTEGRITY, FUN, AND ACCOUNTABILITY. THIS ENTRY LEVEL POSITION IS FOR PROFESSIONALS LOOKING TO GROW THEIR CAREER WITHIN HYATT HUMAN RESOURCES. THE IDEAL CANDIDATE WILL POSSESS THE FOLLOWING QUALITIES : STRONG INTERPERSONAL SKILLS, SOLID LEADERSHIP, GOOD ORGANIZATION, A ROBUST SENSE OF CREATIVITY , EMPATHETIC/CARING DEMEANOR, WELCOMING PERSONALITY, AND EFFECTIVE TIME-MANAGEMENT.  CANDIDATES MUST ALSO HAVE REFINED VERBAL AND WRITTEN COMMUNICATION SKILLS IN BOTH ENGLISH AND SPANISH. THE HR COORDINATOR WILL REPRESENT THE HR TEAM AND HYATT BRAND IN A PROFESSIONAL, FRIENDLY AND POSITIVE MANNER IN ALL INTERACTIONS.\n\nTHE HUMAN RESOURCES COORDINATOR WILL ASSIST WITH GREETING ALL COLLEAGUES, VISITORS, AND APPLICANTS WHILE MAINTAINING THE DAY-TO-DAY ADMINISTRATIVE FUNCTION OF A HIGHLY ACTIVE HUMAN RESOURCES OFFICE. RESPONSIBILITIES WILL ALSO INCLUDE , ALTHOUGH NOT LIMITED TO: MAINTENANCE OF INCOMING CALLS , ANSWERING/FIELDING QUESTIONS , WALK - IN INQUIRIES, SPECIAL PROJECTS, COLLEAGUE RELATIONS COORDINATION / EXECUTION , MAINTENANCE OF HR OFFICE ENVIRONMENT, AND SUPPORTING OUR RECRUITMENT PROCESS WITH ON-BOARDING ASSISTANCE .\n\nQUALIFICATIONS\n\n MULTI-SYSTEM PROFICIENCY ( I.E. MICROSOFT WORD, EXCEL, PUBLISHER, AND POWERPOINT)  A TRUE DESIRE TO FULFILL THE NEEDS OF OTHERS IN A FAST-PACED ENVIRONMENT  REFINED VERBAL AND WRITTEN COMMUNICATION SKILLS IN ENGLISH AND SPANISH  PROFESSIONAL PRESENTATION SKILLS  PREVIOUS HOSPITALITY HR EXPERIENCE PREFERRED",
    "job_skill_set": [
      "Microsoft Word",
      "Excel",
      "Publisher",
      "HR Administration",
      "Onboarding Assistance",
      "Interpersonal Skills",
      "Leadership",
      "Organization",
      "Creativity",
      "Empathy",
      "Time Management",
      "Communication",
      "Professional Presentation",
      "Customer Service",
      "PowerPoint",
      "Bilingual (English and Spanish)"
    ],
    "short_keywords": [
      "administration",
      "and",
      "assistance",
      "bilingual",
      "communication",
      "coordinator",
      "creativity",
      "customer",
      "empathy",
      "english",
      "entry",
      "excel",
      "hr",
      "human",
      "interpersonal",
      "leadership",
      "level",
      "management",
      "microsoft",
      "onboarding",
      "organization",
      "powerpoint",
      "presentation",
      "professional",
      "publisher",
      "resources",
      "service",
      "skills",
      "spanish",
      "time",
      "word"
    ]
  },
  {
    "job_id": "3887883158",
    "job_title": "Human Resources Coordinator - Hilton Fort Lauderdale Beach Resort",
    "category": "HR",
    "job_description": "THE DYNAMIC HILTON, FORT LAUDERDALE BEACH RESORT IS LOOKING FOR A COORDINATOR TO SUPPORT THEIR HUMAN RESOURCES TEAM.\n\nTHE IDEAL CANDIDATE IS OUTGOING AND UNDERSTANDS THE IMPORTANCE OF EMPATHY IN THE HOSPITALITY INDUSTRY. MUST BE CONFIDENT IN THEIR ABILITY TO MANAGE MULTIPLE PROJECTS AND BE DETAIL ORIENTED. PREVIOUS EXPERIENCE IN HUMAN RESOURCES AND MEDICAL INDUSTRY ARE A PLUS.\n\nWHAT WILL I BE DOING?:\n\nPROVIDES THE HUMAN RESOURCES TRAINING/EDUCATION AND PROFESSIONAL DEVELOPMENT MANAGERS WITH ADMINISTRATIVE AND CLERICAL SUPPORT INCLUDING WORD- PROCESSING, TYPING, E-MAILING, FILING, DATA-ENTRY, FAXING, COPYING, CORRESPONDING, ANSWERING TELEPHONES, PROCESSING MAIL, TAKING NOTES AND/OR DICTATION, MAKING TRAVEL ARRANGEMENTS AND PERFORMING OTHER GENERAL OFFICE DUTIES.\n\nWHAT ARE WE LOOKING FOR?\n\nSINCE BEING FOUNDED IN 1919, HILTON HAS BEEN A LEADER IN THE HOSPITALITY INDUSTRY. TODAY, HILTON REMAINS A BEACON OF INNOVATION, QUALITY, AND SUCCESS. THIS CONTINUED LEADERSHIP IS THE RESULT OF OUR TEAM MEMBERS STAYING TRUE TO OUR VISION, MISSION, AND VALUES. SPECIFICALLY, WE LOOK FOR DEMONSTRATION OF THESE VALUES:\n\nHOSPITALITY - WE'RE PASSIONATE ABOUT DELIVERING EXCEPTIONAL GUEST EXPERIENCES. INTEGRITY - WE DO THE RIGHT THING, ALL THE TIME. LEADERSHIP - WE'RE LEADERS IN OUR INDUSTRY AND IN OUR COMMUNITIES. TEAMWORK - WE'RE TEAM PLAYERS IN EVERYTHING WE DO. OWNERSHIP - WE'RE THE OWNERS OF OUR ACTIONS AND DECISIONS. NOW - WE OPERATE WITH A SENSE OF URGENCY AND DISCIPLINE \n\n\nIN ADDITION, WE LOOK FOR THE DEMONSTRATION OF THE FOLLOWING KEY ATTRIBUTES:\n\nQUALITY PRODUCTIVITY DEPENDABILITY CUSTOMER FOCUS ADAPTABILITY \n\n\nWHAT WILL IT BE LIKE TO WORK FOR HILTON?\n\nHILTON IS THE LEADING GLOBAL HOSPITALITY COMPANY, SPANNING THE LODGING SECTOR FROM LUXURIOUS FULL-SERVICE HOTELS AND RESORTS TO EXTENDED-STAY SUITES AND MID-PRICED HOTELS. FOR NEARLY A CENTURY, HILTON HAS OFFERED BUSINESS AND LEISURE TRAVELERS THE FINEST IN ACCOMMODATIONS, SERVICE, AMENITIES AND VALUE. HILTON IS DEDICATED TO CONTINUING ITS TRADITION OF PROVIDING EXCEPTIONAL GUEST EXPERIENCES ACROSS ITS GLOBAL BRANDS. OUR VISION “TO FILL THE EARTH WITH THE LIGHT AND WARMTH OF HOSPITALITY” UNITES US AS A TEAM TO CREATE REMARKABLE HOSPITALITY EXPERIENCES AROUND THE WORLD EVERY DAY. AND, OUR AMAZING TEAM MEMBERS ARE AT THE HEART OF IT ALL!\n\nWORK LOCATIONS\n\nHILTON FORT LAUDERDALE BEACH RESORT\n\nSCHEDULE\n\nFULL-TIME\n\nBRAND\n\nHILTON HOTELS & RESORTS\n\nJOB\n\nHUMAN RESOURCES",
    "job_skill_set": [
      "human resources",
      "administrative support",
      "data entry",
      "word processing",
      "typing",
      "emailing",
      "filing",
      "copying",
      "travel arrangements",
      "empathy",
      "communication",
      "teamwork",
      "adaptability",
      "dependability",
      "customer focus",
      "leadership",
      "ownership",
      "quality productivity",
      "attention to detail",
      "faxing"
    ],
    "short_keywords": [
      "adaptability",
      "administrative",
      "arrangements",
      "attention",
      "beach",
      "communication",
      "coordinator",
      "copying",
      "customer",
      "data",
      "dependability",
      "detail",
      "emailing",
      "empathy",
      "entry",
      "faxing",
      "filing",
      "focus",
      "fort",
      "hilton",
      "hr",
      "human",
      "lauderdale",
      "leadership",
      "ownership",
      "processing",
      "productivity",
      "quality",
      "resort",
      "resources",
      "support",
      "teamwork",
      "to",
      "travel",
      "typing",
      "word"
    ]
  },
  {
    "job_id": "3903487939",
    "job_title": "Human Resources Business Partner",
    "category": "HR",
    "job_description": "JOB TITLE: HR BUSINESS PARTNERLOCATION: HERNDON, VA - WASHINGTON, DC AREA PREFERRED\nEVERFOX IS SEEKING AN HRBP, US POSITION. THIS IS AN IDEAL OPPORTUNITY FOR AN ENERGETIC AND INNOVATIVE HR PROFESSIONAL WHO WOULD LIKE TO JOIN A FAST-MOVING CYBER SECURITY LEADER. AS PART OF THE EVERFOX HR TEAM, YOU’LL BE ALIGNED WITH OUR G&A ORGANIZATION AND BRING STRONG FUNCTIONAL HUMAN RESOURCES EXPERTISE, BUSINESS ACUMEN, CULTURAL AWARENESS, CONSULTATIVE SKILLS, AND CUSTOMER SERVICE ORIENTATION.\nTHE PERSON IN THIS ROLE SHOULD HAVE PROVEN EXPERIENCE UNDERSTANDING BUSINESS CONCEPTS AND ALIGNING BUSINESS NEEDS WITH HR SUPPORT AND SOLUTIONS TO MOVE THE BUSINESS AHEAD. THE CANDIDATE SHOULD ALSO BE ABLE TO DEMONSTRATE INTERPERSONAL AWARENESS TO EFFECTIVELY BUILD AND SUSTAIN STRONG PARTNERSHIPS WITH TRUST AND CREDIBILITY ACROSS THE BUSINESS.\nRESPONSIBILITIESFUNCTION AS THE RECOGNIZED EXPERT ON ORGANIZATIONAL ISSUES AND SERVE AS A TRUSTED ADVISOR AND BUSINESS PARTNER TO THE G&A ORGANIZATIONWORK WITH THE LEADERSHIP TEAM TO DEVELOP AND IMPLEMENT HUMAN RESOURCES STRATEGIES, INITIATIVES, AND GOALS THAT SUPPORT COMPANY BUSINESS OBJECTIVESPROVIDE DAY-TO-DAY GUIDANCE TO CROSS-FUNCTIONAL LEADERSHIP ON COACHING, COUNSELING, CAREER DEVELOPMENT, AND PERFORMANCE MANAGEMENT ALIGNED WITH MULTIPLE STATE LAWS AND REGULATIONS.ANALYZE EMPLOYEE INSIGHTS AND DATA AND IMPLEMENT PROGRAMS TO IMPROVE OVERALL PEOPLE SATISFACTIONPROVIDE GUIDANCE ON EMPLOYEE RELATIONS MATTERS AND CONDUCT INVESTIGATIONS, AS NEEDEDENSURE POLICIES, PRACTICES AND PROGRAMS ARE ADMINISTERED IN A FAIR AND CONSISTENT MANNER THAT ALIGNS TO MANDATES OF LOCAL LAWS AND REGULATIONS.PARTNER WITH BUSINESS LEADERS ON TALENT MANAGEMENT TO IDENTIFY AND DEVELOP INTERNAL TALENT, REWARD HIGH PERFORMERS, AND IMPROVE RETENTION ACROSS THE ORGANIZATIONWORK WITH BUSINESS UNIT LEADERS TO DEFINE, DEVELOP AND MAINTAIN A CULTURE THAT INSPIRES AND FOSTERS HIGH EMPLOYEE PERFORMANCE AND ENGAGEMENT QUALIFICATIONSBACHELOR’S DEGREE OR EQUIVALENT PREFERRED; MINIMUM OF 5 YEARS RELEVANT AND PROGRESSIVE EXPERIENCE IN HUMAN RESOURCESEXPERIENCE WORKING WITH GLOBAL HR TEAMS AND DEMONSTRATED ABILITY TO ASSESS AND IMPLEMENT POLICIES TO COMPLY MULTIPLE STATE LAWS AND REGULATIONS.EXPERIENCE ALIGNING WITH GLOBAL LEADERS TO CREATE A BEST-IN-CLASS EMPLOYEE EXPERIENCE.DEMONSTRATED ABILITY TO DEAL EFFECTIVELY WITH AMBIGUITY AND CHANGE MANAGEMENT AND IDENTIFY SYSTEMIC APPROACHES TO SOLVING PROBLEMS.EXPERIENCE WORKING WITH EMPLOYEES AT ALL LEVELS, ACROSS MULTIPLE GROUPS, MULTIPLE GEOGRAPHIES AND WITHIN COMPLEX ENVIRONMENTS.STRONG BUSINESS AND GLOBAL ACUMEN, CURIOSITY, LEARNING AGILITY, AND LEARNING/GROWTH MINDSETABILITY TO ASSESS AND TRANSLATE WORKFORCE IMPLICATIONS, AND IDENTIFY RELEVANT SOLUTIONSSTRONG ASSESSOR OF TALENT AND ABLE TO COACH FOR DEVELOPMENT, WITH EXCEPTIONAL CONSULTATIVE AND FACILITATION SKILLS AND ABILITY TO INFLUENCE SENIOR LEADERSWORKDAY EXPERIENCE AND EXCEL PROFICIENCY A PLUSSTRONG COMMUNICATION, BOTH VERBAL AND WRITTEN.",
    "job_skill_set": [
      "human resources expertise",
      "employee relations",
      "data analysis",
      "excel",
      "problem solving",
      "communication",
      "business acumen",
      "consultative skills",
      "performance management",
      "talent management",
      "workday",
      "compliance with laws and regulations",
      "interpersonal awareness",
      "partnership building",
      "coaching",
      "change management",
      "curiosity",
      "learning agility",
      "influencing",
      "cultural awareness"
    ],
    "short_keywords": [
      "acumen",
      "agility",
      "analysis",
      "and",
      "awareness",
      "building",
      "business",
      "change",
      "coaching",
      "communication",
      "compliance",
      "consultative",
      "cultural",
      "curiosity",
      "data",
      "employee",
      "excel",
      "expertise",
      "hr",
      "human",
      "influencing",
      "interpersonal",
      "laws",
      "learning",
      "management",
      "partner",
      "partnership",
      "performance",
      "problem",
      "regulations",
      "relations",
      "resources",
      "skills",
      "solving",
      "talent",
      "with",
      "workday"
    ]
  },
  {
    "job_id": "3905240750",
    "job_title": "Human Resources Assistant",
    "category": "HR",
    "job_description": "JOB TITLE: HR ASSISTANT 2LOCATION: DAVIDSON, NCDURATION: 3 MONTHS (HYBRID) TEMPORARY ASSIGNMENT WITH THE POTENTIAL FOR EXTENSION. SUMMARY:MAINTAIN THE HUMAN RESOURCE RECORDS OF AN ORGANIZATION’S EMPLOYEES.RESPONSIBLE FOR MAINTAINING PERSONNEL DOCUMENTS AS WELL AS PERFORMING BACKGROUND CHECKS, ALONG WITH OTHER EMPLOYEE-RELATED ACTIVITIES.MAJOR JOB DUTIES AND RESPONSIBILITIES:PROCESS, VERIFY, AND MAINTAIN EMPLOYEE JOB AND PAY DATA RECORDS.PERFORM EMPLOYEE ONBOARDING ACTIVITIES, INCLUDING INITIATING BACKGROUND AND DRUG SCREENINGS.PARTNER WITH OTHER TEAM MEMBERS, TALENT ACQUISITION, AND HR PARTNERS TO ENSURE EMPLOYEE DATA ACCURACY.EDUCATION/EXPERIENCE:HIGH SCHOOL DIPLOMA OR GED REQUIRED.BACHELOR’S DEGREE PREFERRED.SKILLS AND COMPETENCIES:VERBAL AND WRITTEN COMMUNICATION SKILLSATTENTION TO DETAIL.CUSTOMER SERVICE AND INTERPERSONAL SKILLS.ABILITY TO WORK INDEPENDENTLY AND MANAGE ONE’S TIME.ABILITY TO ACCURATELY DOCUMENT AND RECORD CUSTOMER/CLIENT INFORMATION.PREVIOUS EXPERIENCE WITH COMPUTER APPLICATIONS, SUCH AS MICROSOFT WORD AND EXCEL. \nABOUT US: ESTABLISHED IN 2004, SPECTRAFORCE® IS ONE OF THE LARGEST AND FASTEST-GROWING DIVERSITY-OWNED STAFFING FIRMS IN THE US. THE GROWTH OF OUR COMPANY IS A DIRECT RESULT OF OUR GLOBAL CLIENT SERVICE DELIVERY MODEL THAT IS POWERED BY OUR STATE-OF-THE-ART A.I. PROPRIETARY TALENT ACQUISITION PLATFORM, ROBUST ISO 9001:2015/ISO 27001 CERTIFIED PROCESSES, AND STRONG AND PASSIONATE CLIENT ENGAGED TEAMS. WE HAVE BUILT OUR BUSINESS BY PROVIDING TALENT AND PROJECT-BASED SOLUTIONS, INCLUDING CONTINGENT, PERMANENT, AND STATEMENT OF WORK (SOW) SERVICES TO OVER 140 CLIENTS IN THE US, CANADA, PUERTO RICO, COSTA RICA, AND INDIA. KEY INDUSTRIES THAT WE SERVICE INCLUDE TECHNOLOGY, FINANCIAL SERVICES, LIFE SCIENCES, HEALTHCARE, TELECOM, RETAIL, UTILITIES AND TRANSPORTATION. SPECTRAFORCE IS BUILT ON A CONCEPT OF “HUMAN CONNECTION,” DEFINED BY OUR BRANDING ATTITUDE OF NEWJOBPHORIA®, WHICH IS THE EXCITEMENT OF BRINGING JOY AND FREEDOM TO THE WORK LIFESTYLE SO OUR PEOPLE AND CLIENTS CAN REACH THEIR HIGHEST POTENTIAL. LEARN MORE AT: HTTP://WWW.SPECTRAFORCE.COM BENEFITS: SPECTRAFORCE OFFERS ACA COMPLIANT HEALTH BENEFITS AS WELL AS DENTAL, VISION, ACCIDENT, CRITICAL ILLNESS, VOLUNTARY LIFE, AND HOSPITAL INDEMNITY INSURANCES TO ELIGIBLE EMPLOYEES. ADDITIONAL BENEFITS OFFERED TO ELIGIBLE EMPLOYEES INCLUDE COMMUTER BENEFITS, 401K PLAN WITH MATCHING, AND A REFERRAL BONUS PROGRAM. SPECTRAFORCE PROVIDES UNPAID LEAVE AS WELL AS PAID SICK LEAVE WHEN REQUIRED BY LAW.\nEQUAL OPPORTUNITY EMPLOYER: SPECTRAFORCE IS AN EQUAL OPPORTUNITY EMPLOYER AND DOES NOT DISCRIMINATE AGAINST ANY EMPLOYEE OR APPLICANT FOR EMPLOYMENT BECAUSE OF RACE, RELIGION, COLOR, SEX, NATIONAL ORIGIN, AGE, SEXUAL ORIENTATION, GENDER IDENTITY, GENETIC INFORMATION, DISABILITY OR VETERAN STATUS, OR ANY OTHER CATEGORY PROTECTED BY APPLICABLE FEDERAL, STATE, OR LOCAL LAWS. PLEASE CONTACT HUMAN RESOURCES AT LOA@SPECTRAFORCE.COM IF YOU REQUIRE REASONABLE ACCOMMODATION. AT SPECTRAFORCE, WE ARE COMMITTED TO MAINTAINING A WORKPLACE THAT ENSURES FAIR COMPENSATION AND WAGE TRANSPARENCY IN ADHERENCE WITH ALL APPLICABLE STATE AND LOCAL LAWS. THIS POSITION’S STARTING PAY IS: $20.23/HR.",
    "job_skill_set": [
      "Microsoft Word",
      "Microsoft Excel",
      "Background Checks",
      "Employee Onboarding",
      "Data Accuracy",
      "Verbal Communication",
      "Written Communication",
      "Attention to Detail",
      "Customer Service",
      "Interpersonal Skills",
      "Time Management",
      "Independent Work"
    ],
    "short_keywords": [
      "accuracy",
      "assistant",
      "attention",
      "background",
      "checks",
      "communication",
      "customer",
      "data",
      "detail",
      "employee",
      "excel",
      "hr",
      "human",
      "independent",
      "interpersonal",
      "management",
      "microsoft",
      "onboarding",
      "resources",
      "service",
      "skills",
      "time",
      "to",
      "verbal",
      "word",
      "work",
      "written"
    ]
  },
  {
    "job_id": "3901340617",
    "job_title": "Human Resources Administrator",
    "category": "HR",
    "job_description": "POSITION SUMMARY:WE ARE IN SEARCH OF AN ENERGETIC AND ENTHUSIASTIC HR ADMINISTRATOR TO JOIN OUR TELNET WORLDWIDE TEAM. THIS WILL BE A GREAT, ENTRY-LEVEL, OPPORTUNITY AND WILL ALLOW AN INDIVIDUAL TO GAIN EXPERIENCE IN THE TELECOMMUNICATIONS INDUSTRY AND HUMAN RESOURCES FIELD. THIS POSITION WILL BE RESPONSIBLE FOR SUPPORTING ALL AREAS OF HR INCLUDING RECRUITING, BENEFITS, POLICY, HRIS (HR INFORMATION SYSTEMS), HIRING, HIRING DOCUMENTATION, TERMINATION, TERMINATION DOCUMENTATION, ENGAGEMENT PROGRAMS, AND ONBOARDING OF NEW HIRES. THE PRIMARY FOCUS OF THE ROLE WILL BE MANAGING RECRUITING EFFORTS AND FACILITATING EMPLOYEE ENGAGEMENT,SALARY NEGOTIATIONS ARE COMMENSURATE WITH EXPERIENCE LEVEL AND SECONDARY EDUCATIONESSENTIAL RESPONSIBILITIES:REVIEW RESUMES AND PRE-SCREEN APPLICANTS AGAINST THE POSITION REQUIREMENTS.SCHEDULE & CONDUCT INTERVIEWS UTILIZING CURRENT TECHNOLOGY APPLICATIONS.USE OF INTERNET, AND ONLINE RECRUITING SOURCES TO IDENTIFY AND RECRUIT CANDIDATES TO INCLUDE: JOB BOARDS, SOCIAL MEDIA, TARGETED INDUSTRY GROUPS, AND NETWORKING.SUPPORT THE ON-BOARDING PROCESS FOR NEW HIRES.FACILITATE NEW HIRE ORIENTATIONMANAGE THE APPLICATIONS OF CURRENT TECHNOLOGY TO INFORM AND COMMUNICATE INFORMATION.ASSIST IN THE DAY-TO-DAY OPERATIONS; COMMUNICATIONS TO STAFF, ORGANIZATIONAL CHARTING, EMPLOYMENT PRACTICES, AND COMMUNITY RELATIONS, AND SUPPORT THE DIRECTIVES OF HR MANAGER, COO, AND PRESIDENT.MONITOR EMPLOYEE FILE INFORMATION; EMERGENCY CONTACT, BANKING, BENEFIT DEDUCTIONS, TAX DEDUCTIONS, ADDRESS, AND PERSONAL INFORMATION THROUGH VARIOUS SYSTEMS.FACILITATE MONTHLY EMPLOYEE CONTESTSLEAD EMPLOYEE ENGAGEMENTSENT AND TRACK EARLY EMPLOYMENT SURVEYSSUPPORT THE HR MANAGER WITH THE REVIEW OF TELNET’S HANDBOOK; MODIFY, ADD, DELETE AND CREATE NEW POLICIES THAT WILL ENHANCE THE OVERALL OPERATIONS OF THE COMPANY WHILE MAINTAINING A SOLID LEGAL OBLIGATION TO EMPLOYMENT PRACTICES.SUPPORT FMLA PROCESSESMAINTAIN CONFIDENTIALITYCOMPLETE HR-RELATED PROJECTS AS ASSIGNEDESSENTIAL KNOWLEDGE, SKILLS, AND ABILITIES:0-2 YEARS OF RELATED EXPERIENCE IN A SIMILAR ROLE IS REQUIREDPURSUING OR ATTAINMENT OF A BACHELOR’S DEGREE IN HR OR A RELATED DISCIPLINE PREFERREDPROACTIVE ATTITUDEPROFESSIONALISMEXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLSEXCELLENT INTERPERSONAL AND RELATIONAL SKILLSSTRONG PROJECT MANAGEMENT, PLANNING, AND ORGANIZATION SKILLSSTRONG ANALYTICAL SKILLSSTRONG ADAPTABILITY SKILLSSTRONG DECISION-MAKING AND PROBLEM-SOLVING SKILLSABILITY TO PRIORITIZE MULTIPLE TASKS AND WORK WITH END-USERS TO MEET APPROPRIATE DEADLINESGREAT ATTENTION TO DETAILSTRONG ABILITY TO USE GOOGLE SUITE PROGRAMS, MIS PROGRAMSWORK ENVIRONMENT:OFFICEREMOTEPHYSICAL DEMANDS: SITTING FOR EXTENDED PERIODSREACHING IN ANY DIRECTIONCOMMUNICATION SKILLS USING SPOKEN WORDVISUALIZATION NECESSARY TO PARTICIPATE IN BUSINESS FUNCTIONSABILITY TO TRAVEL BY CAR, PLANE, AND TRAIN TO ATTEND MEETINGS (IF APPLICABLE)ADA: THE EMPLOYER WILL MAKE REASONABLE ACCOMMODATIONS IN COMPLIANCE WITH THE AMERICANS WITH DISABILITIES ACT OF 1990.*THIS JOB DESCRIPTION IN NO WAY STATES OR IMPLIES THAT THESE ARE THE ONLY DUTIES TO BE PERFORMED BY THE EMPLOYEE INCUMBENT IN THIS POSITION. EMPLOYEE WILL BE REQUIRED TO FOLLOW ANY OTHER JOB-RELATED INSTRUCTIONS AND TO PERFORM JOB-RELATED DUTIES REQUESTED BY ANY PERSON AUTHORIZED TO GIVE INSTRUCTION OR ASSIGNMENTS.",
    "job_skill_set": [
      "HRIS (HR Information Systems)",
      "Recruiting",
      "Google Suite",
      "Project Management",
      "Analytical Skills",
      "Policy Development",
      "Employee Engagement Programs",
      "Communication",
      "Interpersonal Skills",
      "Professionalism",
      "Adaptability",
      "Decision-Making",
      "Problem-Solving",
      "Attention to Detail",
      "Time Management",
      "Teamwork",
      "Onboarding",
      "Documentation Management"
    ],
    "short_keywords": [
      "adaptability",
      "administrator",
      "analytical",
      "attention",
      "communication",
      "decisionmaking",
      "detail",
      "development",
      "documentation",
      "employee",
      "engagement",
      "google",
      "hr",
      "hris",
      "human",
      "information",
      "interpersonal",
      "management",
      "onboarding",
      "policy",
      "problemsolving",
      "professionalism",
      "programs",
      "project",
      "recruiting",
      "resources",
      "skills",
      "suite",
      "systems",
      "teamwork",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3885116060",
    "job_title": "Human Resources Business Partner",
    "category": "HR",
    "job_description": "SEQULITE GENOMICS IS A GROWING LIFE SCIENCE COMPANY DEVELOPING AN NGS PLATFORM TO ENABLE SEQUENCING FOR EVERYONE.WE ARE SEEKING A HIGHLY SKILLED AND MOTIVATED HUMAN RESOURCE BUSINESS PARTNER TO JOIN OUR DYNAMIC TEAM. THE HRBP WILL PLAY A PIVOTAL ROLE IN SUPPORTING VARIOUS HR FUNCTIONS INCLUDING TALENT ACQUISITION AND MANAGEMENT, COMPENSATION AND BENEFITS, EMPLOYEE RELATIONS, AND HR POLICY DEVELOPMENT. THE IDEAL CANDIDATE WILL HAVE A STRONG BACKGROUND IN HR PRACTICES AND REGULATIONS, EXCELLENT COMMUNICATION SKILLS, AND THE ABILITY TO THRIVE IN A FAST-PACED ENVIRONMENT.\n\nJOB DESCRIPTION\n\nKEY RESPONSIBILITIESCOORDINATE WITH DEPARTMENT LEADERS TO BUILD AND MAINTAIN A COMPETENT WORKFORCE.UNDERSTAND COMPANY’S BUSINESS AND TALENT NEEDS, ANALYZE STAFFING LEVELS TO FORECAST WORKFORCE NEEDS, AND DESIGN EFFECTIVE STRATEGIES FOR SOURCING, RECRUITING, AND EVALUATING QUALIFIED JOB CANDIDATES.USE A VARIETY OF TALENT SOURCES, TECHNOLOGY, AND RECRUITING METHODS TO SOURCE AND RECRUIT QUALIFIED APPLICANTS.REVIEW APPLICATIONS, LIAISE WITH JOB APPLICANTS, AND USE APPROPRIATE HIRING METHODS TO BEST EVALUATE A CANDIDATE’S TECHNICAL SKILLS, FIT, AND ALIGNMENT WITH THE COMPANY’S COMPETENCIES AND NEEDS.ESTABLISH AN EMPLOYER VALUE PROPOSITION AND EMPLOYMENT BRAND THAT SUPPORTS THE RECRUITMENT OF HIGH-QUALITY JOB APPLICANTS.DEVELOP A COMPENSATION STRATEGY BASED ON THE PARENT COMPANY’S PAY PHILOSOPHY AND LOCAL TALENT MARKET, CONDUCT SALARY NEGOTIATIONS WITH PROSPECTIVE EMPLOYEES AND CONTINUE IMPROVING THE NEGOTIATION PROCESS.DESIGN AND IMPLEMENT COMPENSATION SYSTEMS AND BENEFIT PACKAGES TO ATTRACT AND RETAIN EMPLOYEES.DEVELOP AND OVERSEE COMPENSATION AND BENEFITS PHILOSOPHIES, STRATEGIES, AND PLANS THAT ALIGN WITH THE COMPANY’S STRATEGIC DIRECTION AND TALENT NEEDS.COORDINATE PTO, INSURANCE, PAYROLL, AND OTHER EMPLOYMENT-RELATED BENEFITS AND SERVICES WITH SERVICE PROVIDERS.COLLECT, COMPILE AND INTERPRET COMPENSATION AND BENEFITS DATA TO PERFORM ACCURATE JOB EVALUATIONS TO IMPROVE COMPENSATION PACKAGES.RESEARCH EXTERNAL VENDORS, PERFORM COST ANALYSIS AND PROPOSE NEW SERVICE PROVIDERS THAT CAN ADD OR IMPROVE THE EMPLOYEES’ CURRENT BENEFITS.ENSURE THE INTERNAL EQUITY OF COMPENSATION SYSTEMS.IMPROVE THE RELATIONSHIP BETWEEN EMPLOYEES AND THE COMPANY BY HANDLING QUESTIONS, INTERPRETING AND ADMINISTERING HR POLICIES AND PROGRAMS, AND HELPING RESOLVE WORK-RELATED PROBLEMS.ANSWER EMPLOYEE QUESTIONS REGARDING THE INTERPRETATION OF COMPANY POLICIES AND PROCEDURES, BENEFITS ADMINISTRATION AND PAYROLL, AND REPORT EMPLOYEE FEEDBACK AND CONCERNS TO MANAGEMENT.HOLISTICALLY MONITOR THE COMPANY’S METRICS ON EMPLOYEE ATTITUDES, TURNOVER AND RETENTION, AND OTHER INFORMATION ABOUT EMPLOYEE ENGAGEMENT AND RETENTION.HELP MITIGATE EMPLOYMENT-RELATED CONFLICTS, AND ENHANCE THE EMPLOYEE GRIEVANCE AND DISCIPLINE PROCESSES.PROVIDE RECOMMENDATIONS FOR ELIMINATING BARRIERS TO BUILD A SUCCESSFUL WORKPLACE WITH DIVERSITY, EQUITY, AND INCLUSION.MANAGE EMPLOYEES’ PERFORMANCE AND UPSKILL EMPLOYEES TO IMPROVE THE WHOLE COMPANY’S COMPETENCIES.CREATE STRATEGIES TO DEVELOP TALENT AND ENSURE THE RETENTION OF KNOWLEDGE. DESIGN AND COMMUNICATE PERFORMANCE REVIEW PROGRAMS WITH LEADERS AND EMPLOYEES.OVERSEE THE PERFORMANCE REVIEW PROCESS AND PROVIDE SUPPORT AND TRAINING TO UNDERPERFORMING EMPLOYEES.PERFORM REALISTIC JOB AND WORKFORCE ANALYSIS TO UNDERSTAND THE CURRENT COMPETENCE LEVEL AND COMPETENCIES NEEDED FOR FUTURE PROJECTS, RESEARCH LEARNING AND DEVELOPMENT RESOURCES, SUGGEST SOLUTIONS, AND PROMOTE THE IMPLEMENTATION OF SOLUTIONS.PROVIDE PROSPECTIVE EMPLOYEES WITH INFORMATION ABOUT POLICIES, JOB DUTIES, WORKING CONDITIONS, WAGES, OPPORTUNITIES FOR PROMOTION, AND EMPLOYEE BENEFITS.DESIGN AND IMPLEMENT EFFECTIVE ONBOARDING AND ORIENTATION PROGRAMS FOR NEW EMPLOYEES.COORDINATE ACTIVITIES TO HELP NEW EMPLOYEES BETTER UNDERSTAND COMPANY POLICIES AND ADAPT TO THE COMPANY’S ENVIRONMENT.DESIGN PERFORMANCE MANAGEMENT PROGRAMS FOR NEW EMPLOYEES AND OBTAIN PERFORMANCE FEEDBACK FROM DEPARTMENT HEADS AND TEAM LEADERS.DEVELOP AND MAINTAIN HR CORPORATE AND GENERAL POLICIES AND PROCEDURES.RESEARCH COMPANY COMPLIANCE WITH NEW OR UPDATED APPLICABLE EMPLOYMENT LAWS REGARDING BENEFITS ADMINISTRATION AND RECRUITMENT, AND DIFFERENTIATE BETWEEN GOVERNMENT-MANDATED, GOVERNMENT-PROVIDED, AND VOLUNTARY BENEFIT APPROACHES.UPDATE THE EMPLOYEE HANDBOOK, COMPENSATION AND BENEFITS PACKAGES, AND RECRUITING DOCUMENTATION ON A REGULAR BASIS IN REGARD TO THE NEW REGULATIONS.EDUCATE AND ADVISE LEADERS ON HR-RELATED LEGAL AND REGULATORY COMPLIANCE ISSUES\n\nQUALIFICATIONS\n\nMASTER’S DEGREE OR ITS EQUIVALENT IN HUMAN RESOURCES MANAGEMENT (HR) OR A RELATED FIELD, PLUS 3 YEARS OF EXPERIENCE AS HR BUSINESS PARTNER OR IN ANY POSTBACCALAUREATE HR OCCUPATION IN WHICH THE REQUIRED EXPERIENCE WAS GAINED.EXPERIENCE PROVIDING COMPREHENSIVE HUMAN RESOURCES SUPPORT, INCLUDING PARTNERING WITH TECHNICAL GROUPS AND IMPLEMENTING ORGANIZATIONAL DEVELOPMENT, GROWTH, AND CHANGE PROGRAMS IN A DIVERSE BUSINESS SETTING.EXPERIENCE IN ANALYZING TALENT-RELATED DATA AND PROVIDING INSIGHTS, INCLUDING POINT FACTOR ANALYSIS, FACTOR COMPARISON, BALANCED SCORECARD, PERFORMANCE METRICS, NPS, AND RJP.EXCELLENT PROFESSIONAL AND INTERPERSONAL SKILLS, AS WELL AS PROFICIENCY IN U.S. EMPLOYMENT LAWS AND REGULATIONS, INCLUDING E-VERIFY, AND COMPLETING IRS EMPLOYMENT FORMS.PROFICIENCY IN USING TALENT SOURCING AND RECRUITING TOOLS.EXPERIENCE IN DESIGNING AND EXECUTING SELF-FUNDED AND FULLY-INSURED BENEFITS PLANS, INCLUDING HSA, FSA, COBRA, AND PROCESSING UNEMPLOYMENT BENEFITS.\n\nADDITIONAL INFORMATION\n\nRATE OF PAY：\n\nFULL TIME $202,613/YR\n\nJOIN OUR TEAM AND GROW WITH US:FINANCIAL SECURITY THROUGH COMPETITIVE COMPENSATION, INCENTIVES, AND RETIREMENT PLANHEALTH CARE AND WELL-BEING PROGRAMS INCLUDING COMPETITIVE MEDICAL, DENTAL, VISION & MEDICAL BENEFITSGENEROUS PAID TIME OFF INCLUDING VACATION, SICK TIME, HOLIDAYS, AND WINTER SHUTDOWN401(K) RETIREMENT SAVINGS WITH A GENEROUS COMPANY MATCHCOMMUTER BENEFITSOTHER COMPREHENSIVE VOLUNTARY BENEFITS INCLUDE BUT ARE NOT LIMITED TO PET INSURANCE, LIFE INSURANCE, EMPLOYEE ASSISTANCE PROGRAM (EAP), DISCOUNT PROGRAMS, AND MANY MOREWE CONTINUE TO OPTIMIZE OUR BENEFITS & WELLNESS PROGRAMS AS WE GROW OUR ORGANIZATION TO MAKE SURE THEY MEET OUR DIVERSE WORKFORCE NEEDSTHE STABILITY OF A STARTUP BACKED BY A COMPANY WITH A RECORD OF STRONG FINANCIAL PERFORMANCE YEAR OVER YEAR",
    "job_skill_set": [
      "HR practices",
      "talent acquisition",
      "compensation and benefits",
      "employee relations",
      "HR policy development",
      "data analysis",
      "U.S. employment laws",
      "recruiting tools",
      "benefits plans design",
      "performance metrics",
      "communication",
      "interpersonal skills",
      "problem solving",
      "adaptability",
      "teamwork",
      "strategic thinking",
      "conflict resolution",
      "leadership",
      "organizational skills",
      "employee engagement"
    ],
    "short_keywords": [
      "acquisition",
      "adaptability",
      "analysis",
      "and",
      "benefits",
      "business",
      "communication",
      "compensation",
      "conflict",
      "data",
      "design",
      "development",
      "employee",
      "employment",
      "engagement",
      "hr",
      "human",
      "interpersonal",
      "laws",
      "leadership",
      "metrics",
      "organizational",
      "partner",
      "performance",
      "plans",
      "policy",
      "practices",
      "problem",
      "recruiting",
      "relations",
      "resolution",
      "resources",
      "skills",
      "solving",
      "strategic",
      "talent",
      "teamwork",
      "thinking",
      "tools",
      "us"
    ]
  },
  {
    "job_id": "3901672756",
    "job_title": "Human Resource Lead",
    "category": "HR",
    "job_description": "THE HUMAN RESOURCE LEAD POSITION IS RESPONSIBLE FOR LEADING THE EXECUTION OF THE HUMAN RESOURCES, SCHEDULING AND CASH OFFICE FUNCTIONS. RESPONSIBILITIES INCLUDE ASSOCIATE RECRUITMENT, HIRING, ON-BOARDING, BENEFITS, EMPLOYEE RELATIONS, TRAINING, PERFORMANCE, POLICY COMMUNICATION, AND SCHEDULING. THE HUMAN RESOURCE LEAD IS A NON-EXEMPT ROLE REPORTING TO THE HUMAN RESOURCE MANAGER OR STORE MANAGER.\n\n ENSURE THAT ASSOCIATE ON-BOARDING IS EXECUTED PROFICIENTLY, ACCURATELY AND IN A TIMELY MANNER. ENSURES I-9/E-VERIFY AND BACKGROUND CHECK COMPLIANCE LEAD THE PERFORMANCE APPRAISAL PROCESS AND MAINTAINS PERSONNEL FILES ENSURE BENEFIT ADMINISTRATION AND COMMUNICATION OCCURS IN A TIMELY MANNER ASSISTS WITH EMPLOYEE RELATIONS BY WITNESSING ASSOCIATE COACHING AND COUNSELING; SUBMIT TERMINATION REQUESTS AS DIRECTED BY EXECUTIVES AND ADMINISTER EXIT INTERVIEWS SUBMIT WORKDAY CHANGES AND ENSURES DATA ACCURACY PREPARE, PROCESS AND MEET WEEKLY PAYROLL DEADLINES. ENSURE PAYROLL IS ACCURATE TRAIN ALL NEW ASSOCIATES AND MANAGERS ON THE SCHEDULING PROCESS AND SYSTEM NAVIGATION WORK WITH STORE EXECUTIVES TO ENSURES A TIMELY SCHEDULE IS PROVIDED TO ASSOCIATES (3 WEEKS IN ADVANCE) PARTNERS WITH THE STORE MANAGER TO ENSURE ALL REQUESTS FOR TIME OFF AND AVAILABILITY CHANGES IN THE SYSTEM HAVE BEEN ADDRESSED PARTNER WITH STORE EXECUTIVES TO CREATE A STORE SCHEDULE THE MEETS STORE BUDGET, BASE STAFFING, AND WEEKEND PERCENT GUIDELINES THROUGH MINIMAL EDITS LEAD THE OFFICE-DEPOSIT FUNCTION THAT INCLUDES ALL ASPECTS OF MONETARY MAINTENANCE IN THE STORE INCLUDING PROCESSING THE DEPOSIT, MAINTAINING STORE PETTY CASH FUNDS (REGISTERS AND VAULT), AND PERFORMING THE SALES AUDIT FUNCTION HUMAN RESOURCE LEAD WILL ACT AS A KEY-HOLDER WITH RESPONSIBILITY FOR LEADING THE SUPPORT STAFF AS APPROPRIATE\n\nMINIMUM EDUCATION & EXPERIENCE\n\n HIGH SCHOOL DIPLOMA OR GED EQUIVALENT REQUIRED 2-3 YEARS OF EXPERIENCE IN RETAIL AND/OR HR ABILITY TO USE COMPUTER KEYBOARD, STANDARD TELEPHONE AND OTHER RELATED BUSINESS EQUIPMENT ABILITY TO LIFT FILES, OPEN FILE CABINETS, BEND, STOOP, REACH, AND STAND AS NECESSARY MUST BE ABLE TO MAINTAIN CONFIDENTIALITY\n\nPHYSICAL REQUIREMENTS\n\n ABILITY TO STAND/WALK FOR LONG PERIODS OF TIME ABILITY TO WORK AT A SAFE AND STEADY PACE",
    "job_skill_set": [
      "on-boarding",
      "benefits administration",
      "employee relations",
      "payroll processing",
      "HR compliance",
      "computer proficiency",
      "communication",
      "team leadership",
      "confidentiality",
      "problem solving",
      "attention to detail",
      "interpersonal skills",
      "recruitment",
      "performance appraisal",
      "data accuracy",
      "scheduling",
      "cash handling",
      "sales audit",
      "time management"
    ],
    "short_keywords": [
      "accuracy",
      "administration",
      "appraisal",
      "attention",
      "audit",
      "benefits",
      "cash",
      "communication",
      "compliance",
      "computer",
      "confidentiality",
      "data",
      "detail",
      "employee",
      "handling",
      "hr",
      "human",
      "interpersonal",
      "lead",
      "leadership",
      "management",
      "onboarding",
      "payroll",
      "performance",
      "problem",
      "processing",
      "proficiency",
      "recruitment",
      "relations",
      "resource",
      "sales",
      "scheduling",
      "skills",
      "solving",
      "team",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3906221851",
    "job_title": "Human Resources Specialist",
    "category": "HR",
    "job_description": "WE ARE LOOKING FOR AN HR SPECIALIST TO JOIN OUR TEAM AND MONITOR ALL HUMAN RESOURCES FUNCTIONS. HR SPECIALIST RESPONSIBILITIES INCLUDE PREPARING COMPENSATION AND BENEFITS PACKAGES, SETTING UP COMPANY POLICIES, AND MAINTAINING UPDATED EMPLOYEE RECORDS. TO BE SUCCESSFUL IN THIS ROLE, YOU SHOULD HAVE A GOOD UNDERSTANDING OF FULL-CYCLE RECRUITING AND SOLID KNOWLEDGE. ULTIMATELY, YOU WILL FOSTER A HEALTHY WORKPLACE BY ENSURING OUR HR PROCEDURES RUN SMOOTHLY AT ALL TIMES. \nRECRUITMENT AND ONBOARDING OF EMPLOYEES: CREATING JOB REQUISITIONS, COORDINATING OFFERS, PRE-EMPLOYMENT ACTIVITIES, ONBOARDING, AND APPLICABLE OFCCP REPORTING.   🔆 GENERATE NECESSARY REPORTS FOR PAYROLL AND HR. COORDINATE ALL HR-RELATED DOCUMENTS FOR JOB/EMPLOYEE STATUS CHANGES FOR EMPLOYEES.  🔆 PLAN, COORDINATE, AND FACILITATE VARIOUS TRAINING PROGRAMS IN COMPLIANCE WITH OSHA REGULATIONS AND STANDARDS.  🔆 MAINTAIN PROPER DOCUMENTATION AND ASSIST WITH EMPLOYEE RELATIONS ISSUES AND VENDOR/SUPPLIER COMMUNICATION.  🔆 CONDUCT NEW HIRE ORIENTATION AND ENSURE RULES, REGULATIONS, AND CBA INFORMATION ARE REVIEWED AND UNDERSTOOD.  🔆 ASSIST WITH EMPLOYEE RECOGNITION PROGRAMS.  🔆 PARTICIPATE IN VARIOUS ASPECTS OF SAFETY, INCLUDING PARTICIPATING IN SAFETY AUDITS, DELIVERY OF TRAINING PROGRAMS, CONDUCTING JOB SAFETY ANALYSIS, AND IDENTIFICATION AND RECONCILIATION OF ROOT CAUSE OF SAFETY INCIDENTS.  🔆 COMPILE AND ANALYZE MONTHLY AND ANNUAL STATISTICS. PREPARE AND DISTRIBUTE VARIOUS REPORTS.  🔆 ASSIST THE HR MANAGER WITH COMMUNITY ENGAGEMENT ACTIVITIES AND OTHER CORPORATE INITIATIVES.  🔆 PERFORM OTHER DUTIES AS ASSIGNED.  \n\nREQUIREMENTS:✅ REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS  ✅ REQUIRED TO SIT, STAND, WALK, AND USE HANDS TO FINGER, HANDLE, OR FEEL OBJECTS, TOOLS, OR CONTROLS  ✅  REQUIRED TO REACH WITH HANDS AND ARMS AND STOOP, KNEEL, OR CROUCH  ✅  REGULARLY LIFT OR MOVE UP TO 10 POUNDS  ✅ SPECIFIC VISION ABILITIES REQUIRED BY THIS JOB INCLUDE CLOSE VISION, PERIPHERAL VISION, DEPTH PERCEPTION, AND THE ABILITY TO ADJUST FOCUS  ✅ MUST CONTINUOUSLY HAVE THE ABILITY TO DIFFERENTIATE COLORS PRECISELY  ✅  MUST BE ABLE TO CLIMB A LADDER AND STAIRS  ✅  OCCASIONAL CLIMBING, STOOPING, KNEELING, CROUCHING, CRAWLING, AND BALANCING  ✅  FREQUENT USE OF EYE, HAND, AND FINGER COORDINATION ENABLING THE USE OF OFFICE MACHINERY  ✅ ORAL AND AUDITORY CAPACITY ENABLING INTERPERSONAL COMMUNICATION AS WELL AS COMMUNICATION THROUGH AUTOMATED DEVICES SUCH AS THE TELEPHONE  ✅ OCCASIONALLY OPERATE BUSINESS MACHINES  ✅ WHILE PERFORMING THE DUTIES OF THIS JOB, THE EMPLOYEE IS REGULARLY REQUIRED TO TALK OR HEAR.  ✅  ABILITY TO READ AND CONCENTRATE VIA COMPUTER DATA ENTRY TYPING AND PROOFREADING \n\nTECHNICAL KNOWLEDGE/SKILLS:  ✅ INTERMEDIATE PROFICIENCY IN GOOGLE SUITE  ✅  FAMILIAR WITH STANDARD HR CONCEPTS, PRACTICES, AND PROCEDURES  ✅  FAMILIAR WITH AND PROFICIENT IN NAVIGATION OF HRIS AND OTHER RELATED SYSTEMS (WORKDAY, ATS, ADP, ETIME, PEOPLESOFT, ARCPLAN, ASPEN, OR RELATED)  ✅ FAMILIAR WITH STANDARD MANUFACTURING CONCEPTS, PRACTICES, AND PROCEDURES  ✅  INTERMEDIATE KNOWLEDGE OF EMPLOYMENT LAW  ✅ EXPOSURE TO OSHA REPORTING, REGULATIONS, AND COMPLIANCE \nGENERAL KNOWLEDGE/SKILLS: \n \n✅  EXCELLENT INTERPERSONAL SKILLS \n✅ ABILITY TO MAINTAIN CONFIDENTIALITY \n✅ SOLID VERBAL AND WRITTEN COMMUNICATION SKILLS \n✅ STRONG TIME MANAGEMENT & PRIORITIZATION SKILLS \n✅ DEMONSTRATED PROBLEM-SOLVING ABILITIES \n✅ ADVANCED VERBAL AND WRITTEN COMMUNICATION SKILLS THAT CAN BE UTILIZED IN DAY-TO-DAY INTERACTIONS WITH ALL LEVELS OF THE WORKFORCE\nEDUCATION/EXPERIENCE:   ✅ A BACHELOR’S DEGREE IN HUMAN RESOURCES, BUSINESS ADMINISTRATION OR RELATED FIELD \n✅ 3+ YEARS OF DEMONSTRATED HR EXPERIENCE, PREFERABLY IN A MANUFACTURING ENVIRONMENT",
    "job_skill_set": [
      "full-cycle recruiting",
      "compensation and benefits packages",
      "interpersonal skills",
      "verbal communication",
      "time management",
      "problem-solving",
      "teamwork",
      "HRIS",
      "Google Suite",
      "employment law",
      "OSHA regulations",
      "data analysis",
      "report generation",
      "training program facilitation",
      "job safety analysis",
      "confidentiality",
      "written communication",
      "prioritization"
    ],
    "short_keywords": [
      "analysis",
      "and",
      "benefits",
      "communication",
      "compensation",
      "confidentiality",
      "data",
      "employment",
      "facilitation",
      "fullcycle",
      "generation",
      "google",
      "hr",
      "hris",
      "human",
      "interpersonal",
      "job",
      "law",
      "management",
      "osha",
      "packages",
      "prioritization",
      "problemsolving",
      "program",
      "recruiting",
      "regulations",
      "report",
      "resources",
      "safety",
      "skills",
      "specialist",
      "suite",
      "teamwork",
      "time",
      "training",
      "verbal",
      "written"
    ]
  },
  {
    "job_id": "3902925156",
    "job_title": "Human Resources Generalist",
    "category": "HR",
    "job_description": "COMPANY DESCRIPTION:CREATIVE FOAM PRODUCTS, LLC IS AN EXPANDED POLYSTYRENE MANUFACTURER SPECIALIZING IN THE PRODUCTION OF FOAM INSULATION USED IN THE BUILDING AND CONSTRUCTION INDUSTRY AS WELL AS PROTECTIVE PACKAGING. OUR TEAM WORKS TOGETHER TO DELIVER EXCEPTIONAL CUSTOMER SERVICE AND QUALITY PRODUCTS. WE INVEST IN OUR EMPLOYEES, PROVIDING TRAINING AND DEVELOPMENT OPPORTUNITIES TO FOSTER GROWTH AND ENSURE OUR ABILITY TO CONSISTENTLY PROVIDE HIGH-QUALITY, MADE TO ORDER PRODUCTS, SHORT LEAD TIMES, AMPLE AVAILABILITY, AND STABLE PRICES TO OUR CUSTOMERS.\nWE ARE SEEKING A HUMAN RESOURCES GENERALIST WHO WILL: SUMMARY OF POSITION:FORMALIZE AND BUILD OUR HUMAN RESOURCES DEPARTMENT. THE HR GENERALIST WILL PLAN, IMPLEMENT, AND EVALUATE EMPLOYEE RELATIONS AND HUMAN RESOURCES POLICIES, PROGRAMS, AND PRACTICES. THIS IS AN EXCELLENT OPPORTUNITY FOR A SELF-STARTER TO JOIN A YOUNG COMPANY AND ESTABLISH OUR HUMAN RESOURCES DEPARTMENT.\nTHIS IS A FULL-TIME POSITION REQUIRING 40 HOURS A WEEK. DAYS OF THE WORK WEEK ARE MONDAY THROUGH FRIDAY, HOURS WILL BE BETWEEN 8:00 A.M. TO 5:00 P.M. AND WILL BE AGREED UPON BEFORE EMPLOYMENT.\nESSENTIAL JOB DUTIES:• OVERSEE THE HIRING AND ONBOARDING PROCESS OF NEW EMPLOYEES.• WORK DIRECTLY WITH DEPARTMENTS TO FILL THEIR EMPLOYMENT NEEDS.• DEVELOP RECRUITMENT PLANS INCLUDING RELATIONSHIPS WITH LOCAL PLACEMENT COMPANIES AND LOCATE AND MAINTAIN OTHER HIRING SOURCES.• EDUCATE EMPLOYEES TO FOLLOW PROPER POLICIES AND PROCEDURES.• MAINTAIN/MONITOR RECORDS OF WORKER’S COMPENSATION, ADA, FMLA, UNEMPLOYMENT AND OTHER EMPLOYEE CLAIMS. RECOMMEND CHANGES TO POLICY AND TRAINING TO ENSURE COMPLIANCE WITH LAWS AND REGULATIONS.• ASSIST PAYROLL COORDINATOR/ACCOUNTING IN THE PREPARATION OF PAYROLL, ENTERING HOURS, DEDUCTIONS, RATE CHANGES, TRANSFERS, ETC.• WORK WITH UPPER MANAGEMENT AND TEAM LEADERS IN PROVIDING REGULAR LEADERSHIP ANDMANAGEMENT TRAINING.• HELP DIRECT AND SUPPORT THE DEVELOPMENT OF OUR COMPANY CULTURE.• MAINTAIN EMPLOYEE FILES.• DEVELOP/IMPLEMENT HR PLANS FOR CREATIVE FOAM INCLUDING SELECTIONS, PROMOTIONS, TRANSFER, ORIENTATION, COMPENSATION ADMINISTRATION, LABOR RELATIONS IN COLLABORATION WITH MANAGEMENT. EDUCATE/ADVISE TEAM LEADERS AND MANAGEMENT ON PERSONNEL ISSUES INCLUDING TERMINATION, DISPUTES, MORALE.• MAINTAIN AND DEPLOY APPLICABLE HUMAN RESOURCES FEDERAL AND STATE REQUIREMENTS, CONDUCT INVESTIGATIONS, AND MAINTAIN RECORDS.• MONITOR REPORTS PROVIDED BY TEAM LEADERS AND MANAGEMENT TO DETERMINE EMPLOYEE PERFORMANCE AND TRAINING NEEDS.• WORK WITH TEAM LEADERS TO DEVELOP AND HOLD TRAINING PROGRAMS AND MANUALS FOR EQUIPMENT AND MACHINE OPERATORS.• ANALYZE COMPENSATION STANDARDS SET BY INDUSTRY AND GOVERNING BODIES TO CREATE SALARY STRUCTURES AND ADMINISTER EMPLOYEE BENEFITS.• ORGANIZE EXIT INTERVIEWS AND PROCEDURES.• PLAN COMPANY EVENTS.\nMINIMUM QUALIFICATIONS:• BACHELOR’S DEGREE IN HUMAN RESOURCES OR RELATED FIELD.• 2+ YEARS OF RELEVANT EXPERIENCE.• UNDERSTANDING OF THE KEY PRINCIPLES OF EMPLOYMENT LAW AND EEOC REGULATIONS.• EXCELLENT COMMUNICATION SKILLS, BOTH WRITTEN AND VERBAL.• UNIMPEACHABLE ETHICS, INTEGRITY, AND STANDARDS• RIGHT TO WORK IN THE U.S. THAT IS NOT BASED SOLELY ON POSSESSION OF A STUDENT VISA OR A VISA SPONSORED BY A THIRD-PARTY EMPLOYER\nDESIRED EXPERIENCE:• BROAD KNOWLEDGE OF SUCH FIELDS AS ACCOUNTING, MARKETING , BUSINESS ADMINISTRATION, ETC.• FAMILIARITY WITH OSHA SAFETY POLICIES AND REGULATIONS.• MANUFACTURING EXPERIENCE A PLUS.• KNOWLEDGE AND EXPERIENCE IN USING VARIOUS TECHNOLOGIES AND SYSTEMS INCLUDING MS SUITE, INCLUDING MS OUTLOOK AND EXCEL• STRONG ORGANIZATIONAL SKILLS AND CAPABLE OF PRIORITIZING MULTIPLE TASKS.• ADEPT AT PROBLEM SOLVING AND CONFLICT RESOLUTION.• SOCIAL MEDIA SAVVY.• ABILITY TO HANDLE SENSITIVE, CONFIDENTIAL INFORMATION• EXCELLENT COMMUNICATION AND COLLABORATION SKILLS TO WORK EFFECTIVELY WITH CROSS-FUNCTIONAL TEAMS.• ABILITY TO THRIVE IN A FAST-PACED, DYNAMIC ENVIRONMENT AND MANAGE MULTIPLE PRIORITIES EFFECTIVELY.\nWORKING CONDITIONS:• WORK ONSITE IN AN OFFICE ENVIRONMENT• MUST BE ABLE TO REMAIN IN A STATIONARY POSITION FOR UP TO 75% OF THE TIME• THE ABILITY TO COMMUNICATE INFORMATION AND IDEAS SO OTHERS WILL UNDERSTAND. MUST BE ABLE TO EXCHANGE ACCURATE INFORMATION IN THESE SITUATIONS• THE ABILITY TO OBSERVE DETAILS AT CLOSE RANGE (WITHIN A FEW FEET OF THE OBSERVER).• CONSTANTLY OPERATES A COMPUTER AND OTHER OFFICE PRODUCTIVITY MACHINERY, SUCH AS A CALCULATOR, COPY MACHINE, AND COMPUTER PRINTER.• THE PERSON IN THIS POSITION NEEDS TO OCCASIONALLY MOVE ABOUT INSIDE THE OFFICE TO ACCESS FILE CABINETS, OFFICE MACHINERY, ETC. • MUST BE ABLE TO ASCENDS/DESCENDS STAIRS TO ACCESS OFFICE AND PARTICIPATE IN SHAREHOLDER MEETINGS AND ACCESSING ACCOUNTING DOCUMENTS\nFULL JOB DESCRIPTIONS WILL BE MADE AVAILABLE TO THOSE SELECTED FOR AN INTERVIEW. THE DESCRIPTION IS ONLY A SUMMARY OF THE TYPICAL FUNCTIONS OF THE JOB, NOT AN EXHAUSTIVE OR COMPREHENSIVE LIST OF ALL POSSIBLE RESPONSIBILITIES, TASKS, AND DUTIES.\nDISCLAIMERS:CREATIVE FOAM PRODUCTS IS COMMITTED TO EQUAL EMPLOYMENT OPPORTUNITIES REGARDLESS OF ANY PROTECTED CHARACTERISTIC, INCLUDING RACE, COLOR, GENETIC INFORMATION, CREED, NATIONAL ORIGIN, RELIGION, SEX, AFFECTIONAL OR SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, LAWFUL ALIEN STATUS, ANCESTRY, AGE, MARITAL STATUS, OR PROTECTED VETERAN STATUS AND WILL NOT DISCRIMINATE AGAINST ANYONE ON THE BASIS OF A DISABILITY. WE SUPPORT A WORKPLACE WHERE ASSOCIATES EXCEL BASED ON PERSONAL MERIT, QUALIFICATIONS, EXPERIENCE, ABILITY, AND JOB PERFORMANCE.CREATIVE FOAM PRODUCTS IS AN AFFIRMATIVE ACTION AND EQUAL OPPORTUNITY EMPLOYER OF INDIVIDUALS WITH DISABILITIES AND PROTECTED VETERANS AND IS COMMITTED TO EXCELLENCE. IF YOU NEED REASONABLE ACCOMMODATION FOR ANY PART OF THE EMPLOYMENT PROCESS, PLEASE CONTACT US AT JOBS@CREATIVEFOAMUSA.COM AND LET US KNOW THE NATURE OF YOUR REQUEST. WE WILL ACCOMMODATE THE NEEDS OF ANY QUALIFIED CANDIDATE WHO REQUESTS A REASONABLE ACCOMMODATION UNDER THE AMERICANS WITH DISABILITIES ACT (ADA).EMPLOYEE MUST BE ABLE TO PERFORM THE ESSENTIAL FUNCTIONS OF THE POSITION SATISFACTORILY AND, IF REQUESTED, REASONABLE ACCOMMODATIONS WILL BE MADE TO ENABLE EMPLOYEES WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS OF THEIR JOB, ABSENT UNDUE HARDSHIP. THE EMPLOYER RETAINS THE RIGHT TO CHANGE OR ASSIGN OTHER DUTIES TO THIS POSITION.",
    "job_skill_set": [
      "Human Resources Management",
      "Employee Relations",
      "Recruitment",
      "Payroll Processing",
      "Employment Law",
      "MS Office Suite",
      "Data Management",
      "Compensation Analysis",
      "Training Development",
      "Conflict Resolution",
      "OSHA Regulations",
      "Communication",
      "Integrity",
      "Organizational Skills",
      "Problem Solving",
      "Collaboration",
      "Adaptability",
      "Self-Starter",
      "Confidentiality",
      "Leadership",
      "Cultural Awareness"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "awareness",
      "collaboration",
      "communication",
      "compensation",
      "confidentiality",
      "conflict",
      "cultural",
      "data",
      "development",
      "employee",
      "employment",
      "generalist",
      "hr",
      "human",
      "integrity",
      "law",
      "leadership",
      "management",
      "ms",
      "office",
      "organizational",
      "osha",
      "payroll",
      "problem",
      "processing",
      "recruitment",
      "regulations",
      "relations",
      "resolution",
      "resources",
      "selfstarter",
      "skills",
      "solving",
      "suite",
      "training"
    ]
  },
  {
    "job_id": "3884832831",
    "job_title": "Human Resource Generalist",
    "category": "HR",
    "job_description": "E2 CONSULTING ENGINEERS, INC. (E2) IS A PROFESSIONAL SERVICES FIRM ESTABLISHED IN 1988 SPECIALIZING IN A FULL SPECTRUM OF ENGINEERING SERVICES INCLUDING, PROJECT ENGINEERING AND DESIGN, FEDERAL BASE OPERATIONS AND INFRASTRUCTURE SUPPORT SERVICES, GAS PIPELINE CONSTRUCTION AND INSPECTION SERVICES, ENVIRONMENTAL CONSULTING AND REMEDIATION, AND INFORMATION TECHNOLOGY SERVICES. AT E2, WE VALUE SAFETY, INNOVATION AND COLLABORATION, AND WE ARE DEDICATED TO EXCELLENCE.\n\nOVERVIEW\n\nWE ARE SEEKING A FULL-TIME HUMAN RESOURCE GENERALIST TO JOIN OUR EVER-GROWING ENGINEERING SERVICE FIRM. A STRONG BACKGROUND IN PAYROLL AND BENEFIT CONCEPTS IS A REQUIREMENT AND A GOOD EYE FOR DETAIL IS A MUST, AS IS A WILLINGNESS TO LEARN, GROW AND WORK AS A TEAM PLAYER.\n\nTHIS POSITION WILL BE RESPONSIBLE FOR PROCESSING ALL ASPECTS OF EMPLOYEE CHANGES INTO OUR HRIS AND TIMEKEEPING SYSTEMS INCLUDING ONBOARDING, OFFBOARDING, BENEFIT AND SALARY CHANGES FOR APPROXIMATELY 200 TO 400+ EMPLOYEES NATIONWIDE. YOU MUST UNDERSTAND THE CONCEPTS THAT GOVERN PAYROLL LAWS SUCH AS OVERTIME, WAGE GARNISHMENT, AND FEDERAL AND STATE TAXES (INCLUDING STATE RECIPROCITY). A STRONG UNDERSTANDING OF BENEFITS ADMINISTRATION INCLUDING THE CONCEPT OF BENEFIT CARVEOUTS, ERISA REGULATIONS, FSA / HSA, AND COBRA ADMINISTRATION IS REQUIRED. IN ADDITION, YOU WILL PERFORM ADMINISTRATIVE TASKS TO SUPPORT EFFECTIVE AND EFFICIENT OPERATIONS OF THE ORGANIZATION’S HUMAN RESOURCE DEPARTMENT. IF YOU LIKE NEVER BEING BORED, CONSTANT LEARNING, AND WORKING WITH A WONDERFUL GROUP OF PEOPLE, CLICK THE LINK NOW!\n\nRESPONSIBILITIES\n\nCORE RESPONSIBILITIES\n\n PERFORM ROUTINE TASKS REQUIRED TO ADMINISTER AND PROCESS HUMAN RESOURCE ACTIVITIES INCLUDING BUT NOT LIMITED TO PROCESSING EMPLOYMENT CHANGES IN OUR HRIS SYSTEM.  ANSWER ROUTINE EMPLOYEE QUESTIONS RELATED TO STANDARD POLICIES, BENEFITS, HIRING PROCESSES, ETC.; REFERS MORE COMPLEX QUESTIONS TO MANAGEMENT.  MAINTAIN ACCURATE AND UP-TO-DATE HUMAN RESOURCE ELECTRONIC FILES FOR EACH EMPLOYEE WHILE ADHERING TO THE INTEGRITY AND CONFIDENTIALITY OF HUMAN RESOURCE FILES AND RECORDS.  TRACK RECEIPT OF AND FILE HARD COPY I9S DOCUMENTS.  MAINTAIN COMPLIANCE WITH FEDERAL, STATE, AND LOCAL EMPLOYMENT LAWS AND REGULATIONS AND RECOMMENDED BEST PRACTICES; REVIEW POLICIES AND PRACTICES TO MAINTAIN COMPLIANCE.  REVIEW, TRACK, AND DOCUMENT COMPLIANCE WITH MANDATORY AND NON-MANDATORY TRAINING, CONTINUING EDUCATION, AND WORK ASSESSMENTS ON OUR LMS SYSTEM. THIS MAY INCLUDE SAFETY TRAINING, ANTI-HARASSMENT TRAINING, PROFESSIONAL LICENSURE, AND APTITUDE EXAMS AND CERTIFICATIONS. \n\nADDITIONAL RESPONSIBILITIES\n\n MAINTAIN KNOWLEDGE OF TRENDS, BEST PRACTICES, REGULATORY CHANGES, AND NEW TECHNOLOGIES IN HUMAN RESOURCES, TALENT MANAGEMENT, AND EMPLOYMENT LAW.  PERFORM PERIODIC AUDITS OF HR FILES AND RECORDS TO ENSURE THAT ALL REQUIRED DOCUMENTS ARE COLLECTED AND FILED APPROPRIATELY.  PROVIDE CLERICAL SUPPORT TO THE HR DEPARTMENT.  PERFORM OTHER DUTIES AS ASSIGNED. \n\nQUALIFICATIONS\n\n THOROUGH KNOWLEDGE OF EMPLOYMENT-RELATED LAWS AND REGULATIONS  KNOWLEDGE OF ERISA REGULATIONS AND BENEFITS MANAGEMENT  STRONG KNOWLEDGE OF PAYROLL LAWS (CA PREFERRED) AND FAMILIAR WITH PROCESSING PAYROLL CHANGES INTO PAYROLL / HRIS SYSTEMS  ABILITY TO ACT WITH INTEGRITY, PROFESSIONALISM, AND CONFIDENTIALITY  STRONG ANALYTICAL AND PROBLEM-SOLVING SKILLS  EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS  EXCELLENT INTERPERSONAL, NEGOTIATION, AND CONFLICT RESOLUTION SKILLS \n\nBENEFITS\n\nE2 CONSULTING ENGINEERS, INC. OFFERS AN EXCELLENT BENEFITS PACKAGE INCLUDING HEALTH, DENTAL, VISION, AND LIFE INSURANCE, 401(K) WITH EMPLOYER MATCH, PAID TIME OFF.\n\nWAGE DATA PER STATE REQUIREMENTS\n\nHOURLY RATE FOR THIS POSITION IS $25.00 - $33.00. THE STARTING RATE WILL BE COMMENSURATE WITH SKILL, EDUCATION, EXPERIENCE, AND WORKING ENVIRONMENT.\n\n WORK ENVIRONMENT/PHYSICAL DEMANDS \n\nWORK ENVIRONMENT\n\nTHIS JOB OPERATES IN AN OFFICE ENVIRONMENT AND USES STANDARD OFFICE EQUIPMENT SUCH AS COMPUTERS AND PHONES.\n\nPHYSICAL DEMANDS\n\nTHE PHYSICAL DEMANDS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY AN EMPLOYEE TO SUCCESSFULLY PERFORM THE ESSENTIAL FUNCTIONS OF THIS JOB. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS.\n\n PROLONGED PERIODS OF SITTING AT A DESK AND WORKING ON A COMPUTER.  MUST BE ABLE TO LIFT 15 POUNDS AT TIMES.  MUST BE ABLE TO ACCESS AND NAVIGATE EACH DEPARTMENT AT THE ORGANIZATION’S FACILITIES. \n\n TRAVEL \n\nLESS THAN 10%. HYBRID ROLE - 1 TO 2 DAYS IN THE OFFICE.\n\n DRUG FREE WORKPLACE \n\nE2 CONSULTING ENGINEERS, INC. IS A DRUG FREE WORKPLACE. AFTER ACCEPTING AN OFFER OF EMPLOYMENT, APPLICANTS MAY BE REQUIRED TO UNDERGO BACKGROUND CHECKS, DRUG TESTING, AND/OR FIT-FOR-DUTY PHYSICAL EXAMINATION. DRUG SCREENS WILL INCLUDE, BUT NOT BE LIMITED TO, AMPHETAMINES, COCAINE METABOLITES, MARIJUANA METABOLITES (THC), OPIATES, AND PHENCYCLIDINE (PCP). AS A FEDERAL CONTRACTOR, E2 CANNOT PERMIT EMPLOYEES IN CERTAIN POSITIONS TO USE MEDICAL MARIJUANA, EVEN IF PRESCRIBED BY AN AUTHORIZED PHYSICIAN.\n\n SOLICITATION \n\nPLEASE NO SOLICITATION OF ANY KIND FROM AGENCIES, STAFFING, OR RECRUITING FIRMS.\n\n EEO STATEMENT \n\nALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, OR STATUS AS A PROTECTED VETERAN.",
    "job_skill_set": [
      "payroll",
      "benefits administration",
      "HRIS",
      "employment law",
      "analytical skills",
      "problem-solving",
      "compliance",
      "training management",
      "data entry",
      "communication",
      "interpersonal skills",
      "negotiation",
      "conflict resolution",
      "integrity",
      "teamwork",
      "attention to detail",
      "willingness to learn",
      "ERISA regulations"
    ],
    "short_keywords": [
      "administration",
      "analytical",
      "attention",
      "benefits",
      "communication",
      "compliance",
      "conflict",
      "data",
      "detail",
      "employment",
      "entry",
      "erisa",
      "generalist",
      "hr",
      "hris",
      "human",
      "integrity",
      "interpersonal",
      "law",
      "learn",
      "management",
      "negotiation",
      "payroll",
      "problemsolving",
      "regulations",
      "resolution",
      "resource",
      "skills",
      "teamwork",
      "to",
      "training",
      "willingness"
    ]
  }
]