[
  {
    "job_id": "3894947629",
    "job_title": "Human Resources Manager",
    "category": "HR",
    "job_description": "IF YOU ARE A FORWARD THINKING HR PROFESSIONAL WITH A PASSION FOR CREATING A POSITIVE AND ENGAGING WORK ENVIRONMENT, WE INVITE YOU TO APPLY NOW FOR THE HUMAN RESOURCES MANAGER POSITION!\n\nQUALIFICATIONS\n\nBACHELOR’S DEGREE OR MINIMUM 4 YEARS HR EXPERIENCESTRONG AND EFFECTIVE COMMUNICATION SKILLSABILITY TO INTERPRET AND ADVISE ACCORDING TO EMPLOYMENT LAWS OF JURISDICTIONABILITY TO COMMUNICATE EFFECTIVELY WITH THE PUBLIC AND OTHER TEAM MEMBERSSTRONG EMPLOYMENT LAW, RECRUITING AND RETENTION BACKGROUND A MUSTEXPERIENCE WITH AFFIRMATIVE ACTION HELPFULABILITY TO MANAGE A DIVERSIFIED WORKFORCEDEMONSTRATES A HIGH DEGREE OF CONFIDENTIALITY AND COMMON SENSEABILITY TO WORK IN A STRESSFUL ENVIRONMENT AND REMAIN FLEXIBLE TO CONSTANT CHANGE\n\nTHE POST HUMAN RESOURCES MANAGER APPEARED FIRST ON COMPLETE STAFFING SOLUTIONS.",
    "job_skill_set": [
      "employment law",
      "recruiting",
      "retention",
      "HR experience",
      "communication",
      "confidentiality",
      "flexibility",
      "stress management",
      "teamwork",
      "affirmative action"
    ],
    "short_keywords": [
      "action",
      "affirmative",
      "communication",
      "confidentiality",
      "employment",
      "experience",
      "flexibility",
      "hr",
      "human",
      "law",
      "management",
      "manager",
      "recruiting",
      "resources",
      "retention",
      "stress",
      "teamwork"
    ]
  },
  {
    "job_id": "3901939857",
    "job_title": "Human Resources Generalist",
    "category": "HR",
    "job_description": "AT CATAPULT, WE ARE HELPING OUR MEMBER, THE NORTH CAROLINA HOUSING FINANCE AGENCY, HIRE A HUMAN RESOURCES GENERALIST. THIS POSITION IS AN OPTIONAL HYBRID OR REMOTE ROLE BUT YOU MUST BE A NC RESIDENT WITHIN COMMUTING DISTANCE TO RALEIGH, NC. INITIALLY, THE HR GENERALIST MAY NEED TO COME IN THE OFFICE MORE TO GET ACCLIMATED TO THE ROLE/AGENCY.\nABOUT THE AGENCY:THE NORTH CAROLINA HOUSING FINANCE AGENCY IS A SELF-SUPPORTING PUBLIC AGENCY THAT PROVIDES SAFE, AFFORDABLE HOUSING OPPORTUNITIES TO ENHANCE THE QUALITY OF LIFE OF NORTH CAROLINIANS. IF YOU’RE PASSIONATE ABOUT CHANGING LIVES AND PUTTING QUALITY HOUSING WITHIN THE REACH OF EVERY NORTH CAROLINIAN, WE WOULD LOVE TO HEAR FROM YOU!\nABOUT THE POSITION:WE ARE SEEKING A HUMAN RESOURCES GENERALIST WHO WILL BE RESPONSIBLE FOR BENEFITS ADMINISTRATION; EMPLOYEE ONBOARDING AND OFF-BOARDING; RECRUITING; AND ADMINISTRATION OF FMLA, FLSA, AND WORKERS’ COMPENSATION. THIS ROLE IS EXPECTED TO INTERPRET AND ENSURE THE UNIFORM APPLICATION OF HUMAN RESOURCES POLICIES, PROCEDURES, AND BENEFITS. RESPONSIBLE FOR CREATING AND DELIVERING EMPLOYEE TRAINING ENSURING COMPLIANCE OF STATE AND FEDERAL LAWS AS WELL AS AGENCY POLICY. THIS POSITION WORKS CLOSELY WITH THE HR MANAGER IN THE DAY-TO-DAY OPERATION AND ADMINISTRATION OF HUMAN RESOURCES, ENSURING THE DELIVERY OF STRONG AND EFFECTIVE INTERNAL CUSTOMER SERVICE. \nESSENTIAL FUNCTIONS:• ADMINISTERS ALL EMPLOYEE BENEFIT PROGRAMS, PROCESSES LIFE CHANGES, RESPONDS TO BENEFIT INQUIRIES FROM EMPLOYEES, ASSISTS WITH OPEN ENROLLMENT, AND RECONCILES BENEFIT INVOICES TO ENSURE ACCURACY AND RESOLVE ISSUES.• FACILITATES ALL PHASES OF THE RECRUITMENT PROCESS, COLLABORATING WITH HIRING MANAGERS TO IDENTIFY NECESSARY SKILLS AND COMPETENCIES REQUIRED FOR OPENINGS.• RESPONSIBLE FOR THE ON-BOARDING AND OFF-BOARDING PROCESSES FOR THE AGENCY.• PROCESSES AND ADMINISTERS ALL LEAVE OF ABSENCE AND DISABILITY REQUESTS: MEDICAL, DISABILITY, FMLA, ADA. EFFECTIVELY INTERPRETS RELEVANT EMPLOYMENT LAWS AS THEY RELATE TO LEAVE OF ABSENCE/DISABILITY.• PROCESSES TIMESHEETS ENSURING COMPLIANCE WITH THE FAIR LABOR STANDARDS ACT AND AGENCY POLICIES.• ASSISTS WITH IDENTIFYING TRAINING NEEDS FOR DEPARTMENTS AND INDIVIDUALS. DESIGNS AND CONDUCTS TRAINING. SOURCES EXTERNAL TRAINING PARTNERS AND SCHEDULES TRAINING AS-NEEDED.• MONITORS THE PERFORMANCE MANAGEMENT PROCESS TO ENSURE PERFORMANCE REVIEWS ARE CONDUCTED IN A TIMELY AND EFFECTIVE MANNER. ASSISTS WITH COACHING AND TRAINING MANAGERS ON PERFORMANCE MANAGEMENT DISCUSSIONS.• PROCESSES WORKERS COMPENSATION CLAIMS.• ENSURES THE UNIFORM APPLICATION OF HUMAN RESOURCES POLICIES, PROCEDURES, AND BENEFITS, AND PROPER HANDING / FILING OF RESTRICTED MATERIAL ACCORDING TO AGENCY RETENTION POLICY.• OTHER DUTIES AS ASSIGNED. EDUCATION & EXPERIENCEA BACHELOR’S DEGREE FROM AN APPROPRIATELY ACCREDITED INSTITUTION IN HUMAN RESOURCES, BUSINESS, OR RELATED AREA, AND TWO YEARS OF PROGRESSIVE EXPERIENCE IN HUMAN RESOURCES OR AN EQUIVALENT COMBINATION OF EDUCATION AND EXPERIENCE WILL BE CONSIDERED. SHRM-CP OR PHR CERTIFICATION PREFERRED KNOWLEDGE, SKILLS, & ABILITIESKNOWLEDGE OF STATE AND FEDERAL EMPLOYMENT LAWS / REGULATIONS, BENEFITS ADMINISTRATION AND RECRUITMENT. INTERMEDIATE KNOWLEDGE OF MICROSOFT WORD, EXCEL AND POWERPOINT; AND BASIC KNOWLEDGE OF E-MAIL AND INTERNET USAGE IS REQUIRED. SUPERIOR COMMUNICATION SKILLS; STRONG ATTENTION TO DETAIL; STRONG INTERPERSONAL SKILLS; FAMILIARITY WITH, INCLUDING, BUT NOT LIMITED TO: COBRA, HIPAA, FLSA, ERISA, FMLA, ADA, WORKERS’ COMPENSATION REQUIRED.",
    "job_skill_set": [
      "benefits administration",
      "employee onboarding",
      "recruiting",
      "FMLA",
      "performance management",
      "communication",
      "attention to detail",
      "interpersonal skills",
      "training and development",
      "customer service",
      "problem solving",
      "FLSA",
      "workers' compensation",
      "employment laws",
      "Microsoft Word",
      "Microsoft Excel",
      "Microsoft PowerPoint",
      "COBRA",
      "HIPAA",
      "ERISA",
      "ADA"
    ],
    "short_keywords": [
      "ada",
      "administration",
      "and",
      "attention",
      "benefits",
      "cobra",
      "communication",
      "compensation",
      "customer",
      "detail",
      "development",
      "employee",
      "employment",
      "erisa",
      "excel",
      "flsa",
      "fmla",
      "generalist",
      "hipaa",
      "hr",
      "human",
      "interpersonal",
      "laws",
      "management",
      "microsoft",
      "onboarding",
      "performance",
      "powerpoint",
      "problem",
      "recruiting",
      "resources",
      "service",
      "skills",
      "solving",
      "to",
      "training",
      "word",
      "workers"
    ]
  },
  {
    "job_id": "3905297142",
    "job_title": "Human Resources Specialist 1/Trainee 1/2 - HELPS",
    "category": "HR",
    "job_description": "MINIMUM QUALIFICATIONS\n\nFOR APPOINTMENT TO HUMAN RESOURCES SPECIALIST TRAINEE 1:\n\n REACHABLE FOR APPOINTMENT ON CURRENT CIVIL SERVICE ELIGIBLE LIST USED FOR FILLING THIS TITLE; OR ONE YEAR OF PERMANENT, COMPETITIVE CLASS SERVICE IN A TITLE ELIGIBLE FOR TRANSFER UNDER SECTION 52.6 OR 70.1 OF THE CIVIL SERVICE LAW. EXAMPLES OF ELIGIBLE TITLES INCLUDE, BUT ARE NOT LIMITED TO:\n\nADMINISTRATIVE ASSISTANT 1/2, PROGRAM AIDE, OFFICE ASSISTANT 3, OFFICE ASSISTANT 3 (CALCULATIONS), OFFICE ASSISTANT 3 (HUMAN RESOURCES); OR\n\n A BACHELOR'S DEGREE OR HIGHER.\n\nFOR APPOINTMENT TO HUMAN RESOURCES SPECIALIST TRAINEE 2\n\n A BACHELOR'S DEGREE AND ONE YEAR OF PROFESSIONAL HUMAN RESOURCES EXPERIENCE; OR MASTER'S OR HIGHER DEGREE IN A RELATED FIELD.\n\nFOR APPOINTMENT TO HUMAN RESOURCES SPECIALIST 1\n\n ONE YEAR OF PERMANENT, COMPETITIVE CLASS SERVICE AS A HUMAN RESOURCES SPECIALIST 1; OR ONE YEAR OF PERMANENT, COMPETITIVE CLASS SERVICE IN A TITLE ELIGIBLE FOR TRANSFER UNDER SECTION 52.6 OR 70.1 OF THE CIVIL SERVICE LAW. EXAMPLES OF ELIGIBLE TITLES INCLUDE, BUT ARE NOT LIMITED TO:\n\nADMNV SPECIALIST 1, BUSINESS SYSTEMS ANALYST 1, SENR ADMNV ANALYST, SENR BUDGETING ANALYST; OR\n\n A BACHELOR'S DEGREE AND 2 YEARS OF PROFESSIONAL HUMAN RESOURCES EXPERIENCE; OR MASTER'S OR HIGHER DEGREE IN A RELATED FIELD AND 1 YEAR OF PROFESSIONAL HUMAN RESOURCES EXPERIENCE.CANDIDATES WHO ARE ACTIVE ON THE MOST RECENT PROFESSIONAL CAREER OPPORTUNITIES EXAMINATION LIST ARE ENCOURAGED TO APPLY.\n\nDUTIES DESCRIPTION\n\nHUMAN RESOURCES SPECIALIST 1/TRAINEE 1/2 WILL SERVE INTERNAL AND EXTERNAL CUSTOMERS AND PERFORM DUTIES RELATED TO THE AREAS ASSIGNED. THEY WILL ASSIST THE LEAVE UNIT IN ADMINISTERING VARIOUS TYPES OF LEAVE WHICH INCLUDE: MEDICAL LEAVE, CHILDCARE LEAVE, FMLA, ETC. THEY WILL ALSO BE RESPONSIBLE FOR COVERING AND MONITORING UNIT MAILBOXES, SETTING UP EMPLOYEES IN ORACLE, ONBOARDING NEW EMPLOYEES, WORKING IN LATS, AND OTHER SPECIAL PROJECTS AS NEEDED.\n\nADDITIONAL COMMENTS\n\nNYSIF HAS A TELECOMMUTING PROGRAM.\n\nTHIS POSITION MAY BE DESIGNATED 55 B/C AND IS SUBJECT TO VERIFICATION OF APPLICANT ELIGIBILITY.\n\nTHIS TITLE IS PART OF THE NEW YORK HIRING FOR EMERGENCY LIMITED PLACEMENT STATEWIDE PROGRAM (NY HELPS).\n\nFOR THE DURATION OF THE NY HELPS PROGRAM, THIS TITLE MAYBE FILLED VIA A NON-COMPETITIVE APPOINTMENT, WHICH MEANS NO EXAMINATION IS REQUIRED BUT ALL CANDIDATES MUST MEET THE MINIMUM QUALIFICATIONS OF THE TITLE FOR WHICH THEY APPLY. AT THIS TIME, AGENCIES MAY RECRUIT AND HIRE EMPLOYEES BY MAKING TEMPORARY APPOINTMENTS. IN MAY 2024, IF A TEMPORARY NY HELPS EMPLOYEE IS SATISFACTORILY PERFORMING IN THE POSITION, THE APPOINTMENT WILL BE CHANGED FROM TEMPORARY PENDING CIVIL SERVICE COMMISSION ACTION TO PERMANENT NON-COMPETITIVE AND THE OFFICIAL PROBATIONARY PERIOD WILL BEGIN.\n\nAT A FUTURE DATE (WITHIN ONE YEAR OF PERMANENT APPOINTMENT), IT IS EXPECTED EMPLOYEES HIRED UNDER NY HELPS WILL HAVE THEIR NON-COMPETITIVE EMPLOYMENT STATUS CONVERTED TO COMPETITIVE STATUS, WITHOUT HAVING TO COMPETE IN AN EXAMINATION. EMPLOYEES WILL THEN BE AFFORDED WITH ALL OF THE SAME RIGHTS AND PRIVILEGES OF COMPETITIVE CLASS EMPLOYEES OF NEW YORK STATE. WHILE SERVING PERMANENTLY IN A NY HELPS TITLE, EMPLOYEES MAY TAKE PART IN ANY PROMOTION EXAMINATION FOR WHICH THEY ARE QUALIFIED.\n\nTHE NEW YORK STATE INSURANCE FUND (NYSIF) WAS ESTABLISHED IN 1914 AS PART OF THE ORIGINAL ENACTMENT OF THE NEW YORK STATE WORKERS’ COMPENSATION LAW. NYSIF'S MISSION IS TO GUARANTEE THE AVAILABILITY OF WORKERS’ COMPENSATION INSURANCE AT THE LOWEST POSSIBLE COST TO NEW YORK EMPLOYERS AND TO PROVIDE TIMELY, APPROPRIATE INDEMNITY AND MEDICAL PAYMENTS TO INJURED WORKERS, WHILE MAINTAINING A SOLVENT FUND. SINCE INCEPTION, NYSIF HAS FULFILLED THE DUAL ROLES FOR WHICH IT WAS CREATED: TO COMPETE WITH OTHER CARRIERS TO ENSURE A FAIR MARKETPLACE AND TO BE A GUARANTEED SOURCE OF COVERAGE FOR EMPLOYERS WHO CANNOT SECURE COVERAGE ELSEWHERE.\n\nNYSIF IS THE LARGEST WORKERS’ COMPENSATION CARRIER IN NEW YORK STATE AND AMONG THE TOP TEN LARGEST WORKERS’ COMPENSATION CARRIERS IN THE NATION, INSURING APPROXIMATELY 131,000 POLICYHOLDERS, WITH MORE THAN $1.6 BILLION IN ANNUAL EARNED PREMIUM AND OVER $22 BILLION IN ASSETS. A SELF-SUPPORTING INSURANCE CARRIER, NYSIF OPERATES WITHOUT TAXPAYER FUNDING.\n\nIN ADDITION TO WORKERS’ COMPENSATION INSURANCE, NYSIF PROVIDES DISABILITY BENEFITS COVERAGE FOR OFF-THE-JOB INJURIES TO MORE THAN 57,500 NEW YORK EMPLOYERS. IN 2018, NYSIF ADDED PAID FAMILY LEAVE AS A COMPONENT OF ITS DISABILITY BENEFITS PRODUCT, PROVIDING NEW YORKERS WITH JOB-PROTECTED, PAID TIME AWAY FROM WORK TO CARE FOR THEIR FAMILIES.\n\nNYSIF COMMITMENT TO DIVERSITY, EQUITY, AND INCLUSION\n\nTHE NEW YORK STATE INSURANCE FUND (NYSIF) PRIORITIZES AND CHAMPIONS DIVERSITY, EQUITY, AND INCLUSION (DEI) THROUGHOUT OUR AGENCY. NYSIF PROVIDES EQUAL OPPORTUNITIES TO ALL EMPLOYEES AND APPLICANTS FOR EMPLOYMENT WITHOUT REGARD TO RACE, RELIGION, COLOR, AGE, SEX, NATIONAL ORIGIN, SEXUAL ORIENTATION, GENDER IDENTITY, DISABILITY, VETERAN STATUS, OR ANY OTHER PROTECTED CATEGORY UNDER FEDERAL, STATE, AND LOCAL LAW. WE BELIEVE THAT EMBRACING OUR DIFFERENCES BRINGS RICHNESS, NEW IDEAS AND EXPERIENCES TO NYSIF, WHICH ENERGIZES A CREATIVE AND INNOVATIVE WORK ENVIRONMENT. WE STRIVE TO FOSTER A WORKPLACE WHERE DIVERSE INDIVIDUALS ARE ABLE TO PARTICIPATE FULLY IN THE DECISION-MAKING PROCESS AND HAVE AMPLE OPPORTUNITY FOR ADVANCEMENT. WE ARE COMMITTED TO INVESTING THE NECESSARY RESOURCES AND ATTENTION TO IMPROVING THE ENGAGEMENT, RETENTION, AND PROMOTION OF THE EXTRAORDINARY TALENT WE HAVE.\n\n#NYSIF\n\n",
    "job_skill_set": [
      "Human Resources Management",
      "Onboarding",
      "Leave Administration",
      "Data Entry",
      "Bachelor's Degree",
      "Professional Human Resources Experience",
      "Customer Service",
      "Communication",
      "Teamwork",
      "Problem Solving",
      "Attention to Detail",
      "Adaptability",
      "Diversity and Inclusion Awareness",
      "Oracle",
      "LATS (Leave and Time System)"
    ],
    "short_keywords": [
      "12",
      "1trainee",
      "adaptability",
      "administration",
      "and",
      "attention",
      "awareness",
      "bachelors",
      "communication",
      "customer",
      "data",
      "degree",
      "detail",
      "diversity",
      "entry",
      "experience",
      "helps",
      "hr",
      "human",
      "inclusion",
      "lats",
      "leave",
      "management",
      "onboarding",
      "oracle",
      "problem",
      "professional",
      "resources",
      "service",
      "solving",
      "specialist",
      "system",
      "teamwork",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3902829415",
    "job_title": "Human Resources Manager",
    "category": "HR",
    "job_description": "WHO ARE WEHONEYWELL IS A FORTUNE 100 COMPANY THAT INVENTS AND MANUFACTURES TECHNOLOGIES TO ADDRESS CRITICAL CHALLENGES LINKED TO GLOBAL MACROTRENDS SUCH AS SAFETY, SECURITY, PRODUCTIVITY, GLOBAL URBANIZATION AND ENERGY. WITH APPROXIMATELY 129,000 EMPLOYEES WORLDWIDE, INCLUDING MORE THAN 19,000 ENGINEERS AND SCIENTISTS, HONEYWELL HAS AN UNRELENTING FOCUS ON QUALITY, DELIVERY, VALUE, AND TECHNOLOGY IN EVERYTHING THEY MAKE AND DO. HONEYWELL HAS BEEN NAMED A TOP 100 GLOBAL INNOVATOR FOR SEVEN YEARS IN A ROW, RECOGNIZING THE COMPANY’S GLOBAL REACH OF PORTFOLIO AND INVENTION INFLUENCE. IN KANSAS CITY, HONEYWELL FEDERAL MANUFACTURING & TECHNOLOGIES (FM&T) MANAGES AND OPERATES THE U.S. DEPARTMENT OF ENERGY/NATIONAL NUCLEAR SECURITY ADMINISTRATION’S (NNSA) KANSAS CITY NATIONAL SECURITY CAMPUS. THIS STATE-OF-THE-ART ENGINEERING, MANUFACTURING AND SOURCING FACILITY PRODUCES A WIDE ARRAY OF INTRICATE COMPONENTS TO DELIVER TRUSTED NATIONAL SECURITY PRODUCTS AND GOVERNMENT SERVICES PRIMARILY FOR THE NNSA. HONEYWELL FM&T’S CULTURE OF INTEGRITY, COMMITMENT AND CONTINUOUS IMPROVEMENT ENABLES THEM TO DELIVER RESPONSIVE, COLLABORATIVE AND INNOVATIVE MANAGEMENT AND TECHNOLOGY SERVICES AND PRODUCTS THAT TRANSLATE INTO CUTTING EDGE SOLUTIONS TO COMPLEX NATIONAL SECURITY ISSUES. THIS IS A HYBRID ROLE LOCATED OUT OF OUR KANSAS CITY, MO LOCATION AND DOES REQUIRE US CITIZENSHIP.\nTHIS ROLE WILL LEAD HR STRATEGIES WITH CROSS-FUNCTIONAL TEAMS AND LEADERS TO BROKER HR SERVICES AND ACTIVELY ENGAGE IN TALENT ACQUISITION, ORGANIZATIONAL DEVELOPMENT, TALENT MANAGEMENT, COACHING AND DIRECT EMPLOYEE INTERACTION AND EMPLOYEE RELATIONS ISSUES. THIS ROLE WILL PROVIDE EXPERTISE AND SUPPORT OF COMPLEX INITIATIVES AND RESOLVE DIVERSE BUSINESS ISSUES. SELECTED CANDIDATES WILL BUILD UPON AND RELY ON THEIR HR FUNCTIONAL EXPERTISE AND EFFECTIVENESS TO ALIGN CRITICAL HR PRINCIPLES WITH BUSINESS OBJECTIVES. THIS ROLE MAY ACT AS A MANAGER FOR ONE TO THREE HR GENERALISTS.\nPROVIDE HR SUPPORT FOR THE BUSINESS WHILE PARTNERING WITH CROSS-FUNCTIONAL TEAMS AND LEADERS AND LEVERAGING HR FUNCTIONAL EXPERTISE TO SUPPORT CRITICAL HUMAN RESOURCES OBJECTIVES.ACTS AS A HR LIAISON TO DIVISIONAL AND DEPARTMENT UNITS. RESOLVES COMPLEX ISSUES RELATED TO THE DEVELOPMENT AND IMPLEMENTATION OF HR PROCESSES, ENSURING COMPLIANCE WITH STATE AND FEDERAL LAWS AND REGULATIONS. MAY ACT AS HUMAN RESOURCES PROJECT LEADER ON SPECIAL PROJECTS/PROGRAMS.BUILD A WORKFORCE THAT CREATES A COMPETITIVE ADVANTAGE BY RECRUITING, DEVELOPING AND RETAINING TOP TALENT.DRIVE CONTINUOUS IMPROVEMENT AND LEAD CHANGE IN A PREMIERE HR ORGANIZATION. RESOLVES COMPLEX ISSUES RELATED TO DEVELOPMENT AND IMPLEMENTATION OF HR PROCESSES.PROVIDES LEADERSHIP AND MENTORING FOR OTHER HR STAFF MEMBERS.PROVIDES A BROAD RANGE OF HR SUPPORT INCLUDING CHANGE MANAGEMENT, LEADER EFFECTIVENESS, ORGANIZATIONAL DESIGN, EMPLOYEE ENGAGEMENT, AND EMPLOYEE RELATIONS. APPLIES UNDERSTANDING OF COMPENSATION PRINCIPLES, CONCEPTS AND STANDARDS; PLAYING A ROLE IN SALARY AND INCENTIVE COMPENSATION PLANNING FOR THE BUSINESS.REVIEWS COMPLAINTS AND LEADS INVESTIGATIONS TO INCLUDE RECOMMENDING CLOSURE ACTIONS. INVESTIGATES AND PARTICIPATES IN RESOLUTION OF ALLEGATIONS OF DISCRIMINATION, SEXUAL HARASSMENT, UNFAIR TREATMENT, ETC.COACHES AND COUNCILS EMPLOYEES AND MANAGEMENT ON MULTIPLE TOPICS, INCLUDING CAREER PLANNING AND DEVELOPMENT AND GUIDES MANAGEMENT IN IDENTIFYING HIGH POTENTIAL CANDIDATES.SUPPORTS AN ENVIRONMENT THAT VALUES DIVERSITY, INCLUSION, EQUALITY, AND ACCEPTANCE.MAY PERFORM OTHER DUTIES AS REQUIRED. \nYOU MUST HAVEMINIMUM OF SEVEN YEARS HUMAN RESOURCES EXPERIENCE WITH DEMONSTRATED PROJECT LEADERSHIP AND EMPLOYEE RELATIONS EXPERIENCE.BACHELOR'S DEGREE REQUIRED - PREFER IN AN APPROPRIATE FIELD SUCH AS HUMAN RESOURCES, ORGANIZATIONAL BEHAVIOR, BUSINESS ADMINISTRATION AND/OR A MASTER'S DEGREE.ABILITY TO TRAVEL UP TO 10% OF THE TIME.ABILITY TO WORK REMOTE, HYBRID, OR ON-SITE AS DIRECTED BY MANAGEMENT AND IS DETERMINED BY THE NEEDS OF THE BUSINESS.ABILITY TO RECEIVE DOE SECURITY CLEARANCE.\nWE VALUEPRIOR EXPERIENCE IN A HUMAN RESOURCES GENERALIST ROLE WITH HISTORY OF EFFECTIVELY RESOLVING EMPLOYEE RELATION ISSUES AND A STRONG UNDERSTANDING OF THE PROCESSES AND CYCLES OF CLIENT SUPPORT.DEMONSTRATED EXPERTISE IN EFFECTIVE INTERPERSONAL SKILLS INCLUDING INTERVIEWING, COUNSELING, AND GROUP PRESENTATIONS. EXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLS. DEMONSTRATED LEADERSHIP SKILLS INCLUDING THE ABILITY TO INFLUENCE AT VARYING LEVELS ACROSS THE ORGANIZATION AND WORK EFFECTIVELY WITH ALL LEVELS OF EMPLOYEES.ABLE TO HANDLE MULTIPLE PRIORITIES AND NAVIGATE IN A HIGHLY MATRIXED ENVIRONMENT FINDING THE CORRECT BALANCE BETWEEN DEMAND AND CAPACITY WHEN ESTABLISHING PRIORITIES FOR THE ORGANIZATION.WORKING KNOWLEDGE OF GOVERNMENT LAWS, REGULATIONS, AND LEGAL DECISIONS AFFECTING EMPLOYMENT.ABLE TO BE AGILE AND COURAGEOUS WHILE MAINTAINING A HIGH LEVEL OF EMOTIONAL INTELLIGENCE.ABLE TO EFFECTIVELY COLLABORATE WITH ALL HR COES AND BUSINESS UNITS.\nHONEYWELL IS AN EQUAL OPPORTUNITY EMPLOYER. QUALIFIED APPLICANTS WILL BE CONSIDERED WITHOUT REGARD TO AGE, RACE, CREED, COLOR, NATIONAL ORIGIN, ANCESTRY, MARITAL STATUS, AFFECTIONAL OR SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, DISABILITY, NATIONALITY, SEX, RELIGION, OR VETERAN STATUS. IF YOU REQUIRE A REASONABLE ACCOMMODATION TO SUBMIT AN APPLICATION, PLEASE SEND AN EMAIL TO OUR REASONABLE ACCOMMODATION SUPPORT TEAM.",
    "job_skill_set": [
      "human resources",
      "employee relations",
      "talent acquisition",
      "organizational development",
      "change management",
      "compensation principles",
      "project leadership",
      "government laws and regulations",
      "data analysis",
      "communication",
      "leadership",
      "interpersonal skills",
      "problem solving",
      "collaboration",
      "emotional intelligence",
      "agility",
      "mentoring",
      "prioritization"
    ],
    "short_keywords": [
      "acquisition",
      "agility",
      "analysis",
      "and",
      "change",
      "collaboration",
      "communication",
      "compensation",
      "data",
      "development",
      "emotional",
      "employee",
      "government",
      "hr",
      "human",
      "intelligence",
      "interpersonal",
      "laws",
      "leadership",
      "management",
      "manager",
      "mentoring",
      "organizational",
      "principles",
      "prioritization",
      "problem",
      "project",
      "regulations",
      "relations",
      "resources",
      "skills",
      "solving",
      "talent"
    ]
  },
  {
    "job_id": "3894288438",
    "job_title": "Senior Human Resources Specialist",
    "category": "HR",
    "job_description": "ABOUT US BAIN & COMPANY IS A GLOBAL CONSULTANCY THAT HELPS THE WORLD’S MOST AMBITIOUS CHANGE MAKERS DEFINE THE FUTURE.ACROSS 65 CITIES IN 40 COUNTRIES, WE WORK ALONGSIDE OUR CLIENTS AS ONE TEAM WITH A SHARED AMBITION TO ACHIEVE EXTRAORDINARY RESULTS, OUTPERFORM THE COMPETITION, AND REDEFINE INDUSTRIES. WE COMPLEMENT OUR TAILORED, INTEGRATED EXPERTISE WITH A VIBRANT ECOSYSTEM OF DIGITAL INNOVATORS TO DELIVER BETTER, FASTER, AND MORE ENDURING OUTCOMES. OUR 10-YEAR COMMITMENT TO INVEST MORE THAN $1 BILLION IN PRO BONO SERVICES BRINGS OUR TALENT, EXPERTISE, AND INSIGHT TO ORGANIZATIONS TACKLING TODAY’S URGENT CHALLENGES IN EDUCATION, RACIAL EQUITY, SOCIAL JUSTICE, ECONOMIC DEVELOPMENT, AND THE ENVIRONMENT. WE EARNED A PLATINUM RATING FROM ECOVADIS, THE LEADING PLATFORM FOR ENVIRONMENTAL, SOCIAL, AND ETHICAL PERFORMANCE RATINGS FOR GLOBAL SUPPLY CHAINS, PUTTING US IN THE TOP 1% OF ALL COMPANIES. SINCE OUR FOUNDING IN 1973, WE HAVE MEASURED OUR SUCCESS BY THE SUCCESS OF OUR CLIENTS, AND WE PROUDLY MAINTAIN THE HIGHEST LEVEL OF CLIENT ADVOCACY IN THE INDUSTRY.\n\n\nWHO YOU WILL WORK WITHYOU WILL, AS A MEMBER OF THE TEXAS HR TEAM, THE HR SR. SPECIALIST, ACTS AS AN HR BUSINESS PARTNER FOR THE HOUSTON OFFICE AND ASSIGNED EMPLOYEE COHORTS ACROSS ALL OFFICES OF THE TEXAS OFFICE SYSTEM IN HOUSTON, DALLAS AND AUSTIN. THE SR. SPECIALIST WILL BE THE PRIMARY POINT OF CONTACT FOR SPECIFIC HR PROGRAMS, TASKS & INITIATIVES, ESCALATING HIGH PRIORITY ITEMS TO THE MANAGER AND DIRECTOR AS NECESSARY. THE PROGRAMS ARE IMPORTANT PIECES OF BAIN’S EMPLOYEE VALUE PROPOSITION, THUS A FOCUS ON CUSTOMER SERVICE, ATTENTION TO DETAIL AND STRONG COMMUNICATION IS CRITICAL IN THE EXECUTION OF THESE PROGRAMS. THE HR SR. SPECIALIST ACTIVELY COLLABORATES WITH THE BROADER TEXAS HR & PROGRAM MANAGEMENT TEAM, CENTERS OF EXCELLENCE (COE), SHARED SERVICES CENTER (SSC), AMERICAS REGIONAL TALENT TEAM AND BROADER OFFICE LEADERSHIP.\n\n\nWHAT YOU’LL DOADMINISTER HR PROGRAMS RELATED TO PEOPLE MOVEMENT LIKE TRANSFERS, EXTERNSHIPS, & LOAS O RESPONSIBLE TO DISCUSS OPTIONS, POLICIES, AND DEADLINES WITH EMPLOYEESO YOU WILL OVERSEE TRANSFERS FOR ASSIGNED POPULATIONSO YOU WILL WORK WITH SSC TO ENSURE LOA AND EXTERNSHIP PAPERWORK IS COMPLETED AND INFORMATION IS ENTERED INTO WORKDAY\n\nPROVIDE PERFORMANCE EVALUATION AND PROMOTION PROCESS SUPPORT INCLUDING:O PARTNER WITH PROGRAM MANAGEMENT TEAM FOR RELEVANT COHORTS ON SUPPORTING THE RATINGS AND CALIBRATION PROCESS AND SUPPORT COORDINATION OF PROMOTION COMMITTEES AT SM TENURE LEVELO YOU WILL, FOR THOSE MEMBERS IN A PERFORMANCE WATCH/UNDERPERFORMANCE SITUATION, ENSURE CHECK INS ARE OCCURRING AND PERFORMANCE MANAGEMENT PROCESSES ARE HAPPENINGO YOU WILL CREATE AND DELIVER UNDERPERFORMANCE AND RE-TENURE MEMOS AND MESSAGINGO YOU WILL WORK WITH PM TO HANDLE TRICKY PERFORMANCE MANAGEMENT SITUATIONS AND PROVIDE RECOMMENDATIONS AS NECESSARY, WITH OVERSIGHT FROM MANAGER AS NEEDEDO YOU WILL OWN HR LOGISTICS FOR PROMOTION PROCESSES ENSURING COMMUNICATIONS, COLLABORATION WITH SSC AND IMPORTANT DEADLINES ARE BEING MET\n\nMANAGE DEPARTURES & TRANSITION PROGRAM FOR ASSIGNED POPULATIONSO DISCUSS WITH EMPLOYEES THE OPTIONS AVAILABLE, RESOURCES, AND WHAT TO EXPECT/NEXT STEPSO YOU WILL CONDUCT EXIT INTERVIEWS AND CALCULATE DEPARTURE BONUSESO YOU WILL GENERATE, PROCESS, AND TRACK PAPERWORK AS WELL AS ENSURE LOCAL TEAMS ARE NOTIFIED SUCH AS TSG/OFFICE SERVICES/PAYROLL/BCA/FINANCE WHEN PROCESSING DEPARTURESO YOU WILL WORK WITH SSC TO ENSURE DEPARTURE INFORMATION AND DOCUMENTATION IS ENTERED INTO WORKDAY\n\nSUPPORT COMPENSATION PROCESSES FOR ASSIGNED POPULATIONSO YOU WILL REVIEW MONTHLY INDIVIDUALIZED PROGRESSION/CLICK-UP DATAO YOU WILL REVIEW PROFIT SHARING DATA AND ENSURE MEMOS ARE DISTRIBUTEDO YOU WILL BE THE POINT OF CONTACT FOR EMPLOYEES AND PM ON COMPENSATION QUESTIONS, LIAISING WITH COMPENSATION COE AS NEEDED\n\nPROVIDE ONBOARDING SUPPORT FOR FIRST YEAR CONSULTANTS INCLUDING TRACKING OFFER LETTERS, INITIATING, AND MONITORING BACKGROUND CHECKS, COORDINATING WITH SSC ON ENTERING INFORMATION INTO WORKDAY WITH CORRECT START DATES AND ENSURE ALL EMPLOYEE RECORDS ARE KEPT UP TO DATE WITH ALL RELEVANT OFFER LETTERS, CONTRACTS AND AGREEMENTS. WORK WITH THE SSC TO PROCESS RELEVANT SIGNING, HOUSING, AND RELOCATION BONUSES.O YOU WILL LIAISE WITH HR AND RECRUITING TEAM MEMBERS TO ENSURE SUCCESSFUL ONBOARDING FOR ALL NEW CONSULTING STAFFO YOU WILL COMMUNICATE START DATE TO LOCAL CONTACTSO YOU WILL, WHILE PARTNERING WITH THE HR TEAM, COORDINATE LOGISTICS FOR NEW HIRE TRAINING FOR OUR NEW CONSULTING HIRES INCLUDING SCHEDULING TRAINING SESSIONS, SUPPORT IN FINDING TRAINERS AS NEEDED, & MANAGING CALENDAR INVITES, SHARING UPDATED MATERIALS AND WORKING CLOSELY WITH PROGRAM MANAGERS AND TRAINERSO YOU WILL PRESENT VARIOUS ONBOARDING SESSIONS DURING ORIENTATIONS THROUGHOUT THE YEARO YOU WILL COLLECT CONFIDENTIALITY AGREEMENTS FROM NEW HIRES AND UPLOADS INTO WORKDAY\n\nOTHER IMPORTANT RESPONSIBILITIESO YOU WILL PROVIDE LOCAL, ON THE GROUND HR SUPPORT FOR THE HOUSTON OFFICE, INCLUDING TEAMING WITH THE OFFICE SERVICES STAFF AS NEEDEDO YOU WILL GATHER DATA AND RUN REPORTS AS REQUESTED IN WORKDAYO YOU WILL SUPPORT OFFICE CULTURE BY MAINTAINING A PRESENCE IN THE OFFICE AND BEING AN ACTIVE CONTRIBUTOR TO EMPLOYEE CONNECTEDNESS AND CULTURE/EVENTS THAT OCCUR THROUGHOUT THE OFFICEO YOU WILL WORK WITH PROGRAM MANAGEMENT TO SUPPORT CLASS LEVEL RESPONSES TO FEEDBACK RECEIVED FROM OUR ANNUAL WORLD WIDE EMPLOYEE SURVEYO YOU WILL BE THE POINT OF CONTACT TO RESPOND TO BASIC EMPLOYEE CONCERNS; ELEVATE MORE SERIOUS EMPLOYEE CONCERNS TO HR MANAGER, ER TEAM, OR OFFICE LEADERSHIP\n\n\n\nABOUT YOUA BACHELOR'S DEGREE OR AN EQUIVALENT COMBINATION OF EDUCATION, TRAINING AND/OR EXPERIENCE ALONG WITH 4 YEARS OF HR PROFESSIONAL EXPERIENCE IS REQUIRED.\nSTRONG CUSTOMER SERVICE, ORGANIZATION, INTERPERSONAL AND COMMUNICATION SKILLS ALONG WITH AN ABILITY TO DEAL WITH HIGHLY CONFIDENTIAL INFORMATION APPROPRIATELY; ABILITY TO PRIORITIZE, MEET DEADLINES, AND JUGGLE MULTIPLE TASKS SIMULTANEOUSLY IS NEEDED. AND METICULOUS ATTENTION TO DETAIL IS ALSO NECESSARY.\nCOMPREHENSIVE KNOWLEDGE OF, AND EXPERIENCE WITH MICROSOFT WORD/EXCEL/POWERPOINT IS REQUIRED; PREVIOUS HRIS SYSTEMS EXPERIENCE A BONUS. PREVIOUS EXPERIENCE IN EITHER A CONSULTING OR PARTNERSHIP (MATRIXED-REPORTING) FIRM OR ORGANIZATION IS HIGHLY PREFERRED. \nPLEASE NOTE: THIS IS A HYBRID ROLE AND WILL REQUIRE AN ONSITE PRESENCE OF AT LEAST THREE (3) DAYS A WEEK IN THE OFFICE.\n\n\nWHAT MAKES US A GREAT PLACE TO WORKWE ARE PROUD TO BE CONSISTENTLY RECOGNIZED AS ONE OF THE WORLD'S BEST PLACES TO WORK, A CHAMPION OF DIVERSITY AND A MODEL OF SOCIAL RESPONSIBILITY. WE ARE CURRENTLY RANKED THE #1 CONSULTING FIRM ON GLASSDOOR’S BEST PLACES TO WORK LIST, AND WE HAVE MAINTAINED A SPOT IN THE TOP FOUR ON GLASSDOOR'S LIST FOR THE LAST 12 YEARS. WE BELIEVE THAT DIVERSITY, INCLUSION AND COLLABORATION IS KEY TO BUILDING EXTRAORDINARY TEAMS. WE HIRE PEOPLE WITH EXCEPTIONAL TALENTS, ABILITIES AND POTENTIAL, THEN CREATE AN ENVIRONMENT WHERE YOU CAN THRIVE BOTH PROFESSIONALLY AND PERSONALLY. WE ARE PUBLICLY RECOGNIZED BY EXTERNAL PARTIES SUCH AS FORTUNE, VAULT, MOGUL, WORKING MOTHER, GLASSDOOR AND THE HUMAN RIGHTS CAMPAIGN FOR BEING A GREAT PLACE TO WORK FOR DIVERSITY AND INCLUSION, WOMEN, LGBTQ AND PARENTS",
    "job_skill_set": [
      "Microsoft Word",
      "Microsoft Excel",
      "Microsoft PowerPoint",
      "Customer Service",
      "Attention to Detail",
      "Communication",
      "Interpersonal Skills",
      "Problem Solving",
      "HRIS Systems",
      "Performance Management",
      "Onboarding Processes",
      "Data Analysis",
      "Confidentiality Management",
      "Organization",
      "Time Management",
      "Collaboration",
      "Adaptability",
      "Teamwork"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "attention",
      "collaboration",
      "communication",
      "confidentiality",
      "customer",
      "data",
      "detail",
      "excel",
      "hr",
      "hris",
      "human",
      "interpersonal",
      "management",
      "microsoft",
      "onboarding",
      "organization",
      "performance",
      "powerpoint",
      "problem",
      "processes",
      "resources",
      "senior",
      "service",
      "skills",
      "solving",
      "specialist",
      "systems",
      "teamwork",
      "time",
      "to",
      "word"
    ]
  },
  {
    "job_id": "3902880391",
    "job_title": "Senior Human Resources Business Partner",
    "category": "HR",
    "job_description": "OVERVIEW: AXIOM SPACE IS THE COMMERCIAL LEADER IN HUMAN SPACEFLIGHT AND ON-ORBIT RESEARCH & MANUFACTURING SERVICES, STEERED BY A TEAM OF EXPERTS AND GUIDED BY THE VISION OF A THRIVING HOME IN SPACE THAT BENEFITS EVERY HUMAN, EVERYWHERE. AXIOM PROVIDES UNPRECEDENTED ACCESS TO THE INTERNATIONAL SPACE STATION TODAY WHILE BUILDING AND OPERATING ITS SUCCESSOR – THE WORLD’S FIRST INTERNATIONAL COMMERCIAL SPACE STATION – TO IMPROVE LIFE ON EARTH AND FOSTER POSSIBILITIES BEYOND IT. OUR MISSION-DRIVEN TEAM IS SEEKING A BOLD AND DYNAMIC SENIOR HR BUSINESS PARTNER WHO IS PREOCCUPIED WITH BIG QUESTIONS: WHERE DO WE GO FROM HERE? WHAT ARE THE LIMITS OF INNOVATION AND EXPLORATION? HOW DO WE CONTINUE TO EVOLVE AS A SPECIES?SUMMARY:  AS A SENIOR HR BUSINESS PARTNER, YOU WILL PLAY A PIVOTAL ROLE IN ALIGNING HUMAN RESOURCES STRATEGIES WITH BUSINESS OBJECTIVES. YOUR RESPONSIBILITIES WILL REVOLVE AROUND FOSTERING A POSITIVE WORK CULTURE, FACILITATING EMPLOYEE ENGAGEMENT, AND PROVIDING STRATEGIC HR SUPPORT TO VARIOUS DEPARTMENTS WITHIN THE ORGANIZATION. YOU WILL COLLABORATE CLOSELY WITH SENIOR MANAGEMENT TO DEVELOP AND IMPLEMENT HR INITIATIVES THAT DRIVE ORGANIZATIONAL GROWTH AND EMPLOYEE SATISFACTION. DUTIES & RESPONSIBILITIESAS A TRUSTED ADVISOR AND SUBJECT MATTER EXPERT ON ALL HR-RELATED MATTERS, OFFERING GUIDANCE AND EXPERTISE TO STAKEHOLDERS ACROSS THE ORGANIZATION.CLOSELY WITH SENIOR LEADERSHIP TO GAIN INSIGHTS INTO BUSINESS OBJECTIVES, FACILITATING THE DEVELOPMENT OF HR STRATEGIES ALIGNED WITH ORGANIZATIONAL GOALS.WITH VARIOUS HR CENTERS OF EXCELLENCE, INCLUDING COMPENSATION, BENEFITS, PAYROLL, TALENT ACQUISITION, COMMUNICATIONS, AND LEARNING AND DEVELOPMENT, TO DELIVER COHESIVE HR SOLUTIONS AND INITIATIVES.WITH DEPARTMENT HEADS TO STRATEGIZE ON WORKFORCE PLANNING, SUCCESSION PLANNING, AND TALENT PIPELINES, EMPHASIZING OUR COMMITMENT TO LEADERSHIP.HR METRICS AND TRENDS ANALYSIS TO PROVIDE ACTIONABLE INSIGHTS AND RECOMMENDATIONS FOR ENHANCING EMPLOYEE ENGAGEMENT, RETENTION, AND DIVERSITY.THOROUGH REVIEWS OF HR PROCEDURES TO ENSURE CONSISTENCY AND EFFECTIVENESS AMONG WORK SITE EMPLOYEES, FOSTERING INNOVATION IN LINE WITH ORGANIZATIONAL VALUES.COMPANY AND HR POLICIES, CONDUCTING INVESTIGATIONS INTO COMPLAINTS WHILE OFFERING GUIDANCE AND CONSULTATION TO MANAGEMENT, GUIDED BY PRINCIPLES OF INTEGRITY.DAY-TO-DAY PERFORMANCE MANAGEMENT GUIDANCE TO LINE MANAGEMENT, INCLUDING COACHING, COUNSELING, CAREER DEVELOPMENT, AND DISCIPLINARY ACTIONS, CONSISTENT WITH OUR VALUE OF LEADERSHIP.INPUT ON BUSINESS UNIT RESTRUCTURES, WORKFORCE PLANNING, AND SUCCESSION PLANNING, COLLABORATING WITH STAKEHOLDERS TO DRIVE ORGANIZATIONAL EFFECTIVENESS.WITH MANAGEMENT AND EMPLOYEES TO ADDRESS PERFORMANCE OR BEHAVIORAL ISSUES THROUGH DOCUMENTATION, GOAL SETTING, SOLUTION DEVELOPMENT, AND CORRECTIVE ACTIONS, INCLUDING TERMINATION IF NECESSARY.HR SERVICE DELIVERY AND CULTIVATE EMPLOYEE RELATIONSHIPS AND ENGAGEMENT THROUGH PROACTIVE INITIATIVES.THE DEVELOPMENT AND IMPLEMENTATION OF ACTION PLANS AND HR PROJECTS IN PARTNERSHIP WITH THE MANAGEMENT TEAM TO BOOST EMPLOYEE ENGAGEMENT, REFLECTING OUR VALUE OF COLLABORATION.IN MANAGING FMLA, UNPAID AND PAID LEAVE, AND REVIEWING AND PROCESSING ADA ACCOMMODATION REQUESTS ENSURING COMPLIANCE WITH FEDERAL AND STATE REGULATIONS.AND SUPPORT CHANGE INITIATIVES ACROSS THE ORGANIZATION.A POSITIVE AND INCLUSIVE WORK ENVIRONMENT THROUGH PROACTIVE COMMUNICATION, RECOGNITION PROGRAMS, AND EMPLOYEE ENGAGEMENT INITIATIVES.ADDITIONAL JOB DUTIES AS ASSIGNED.QUALIFICATIONS: TO PERFORM THIS JOB SUCCESSFULLY, AN INDIVIDUAL MUST BE ABLE TO PERFORM EACH DUTY AND RESPONSIBILITY SATISFACTORILY. THE REQUIREMENTS LISTED BELOW ARE REPRESENTATIVE OF THE KNOWLEDGE, SKILL, AND/OR ABILITY REQUIRED. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS.EDUCATION & EXPERIENCEDEGREE OR EQUIVALENT COMBINATION OF DEGREE AND EXPERIENCE REQUIREDOF 10 YEARS OF EXPERIENCE IN A HR BUSINESS PARTNER POSITION MINIMUM OF 5 YEARS OF EXPERIENCE RESOLVING COMPLEX EMPLOYEE RELATIONS ISSUESKNOWLEDGE OF MULTIPLE HUMAN RESOURCE DISCIPLINES, INCLUDING COMPENSATION PRACTICES, ORGANIZATIONAL DIAGNOSIS, EMPLOYEE AND UNION RELATIONS, DIVERSITY, PERFORMANCE MANAGEMENT, AND FEDERAL AND STATE RESPECTIVE EMPLOYMENT LAWSIN MICROSOFT OFFICE REQUIREDIN START-UP ENVIRONMENT PREFERREDOR PHR PREFERREDESSENTIAL FUNCTIONS: WORK ENVIRONMENT: GENERALLY, AN OFFICE ENVIRONMENT, BUT CAN INVOLVE INSIDE OR OUTSIDE WORK DEPENDING ON THE TASK.REQUIREMENTS:BE ABLE TO COMPLETE A U.S. GOVERNMENT BACKGROUND INVESTIGATION.OF U.S. CITIZENSHIP OR US PERMANENT RESIDENCY IS A REQUIREMENT FOR THIS POSITION.PHYSICAL REQUIREMENTS:MAY INVOLVE SITTING OR STANDING FOR EXTENDED PERIODS (90% OF THE TIME). MAY REQUIRE LIFTING AND CARRYING UP TO 25 LBS. (5% OF THE TIME).AND MACHINES: STANDARD OFFICE EQUIPMENT (PC, TELEPHONE, PRINTER, ETC.)SKILLSORGANIZED AND DETAIL ORIENTED; ABLE TO JUGGLE, PRIORITIZE, AND KEEP TRACK OF MULTIPLE TASKS AND PROJECTS.TO MULTI-TASK, WORK INDEPENDENTLY WITH MINIMAL SUPERVISION, AND MAKE AND COMMUNICATE THE RATIONALE BEHIND KEY DECISIONS IN A CONSTANTLY EVOLVING FAST-PACED WORK ENVIRONMENT.PROJECT AND TIME MANAGEMENT SKILLS WITH A HIGH LEVEL OF INTUITION AND JUDGMENT.HAVE A “CAN DO” ATTITUDE – NO JOB IS TOO BIG OR SMALL, PROBLEM SOLVER.TO TAKE ON OWNERSHIP OF PROJECTS AD HOC AND DRIVE THEM FROM BEGINNING TO END.WRITTEN AND VERBAL COMMUNICATION SKILLSAND PROACTIVE; CREATIVE MIND WITH AN ABILITY TO SUGGEST IMPROVEMENTS.AND ENERGETIC SELF-STARTER; PROACTIVE ABOUT LEARNING AND MOTIVATED TO TAKE ON ADDITIONAL RESPONSIBILITIES OVER TIME.INTERPERSONAL SKILLS, INCLUDING THE ABILITY TO INTEGRATE QUICKLY INTO A SMALL TEAM AND REPRESENT THE COMPANY WITH INTEGRITY.CONFIDENT, DRIVEN, AND DYNAMIC.ABOUT CREATING AN INCLUSIVE WORKPLACE WHERE PEOPLE FROM DIFFERENT BACKGROUNDS CAN SUCCEED.COMPETENCIES: TO PERFORM THE JOB SUCCESSFULLY, AN INDIVIDUAL SHOULD DEMONSTRATE THE FOLLOWING COMPETENCIES:-TREATS PEOPLE WITH RESPECT; KEEPS COMMITMENTS; INSPIRES THE TRUST OF OTHERS; WORKS WITH INTEGRITY AND PRINCIPLES; UPHOLDS ORGANIZATIONAL VALUESSOLVING -IDENTIFIES AND RESOLVES PROBLEMS IN A TIMELY MANNER; GATHERS AND ANALYZES INFORMATION SKILLFULLY; DEVELOPS ALTERNATIVE SOLUTIONS; WORKS WELL IN GROUP PROBLEM SOLVING SITUATIONS; USES REASON EVEN WHEN DEALING WITH EMOTIONAL TOPICSSUPPORT -FOLLOWS POLICIES AND PROCEDURES; COMPLETES ADMINISTRATIVE TASKS CORRECTLY AND ON TIME; SUPPORTS ORGANIZATION'S GOALS AND VALUES; BENEFITS ORGANIZATION THROUGH OUTSIDE ACTIVITIES; SUPPORTS AFFIRMATIVE ACTION AND RESPECTS DIVERSITYEXPRESSES IDEAS AND THOUGHTS VERBALLY; EXPRESSES IDEAS AND THOUGHTS IN WRITTEN FORM; EXHIBITS GOOD LISTENING AND COMPREHENSION; KEEPS OTHERS ADEQUATELY INFORMED; SELECTS AND USES APPROPRIATE COMMUNICATION METHODSCONSCIOUSNESS -WORKS WITHIN APPROVED BUDGET; DEVELOPS AND IMPLEMENTS COST SAVING MEASURES; CONTRIBUTES TO PROFITS AND REVENUE; CONSERVES ORGANIZATIONAL RESOURCES-EAGER AND ABLE TO WORK IN A COLLABORATIVE AND CROSS-DISCIPLINARY FASHION IN A FAST-PACED, DYNAMIC AND DEADLINE-ORIENTED ENVIRONMENTAXIOM SPACE IS PROUD TO BE AN EQUAL OPPORTUNITY EMPLOYER. AXIOM SPACE DOES NOT DISCRIMINATE ON THE BASIS OF RACE, REGIONAL COLOR, NATIONAL ORIGIN, GENDER (INCLUDING PREGNANCY, CHILDBIRTH, OR RELATED MEDICAL CONDITIONS), SEXUAL ORIENTATION, GENDER IDENTITY, GENDER EXPRESSION, AGE, STATUS AS A PROTECTED VETERAN, STATUS AS AN INDIVIDUAL WITH DISABILITY, OR OTHER APPLICABLE LEGALLY PROTECTED CHARACTERISTICS.",
    "job_skill_set": [
      "employee engagement",
      "performance management",
      "Microsoft Office",
      "talent acquisition",
      "FMLA and ADA compliance",
      "project management",
      "HR policies and procedures",
      "diversity and inclusion initiatives",
      "communication",
      "problem solving",
      "interpersonal skills",
      "team collaboration",
      "organizational skills",
      "adaptability",
      "initiative",
      "integrity",
      "creativity",
      "leadership",
      "HR strategy development",
      "conflict resolution",
      "HR metrics analysis",
      "workforce planning",
      "organizational diagnosis"
    ],
    "short_keywords": [
      "acquisition",
      "ada",
      "adaptability",
      "analysis",
      "and",
      "business",
      "collaboration",
      "communication",
      "compliance",
      "conflict",
      "creativity",
      "development",
      "diagnosis",
      "diversity",
      "employee",
      "engagement",
      "fmla",
      "hr",
      "human",
      "inclusion",
      "initiative",
      "initiatives",
      "integrity",
      "interpersonal",
      "leadership",
      "management",
      "metrics",
      "microsoft",
      "office",
      "organizational",
      "partner",
      "performance",
      "planning",
      "policies",
      "problem",
      "procedures",
      "project",
      "resolution",
      "resources",
      "senior",
      "skills",
      "solving",
      "strategy",
      "talent",
      "team",
      "workforce"
    ]
  },
  {
    "job_id": "3904991969",
    "job_title": "Fixed-Term Appointment: UN Women Human Resources Business Partner",
    "category": "HR",
    "job_description": "JOB DESCRIPTION\n\nBACKGROUND:\n\nUN WOMEN, GROUNDED IN THE VISION OF EQUALITY ENSHRINED IN THE CHARTER OF THE UNITED NATIONS, WORKS FOR THE ELIMINATION OF DISCRIMINATION AGAINST WOMEN AND GIRLS; THE EMPOWERMENT OF WOMEN; AND THE ACHIEVEMENT OF EQUALITY BETWEEN WOMEN AND MEN AS PARTNERS AND BENEFICIARIES OF DEVELOPMENT, HUMAN RIGHTS, HUMANITARIAN ACTION AND PEACE AND SECURITY.\n\nWITHIN THE FRAMEWORK OF THE UN COMMON SYSTEM AND UN STAFF REGULATIONS AND RULES, THE HUMAN RESOURCES MANAGEMENT DIVISION DIRECTS AND SUPPORTS THE DELIVERY OF RESPONSIVE AND QUALITY HUMAN RESOURCE MANAGEMENT SERVICES, ENSURING INTEGRATION AND SYNERGY IN THE DEVELOPMENT OF A COMPREHENSIVE HUMAN RESOURCES MANAGEMENT FRAMEWORK. IT LEADS AND FACILITATES ORGANIZATIONAL CHANGE AND DEVELOPMENT AND ADVISES THE ORGANIZATION ON STRATEGIES TO ATTRACT, RETAIN, DEVELOP AND MOTIVATE HUMAN TALENT ACROSS THE RANGE OF SPECIALIZED OCCUPATIONS CRITICAL TO THE DELIVERY OF THE ORGANIZATION’S MANDATE THROUGH THE FOLLOWING SUB-AREAS:\n\nHR STRATEGY AND POLICY DEVELOPMENT AND EXECUTIONORGANIZATIONAL DESIGN AND CHANGE MANAGEMENTRECRUITMENT AND STAFFINGLEARNING AND TALENT MANAGEMENTPERFORMANCE MANAGEMENTWORKFORCE PLANNING AND MANAGEMENT\n\n\nUNDER THE SUPERVISION OF THE DEPUTY DIRECTOR, HUMAN RESOURCES AND IN CLOSE COLLABORATION WITH THE FUNCTIONAL EXPERTS/GLOBAL THEMATIC LEADS IN HR, THE HR BUSINESS PARTNER WILL BE RESPONSIBLE FOR IMPLEMENTING THE ABOVE-MENTIONED ACTIVITIES FOR THE DESIGNATED PORTFOLIO.\n\nLEAD THE IMPLEMENTATION OF HUMAN RESOURCES POLICIES, GUIDELINES, PROCEDURES AND STANDARD OPERATING PROCEDURES (SOPS) FOR DESIGNATED PORTFOLIO:\n\nMONITOR AND LEAD PROPER IMPLEMENTATION OF HR POLICIES, GUIDELINES, PRACTICES AND STANDARD OPERATING PROCEDURES AND PROVIDE ADVICE, WHEN NECESSARY;PROVIDE TECHNICAL CONTRIBUTIONS ON HR STRATEGIC PLANNING/DISCUSSIONS ON THE DIRECTION OF HUMAN RESOURCE SERVICES, GOAL SETTING AND ANNUAL WORK PLANNING;PROVIDE TECHNICAL GUIDANCE TO THE DESIGNATED OFFICES IN IMPLEMENTING POLICIES, GUIDELINES AND PROCEDURES IN RELATION TO HR OPERATIONS (CONTRACT MANAGEMENT, RECRUITMENT AND SELECTION, BENEFITS AND ENTITLEMENTS);OVERSEE THE HR STRATEGIC PLANNING/DISCUSSIONS ON HR GOAL SETTING AND ANNUAL WORK PLANNING ;LEAD TRAINING OF PERSONNEL ON HR SYSTEMS AND CONDUCT TRAINING AND BUILD STAFF CAPACITY .PROVIDE TECHNICAL SUPPORT TO THE DEVELOPMENT OF NEW POLICIES, GUIDELINES, PROCEDURES AND STANDARD OPERATING PROCEDURES, AS NECESSARY.\n\n\nPROVIDE GUIDANCE AND SUPPORT TO MANAGERS AND STAFF IN THE DESIGNATED OFFICES ON ISSUES RELATED TO HR, INCLUDING ATTRACTION AND RECRUITMENT, BENEFITS AND ENTITLEMENTS, AND SEPARATION:\n\nPROVIDE CURRENT AND PROSPECTIVE STAFF WITH TIMELY GUIDANCE ON RECRUITMENT AND CONTRACT POLICIES, GENERAL CONDITIONS OF SERVICES AND BUSINESS ORIENTATION;DEVELOP, LEAD AND MONITOR THE IMPLEMENTATION OF THE ANNUAL HR PLAN FOR THE DESIGNATED OFFICES, INCLUDING BUDGET.\n\n\nMANAGE ADMINISTRATION OF CONTRACTS, BENEFITS AND ENTITLEMENTS AND OTHER STAFFING ISSUES FOR STAFF AND OTHER PERSONNEL CATEGORIES WITHIN THE ASSIGNED PORTFOLIO:\n\nENSURE THAT STAFF AWARE OF THEIR RIGHTS AND OBLIGATIONS REGARDING THEIR ENTITLEMENTS AND THE PROCESSING OF THEIR ENTITLEMENTS;PROVIDE RELEVANT HR DATA TO HR HEADQUARTERS, REGIONAL, AND/OR DIVISION DIRECTORS AND COUNTRY OFFICE REPRESENTATIVES ON CONTRACTUAL ACTIONS;REVIEW AND RECOMMEND LEVELS OF REMUNERATION FOR EXTERNAL CONTRACTORS;OVERSEE AND LIAISE WITH THE UNDP TO ENSURE PROPER ADMINISTRATION OF CONTRACTS, BENEFITS AND ENTITLEMENTS FOR NATIONAL AND INTERNATIONAL STAFF IN ACCORDANCE WITH EXISTING SLA;APPROVE AND /OR CERTIFY PAYMENT OF SALARIES, ALLOWANCES AND ENTITLEMENTS, AS REQUIRED.\n\n\nFACILITATE THE RECRUITMENT AND SELECTION PROCESSES FOR THE ASSIGNED PORTFOLIO:\n\nFACILITATE TIMELY, TRANSPARENT AND COMPETITIVE RECRUITMENT AND SELECTION PROCESSES FOR INTERNATIONAL PROFESSIONAL POSITIONS AND GENERAL SERVICE POSITIONS WITHIN THE ASSIGNED PORTFOLIO, INCLUDING REVIEW OF THE JOB DESCRIPTIONS, INITIAL SCREENING OF APPLICATIONS, CLEARANCE OF THE SHORTLISTS, FACILITATION OF THE INTERVIEW PANELS, ASSESSMENT OF THE CANDIDATES AND SUBMISSION OF THE RESULTS OF THE SELECTION PROCESS FOR THE APPROVAL BY THE RELEVANT APPROVING AUTHORITIES IN ACCORDANCE WITH THE UN WOMEN POLICIES AND PROCEDURES, IN COORDINATION WITH THE GLOBAL THEMATIC RECRUITMENT LEAD;PRO-ACTIVELY WORK WITH THE MANAGEMENT OF THE DESIGNATED OFFICES TO REDUCE THE TIME-TO-RECRUIT KPI (TARGET OF 12 WEEKS FROM ADVERTISEMENT TO INITIAL NOTIFICATION);PROVIDE COORDINATION SUPPORT AND GUIDANCE IN THE ONBOARDING PROCESS;MONITOR AND PROVIDE GUIDANCE, AS NECESSARY, ON RECRUITMENT OF NATIONAL STAFF IN CLOSE COORDINATION WITH THE RESPECTIVE REGIONAL AND COUNTRY OFFICES WITHIN THE ASSIGNED PORTFOLIO;ACT AS SECRETARY TO THE REGIONAL/CENTRAL REVIEW BOARD TO ENSURE COMPLIANCE OF RECRUITMENT NATIONAL STAFF;PROVIDE CURRENT AND PROSPECTIVE OTHER PERSONNEL CATEGORIES, WITH GUIDANCE ON RECRUITMENT AND CONTRACTING POLICIES, GENERAL CONDITIONS OF SERVICE AND BUSINESS ORIENTATION.\n\n\nWORK CLOSELY WITH HQ HR TEAMS FOR TECHNICAL ADVICE AND IMPLEMENTATION ON ISSUES RELATED TO WORKPLACE RELATIONS AND TALENT AND PERFORMANCE MANAGEMENT:\n\nPROMOTE AND IMPLEMENT UN WOMEN WORKPLACE RELATIONS POLICIES AND INITIATIVES IN THE DESIGNATED OFFICES, INCLUDING WORK/LIFE BALANCE PROMOTION AND STRESS MANAGEMENT ACTIVITIES; FACILITATE MEDIATION FOR DISPUTES IN THE DESIGNATED OFFICES AS REQUIREDPROVIDE TECHNICAL SUPPORT TO MANAGEMENT OF THE DESIGNATED OFFICES IN ANALYZING THE WORKPLACE SURVEY RESULTS AND INITIATE ACTION PLAN;FACILITATE THE ANNUAL PERFORMANCE MANAGEMENT PROCESS FOR THE ASSIGNED PORTFOLIO TO INCLUDE STAFF AND MANAGER ORIENTATION ON THE PERFORMANCE MANAGEMENT SYSTEM; IDENTIFY POOR PERFORMANCE CASES WHICH COULD IMPACT ON CONTRACTUAL STATUS OR CAREER OF STAFF;BUILD STRATEGIC RELATIONSHIPS WITH MANAGERS AND ENSURE NEEDS OF THE DESIGNATED OFFICES ARE CAPTURED AND COMMUNICATED TO HQ; REPRESENT THE HR TEAM ON RECRUITMENT AND OTHER HUMAN RESOURCE MATTERS WHERE APPROPRIATE;ENSURE STAFF ARE AWARE OF HR GLOBAL TRAINING INITIATIVES AND OPPORTUNITIES; PROMOTE A LEARNING ENVIRONMENT, INCLUDING ORIENTATION FOR NEW STAFF;MONITOR AND FACILITATE THE TIMELY COMPLETION OF ALL MANDATORY TRAINING FOR ALL STAFF;PROMOTE AND IMPLEMENT UN WOMEN WORKPLACE RELATIONS POLICIES LEARNING AND DEVELOPMENT ACTIVITIES AS RELEVANT;PROVIDE CAREER COUNSELING SUPPORT TO STAFF AND PERSONNEL.\n\n\nCOORDINATE LEARNING AND DEVELOPMENT INITIATIVES AT THE DESIGNATED OFFICES:\n\nCOORDINATE LEARNING AND DEVELOPMENT ACTIVITIES IN THE REGION, INCLUDING ON CODE OF CONDUCT, BENEFITS AND ENTITLEMENTS AND PERFORMANCE MANAGEMENT;ASSESS TRAINING NEEDS AND COORDINATE CLOSELY WITH THE HR TALENT MANAGEMENT TEAM ON INITIATIVES.\n\n\nLIAISE CLOSELY WITH HR HQ AND COORDINATE COMMUNICATION AND OUTREACH ACTIVITIES REGARDING HR INITIATIVES:\n\nBUILD AWARENESS AND UNDERSTANDING OF HR POLICIES THROUGH CONSULTATION AND ENGAGEMENT ACROSS THE ORGANIZATION;SERVE AS HR’S SPOKESPERSON INTERNALLY AND EXTERNALLY AND NURTURE PARTNERSHIPS WITH RELEVANT PARTNERS;CONTRIBUTE TO HR’S OUTREACH PLATFORMS, INCLUDING INTRANET, INTERNET AND HR BULLETIN.\n\n\nDEVELOP AND IMPLEMENT HR SYSTEMS BASED ON HR NEEDS, INCLUDING HR REPORTING:\n\nANALYZE, TRACK AND PERIODICALLY REPORT ON RECRUITMENT TRENDS FOR MANAGEMENT AND DONORS;SHARE DATA AND INFORMATION WITH HUMAN RESOURCES HEADQUARTERS AS REQUESTED AND FINALIZE SPECIAL REPORTS AS REQUIRED;SHARE DATA AND INFORMATION ON HR ISSUES AS REQUESTED;ANALYZE WORKFORCE DATA IN THE DESIGNATED OFFICES AND PROVIDE BRIEFING NOTES AS REQUIRED;PREPARE SPECIAL REPORTS AS REQUIRED.\n\n\nSUPERVISE AND MONITOR THE WORK OF THE HR STAFF TEAM ASSIGNED WITHIN PORTFOLIO.\n\nPERFORM ANY OTHER DUTIES AS ASSIGNED BY SUPERVISOR.\n\nCOMPETENCIES :\n\nCORE VALUES:\n\nINTEGRITY;PROFESSIONALISM;RESPECT FOR DIVERSITY.\n\n\nCORE COMPETENCIES:\n\nAWARENESS AND SENSITIVITY REGARDING GENDER ISSUES;ACCOUNTABILITY;CREATIVE PROBLEM SOLVING;EFFECTIVE COMMUNICATION;INCLUSIVE COLLABORATION;STAKEHOLDER ENGAGEMENT;LEADING BY EXAMPLE.\n\n\nPLEASE VISIT THIS LINK FOR MORE INFORMATION ON UN WOMEN’S VALUES AND COMPETENCIES FRAMEWORK:\n\nFUNCTIONAL COMPETENCIES:\n\nEXCELLENT GENERAL HR KNOWLEDGE AND EXPERTISE WITH A FOCUS ON RECRUITMENT AND SELECTION, KNOWLEDGE OF MODERN CONCEPTS AND APPROACHES IN THE FIELD OF HR BUSINESS PARTNERING;EXCELLENT INTERPERSONAL SKILLS;EXCELLENT DIPLOMATIC NEGOTIATION SKILLS;EXCELLENT WRITTEN AND SPOKEN COMMUNICATION SKILLS;ABILITY TO WRITE AND PRESENT IDEAS, CONCEPTS AND POLICY POSITIONS;ABILITY TO HANDLE CONFIDENTIAL AND SENSITIVE INFORMATION;ABILITY TO BUILD AND NURTURE RELATIONSHIPS;STRONG PROBLEM SOLVING AND ANALYTICAL SKILLS;DEMONSTRATED ABILITY TO INTERACT WITH PERSONNEL AT ALL LEVELS WITHIN THE ORGANIZATION, DEMONSTRATED NEGOTIATING, CULTURAL SENSITIVITY AND DIPLOMATIC SKILLS;POSSESSES A HIGH DEGREE OF SENSITIVITY AND CHANGE MANAGEMENT ABILITIES TO INTERCULTURAL PERSONNEL AND ORGANIZATIONAL DYNAMICS;ABILITY TO PLAN, ORGANIZE, AND PRIORITIZE MULTIPLE AND SIMULTANEOUS HUMAN RESOURCES RELATED PROJECTS AND PROGRAMS IN A CHANGING ENVIRONMENT;STRONG UNDERSTANDING OF UN STAFF REGULATIONS AND RULES AND HUMAN RESOURCES POLICIES AND PROCEDURES IS AN ASSET.\n\n\nEDUCATION:\n\nMASTER’S DEGREE OR EQUIVALENT IN HUMAN RESOURCES, BUSINESS ADMINISTRATION, PSYCHOLOGY, ORGANIZATIONAL DEVELOPMENT, PUBLIC ADMINISTRATION OR OTHER RELEVANT SOCIAL SCIENCES.A FIRST-LEVEL UNIVERSITY DEGREE IN COMBINATION WITH TWO ADDITIONAL YEARS OF QUALIFYING EXPERIENCE MAY BE ACCEPTED IN LIEU OF THE ADVANCED UNIVERSITY DEGREE.\n\n\nEXPERIENCE:\n\nMINIMUM OF 7 YEARS OF PROGRESSIVELY RESPONSIBLE EXPERIENCE IN HUMAN RESOURCE MANAGEMENT OR RELATED AREA;EXPERIENCE IN RECRUITMENT AND SELECTION, BENEFITS ADMINISTRATION, AND WORKPLACE RELATIONS ARE REQUIRED;MINIMUM 3 YEARS WORK EXPERIENCE INTERNATIONALLY;FIELD EXPERIENCE IS AN ASSET;EXPERIENCE AS A HR BUSINESS PARTNER IS AN ADVANTAGE.\n\n\nLANGUAGES:\n\nFLUENCY IN ENGLISH IS REQUIRED;FLUENCY IN ANOTHER LANGUAGE IS AN ASSET.\n\n\nSTATEMENTS :\n\nIN JULY 2010, THE UNITED NATIONS GENERAL ASSEMBLY CREATED UN WOMEN, THE UNITED NATIONS ENTITY FOR GENDER EQUALITY AND THE EMPOWERMENT OF WOMEN. THE CREATION OF UN WOMEN CAME ABOUT AS PART OF THE UN REFORM AGENDA, BRINGING TOGETHER RESOURCES AND MANDATES FOR GREATER IMPACT. IT MERGES AND BUILDS ON THE IMPORTANT WORK OF FOUR PREVIOUSLY DISTINCT PARTS OF THE UN SYSTEM (DAW, OSAGI, INSTRAW AND UNIFEM), WHICH FOCUSED EXCLUSIVELY ON GENDER EQUALITY AND WOMEN'S EMPOWERMENT.\n\nDIVERSITY AND INCLUSION:\n\nAT UN WOMEN, WE ARE COMMITTED TO CREATING A DIVERSE AND INCLUSIVE ENVIRONMENT OF MUTUAL RESPECT. UN WOMEN RECRUITS, EMPLOYS, TRAINS, COMPENSATES, AND PROMOTES REGARDLESS OF RACE, RELIGION, COLOR, SEX, GENDER IDENTITY, SEXUAL ORIENTATION, AGE, ABILITY, NATIONAL ORIGIN, OR ANY OTHER BASIS COVERED BY APPROPRIATE LAW. ALL EMPLOYMENT IS DECIDED ON THE BASIS OF QUALIFICATIONS, COMPETENCE, INTEGRITY AND ORGANIZATIONAL NEED.\n\nIF YOU NEED ANY REASONABLE ACCOMMODATION TO SUPPORT YOUR PARTICIPATION IN THE RECRUITMENT AND SELECTION PROCESS, PLEASE INCLUDE THIS INFORMATION IN YOUR APPLICATION.\n\nUN WOMEN HAS A ZERO-TOLERANCE POLICY ON CONDUCT THAT IS INCOMPATIBLE WITH THE AIMS AND OBJECTIVES OF THE UNITED NATIONS AND UN WOMEN, INCLUDING SEXUAL EXPLOITATION AND ABUSE, SEXUAL HARASSMENT, ABUSE OF AUTHORITY AND DISCRIMINATION. ALL SELECTED CANDIDATES WILL BE EXPECTED TO ADHERE TO UN WOMEN’S POLICIES AND PROCEDURES AND THE STANDARDS OF CONDUCT EXPECTED OF UN WOMEN PERSONNEL AND WILL THEREFORE UNDERGO RIGOROUS REFERENCE AND BACKGROUND CHECKS. (BACKGROUND CHECKS WILL INCLUDE THE VERIFICATION OF ACADEMIC CREDENTIAL(S) AND EMPLOYMENT HISTORY. SELECTED CANDIDATES MAY BE REQUIRED TO PROVIDE ADDITIONAL INFORMATION TO CONDUCT A BACKGROUND CHECK.)",
    "job_skill_set": [
      "Recruitment and selection",
      "Benefits administration",
      "HR systems implementation",
      "Data analysis",
      "Training and development",
      "Effective communication",
      "Interpersonal skills",
      "Team leadership",
      "Accountability",
      "HR strategy and policy development",
      "Performance management",
      "Contract management",
      "Workforce planning",
      "Knowledge of UN staff regulations",
      "Stakeholder engagement",
      "Creative problem solving",
      "Cultural sensitivity",
      "Negotiation skills",
      "Change management",
      "Inclusive collaboration"
    ],
    "short_keywords": [
      "accountability",
      "administration",
      "analysis",
      "and",
      "appointment",
      "benefits",
      "business",
      "change",
      "collaboration",
      "communication",
      "contract",
      "creative",
      "cultural",
      "data",
      "development",
      "effective",
      "engagement",
      "fixedterm",
      "hr",
      "human",
      "implementation",
      "inclusive",
      "interpersonal",
      "knowledge",
      "leadership",
      "management",
      "negotiation",
      "of",
      "partner",
      "performance",
      "planning",
      "policy",
      "problem",
      "recruitment",
      "regulations",
      "resources",
      "selection",
      "sensitivity",
      "skills",
      "solving",
      "staff",
      "stakeholder",
      "strategy",
      "systems",
      "team",
      "training",
      "un",
      "women",
      "workforce"
    ]
  },
  {
    "job_id": "3886485488",
    "job_title": "Human Resources Manager",
    "category": "HR",
    "job_description": "OUR CLIENT IS SEEKING A HUMAN RESOURCE MANAGER FOR ITS HUMAN RESOURCES DEPARTMENT. THE HUMAN RESOURCE MANAGER WILL BE RESPONSIBLE FOR A VARIETY OF HUMAN RESOURCE DUTIES WHICH MAY INCLUDE RECRUITING, ON-BOARDING, BENEFITS, ADMINISTERING COMPANY POLICIES, EMPLOYEE RELATIONS, AND OTHER HUMAN RESOURCE MATTERS.JOB DUTIES INCLUDE THE FOLLOWING (THIS IS NOT AN INCLUSIVE LIST OF ALL DUTIES):ASSIST IN DEVELOPING AND IMPLEMENTING RECRUITING STRATEGIES TO MEET REQUIRED STAFFING NEEDS.MANAGE FULL CYCLE RECRUITMENT PROCESS.OVERSEE AND MANAGE THE USAGE OF THE APPLICANT TRACKING SYSTEM WITHIN PAYCOM.CREATE, MANAGE, AND IMPLEMENT THE UPDATES TO THE COMPANY HUMAN RESOURCES POLICIES AND PROCEDURES (I.E., EMPLOYEE HANDBOOK, OPERATING PROCEDURES). RESEARCH AND MAKE RECOMMENDATIONS ON NEW POLICIES, CHANGES, UPDATES, ETC.MAINTAIN JOB DESCRIPTIONS AND POSITION MANAGEMENT IN PAYCOM. CREATE AND MAINTAIN ORGANIZATIONAL CHARTS.ASSIST IN ADMINISTRATION OF HEALTH AND WELFARE BENEFITS PLANS, INCLUDING OPEN ENROLLMENT, COMPLIANCE, ETC.MANAGE ALL REQUESTS FOR FMLA, STD, LTD AND NEW PARENT LEAVE.ASSIST WITH AND/OR MANAGE THE ONBOARDING AND OFFBOARDING OF EMPLOYEES.ASSIST WITH THE IMPLEMENTATION OF DEPARTMENT AND COMPANY STRATEGIC GOALS.ADVISE MANAGERS ON EMPLOYEE RELATIONS ISSUES WHEN APPLICABLE.RECONCILES MONTHLY BENEFIT INVOICES AND ALLOCATION SPREADSHEET FOR FINANCE.PERFORM OTHER DUTIES AS ASSIGNED.QUALIFICATIONSREQUIREMENTS:BACHELOR'S DEGREE IN HUMAN RESOURCES OR RELATED FIELD AND SHRM CERTIFICATION.MINIMUM OF 5 YEARS’ HUMAN RESOURCE GENERALIST EXPERIENCE. PRIOR NON-PROFIT ASSOCIATION EXPERIENCE IS STRONGLY PREFERRED.MINIMUM 2 YEARS OF FULL CYCLE RECRUITING EXPERIENCE.PROFICIENCY IN COMMON HRIS SYSTEMS AND APPLICANT TRACKING SYSTEMS. EXPERIENCE WITH PAYCOM PREFERRED BUT NOT REQUIRED.EXCELLENT CRITICAL THINKING/PROBLEM SOLVING SKILLS AND CUSTOMER SERVICE SKILLS.EXCELLENT WRITTEN AND VERBAL COMMUNICATION AND INTERPERSONAL SKILLS.ABILITY TO WORK WITH A WIDE RANGE OF PERSONALITIES, DEVELOP RELATIONSHIPS WITH ALL LEVELS OF STAFF, AND MANAGE CONFLICT IN A PROFESSIONAL, PRODUCTIVE MANNER.STRONG ATTENTION TO DETAIL, AND EXCELLENT PROBLEM SOLVING AND ORGANIZATIONAL SKILLS.SKILLED AT MANAGING TIME AND MULTIPLE PRIORITIES TO CONDUCT ASSIGNMENTS IN A TIMELY AND THOROUGH MANNER.KNOWLEDGE OF HUMAN RESOURCES PROCESSES AND BEST PRACTICES.COMMITMENT TO PROFESSIONAL AND ETHICAL STANDARDS.ABILITY TO USE INDEPENDENT JUDGEMENT AND MANAGE CONFIDENTIAL INFORMATION WITH DISCRETION AND DISCERNMENT.EXCELLENT COMPUTER SKILLS AND EXPERIENCE WITH MS OFFICE SUITE PROGRAMS (I.E., EXCEL, WORD, POWERPOINT).ABILITY TO WORK INDEPENDENTLY AND AS A COLLABORATOR.MUST SUCCESSFULLY PASS A CRIMINAL BACKGROUND CHECK.",
    "job_skill_set": [
      "recruiting",
      "HRIS systems",
      "human resources policies",
      "benefits administration",
      "FMLA management",
      "MS Office Suite",
      "critical thinking",
      "problem solving",
      "attention to detail",
      "time management",
      "confidential information management",
      "communication",
      "interpersonal skills",
      "relationship building",
      "conflict management",
      "independent judgment",
      "collaboration",
      "professionalism",
      "ethical standards",
      "applicant tracking systems",
      "Paycom",
      "organizational charts",
      "customer service"
    ],
    "short_keywords": [
      "administration",
      "applicant",
      "attention",
      "benefits",
      "building",
      "charts",
      "collaboration",
      "communication",
      "confidential",
      "conflict",
      "critical",
      "customer",
      "detail",
      "ethical",
      "fmla",
      "hr",
      "hris",
      "human",
      "independent",
      "information",
      "interpersonal",
      "judgment",
      "management",
      "manager",
      "ms",
      "office",
      "organizational",
      "paycom",
      "policies",
      "problem",
      "professionalism",
      "recruiting",
      "relationship",
      "resources",
      "service",
      "skills",
      "solving",
      "standards",
      "suite",
      "systems",
      "thinking",
      "time",
      "to",
      "tracking"
    ]
  },
  {
    "job_id": "3902876855",
    "job_title": "Human Resources Coordinator",
    "category": "HR",
    "job_description": "INNOCEAN USA, A FULL-SERVICE ADVERTISING AGENCY LOCATED IN HUNTINGTON BEACH, CA IS LOOKING FOR A HUMAN RESOURCES COORDINATOR TO JOIN OUR HR TEAM!\n OVERVIEWTHIS POSITION IS PRIMARILY RESPONSIBLE FOR OVERALL ADMINISTRATIVE SUPPORT TO THE HUMAN RESOURCES DEPARTMENT. THIS PERSON WILL HAVE AN INTEREST IN LEARNING THE DISCIPLINES IN HUMAN RESOURCES AND WILL ASSUME MORE RESPONSIBILITY AS THE COMPANY GROWS AND THE DEPARTMENT EXPANDS. THIS IS A POSITION THAT REQUIRES DISCRETION, PROFESSIONALISM, AND A HIGH DEGREE OF CONFIDENTIALITY. THIS PERSON WILL BE WORKING WITH ALL LEVELS OF EMPLOYEES IN THE AGENCY AND A PROFESSIONAL DEMEANOR WITH SOLID COMMUNICATION SKILLS IS ESSENTIAL. THIS POSITION WILL BE ON SITE FULL TIME.  \nDUTIES & RESPONSIBILITIESADMINISTRATIVE DUTIESPROVIDE ADMINISTRATIVE AND CLERICAL SUPPORT TO THE HR TEAM.RESPONSIBLE FOR ALL DATA ENTRY INTO HRIS, SMART SHEET AND ALL OTHER INTERNAL SYSTEMS.ASSIST IN ANSWERING INTERNAL AND EXTERNAL QUESTIONS RELATING TO HUMAN RESOURCES.RESPOND TO VERIFICATIONS OF EMPLOYMENT AND UNEMPLOYMENT CLAIMS IN A TIMELY MANNER.ASSIST SENIOR HR GENERALIST ON EDD REQUESTS.PROVIDE SUPPORT IN COORDINATING EMPLOYEE TERMINATION PROCEDURES.ENSURE EMPLOYEE FILES ARE ACCURATE AND UPDATED; ASSIST WITH HR REPORT AND AUDIT REQUESTS.CREATE AND FILE DOCUMENTS INTO APPROPRIATE EMPLOYEE FILES IN A TIMELY MANNER.SUPPORT ADMINISTRATION OF HR SPONSORED EMPLOYEE TRAINING PROGRAMS.ASSIST WITH MONTHLY REPORTING (HQ REPORTS, FINANCE REPORTS, ORG CHARTS).HELP OUT WITH REPORTING, MONITORING, AND MAINTAINING WORKER’S COMPENSATION FILE.CONTRIBUTE TO THE BENEFITS OPEN ENROLLMENT PROCESS AND HEALTH FAIR.PROVIDE CLERICAL SUPPORT THAT INCLUDES, BUT NOT LIMITED TO, MAKING COPIES, SCANNING AND MAILING DOCUMENTS.\nONBOARDING STAFF AND FREELANCERSMANAGE NEW HIRE PROCESSING, PREPARE NEW HIRE PACKETS, DISTRIBUTE NOTIFICATIONS, ARRANGE ORIENTATION AND PROCESS PAPERWORK. ENSURE ALL PAPERWORK IS COMPLETED ACCURATELY, SIGNED, AND FILED.COMMUNICATE WITH FREELANCER STAFF REGARDING ASSIGNMENT DETAILS PRIOR TO START DATE.ASSIST WITH NEW HIRE ORIENTATION FOR FREELANCE AND FULL-TIME STAFF.WORK WITH APPROPRIATE INTERNAL TEAMS (IT, HR, ADMIN) TO ENSURE PROPER SET UP OF NEW HIRE WORKSPACE, PARKING, BUILDING AND COMPUTER ACCESS, ETC.\nSUPPORT HR AND DEPARTMENT MANAGERS WITH FREELANCE STAFF MANAGEMENTSERVE AS POINT OF CONTACT FOR FREELANCERS REGARDING ANY QUESTIONS/CONCERNS.MAINTAIN FREELANCE FILES.WORK WITH MANAGERS TO TRACK CHANGES AND UPDATES TO FREELANCE CONTRACTS.\nRECRUITMENTPOST AGENCY POSITIONS, UPDATE OPENINGS ON WEBSITE AND INTRANET, REVIEW RESUMES, PRESCREEN CANDIDATES AND SET UP INTERVIEWS FOR INTERNAL TEAMS. GENERATE OFFER LETTERS FOR FINALIST CANDIDATES.MAY HANDLE RECRUITMENT OF ENTRY-LEVEL POSITIONS AS NEEDED.OTHER DUTIES AS ASSIGNED. \nSKILLS, QUALIFICATIONS AND EDUCATIONSTRONG DESIRE TO PURSUE CAREER IN A HUMAN RESOURCES DEPARTMENT.EXPERIENCE WORKING IN A FAST PACED, DEADLINE DRIVEN OFFICE.EXPERIENCE WORKING WITH CONFIDENTIAL INFORMATION REQUIRING DISCRETION AND TACT.GREAT TIME MANAGEMENT SKILLS, ABILITY TO PRIORITIZE ASSIGNMENTS AND MEET DEADLINES.STRONG COMPUTER SKILLS WITH MS OFFICE SUITE REQUIRED.FAMILIARITY WITH SMART SHEET A PLUS.COLLEGE DEGREE. HUMAN RESOURCES EMPHASIS PREFERRED. \nBENEFITS3 AFFORDABLE PPO MEDICAL PLANS THROUGH ANTHEMFREE DENTAL AND VISION401K – MATCH .70 CENTS ON THE DOLLAR OF UP TO 6% OF EMPLOYEE’S CONTRIBUTIONSWELLNESS REIMBURSEMENT PROGRAMCOMPANY PAID SHORT – AND LONG-TERM DISABILITY, AND BASIC LIFEGENEROUS PTOON-SITE BARISTABEAUTIFUL CAMPUS ACROSS FROM THE PACIFIC OCEAN \nREPORTS TO: HR DIRECTOR \nSALARY RANGE: $24 TO $25 AN HOURPAY IS DEPENDENT UPON SEVERAL FACTORS INCLUDING BUT NOT LIMITED TO: YEARS OF EXPERIENCE, TRAINING, AND TRANSFERABLE SKILLS.",
    "job_skill_set": [
      "data entry",
      "MS Office Suite",
      "reporting",
      "recruitment",
      "confidentiality",
      "communication",
      "time management",
      "professionalism",
      "discretion",
      "teamwork",
      "problem solving",
      "HRIS",
      "Smart Sheet",
      "employee onboarding"
    ],
    "short_keywords": [
      "communication",
      "confidentiality",
      "coordinator",
      "data",
      "discretion",
      "employee",
      "entry",
      "hr",
      "hris",
      "human",
      "management",
      "ms",
      "office",
      "onboarding",
      "problem",
      "professionalism",
      "recruitment",
      "reporting",
      "resources",
      "sheet",
      "smart",
      "solving",
      "suite",
      "teamwork",
      "time"
    ]
  },
  {
    "job_id": "3894278517",
    "job_title": "Human Resources Information System Partner III",
    "category": "HR",
    "job_description": "ARE YOU A SYSTEM SETUP EXPERT WITH A HUMAN RESOURCES BACKGROUND AND PROVEN RECORD OF WORKING EFFECTIVELY ACROSS MULTIPLE DEPARTMENTS? IF SO, MARVIN HAS THE PERFECT OPPORTUNITY FOR YOU. THE HUMAN RESOURCES INFORMATION SYSTEMS PARTNER III PLAYS A MEANINGFUL ROLE WITHIN THE HR DEPARTMENT AND IS EMPOWERED TO MAKE CREATIVE ENHANCEMENTS AND CONTINUOUS IMPROVEMENTS TO OUR CURRENT HRIS SYSTEMS. PARTICIPATE IN HR SYSTEM CONFIGURATION AND PARTNER WITH MULTIPLE DEPARTMENTS AS A SUBJECT MATTER AUTHORITY ON BOTH SOPHISTICATED HRIS SETUP AND HR PROCESSES.\n\nCAREER GROWTH, LEADERSHIP TRAINING, AND A CULTURE BUILT ON FAMILY VALUES ARE A FEW OF THE WAYS WE SUPPORT YOU PROFESSIONALLY AND PERSONALLY. WE INVEST IN YOU FROM DAY ONE WITH AN EXTENSIVE BENEFITS PACKAGE, AND A SIGN ON BONUS.\n\n HIGHLIGHTS OF YOUR ROLE \n\nBUILD STRONG PARTNERSHIPS/COLLABORATION WITH DEPARTMENTS TO TRANSLATE INFORMATION INTO BUSINESS PROCESS/SYSTEM FUNCTIONALITY THAT BOTH ALIGNS WITH THE NEEDS OF THE BUSINESS AND KEEPS THE END USER EXPERIENCE IN MIND. TRAIN, MENTOR, AND ACTS AS A TECHNICAL RESOURCE FOR COLLEAGUES, LEADING PRODUCTION SUPPORT FOR HR SYSTEMS. COLLECT/ASSESS CUSTOMER FEEDBACK, PROVIDES SUPPORT AND CONDUCTS ROOT CAUSE ANALYSIS OF SYSTEM ISSUES. CONFIGURE HR SYSTEMS FOR USE ENTERPRISE WIDE, IMPLEMENTING PROCESS IMPROVEMENTS AND POLICY CHANGES CRAFTED TO IMPROVE EFFICIENCY AND THE USER EXPERIENCE WITH THE SYSTEM. RECOMMEND AND IMPLEMENT PROCESS/CUSTOMER SERVICES IMPROVEMENTS, INNOVATIVE SOLUTIONS, POLICY CHANGES AND/OR MAJOR VARIATIONS FROM STANDARD PRACTICE ACQUIRING VITAL INPUT AND APPROVALS. \n\n YOU'RE A GOOD FIT IF YOU HAVE (OR IF YOU CAN) \n\nEXPERIENCE IN UKG PRO AND UKG WORKFORCE MANAGEMENT™ SOLUTION, BUSINESS INTELLIGENCE, AND COGNOS REPORTING. SOLID UNDERSTANDING OF THE CONTEXT OF HUMAN RESOURCES ROLE AND FUNCTION WITHIN THE ORGANIZATION; UNDERSTANDING OF HR PRINCIPLES, PROCESSES, PROGRAMS, PRACTICES AND DATA. DEMONSTRABLE ABILITY TO CONSULT AND TRANSFER KNOWLEDGE OF CRITICAL HRIS SKILLS. ABILITY TO TRANSLATE HIGHLY TECHNICAL CONCEPTS INTO TERMS UNDERSTANDABLE BY BUSINESS PARTNERS INSIDE AND OUTSIDE OF HR. \n\n ALSO WANT TO MAKE SURE YOU HAVE \n\nBACHELOR’S DEGREE IN HUMAN RESOURCES, IT OR COMPUTER SCIENCE. MINIMUM OF 4 YEARS' EXPERIENCE IN HR, INCLUDING HR TECHNOLOGY SYSTEMS AND APPLICATIONS. EFFECTIVE COMMUNICATION AND DIPLOMACY SKILLS TO GUIDE, INFLUENCE, AND CONVINCE OTHERS, PARTICULARLY MANAGEMENT/COLLEAGUES IN OTHER HR. \n\n WE INVITE YOU TO SEE YOURSELF AT MARVIN \n\nFROM PEOPLE TO PRODUCTS, MARVIN IS COMMITTED TO CREATING BETTER WAYS OF LIVING. WHEN YOU JOIN THIS FAMILY-OWNED AND -LED WINDOW AND DOOR COMPANY, YOU BELONG TO A COMMUNITY FULL OF OPPORTUNITIES.\n\nFOR MORE THAN 100 YEARS, WE'VE BEEN DESIGNING, BUILDING, AND ENGINEERING PREMIER PRODUCTS. TODAY, IN OUR 16 LOCATIONS ACROSS NORTH AMERICA, WE MANUFACTURE MARVIN'S PORTFOLIO OF PRODUCTS, WHICH INCLUDES INFINITY REPLACEMENT WINDOWS, TRUSTILE DOORS, AND MARVIN COASTLINE BRANDS.\n\nBENEFITS\n\nTOGETHER, WE LIVE OUR VALUES AND ENJOY A CULTURE THAT FEELS LIKE HOME. OUR BETTER LIVING APPROACH TO BENEFITS SUPPORTS YOU AT WORK AND BEYOND. FROM DAY ONE, YOU RECEIVE HEALTH INSURANCE, PAID HOLIDAYS, PAID PARENTAL LEAVE, A 401(K) RETIREMENT SAVINGS MATCH AND MORE! A FEW UNIQUE OFFERINGS INCLUDE:\n\n $300 ANNUAL WELLBEING ACCOUNT TO SPEND ON WHATEVER MAKES YOU HAPPY + HEALTHY  BETTER LIVING DAY! (A PAID DAY OFF TO GO HAVE SOME FUN)  $$ ANNUAL PROFIT SHARING - GET REWARDED FOR THE ROLE EVERYONE PLAYS IN MAKING MARVIN A SUCCESS  GIVING AT MARVIN - JOIN COORDINATED VOLUNTEER OPPORTUNITIES  BRIGHTER DAYS FUND - FINANCIAL SUPPORT THANKS TO YOUR COLLEAGUES AND THE MARVIN FAMILY SHOULD YOU SUFFER A PERSONAL HARDSHIP \n\nWHEN YOU BELONG TO THE MARVIN TEAM, IT'S ALL PART OF THE PACKAGE. APPLY TODAY!\n\n MARVIN IS AN EQUAL OPPORTUNITY EMPLOYER \n\nTHIS JOB POSTING IS NOT DESIGNED TO COVER OR CONTAIN A COMPREHENSIVE LISTING OF ACTIVITIES, DUTIES, OR RESPONSIBILITIES OF THE EMPLOYEE. ACCOMMODATION MAY BE MADE TO ENABLE AN INDIVIDUAL WITH A DISABILITY TO PERFORM THE ESSENTIAL FUNCTIONS OF THE POSITION. ANY EMPLOYMENT OFFER DEPENDS ON COMPLETING A BACKGROUND CHECK AND DRUG SCREEN TO COMPANY STANDARDS.",
    "job_skill_set": [
      "HRIS Configuration",
      "Data Analysis",
      "Process Improvement",
      "Communication",
      "Collaboration",
      "Problem Solving",
      "Mentoring",
      "Customer Service",
      "Diplomacy",
      "Consultation",
      "UKG Pro",
      "UKG Workforce Management",
      "Business Intelligence",
      "Cognos Reporting",
      "Technical Support"
    ],
    "short_keywords": [
      "analysis",
      "business",
      "cognos",
      "collaboration",
      "communication",
      "configuration",
      "consultation",
      "customer",
      "data",
      "diplomacy",
      "hr",
      "hris",
      "human",
      "iii",
      "improvement",
      "information",
      "intelligence",
      "management",
      "mentoring",
      "partner",
      "pro",
      "problem",
      "process",
      "reporting",
      "resources",
      "service",
      "solving",
      "support",
      "system",
      "technical",
      "ukg",
      "workforce"
    ]
  },
  {
    "job_id": "3884912913",
    "job_title": "Human Resources Business Partner",
    "category": "HR",
    "job_description": "REQUISITION ID: 5405\n\nLOCATION:\n\nGRAND CHAIN, IL, US, 62941\n\nPAY TYPE: SALARY\n\nTRAVEL REQUIREMENT: <10%\n\nARE YOU READY TO BUILD PROGRESS WITH US? \n\nDRIVEN BY OUR PURPOSE: BUILDING PROGRESS FOR PEOPLE AND THE PLANET. WE ARE TRANSFORMING TO BECOME THE GLOBAL LEADER IN INNOVATIVE AND SUSTAINABLE BUILDING SOLUTIONS. HOLCIM IS ENABLING GREENER CITIES, SMARTER INFRASTRUCTURE AND IMPROVING LIVING STANDARDS AROUND THE WORLD. WITH SUSTAINABILITY AT THE CORE OF ITS STRATEGY HOLCIM IS BECOMING A NET ZERO COMPANY, WITH ITS PEOPLE AND COMMUNITIES AT THE HEART OF ITS SUCCESS. THE COMPANY IS DRIVING CIRCULAR CONSTRUCTION AS A WORLD LEADER IN RECYCLING TO BUILD MORE WITH LESS. HOLCIM IS 70,000 PEOPLE AROUND THE WORLD WHO ARE PASSIONATE ABOUT BUILDING PROGRESS FOR PEOPLE AND THE PLANET THROUGH FOUR BUSINESS SEGMENTS: CEMENT, READY-MIX CONCRETE, AGGREGATES AND SOLUTIONS & PRODUCTS.\n\nDESCRIPTION:\n\nABOUT THE ROLE\n\nTHE HR BUSINESS PARTNER WORKS CLOSELY WITH HR DIRECTOR/MANAGER, AS WELL AS LINE MANAGERS AS A BUSINESS PARTNER. HE/SHE SUPPORTS A WIDE RANGE OF KEY HR INITIATIVES IN SUPPORT OF THE BUSINESS AND ACTS AS THE POINT-PERSON FOR FRONTLINE LEADERS IN THE FIELD FOR ANY DAY-TO-DAY HR RELATED ISSUES.\n\nWHAT YOU'LL BE DOING\n\nPROMOTES A CULTURE OF SAFETY AND EXHIBITS SUCH BEHAVIORS.PROVIDES GENERAL COACHING TO FRONTLINE SUPERVISORS ON EMPLOYEE RELATIONS MATTERSCONDUCTS INVESTIGATIONS FOR SELECT EMPLOYEE RELATIONS CLAIMS. ACTIVELY ENGAGES IN COMMUNICATIONS WITH OTHER HR TEAM MEMBERS AROUND BEST PRACTICES AND IDENTIFIES OPPORTUNITIES TO CREATE CONSISTENCY WHERE NECESSARY SUPPORTS THE HR MANAGER WITH EMPLOYEE RELATIONS ISSUES. ENSURES FIELD OPERATIONS ARE IN COMPLIANCE WITH VARIOUS GOVERNMENTAL LAWS AND REGULATIONS AROUND EEOC, WAGE HOUR, WORKER’S COMP., DISABILITY, FMLA ETC. SUPPORTS IMPLEMENTATION OF CORPORATE HUMAN RESOURCES PROGRAMS AND POLICIES FOR THE BUSINESS. SUPPORTS HR MANAGER WITH APPROPRIATE COMPANY RESOURCES TO RESOLVE ANY LITIGATION OR LEGAL ISSUES. SUPPORTS TALENT ACQUISITION ACTIVITIES FOR EXEMPT POSITIONS, INCLUDING PREPARING OFFER LETTERS. ACTIVELY SUPPORTS HR DIRECTOR/MANAGER WITH ON-BOARDING AND ORIENTATION ACTIVITIES FOR EXEMPT AND NON-EXEMPT EMPLOYEES. SUPPORTS THE HR COMMUNITY WITH HR-RELATED PROJECTS FOR THE IMMEDIATE, AS WELL AS COUNTRY-WIDE OPERATIONS. CONDUCTS HR-RELATED RESEARCH AND PERFORMS ANALYTICAL WORK IN SUPPORT OF BUSINESS ISSUES. SUPPORTS COMPLETING INVESTIGATIONS INTO EMPLOYEE/SUPERVISOR DISPUTES OR ISSUES RELATED TO COMPANY POLICY, PAY AND TRAINING.\n\n\nWHAT WE ARE LOOKING FOR\n\nEDUCATION: BACHELOR'S DEGREE OR 7 YEARS OF EQUIVALENT EXPERIENCE\n\nFIELD OF STUDY PREFERRED: HUMAN RESOURCES OR RELATED FIELD\n\nREQUIRED WORK EXPERIENCE: 3-5 YEARS WORKING AS A HR GENERALIST, SPECIALIST, OR BUSINESS PARTNER\n\nREQUIRED COMPUTER AND SOFTWARE SKILLS: STRONG COMPUTER SKILLS WITH PROFICIENCY IN USE OF MICROSOFT OFFICE EXCEL, POWERPOINT, WORD AND OTHER APPLICATIONS. HRIS EXPERIENCE STRONGLY PREFERRED. WORKDAY A PLUS.\n\nTRAVEL REQUIREMENTS: ABILITY TO TRAVEL OUT OF STATE UP TO 10%\n\nADDITIONAL REQUIREMENTS:\n\nDEMONSTRATED ADMINISTRATIVE AND ORGANIZATIONAL SKILLS WITH HIGH DEGREE OF THOROUGHNESS AND ACCURACY.ABILITY TO MULTI-TASKSTRONG PROJECT MANAGEMENT SKILLSSTRONG VERBAL AND WRITTEN COMMUNICATION SKILLS.SUCCESSFUL HR TRACK RECORD WITH PROGRESSIVE RESPONSIBILITIES DEMONSTRATE A COMMITMENT TO COMMUNICATING, IMPROVING AND ADHERING TO HEALTH, SAFETY AND ENVIRONMENTAL POLICIES IN ALL WORK ENVIRONMENTS AND AREAS. PROMOTE A CULTURE OF SAFETY AND EXHIBIT THESE BEHAVIORS. SUCCESSFUL CANDIDATES MUST ADHERE TO ALL SAFETY PROTOCOLS AND PROPER USE OF HOLCIM APPROVED PERSONAL PROTECTION EQUIPMENT (\"PPE\"), INCLUDING BUT NOT LIMITED TO RESPIRATORS. SUBJECT TO APPLICABLE LAW, EMPLOYEES THAT ARE REQUIRED TO WEAR RESPIRATORS MUST BE CLEAN SHAVEN WHERE THE RESPIRATOR SEAL MEETS THE FACE IN ORDER TO PASS THE QUALITATIVE AND QUANTITATIVE FIT TESTS.\n\n\nWHAT WE OFFER:\n\nCOMPETITIVE SALARY BASED ON EXPERIENCE AND QUALIFICATIONSRETIREMENT SAVINGS: CHOOSE FROM 401(K) PRE-TAX AND/OR ROTH AFTER-TAX SAVINGSMEDICAL, DENTAL, DISABILITY AND LIFE INSURANCE COVERAGEHOLISTIC HEALTH & WELL-BEING PROGRAMSHEALTH SAVINGS ACCOUNTS (HSAS) & FLEXIBLE SPENDING ACCOUNTS (FSAS) FOR HEALTH AND DEPENDENT CAREVISION AND OTHER VOLUNTARY BENEFITS AND DISCOUNTSPAID TIME OFF & PAID HOLIDAYSPAID PARENTAL LEAVE (MATERNITY & PATERNITY)EDUCATIONAL ASSISTANCE PROGRAMDRESS FOR YOUR DAY POLICY\n\n\n#SALARYUS\n\nYOUR HOLCIM EXPERIENCE\n\nAT HOLCIM, THERE IS ENDLESS OPPORTUNITY FOR YOU TO PLAY YOUR PART. WHETHER YOU’RE IN A TECHNICAL, MANAGERIAL, OR FRONTLINE ROLE, YOU CAN SHAPE A CAREER THAT WORKS FOR YOU. WITH US YOU’LL HAVE THE CHANCE TO EMBRACE THE PASSION WE SHARE FOR OUR PLANET. YOU’LL BE ENCOURAGED TO SEEK OUT DIVERSE PERSPECTIVES, SHARE YOUR IDEAS AND BUILD THE SKILLS AND CONNECTIONS YOU NEED TO PERFORM AT YOUR BEST. BECAUSE IT’S ONLY WHEN WE WORK TOGETHER IN A CULTURE WHERE EVERYONE THRIVES, THAT WE CAN BUILD THE WORLD WE ALL WANT TO LIVE IN.\n\nCLICK TO VIEW COMPANY BENEFITS OVERVIEW\n\nIN COMPLIANCE WITH THE ADA AMENDMENTS ACT (ADAAA), IF YOU HAVE A DISABILITY AND WOULD LIKE TO REQUEST ACCOMMODATION IN ORDER TO APPLY FOR A POSITION WITH US, PLEASE CALL (773) 355-4557 OR EMAIL RECRUITING-ACCOMMODATIONS@HOLCIM.COM. THIS EMAIL ADDRESS AND PHONE NUMBER SHOULD ONLY BE USED FOR ACCOMMODATIONS AND NOT GENERAL INQUIRIES OR RESUME SUBMITTALS.\n\nPLEASE VISIT OUR PAY TRANSPARENCY POLICY STATEMENT\n\nDRIVEN BY OUR PURPOSE TO BUILD SUSTAINABLE SOLUTIONS FOR PEOPLE AND OUR PLANET, HOLCIM US ENCOURAGES INTERESTED CANDIDATES WHO MEET MANY, EVEN IF NOT ALL OF THE JOB REQUIREMENTS TO APPLY FOR A POSITION. WE PROVIDE A SAFE WORKING ENVIRONMENT FOR ALL AND STRIVE FOR DIVERSITY IN OUR TEAMS AND INCLUSIVITY IN OUR WORK.\n\nWE TAKE PRIDE IN OUR HIRING PROCESSES AND OUR COMMITMENT TO ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO AGE, RACE, COLOR, ETHNICITY, RELIGION, CREED, NATIONAL ORIGIN, ANCESTRY, GENDER, GENDER IDENTITY, GENDER EXPRESSION, SEX, SEXUAL ORIENTATION, MARITAL STATUS, PREGNANCY, PARENTAL STATUS, GENETIC INFORMATION, CITIZENSHIP, PHYSICAL OR MENTAL DISABILITY, PAST, CURRENT, OR PROSPECTIVE SERVICE IN THE UNIFORMED SERVICES, OR ANY OTHER CHARACTERISTIC PROTECTED BY APPLICABLE FEDERAL, STATE OR LOCAL LAW. OUR GOAL IS TO DRIVE DIVERSITY IN OUR TEAMS AND INCLUSIVITY IN OUR WORK. HOLCIM (US) INC., HOLCIM - ACM MANAGEMENT, INC., AND THEIR AFFILIATES AND SUBSIDIARIES ARE AN EQUAL OPPORTUNITY EMPLOYER, DECIDING ALL EMPLOYMENT ON THE BASIS OF QUALIFICATION, MERIT AND BUSINESS NEED.\n\nWHILE WE SINCERELY APPRECIATE ALL APPLICATIONS, ONLY CANDIDATES SELECTED FOR AN INTERVIEW WILL BE CONTACTED.\n\nNEAREST MAJOR MARKET: CARBONDALE",
    "job_skill_set": [
      "Human Resources",
      "Employee Relations",
      "HRIS",
      "Microsoft Office (Excel, PowerPoint, Word)",
      "Analytical Skills",
      "Talent Acquisition",
      "Compliance with Labor Laws",
      "Communication",
      "Coaching",
      "Organizational Skills",
      "Multi-tasking",
      "Problem Solving",
      "Teamwork",
      "Adaptability",
      "Project Management",
      "Investigative Skills",
      "Commitment to Safety"
    ],
    "short_keywords": [
      "acquisition",
      "adaptability",
      "analytical",
      "business",
      "coaching",
      "commitment",
      "communication",
      "compliance",
      "employee",
      "excel",
      "hr",
      "hris",
      "human",
      "investigative",
      "labor",
      "laws",
      "management",
      "microsoft",
      "multitasking",
      "office",
      "organizational",
      "partner",
      "powerpoint",
      "problem",
      "project",
      "relations",
      "resources",
      "safety",
      "skills",
      "solving",
      "talent",
      "teamwork",
      "to",
      "with",
      "word"
    ]
  },
  {
    "job_id": "3902810661",
    "job_title": "Human Resources Generalist",
    "category": "HR",
    "job_description": "THE IDEAL CANDIDATE WILL BE RESPONSIBLE FOR RECRUITMENT EFFORTS, NEW HIRE ORIENTATION AND ONBOARDING, EMPLOYEE TERMINATION, PAYROLL AND BENEFITS, COMPANY POLICY AND PROCEDURE ADHERENCE. IN ADDITION, YOU WILL BUILD STRONG RELATIONSHIPS WITH OUR COMPANY'S MANAGERS IN ORDER TO HELP THEM WITH THEIR HUMAN RESOURCE NEEDS.  RESPONSIBILITIESOVERSEE FULL-CYCLE OF RECRUITMENT EFFORTSDEVELOP AND OVERSEE NEW HIRE ORIENTATION, ONBOARDING EFFORTS AND EMPLOYEE TERMINATION PROCESSASSIST WITH PAYROLL AND BENEFITS ADMINISTRATIONENSURES COMPLIANCE WITH COMPANY POLICIES AND PROCEDURES AND LEGAL RESPONSIBILITIES\nQUALIFICATIONS\nBACHELOR'S DEGREE OR EQUIVALENT EXPERIENCE IN BUSINESS, HUMAN RESOURCES, OR RELATED AREA3+ YEARS' OF EXPERIENCE WORKING IN HUMAN RESOURCESSTRONG INTERPERSONAL AND COMMUNICATION SKILLS\nADDISON GROUP IS AN EQUAL OPPORTUNITY EMPLOYER. ADDISON GROUP PROVIDES EQUAL EMPLOYMENT OPPORTUNITIES (EEO) TO ALL EMPLOYEES AND APPLICANTS FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, GENDER, SEXUAL ORIENTATION, NATIONAL ORIGIN, AGE, DISABILITY, GENETIC INFORMATION, MARITAL STATUS, AMNESTY, OR STATUS AS A COVERED VETERAN IN ACCORDANCE WITH APPLICABLE FEDERAL, STATE AND LOCAL LAWS. ADDISON GROUP COMPLIES WITH APPLICABLE STATE AND LOCAL LAWS GOVERNING NON-DISCRIMINATION IN EMPLOYMENT IN EVERY LOCATION IN WHICH THE COMPANY HAS FACILITIES. REASONABLE ACCOMMODATION IS AVAILABLE FOR QUALIFIED INDIVIDUALS WITH DISABILITIES, UPON REQUEST.",
    "job_skill_set": [
      "recruitment",
      "onboarding",
      "payroll administration",
      "benefits administration",
      "compliance",
      "human resources management",
      "policy adherence",
      "interpersonal skills",
      "communication",
      "relationship building"
    ],
    "short_keywords": [
      "adherence",
      "administration",
      "benefits",
      "building",
      "communication",
      "compliance",
      "generalist",
      "hr",
      "human",
      "interpersonal",
      "management",
      "onboarding",
      "payroll",
      "policy",
      "recruitment",
      "relationship",
      "resources",
      "skills"
    ]
  },
  {
    "job_id": "3898137449",
    "job_title": "Human Resources Summer 2024 Internship",
    "category": "HR",
    "job_description": "NORTHMARQ – MINNEAPOLIS, MN (BLOOMINGTON, MN)\n\nAT NORTHMARQ, YOU CAN BE PART OF SOMETHING SPECIAL. NORTHMARQ IS A UNIQUE CAPITAL MARKETS RESOURCE FOR COMMERCIAL REAL ESTATE INVESTORS, PROVIDING OUR CLIENTS ACCESS TO EXPERTS IN DEBT, EQUITY, INVESTMENT SALES, LOAN SERVICING, AND FUND MANAGEMENT. WE OFFER YOU A CAREER PATH WITH BEST-IN-CLASS TRAINING, AND WE FOSTER INCLUSIVE TEAMS COMMITTED TO COLLABORATION, MENTORING, AND GROWTH. AT NORTHMARQ, WE WILL HELP YOU UNLOCK YOUR POTENTIAL – WHETHER YOU ARE AN INDUSTRY VETERAN OR YOU’RE JUST GETTING STARTED. YOUR NEW CAREER IS WAITING. START SOMETHING SPECIAL TODAY. NORTHMARQ WAS VOTED BY REAL ESTATE FORUM AS ONE OF THE BEST PLACES TO WORK IN COMMERCIAL REAL ESTATE! \n\nNORTHMARQ IS OFFERING A HUMAN RESOURCES INTERNSHIP AT THEIR MINNEAPOLIS, MN (BLOOMINGTON, MN) HEADQUARTERS OFFICE. THIS POSITION WILL BE RESPONSIBLE FOR OVERALL HUMAN RESOURCES ASSISTANCE. THE INTERN WILL WORK IN ALL AREAS OF HUMAN RESOURCES (INCLUDING BUT NOT LIMITED TO; COMPENSATION AND BENEFITS, RECRUITING, WELLNESS, AND EVENT PLANNING) TO AID THE TEAM IN THE SUCCESSFUL COMPLETION OF PROJECTS. THE INTERN WILL DEVELOP PROFESSIONALLY AND GAIN PRACTICAL HR EXPERIENCE WHILE COMPLETING CHALLENGING, SIGNIFICANT WORK. THE POSITION REQUIRES STRONG COMMUNICATION SKILLS AND EXPERIENCE WITH MICROSOFT SUITE SKILLS.\n\nPOSITION RESPONSIBILITIES\n\n ASSISTS WITH HR-RELATED PROJECTS AND DUTIES AS REQUIRED AND ASSIGNED, UP TO AND INCLUDING ORGANIZING COMPANY EVENTS, POLICY UPDATES, QUARTERLY NEWSLETTERS, COMMUNITY SERVICE INITIATIVES, SPECIAL ENROLLMENTS, TOTAL COMPENSATION STATEMENTS, SYSTEM MAINTENANCE, AND WELLNESS INITIATIVES.  UPDATES AND AUDITS VARIOUS HR DATABASES INCLUDING COMPANY WEBSITES INTERNAL AND EXTERNAL.  PERFORMS HR CUSTOMER SERVICE FUNCTIONS BY ANSWERING EMPLOYEE’S REQUESTS AND QUESTIONS.  PROCESSES, ORGANIZES, AND STREAMLINES FILES AND DOCUMENTS  PARTICIPATES IN SPECIAL PROJECTS FOR OTHER DEPARTMENTS AS NEEDED IN LINE WITH DEPARTMENT GOALS AND OBJECTIVES.  MAINTAINS COMPLIANCE WITH FEDERAL AND STATE REGULATIONS CONCERNING EMPLOYMENT, INCLUDING, BUT NOT LIMITED TO ADA, FLSA, AND FMLA.  ADDITIONAL RESPONSIBILITIES MAY BE ADDED TO ALIGN WITH DEPARTMENT GOALS AND OBJECTIVES. \n\nWHAT WE'RE LOOKING FOR\n\n STUDENT CURRENTLY PURSUING A BACHELOR’S DEGREE. HUMAN RESOURCES DEGREE PREFERRED BUT NOT REQUIRED  OFFICE EXPERIENCE PREFERRED  STRONG COMPUTER KNOWLEDGE AND SKILLS, INCLUDING IN-DEPTH EXPERT KNOWLEDGE OF MICROSOFT OFFICE (EXCEL, WORD, POWERPOINT, ETC.)  PROBLEM-SOLVING—THE INDIVIDUAL IDENTIFIES AND RESOLVES PROBLEMS PROMPTLY AND GATHERS AND ANALYZES INFORMATION SKILLFULLY  INTERPERSONAL SKILLS—THE INDIVIDUAL MAINTAINS CONFIDENTIALITY, REMAINS OPEN TO OTHERS’ IDEAS, AND EXHIBITS A WILLINGNESS TO TRY NEW THINGS.  ORAL COMMUNICATION—THE INDIVIDUAL SPEAKS CLEARLY AND PERSUASIVELY IN POSITIVE OR NEGATIVE SITUATIONS, DEMONSTRATES GROUP PRESENTATION SKILLS, AND CONDUCTS MEETINGS.  WRITTEN COMMUNICATION—THE INDIVIDUAL EDITS WORK FOR SPELLING AND GRAMMAR, PRESENTS NUMERICAL DATA EFFECTIVELY AND CAN READ AND INTERPRET WRITTEN INFORMATION.  PLANNING/ORGANIZING—THE INDIVIDUAL PRIORITIZES AND PLANS WORK ACTIVITIES, USES TIME EFFICIENTLY, AND DEVELOPS REALISTIC ACTION PLANS.  QUALITY CONTROL—THE INDIVIDUAL DEMONSTRATES ACCURACY AND THOROUGHNESS AND MONITORS THEIR WORK TO ENSURE QUALITY.",
    "job_skill_set": [
      "Microsoft Office",
      "HR databases",
      "Compliance knowledge",
      "Data analysis",
      "Event planning",
      "Communication",
      "Problem-solving",
      "Interpersonal skills",
      "Planning/Organizing",
      "Quality control"
    ],
    "short_keywords": [
      "2024",
      "analysis",
      "communication",
      "compliance",
      "control",
      "data",
      "databases",
      "event",
      "hr",
      "human",
      "internship",
      "interpersonal",
      "knowledge",
      "microsoft",
      "office",
      "planning",
      "planningorganizing",
      "problemsolving",
      "quality",
      "resources",
      "skills",
      "summer"
    ]
  },
  {
    "job_id": "3904923783",
    "job_title": "Human Resources Operations Coordinator",
    "category": "HR",
    "job_description": "ABOUT 49AT 49 FINANCIAL, OUR MISSION IS “CREATING COMMUNITY, SIMPLIFYING LIVES.” EACH PERSON AT 49 FINANCIAL BELIEVES IN THE IDEA THAT “TWO ARE BETTER THAN ONE” AND HAS SEEN HOW WORKING TOGETHER PRODUCES A BETTER OUTCOME. OUR DEDICATED TEAM OF ADVISORS STRIVE TO WORK COLLABORATIVELY, SIMPLIFYING THE COMPLEX TO HELP CLIENTS ACHIEVE THEIR FINANCIAL GOALS AND ENJOY THE THINGS THEY LOVE WITH THEIR LOVED ONES.\nABOUT THE ROLETHE HR OPERATIONS COORDINATOR WORKS UNDER THE GUIDANCE OF THE HR OPERATIONS MANAGER IN THE PEOPLE DIVISION, WORKING WITH THEIR PRIMARY FOCUS ON SUPPORTING EMPLOYEES AND HR OPERATIONS MANAGER IN THE EXECUTION OF PROGRAMS, PROJECTS AND PROCESSES RELATED TO THE EMPLOYEE LIFE-CYCLE. IN THIS ROLE, YOU’LL HAVE THE OPPORTUNITY TO LEARN ABOUT ALL AREAS OF HR, BECOMING A SUBJECT MATTER EXPERT IN ONBOARDING, OFFBOARDING, EMPLOYEE ROLE CHANGES, BENEFITS AND SHOWCASE YOUR EXCELLENT COMMUNICATION SKILLS AS YOU WORK CROSS-FUNCTIONALLY WITH OTHER DEPARTMENTS TO ENSURE THE BEST SUPPORT FOR OUR EMPLOYEES. THIS ROLE WILL BE EMPLOYEE’S FIRST POINT OF CONTACT TO THE HR DEPARTMENT, MAKING IT A CRITICAL ROLE WITHIN THE PEOPLE DIVISION.\nWHAT YOU’LL DOHANDLE ADMINISTRATIVE TASKS RELATED TO EMPLOYEE LIFE CYCLE INCLUDING ONBOARDING AND OFFBOARDING, TRANSFERS, AND COMPENSATION CHANGESMAINTAIN AND UPDATE EMPLOYEE RECORDS WITHIN HRIS SYSTEM (PAYCOM)SUPPORT BENEFITS ADMINISTRATION, ENROLLMENT CHANGES, OPEN ENROLLMENT, AND ACA REPORTINGASSIST IN PROCESS IMPROVEMENTS OF DAILY HR TASKS AND ESTABLISHING THOROUGH SOPSENSURE LOCAL, STATE, AND FEDERAL COMPLIANCE ON I-9S, LABOR LAW POSTERS, TRAININGS AND HIRING PRACTICES BACKGROUND CHECK MANAGEMENTHANDLE ALL VERIFICATION OF EMPLOYMENT REQUESTSASSISTING IN RECRUITING AND SCHEDULING FOR HQ POSITIONS ANSWER EMPLOYEE QUESTIONS ON VARIOUS HR PROGRAMS AND PAYROLLRUN REGULAR HRIS SYSTEM CHECKS TO ENSURE WE HAVE THE MOST ACCURATE INFORMATION IN OUR SYSTEMSMANAGE 401K CONTRIBUTION CHANGES, AUTO ENROLLMENT OF NEW HIRES AND MISCELLANEOUS REQUESTS FROM THE VENDORGENERATE BASIC REPORTS FOR LEADERSHIP AND OTHER HQ TEAM MEMBERSSUPPORT DISTRIBUTION OF END OF YEAR TAX FORMS AND ANSWER EMPLOYEE QUESTIONS ON TAX FORMSKEEP THE COMPANY UP TO DATE ON TASKS NEEDED OF EMPLOYEES AND ANYTHING UPCOMING THAT FALLS UNDER HRASSIST THE HR MANAGER IN OTHER HR INITIATIVES AND PROGRAMS SUCH AS LEADERSHIP AND MANAGER DEVELOPMENT, COMPENSATION BENCHMARKING, PERFORMANCE AND TALENT MANAGEMENT, EMPLOYEE SATISFACTION, EMPLOYEE CONCERNS AND PROGRAM/SYSTEM ENHANCEMENTS.\nWHAT YOU NEEDEXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS WITH A PROBLEM-SOLVING ATTITUDE ATTENTION TO DETAIL TO ENSURE ALL SPECIFICATIONS ARE MET PROBLEM-SOLVING ABILITIES TO IDENTIFY ANY CHALLENGES OR INEFFICIENCIES FOR THE BEST RESULTS. KNOWS WHEN TO ESCALATE AN ISSUE AND PROVIDE POSSIBLE SOLUTIONS ORGANIZATION AND TIME MANAGEMENT TO MANAGE MULTIPLE TASKS, SOMETIMES FOR MULTIPLE PROJECTS, AT ONCE GOOD KNOWLEDGE OF MICROSOFT OFFICE APPLICATIONS EXEMPLIFIES THE VALUES OF 49 FINANCIAL\n",
    "job_skill_set": [
      "Microsoft Office",
      "Benefits Administration",
      "Compliance Management",
      "Recruiting",
      "Onboarding",
      "Process Improvement",
      "Communication",
      "Problem Solving",
      "Attention to Detail",
      "Organization",
      "Time Management",
      "HRIS (Paycom)",
      "Data Reporting",
      "Offboarding"
    ],
    "short_keywords": [
      "administration",
      "attention",
      "benefits",
      "communication",
      "compliance",
      "coordinator",
      "data",
      "detail",
      "hr",
      "hris",
      "human",
      "improvement",
      "management",
      "microsoft",
      "offboarding",
      "office",
      "onboarding",
      "operations",
      "organization",
      "paycom",
      "problem",
      "process",
      "recruiting",
      "reporting",
      "resources",
      "solving",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3887835929",
    "job_title": "Human Resources Associate",
    "category": "HR",
    "job_description": "JOB DETAILS\n\nJOB LOCATION\n\nMILAN, IL\n\nPOSITION TYPE\n\nFULL TIME\n\nSALARY RANGE\n\n$19.00 - $21.00 HOURLY\n\nJOB SHIFT\n\n1ST SHIFT\n\nJOB CATEGORY\n\nHUMAN RESOURCES\n\nDESCRIPTION\n\nARE YOU A PROACTIVE INDIVIDUAL WITH A PASSION FOR PEOPLE AND PROCESSES? DO YOU EXCEL IN A TEAM ENVIRONMENT WHERE YOUR VOICE IS HEARD AND YOUR IDEAS ARE PUT INTO ACTION? IF SO, APPLY WITH US TODAY TO JOIN OUR TEAM AS A HUMAN RESOURCES ASSOCIATE! AS THE HR ASSOCIATE YOU ARE THE FOUNDATION OF THE HR DEPARTMENT. NOT ONLY DO YOU INTERACT WITH THE ENTIRE COMPANY, YOU BELONG TO A CLOSE KNIT TEAM WHO SUPPORTS ONE ANOTHER IN EVERYTHING WE DO.\n\nWHAT YOU'LL DO\n\n EMPLOYEE MAINTENANCE WITHIN HR MANAGEMENT SYSTEM  PROCESS BENEFIT ENROLLMENTS AND MAINTENANCE IN VENDOR SITES  RECONCILE INVOICES  CREATE EMPLOYEE FILES AND MAINTAIN ALL EMPLOYMENT RECORDS  INVENTORY CONTROL AND PROCUREMENT OF OFFICE SUPPLIES  ADMINISTER AND COORDINATE NEW HIRE ORIENTATION  DELIVER HANDBOOK SECTION OF ORIENTATION  COMPLETE EMPLOYMENT VERIFICATIONS  PREPARE COBRA PACKETS  MANAGE COMPANY WIDE CATERING  ASSIST THE SAFETY TEAM WITH WORK COMP  CLERICAL DUTIES INCLUDING FILING, AND CREATING AND DISTRIBUTING CORRESPONDENCE  CUSTOMER SERVICE VIA FACE-TO-FACE, PHONE, AND EMAIL INTERACTION  ASSIST WITH RESEARCH AND/OR SPECIAL PROJECTS  COORDINATE EMPLOYEE EVENTS  PROCESS MAIL  COORDINATE SERVICE CALLS FOR OFFICE EQUIPMENT \n\nQUALIFICATIONS\n\nEDUCATION: \n\n HIGH SCHOOL DIPLOMA OR EQUIVALENT \n\nEXPERIENCE\n\n DATA ENTRY IN SOFTWARE SYSTEM  2 YEARS OF CLERICAL/ADMINISTRATIVE EXPERIENCE  1 YEAR OF HUMAN RESOURCES EXPERIENCE PREFERRED \n\nSKILLS\n\n INTERMEDIATE COMPUTER SKILLS: MICROSOFT WORD, EXCEL, POWERPOINT  EXCEPTIONAL VERBAL AND WRITTEN COMMUNICATION SKILLS  EXCELLENT ORGANIZATION AND TIME MANAGEMENT SKILLS  PROBLEM SOLVING  PRESENTATION SKILLS  BI-LINGUAL ENGLISH/SPANISH, VERBAL AND WRITTEN A PLUS \n\nDESIRED TRAITS\n\n INITIATIVE  PROFESSIONALISM  MAINTAIN CONFIDENTIALITY  DEPENDABLE  ADAPTABLE",
    "job_skill_set": [
      "data entry",
      "Microsoft Word",
      "Microsoft Excel",
      "HR management system",
      "benefit enrollment processing",
      "employee file management",
      "clerical duties",
      "customer service",
      "bilingual (English/Spanish)",
      "communication",
      "organization",
      "time management",
      "problem solving",
      "presentation skills",
      "initiative",
      "professionalism",
      "confidentiality",
      "dependability",
      "adaptability",
      "Microsoft PowerPoint",
      "invoice reconciliation",
      "office supply procurement",
      "Cobra packet preparation"
    ],
    "short_keywords": [
      "adaptability",
      "associate",
      "benefit",
      "bilingual",
      "clerical",
      "cobra",
      "communication",
      "confidentiality",
      "customer",
      "data",
      "dependability",
      "duties",
      "employee",
      "englishspanish",
      "enrollment",
      "entry",
      "excel",
      "file",
      "hr",
      "human",
      "initiative",
      "invoice",
      "management",
      "microsoft",
      "office",
      "organization",
      "packet",
      "powerpoint",
      "preparation",
      "presentation",
      "problem",
      "processing",
      "procurement",
      "professionalism",
      "reconciliation",
      "resources",
      "service",
      "skills",
      "solving",
      "supply",
      "system",
      "time",
      "word"
    ]
  },
  {
    "job_id": "3902740857",
    "job_title": "Human Resources Manager",
    "category": "HR",
    "job_description": "AT PROMACH, WE’RE LOOKING FOR PEOPLE WHO WANT TO SHINE. YOU’LL HAVE OPPORTUNITIES TO TAKE YOUR CAREER IN THE DIRECTION YOU WANT. YOU CAN BE CREATIVE. STRATEGIC. PERSUASIVE. INFLUENTIAL. CUSTOMER SERVICE AUTHORITY. METICULOUS. A CLOSER. A FUTURIST. CHALLENGED AND REWARDED.\n\nDO WE HAVE YOUR ATTENTION? KEEP READING.\n\nAS OUR HR MANAGER, YOU WILL PLAY A PIVOTAL ROLE IN FOSTERING A DYNAMIC AND INCLUSIVE WORKPLACE ALIGNED WITH THE EVOLVING MARKET LANDSCAPE. YOUR RESPONSIBILITIES ENCOMPASS STRATEGICALLY MANAGING TALENT TO ENSURE ORGANIZATIONAL AGILITY AND COMPETITIVENESS. COLLABORATING CLOSELY WITH HR AND OPERATIONAL LEADERS, YOU WILL CONTRIBUTE TO INFORMED DECISION-MAKING AND EFFECTIVE HR PRACTICES. THIS POSITION ENTAILS OVERSEEING THE FULL SCOPE OF EMPLOYEE LIFE-CYCLE GENERALIST DUTIES FOR YOUR ALIGNED PROMACH DIVISION(S), WHERE YOUR STRONG HR APTITUDE WILL DRIVE AND IMPLEMENT SUCCESSFUL PEOPLE INITIATIVES AT THE DIVISIONAL AND CORPORATE LEVELS.\n\nDO YOU ENJOY THIS WORK?\n\nDIVISION SUPPORT:\n\nACT AS A BUSINESS PARTNER TO DIVISION LEADERSHIP; CREATE OPERATIONAL HR STRATEGY THAT ALIGNS TO DIVISION’S BUSINESS STRATEGYPROVIDE CONSULTATION TO DIVISION LEADERS REGARDING BUILDING BENCH-STRENGTH THROUGH TALENT DEVELOPMENTDEVELOP AND SUPPORT RETENTION PLANS AND METHODS TO COUNTERACT CLEARLY IDENTIFIED RISKSMANAGE AND IMPLEMENT DIVISION-LEVEL CHANGE, SUCH AS POLICY STANDARDS, ACQUISITION INTEGRATION, PROCESS IMPROVEMENTS, AND APPLICATION OF TECHNOLOGY AND AUTOMATION\n\nEMPLOYEE RELATIONS:\n\nCONSULT WITH INTERNAL RESOURCES AND LEAD INQUIRIES ABOUT EMPLOYEE RELATIONS ISSUESHELP ORGANIZE COMPANY MEETINGS AND EVENTS AT THE FACILITIES, INCLUDING TEAM-BUILDING ACTIVITIES TO ENHANCE AND IMPROVE EMPLOYEE MORALE AND PRODUCTIVITYMANAGE DAY-TO-DAY BENEFITS QUESTIONS AND REQUESTS FROM EMPLOYEESSUPPORTS CORPORATE HR IN THEIR OVERSIGHT OF THE BENEFIT PLANS AND PROGRAMS; PARTNER WITH CORPORATE HR ON ADMINISTERING ANNUAL COMPENSATION, BONUS, AND COMMISSION PLANS\n\nTALENT ACQUISITION, MANAGEMENT, AND DEVELOPMENT:\n\nGUIDE HIRING MANAGERS IN DEVELOPING CANDIDATE PROFILES, SOURCING/SELECTION PROCESS, COMPENSATION, AND JOB OFFER STRATEGYACT AS DIVISION SUBJECT MATTER EXPERT SPECIFIC TO WHO METHODOLOGYACTIVELY MONITOR THE ORGANIZATIONAL CAPABILITIES FROM A BUSINESS AND EMPLOYEE DEVELOPMENT PERSPECTIVEAID IN DEVELOPMENT AND EXECUTION OF STRATEGIES THAT ADDRESS EACH DIVISION’S HIGH POTENTIAL TALENT AND POOR PERFORMERS; PROVIDE GUIDANCE TO LEADERS ON HOW TO IMPROVE THE PERFORMANCE OF UNDER-PERFORMERSDEVELOP AND APPLY CREATIVE STAFFING APPROACHES TO FIND NEW EMPLOYEES IN A QUICK AND COST-EFFECTIVE MANNERCOACH LEADERS ON HOW TO INFLUENCE AND ALIGN BEHAVIORS TO OPTIMIZE EMPLOYEE PERFORMANCE AND GOAL ACHIEVEMENTLEAD DIVISION-LEVEL SUCCESSION PLANNING ACTIVITIES, INCLUDING KEY POSITION IDENTIFICATION, AND NOMINATING SUCCESSOR CANDIDATESPARTNER WITH LEADERS AND CORPORATE TALENT DEVELOPMENT ON SUCCESSOR CANDIDATE DEVELOPMENT, INCLUDING JOB SKILL IDENTIFICATION, GAP ANALYSIS, AND DEVELOPMENT PLAN CREATION/OVERSIGHT\n\nPOLICY DEVELOPMENT AND COMPLIANCE:\n\nENSURE COMPLIANCE WITH FEDERAL, STATE, AND LOCAL LAWS, REGULATIONS, AND ORDERS THROUGH THE APPLICATION OF ADVANCED KNOWLEDGE AND TRAININGPARTNER WITH MANAGEMENT AND CORPORATE EHS TO ENSURE THAT SAFETY POLICIES AND TRAINING PROGRAMS ARE CURRENT, PRACTICED, AND ENFORCEDCREATE AN ENVIRONMENT WHERE SAFETY IS VALUED, AND SAFE BEHAVIORS ARE CONSISTENTLY APPLIEDENSURE COMPLIANCE WITH ALL OSHA AND OTHER FEDERAL, STATE AND LOCAL SAFETY RULES AND REGULATIONSHELP LEAD THE SAFETY AND TRAINING OBSERVATION PROGRAM FOR FACILITIESHELP CORPORATE SAFETY WITH IMPLEMENTATION OF COMPANY-WIDE SAFETY PROGRAMSPARTNER WITH LEADERS AND CORPORATE EHS TO IDENTIFY ROOT CAUSES OF WORK-RELATED INJURIES AND ILLNESSES AND IMPLEMENT METHODS TO ELIMINATE CAUSES\n\nWHAT’S IN IT FOR YOU?\n\nTHERE'S NO MONOPOLY ON INNOVATIVE IDEAS OR LIMITS TO HOW FAR YOU CAN ADVANCE WITH OUR TEAM. WE OFFER AN OPEN, COMMUNICATIVE ENVIRONMENT THAT FOSTERS INDIVIDUAL INITIATIVE. WE PRIDE OURSELVES IN BEING A COMPANY WHERE PEOPLE ARE HAPPY AND CHOOSE TO BUILD A CAREER.\n\nIN ADDITION TO GROWTH OPPORTUNITIES, AS A PROMACH EMPLOYEE, YOU RECEIVE MORE THAN JUST A PAYCHECK. TOTAL COMPENSATION INCLUDES YOUR SALARY, COMPREHENSIVE MEDICAL/DENTAL PROGRAMS, AS WELL AS LIFE INSURANCE, A GENEROUS PAID TIME OFF PROGRAM, AND A RETIREMENT SAVINGS PLAN WITH A COMPANY MATCH. AND BECAUSE WE UNDERSTAND THE IMPORTANCE OF FEELING PROTECTED, THERE IS NO WAITING PERIOD FOR BENEFITS – YOU ARE ELIGIBLE ON YOUR FIRST DAY OF EMPLOYMENT!\n\nIF THIS SOUNDS LIKE YOU, WE WANT TO CONNECT!\n\nBACHELOR’S DEGREE IN HUMAN RESOURCES, BUSINESS ADMINISTRATION, OR A RELATED FIELD5+ YEARS OF PROGRESSIVE HR EXPERIENCE, WITH A FOCUS ON SUPPORTING MULTIPLE BUSINESS UNITSSTRONG UNDERSTANDING OF EMPLOYMENT LAWS AND REGULATIONSADVANCED COMMUNICATION, INTERPERSONAL, AND CRITICAL THINKING SKILLS; COMFORTABLE FACILITATING GROUP MEETINGS WITH ALL LEVELS OF THE ORGANIZATIONEXPERIENCE IN DESIGN AND IMPLEMENTATION OF TRAINING PROGRAMSABILITY TO ACCURATELY DIAGNOSE ORGANIZATIONAL NEEDS AND USE POLITICAL AWARENESS TO GAIN SUPPORT THROUGH THE DEVELOPMENT OF A CLEAR STRATEGY AND GOALSTRACK RECORD OF CREATING AND EXECUTING EFFECTIVE SOURCING AND ONBOARDING STRATEGIESDEMONSTRATED ABILITY TO ORGANIZE AND PRIORITIZE PROJECTS IN A FAST-PACED AND DEADLINE-ORIENTED BUSINESS ENVIRONMENTABILITY TO TRAVEL 10% OF THE TIME FOR DIVISION MEETINGS AND DEPARTMENT CONFERENCES\n\nPRO MACH, INC. WAS NAMED TO THE INC. 5,000 LIST OF THE FASTEST GROWING PRIVATE COMPANIES IN THE U.S. SEVEN TIMES. WE CONTINUE TO INTRODUCE INNOVATIVE PRODUCTS, ENTER NEW MARKETS, EXPAND OUR GLOBAL PRESENCE, AND ACTIVELY ACQUIRE NEW CAPABILITIES.\n\nWE HAVE THE REWARDS, OPPORTUNITIES, AND THE MARKET STRENGTH OF A LARGE ORGANIZATION COMBINED WITH THE ENTREPRENEURIAL CULTURE OF A SMALL, FAST-PACED COMPANY. YOU WILL ENJOY THE BENEFITS OF WORKING WITH A GROWING COMPANY THAT COMPETES GLOBALLY WITH THE PERSONAL TOUCH AND FEEL OF A SMALLER COMPANY WHERE YOU CAN MAKE AN IMPACT EVERY DAY.\n\nCURIOUS ABOUT LIFE AT PROMACH? FOLLOW US ON LINKEDIN, TWITTER, AND INSTAGRAM!\n\nPROMACH IS AN EQUAL OPPORTUNITY EMPLOYER. PRO MACH USES E-VERIFY TO VERIFY EMPLOYMENT ELIGIBILITY OF ALL NEW HIRES TO WORK IN THE UNITED STATES. PRO MACH IS A DRUG-FREE WORKPLACE.\n\nWE WILL ENSURE THAT INDIVIDUALS WITH DISABILITIES ARE PROVIDED REASONABLE ACCOMMODATION TO PARTICIPATE IN THE JOB APPLICATION OR INTERVIEW PROCESS, TO PERFORM ESSENTIAL JOB FUNCTIONS, AND TO RECEIVE OTHER BENEFITS AND PRIVILEGES OF EMPLOYMENT. PLEASE CONTACT US TO REQUEST ACCOMMODATION.\n\n#INPRO",
    "job_skill_set": [
      "human resources management",
      "employment law compliance",
      "talent acquisition",
      "data analysis",
      "performance management",
      "benefits administration",
      "communication",
      "interpersonal skills",
      "critical thinking",
      "teamwork",
      "problem solving",
      "creativity",
      "adaptability",
      "organizational skills",
      "customer service orientation",
      "training program design",
      "project management",
      "strategic planning",
      "change management",
      "influence"
    ],
    "short_keywords": [
      "acquisition",
      "adaptability",
      "administration",
      "analysis",
      "benefits",
      "change",
      "communication",
      "compliance",
      "creativity",
      "critical",
      "customer",
      "data",
      "design",
      "employment",
      "hr",
      "human",
      "influence",
      "interpersonal",
      "law",
      "management",
      "manager",
      "organizational",
      "orientation",
      "performance",
      "planning",
      "problem",
      "program",
      "project",
      "resources",
      "service",
      "skills",
      "solving",
      "strategic",
      "talent",
      "teamwork",
      "thinking",
      "training"
    ]
  },
  {
    "job_id": "3715891138",
    "job_title": "Human Resources Manager",
    "category": "HR",
    "job_description": "HUMAN RESOURCES MANAGER  POSITION SUMMARYTHE IDEAL CANDIDATE WILL PERFORM ROUTINE TASKS REQUIRED TO ADMINISTER AND EXECUTE HUMAN RESOURCES PROGRAMS INCLUDING, BUT NOT LIMITED TO: RECRUITING, COMPENSATION, BENEFITS, AND LEAVE; DISCIPLINARY MATTERS; DISPUTES AND INVESTIGATIONS; PERFORMANCE AND TALENT MANAGEMENT; PRODUCTIVITY, RECOGNITION, AND MORALE; OCCUPATIONAL HEALTH AND SAFETY; AND TRAINING AND DEVELOPMENT.IN ADDITION, YOU WILL BUILD STRONG RELATIONSHIPS WITH OUR COMPANY'S MANAGERS IN ORDER TO HELP THEM WITH THEIR HUMAN RESOURCE AND RECRUITING NEEDS;\nHANDLE EMPLOYMENT-RELATED INQUIRIES FROM APPLICANTS, EMPLOYEES, AND SUPERVISORS, REFERRING COMPLEX AND/OR SENSITIVE MATTERS TO THE APPROPRIATE STAFF.MAINTAIN COMPLIANCE WITH FEDERAL, STATE, AND LOCAL EMPLOYMENT LAWS AND REGULATIONS, AND RECOMMENDED BEST PRACTICES; REVIEWS POLICIES AND PRACTICES AS IT PERTAINS TO COMPANY POLICIES AND PROCEDURES.CREATE EMPLOYEE ENGAGEMENT PROGRAMS, GETTING NECESSARY LEADERSHIP AND BUDGET APPROVAL PRIOR TO IMPLEMENTATION.MAINTAIN PHYSICAL AND DIGITAL PERSONNEL, MEDICAL AND RESTRICTED FILES.MAINTAIN KNOWLEDGE OF TRENDS, BEST PRACTICES, REGULATORY CHANGES, AND NEW TECHNOLOGIES IN HUMAN RESOURCES, TALENT MANAGEMENT, AND EMPLOYMENT LAW.ASSISTS WITH PAYROLL AND BENEFITS ADMINISTRATION.ENSURES COMPLIANCE WITH COMPANY POLICIES, PROCEDURES AND LEGAL RESPONSIBILITIES.\nEMPLOYMENT SERVICES· APPLICANT TRACKING · E VERIFY (VERIFYING LICENSURE AND ELIGIBILITY FOR EMPLOYMENT (I-9))· DISTRIBUTE HUMAN RESOURCE MATERIALS.· ASSISTS IN COORDINATION OF EMPLOYEE RECOGNITION PROGRAMS.· UPDATES MANAGERS REGARDING NEW OR REVISED HUMAN RESOURCE POLICIES.· COORDINATES WITH MANAGERS AND SUPERVISORS REGARDING DISCIPLINARY ACTIONS, AND PERFORMANCE EVALUATION RATINGS.\n TIMEKEEPING RESPONSIBILITIES WILL INCLUDE THE FOLLOWING:ASSISTS SUPERVISORS WITH DEPARTMENT TIMEKEEPING FUNCTION.REVIEWS AND EDITS TIMESHEETS, TIME EDIT FORMS AND SCHEDULES FOR COMPLETENESS AND ACCURACY.COMPILES EMPLOYEES' TIME FROM SCHEDULING, TIMEKEEPING AND PAYROLL COMPUTER SYSTEMS.RESOLVE TIMEKEEPING RELATED ACCRUAL DISCREPANCIES AND ISSUES.MAINTAINS FILES AND APPROPRIATE RECORDS AND ENSURES CONFIDENTIALITY OF SAME.STREAMLINES WORK PROCESSES AND IMPLEMENTS CHANGES TO EFFECT CONTINUAL IMPROVEMENT IN TIMEKEEPING PROCEDURES.\nRECRUITING RESPONSIBILITIESDEVELOP AND IMPLEMENT A COMPREHENSIVE TALENT ACQUISITION STRATEGY ALIGNED WITH THE COMPANY'S GOALS AND OBJECTIVES.DEVELOP RECRUITMENT PLANS TO ADDRESS CURRENT AND FUTURE TALENT REQUIREMENTS.OVERSEE FULL-CYCLE RECRUITMENT PROCESSES, INCLUDING SOURCING, SCREENING, INTERVIEWING, AND OFFER NEGOTIATION, TO ENSURE A SEAMLESS CANDIDATE EXPERIENCE.STAY INFORMED OF INDUSTRY TRENDS AND BEST PRACTICES IN TALENT ACQUISITION AND INCORPORATE INNOVATIVE APPROACHES INTO RECRUITMENT STRATEGIES.COLLABORATE WITH CROSS-FUNCTIONAL TEAMS TO STREAMLINE RECRUITMENT PROCESSES, IMPROVE EFFICIENCY, AND ENHANCE THE OVERALL CANDIDATE EXPERIENCE.SERVE AS A SUBJECT MATTER EXPERT ON RECRUITMENT-RELATED MATTERS AND PROVIDE GUIDANCE AND SUPPORT TO INTERNAL STAKEHOLDERS AS NEEDED.STAY INFORMED OF HR BEST PRACTICES, LEGAL REQUIREMENTS, AND INDUSTRY TRENDS TO ENSURE COMPLIANCE AND EFFECTIVENESS IN HR PROCESSES.\nMINIMUM EDUCATION:BACHELOR’S DEGREE IN HUMAN RESOURCES, BUSINESS ADMINISTRATION, OR RELATED FIELD REQUIRED.\nMINIMUM EXPERIENCE:AT LEAST THREE YEARS OF HR EXPERIENCE PREFERRED.ABILITY TO ACT WITH INTEGRITY, PROFESSIONALISM, AND CONFIDENTIALITY.EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS.EXCEPTIONAL INTERPERSONAL, NEGOTIATION, AND CONFLICT RESOLUTION SKILLS.OUTSTANDING TIME MANAGEMENT SKILLS WITH A PROVEN ABILITY TO MEET DEADLINES.\nLICENSURE REQUIREMENT:EMPLOYEE MUST HAVE A VALID TENNESSEE DRIVER’S LICENSE AND STATE MANDATED MINIMUM INSURANCE COVERAGE.  ",
    "job_skill_set": [
      "recruiting",
      "talent management",
      "compliance",
      "employee engagement programs",
      "conflict resolution",
      "human resources policies",
      "performance management",
      "employment law",
      "training and development",
      "benefits administration",
      "investigations",
      "communication",
      "interpersonal skills",
      "integrity",
      "professionalism",
      "time management",
      "problem solving",
      "team collaboration",
      "adaptability",
      "confidentiality",
      "leadership",
      "relationship building",
      "critical thinking",
      "empathy",
      "creativity",
      "payroll administration",
      "timekeeping",
      "data management",
      "applicant tracking systems",
      "negotiation",
      "occupational health and safety",
      "interviewing",
      "sourcing",
      "screening",
      "budget management"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "and",
      "applicant",
      "benefits",
      "budget",
      "building",
      "collaboration",
      "communication",
      "compliance",
      "confidentiality",
      "conflict",
      "creativity",
      "critical",
      "data",
      "development",
      "empathy",
      "employee",
      "employment",
      "engagement",
      "health",
      "hr",
      "human",
      "integrity",
      "interpersonal",
      "interviewing",
      "investigations",
      "law",
      "leadership",
      "management",
      "manager",
      "negotiation",
      "occupational",
      "payroll",
      "performance",
      "policies",
      "problem",
      "professionalism",
      "programs",
      "recruiting",
      "relationship",
      "resolution",
      "resources",
      "safety",
      "screening",
      "skills",
      "solving",
      "sourcing",
      "systems",
      "talent",
      "team",
      "thinking",
      "time",
      "timekeeping",
      "tracking",
      "training"
    ]
  },
  {
    "job_id": "3904406321",
    "job_title": "Human Resources Intern",
    "category": "HR",
    "job_description": "AS A HUMAN RESOURCES INTERN AT THE UF HEALTH CANCER CENTER (UFHCC), YOU WILL BE RESPONSIBLE FOR PROVIDING ADMINISTRATIVE SUPPORT TO THE OFFICE OF HUMAN RESOURCES. YOU WILL PARTICIPATE IN ONGOING HR PROJECTS AND ACTIVITIES, AND SUPPORT THE DAILY OPERATIONS OF THE UFHCC-HR DEPARTMENT. THE IDEAL CANDIDATE WILL HAVE AN INTEREST IN LEARNING ABOUT HR AND BE EAGER TO GAIN PRACTICAL EXPERIENCE IN VARIOUS HR FUNCTIONS.\nIN YOUR NEW ROLE YOU WILL BE RESPONSIBLE FOR THE FOLLOWING:DAY-TO-DAY ADMINISTRATION OF FUNCTIONAL HR PROCESSES, ENSURING SMOOTH, EFFICIENT HR OPERATIONS;ASSISTANCE WITH RECRUITMENT AND ONBOARDING ACTIVITIES;MAINTAINING UFHCC-HR ELECTRONIC RECORDS, INCLUDING MAINTAINING AN EFFECTIVE, EFFICIENT FILING PROCESS: ARCHIVING DOCUMENTS AS APPROPRIATE, SCANNING, FILING, AND DESTROYING PHYSICAL DOCUMENTS IN A TIMELY MANNER;PARTICIPATING IN ONGOING HR PROJECTS ACROSS THE DOMAINS OF TALENT MANAGEMENT, TALENT ACQUISITION, AND PEOPLE OPERATIONS. THIS IS AN INTERN-LEVEL POSITION, IDEAL FOR CANDIDATES WITH AN INTEREST IN EXPLORING A CAREER IN HUMAN RESOURCES IN HIGHER EDUCATION, RESEARCH, HEALTHCARE, OR SIMILAR INDUSTRIES. A COMPLETE JOB DESCRIPTION WILL BE PROVIDED TO CANDIDATES SELECTED FOR INTERVIEW.\nMINIMUM REQUIREMENTS:THIS POSITION IS OPEN TO ALL STUDENTS WHO ARE ELIGIBLE TO WORK ON CAMPUS AND WILL BE EMPLOYED THROUGH STUDENT OTHER PERSONNEL SERVICES (OPS) AND MUST MAINTAIN A MINIMUM 2.0 GRADE POINT AVERAGE.REGISTERED STUDENTS ARE EMPLOYED ON A PART-TIME BASIS, UP TO 20 HOURS PER WEEK.SUCCESSFUL PRE-EMPLOYMENT SCREENING INCLUDING A BACKGROUND CHECK.\n\nAPPLICANTS MUST UPLOAD A COPY OF THE FOLLOWING DOCUMENTS TO BE CONSIDERED FOR THIS POSITION:COVER LETTER OR LETTER OF INTERESTCURRICULUM VITAE OR RESUMELIST OF (3) PROFESSIONAL AND/OR EDUCATIONAL REFERENCES (MAY INCLUDE PROGRAMMATIC FACULTY OR OTHER APPROPRIATE CONTACTS)\nTHIS POSITION IS TIME-LIMITED. INITIAL APPOINTMENT TERM WILL BE FOR THE SUMMER SEMESTER AND MAY BE ELIGIBLE FOR FURTHER RENEWAL BASED ON INTERN PERFORMANCE, DEPARTMENTAL NEEDS, AND BUDGET AVAILABILITY.APPLICATION MUST BE SUBMITTED BY 11:55 P.M. (ET) OF THE POSTING END DATE.",
    "job_skill_set": [
      "administrative support",
      "recruitment",
      "onboarding",
      "record maintenance",
      "filing",
      "document archiving",
      "HR processes",
      "talent management",
      "talent acquisition",
      "people operations",
      "interest in HR",
      "eagerness to learn",
      "communication",
      "teamwork",
      "attention to detail",
      "time management"
    ],
    "short_keywords": [
      "acquisition",
      "administrative",
      "archiving",
      "attention",
      "communication",
      "detail",
      "document",
      "eagerness",
      "filing",
      "hr",
      "human",
      "in",
      "interest",
      "intern",
      "learn",
      "maintenance",
      "management",
      "onboarding",
      "operations",
      "people",
      "processes",
      "record",
      "recruitment",
      "resources",
      "support",
      "talent",
      "teamwork",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3891014745",
    "job_title": "Senior Human Resources Generalist",
    "category": "HR",
    "job_description": "ROLE: SENIOR HUMAN RESOURCES GENERALISTLOCATION: DENVER, CO NEAR RINO – HYBRID WITH 3-4 DAYS IN OFFICE/ WEEK\nWE ARE LOOKING FOR A DRIVEN AND EXPERIENCED SENIOR HUMAN RESOURCES GENERALIST TO JOIN A VERY REPUTABLE AND RAPIDLY GROWING SAAS COMPANY WITH A PRESENCE IN COLORADO, FLORIDA, AND CANADA. IF YOU ENJOY WORKING CLOSELY WITH A SMALL INTERNAL OPERATIONS TEAM AND IN STRONG PARTNERSHIP WITH OTHER LEADERS IN THE BUSINESS, WE’D LOVE TO TALK TO YOU!\nTHIS IS A HYBRID DIRECT HIRE ROLE IN DENVER, CO NEAR RINO PAYING $80-95K WITH QUARTERLY BONUSES.\nRESPONSIBILITIES:MANAGES AND DIRECTS ALL HR TASKS, INCLUDING BUILDING, REFINING AND MANAGING VARIOUS PEOPLE-PROGRAMS, PROCESSES AND POLICIESMAINTAIN A HIGH LEVEL OF EXPERTISE IN BEST PRACTICE AND COMPLIANCE WITH LOCAL, STATE, FEDERAL HUMAN RESOURCES POLICIES, PROGRAMS, LAWS, AND EMPLOYMENT ISSUESCOLLABORATES WITH LEADERSHIP TO UNDERSTAND LONG-TERM GOALS, AND IDENTIFIES WAYS TO SUPPORT THESE GOALS THROUGH AN OUTSTANDING CULTURE AND TALENT MANAGEMENTDRAFT AND IMPLEMENT STAFFING PLANS, RECRUITMENT PRACTICES AND AN EXCEPTIONAL ONBOARDING EXPERIENCEMANAGE RECRUITING EFFORTS, INCLUDING FULL LIFECYCLE RECRUITMENT AND EMPLOYER BRAND INITIATIVESDEVELOP CAREER PATHING AND LEARNING & DEVELOPMENT PROGRAMSCOMMUNICATE CHANGES IN THE COMPANY’S PERSONNEL POLICIES AND PROCEDURES AND ENSURE THAT PROPER COMPLIANCE IS FOLLOWEDMANAGE AND RESOLVE COMPLEX PEOPLE RELATIONS ISSUESMAINTAIN COMPETITIVE COMPENSATION, BENEFIT AND EMPLOYEE INCENTIVE PROGRAMSPARTNER WITH FUNCTIONAL MANAGERS TO MEET THEIR OPERATING AND TEAM GOALSALL OTHER DUTIES AS ASSIGNED\nREQUIREMENTS:5-10 YEARS OF HR EXPERIENCE THAT INCLUDES LEADERSHIP, RECRUITING, TALENT DEVELOPMENT, HR COMPLIANCE AND ADMINISTRATION, PROGRAM MANAGEMENT AND RETENTIONDEEP KNOWLEDGE OF KEY HUMAN RESOURCES FUNCTIONS (E.G. COMPENSATION, COMPLIANCE, OPERATIONS, EMPLOYEE RELATIONS) AND THE ABILITY TO ACT AS A STRATEGIC PARTNER TO THE BUSINESSINTERNATIONAL HR OPERATIONS EXPERIENCE IS STRONGLY PREFERRED, ESPECIALLY CANADIAN EMPLOYMENT LAW AND COMPLIANCEKNOWLEDGE OF--AND SENSITIVITY TO--THE DIVERSE BACKGROUNDS REPRESENTED ACROSS THE WORKFORCEEXCELLENT INTERPERSONAL, COMMUNICATION, LISTENING, AND MODERATING SKILLS--YOU ARE ABLE TO SUPPORT STAFF AND MANAGE CONFLICTS IN A MANNER THAT RESPECTS BOTH THE EMPLOYEE(S) AND THE COMPANYDEMONSTRATED SUCCESS OWNING PROJECTS FROM INCEPTION TO COMPLETION, PROVIDING APPROPRIATE LEVELS OF COMMUNICATION THROUGHOUTHIGH SENSE OF URGENCY, DRIVEN WITH ABILITY TO UNDERSTAND AND PRIORITIZE INITIATIVESEXCELLENT WRITTEN AND VERBAL COMMUNICATIONS SKILLS WITH ABILITY TO INTERACT EFFECTIVELY AT VARIOUS LEVELS IN THE ORGANIZATION.BACHELOR'S DEGREE PREFERRED (OR EQUIVALENT EXPERIENCE) WITH A SPECIALIZATION IN HUMAN RESOURCES, PERSONNEL, BUSINESS MANAGEMENT, COMMUNICATIONS, OR A RELATED FIELD PREFERREDCURRENT CERTIFICATION AS PHR/SPHR, SHRM-CP/SHRM-SCP\nCANDIDATES WITH THE BELOW ARE EXPERIENCE ARE PRIORITIZED:EXPERIENCE WITHIN A HIGH GROWTH TECHNOLOGY ENVIRONMENTEXPERIENCE WITH ENTREPRENEURIAL OPERATING SYSTEM (EOS)CURRENT CERTIFICATION AS PHR/SPHR, SHRM-CPAN ADVANCED HR DEGREE\nBENEFITS:FLEXIBLE UNLIMITED PTO AND PAID PARENTAL LEAVE401K MATCHWELLNESS STIPENDQUARTERLY BONUSES12 PAID HOLIDAYS PER YEAROPPORTUNITY TO WORK FOR AN ENTREPRENEURIAL COMPANY IN AN EXCITING PHASE OF GROWTH\nWHY WORK WITH AIMHIRE:WE WORK WITH MANY DIFFERENT CLIENTS IN MANY DIFFERENT INDUSTRIES AND MAY BE ABLE TO CONSIDER YOU FOR MULTIPLE ROLES AT ONE TIME!NO FEE TO YOU!VOTED ONE OF THE BEST STAFFING AGENCIES IN DENVER!PLEASE APPLY ONLINE AT WWW.AIMHIREDENVER.COM FOR IMMEDIATE CONSIDERATION\nPLEASE APPLY DIRECTLY ON OUR WEBSITE AT WWW.AIMHIREDENVER.COM FOR IMMEDIATE CONSIDERATION.\nAIMHIRE IS AN EQUAL OPPORTUNITY/AFFIRMATIVE ACTION EMPLOYER.\nKEYWORDS: HR, HUMAN RESOURCES, EMPLOYEE RELATIONS, GENERALIST, MANAGEMENT",
    "job_skill_set": [
      "HR Compliance",
      "Recruitment",
      "Talent Development",
      "Employee Relations",
      "Compensation Management",
      "Onboarding",
      "Communication Skills",
      "Interpersonal Skills",
      "Conflict Resolution",
      "Listening Skills",
      "Sense of Urgency",
      "Prioritization",
      "Team Collaboration",
      "Adaptability",
      "Program Management",
      "International HR Operations",
      "Project Management",
      "Bachelor's Degree in HR or related field",
      "PHR/SPHR Certification",
      "SHRM-CP/SHRM-SCP Certification",
      "Cultural Sensitivity"
    ],
    "short_keywords": [
      "adaptability",
      "bachelors",
      "certification",
      "collaboration",
      "communication",
      "compensation",
      "compliance",
      "conflict",
      "cultural",
      "degree",
      "development",
      "employee",
      "field",
      "generalist",
      "hr",
      "human",
      "in",
      "international",
      "interpersonal",
      "listening",
      "management",
      "of",
      "onboarding",
      "operations",
      "or",
      "phrsphr",
      "prioritization",
      "program",
      "project",
      "recruitment",
      "related",
      "relations",
      "resolution",
      "resources",
      "senior",
      "sense",
      "sensitivity",
      "shrmcpshrmscp",
      "skills",
      "talent",
      "team",
      "urgency"
    ]
  },
  {
    "job_id": "3902747307",
    "job_title": "Human Resources Business Partner",
    "category": "HR",
    "job_description": "ABOUT US\n\nRENT THE RUNWAY (RTR) IS TRANSFORMING THE WAY WE GET DRESSED BY PIONEERING THE WORLD’S FIRST CLOSET IN THE CLOUD. FOUNDED IN 2009, RTR HAS DISRUPTED THE $2.4 TRILLION FASHION INDUSTRY BY INSPIRING WOMEN WITH A MORE JOYFUL, SUSTAINABLE AND FINANCIALLY-SAVVY WAY TO FEEL THEIR BEST EVERY DAY. AS THE ULTIMATE DESTINATION FOR CIRCULAR FASHION, THE BRAND NOW OFFERS INFINITE POINTS OF ACCESS TO ITS SHARED CLOSET VIA A FULLY CUSTOMIZABLE SUBSCRIPTION TO FASHION, ONE-TIME RENTAL OR OWNERSHIP. RTR OFFERS DESIGNER APPAREL, ACCESSORIES AND HOME DECOR FROM 700+ BRAND PARTNERS AND HAS BUILT IN-HOUSE PROPRIETARY TECHNOLOGY AND A ONE-OF-A-KIND REVERSE LOGISTICS OPERATION. UNDER CEO AND CO-FOUNDER JENNIFER HYMAN’S LEADERSHIP, RTR HAS BEEN NAMED TO CNBC’S “DISRUPTOR 50” FIVE TIMES IN TEN YEARS, AND HAS BEEN PLACED ON FAST COMPANY’S MOST INNOVATIVE COMPANIES LIST MULTIPLE TIMES, WHILE HYMAN HERSELF HAS BEEN NAMED TO THE “TIME 100” MOST INFLUENTIAL PEOPLE IN THE WORLD AND AS ONE OF PEOPLE MAGAZINE’S “WOMEN CHANGING THE WORLD.”\n\nABOUT THE JOB\n\nAS THE HRBP FOR OUR OPERATIONS FACILITY AT DFW, YOU WILL PARTNER CLOSELY WITH OPERATIONS SENIOR MANAGEMENT AND HR LEADERSHIP TO DEVELOP AND EXECUTE THE HR STRATEGIES THAT FOSTER ORGANIZATIONAL AND PEOPLE EFFECTIVENESS. TO SUCCEED IN THIS ROLE, YOU WILL DEVELOP AN UNDERSTANDING OF BUSINESS OBJECTIVES AND TRANSLATE THEM INTO AN ALIGNED HR AGENDA. YOU WILL USE YOUR EXPERIENCE AND GOOD JUDGEMENT TO DIAGNOSE AND PRIORITIZE ISSUES TAKING PROACTIVE STEPS TO ADDRESS BALANCING HR AND LEGAL REQUIREMENTS AND BUSINESS NEEDS.\n\nYOU WILL WORK CLOSELY WITH OPS LEADERSHIP AND THE PEOPLE TEAM TO DEVELOP AND IMPLEMENT PROJECTS AROUND KEY AREAS INCLUDING BUT NOT LIMITED TO LABOUR PLANNING, PERFORMANCE MANAGEMENT, EMPLOYEE RELATIONS, RETENTION, ENGAGEMENT, INTERNAL COMMUNICATIONS, MANAGEMENT DEVELOPMENT, COACHING AND SUPPORTING DEI INITIATIVES TO CREATE A HIGH PERFORMING AND INCLUSIVE WORK ENVIRONMENT. THIS ROLE OFFERS THE OPPORTUNITY FOR A HANDS-ON HRBP TO IMPACT THE TACTICAL AND STRATEGIC AGENDA ACROSS THE FULL EMPLOYEE LIFECYCLE WHILE SUPPORTING OUR FULFILLMENT CENTER.\n\nTHE IDEAL CANDIDATE WILL BE A CREATIVE, COLLABORATIVE, RESULTS-ORIENTED MANAGER WHO CAN PRIORITIZE STRATEGICALLY AND ACT DECISIVELY. YOU WILL BE HIGHLY ENGAGED WITH OUR WORKFORCE AND SUCCESSFULLY MONITOR THE \"PULSE\" OF THE EMPLOYEES AND ADAPT BASED ON FEEDBACK AND INSIGHTS. EXPERIENCE WITH A RAPIDLY CHANGING WORK ENVIRONMENT AND HIGH-VOLUME WORKLOAD IS A MUST. YOU WILL THRIVE IN THIS ENVIRONMENT IF YOU CAN “ROLL UP YOUR SLEEVES AND GET INVOLVED” AND BRING A PASSION FOR DEVELOPING A STRONG, DIVERSE AND COLLABORATIVE TEAM.\n\nWHAT YOU’LL DO\n\nEXECUTE OUR PEOPLE INITIATIVES, PROVIDING COMPREHENSIVE INTERNAL CUSTOMER SUPPORT AND DRIVING HR FUNCTIONAL EXCELLENCE AND PROCESS IMPROVEMENT.UNDERSTAND BUSINESS GOALS AND RECOMMEND INFORMED APPROACHES TO HR INITIATIVES, POLICIES AND PROCEDURES THAT DRIVE SUCCESS. GUIDE AND ADVISE LEADERS IN CORRECTIVE ACTION, PERFORMANCE IMPROVEMENT PLANS AND EMPLOYEE TERMINATIONS. COACHING AND MENTORING AT THE MANAGEMENT LEVEL. OWN MANAGEMENT LEARNING & DEVELOPMENT PROGRAMS INCLUDING DRAFTING FACILITATOR GUIDES, PARTICIPANT GUIDES, POWERPOINT DECKS, AND JOB AIDS TO SUPPORT THE LEARNING OPPORTUNITIES AND CLOSE GAPS IN LEADERSHIP CAPABILITY. CREATE AND DRIVE EFFECTIVE EMPLOYEE RELATIONS, RETENTION AND REWARD PROGRAMS. ADVISE LEADERS REGARDING LEGAL AND REGULATORY COMPLIANCE: FMLA, ADA, FLSA, EEO, OSHA, SAFETY, ETC.PARTNER WITH SENIOR LEADERSHIP TO DRIVE PERFORMANCE MANAGEMENT AT ALL LEVELS OF THE ORGANIZATIONENSURE CONSISTENT POLICY IMPLEMENTATION, COMMUNICATION AND MONITOR ADHERENCE.FACILITATE AND PARTNER AS NECESSARY USING SOUND JUDGEMENT AND AN INFORMED APPROACH TO RESOLVE EMPLOYEE RELATION CONCERNS. PARTNER WITH OPERATIONS LEADERSHIP TO DRIVE ENGAGEMENT BASED ON THEIR EMPLOYEE ENGAGEMENT SURVEY RESULTS IN ALIGNMENT WITH COMPANY GOALS. \n\nABOUT YOU\n\nBACHELOR’S DEGREE IN HR, BUSINESS OR RELATED FIELD; ADVANCED HR DEGREE PREFERRED.AT LEAST 4 YEARS IN A DEDICATED HR ROLE WITH AT LEAST 2 YEARS OF HR MANAGEMENT EXPERIENCE.THE ABILITY TO MANAGE MULTIPLE PRIORITIES SIMULTANEOUSLY - ORIENTATED ON RESULTS.EXPERIENCE INTERPRETING AND APPLYING HR POLICIES, PROCEDURES, PROGRAMS AND PROCESSES.PASSION FOR INNOVATIVE HR SOLUTIONS AND PROCESS IMPROVEMENT.SOLUTIONS-FOCUSED APPROACH AND HIGH LEVEL OF COMFORT IN A HIGH-PERFORMING ENVIRONMENT WITH AMBITIOUS DELIVERABLES. ABILITY TO PROACTIVELY IDENTIFY PROBLEMS AND DRIVE APPROPRIATE RESOLUTIONS.PREVIOUS EXPERIENCE TRAINING TO MANAGER LEVEL. EXPERIENCE WORKING IN AN HR ROLE IN A MANUFACTURING OR WAREHOUSE ENVIRONMENT ESSENTIAL. EXCELLENT PROBLEM SOLVER WITH A PROVEN TRACK RECORD OF DRIVING RESULTS THROUGH A PROJECT LIFECYCLE. EXCELLENT INTERPERSONAL, ORAL, AND WRITTEN COMMUNICATION SKILLS.EXCELLENT COMPUTER SKILLS INCLUDING MICROSOFT OFFICE PRODUCTS, INTERNET NAVIGATION, HRIS SYSTEMSABLE TO CREATE, ANALYZE, REPORT AND MANIPULATE DATA AS IT RELATES TO HR METRICSBILINGUAL IN SPANISH - A PLUS\n\nBENEFITS\n\nAT RENT THE RUNWAY, WE’RE COMMITTED TO THE WELL-BEING OF OUR EMPLOYEES AND AIM TO CREATE A WORKPLACE THAT FOSTERS BOTH PERSONAL AND PROFESSIONAL GROWTH. OUR INCLUSIVE BENEFITS INCLUDE, BUT ARE NOT LIMITED TO:\n\nPAID TIME OFF INCLUDING VACATION, PAID BEREAVEMENT, AND FAMILY SICK LEAVE - EVERY EMPLOYEE NEEDS TIME TO TAKE CARE OF THEMSELVES AND THEIR FAMILY.UNIVERSAL PAID PARENTAL LEAVE FOR BOTH PARENTS + FLEXIBLE RETURN TO WORK PROGRAM - BECAUSE WE KNOW YOUR NEWEST FAMILY MEMBER(S) DESERVE YOUR UNDIVIDED ATTENTION.PAID SABBATICAL AFTER 5 YEARS OF CONTINUOUS SERVICE - UNPLUG, RECHARGE, AND HAVE SOME FUN!EXCLUSIVE EMPLOYEE SUBSCRIPTION AND RENTAL DISCOUNTS - TO ENSURE YOU EXPERIENCE THE MAGIC OF RENTING THE RUNWAY (AND GIVE US VALUED FEEDBACK!).COMPREHENSIVE HEALTH, VISION, DENTAL, FSA AND DEPENDENT CARE FROM DAY 1 OF EMPLOYMENT - YOUR HEALTH COMES FIRST AND WE’VE GOT YOU COVERED.401K MATCH - AN INVESTMENT IN YOUR FUTURE.COMPANY-WIDE EVENTS AND OUTINGS - OUR TEAM SPIRIT IS NO JOKE - WE KNOW HOW TO HAVE FUN! OFFICE CENTRIC WORK: THE ROLE IS ONSITE OUT OF OUR DALLAS FORTH WORTH FACILITY, 5 DAYS PER WEEK \n\nRENT THE RUNWAY IS AN EQUAL OPPORTUNITY EMPLOYER. IN ACCORDANCE WITH APPLICABLE LAW, WE PROHIBIT DISCRIMINATION AGAINST ANY APPLICANT OR EMPLOYEE BASED ON ANY LEGALLY-RECOGNIZED BASIS, INCLUDING, BUT NOT LIMITED TO: RACE, COLOR, RELIGION, SEX (INCLUDING PREGNANCY, LACTATION, CHILDBIRTH OR RELATED MEDICAL CONDITIONS), SEXUAL ORIENTATION, GENDER IDENTITY, AGE (40 AND OVER), NATIONAL ORIGIN OR ANCESTRY, CITIZENSHIP STATUS, PHYSICAL OR MENTAL DISABILITY, GENETIC INFORMATION (INCLUDING TESTING AND CHARACTERISTICS), VETERAN STATUS, UNIFORMED SERVICE MEMBER STATUS OR ANY OTHER STATUS PROTECTED BY FEDERAL, STATE OR LOCAL LAW.\n\nBY SUBMITTING YOUR APPLICATION BELOW, YOU AGREE THAT YOU HAVE READ AND ACKNOWLEDGE RENT THE RUNWAY'S CANDIDATE PRIVACY POLICY, FOUND HERE .",
    "job_skill_set": [
      "HR management",
      "employee relations",
      "performance management",
      "data analysis",
      "HRIS systems",
      "legal compliance",
      "Microsoft Office",
      "project management",
      "coaching and mentoring",
      "communication",
      "problem solving",
      "collaboration",
      "strategic thinking",
      "results-oriented",
      "adaptability",
      "creativity",
      "engagement",
      "initiative",
      "teamwork",
      "bilingual in Spanish"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "and",
      "bilingual",
      "business",
      "coaching",
      "collaboration",
      "communication",
      "compliance",
      "creativity",
      "data",
      "employee",
      "engagement",
      "hr",
      "hris",
      "human",
      "in",
      "initiative",
      "legal",
      "management",
      "mentoring",
      "microsoft",
      "office",
      "partner",
      "performance",
      "problem",
      "project",
      "relations",
      "resources",
      "resultsoriented",
      "solving",
      "spanish",
      "strategic",
      "systems",
      "teamwork",
      "thinking"
    ]
  },
  {
    "job_id": "3906227054",
    "job_title": "Human Resources Assistant",
    "category": "HR",
    "job_description": "$20.62 PER HOUR\n\nAT CORECIVIC, OUR EMPLOYEES ARE DRIVEN BY A DEEP SENSE OF SERVICE, HIGH STANDARDS OF PROFESSIONALISM AND A RESPONSIBILITY TO BETTER THE PUBLIC GOOD. WE ARE CURRENTLY SEEKING A HUMAN RESOURCES ASSISTANT WHO HAS A PASSION FOR PROVIDING THE HIGHEST QUALITY CARE IN AN INSTITUTIONAL, SECURE SETTING. COME JOIN A TEAM THAT IS DEDICATED TO MAKING AN IMPACT FOR THE PEOPLE AND COMMUNITIES WE SERVE.\n\nTHE HUMAN RESOURCES ASSISTANT PERFORMS VARIED AND MODERATELY COMPLEX CLERICAL FUNCTIONS AND RELATED GENERAL OFFICE DUTIES THAT REQUIRE INDEPENDENT JUDGMENT IN THE USE OF WORK METHODS AND PROCEDURES IN THE AREAS OF HUMAN RESOURCES AND PAYROLL ADMINISTRATION. THEY WILL PROVIDE SUPPORT IN THE AREAS OF EMPLOYEE BENEFITS AND SERVICES, EMPLOYEE RELATIONS, COMPLIANCE, SAFETY AND HEALTH, WAGE AND SALARY ADMINISTRATION, PERFORMANCE MANAGEMENT, AND EMPLOYMENT WHICH INCLUDES RECRUITING, SELECTION, AND ORIENTATION.\n\nREVIEW AND PROCESS HUMAN RESOURCES AND PAYROLL DOCUMENTS. VERIFY THAT REQUIRED FORMS ARE ACCURATE AND COMPLETE FOR PROCESSING.MAINTAIN PERSONNEL AND MEDICAL FILES IN COMPLIANCE WITH POLICY AND PROCEDURES. PROCESS PERSONNEL AND PAYROLL DOCUMENTS THROUGH REGULAR USE OF SOFTWARE APPLICATIONS, INCLUDING BUT NOT LIMITED TO, PROMOTIONS, DEMOTIONS, TRANSFERS, AND SALARY CHANGES.ASSIST IN THE IMPLEMENTATION AND ADMINISTRATION OF HUMAN RESOURCES POLICIES, PROCEDURES, AND PROGRAMS. RESPOND TO STAFF INQUIRIES OR REQUESTS REGARDING HR PROGRAMS OR REFERS TO APPROPRIATE STAFF MEMBER OR FACILITY SUPPORT CENTER FOR FURTHER ASSISTANCE AS NEEDED.ASSIST WITH THE IMPLEMENTATION, AND MAINTENANCE OF AN ON-GOING RECRUITING PROGRAM FOR STAFFING NEEDS.\n\n\nQUALIFICATIONS\n\nHIGH SCHOOL DIPLOMA, GED CERTIFICATION OR EQUIVALENT IS REQUIRED.TWO YEARS OF EXPERIENCE IN FULL-TIME CLERICAL OR ADMINISTRATIVE OFFICE WORK IS REQUIRED, PREFERABLY IN HUMAN RESOURCES ADMINISTRATION. ADDITIONAL QUALIFYING EDUCATION AT AN ACCREDITED COLLEGE, BUSINESS SCHOOL OR TECHNICAL INSTITUTE IN OFFICE ADMINISTRATION OR A RELATED FIELD MAY BE SUBSTITUTED FOR THE REQUIRED EXPERIENCE ON A YEAR-FOR-YEAR BASIS UP TO ONE YEAR.EXPERIENCE IN MICROSOFT OFFICE APPLICATIONS OR OTHER SIMILAR SOFTWARE APPLICATIONS IS REQUIRED.KNOWLEDGE OF JD EDWARDS AND KRONOS IS STRONGLY PREFERRED.A VALID DRIVER'S LICENSE IS REQUIRED.MINIMUM AGE REQUIREMENT: MUST BE AT LEAST 18 YEARS OF AGE. \n\n\nCORECIVIC IS A DRUG-FREE WORKPLACE AND EOE-INCLUDING DISABILITY/VETERAN.",
    "job_skill_set": [
      "human resources administration",
      "recruiting",
      "Microsoft Office",
      "clerical functions",
      "office administration",
      "independent judgment",
      "communication",
      "teamwork",
      "problem solving",
      "attention to detail",
      "customer service",
      "payroll administration",
      "employee benefits",
      "compliance",
      "performance management",
      "JD Edwards",
      "Kronos"
    ],
    "short_keywords": [
      "administration",
      "assistant",
      "attention",
      "benefits",
      "clerical",
      "communication",
      "compliance",
      "customer",
      "detail",
      "edwards",
      "employee",
      "functions",
      "hr",
      "human",
      "independent",
      "jd",
      "judgment",
      "kronos",
      "management",
      "microsoft",
      "office",
      "payroll",
      "performance",
      "problem",
      "recruiting",
      "resources",
      "service",
      "solving",
      "teamwork",
      "to"
    ]
  },
  {
    "job_id": "3905298637",
    "job_title": "Human Resources Business Partner",
    "category": "HR",
    "job_description": "WHAT MAKES A HONDA, IS WHO MAKES A HONDA\n\nHONDA HAS A CLEAR VISION FOR THE FUTURE, AND IT’S A JOYFUL ONE. WE ARE LOOKING FOR INDIVIDUALS WITH THE SKILLS, COURAGE, PERSISTENCE, AND DREAMS THAT WILL HELP US REACH OUR FUTURE-FOCUSED GOALS.\n\nAT OUR CORE IS INNOVATION. HONDA IS CONSTANTLY INNOVATING AND DEVELOPING SOLUTIONS TO DRIVE OUR BUSINESS WITH RECORD SUCCESS. WE STRIVE TO BE A COMPANY THAT SERVES AS A SOURCE OF “POWER” THAT SUPPORTS PEOPLE AROUND THE WORLD WHO ARE TRYING TO DO THINGS BASED ON THEIR OWN INITIATIVE AND THAT HELPS PEOPLE EXPAND THEIR OWN POTENTIAL. TO THIS END, HONDA STRIVES TO REALIZE “THE JOY AND FREEDOM OF MOBILITY” BY DEVELOPING NEW TECHNOLOGIES AND AN INNOVATIVE APPROACH TO ACHIEVE A “ZERO ENVIRONMENTAL FOOTPRINT.”\n\nWE ARE LOOKING FOR QUALIFIED INDIVIDUALS WITH DIVERSE BACKGROUNDS, EXPERIENCES, CONTINUOUS IMPROVEMENT VALUES, AND A STRONG WORK ETHIC TO JOIN OUR TEAM.\n\nIF YOUR GOALS AND VALUES ALIGN WITH HONDA’S, WE WANT YOU TO JOIN OUR TEAM TO BRING THE FUTURE!\n\nJOB PURPOSE\n\nTHE HR BUSINESS PARTNER (HRBP) SUPPORTS THE BHR SR. LEADER. SR. HRBPS AND PARTNERS WITH BUSINESS LEADERS TO PROVIDE END-TO-END HUMAN CAPITAL SOLUTIONS THAT ADVANCE THE BUSINESS AGENDA. THE HRBP SERVES AS A PARTNER AND PROVIDES GUIDANCE TO LEADERS TO SUPPORT ORGANIZATIONAL OBJECTIVES AND BUSINESS STRATEGIES. THE HRBP POSITION IS RESPONSIBLE FOR ALIGNING HR PROGRAMS AND POLICIES WITH BUSINESS OBJECTIVES WITHIN DESIGNATED BUSINESS UNITS. THE POSITION SERVES AS A CONSULTANT TO MANAGEMENT ON HUMAN RESOURCE-RELATED ISSUES, ACTS AS A CHANGE AGENT, AND SEEKS TO DEVELOP INTEGRATED SOLUTIONS ALL THE WHILE WORKING CLOSELY AND IN CONJUNCTION WITH OTHER HR FUNCTIONS AND COES.\n\nKEY ACCOUNTABILITIES\n\nPARTNER WITH BUSINESS UNITS/PLANT LEADERS TO INTEGRATE PEOPLE STRATEGIES WITHIN THE OVERALL ORGANIZATIONAL STRATEGY ADDRESS HR RELATED TRENDS AND ISSUES IMPACTING THE BUSINESS AND PROVIDE FORWARD-THINKING INSIGHTS, RECOMMENDATIONS, PLANS, TOOLS, AND SOLUTIONS ENSURE HR PROGRAMS, PROCESSES AND SERVICES DELIVERY ARE BASED ON THE BUSINESS ENVIRONMENT/STRATEGY AND TALENT IMPLICATIONS BY WORKING WITH COE’S, HR OPS, AND HR LEADERSPROVIDE HR CONSULTING SERVICES TO BUSINESS /PLANT LEADERS AS IT RELATES TO HUMAN RESOURCES PROGRAMS AND POLICIES, OFTEN ENCOMPASSING ALL AREAS OF HUMAN RESOURCESANALYZE DATA TO IDENTIFY TRENDS, GAPS, AND PRIORITIES, PARTICULARLY IN THE AREAS OF PERFORMANCE MANAGEMENT, TALENT DEVELOPMENT, AND WORKFORCE PLANNINGCOUNSEL BUSINESS LEADERS ON PEOPLE MATTERS \n\nQUALIFICATIONS, EXPERIENCE, AND SKILLS\n\nBACHELOR’S DEGREE IN A RELEVANT FIELD6+ YEARS OF HR EXPERIENCE AS AN HRBP AND/OR HR GENERALIST, WITH CONSIDERABLE EXPERIENCE IN ONE OR MORE OF THE FOLLOWING: COMPENSATION, ASSOCIATE RELATIONS, TALENT MANAGEMENT, CONTINUOUS PROCESS IMPROVEMENT, CHANGE MANAGEMENT, D & I, AND OD.EXCELLENT TEAM BUILDING SKILLS, SELF-MOTIVATED WITH THE ABILITY TO MULTI-TASK IN A FAST PACED, HIGH- VOLUME ENVIRONMENTSTRONG BUSINESS ACUMEN AND UNDERSTANDING OF THE HR STRATEGIC PARTNERSHIP IN DRIVING BUSINESS RESULTSCREATIVE PROBLEM SOLVER WITH STRONG ATTENTION TO DETAIL, ORGANIZATION, AND FOLLOW-UP SKILLSDEMONSTRATED SUCCESS IN DEVELOPING AND IMPLEMENTING A VARIETY OF HUMAN CAPITAL STRATEGIES IN SUPPORT OF BUSINESS OBJECTIVES AND GOALS STRONG UNDERSTANDING OF FEDERAL AND STATE EMPLOYMENT LAWS AND REGULATIONS AS IT PERTAINS TO EMPLOYMENT RELATED MATTERSSTRONG COMMUNICATION, PROBLEM SOLVING, AND NEGOTIATION SKILLSSTRONG COLLABORATION SKILLS WITH ALL LEVELS WITHIN THE ORGANIZATION\n\nWORKSTYLE\n\nONSITE\n\nBENEFITS AND TOTAL REWARDS\n\nWHAT DIFFERENTIATES HONDA AND MAKES US AN EMPLOYER OF CHOICE?\n\nTOTAL REWARDS\n\nCOMPETITIVE BASE SALARYANNUAL BONUSOVERTIMEINDUSTRY LEADING BENEFIT PLANS (MEDICAL, DENTAL, VISION, RX)PAID TIME OFF, INCLUDING VACATION, PAID HOLIDAYS, SICK TIME, PERSONAL DAYS401K PLAN WITH COMPANY MATCH + ADDITIONAL CONTRIBUTIONLIFESTYLE BONUS\n\nCAREER GROWTH\n\nADVANCEMENT OPPORTUNITIESCAREER MOBILITY EDUCATION REIMBURSEMENT FOR CONTINUED LEARNINGTRAINING AND DEVELOPMENT PROGRAMS \n\nADDITIONAL OFFERINGS\n\nWELLBEING PROGRAMCOMMUNITY SERVICE AND ENGAGEMENT PROGRAMSPRODUCT PROGRAMSFREE DRINKS ONSITE\n\nHONDA IS AN EQUAL OPPORTUNITY EMPLOYER AND CONSIDERS QUALIFIED APPLICANTS FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, CREED, RELIGION, NATIONAL ORIGIN, SEX, SEXUAL ORIENTATION, GENDER IDENTITY AND EXPRESSION, AGE, DISABILITY, VETERAN STATUS, OR ANY OTHER PROTECTED FACTOR.\n\n",
    "job_skill_set": [
      "HR experience",
      "data analysis",
      "talent management",
      "process improvement",
      "communication",
      "problem solving",
      "team building",
      "collaboration",
      "self-motivation",
      "organizational skills",
      "attention to detail",
      "multi-tasking",
      "compensation management",
      "change management",
      "employment law knowledge",
      "human capital strategy development",
      "negotiation"
    ],
    "short_keywords": [
      "analysis",
      "attention",
      "building",
      "business",
      "capital",
      "change",
      "collaboration",
      "communication",
      "compensation",
      "data",
      "detail",
      "development",
      "employment",
      "experience",
      "hr",
      "human",
      "improvement",
      "knowledge",
      "law",
      "management",
      "multitasking",
      "negotiation",
      "organizational",
      "partner",
      "problem",
      "process",
      "resources",
      "selfmotivation",
      "skills",
      "solving",
      "strategy",
      "talent",
      "team",
      "to"
    ]
  },
  {
    "job_id": "3898176212",
    "job_title": "Vice President Human Resources",
    "category": "HR",
    "job_description": "VICE PRESIDENT OF HUMAN RESOURCESLOCATION: PRIMARILY IN-PERSON EITHER AT LA QUINTA OR BAKERSFIELD, CALIFORNIA\nSUN WORLD INTERNATIONAL IS A CALIFORNIA-BASED AGRICULTURE AND TECHNOLOGY FIRM ENGAGED IN FRUIT VARIETY DEVELOPMENT, TECHNOLOGY, INTELLECTUAL PROPERTY, AND LICENSING. TECHNOLOGY AND IP PURSUITS INCLUDE A LEADING FRUIT BREEDING/GENETICS PROGRAMS, A BROAD-BASED PORTFOLIO OF PLANT PATENTS AND TRADEMARKS, AND INVESTMENTS IN AGRICULTURE TECHNOLOGY START-UPS BENEFITING ITS GLOBAL LICENSEES. LICENSING CONSISTS OF SHARING NEW PROPRIETARY STONE FRUIT AND TABLE GRAPE VARIETIES, AND THE IP THEY COMPRISE, WITH LIKE-MINDED FRUIT GROWERS AND MARKETERS IN MORE THAN 15 COUNTRIES AROUND THE WORLD. \nTHE COMPANY PRIZES CREATIVITY, INNOVATION, AND AN ENTREPRENEURIAL SPIRIT. ITS PEOPLE STRIVE FOR EXCELLENCE BY DEMONSTRATING LEADERSHIP, PASSION, KINDNESS, AUTHENTICITY, COURAGE, INITIATIVE, AND CURIOSITY.\nABOUT THE OPPORTUNITY THE VICE PRESIDENT OF HUMAN RESOURCES IS RESPONSIBLE FOR DEVELOPING AND ADMINISTERING ALL HUMAN RESOURCE-RELATED STRATEGIES, POLICIES AND PROGRAMS AND, IN SO DOING, FOR HELPING TO ARTICULATE THE COMPANY’S CULTURE AND VALUES AS WELL AS ITS COMMITMENT TO DIVERSITY, EQUITY AND INCLUSION. THE PERSON OCCUPYING THIS MANAGEMENT ROLE WILL ENABLE AND SUPPORT A HIGHLY ENGAGED AND CONNECTED GLOBAL TEAM WITH HIGH MORALE AND RETENTION. CREATIVE ANALYSIS, INDEPENDENT THOUGHT, AND A PROACTIVE APPROACH TO ADDING VALUE TO THE ORGANIZATION ARE KEY ELEMENTS OF THIS POSITION.\nREPORTS TO: PRESIDENT & CHIEF OPERATING OFFICER WITH DOTTED LINE REPORTING TO CHIEF FINANCIAL OFFICER ON PAYROLL AND BENEFITS MATTERSPERSONNEL SUPERVISED: PEOPLE & CULTURE MANAGERHOURS WORKED: FULL TIME, 40 HOURS/WEEK, MONDAY-FRIDAY. EVENING AND WEEKEND HOURS AS NEEDED.COMPENSATION: BASE SALARY $135K-$160K, PLUS BONUS POTENTIAL UP TO 30%, AND A COMPREHENSIVE BENEFITS PACKAGE SUPPORTING EMPLOYEE WELLNESS AND SECURITY.\nPRIMARY DUTIES & RESPONSIBILITIESFORMULATE, RECOMMEND AND ENSURE ADHERENCE TO THE COMPANY’S HR STRATEGIES, POLICIES, AND OBJECTIVES WHILE PROTECTING INTERESTS OF EMPLOYEES AND THE COMPANY IN ACCORDANCE WITH COMPANY HR POLICIES AND APPLICABLE GOVERNMENTAL LAWS AND REGULATIONS. ACT AS PRIMARY CONTACT WITH LABOR COUNSEL AND OUTSIDE GOVERNMENT LABOR RELATED AGENCIESESTABLISH/MAINTAIN POSITION DESCRIPTIONS, WAGE AND SALARY STRUCTURE, PAY POLICIES, PERFORMANCE APPRAISAL PROGRAMS, EMPLOYEE BENEFIT PROGRAMS AND SERVICES, AND COMPANY SAFETY AND HEALTH PROGRAMS. MONITOR FOR EFFECTIVENESS AND COST CONTAINMENT.ESTABLISH STANDARD RECRUITING AND PLACEMENT PRACTICES AND PROCEDURES, AND WORK EFFECTIVELY WITH RESPECTIVE HIRING MANAGERS IN THE PROCESS OF RECRUITING NEW EMPLOYEES.DEVELOP AND ADMINISTER EFFECTIVE EMPLOYEE ONBOARDING AND OFFBOARDING PROCESSES AND SERVE AS THE LEAD POINT OF HR CONTACT FOR EMPLOYEES. MAINTAIN THE COMPANY’S EMPLOYEE HANDBOOK TO ENSURE THAT IT COMPLIES WITH CURRENT LABOR REGULATIONS AND PRACTICES. ESTABLISH AND MAINTAIN EFFECTIVE WORKING RELATIONSHIPS WITH THE COMPANY’S PAYROLL, BENEFITS, 401K, SAFETY, AND WORKERS’ COMPENSATION SERVICE PROVIDERS. ADMINISTER THESE EMPLOYEE WELFARE PROGRAMS AND BE THE COMPANY’S POINT PERSON FOR EXTERNAL AUDITS OF THESE PROGRAMS. ESTABLISH AND ASSIST WITH IMPLEMENTATION OF ALL TRAINING PROGRAMS WHILE STAYING CURRENT WITH HR TRENDS, BEST PRACTICES, EMPLOYEE TRAINING AND REGULATIONS.RESPONSIBLE FOR THE CONTINUED DEVELOPMENT AND IMPLEMENTATION OF THE COMPANY’S DIVERSITY, EQUITY, AND INCLUSION (DEI) INITIATIVES. MAINTAIN A DISCIPLINED FILING SYSTEM FOR PERSONNEL FILES AND OTHER RELEVANT HR DOCUMENTATION.ADDITIONAL DUTIES, RESPONSIBILITIES, AND PROJECTS AS ASSIGNED.\nREQUIRED SKILLS & KNOWLEDGEBACHELOR'S DEGREE IN HUMAN RESOURCES OR A RELATED FIELD. MASTER’S DEGREE AND HRCI CERTIFICATION ARE PLUSES. MINIMUM 10 YEARS OF EXPERIENCE GAINED THROUGH INCREASINGLY RESPONSIBLE MANAGEMENT POSITIONS WITHIN HUMAN RESOURCES. HR KNOWLEDGE OF, AND EXPERIENCE WORKING IN, CALIFORNIA PREFERRED. STRONG INTERPERSONAL, MANAGEMENT, LEADERSHIP, CONFLICT RESOLUTION, PROBLEM-SOLVING, AND MEDIATION SKILLS.SELF-STARTER, WORKS WELL UNDER PRESSURE, ABILITY TO POSITIVELY ADAPT TO CHANGING PRIORITIES.STRONG WORK ETHIC AND TEAM MENTALITY, AND HIGH DEGREE OF ACCOUNTABILITY.EXCELLENT ENGLISH VERBAL AND WRITTEN COMMUNICATION SKILLS, WITH PROVEN ABILITY TO MEET DEADLINES. ABILITY TO SPEAK, READ, AND WRITE SPANISH IS HELPFUL BUT NOT REQUIRED.BROAD BACKGROUND WITH KNOWLEDGE OF ORGANIZATIONAL DESIGN AND PLANNING, EMPLOYMENT, COMPENSATION, PAYROLL, EMPLOYEE BENEFITS, EMPLOYEE RELATIONS, AND TRAINING AND DEVELOPMENT.SOLID KNOWLEDGE OF HR LEGAL REQUIREMENTS AND GOVERNMENT REPORTING REGULATIONS TO ENSURE THAT THE COMPANY IS IN COMPLIANCE WITH THE RELATED POLICIES, PROCEDURES, AND REPORTING.COMPUTER LITERACY, PROFICIENT IN MICROSOFT OFFICE SUITE.PROFICIENCY IN HRIS AND TALENT MANAGEMENT SYSTEMS.PRIMARY BASE LOCATION WILL BE AT COMPANY’S ADMINISTRATIVE OFFICE IN BAKERSFIELD, CALIFORNIA OR EXECUTIVE OFFICE IN LA QUINTA, CALIFORNIA ABILITY TO WORK FLEXIBLE HOURS TO ACCOMMODATE EMPLOYEES BASED IN COUNTRIES OTHER THAN THE UNITED STATES.",
    "job_skill_set": [
      "Human Resources Management",
      "Conflict Resolution",
      "Problem Solving",
      "Employee Relations",
      "Organizational Design",
      "HR Legal Compliance",
      "Microsoft Office Suite",
      "HRIS and Talent Management Systems",
      "Payroll Management",
      "Employee Benefits Administration",
      "Training and Development",
      "Performance Appraisal Programs",
      "Recruiting and Placement Practices",
      "Leadership",
      "Interpersonal Skills",
      "Communication",
      "Adaptability",
      "Teamwork",
      "Initiative",
      "Creativity",
      "Work Ethic",
      "Accountability",
      "Curiosity",
      "Diversity, Equity, and Inclusion (DEI) Initiatives",
      "Bilingual (English/Spanish)"
    ],
    "short_keywords": [
      "accountability",
      "adaptability",
      "administration",
      "and",
      "appraisal",
      "benefits",
      "bilingual",
      "communication",
      "compliance",
      "conflict",
      "creativity",
      "curiosity",
      "dei",
      "design",
      "development",
      "diversity",
      "employee",
      "englishspanish",
      "equity",
      "ethic",
      "hr",
      "hris",
      "human",
      "inclusion",
      "initiative",
      "initiatives",
      "interpersonal",
      "leadership",
      "legal",
      "management",
      "microsoft",
      "office",
      "organizational",
      "payroll",
      "performance",
      "placement",
      "practices",
      "president",
      "problem",
      "programs",
      "recruiting",
      "relations",
      "resolution",
      "resources",
      "skills",
      "solving",
      "suite",
      "systems",
      "talent",
      "teamwork",
      "training",
      "vice",
      "work"
    ]
  },
  {
    "job_id": "3899526653",
    "job_title": "Human Resources Intern",
    "category": "HR",
    "job_description": "WE’RE LOOKING FOR SENSITIVE, HIGHLY INTUITIVE AND DRIVEN, ENTRY-LEVEL HR PROFESSIONALS WHO WILL BE TASKED WITH RECRUITING AND MANAGING THESE INTERNS, EMPLOYEES AND PARTNERS AND ENABLE THEM TO SEAMLESSLY INTEGRATE INTO OUR UNIQUE WORK ENVIRONMENT. \nNOTE: THIS IS A CHALLENGING BUT EXTREMELY REWARDING ROLE FOR ANYONE WITH A PASSION FOR HR AND A SINCERE INTEREST IN DEVELOPING THEIR OWN INNER POTENTIAL.\nREAD WHAT OUR INTERNS AND EMPLOYEES HAVE TO SAY ABOUT US ON OUT LINKEDIN PAGE. LEARN MORE ABOUT OUR COMPANY AT WWW.XIRCLS.COM\nRESPONSIBILITIES:● SOURCE PROSPECTIVE CANDIDATES THROUGH LINKEDIN JOB POSTS● PROMOTE JOB OPENINGS ON SOCIAL MEDIA, JOB BOARDS AND INTERNALLY● SCREEN RESUMES, SCHEDULE INTERVIEWS AND INTERVIEW CANDIDATES● IF INTERESTED, HELP MANAGE OUR PRODUCT GROWTH TEAMS AND DO EVERYTHING REQUIRED TO HELP THEM SUCCEED!\nREQUIREMENTS:● EXCELLENT VERBAL & WRITTEN COMMUNICATION SKILLS● COMFORT & EASE IN FRONT OF THE CAMERA (FOR MAKING JOB OPENING VIDEOS)● COMFORTABLE WITH REGULAR, ONE-ON-ONE AND GROUP VIDEO CALLS● ABILITY TO WORK IN A TEAM● IMMENSE RESOLVE TO ACHIEVE TARGETS● HIGH DEGREE OF OWNERSHIP IN TAKING THINGS TO COMPLETION\nBENEFITS:● FLEXIBLE WORK HOURS● WORK WITH A CROSS-FUNCTIONAL, MULTI-CULTURAL TEAM● GAIN EXPERIENCE WORKING FOR A BUDDING STARTUP WITH GLOBAL REACH\nCOMPENSATION STRUCTURE:THIS IS AN UNPAID INTERNSHIP.",
    "job_skill_set": [
      "team management",
      "communication",
      "teamwork",
      "problem solving",
      "initiative",
      "adaptability",
      "recruiting",
      "resume screening",
      "social media promotion",
      "video communication"
    ],
    "short_keywords": [
      "adaptability",
      "communication",
      "hr",
      "human",
      "initiative",
      "intern",
      "management",
      "media",
      "problem",
      "promotion",
      "recruiting",
      "resources",
      "resume",
      "screening",
      "social",
      "solving",
      "team",
      "teamwork",
      "video"
    ]
  },
  {
    "job_id": "3901635742",
    "job_title": "Human Resources Director",
    "category": "HR",
    "job_description": "OVERVIEW OF CLIENTOUR CLIENT, LOCATED IN DOWNTOWN CHICAGO, IS A MULTI-STATE NON-PROFIT THAT HELPS CHILDREN AND FAMILIES SEE AND CREATE A FUTURE WHERE, REGARDLESS OF THEIR PAST, THEY CAN REACH THEIR FULL POTENTIAL. THEY SERVE OVER 10,000 CHILDREN AND FAMILIES EACH YEAR THROUGH EDUCATION CENTERS, CHILD AND FAMILY SERVICES, BEHAVIORAL HEALTH RESOURCES, AND RESIDENTIAL PROGRAMS TO EMPOWER CHILDREN AND FAMILIES.\nTHIS IS A HYBRID ROLE, WORKING 3 TO 4 DAYS IN THE OFFICE.\nTHE COMPENSATION FOR THIS POSITION IS A BASE SALARY OF $120,000 ANNUALLY. THERE IS CURRENTLY NO BONUS OFFERING.\nJOB SUMMARY REPORTING DIRECTLY TO THE CHIEF PEOPLE OFFICER (CPO), THE HUMAN RESOURCES DIRECTOR WILL MANAGE A TEAM COMPRISED OF HR BUSINESS PARTNERS, IN ADDITION TO OVERSEEING EMPLOYEE RELATIONS, DEI WORK ACROSS THE ORGANIZATION, EMPLOYEE BENEFITS, LEAVE OF ABSENCES, HR REPORTING AND ANALYTICS, REWARDS AND RECOGNITION, PERFORMANCE MANAGEMENT AND DEVELOPMENT PLANNING, COMPENSATION, BENEFITS, HRIS, PAYROLL, HR COMPLIANCE, POLICY DEVELOPMENT AND ADMINISTRATION, AND COORDINATION AND COMPLIANCE OF ALL EMPLOYMENT FILES. THIS ROLE IS CENTRAL TO CREATING A DIVERSE, RESPECTFUL, ENGAGING, AND INCLUSIVE WORK ENVIRONMENT FOR AN ORGANIZATION OF 800+ EMPLOYEES.\nTHE IDEAL CANDIDATE WILL HAVE:BACHELOR’S DEGREE IN HUMAN RESOURCES, BUSINESS ADMINISTRATION, ORGANIZATIONAL DEVELOPMENT, OR RELATED FIELD REQUIRED.MASTER’S DEGREE OR A RELATED ADVANCED DEGREE PREFERRED.RECENT NON-PROFIT EXPERIENCE AS A HUMAN RESOURCES LEADER HIGHLY PREFERRED.ABILITY TO TRAVEL THROUGHOUT THE STATES OF ILLINOIS AND FLORIDA UP TO 30% OF THE TIME.A STRONG REPUTATION FOR BEING INNOVATIVE, KNOWN FOR HAVING IMPRESSIVE RELATIONSHIP MANAGEMENT SKILLS, AS WELL AS BEING CONSISTENTLY RECOGNIZED AS A TRUSTED ADVISOR AND APPROACHABLE RESOURCE.MINIMUM OF 5 YEARS OF EXPERIENCE MANAGING, COACHING, AND DEVELOPING A TEAM OF HUMAN RESOURCES PROFESSIONALS THAT INCLUDE HUMAN RESOURCES GENERALISTS AND/OR HR BUSINESS PARTNERS, PREFERABLY FIELD-BASED.DEEP EMPLOYEE RELATIONS EXPERIENCE AND EXPERTISE.DEMONSTRATED EXPERIENCE UNDERSTANDING KEY ATTRITION DRIVERS AND CREATING AND INTRODUCING IMPACTFUL AND REALISTIC WORKFORCE RETENTION STRATEGIES, SPECIFICALLY ACROSS A HIGHLY DISTRIBUTED, ENTRY-LEVEL WORKFORCE.DEEP EXPERIENCE AND WORKING EXPERTISE IN MANAGING WORKERS' COMPENSATION AND LEAVE OF ABSENCE CASES.ADVANCED LEVEL KNOWLEDGE OF HR-RELATED REPORTING AND ANALYTICS TO INCLUDE ADVANCED WORKING KNOWLEDGE OF MICROSOFT EXCEL.ADVANCED EXPERIENCE SUCCESSFULLY MANAGING HRIS AND PAYROLL PROCESSING.SIGNIFICANT EXPERIENCE LEADING COMPREHENSIVE COMPENSATION MARKET STUDIES AND INTRODUCING REQUIRED ENHANCEMENTS TO THE ORGANIZATION.ADVANCED EXPERIENCE PARTNERING WITH EXTERNAL AND INTERNAL RESOURCES TO IDENTIFY AND INTRODUCE COMPETITIVE AND COMPREHENSIVE HEALTH AND WELLNESS BENEFITS TO AN ORGANIZATION TO INCLUDE ANNUAL OPEN ENROLLMENT.STRONG CHANGE MANAGEMENT, PROCESS MANAGEMENT AND PROJECT MANAGEMENT SKILLS.SIGNIFICANT EXPERIENCE CREATING, INTRODUCING AND MANAGING AN ORGANIZATIONAL-WIDE REWARDS AND RECOGNITION PROGRAM.EXPERIENCE DEVELOPING AND ADMINISTERING RELEVANT HR POLICIES.SIGNIFICANT EXPERIENCE IN HUMAN RESOURCES COMPLIANCE TO INCLUDE MAINTAINING ACCURATE EMPLOYEE FILES/RECORDS.EXPERIENCE SUCCESSFULLY IMPLEMENTING NEW HR TECHNOLOGY AND SYSTEMS TO AN ORGANIZATION.ADVANCED EXPERIENCE MODERNIZING AND INTRODUCING AN ORGANIZATIONAL-WIDE PERFORMANCE MANAGEMENT PROGRAM TO INCLUDE DEVELOPMENT PLANNING AND ASSOCIATED KEY PROCESSES.DEMONSTRATED EXPERIENCE IDENTIFYING AND INTRODUCING IMPACTFUL DIVERSITY, EQUITY, INCLUSION AND BELONGING PROGRAMS THAT LEAD TO STRONGER EMPLOYEE ENGAGEMENT AND RETENTION.SUBSTANTIAL EXPERIENCE ASSESSING, MANAGING, COACHING, AND DEVELOPING DIRECT REPORTS.DEEP EXPERIENCE PARTNERING CLOSELY WITH DEPARTMENT HEADS AND THE HR TEAM TO IDENTIFY KEY ENGAGEMENT DRIVERS AND DEVELOP PROGRAMS THAT ENHANCE EMPLOYEE SATISFACTION AND MOTIVATION.THE NATURAL ABILITY TO COMMAND RESPECT THROUGH FOSTERING POSITIVE RELATIONSHIPS AND PROVIDING VALUABLE GUIDANCE IN CHALLENGING SITUATIONS ACROSS ALL LEVELS OF AN ORGANIZATION.DEMONSTRATED EXPERIENCE BEING ABLE TO NAVIGATE AND RESOLVE CONFLICTS EFFECTIVELY, WHILE ALSO OFFERING INNOVATIVE SOLUTIONS TO CHALLENGES AS THEY ARISE.ADVANCED WRITTEN AND VERBAL BUSINESS COMMUNICATION SKILLS TO INCLUDE BEING HIGHLY CAPABLE OF FACILITATING WORKSHOPS TO LARGE GROUPS.A NATURAL CURIOSITY TO UNDERSTAND AN ORGANIZATION'S STRATEGIC AND OPERATIONAL PRIORITIES.WORKING KNOWLEDGE OF THE LATEST HUMAN RESOURCES TRENDS AND BEST PRACTICES.ABILITY TO WORK COLLABORATIVELY WITH THE CPO TO PLAN, LEAD, DIRECT, DEVELOP, AND COORDINATE THE POLICIES, ACTIVITIES, AND STAFF OF THE HR DEPARTMENT, ENSURING LEGAL COMPLIANCE AND IMPLEMENTATION OF THE ORGANIZATION'S MISSION AND STRATEGY.ABILITY TO MAINTAIN CONFIDENTIALITY AND DISCRETION, AS REQUIRED.RELEVANT HR CERTIFICATION DESIRED – PHR, SPHR, SHRM-CP, SHRM-SCP PREFERRED.VALID DRIVER’S LICENSE AND ACCEPTABLE DRIVING RECORD WITH THE ABILITY TO OBTAIN THE ORGANIZATION'S REQUIRED LEVELS OF COVERAGE FOR AUTO INSURANCE.THE ABILITY TO PASS A COMPREHENSIVE BACKGROUND CHECK TO INCLUDE FINGERPRINTING.THE ABILITY TO PASS A DRUG TEST IN ACCORDANCE WITH LOCAL, STATE AND FEDERAL REGULATIONS.\nESSENTIAL DUTIES AND RESPONSIBILITIES TO INCLUDE:MANAGING THE DAY-TO-DAY ORGANIZATIONAL HR SUPPORT DELIVERED BY DIRECT REPORTS, FOSTERING COMMUNICATIVE AND COLLABORATIVE RELATIONSHIPS WITH COLLEAGUES.SERVING AS A TRUSTED BUSINESS PARTNER TO THE SENIOR LEADERSHIP TEAM, ENSURING CONSISTENT AND TRANSPARENT COMMUNICATION THAT SUPPORTS STRATEGIC PRIORITIES AND BUSINESS NEEDS.LEVERAGING THE REQUIRED SKILLS NEEDED FOR THE ROLE TO PRODUCE EXCEPTIONAL RESULTS IN A VARIETY OF HR-RELATED AREAS.DEVELOPING AND IMPLEMENTING A COMPREHENSIVE EMPLOYEE ENGAGEMENT AND RETENTION STRATEGY ALIGNED WITH THE ORGANIZATION'S GOALS AND VALUES.IMPLEMENTING INITIATIVES THAT PROMOTE EMPLOYEE WELL-BEING, WORK-LIFE BALANCE, AND A SENSE OF BELONGING.CONDUCTING REGULAR SURVEYS, FOCUS GROUPS, AND ONE-ON-ONE INTERVIEWS TO GAUGE EMPLOYEE SATISFACTION AND IDENTIFY AREAS FOR IMPROVEMENT USING DATA-DRIVEN INSIGHTS TO CONTINUALLY ASSESS AND IMPROVE ENGAGEMENT STRATEGIES.OVERSIGHT OF PLANNING, COORDINATING, AND EXECUTING EMPLOYEE ACTIVITIES AND EVENTS THAT ENHANCE EMPLOYEE MORALE, SATISFACTION, AND COMMITMENT AND ALIGN TO THE STRATEGY OF CREATING A HIGHLY ENGAGED CULTURE.PROVIDING LEADERSHIP AND GUIDANCE TO A TEAM OF PROFESSIONALS DEDICATED TO EMPLOYEE ENGAGEMENT, SATISFACTION, ACCOUNTABILITY, AND RETENTION.IMPLEMENTING HUMAN RESOURCES STRATEGIES BY ESTABLISHING DEPARTMENT ACCOUNTABILITIES, INCLUDING EMPLOYMENT PROCESSING, COMMUNICATION, AND COMPENSATION PROGRAM.RESEARCHING, PROPOSING, AND MANAGING THE BENEFITS PROGRAM FOR THE ORGANIZATION, ALONG WITH THE CPO, TO ENSURE THE BEST TOTAL REWARDS ARE BEING OFFERED TO EMPLOYEES.LEADING AND MANAGING THE ANNUAL OPEN ENROLLMENT PROCESS FOR EMPLOYEE BENEFITS, WITH A CORRESPONDING COMMUNICATION STRATEGY.ENSURING COMPLIANCE WITH ALL LOCAL, STATE, AND FEDERAL LAWS, EEO AND OSHA REPORTING, AND COLLABORATING WITH THE CPO AND OUTSIDE COUNSEL AS NEEDED.DIRECT TIMELY PROCESSING OF ALL WORKER’S COMPENSATION, FMLA, LEAVES OF ABSENCE, AND UNEMPLOYMENT CLAIMS BY HR TEAM.OVERSEEING AND APPROVING ALL ASSIGNED HRIS EMPLOYEE-RELATED WORKFLOWS.MONITORING AND OVERSEEING INTERNAL AND EXTERNAL EQUITY AND HR METRICS.REMAINING ABREAST OF HUMAN RESOURCES TRENDS AND THE NON-PROFIT SECTOR THROUGH RELEVANT WEBINARS, BOOKS, ARTICLES, BLOGS, AND OTHER SOURCES.ENSURING THE ORGANIZATION COMPLIES WITH FEDERAL, STATE, AND LOCAL LEGAL REQUIREMENTS BY STUDYING EXISTING AND NEW LEGISLATION.OVERSIGHT OF MAINTAINING COMPANY ORGANIZATIONAL CHARTS AND THE EMPLOYEE DIRECTORY.MANAGING REVISIONS AND UPDATES TO THE ORGANIZATION'S EMPLOYEE HANDBOOK, AS NECESSARY.PERFORMING ALL OTHER DUTIES AS ASSIGNED.\nPHYSICAL DEMANDS & WORK ENVIRONMENT: THE PHYSICAL DEMANDS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY AN EMPLOYEE TO SUCCESSFULLY PERFORM THE ESSENTIAL FUNCTIONS OF THIS JOB. THE POSITION REQUIRES VISUAL AND AUDITORY ACUITY WITHIN PROFESSIONALLY DETERMINED NORMAL RANGES, WITH CORRECTION IF NEED; AND MANUAL DEXTERITY SUFFICIENT TO OPERATE A COMPUTER AND OFFICE EQUIPMENT, INCLUDING, BUT NOT LIMITED TO, THE TELEPHONE, COMPUTER, AND PHOTOCOPIER. THE EMPLOYEE IS OCCASIONALLY REQUIRED TO MOVE ITEMS UP TO 50 POUNDS.\nOUR CLIENT IS COMMITTED TO PROVIDING REASONABLE ACCOMMODATIONS TO QUALIFIED INDIVIDUALS WITH DISABILITIES AND ENSURING EQUAL ACCESS TO EMPLOYMENT OPPORTUNITIES. IF YOU REQUIRE ANY ACCOMMODATIONS THROUGHOUT THE HIRING PROCESS, PLEASE INFORM THE ASSIGNED RECRUITER OF YOUR NEEDS AND EVERY EFFORT WILL BE MADE TO ACCOMMODATE THEM.",
    "job_skill_set": [
      "HR Management",
      "Employee Relations",
      "HR Reporting and Analytics",
      "HRIS Management",
      "Payroll Processing",
      "Compensation Management",
      "Benefits Administration",
      "Policy Development",
      "Compliance Management",
      "Performance Management",
      "Project Management",
      "Microsoft Excel",
      "Employee Engagement Strategies",
      "Organizational Development",
      "Conflict Resolution",
      "Coaching and Development",
      "Employee Satisfaction Surveys",
      "Communication",
      "Relationship Management",
      "Leadership",
      "Problem Solving",
      "Collaboration",
      "Trustworthiness",
      "Innovation",
      "Adaptability",
      "Confidentiality",
      "Diversity, Equity, Inclusion Programs",
      "Change Management",
      "Workers' Compensation Management",
      "HR Technology Implementation",
      "Curiosity"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "analytics",
      "and",
      "benefits",
      "change",
      "coaching",
      "collaboration",
      "communication",
      "compensation",
      "compliance",
      "confidentiality",
      "conflict",
      "curiosity",
      "development",
      "director",
      "diversity",
      "employee",
      "engagement",
      "equity",
      "excel",
      "hr",
      "hris",
      "human",
      "implementation",
      "inclusion",
      "innovation",
      "leadership",
      "management",
      "microsoft",
      "organizational",
      "payroll",
      "performance",
      "policy",
      "problem",
      "processing",
      "programs",
      "project",
      "relations",
      "relationship",
      "reporting",
      "resolution",
      "resources",
      "satisfaction",
      "solving",
      "strategies",
      "surveys",
      "technology",
      "trustworthiness",
      "workers"
    ]
  },
  {
    "job_id": "3899523473",
    "job_title": "Human Resources Representative",
    "category": "HR",
    "job_description": "AKKODIS IS SEEKING A HUMAN RESOURCES REPRESENTATIVE FOR A CONTRACT POSITION WITH A CLIENT LOCATED IN AUBURN HILLS MI. IDEALLY LOOKING WHO HAS PREVIOUS EXPERIENCE IN AN AUTOMOTIVE ENVIRONMENT. \nPAY RANGE: $25 - $31.62/HOUR; (THE RATE MAY BE NEGOTIABLE BASED ON EXPERIENCE, EDUCATION, GEOGRAPHIC LOCATION, AND OTHER FACTORS. )\nHUMAN RESOURCES REPRESENTATIVE JOB SUMMARY:OBJECTIVE:THIS POSITION IS RESPONSIBLE FOR SUPPORTING AND COORDINATING HR PROGRAMS AND INITIATIVES AND SERVES AS THE INITIAL POINT OF CONTACT FOR GENERAL HR TOPICS.EFFORTS SUPPORT MANAGERS, EMPLOYEES, AND CONTRACT RESOURCES IN A FACILITY THAT HAS A WORKFORCE OF OVER 1700.ROLE RESPONSIBILITIES: LIST ESSENTIAL FUNCTIONS IN ORDER OF IMPORTANCE; INCLUDE PERCENTAGE OF TIME SPENT PERFORMING EACH FUNCTION (TOTAL SHOULD EQUAL 100%)\nHRIS AND GENERAL SUPPORT - (40%)ASSISTS EMPLOYEES WITH ISSUES REGARDING KRONOS.RESOLVES ISSUES WITH NEW HIRES REGARDING ACCESS TO SYSTEMS, PAYROLL, BENEFITS, ETC.WORKS WITH THE HRIS TEAM TO PROCESS SAP CHANGES.PROVIDES BACKUP ADMINISTRATIVE SUPPORT TO LOCAL RECRUITERS BY MAINTAINING INTERVIEWING ROOMS, GREETING/ESCORTING CANDIDATES, AND ENSURING INTERVIEW GUIDES ARE AVAILABLE FOR MANAGERS CONDUCTING INTERVIEWS.SERVES AS THE FIRST POINT OF CONTACT FOR LOCAL CAMPUS EMPLOYEES AND CONTRACTORS REGARDING GENERAL HR TOPICS AND INQUIRIES.PROVIDES SUPPORT FOR ANNUAL BONUS AND MERIT PLANNING AND OTHER HR PROJECTS AS NEEDED.UPDATES JOB DESCRIPTIONS INTO CURRENT TEMPLATES AND SAVES TO THE COMMON DRIVE.WORKS WITH HR TEAM TO POST POSITIONS\nONBOARDING AND OFFBOARDING ACTIVITIES - (20%)CONDUCTS LOCAL CAMPUS NEW HIRE ORIENTATION FOR INCOMING FTES AND INTERNS, PREPARES NEW HIRE AND PERSONNEL ANNOUNCEMENTS, AND COMPLETES I-9 FORMS.ENSURES COMPLETION OF NEW HIRE PAPERWORK AND CREATES SAP POSITION NUMBERS.PROCESSES TERMINATION PAPERWORK INCLUDING PAYROLL TERMINATION CHECKLIST, SAP DATA CHANGE FORM, AND TERMINATION VEHICLE CHECKLIST.PREPARES AND SENDS TERMINATION INFORMATION EMAILS TO SEPARATING EMPLOYEES.\nYEARS OF EXPERIENCE: MINIMUM YEARS OF EXPERIENCE NEEDED3-5 EXPERIENCE IN A CORPORATE ENVIRONMENT PREFERRED (HUMAN RESOURCES) \nEDUCATION/SKILL SETDESIRED (NOT REQUIRED)BACHELOR'S DEGREE IN HUMAN RESOURCES OR EQUIVALENTEXPERIENCE WORKING IN AN AUTOMOTIVE ENVIRONMENT (STRONGLY DESIRED)\nSPECIALIZED SKILLS: KNOWLEDGE OR CERTIFICATIONS UNIQUE TO THIS ROLE (REQUIRED):ABILITY TO MULTI-TASK AND HANDLE BOTH OPERATIONAL AND PROJECT MANAGEMENT REQUIREMENTS SIMULTANEOUSLY\nDESIREDHUMAN RESOURCES PROFESSIONAL CERTIFICATION\nIF YOU ARE INTERESTED IN THIS ROLE, THEN PLEASE CLICK APPLY NOW. FOR OTHER OPPORTUNITIES AVAILABLE AT AKKODIS, OR ANY QUESTIONS, PLEASE CONTACT NANDAKINI SAJWAN AT 610-484 2192 OR NANDAKINI.SAJWAN@AKKODISGROUP.COM\nEQUAL OPPORTUNITY EMPLOYER/VETERANS/DISABLEDBENEFIT OFFERINGS INCLUDE MEDICAL, DENTAL, VISION, TERM LIFE INSURANCE, SHORT-TERM DISABILITY INSURANCE, ADDITIONAL VOLUNTARY BENEFITS, COMMUTER BENEFITS, AND A 401K PLAN. OUR PROGRAM PROVIDES EMPLOYEES THE FLEXIBILITY TO CHOOSE THE TYPE OF COVERAGE THAT MEETS THEIR INDIVIDUAL NEEDS. AVAILABLE PAID LEAVE MAY INCLUDE PAID SICK LEAVE, WHERE REQUIRED BY LAW; ANY OTHER PAID LEAVE REQUIRED BY FEDERAL, STATE, OR LOCAL LAW; AND HOLIDAY PAY UPON MEETING ELIGIBILITY CRITERIA.DISCLAIMER: THESE BENEFIT OFFERINGS DO NOT APPLY TO CLIENT-RECRUITED JOBS AND JOBS WHICH ARE DIRECT HIRES TO A CLIENT. TO READ OUR CANDIDATE PRIVACY INFORMATION STATEMENT, WHICH EXPLAINS HOW WE WILL USE YOUR INFORMATION, PLEASE VISIT HTTPS://WWW.AKKODIS.COM/EN/PRIVACY-POLICY. THE COMPANY WILL CONSIDER QUALIFIED APPLICANTS WITH ARREST AND CONVICTION RECORDS.",
    "job_skill_set": [
      "Onboarding",
      "Interview Coordination",
      "Data Entry",
      "Communication",
      "Multi-tasking",
      "Problem Solving",
      "Teamwork",
      "Attention to Detail",
      "Adaptability",
      "HRIS",
      "Kronos",
      "SAP",
      "Offboarding",
      "Human Resources Certification",
      "Project Management",
      "Customer Service"
    ],
    "short_keywords": [
      "adaptability",
      "attention",
      "certification",
      "communication",
      "coordination",
      "customer",
      "data",
      "detail",
      "entry",
      "hr",
      "hris",
      "human",
      "interview",
      "kronos",
      "management",
      "multitasking",
      "offboarding",
      "onboarding",
      "problem",
      "project",
      "representative",
      "resources",
      "sap",
      "service",
      "solving",
      "teamwork",
      "to"
    ]
  },
  {
    "job_id": "3903896684",
    "job_title": "Human Resources Business Partner",
    "category": "HR",
    "job_description": "DESCRIPTION\n\nJOB DESCRIPTION\n\nPEACEHEALTH IS SEEKING AN HR BUSINESS PARTNER TO SERVE AS A CONSULTANT AND TRUSTED ADVISOR TO BUSINESS UNITS, LEADERS AND CAREGIVERS ON CULTURE AND PEOPLE STRATEGIES RELATED TO IMPROVING ORGANIZATIONAL EFFECTIVENESS AND SUCCESS. THIS INCLUDES PROACTIVELY IDENTIFYING ORGANIZATIONAL ISSUES, ASSESSING THE IMPACT OF SERVICE-LINE STRATEGIES ON THE ORGANIZATION AND DESIGNING AND IMPLEMENTING INNOVATIVE AND CREATIVE SOLUTIONS WITH SPECIAL EMPHASIS ON CULTURE AND PEOPLE SOLUTIONS THAT ALIGN ORGANIZATIONAL STRATEGIES WITH THE MISSION AND KEY OBJECTIVES. SERVES AS A MENTOR AND GUIDE FOR LEADERSHIP WITHIN THE SERVICE LINES.\n\nWHAT YOU WILL ENJOY:\n\nPROVIDING STRATEGIC PARTNERSHIP AND INPUT TO LEADERS REGARDING OVERALL CULTURE AND PEOPLE STRATEGIES THAT SUPPORT THE CULTURE, MINISTRY, AND STRATEGIC DIRECTION OF THE ORGANIZATION, INCLUDING THE GROWTH OF THE ORGANIZATION AND ALIGNMENT OF CAREGIVERS.PARTNERING WITH OPERATING UNIT AND/OR SERVICE LINE LEADERSHIP TO ASSESS THE EFFECTIVENESS OF THE PEOPLE STRATEGIES RELATED TO OPERATIONS. DESIGNING AND IMPLEMENTING TAILORED SOLUTIONS TO SUPPORT THE ORGANIZATION IN DELIVERING RESULTS THAT ARE ALIGNED WITH THE MISSION, STRATEGIES, AND ORGANIZATIONAL GOALS. THIS INCLUDES IDENTIFYING AND ASSESSING THE LEADERSHIP, CAREGIVER AND TEAM SKILLS, COMPETENCIES AND STRUCTURES NEEDED TO DELIVER ON STRATEGIES; CONSULTING WITH LEADERS ON HOW TO DEVELOP AND/OR REALIGN TO MEET THOSE CAPABILITIES; AND MONITORING PROGRESS TO GOALS. THE HR PARTNER HAS A SHARED RESPONSIBILITY WITH THE SERVICE LINE LEADERSHIP FOR ACHIEVEMENT OF DESIRED RESULTS.USING DATA AND EFFECTIVE RELATIONSHIPS WITH STRATEGIC PARTNERS WITHIN THE ORGANIZATION (QUALITY, FINANCE, PEOPLE, ETC.) TO BOTH ASSESS CURRENT STATE OF OPERATIONS AND TO MONITOR SERVICE LINE PROGRESS TO GOALS.FACILITATING DIALOGUE AND SERVES AS A CHAMPION FOR ORGANIZATIONAL CULTURE AND STRATEGIES (EXAMPLES INCLUDE CULTURE OF ENGAGEMENT, SAFETY, COMPASSION, ETC.)ASSESSING AND IDENTIFIES AREAS REQUIRING INTERVENTION AND PROVIDES ORGANIZATIONAL DEVELOPMENT, MEDIATION, CHANGE MANAGEMENT AND CONFLICT RESOLUTION SUPPORT TO LEADERSHIP.BUILDING STRONG AND TRUSTING RELATIONSHIPS WITH LEADERSHIP AND CAREGIVERS. SUPPORTING AND ENCOURAGING CAREGIVERS IN LINKING THEIR DAY TO-DAY WORK WITH PEACEHEALTH’S MISSION AND VALUES.PROVIDING EXPERT ADVICE, COACHING, AND COUNSEL TO LEADERS AND CAREGIVERS ON CULTURE AND PEOPLE PROGRAMS, POLICY AND PROCEDURES, EMPLOYMENT/LABOR LAWS, COMMUNICATION & CONFLICT RESOLUTION, INSPIRATION & ENGAGEMENT, FORMATION & DEVELOPMENT, CHANGE MANAGEMENT, DIVERSITY/INCLUSION, ETHICS & AND ORGANIZATIONAL DEVELOPMENT AND DESIGN IN ALIGNMENT WITH OUR MISSION AND STRATEGIC PRIORITIES.IN CONSULTATION WITH CULTURE AND PEOPLE LEADERSHIP, COLLABORATING FOR APPROPRIATE OUTCOMES WITH LEADERSHIP, CENTERS OF EXPERTISE AND THE CAREGIVER RESOURCE CENTER WHICH BALANCE CAREGIVER NEEDS, POLICIES, PROCEDURES, COMPLIANCE WITH REGULATORY STANDARDS AND PEACEHEALTH MISSION, VALUES, AND STRATEGIES.\n\nQUALIFICATIONS (REQUIRED UNLESS OTHERWISE STATED)\n\nBACHELOR'S DEGREE OR EQUIVALENT KNOWLEDGE AND SKILLS OBTAINED THROUGH A COMBINATION OF EDUCATION, TRAINING AND EXPERIENCE.MASTER'S DEGREE PREFERREDMINIMUM OF 4 YEARS HUMAN RESOURCES EXPERIENCE.RECENT EXPERIENCE IN THE HEALTHCARE INDUSTRY, INCLUDING AN UNDERSTANDING OF A SHARED SERVICES ORGANIZATION PREFERRED.EXPERIENCE WITH PROGRESSIVE DEVELOPMENT/KNOWLEDGE OF COMPLEX HUMAN RESOURCES SERVICE LINE SUPPORT IN A COE MODEL.STRONG EMPLOYEE AND LABOR RELATIONS EXPERIENCE MANAGING COMPLEX INVESTIGATIONS, GRIEVANCES AND IMPACT BARGAINING PARTICIPATION PREFERRED.CERTIFIED PROFESSIONAL HUMAN RESOURCES OR CERTIFIED SENIOR PROFESSIONAL HUMAN RESOURCES PREFERRED.\n\nADDITIONAL SKILLS:\n\nKNOWLEDGE OF REGULATORY COMPLIANCE, FEDERAL AND STATE LAWS WITH A WORKING KNOWLEDGE OF MULTIPLE HUMAN RESOURCE DISCIPLINES.KNOWLEDGE OF EMPLOYEE & LABOR RELATIONS.MEDIATION AND CONFLICT RESOLUTIONS SKILLS.INVESTIGATION SKILLS.KNOWLEDGE OF ORGANIZATIONAL AND TEAM DYNAMICS AND METHODS TO SUPPORT CONTINUED IMPROVEMENT IN THESE AREAS.ABILITY TO DEVELOP AND PRESENT CONCISE INFORMATION.EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS.UNDERSTANDING OF OPERATIONS WITHIN THE HEALTHCARE INDUSTRY PREFERRED.ABILITY TO IDENTIFY, UTILIZE AND INTERPRET WORKFORCE-RELATED METRICS.PROFICIENT IN THE USE OF MS OFFICE APPLICATION AS REQUIRED.PROFICIENT IN THE USE OF A MAJOR HRIS SOLUTION PREFERRED.\n\nWORKING CONDITIONS\n\nCONSISTENTLY OPERATES COMPUTER AND OTHER OFFICE EQUIPMENT.EXERTING UP TO 10 POUNDS OF FORCE OCCASIONALLY AND/OR NEGLIGIBLE AMOUNT OF FORCE FREQUENTLY OR CONSTANTLY TO LIFT, CARRY, PUSH, PULL OR OTHERWISE MOVE OBJECTS.SEDENTARY WORK.PREDOMINANTLY OPERATES IN AN OFFICE ENVIRONMENT.SOME TIME SPENT ON SITE IN MEDICAL/HOSPITAL SETTING.ABILITY TO COMMUNICATE AND EXCHANGE ACCURATE INFORMATION.THE WORKER IS REQUIRED TO HAVE CLOSE VISUAL ACUITY TO PERFORM AN ACTIVITY SUCH AS: PREPARING AND ANALYZING DATA AND FIGURES; TRANSCRIBING; VIEWING A COMPUTER TERMINAL; EXTENSIVE READING.\n\nAT PEACEHEALTH, WE CARRY ON THE HEALING MISSION OF JESUS CHRIST BY PROMOTING PERSONAL AND COMMUNITY HEALTH, RELIEVING PAIN AND SUFFERING, AND TREATING EACH PERSON IN A LOVING AND CARING WAY. THE FULFILLMENT OF THIS MISSION IS OUR SHARED PURPOSE. IT DRIVES ALL THAT WE ARE AND ALL THAT WE DO. CAREGIVERS OF PEACEHEALTH EMBRACE THE SPIRIT OF THESE WORDS AND SHARE OUR COMMITMENT TO EXCEPTIONAL MEDICINE AND COMPASSIONATE CARE, AND ARE WILLING TO LEARN AND GROW AS A MEMBER OF THE PEACEHEALTH FAMILY.\n\nPEACEHEALTH IS SEEKING A HR PARTNER FOR A FULL TIME, 1.00 FTE, DAY POSITION. THE GENERAL SALARY RANGE FOR THIS JOB OPENING AT PEACEHEALTH IS $43.16 – $64.75. THE ACTUAL HIRING RATE IS DEPENDENT UPON SEVERAL FACTORS, INCLUDING BUT NOT LIMITED TO, THE JOB/POSITION RESPONSIBILITIES, LOCATION, TERMS OF THE APPLICABLE COLLECTIVE BARGAINING AGREEMENT, EDUCATION, TRAINING, WORK EXPERIENCE, SENIORITY, WORK PERFORMANCE, ETC.\n\nDISCLAIMER:\n\nTHE ABOVE INFORMATION ON THIS DESCRIPTION HAS BEEN DESIGNED TO INDICATE THE GENERAL NATURE AND LEVEL OF WORK PERFORMED WITHIN THIS JOB CLASS. IT IS NOT DESIGNED TO CONTAIN OR BE INTERPRETED AS A COMPREHENSIVE INVENTORY OF ALL DUTIES, RESPONSIBILITIES, AND QUALIFICATIONS REQUIRED OF CAREGIVERS ASSIGNED TO THIS JOB.\n\nPEACEHEALTH IS COMMITTED TO THE OVERALL WELLBEING OF OUR CAREGIVERS: PHYSICAL, EMOTIONAL, FINANCIAL, SOCIAL, AND SPIRITUAL. WE OFFER CAREGIVERS A COMPETITIVE AND COMPREHENSIVE TOTAL REWARDS PACKAGE. SOME OF THE MANY BENEFITS INCLUDED IN THIS PACKAGE ARE FULL MEDICAL/DENTAL/VISION COVERAGE; 403B RETIREMENT PLAN EMPLOYER BASE AND MATCHING CONTRIBUTIONS; PAID TIME OFF; EMPLOYER-PAID LIFE AND DISABILITY INSURANCE WITH ADDITIONAL BUYUP COVERAGE OPTIONS; TUITION AND CONTINUING EDUCATION REIMBURSEMENT; WELLNESS BENEFITS, AND EXPANDED EAP AND MENTAL HEALTH PROGRAM.\n\nSEE HOW PEACEHEALTH IS COMMITTED TO\n\nFOR FULL CONSIDERATION OF YOUR SKILLS AND ABILITIES, PLEASE ATTACH A CURRENT RESUME WITH YOUR APPLICATION. EEO AFFIRMATIVE ACTION EMPLOYER/VETS/DISABLED IN ACCORDANCE WITH APPLICABLE LOCAL, STATE OR FEDERAL LAWS.\n\nPEACEHEALTH REQUIRES A COMPLETED PRIMARY VACCINE SERIES (E.G., 2 DOSE MONOVALENT PFIZER, MODERNA OR NOVAVAX SERIES OR 1 DOSE J&J VACCINE SERIES) OR BE UP TO DATE (RECEIVING THE MOST RECENT PFIZER/MODERNA BIVALENT VACCINE/BOOSTER) FOR COVID-19 VACCINATION PRIOR TO THEIR START DATE. PEACEHEALTH HAS A MEDICAL AND RELIGIOUS EXEMPTION REQUEST PROCESS FOR THOSE THAT ARE UNABLE TO RECEIVE THE COVID-19 PRIMARY VACCINE SERIES DUE TO MEDICAL/RELIGIOUS REASONS. FOR CAREGIVERS THAT WILL BE WORKING IN OREGON THERE IS A PERSONAL VACCINE EXEMPTION FORM THAT MAY BE REQUESTED.",
    "job_skill_set": [
      "human resources",
      "organizational development",
      "data analysis",
      "conflict resolution",
      "employee relations",
      "regulatory compliance",
      "HRIS",
      "MS Office",
      "team dynamics",
      "communication",
      "leadership",
      "strategic thinking",
      "relationship building",
      "coaching",
      "problem solving",
      "mentoring",
      "adaptability",
      "collaboration",
      "change management",
      "mediation",
      "investigation",
      "cultural awareness"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "awareness",
      "building",
      "business",
      "change",
      "coaching",
      "collaboration",
      "communication",
      "compliance",
      "conflict",
      "cultural",
      "data",
      "development",
      "dynamics",
      "employee",
      "hr",
      "hris",
      "human",
      "investigation",
      "leadership",
      "management",
      "mediation",
      "mentoring",
      "ms",
      "office",
      "organizational",
      "partner",
      "problem",
      "regulatory",
      "relations",
      "relationship",
      "resolution",
      "resources",
      "solving",
      "strategic",
      "team",
      "thinking"
    ]
  },
  {
    "job_id": "3884432431",
    "job_title": "Human Resource Manager",
    "category": "HR",
    "job_description": "JOHNSON FEED, INC. IS A FAMILY OWNED AND OPERATED BUSINESS WITH 320 EMPLOYEES AND FIVE LOCATIONS ACROSS SD AND IA. WE OFFER A COMPLETE BENEFITS PACKAGE INCLUDING COMPETITIVE PAY, HEALTH INSURANCE, 401(K) WITH EMPLOYER MATCH, PROFIT SHARING, PAID TIME OFF, PAID HOLIDAYS, AND MORE.\nWE ARE AN EQUAL OPPORTUNITY EMPLOYER. \nTHIS POSITION REQUIRES FULL-TIME ON-SITE PRESENCE IN OUR CANTON, SD OFFICE.\nAPPLY THROUGH LINKEDIN OR EMAIL YOUR RESUME TO JOSIEJ@JOHNSONFEEDINC.COM.\nJOB SUMMARYTHE HUMAN RESOURCE MANAGER IS RESPONSIBLE FOR DIRECTING, PLANNING, DEVELOPING, IMPLEMENTING, AND ADMINISTRATING MOST OR ALL OF THE HUMAN RESOURCE FUNCTIONS, INCLUDING BUT NOT LIMITED TO RECRUITMENT, ONBOARDING, EMPLOYEE RELATIONS, EMPLOYEE BENEFITS, EMPLOYEE LEAVES OF ABSENCE, AND COMPLIANCE WITH FEDERAL AND STATE HR LAWS.\nRESPONSIBILITIESDEVELOP, RECOMMEND, AND IMPLEMENT PERSONNEL POLICIES AND PROCEDURES; PREPARE AND MAINTAIN EMPLOYEE HANDBOOK(S)ASSIST IN DEVELOPING AND IMPLEMENTING A STRATEGIC RECRUITMENT PLAN TO ENSURE THE SELECTION OF HIGHLY QUALIFIED DRIVERSDEVELOP, RECOMMEND, AND IMPLEMENT HIRING AND ONBOARDING PROCESSES TO ENSURE THE ORGANIZATION ATTRACTS, SELECTS, AND INTEGRATES TALENT EFFECTIVELY AND EFFICIENTLYCOORDINATE DAILY BENEFITS PROCESSING, INCLUDING BUT NOT LIMITED TO ENROLLMENTS, TERMINATIONS, EVENT CHANGES, BENEFICIARY ELECTIONS, AND DISABILITY CLAIMSMANAGE END-TO-END PAYROLL PROCESSING FOR A SUBSET OF OUR EMPLOYEESCOORDINATE EMPLOYEE LEAVES OF ABSENCE, INCLUDING BUT NOT LIMITED TO WORKERS' COMPENSATION, FMLA, AND ADA LEAVESENSURE COMPLIANCE WITH ALL COMPANY AND GOVERNMENT REGULATORY STANDARDSPROVIDE COMPREHENSIVE HUMAN RESOURCE SUPPORT TO LEADERSHIP TEAM\nJOB REQUIREMENTSBACHELOR’S DEGREE5+ YEARS' OF RELATED HUMAN RESOURCE EXPERIENCEKNOWLEDGE OF EMPLOYMENT LAW AND EMPLOYEE BENEFIT ADMINISTRATIONDEMONSTRATED STRATEGIC, CRITICAL, ANALYTICAL AND INNOVATIVE THINKING SKILLSPROFICIENT IN MICROSOFT OFFICE SUITERECRUITMENT EXPERIENCE IS PREFERRED BUT NOT REQUIREDKNOWLEDGE OF THE TRUCKING INDUSTRY IS PREFERRED BUT NOT REQUIRED",
    "job_skill_set": [
      "human resource management",
      "employee benefits administration",
      "recruitment",
      "Microsoft Office Suite",
      "strategic planning",
      "analytical thinking",
      "compliance management",
      "onboarding processes",
      "communication",
      "problem solving",
      "critical thinking",
      "innovative thinking",
      "team leadership",
      "interpersonal skills",
      "employment law",
      "payroll processing"
    ],
    "short_keywords": [
      "administration",
      "analytical",
      "benefits",
      "communication",
      "compliance",
      "critical",
      "employee",
      "employment",
      "hr",
      "human",
      "innovative",
      "interpersonal",
      "law",
      "leadership",
      "management",
      "manager",
      "microsoft",
      "office",
      "onboarding",
      "payroll",
      "planning",
      "problem",
      "processes",
      "processing",
      "recruitment",
      "resource",
      "skills",
      "solving",
      "strategic",
      "suite",
      "team",
      "thinking"
    ]
  },
  {
    "job_id": "3904373238",
    "job_title": "Human Resources Generalist",
    "category": "HR",
    "job_description": "AT THE HEART OF VIBRANT COMMUNITIES, OUR COMPANY IS NOT JUST A REAL ESTATE LEADER; WE'RE A TEAM DEDICATED TO EXTRAORDINARY PROPERTY MANAGEMENT AND A MISSION TO SERVE. WE'RE ON THE LOOKOUT FOR AN EXCEPTIONAL HR GENERALIST, SOMEONE WITH A KNACK FOR PAYROLL AND A HISTORY OF MAKING THINGS RUN SMOOTHLY. IF YOU'RE PASSIONATE ABOUT PROVIDING IMPECCABLE SERVICE AND KEEN ON MAKING A REAL IMPACT, WE'RE TALKING TO YOU.WHAT YOU'LL DO:MASTER PAYROLL: ENSURE EVERYONE GETS PAID CORRECTLY AND ON TIME, NAVIGATE THROUGH THE MAZE OF REGULATIONS WITH EASE, AND BE THE GO-TO FOR ANY PAYROLL PUZZLES.ELEVATE HR OPERATIONS: FROM WELCOMING NEW FACES TO BIDDING FAREWELL, MANAGING BENEFITS, AND KEEPING RECORDS SPOTLESS – YOU'RE THE BACKBONE OF THE TEAM.NAVIGATE COMPLIANCE: KEEP US AHEAD OF THE CURVE ON EMPLOYMENT LAWS, GUIDE THROUGH THE TWISTS AND TURNS OF HR POLICIES, AND HANDLE THE TRICKY STUFF WITH GRACE.MANAGE VENDOR RELATIONS: BE THE HERO LIAISON FOR OUR HR OUTSOURCING AND SERVICES, ENSURING SMOOTH SAILING AND TOP-NOTCH SUPPORT.ANALYZE AND REPORT: DIVE INTO DATA, DRAW INSIGHTS, AND REPORT BACK ON HOW WE CAN GROW STRONGER, TOGETHER.WHO YOU ARE:YOU'VE SPENT 4+ YEARS IN HR, WITH YOUR HANDS DEEP IN PAYROLL INTRICACIES.YOU'RE A WIZARD WITH PAYROLL/HRIS SYSTEMS LIKE ADP, PAYCHEX, OR WORKDAY.NAVIGATING PAYROLL LAWS IS YOUR SECOND NATURE.REAL ESTATE SECTOR EXPERIENCE? THAT'S A GOLDEN STAR ON YOUR RESUME.DETAIL-ORIENTED, A COMMUNICATION ACE, AND A CONFIDENTIALITY CHAMPION.YOU'RE A MICROSOFT OFFICE MAESTRO AND MAYBE EVEN HAVE SOME HR CERTIFICATIONS UP YOUR SLEEVE.WHY JOIN US?THIS IS MORE THAN A JOB – IT'S A CHANCE TO SHAPE VIBRANT COMMUNITIES AND PLAY A PIVOTAL ROLE IN A LEADING REAL ESTATE COMPANY. WE OFFER NOT JUST A JOB, BUT A JOURNEY IN INNOVATION, EXCELLENCE, AND INTEGRITY. IF YOU'RE DRIVEN, SKILLED IN HR AND PAYROLL, AND READY TO MAKE A REAL DIFFERENCE IN THE REAL ESTATE WORLD, YOUR SEARCH ENDS HERE.EXCITED? WE THOUGHT YOU MIGHT BE. DIVE INTO THIS JOURNEY WITH US AND LET'S CREATE SOMETHING GREAT TOGETHER. APPLY NOW TO BE PART OF OUR DYNAMIC TEAM AND LEAVE YOUR MARK ON THE REAL ESTATE SECTOR.",
    "job_skill_set": [
      "payroll",
      "HRIS systems",
      "compliance",
      "data analysis",
      "Microsoft Office",
      "record keeping",
      "communication",
      "attention to detail",
      "confidentiality",
      "problem solving",
      "teamwork",
      "customer service",
      "adaptability",
      "HR certifications",
      "vendor management",
      "employment laws",
      "real estate experience"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "attention",
      "certifications",
      "communication",
      "compliance",
      "confidentiality",
      "customer",
      "data",
      "detail",
      "employment",
      "estate",
      "experience",
      "generalist",
      "hr",
      "hris",
      "human",
      "keeping",
      "laws",
      "management",
      "microsoft",
      "office",
      "payroll",
      "problem",
      "real",
      "record",
      "resources",
      "service",
      "solving",
      "systems",
      "teamwork",
      "to",
      "vendor"
    ]
  },
  {
    "job_id": "3900945008",
    "job_title": "Senior Human Resources Manager",
    "category": "HR",
    "job_description": "LOCATION; WISCONSIN\n\nOVERVIEW\n\nOUR CLIENT, A FORTUNE 100 FIRM EMPLOYING WELL OVER 200,000 PEOPLE IN OVER 200 SITES WORLDWIDE IS SEEKING A SENIOR HUMAN RESOURCES MANAGER. THE IDEAL CANDIDATE WILL PROVIDE STRATEGIC COUNSELING TO THE LEADERSHIP TEAM ON ALL ASPECTS OF HUMAN RESOURCES. HE/SHE WILL IMPLEMENT, MANAGE, AND OVERSEE OF A WIDE RANGE OF HUMAN RESOURCES PROGRAMS ACROSS ALL SHIFTS AND 300 + EMPLOYEE MANUFACTURING FACILITY; INCLUDING BUT NOT LIMITED TO EMPLOYEE RELATIONS, BENEFITS, RECRUITING, HUMAN RESOURCE INFORMATION SYSTEMS, COMPENSATION, TRAINING, EMPLOYEE RETENTION AND COMPLIANCE WITH ALL APPLICABLE LAWS.\n\nTHE SR. HR MANAGER WILL ASSIST THE PLANT MANAGER AND THE CORPORATE HUMAN RESOURCE TEAM WITH THE CREATION AND IMPLEMENTATION OF STRATEGIC HR PROGRAMS FOR THE PLANT. THIS POSITION REPORTS TO THE PLANT MANAGER AND WILL PLAY AN INTEGRAL ROLE ON THE SITE MANAGEMENT TEAM IN HELPING TO ACHIEVE BUSINESS GOALS AND OBJECTIVES. WILL WORK CLOSELY WITH THE CENTRAL HR TEAM TO ENSURE THAT THE COMPANY PRINCIPALS AND POLICIES ARE MAINTAINED THROUGH THE SITE.\n\nRESPONSIBILITIES\n\nPROVIDING STRATEGIC COUNSELING TO THE PLANT LEADERSHIP TEAM ON VARIOUS HUMAN RESOURCES TOPICS TO SUPPORT MOVING THE BUSINESS FORWARD. YOU WILL BE RESPONSIBLE FOR THE SUCCESS OF EMPLOYEE RELATIONS, RECRUITMENT AND STAFFING AT ALL LEVELS, WORKFORCE PLANNING, BENEFIT ADMINISTRATION, HOURLY AND NON-EXEMPT PAY SYSTEMS, HUMAN RESOURCE INFORMATION SYSTEMS, COMMUNICATIONS, TRAINING AND DEVELOPMENT, DISCIPLINE, DIVERSITY PROGRAMS AND COMMUNITY RELATIONS WITH THE ASSISTANCE FROM THE HR TEAM. RESPONSIBLE FOR THE WAGE, SALARY, BENEFITS AND FOR OVERSEEING THE ANNUAL PROCESSES FOR EXEMPT, NON-EXEMPT AND HOURLY EMPLOYEES FOR MERIT AND BONUS.\n\nLEAD THE DEVELOPMENT, DISSEMINATION AND INTERPRETATION OF PERSONNEL POLICIES AND THEIR IMPLEMENTATION AT THE SITE, PROVIDING CONSULTATION TO THE MANAGEMENT TEAM ON LEADERSHIP INITIATIVES. ENSURE THAT POLICIES ARE APPLIED IN A CONSISTENT MANNER TO ENSURE REDUCTION OF RISK FOR THE COMPANY AND THE EMPLOYEE. PROVIDE INDEPENDENT INSIGHT INTO THE IMPACT OF SUCH INITIATIVES ON PERSONNEL.\n\nOVERSEE THE DEVELOPMENT OF A TRAINING PROCEDURE FOR THE SITE WITH THE TRAINING AND DEVELOPMENT MANGER TO ESTABLISH AND MAINTAIN ASSOCIATED TRAINING DOCUMENTATION. WORK WITH MANAGEMENT TEAM TO DEVELOP AND DELIVER REQUIRED TRAINING AND EMPLOYEE GROWTH PROGRAMS FOR NEW AND EXISTING EMPLOYEES.\n\nCOMMUNICATE AND COORDINATE THE DELIVERY OF BENEFITS TO SITE PERSONNEL.\n\nOVERSEE THE EMPLOYMENT PROCESS INCLUDING RECRUITMENT, SELECTION, PLACEMENT, DEVELOPMENT, COMPENSATION, CORRECTIVE ACTION, DISCIPLINE, AND TERMINATION, INCLUDING THE USE OF TEMPORARY EMPLOYEES. COORDINATE THE EMPLOYEE PERFORMANCE APPRAISAL, MERIT INCREASE AND ANNUAL INCENTIVE PROGRAMS.\n\nREQUIREMENTS\n\nEXPERIENCE\n\n10+ YEARS’ EXPERIENCE IN HUMAN RESOURCES WITHIN MANUFACTURING 4+ YEARS’ EXPERIENCE WITHIN HR MANAGEMENT/LEADERSHIP CAPACITY TRAVEL FOR TRAINING AND BUSINESS MEETINGS, UP TO 10% \n\nEDUCATION\n\nBACHELOR’S DEGREE IN HUMAN RESOURCES OR A RELATED FIELD. MBA (OR EQUIVALENT), PREFERRED \n\nTHE CLIENT OFFERS A COMPETITIVE SALARY PACKAGE THAT IS DEPENDENT ON QUALIFICATIONS AND EXPERIENCE, AS WELL AS A STRONG BENEFIT PACKAGE, PLUS PARTICIPATION IN A COMPANY-WIDE BONUS PLAN. FOR IMMEDIATE CONSIDERATION AND FASTER RESPONSE, PLEASE FORWARD CURRENT RESUME TO: SB@SCIENTIFICSEARCH.COM. PLEASE INCLUDE JOB #18641 IN SUBJECT LINE. PLEASE NOTE THAT ALL CANDIDATES APPLYING MUST BE A US CITIZEN OR PERMANENT RESIDENT. CLIENT WILL NOT SPONSOR.\n\n#IND\n\n",
    "job_skill_set": [
      "human resources management",
      "employee relations",
      "recruitment",
      "training and development",
      "compensation management",
      "HR information systems",
      "workforce planning",
      "policy development",
      "compliance",
      "performance appraisal",
      "communication",
      "leadership",
      "problem solving",
      "teamwork",
      "consultation",
      "insight",
      "adaptability",
      "benefit administration",
      "strategic counseling",
      "community relations",
      "diversity awareness"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "and",
      "appraisal",
      "awareness",
      "benefit",
      "communication",
      "community",
      "compensation",
      "compliance",
      "consultation",
      "counseling",
      "development",
      "diversity",
      "employee",
      "hr",
      "human",
      "information",
      "insight",
      "leadership",
      "management",
      "manager",
      "performance",
      "planning",
      "policy",
      "problem",
      "recruitment",
      "relations",
      "resources",
      "senior",
      "solving",
      "strategic",
      "systems",
      "teamwork",
      "training",
      "workforce"
    ]
  },
  {
    "job_id": "3901983432",
    "job_title": "District Human Resources Manager (Pensacola)",
    "category": "HR",
    "job_description": "POSITION SUMMARY\n\nWE ARE EXCITED TO LAUNCH A NEW POSITION, DISTRICT HUMAN RESOURCES MANAGER, TO SUPPORT OUR DISTRICT FIELD TEAMS AND COLLABORATE WITH LEADERSHIP TO EXECUTE AND IMPLEMENT HUMAN CAPITAL STRATEGY. AT PENSKE, WE LOOK FOR DEDICATED INDIVIDUALS WHO THRIVE IN A COLLABORATIVE ENVIRONMENT. IF YOU HAVE HR FUNCTIONAL EXPERIENCE AND SKILLS, E.G., MANAGING ASSOCIATE PERFORMANCE, LEADING DIFFICULT DISCUSSIONS, DEVELOPING ASSOCIATES, ABILITY TO ANTICIPATE EVOLVING BUSINESS, WE ARE INTERESTED IN HEARING FROM YOU, INCLUDING IF THIS EXPERIENCE WAS GAINED DURING TIME SPENT IN A PENSKE OPERATIONAL ROLE.\n\nTHE DISTRICT HUMAN RESOURCES MANAGER IS A VALUED MEMBER OF THE HUMAN RESOURCES AND FIELD OPERATIONS TEAMS, REPORTING DIRECTLY TO THE DISTRICT MANAGER, WITH A DOTTED LINE TO THE AREA HUMAN RESOURCES MANAGER WHO ALIGNS WITH FIELD OPERATIONS AND CORPORATE HR. THIS POSITION WILL BE AN IMPORTANT MEMBER OF THE DISTRICT LEADERSHIP TEAM SUPPORTING A DISTRICT COMPRISED OF X NUMBER LOCATIONS ACROSS A GEOGRAPHY THAT INCLUDES (HIGHLIGHT A FEW KEY CITIES IN THE DISTRICT).\n\nIN THIS ROLE, YOU WILL COLLABORATE WITH THE DISTRICT LEADERSHIP TEAM TO FOSTER A CULTURE OF ENGAGEMENT WHERE ALL ASSOCIATES FEEL SUPPORTED TO DO THEIR BEST WORK AND ENJOY A SENSE OF PRIDE AND COMMITMENT. THIS ROLE WILL TAILOR REGIONAL HUMAN CAPITAL PLANS TO ENABLE AN ENGAGED WORKFORCE TO MEET THE NEEDS OF CUSTOMERS. IN THIS ROLE, YOU WILL IMPLEMENT HR PRACTICES AND PROCESSES THAT ALIGN WITH ORGANIZATIONAL INITIATIVES ACROSS A DEFINED DISTRICT, MITIGATING RISK AND ENSURING COMPLIANCE.\n\nWORK LOCATION: 8795 ELY RD. PENSACOLA, FL, US\n\nMAJOR RESPONSIBILITIES:\n\nRETENTION AND NEW ASSOCIATE EXPERIENCE\n\n ADMINISTER AND FACILITATE THE DISTRICT’S NEW ASSOCIATE EXPERIENCE ONBOARDING PROGRAM. LEAD, COACH, AND SUPPORT THE ONBOARDING AMBASSADORS THROUGHOUT THE DISTRICT. SUPPORT AND TRAIN MANAGERS TO ENSURE THE NEW ASSOCIATES ARE PROVIDED THE APPROPRIATE SUPPORT DURING THEIR ONBOARDING EXPERIENCE. IDENTIFY TRENDS AND AREAS FOR IMPROVEMENT WITH INFORMATION GAINED FROM THE ONBOARDING PROGRAM, EXIT INTERVIEWS, ASSOCIATE FEEDBACK, ETC. IDENTIFY AND PROPOSE SOLUTIONS TO ADDRESS LOCAL RETENTION CHALLENGES IN COLLABORATION WITH YOUR AREA HUMAN RESOURCES MANAGER AND DISTRICT MANAGER.\n\nTALENT MANAGEMENT\n\n GUIDE DISTRICT TEAM DEVELOPMENT THROUGH COACHING LEADERS IN PEOPLE MANAGEMENT, PROCESS, AND FUNCTIONAL ASSOCIATE DEVELOPMENT. COACH SUPERVISORS AND MANAGERS ON THE CREATION AND FOLLOW THROUGH OF IMPACTFUL DEVELOPMENT PLANS AND DISCUSSIONS FOR THEIR ASSOCIATES. MONITOR DEVELOPMENT PLANS TO ENSURE PROGRESS AND ESCALATE TO DISTRICT MANAGER IF COURSE CORRECTION IS NEEDED. PREPARE DOCUMENTS AND REPORTS FOR DISTRICT-LEVEL SUCCESSION PLANNING AND QUARTERLY TALENT REVIEW DISCUSSIONS. EXECUTE ON THE AREA TRAINING PLANPARTNER WITH LOCATION LEADERS TO ENSURE ASSOCIATES RECEIVE AND COMPLETE FUNCTIONAL TRAINING.DELIVER NEW SUPERVISOR/MANAGER ONBOARDING TO ROLE TRAINING.FACILITATE JUST-IN-TIME TRAINING AND COACHING OF LEADERS DURING MID-YEAR CHECK-INS, ANNUAL PERFORMANCE REVIEWS, AND MERIT PROCESS.ENSURE TECHNICAL TRAINING OCCURS CONSISTENTLY ACROSS THE WORKFORCE.\n\nTALENT ACQUISITION AND WORKFORCE PLANNING\n\n COLLABORATE WITH ALL DEPARTMENTS TO IDENTIFY AND PROPOSE APPROPRIATE STAFFING LEVELS BASED ON ANALYSIS OF GROWTH TRENDS, AND WORKFORCE PLANNING TOOLS. PROVIDES STAFFING SUPPORT TO LEADERSHIP BY COLLABORATING ON RECRUITING EFFORTS, INCLUDING BUILDING LOCAL TECHNICAL SCHOOL, UNIVERSITY & COLLEGE PARTNERSHIPS. CREATE A CONNECTION BETWEEN THE FIELD RECRUITERS AND THE DISTRICT MANAGER TO CREATE AND PLAN A RECRUITING STRATEGY AND PRIORITIZE EFFORTS.\n\nASSOCIATE AND LABOR RELATIONS\n\n PROACTIVELY BUILD RELATIONSHIPS AT LOCATIONS THAT HELP SUPPORT A POSITIVE CULTURE AND ENGAGING ENVIRONMENT. DEVELOP AND SUSTAIN A WORKPLACE THAT MIRRORS OUR EMPLOYEE VALUE PROPOSITION THROUGH THE FOLLOWING:ADVISE ASSOCIATES AND MANAGEMENT ON THE INTERPRETATION OF HUMAN RESOURCES POLICIES, PROGRAMS, PROCEDURES, AND COLLECTIVE BARGAINING AGREEMENTS.PARTICIPATE IN INVESTIGATIONS OF ASSOCIATES CONCERNS, PREPARE SUMMARIES, AND COLLABORATE WITH AREA HR MANAGER ON RECOMMENDATIONS. SUPPORT AREA HR MANAGERS IN PARTNERING WITH LABOR RELATIONS, CONDUCTING LOCATION RISK ASSESSMENTS, AND REINFORCING THE GOALS OF POSITIVE ASSOCIATE RELATIONS TRAINING.\n\nHR EXPERTISE & COMPLIANCE\n\n REMAIN AWARE OF EMPLOYMENT LAWS APPLICABLE TO LOCATIONS, INCLUDING BUT NOT LIMITED TO STATE AND LOCAL PAID SICK LEAVE LAWS. EFFECTIVELY COMMUNICATE AND FOLLOW UP TO MAINTAIN REQUIRED LEGAL COMPLIANCE THROUGH REGULAR ANALYSIS AND ENSURE CONSISTENT PRACTICES ARE FOLLOWED ACCORDING TO PENSKE POLICIES. FOCUS ON COMPENSATION PARITY, WAGE-HOUR, I-9 AND ASSOCIATE HANDBOOK ACKNOWLEDGMENT COMPLIANCE. ENSURES ALL COMPANY AND LEGALLY MANDATED TRAINING OBLIGATIONS ARE MET INCLUDING HARASSMENT PREVENTION, REASONABLE SUSPICION AND WORKPLACE VIOLENCE. ESCALATE COMPENSATION ISSUES TO THE AREA HR MANAGER AND WORK WITH CENTRALIZED COMPENSATION TO ENACT PLANS TO ADDRESS. PARTNER WITH SPECIALIZED, DEDICATED CORPORATE RESOURCES FOR ISSUES SUCH AS DIVERSITY & INCLUSION, LEAVE OF ABSENCE, ACCOMMODATIONS, BENEFITS, UNEMPLOYMENT, WORKERS COMPENSATION, AND SAFETY.\n\nACQUISITIONS & NEW BUSINESS OPPORTUNITIES:\n\n LEADS THE INTEGRATION, EXECUTION AND FOLLOW-UP NEEDED TO SUCCESSFULLY ASSIMILATE NEW ASSOCIATES INTO OUR CULTURE. PROVIDE ONGOING SUPPORT OF THE INTEGRATION PROCESS WITH CONSISTENT ONSITE MEETINGS, ONBOARDING, STAFFING, TRAINING, ETC.\n\nOTHER PROJECTS AND TASKS AS ASSIGNED BY SUPERVISOR.\n\nQUALIFICATIONS:\n\n AT LEAST 3 YEARS OF EXPERIENCE IN A HUMAN RESOURCES ROLE (GENERALIST, SPECIALIST, RECRUITING) REQUIRED, OR RELEVANT FIELD OPERATIONS EXPERIENCE WILL BE CONSIDERED FOR INTERNAL CANDIDATES WITH AT LEAST 3 YEARS OF DEMONSTRATED SUCCESS WITH PENSKE. BACHELOR’S DEGREE REQUIRED. SHRM OR HRCI CERTIFICATION(S) PREFERRED (I.E., PHR, SHRM-CP). SOME KNOWLEDGE OF EMPLOYMENT LAW AND REGULATORY COMPLIANCE ISSUES PREFERRED (ADDITIONAL KNOWLEDGE MAY BE REQUIRED IN CERTAIN STATES, SUCH AS CA, MA, WA, OR ETC.) DEMONSTRATED PRESENTATION SKILLS, INCLUDING STRONG ORAL AND WRITING CAPABILITIES; ABILITY TO CLEARLY COMMUNICATE COMPELLING MESSAGES. ABILITY TO COLLECT, COMPILE, AND ANALYZE INFORMATION AND DATA. ESTABLISH AND MAINTAIN WORKING RELATIONSHIPS. MUST POSSESS A HIGH-LEVEL OF HONESTY, INTEGRITY, AND ETHICS. SKILLED OPERATION OF VARIETY OF COMPUTER SOFTWARE PROGRAMS, INCLUDING MICROSOFT WORD, EXCEL, AND POWERPOINT, AND HAVE A BASIC UNDERSTANDING OF ENTERPRISE WIDE HRIS SYSTEMS. VALID DRIVER'S LICENSE AND WILLINGNESS TO TRAVEL AS NECESSARY. ABILITY TO TRAVEL 30-50% WITHIN HOME DISTRICT WHICH COULD INCLUDE OVERNIGHT TRAVEL BASED ON NEED. A SUCCESSFUL CANDIDATE WILL WORK PRIMARILY FROM AN ASSIGNED FIELD LOCATION AND SPEND 30-50% OF THEIR WORK WEEK TRAVELING TO LOCATIONS WITHIN THEIR ASSIGNED DISTRICT AS THE BUSINESS REQUIRES. ABILITY TO WORK THE REQUIRED SCHEDULE, WORK AT THE SPECIFIC LOCATION REQUIRED. REQUIREMENTS: COMPLETE PENSKE EMPLOYMENT APPLICATION, SUBMIT TO A BACKGROUND INVESTIGATION (TO INCLUDE PAST EMPLOYMENT, EDUCATION, AND CRIMINAL HISTORY) AND DRUG SCREENING.\n\nHOW PENSKE TAKES CARE OF YOU:\n\n THIS ROLE IS SUPPORTED BY A ROBUST ONBOARDING PLAN AND STRONG ROLE DEVELOPMENT PLAN TO HELP YOU ADVANCE YOUR HR SKILLS INCLUDING THE OBTAINMENT OF YOUR SHRM-CP/HRCI-PHR CERTIFICATION WITHIN 12 MONTHS OF ACCEPTING THE POSITION. THIS POSITION OFFERS COMPETITIVE SALARY, INCLUDING BONUS ELIGIBILITY, STRONG BENEFITS AND RETIREMENT PROGRAMS AND A COMPANY SERVICE VEHICLE.\n\nPHYSICAL REQUIREMENTS:\n\nTHE PHYSICAL AND MENTAL DEMANDS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY AN ASSOCIATE TO SUCCESSFULLY PERFORM THE ESSENTIAL FUNCTIONS OF THIS JOB. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS.\n\nTHE ASSOCIATE WILL BE REQUIRED TO: READ; COMMUNICATE VERBALLY AND/OR IN WRITTEN FORM; REMEMBER AND ANALYZE CERTAIN INFORMATION; AND REMEMBER AND UNDERSTAND CERTAIN INSTRUCTIONS OR GUIDELINES.WHILE PERFORMING THE DUTIES OF THIS JOB, THE ASSOCIATE MAY BE REQUIRED TO STAND, WALK, AND SIT. THE ASSOCIATE IS FREQUENTLY REQUIRED TO USE HANDS TO TOUCH, HANDLE, AND FEEL, AND TO REACH WITH HANDS AND ARMS. THE ASSOCIATE MUST BE ABLE TO OCCASIONALLY LIFT AND/OR MOVE UP TO 25LBS/12KG.SPECIFIC VISION ABILITIES REQUIRED BY THIS JOB INCLUDE CLOSE VISION, DISTANCE VISION, PERIPHERAL VISION, DEPTH PERCEPTION AND THE ABILITY TO ADJUST FOCUS.\n\nPENSKE IS AN EQUAL OPPORTUNITY EMPLOYER\n\nJOB CATEGORY: HUMAN RESOURCES\n\nJOB FAMILY: HUMAN RESOURCES\n\nADDRESS: 8795 ELY RD\n\nPRIMARY LOCATION: US-FL-PENSACOLA\n\nEMPLOYER: PENSKE TRUCK LEASING CO., L.P.\n\nREQ ID: 2405000",
    "job_skill_set": [
      "human resources",
      "Microsoft Excel",
      "Microsoft PowerPoint",
      "onboarding",
      "talent management",
      "training",
      "communication",
      "collaboration",
      "coaching",
      "problem solving",
      "relationship building",
      "adaptability",
      "employment law",
      "HRIS systems",
      "Microsoft Word",
      "data analysis",
      "recruiting",
      "compliance",
      "performance management",
      "succession planning",
      "integrity",
      "leadership",
      "engagement",
      "analytical thinking"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "analytical",
      "building",
      "coaching",
      "collaboration",
      "communication",
      "compliance",
      "data",
      "district",
      "employment",
      "engagement",
      "excel",
      "hr",
      "hris",
      "human",
      "integrity",
      "law",
      "leadership",
      "management",
      "manager",
      "microsoft",
      "onboarding",
      "pensacola",
      "performance",
      "planning",
      "powerpoint",
      "problem",
      "recruiting",
      "relationship",
      "resources",
      "solving",
      "succession",
      "systems",
      "talent",
      "thinking",
      "training",
      "word"
    ]
  },
  {
    "job_id": "3887475102",
    "job_title": "Human Resources Generalist",
    "category": "HR",
    "job_description": "WHO WE ARE:FOUNDED IN 1981, WELLSPRING HOUSE INC. IS A LEADING NON-PROFIT ORGANIZATION WITH PROGRAMS EXTENDING THROUGHOUT THE 20 CITIES AND TOWNS OF MASSACHUSETTS’ NORTH SHORE REGION. OUR MISSION IS TO INSPIRE FAMILIES AND ADULTS TO ACHIEVE EMPLOYMENT AND FINANCIAL STABILITY THROUGH STABLE HOUSING, EDUCATION, JOB TRAINING, AND CAREER READINESS.JOB DESCRIPTION SUMMARY/RESPONSIBILITIES:THE PART-TIME HR GENERALIST IS RESPONSIBLE FOR MANAGING HR FUNCTIONS, INCLUDING EMPLOYEE ONBOARDING, COMPENSATION AND BENEFITS ADMINISTRATION, POLICY IMPLEMENTATION, REPORTING TO UNEMPLOYMENT AND DIFFERENT STATE OFFICES, AND PERSONNEL FILE MANAGEMENT. BONUS SKILLS INCLUDE KNOWLEDGE OF INFORMATION TECHNOLOGY SYSTEMS.ROLES & RESPONSIBILITIES:PROVIDE LEADERSHIP AND OVERSIGHT OF PERSONNEL FUNCTIONS, INCLUDING: EMPLOYEE ONBOARDING, COMPENSATION, BENEFITS, PERSONNEL FILES, AND JOB POSTINGS. COORDINATE EMPLOYEE ONBOARDING, INCLUDING I-9, CORI/SORI, BENEFIT SELECTION, ETC. PROCESS PAYROLL.MANAGE PERSONNEL FILES.REVIEW ALL BENEFITS ON AN ANNUAL BASIS AND MAKE RECOMMENDATIONS FOR POSSIBLE CHANGES BASED ON PRICING AND OFFERINGS AVAILABLE. SERVE AS POINT OF CONTACT FOR THE ORGANIZATION’S SIMPLE IRA PLAN AND ISSUE MANDATED NOTICES ANNUALLY. WORK WITH THE COO AND THE EXTERNAL HR CONSULTANT TO UPDATE EMPLOYEE GUIDEBOOK AND PERFORMANCE REVIEW PROCESS AS NEEDED. WORK WITH THE EXECUTIVE DIRECTOR ON SALARY ANALYSIS ANNUALLY AND AS NEEDED.WORK WITH THE ACCOUNTANT AS NEEDED.OTHER DUTIES AS ASSIGNED. NOTE: WELLSPRING’S EXTERNAL HR CONTRACTOR, INTEGRATED HUMAN RESOURCES IS RESPONSIBLE FOR EMPLOYEE RELATIONS ISSUES, INCLUDING WORKING WITH DEPARTMENT DIRECTORS AND SUPERVISORS ON PERFORMANCE CONCERNS AND DISCIPLINARY ACTION. THE MAIN ROLE OF THE PT HR GENERALIST IS TO SUPPORT THE ORGANIZATION’S HR NEEDS. SOME INFORMATION TECHNOLOGY RESOURCES SUPPORT WILL BE A BONUS. REQUIRED QUALIFICATIONS:BACHELOR’S DEGREE IN HUMAN RESOURCES, BUSINESS ADMINISTRATION, OR RELEVANT FIELD.EXPERIENCE IN HR SYSTEMS.PROFICIENT IT SKILLS, INCLUDING MICROSOFT OFFICE SUITE AND MICROSOFT 365.STRONG PROJECT AND VENDOR MANAGEMENT SKILLS.ABILITY TO LEAD CHANGE EFFECTIVELY.RESULTS-ORIENTED WITH STRONG WRITTEN AND VERBAL COMMUNICATION SKILLS.SOUND DECISION-MAKING ABILITIES IN A FAST-PACED ENVIRONMENT.EXPERIENCE IN DEVELOPING AND DELIVERING ORGANIZATIONAL LEARNING EXPERIENCES.STRATEGIC THINKING SKILLS WITH THE ABILITY TO TRANSLATE GOALS INTO ACTION PLANS.STRONG INTERPERSONAL SKILLS TO ESTABLISH CREDIBILITY WITH STAKEHOLDERS.LOCATION AND SCHEDULE:WELLSPRING’S HOME OFFICE IS LOCATED AT 302 ESSEX AVENUE IN GLOUCESTER, MA. THIS POSITION IS BASED OUT OF WELLSPRING’S GLOUCESTER OFFICE, WITH THE POSSIBILITY OF SOME HYBRID WORK. WELLSPRING IS REACHABLE BY PUBLIC TRANSPORTATION. APPLICATION PROCESS:WELLSPRING IS CURRENTLY ACCEPTING APPLICATIONS UNTIL THE POSITION IS FILLED. PLEASE SEND YOUR RESUME AND COVER LETTER VIA EMAIL TO: JOBS@WELLSPRINGHOUSE.ORG. IN THE SUBJECT LINE, WRITE YOUR NAME AND THE POSITION TITLE. WE WILL REVIEW ALL SUBMISSIONS, IDENTIFY CANDIDATES, AND CONTACT ONLY THOSE INDIVIDUALS SELECTED TO CONTINUE IN THE SEARCH PROCESS. NO PHONE CALLS PLEASE. WELLSPRING IS AN EQUAL OPPORTUNITY EMPLOYER THAT IS COMMITTED TO CREATING AN INCLUSIVE ORGANIZATION. WE ACTIVELY SEEK A DIVERSE POOL OF CANDIDATES FOR THIS POSITION. \n",
    "job_skill_set": [
      "HR management",
      "employee onboarding",
      "compensation administration",
      "benefits administration",
      "payroll processing",
      "personnel file management",
      "vendor management",
      "strategic thinking",
      "HR systems",
      "organizational learning",
      "communication",
      "decision-making",
      "interpersonal skills",
      "leadership",
      "results-oriented",
      "change management",
      "Microsoft Office Suite",
      "Microsoft 365",
      "project management"
    ],
    "short_keywords": [
      "365",
      "administration",
      "benefits",
      "change",
      "communication",
      "compensation",
      "decisionmaking",
      "employee",
      "file",
      "generalist",
      "hr",
      "human",
      "interpersonal",
      "leadership",
      "learning",
      "management",
      "microsoft",
      "office",
      "onboarding",
      "organizational",
      "payroll",
      "personnel",
      "processing",
      "project",
      "resources",
      "resultsoriented",
      "skills",
      "strategic",
      "suite",
      "systems",
      "thinking",
      "vendor"
    ]
  },
  {
    "job_id": "3902351802",
    "job_title": "Human Resources Manager",
    "category": "HR",
    "job_description": "(NO RECRUITING AGENCIES, PLEASE)\nJOB SUMMARY:\nWE ARE A MUNICIPAL LAW FIRM, HEADQUARTERED IN LEES SUMMIT, MO, LOOKING FOR A HUMAN RESOURCES MANAGER TO SUPPORT OUR RAPIDLY GROWING TEAM. THE RIGHT CANDIDATE WILL BE A SELF-STARTER EXPERIENCED IN COLLABORATING DIRECTLY WITH ORGANIZATIONAL LEADERSHIP; AND MUST BE READY TO LEAD IN THE DEVELOPMENT AND IMPLEMENTATION OF THE POLICIES, PROCEDURES, PROGRAMS, AND BEST HUMAN RESOURCE (HR) PRACTICES FOR AN ORGANIZATION SUCH AS OURS. THIS ROLE WILL RUN THE DAILY FUNCTIONS OF THE HR DEPARTMENT INCLUDING EMPLOYEE RECRUITMENT AND RETENTION, ADMINISTERING PAY, BENEFITS, AND LEAVE, MONITORING EMPLOYEE TRAINING, MAINTAINING EMPLOYEE MORALE, AND ENFORCING FIRM POLICIES AND PRACTICES. THIS ROLE MAY ASSIST WITH CONSTRUCTIVE AND TIMELY PERFORMANCE EVALUATIONS BUT DOES NOT HAVE DIRECT REPORTS. POSITION IS FULL-TIME, ON-SITE, SALARIED, EXEMPT, AND REPORTS TO FIRM LEADERSHIP. WE OFFER AN EXCELLENT COMPENSATION PACKAGE, COMPETITIVE BENEFITS, AND PAID TIME OFF PACKAGES. WE HAVE A FUN AND CARING TEAM ENVIRONMENT WITH NUMEROUS YEARS OF EXPERTISE JUST WAITING FOR YOU TO JOIN!\nRESPONSIBILITIES:\nLEADS THE DEVELOPMENT, IMPLEMENTATION, AND TRACKING OF BEST HR STRATEGIES, SYSTEMS, PRACTICES, METRICS, POLICIES, AND PROCEDURES ACROSS THE ORGANIZATION.PERFORMS ROUTINE TASKS REQUIRED TO ADMINISTER AND EXECUTE HUMAN RESOURCE PROGRAMS INCLUDING BUT NOT LIMITED TO PAYROLL, BENEFITS, AND LEAVE; DISCIPLINARY MATTERS, DISPUTES, AND INVESTIGATIONS; PERFORMANCE AND TALENT MANAGEMENT; PRODUCTIVITY, RECOGNITION, AND MORALE; OCCUPATIONAL HEALTH AND SAFETY; AND TRAINING AND DEVELOPMENT.MANAGES THE RECRUITMENT AND CANDIDATE SELECTION PROCESS.TRACKS ATTORNEY LICENSE RENEWALS AND ASSOCIATION MEMBERSHIPS INITIATING TIMELY PAYMENT WITH ACCOUNTING WHEN NECESSARY.ORGANIZES LEARNING OPPORTUNITIES AND EMPLOYEE ENRICHMENT FOR STAFF THAT CONSIDER EFFICIENCY OF EMPLOYEE TIME.ORGANIZES PERIODIC FIRM SOCIAL EVENTS TO MAINTAIN AN ATMOSPHERE OF COMRADERY AND FOSTER EMPLOYEE MORALE.DEVELOPS AND OVERSEES THE IMPLEMENTATION OF LAW SCHOOL RECRUITMENT INITIATIVES.DEVELOPS AND MANAGES A PERFORMANCE APPRAISAL SYSTEM INCLUDING ASSISTING FIRM LEADERSHIP IN GATHERING AND DOCUMENTING INFORMATION FOR REVIEWS; MAINTAINING A FIRM-WIDE REVIEWS CALENDAR; SCHEDULING AND ATTENDING REVIEWS; AND ENSURING REVIEW COMPLETION.MAINTAINS TRACKING MECHANISMS FOR EMPLOYEE SALARY HISTORIES, CURRENT SALARIES, MARKET SALARY DATA, AND PROJECTED SALARY RECOMMENDATIONS.HANDLES EMPLOYMENT-RELATED INQUIRIES FROM APPLICANTS, EMPLOYEES, SUPERVISORS, AND FORMER EMPLOYEES, REFERRING COMPLEX AND/OR SENSITIVE MATTERS TO THE APPROPRIATE PERSONNEL.ATTENDS, DOCUMENTS, AND PARTICIPATES IN EMPLOYEE DISCIPLINARY MEETINGS, TERMINATIONS, AND INVESTIGATIONS.CONDUCTS ALL ONBOARDING, OFFBOARDING, STAY INTERVIEWS, AND EXIT INTERVIEWS OF FIRM EMPLOYEES.MAINTAINS LEGAL COMPLIANCE WITH FEDERAL, STATE, AND LOCAL EMPLOYMENT LAWS, REGULATIONS, AND RECOMMENDED BEST PRACTICES; REVIEWS FIRM POLICIES AND PRACTICES TO MAINTAIN COMPLIANCE.VERIFIES ALL BENEFITS AND HUMAN RESOURCE VENDOR INVOICES OR SPENDING ARE ACCURATE AND IN ACCORDANCE WITH CONTRACTED OR NEGOTIATED RATES.EXERCISES FISCAL RESPONSIBILITY BY ENSURING THE BEST COST OPTIONS ARE CHOSEN WHILE ENSURING FIRM AND EMPLOYEE REQUIREMENTS AND NEEDS ARE MET.MANAGES THE PHONE SYSTEM AND TECHNOLOGY INVENTORY OF CELL PHONES, MONITORS, AND COMPUTERS.ENSURES WEBSITE IS UPDATED WITH CURRENT ATTORNEY BIOS, PRESENTATIONS, AND ARTICLES.PERFORMS OTHER DUTIES AS ASSIGNED.\nREQUIRED SKILLS AND ABILITIES:\nEXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS.EXCELLENT INTERPERSONAL, NEGOTIATION, AND CONFLICT RESOLUTION SKILLS.EXCELLENT ORGANIZATIONAL SKILLS, ATTENTION TO DETAIL, AND ABILITY TO PINPOINT THE ROOT CAUSE OF ISSUES THAT MAY ARISE.EXCELLENT TIME MANAGEMENT SKILLS WITH A PROVEN ABILITY TO MEET DEADLINES.STRONG ANALYTICAL AND PROBLEM-SOLVING SKILLS; RESULTS DRIVEN.ABILITY TO ACT WITH INTEGRITY, PROFESSIONALISM, AND CONFIDENTIALITY.LEADERSHIP SKILLS AND AN ABILITY TO ARCHITECT STRATEGY.PROFICIENT WITH MICROSOFT OFFICE SUITE AND VIRTUAL MEETING PLATFORMS.EXPERIENCE AND UNDERSTANDING OF COMPLIANCE SURROUNDING BACKGROUND CHECKS.THOROUGH KNOWLEDGE OF EMPLOYMENT-RELATED LAWS AND REGULATIONS.PROFICIENCY WITH HRIS AND TALENT MANAGEMENT SYSTEMS.THIS POSITION REPORTS TO THE FIRM’S PRIMARY OFFICE IN LEE’S SUMMIT, MO. OCCASIONAL TRAVEL TO OTHER FIRM OFFICE LOCATIONS OR OFFSITE WORK LOCATIONS MAY BE REQUIRED. (MILEAGE REIMBURSEMENT IS PROVIDED.)\nEDUCATION AND EXPERIENCE:\nBACHELOR’S DEGREE IN HUMAN RESOURCES, BUSINESS ADMINISTRATION, OR A RELATED FIELD REQUIRED.AT LEAST FIVE YEARS OF PROVEN HUMAN RESOURCE MANAGEMENT EXPERIENCE REQUIRED; PREFERABLY IN A LEGAL ENVIRONMENT.EXPERIENCE USING HRIS, AND PAYCOR PAYROLL SYSTEMS.PROVEN EXPERIENCE DEVELOPING AND IMPLEMENTING HUMAN RESOURCE STRATEGIES, PROGRAMS, METRICS, POLICIES, AND PROCEDURES.SHRM-CP, SHRM-SCP, SPHR OR PHR PREFERRED.\nADDITIONAL REQUIREMENTS:  SUCCESSFUL COMPLETION OF A BACKGROUND CHECK, CREDIT CHECK OR DMV (DRIVING RECORD) CHECK MAY APPLY, DEPENDING ON THE DUTIES AND RESPONSIBILITIES OF THE POSITION. \nSALARY: STARTING AT $75,000 - NEGOTIABLE BASED ON EXPERIENCE AND QUALIFICATIONS \nBENEFITS:INSURANCES: HEALTH, DENTAL, VISION, GROUP LIFE, STDPROFESSIONAL DEVELOPMENT ASSISTANCERETIREMENT PLAN WITH COMPANY MATCHSTUDENT LOAN REPAYMENT PROGRAMPAID TIME OFF / HOLIDAYS",
    "job_skill_set": [
      "HR management",
      "compliance knowledge",
      "HRIS proficiency",
      "payroll systems",
      "Microsoft Office Suite",
      "policy development",
      "employee training",
      "performance appraisal systems",
      "analytical skills",
      "communication",
      "interpersonal skills",
      "negotiation",
      "conflict resolution",
      "organizational skills",
      "time management",
      "integrity",
      "leadership",
      "problem solving",
      "confidentiality",
      "talent management systems"
    ],
    "short_keywords": [
      "analytical",
      "appraisal",
      "communication",
      "compliance",
      "confidentiality",
      "conflict",
      "development",
      "employee",
      "hr",
      "hris",
      "human",
      "integrity",
      "interpersonal",
      "knowledge",
      "leadership",
      "management",
      "manager",
      "microsoft",
      "negotiation",
      "office",
      "organizational",
      "payroll",
      "performance",
      "policy",
      "problem",
      "proficiency",
      "resolution",
      "resources",
      "skills",
      "solving",
      "suite",
      "systems",
      "talent",
      "time",
      "training"
    ]
  },
  {
    "job_id": "3905272928",
    "job_title": "Human Resources Specialist",
    "category": "HR",
    "job_description": "GENERAL POSITION SUMMARYTHIS POSITION IS RESPONSIBLE FOR HANDLING HUMAN RESOURCES AND ADMINISTRATIVE RELATED DUTIES.\nESSENTIAL JOB FUNCTION· EXECUTE TIMELY AND ACCURATE PROCESSING OF PAYROLL FOR APPROXIMATELY 40+ EXEMPT AND NON-EXEMPT EMPLOYEES. ASSISTANCE OF GROSS-UP CALCULATION.· BACKGROUND CHECK FOR NEW HIRING, ENROLLMENT OF HEALTH INSURANCE AND 401(K) RETIREMENT PLAN.· HANDLE TERMINATION PROCESS, REMOVAL FROM HEALTH INSURANCE AND 401(K) RETIREMENT PLAN.· COMMUNICATION WITH HR CONSULTANTS AND EMPLOYMENT LAWYERS TO RESOLVE HR ISSUES.· MAINTAIN PERSONNEL FILES.· HANDLE HSA FUND TRANSFER. ASSISTANCE WITH INQUIRIES FOR EMPLOYEES ABOUT THE BENEFITS.· MANAGE 401(K) ACTIVITIES AND INTERACT DIRECTLY WITH THE 401(K) PROVIDER TO ENSURE PROPER HANDLING OF EMPLOYEES’ ENROLLMENT, DISTRIBUTIONS, ROLLOVERS, AND PAYROLL CONTRIBUTIONS.· RESPOND TIMELY TO PAYROLL REQUESTS AND RESOLVE EMPLOYEE ISSUES.· VERIFY I-9 DOCUMENTS AND MAINTAIN EMPLOYMENT AUTHORIZATION FILES.· ORDER SUPPLY FOR EMPLOYEES AND THE OFFICE.· HANDLE BUILDING MAINTENANCE PROJECTS AND INSPECTIONS.· MAINTAIN EMPLOYEE TIME-OFF RECORDS.· ALL OTHER HR AND ADMINISTRATIVE REQUESTS FROM MANAGEMENT AS AND WHEN REQUIRED.\nOTHER & MISCELLANEOUS· SEEKS CONSTANT IMPROVEMENT, MORE EFFICIENT AND LESS EXPENSIVE WAYS AND MEANS IN WORK PROCESSES.· PERFORMS SPECIAL PROJECTS AND OTHER MISCELLANEOUS DUTIES AS ASSIGNED BY THE MANAGEMENT.· MAINTAINS HIGH ETHICAL STANDARDS IN THE WORKPLACE.· REPORTS ALL IRREGULAR ISSUES AND PROBLEMS TO MANAGEMENT FOR SOLUTION.· MAINTAINS GOOD COMMUNICATION WITH MANAGEMENT, OFFICE STAFF MEMBERS AND OUTSIDE CONTACTS.· COMPLIES WITH ALL COMPANY POLICIES AND PROCEDURES.· RESPONSIBLE FOR MAINTAINING A CLEAN AND SAFE WORKING AREA.\nQUALIFICATIONEDUCATION & WORK EXPERIENCE· BACHELOR’S DEGREE IN COMMUNICATION, PUBLIC RELATIONS, BUSINESS ADMINISTRATION, OR RELATED FIELD PREFERRED.· 7 YEARS OF RELATED EXPERIENCE AND/OR TRAINING; OR EQUIVALENT COMBINATION OF EDUCATION AND EXPERIENCE.· DEEP EXPERTISE IN 401(K), BENEFITS DESIGN.· ACCURATE DATA ENTRY SKILLS WITH GREAT ATTENTION TO DETAIL· A PROACTIVE, THOUGHTFUL, AND TIMELY APPROACH TO COMMUNICATION, ANALYSIS AND PROBLEM SOLVING.\nTOOLS & EQUIPMENT· GENERAL OFFICE EQUIPMENT INCLUDING PHONES, FAX, COPIER, PERSONAL COMPUTER, PRINTER, SCANNER, ETC.· SOFTWARE INCLUDES THE USE OF WINDOWS OPERATING SYSTEM, MS OFFICE AND ACCOUNTING RELATED SOFTWARE.\nWORK ENVIRONMENT & PHYSICAL DEMANDSWORK ENVIRONMENTTHE WORK ENVIRONMENT CHARACTERISTICS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE AN EMPLOYEE ENCOUNTERS WHILEPERFORMING THE ESSENTIAL JOB FUNCTIONS OF THIS POSITION. REASONABLE ACCOMMODATION MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM ESSENTIAL FUNCTIONS. WORK IS PERFORMED IN AN OFFICE ENVIRONMENT. NO BUSINESS TRAVEL IS REQUIRED.\nPHYSICAL DEMANDSTHE PHYSICAL DEMANDS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY AN EMPLOYEE TO SUCCESSFULLY COMPLETE THE ESSENTIAL JOB FUNCTIONS OF THIS POSITION. REASONABLE ACCOMMODATION MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM ESSENTIAL FUNCTIONS. WHILE PERFORMING THE DUTIES OF THIS POSITION, THE EMPLOYEE IS REQUIRED TO FREQUENTLY SIT AND OCCASIONALLY MUST STAND, WALK, USE HANDS AND FINGERS, AND REACH WITH HANDS AND ARMS. THE EMPLOYEE MAY OCCASIONALLY LIFT AND/OR MOVE UP TO 50 POUNDS. SPECIFIC VISION ABILITIES INCLUDE THE ABILITY TO READ AND ANALYZE DATA IN HARD COPY AND ON A COMPUTER SCREEN, MEASURE OR IDENTIFY USING EYESIGHT AND ADJUST VISION FOCUS.",
    "job_skill_set": [
      "payroll processing",
      "data entry",
      "Microsoft Office",
      "building maintenance",
      "communication",
      "problem solving",
      "attention to detail",
      "teamwork",
      "time management",
      "401(K) management",
      "benefits design",
      "background checks",
      "health insurance enrollment",
      "Windows operating system",
      "accounting software",
      "I-9 verification",
      "supply ordering",
      "proactive approach",
      "ethical standards",
      "adaptability"
    ],
    "short_keywords": [
      "401k",
      "accounting",
      "adaptability",
      "approach",
      "attention",
      "background",
      "benefits",
      "building",
      "checks",
      "communication",
      "data",
      "design",
      "detail",
      "enrollment",
      "entry",
      "ethical",
      "health",
      "hr",
      "human",
      "i9",
      "insurance",
      "maintenance",
      "management",
      "microsoft",
      "office",
      "operating",
      "ordering",
      "payroll",
      "proactive",
      "problem",
      "processing",
      "resources",
      "software",
      "solving",
      "specialist",
      "standards",
      "supply",
      "system",
      "teamwork",
      "time",
      "to",
      "verification",
      "windows"
    ]
  },
  {
    "job_id": "3891077739",
    "job_title": "Human Resources Generalist",
    "category": "HR",
    "job_description": "OUR CLIENT, A PRIVATELY OWNED MANUFACTURING COMPANY IN LINN COUNTY, OREGON, IS SEEKING A HUMAN RESOURCES GENERALIST TO JOIN THEIR TEAM. THE IDEAL CANDIDATE WILL BE RESPONSIBLE FOR EMPLOYEE RELATIONS, PAYROLL AND BENEFITS, COMPANY POLICIES AND PROCEDURES, AND ADHERENCE TO LEGAL AND REGULATORY REQUIREMENTS. IN ADDITION, THE CANDIDATE WILL BUILD STRONG RELATIONSHIPS WITH OUR CLIENT'S MANAGERS IN ORDER TO HELP THEM WITH THEIR HUMAN RESOURCE NEEDS.\n\nRESPONSIBILITIESPERFORM ROUTINE TASKS REQUIRED TO ADMINISTER AND EXECUTE HUMAN RESOURCE PROGRAMS INCLUDED BUT NOT LIMITED TO COMPENSATION, BENEFITS, AND LEAVEENSURES COMPLIANCE WITH COMPANY POLICIES AND PROCEDURES AND LEGAL RESPONSIBILITIESIMPLEMENT EMPLOYEE LEAVE POLICIES\nQUALIFICATIONSBACHELOR'S DEGREE OR EQUIVALENT EXPERIENCE IN HUMAN RESOURCES OR RELATED AREA6+ YEARS' OF EXPERIENCE WORKING IN HUMAN RESOURCES, IDEALLY IN A MANUFACTURING ENVIRONMENT",
    "job_skill_set": [
      "employee relations",
      "payroll",
      "benefits administration",
      "compliance",
      "human resources programs",
      "bachelor's degree in HR or related field",
      "relationship building",
      "communication",
      "problem solving",
      "teamwork",
      "adaptability",
      "legal knowledge",
      "leave policies implementation",
      "manufacturing HR experience"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "bachelors",
      "benefits",
      "building",
      "communication",
      "compliance",
      "degree",
      "employee",
      "experience",
      "field",
      "generalist",
      "hr",
      "human",
      "implementation",
      "in",
      "knowledge",
      "leave",
      "legal",
      "manufacturing",
      "or",
      "payroll",
      "policies",
      "problem",
      "programs",
      "related",
      "relations",
      "relationship",
      "resources",
      "solving",
      "teamwork"
    ]
  },
  {
    "job_id": "3902835237",
    "job_title": "Sr. Area Human Resource Manager",
    "category": "HR",
    "job_description": "SR. AREA HUMAN RESOURCE MANAGER WIRELESS VISION, LLC – A T-MOBILE AUTHORIZED RETAILER \nOVERVIEW:WITH A DIRECT LINE REPORTING TO THE SR. DIRECTOR PEOPLE & ENGAGEMENT, THIS POSITION WILL HAVE A DOTTED LINE TO THE AVP FOR THE MARKET IN WHICH THEY ARE ASSIGNED. THIS ROLE WILL PARTNER WITH AVP/ AREA SALES DIRECTOR ON ALL HUMAN RESOURCE MATTERS AND ACT AS THE PRIMARY HR CONTACT FOR EMPLOYEES AND MANAGERS WITHIN THE ASSIGNED AREA. THE SR. AREA HUMAN RESOURCE MANAGER WILL PARTICIPATE IN MULTIPLE AREAS OF A FAST-PACED HR DEPARTMENT. SOME OF THESE INCLUDE, BUT ARE NOT LIMITED TO, RECRUITING ADMINISTRATION, BENEFITS, COMPENSATION, ONBOARDING, EMPLOYEE MOVEMENT, EMPLOYEE RELATIONS, PERFORMANCE MANAGEMENT, AND BUILDING A STRATEGIC PARTNERSHIP WITH LOCAL MANAGEMENT. ADDITIONALLY SUPPORTING CORPORATE OFFICE ON ALL HR AND EMPLOYEE ENGAGEMENT MATTERS.\nRESPONSIBILITIES:RESPONSIBLE FOR ADMINISTERING HUMAN RESOURCE RELATED DUTIES AND MANAGING EMPLOYEE RELATION ISSUES THAT PROMOTE A HIGH-PERFORMANCE CULTURE WHILE ENSURING COMPLIANCE AND CONSISTENCY WITH FEDERAL, STATE, LOCAL LAWS AS WELL AS COMPANY POLICIES.HANDLE EMPLOYEE RELATIONS ISSUES AND MAKE RECOMMENDATIONS TO RESOLVE CONCERNS AND/OR IMPROVE MORALE; MONITOR, AUDIT, AND INVESTIGATE HR RELATED MATTERS AND REGULATIONS INCLUDING, BUT NOT LIMITED TO SEXUAL HARASSMENT, DISCRIMINATION, ADA, FMLA, WAGE AND HOUR, EEOC, DOL.PARTICIPATE IN DEVELOPING AND REVISING POLICIES, PRACTICES AND PROCEDURES AS NEEDED.RESPONSIBLE FOR COMMUNICATION OF ALL HR POLICIES, PROCEDURES, AND INITIATIVES TO MARKET LEADERS WITHIN ASSIGNED AREA.PARTNER WITH AREA AND MARKET LEADERS TO IDENTIFY AND ADDRESS ISSUES AFFECTING EMPLOYEE RETENTION.ASSIST WITH IMPLEMENTING AND EXECUTING RECRUITING STRATEGYCONSULT WITH DSOM’S TO DISCOVER STAFF REQUIREMENTS AND SPECIFIC JOB OBJECTIVESPARTNER WITH RECRUITING MANAGER TO PROMOTE OPEN POSITIONS ON JOB BOARDS AND SOCIAL MEDIA PLATFORMSFACILITATING JOB OFFER AND NEW HIRE PROCESS FOR ASSIGNED AREA.REVIEW AND ADVISE ON PRE-EMPLOYMENT AND BACKGROUND SCREENING RESULTSPARTICIPATE IN DSOM INTERVIEW AND SELECTION PROCESSREVIEW AND COORDINATE THE PROCESSING OF VARIOUS HR FORMS/PAPERWORK INCLUDING EMPLOYEE WORKFLOW STATUS CHANGES, TRANSFER FORMS, TERMINATIONS, ETC.MAINTAINS CONFIDENTIAL INFORMATION AND PROPRIETARY REPORTS.WORKS DIRECTLY WITH ASSOCIATES TO CREATE AN EMPLOYER-OF-CHOICE ENVIRONMENT.CONSULTS WITH DSOM AND STORE LEADERSHIP ON EMPLOYEE RELATIONS ISSUES TO ENSURE THAT EMPLOYEES ARE FAIRLY, AND EQUITABLY TREATED AND LEGAL GUIDELINES ARE FOLLOWED.PARTICIPATION IN ASSIGNED PROJECTS AND FACILITATION OF HR TRAINING SESSIONS.CONDUCTS MARKET VISITS AS NEEDED OR REQUESTED BY AVP AND ATTENDS AREA SUMMITS AND LEADERSHIP MEETINGS WHEN SCHEDULED. DEVELOP AN IN-DEPTH UNDERSTANDING OF THE WIRELESS RETAILER BUSINESS AND ENSURE THAT HR PROGRAMS ADD VALUE TO THE BUSINESS.SUPERVISE AND DIRECT AREA HUMAN RESOURCES MANAGERS ON DAY TO DAY ACTIVITIES. \nREQUIRED SKILLS/ ABILITIES:MUST BE ABLE TO WORK IN FAST-PACED, DETAIL-ORIENTED ENVIRONMENT AND PRIORITIZE WORKFLOW ACCORDING TO BOTH URGENCY AND IMPORTANCEBACHELOR’S DEGREE OR EQUIVALENT WORK EXPERIENCEMINIMUM OF 2-3 YEARS OF HR OR RELATED EXPERIENCE.EXCELLENT COMMUNICATION SKILLS, WRITTEN AND ORALGENERAL UNDERSTANDING OF ALL MAJOR US FEDERAL EMPLOYMENT LAWS (TITLE VII, ADA, FMLA, USERRA, FLSA, ETC.).FAMILIARITY WITH APPLICANT TRACKING SYSTEM PREFERRED JOBVITEANALYTICAL MINDSET WITH THE ABILITY TO INTERPRET DATA.STRONG WORKING KNOWLEDGE OF BUSINESS TOOLS AND METRICS.ATTENTION TO DETAIL AND STRONG WRITING CAPABILITIES.EXCELLENT TIME-MANAGEMENT SKILLS THAT INCLUDE PROFESSIONAL FOLLOW-UP AND FOLLOW-THROUGH SKILLS.STRONG WORK ETHIC AND DESIRE TO ACHIEVE RESULTS.CUSTOMER FOCUSED, AND SERVANT LEADER MIND SET.PROFESSIONAL AND STRONG UNDERSTANDING, USE, AND TECHNICAL USE ABILITY OF MICROSOFT OFFICE PRODUCTS, I.E. WORD, POWERPOINT, EXCEL, OUTLOOK, OFFICE 365, ETC.ABILITY TO TRAVEL UP TO 20%, TRAVEL WITHIN ASSIGN MARKET",
    "job_skill_set": [
      "HR Management",
      "Employee Relations",
      "Federal Employment Laws",
      "Microsoft Office Suite",
      "Onboarding",
      "Communication",
      "Attention to Detail",
      "Problem Solving",
      "Teamwork",
      "Customer Focus",
      "Leadership",
      "Work Ethic",
      "Adaptability",
      "Conflict Resolution",
      "Recruiting",
      "Analytical Skills",
      "Applicant Tracking Systems",
      "Performance Management",
      "Compensation Administration",
      "Benefits Administration",
      "Data Interpretation",
      "Time Management"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "analytical",
      "applicant",
      "area",
      "attention",
      "benefits",
      "communication",
      "compensation",
      "conflict",
      "customer",
      "data",
      "detail",
      "employee",
      "employment",
      "ethic",
      "federal",
      "focus",
      "hr",
      "human",
      "interpretation",
      "laws",
      "leadership",
      "management",
      "manager",
      "microsoft",
      "office",
      "onboarding",
      "performance",
      "problem",
      "recruiting",
      "relations",
      "resolution",
      "resource",
      "skills",
      "solving",
      "sr",
      "suite",
      "systems",
      "teamwork",
      "time",
      "to",
      "tracking",
      "work"
    ]
  },
  {
    "job_id": "3884841822",
    "job_title": "Human Resources Assistant",
    "category": "HR",
    "job_description": "SCION NONPROFIT STAFFING IS LEADING THE SEARCH FOR A TEMPORARY HUMAN RESOURCES ASSISTANT ON BEHALF OF AN AMAZING EARLY CHILDHOOD EDUCATION ORGANIZATION IN SAN FRANCISCO, CA! THIS ROLE IS A CONTRACT OPPORTUNITY THAT OFFERS A FULL-TIME ONSITE WORK SCHEDULE.\n\nPERKS:\n\nIMMEDIATE HIRE OPPORTUNITY MONDAY-FRIDAY WORK SCHEDULE HOURLY RATE OF $25-30/HR., PAID WEEKLY \n\nRESPONSIBILITIES:\n\nCONDUCT ACCURATE AND EFFICIENT DATA ENTRY TASKS RELATED TO EMPLOYEE RECORDS, PAYROLL, BENEFITS, AND OTHER HR FUNCTIONS. UTILIZE TECHNOLOGY PROFICIENTLY TO STREAMLINE HR PROCESSES AND MAINTAIN UP-TO-DATE RECORDS. MAINTAIN A HIGH LEVEL OF CONFIDENTIALITY WHEN HANDLING SENSITIVE EMPLOYEE INFORMATION. MANAGE AND PRIORITIZE HIGH-VOLUME TASKS THAT REQUIRE FOCUSED ATTENTION TO DETAIL AND MEET DEADLINES. COMMUNICATE PROFESSIONALLY WITH STAFF AND EXTERNAL PARTIES REGARDING HR-RELATED MATTERS. COLLABORATE WITH HR TEAM MEMBERS TO SUPPORT VARIOUS INITIATIVES AND PROJECTS. PROVIDE ADMINISTRATIVE SUPPORT AS NEEDED, INCLUDING PREPARING DOCUMENTS, SCHEDULING MEETINGS, AND ORGANIZING FILES. \n\nQUALIFICATIONS:\n\nPROVEN EXPERIENCE IN DATA ENTRY WITH A DEMONSTRATED ABILITY TO MAINTAIN ACCURACY AND ATTENTION TO DETAIL. EXPERIENCE AUDITING DATA FROM MULTIPLE SOURCES SUCH AS SPREADSHEETS, ONLINE RESOURCES, AND DATABASES. PROFICIENCY IN USING TECHNOLOGY, INCLUDING SHAREPOINT, PAYCOM, AND ATS SYSTEM ABILITY TO MANAGE HIGH-VOLUME, TIME-INTENSIVE TASKS EFFICIENTLY AND EFFECTIVELY. EXCELLENT PROFESSIONAL COMMUNICATION SKILLS, BOTH WRITTEN AND VERBAL. PREFERENCE FOR CANDIDATES WITH EXPERIENCE IN NONPROFIT ORGANIZATIONS AND/OR HUMAN RESOURCES. SPANISH LANGUAGE PROFICIENCY IS PREFERRED BUT NOT REQUIRED. \n\nCOMPENSATION AND BENEFITS:\n\nTHIS ONSITE CONTRACT OPPORTUNITY ALLOWS YOU TO WORK WITH AN ENTHUSIASTIC AND THRIVING ORGANIZATION! THE PAY RANGE FOR THIS ROLE IS $25-30/HR., PAID WEEKLY.\n\nHOW TO APPLY:\n\nFOR IMMEDIATE CONSIDERATION, PLEASE SUBMIT YOUR RESUME TODAY FOR THIS AMAZING CAREER OPPORTUNITY WITH AN INCREDIBLE ORGANIZATION!\n\nABOUT OUR SEARCH FIRM:\n\nSCION NONPROFIT STAFFING IS A NATIONAL AWARD-WINNING STAFFING FIRM! SINCE 2006, WE HAVE HAD THE PLEASURE OF SUCCESSFULLY PLACING THOUSANDS OF TALENTED PROFESSIONALS WITH AMAZING CAREER OPPORTUNITIES. THROUGH OUR INNOVATIVE TEAM BUILDING AND RECRUITING SOLUTIONS, WE BRIDGE THE GAP IN EXECUTIVE LEADERSHIP SEARCHES, DIRECT HIRE RECRUITING, INTERIM LEADERSHIP PLACEMENT, AND TEMPORARY PROFESSIONAL STAFFING. OUR TRACK RECORD AND RECRUITMENT PROCESS HAS MADE US ONE OF THE TOP RECRUITMENT FIRMS IN THE NATION.\n\nWE ARE PROUD TO BE PART OF THE FORBES LISTS OF THE BEST RECRUITMENT FIRMS AND THE BEST EXECUTIVE SEARCH FIRMS IN AMERICA. ADDITIONALLY, SCION HAS BEEN RECOGNIZED AS A CLEARLYRATED BEST OF STAFFING FIRM AS WELL AS A TOP RECRUITMENT FIRM BY THE BUSINESS TIMES. ADDITIONAL INFORMATION ABOUT US CAN ALSO BE FOUND AT WWW.SCIONSTAFFING.COM.\n\nSCION STAFFING, INC. IS AN EQUAL OPPORTUNITY EMPLOYER AND SERVICE PROVIDER AND DOES NOT DISCRIMINATE ON THE BASIS OF RACE, RELIGION, GENDER, GENDER IDENTITY, NATIONAL ORIGIN, CITIZENSHIP STATUS, SEXUAL ORIENTATION, DISABILITY, POLITICAL AFFILIATION OR BELIEF, OR ANY OTHER PROTECTED CLASS. WE ARE COMMITTED TO THE PRINCIPLES OF EQUAL OPPORTUNITY EMPLOYMENT AND ARE DEDICATED TO MAKING EMPLOYMENT DECISIONS BASED ON MERIT AND VALUE, FOR OURSELVES, OUR CLIENT COMPANIES, AND FOR THE CANDIDATES WE REPRESENT. FOR OPPORTUNITIES LOCATED IN A REGION THAT HAVE ENACTED FAIR CHANCE, ARREST OR CONVICTION-BASED EMPLOYMENT ORDINANCES, SCION STAFFING PROACTIVELY FOLLOWS THE ENACTED GUIDANCE AND CONSIDERS FOR EMPLOYMENT ALL QUALIFIED APPLICATIONS WITH ARREST AND CONVICTION RECORDS. WE BELIEVE IN FOLLOWING BEST PRACTICES AND CONSIDERING ALL QUALIFIED APPLICANTS THAT APPLY WITH US.\n\n",
    "job_skill_set": [
      "attention to detail",
      "technology proficiency",
      "document preparation",
      "scheduling meetings",
      "file organization",
      "professional communication",
      "collaboration",
      "time management",
      "confidentiality",
      "prioritization",
      "problem solving",
      "data entry",
      "SharePoint",
      "Paycom",
      "ATS systems",
      "auditing data",
      "Spanish language proficiency"
    ],
    "short_keywords": [
      "assistant",
      "ats",
      "attention",
      "auditing",
      "collaboration",
      "communication",
      "confidentiality",
      "data",
      "detail",
      "document",
      "entry",
      "file",
      "hr",
      "human",
      "language",
      "management",
      "meetings",
      "organization",
      "paycom",
      "preparation",
      "prioritization",
      "problem",
      "professional",
      "proficiency",
      "resources",
      "scheduling",
      "sharepoint",
      "solving",
      "spanish",
      "systems",
      "technology",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3901936391",
    "job_title": "Human Resources Administrator",
    "category": "HR",
    "job_description": "ULTIMATE STAFFING IS SEEKING A HUMAN RESOURCES ADMINISTRATOR WITH A MINIMUM OF 2 YEARS HR EXPERIENCE. THIS IS A DIRECT HIRE OPPORTUNITY FOR A COMPANY ON THE SHORELINE IN NEW HAVEN COUNTY. RESPONSIBILITIES:* PERFORM ADMINISTRATIVE DUTIES, SUCH AS MAINTAINING EMPLOYEE DATABASE AND SORTING EMAILS FOR THE HR DEPARTMENT* MAINTAIN PROPER RECORDS OF EMPLOYEE ATTENDANCE AND LEAVES* ASSIST HR MANAGER IN POLICY FORMULATION, HIRING AND SALARY ADMINISTRATION* SUBMIT ONLINE JOB POSTINGS, SHORTLIST CANDIDATES AND SCHEDULE JOB INTERVIEWS* COORDINATE ORIENTATION AND TRAINING SESSIONS FOR NEW EMPLOYEES* ENSURE SMOOTH COMMUNICATION WITH EMPLOYEES AND TIMELY RESOLUTION TO THEIR QUERIES QUALIFICATIONS:* 2-5 YEARS OF EXPERIENCE IN HUMAN RESOURCES * STRONG INTERPERSONAL, COMMUNICATION, AND CRITICAL THINKING SKILLS SALARY: $60,000 -$70,000  \nALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, NATIONAL ORIGIN, AGE, ANCESTRY, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, GENDER EXPRESSION, MARITAL STATUS, DISABILITY, MEDICAL CONDITION, GENETIC INFORMATION, PREGNANCY, OR MILITARY OR VETERAN STATUS. WE CONSIDER ALL QUALIFIED APPLICANTS, INCLUDING THOSE WITH CRIMINAL HISTORIES, IN A MANNER CONSISTENT WITH STATE AND LOCAL LAWS, INCLUDING THE CITY OF LOS ANGELES' FAIR CHANCE INITIATIVE FOR HIRING ORDINANCE.",
    "job_skill_set": [
      "employee database management",
      "attendance record maintenance",
      "policy formulation",
      "job posting",
      "candidate shortlisting",
      "interview scheduling",
      "training session coordination",
      "interpersonal skills",
      "communication skills",
      "critical thinking",
      "problem solving",
      "orientation coordination"
    ],
    "short_keywords": [
      "administrator",
      "attendance",
      "candidate",
      "communication",
      "coordination",
      "critical",
      "database",
      "employee",
      "formulation",
      "hr",
      "human",
      "interpersonal",
      "interview",
      "job",
      "maintenance",
      "management",
      "orientation",
      "policy",
      "posting",
      "problem",
      "record",
      "resources",
      "scheduling",
      "session",
      "shortlisting",
      "skills",
      "solving",
      "thinking",
      "training"
    ]
  },
  {
    "job_id": "3902357327",
    "job_title": "Human Resources Coordinator",
    "category": "HR",
    "job_description": "KELLY® PROFESSIONAL & INDUSTRIAL IS LOOKING FOR AN HR COORDINATOR TO SUPPORT A FORTUNE 100 GLOBAL BIOTECH COMPANY IN ASHEVILLE, NC. SOUND GOOD? TAKE A CLOSER LOOK BELOW!\nHR COORDINATOR REQUIRED QUALIFICATIONS:- AT LEAST 1 YEAR OF WORK EXPERIENCE IN HUMAN RESOURCES- EXPERIENCE USING HRIS SYSTEMS- HIGH SCHOOL DIPLOMA/GED- ABILITY TO MULTITASK AND SHIFT PRIORITIES QUICKLY WHILE WORKING UNDER TIGHT/CHANGING/CHALLENGING DEADLINES- POSITIVE, ‘CAN DO’ AND SERVICE-ORIENTED ATTITUDE\nHR COORDINATOR DESIRED QUALIFICATIONS:- ASSOCIATE’S DEGREE OR BACHELOR'S DEGREE - EXPERIENCE USING WORKDAY HR SOFTWARE \nWHAT’S A TYPICAL DAY AS AN HR COORDINATOR? YOU’LL BE COORDINATING, PLANNING, AND PERFORMING A VARIETY OF ADMINISTRATIVE, ANALYTICAL, AND CLERICAL DUTIES TO ASSIST OPERATIONS MANAGEMENT & HR IN SUPPORT OF SITE HIRING ACTIVITY. RESPONSIBILITIES WILL INCLUDE:- ASSIST NEW HIRES IN COMPLETION AND SUBMISSION OF POST-OFFER REQUIREMENTS AND WORKDAY ACTIVITIES; FOLLOW UP WITH NEW HIRES ON OUTSTANDING ITEMS RELATED TO PRE-HIRE AND DAY-ONE REQUIREMENTS - WORK WITH PEOPLE MANAGERS AT ALL LEVELS TO MAINTAIN ACCURACY AND INTEGRITY OF WORKFORCE-RELATED DATA INCLUDING SUPPORTING WITH WORKDAY TRANSACTIONS  - SUPPORT TRAINING OF PEOPLE MANAGERS IN WORKDAY-RELATED ACTIVITIES  - ATTEND SITE TIERED MEETINGS TO TRACK NEW HIRES, LEAVERS, AND ATTENDANCE - SET UP AND MAINTAIN FILES AND RECORDS SYSTEMS - WORK WITH DATA, SPREADSHEETS, AND DATABASES TO DOCUMENT PROGRESS AND IDENTIFY ACTIONS NEEDED\nWHY YOU SHOULD APPLY TO BE AN HR COORDINATOR:- COMPETITIVE COMPENSATION: $20-$25/HOUR DOE- GOOD WORK/LIFE BALANCE: SCHEDULED MONDAY-FRIDAY 8A-5P WITH FLEXIBILITY TO START EARLIER OR STAY LATER BASED ON BUSINESS NEEDS- INNOVATIVE AND PROGRESSIVE COMPANY CULTURE- ACCESS TO OUTSTANDING KELLY BENEFITS AND PERKS VIA HTTPS://WWW.MYKELLY.US/US-MYKELLY/PERKS/\nWHAT HAPPENS NEXTONCE YOU APPLY, YOU’LL PROCEED TO NEXT STEPS IF YOUR SKILLS AND EXPERIENCE LOOK LIKE A GOOD FIT. HELPING YOU DISCOVER WHAT’S NEXT IN YOUR CAREER IS WHAT WE’RE ALL ABOUT, SO LET’S GET TO WORK. APPLY TO BE AN HR COORDINATOR TODAY!",
    "job_skill_set": [
      "data management",
      "administrative duties",
      "analytical skills",
      "record keeping",
      "spreadsheets",
      "databases",
      "multitasking",
      "time management",
      "communication",
      "problem solving",
      "positive attitude",
      "service-oriented",
      "HRIS systems",
      "Workday HR software"
    ],
    "short_keywords": [
      "administrative",
      "analytical",
      "attitude",
      "communication",
      "coordinator",
      "data",
      "databases",
      "duties",
      "hr",
      "hris",
      "human",
      "keeping",
      "management",
      "multitasking",
      "positive",
      "problem",
      "record",
      "resources",
      "serviceoriented",
      "skills",
      "software",
      "solving",
      "spreadsheets",
      "systems",
      "time",
      "workday"
    ]
  },
  {
    "job_id": "3902364806",
    "job_title": "Human Resources Manager",
    "category": "HR",
    "job_description": "DAILY TASKS:ADMINISTER OR OVERSEE THE ADMINISTRATION OF HR PROGRAMS INCLUDING, BUT NOT LIMITED TO, COMPENSATION, BENEFITS, AND LEAVE; DISCIPLINARY MATTERS; DISPUTES AND INVESTIGATIONS; PERFORMANCE AND TALENT MANAGEMENT; PRODUCTIVITY, RECOGNITION, AND MORALE; OCCUPATIONAL HEALTH AND SAFETY; AND TRAINING AND DEVELOPMENT.MONITOR AND ENSURE THE ORGANIZATION'S COMPLIANCE WITH FEDERAL, STATE, AND LOCAL EMPLOYMENT LAWS AND REGULATIONS, AND RECOMMENDED BEST PRACTICES; REVIEW AND MODIFY POLICIES AND PRACTICES TO MAINTAIN COMPLIANCE.COORDINATE AND IMPLEMENT POLICIES, PROCESSES, TRAINING, INITIATIVES, AND SURVEYS TO SUPPORT THE ORGANIZATION'S HR COMPLIANCE AND STRATEGY NEEDS.MAINTAIN KNOWLEDGE OF TRENDS, BEST PRACTICES, REGULATORY CHANGES, AND NEW TECHNOLOGIES IN HR AND EMPLOYMENT LAW.CONDUCT RESEARCH AND ANALYSIS OF ORGANIZATIONAL TRENDS, INCLUDING REVIEW OF REPORTS AND METRICS FROM THE ORGANIZATION'S HR INFORMATION SYSTEM.\nYOUR SKILLS:SHRM-CP REQUIRED. SHRM-SCP PREFERRED.BACHELOR'S DEGREE IN HR, BUSINESS ADMINISTRATION, OR RELATED FIELD REQUIRED, MASTERS DEGREE IS A PLUS.MINIMUM THREE YEARS OF EXPERIENCE IN AN HR MANAGEMENT ROLE.THOROUGH KNOWLEDGE OF EMPLOYMENT-RELATED LAWS AND REGULATIONS.ABILITY TO PICK UP ON CONCEPTS QUICKLY AND EXECUTE THEM WITH LITTLE OVERSIGHT.INTERPERSONAL AND CONFLICT RESOLUTION SKILLS.INTEGRITY, PROFESSIONALISM, AND DISCRETION.SPANISH FLUENCY IS A PLUS.RELIABLY COMMUTE TO OR PLANNING TO RELOCATE TO LOS ANGELES, CA (90010).\nOUR BENEFITS:PAID TIME OFF AND PAID HOLIDAYS.OPPORTUNITIES FOR GROWTH AND ADVANCEMENT.TEAM OUTINGS AND SPONSORED EVENTS.REFERRAL BONUS PROGRAM.FIRM-PAID MEDICAL HMO WITH AFFORDABLE UPGRADES.LOW-COST DENTAL AND VISION PLANS.FIRM-PAID LIFE AND AD&D INSURANCE.401K.FSA (FLEXIBLE SPENDING ACCOUNT).EAP (EMPLOYEE ASSISTANCE PROGRAM).PET INSURANCE.",
    "job_skill_set": [
      "Knowledge of employment-related laws",
      "HR Information System analysis",
      "Interpersonal skills",
      "Conflict resolution",
      "Integrity",
      "Professionalism",
      "Discretion",
      "Ability to learn quickly",
      "SHRM-CP",
      "SHRM-SCP",
      "Bachelor's degree in HR or related field",
      "Master's degree in HR or related field",
      "Spanish fluency"
    ],
    "short_keywords": [
      "ability",
      "analysis",
      "bachelors",
      "conflict",
      "degree",
      "discretion",
      "employmentrelated",
      "field",
      "fluency",
      "hr",
      "human",
      "in",
      "information",
      "integrity",
      "interpersonal",
      "knowledge",
      "laws",
      "learn",
      "manager",
      "masters",
      "of",
      "or",
      "professionalism",
      "quickly",
      "related",
      "resolution",
      "resources",
      "shrmcp",
      "shrmscp",
      "skills",
      "spanish",
      "system",
      "to"
    ]
  },
  {
    "job_id": "3902828543",
    "job_title": "Chief Human Resource Officer",
    "category": "HR",
    "job_description": "REPORTS TO THE CEO AND SERVES AS THE ON-SITE EXECUTIVE WITH ORGANIZATION-WIDE RESPONSIBILITY AND AUTHORITY FOR ALL AREAS RELATED TO HUMAN RESOURCES. THIS POSITION IS RESPONSIBLE FOR THE OVERALL ADMINISTRATION, COORDINATION, AND EVALUATION OF THE HUMAN RESOURCE FUNCTION; AND OVERSEES THE ANCILLARY DEPARTMENTS OF EDUCATION AND CULINARY SERVICES. THIS POSITION SERVES AS A MEMBER OF THE ORGANIZATION’S SENIOR MANAGEMENT TEAM WHICH PROVIDES VISIONARY AND PROGRESSIVE DIRECTION TO STRATEGIC AND OPERATIONAL PLANNING, QUALITY, AND FINANCIAL DECISION-MAKING.  RESPONSIBLE TO PROVIDE FOR THE SAFETY AND QUALITY OF CARE, TREATMENT, AND SERVICES OF ALL PATIENTS BY WORKING WITH OTHER LEADERS TO REVIEW AND APPROVE POLICIES AND PROCEDURES, SOLVE PROBLEMS, MANAGE CONFLICT, MAINTAIN ETHICAL STANDARDS, AND ENSURE PRACTICES THAT PROMOTE SAFETY AND QUALITY. RESPONSIBILITIESDEVELOP HR STRATEGY AND PLANS TO SUPPORT RIVERWOOD’S MISSION AND STRATEGIC VISION.DEVELOPS AND/OR INTERPRETS EMPLOYMENT LAW, POLICIES, AND PROCEDURES. ENSURES THAT THE HIGHEST STANDARDS OF EMPLOYMENT PRACTICES ARE ADVANCED THROUGHOUT ALL DEPARTMENTS ON A CONSISTENT BASIS IN PRACTICE AND PERFORMANCE. DEVELOP AND IMPLEMENT COMPREHENSIVE COMPENSATION AND BENEFITS PLANS THAT ARE COMPETITIVE AND COST-EFFECTIVE.PROVIDE OVERALL LEADERSHIP AND GUIDANCE TO THE HR FUNCTION BY OVERSEEING TALENT ACQUISITION, CAREER DEVELOPMENT, SUCCESSION PLANNING, RETENTION, TRAINING, LEADERSHIP DEVELOPMENT, COMPENSATION, AND BENEFITS. DEVELOP COMPREHENSIVE STRATEGIC RECRUITING AND RETENTION PLANS TO MEET THE HUMAN CAPITAL NEEDS OF STRATEGIC GOALS.\nQUALIFICATIONSTO PERFORM THIS JOB SUCCESSFULLY, AN INDIVIDUAL MUST BE ABLE TO PERFORM EACH ESSENTIAL DUTY SATISFACTORILY. THE REQUIREMENTS LISTED BELOW ARE REPRESENTATIVE OF THE KNOWLEDGE, SKILL AND/OR ABILITY REQUIRED. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS.",
    "job_skill_set": [
      "Human Resources Management",
      "Compensation and Benefits Planning",
      "Talent Acquisition",
      "Training and Development",
      "Strategic Planning",
      "Policy Development",
      "Leadership",
      "Communication",
      "Problem Solving",
      "Conflict Management",
      "Teamwork",
      "Decision-Making",
      "Employment Law",
      "Succession Planning",
      "Ethical Standards",
      "Visionary Thinking"
    ],
    "short_keywords": [
      "acquisition",
      "and",
      "benefits",
      "chief",
      "communication",
      "compensation",
      "conflict",
      "decisionmaking",
      "development",
      "employment",
      "ethical",
      "hr",
      "human",
      "law",
      "leadership",
      "management",
      "officer",
      "planning",
      "policy",
      "problem",
      "resource",
      "resources",
      "solving",
      "standards",
      "strategic",
      "succession",
      "talent",
      "teamwork",
      "thinking",
      "training",
      "visionary"
    ]
  },
  {
    "job_id": "3902752787",
    "job_title": "Executive Director of Human Resources, Spaulding Rehabilitation Hospital",
    "category": "HR",
    "job_description": "REPORTING TO THE REGIONAL VICE PRESIDENT FOR HUMAN RESOURCES, SPECIALTY HOSPITALS, THE EXECUTIVE DIRECTOR, HUMAN RESOURCES WILL PARTNER WITH THE RVP OF HR TO DELIVER THE HIGHEST QUALITY LEADERSHIP AND DRIVE TALENT STRATEGY FOR THE SPAULDING REHABILITATION HOSPITAL (SPAULDING), INCLUDING SPAULDING BOSTON, SPAULDING CAMBRIDGE, SPAULDING BRIGHTON, SPAULDING CAPE COD AND ALL AMBULATORY SITES.THE EXECUTIVE DIRECTOR, HR CONSULTS WITH EXECUTIVE LEADERSHIP TO DELIVER STRATEGIC WORKFORCE PLANS TO ENHANCE THE OBJECTIVES OF SPAULDING AND SUPPORT ITS GROWTH.THIS ROLE REQUIRES COLLABORATION BETWEEN THEIR HRBP TEAM AND THE CENTER OF EXCELLENCE (COE) LEADERS TO PROVIDE INNOVATIVE, CREATIVE SOLUTIONS THAT ARE DELIVERED ON TIME AND ON BUDGET.THIS POSITION REQUIRES A RESULTS-FOCUSED, FORWARD-THINKING HUMAN RESOURCES PROFESSIONAL WITH STRONG CHANGE MANAGEMENT SKILLS, ABLE TO PLAY AN IMPORTANT ROLE IN LEADING CORE HR FUNCTIONS AND STRATEGIC INITIATIVES THAT SUPPORT THE MISSION AND VISION OF THESE ORGANIZATIONS.\n\nRESPONSIBILITIES INCLUDE THE DEVELOPMENT AND IMPLEMENTATION OF PLANS AND/OR INITIATIVES TO OPTIMIZE HR SUPPORT AND FACILITATE ACHIEVEMENT OF ORGANIZATIONAL GOALS THROUGH LEADERS AND EMPLOYEES.\n\n IN COLLABORATION WITH THE SPAULDING EXECUTIVE LEADERSHIP TEAM AND THE RVP, DEVELOPS AND IMPLEMENTS A TALENT STRATEGY TO SUPPORT THE MISSION AND VISION OF SPAULDING, CONSISTENT WITH THE MGB SYSTEM TRANSFORMATION, AND SERVICE LINE DEVELOPMENT ACROSS THE MGB SYSTEM.DEVELOPS AND IMPLEMENTS HUMAN CAPITAL PLANS TO SUPPORT EFFICIENT AND EFFECTIVE OPERATIONS AND PARTNERS WITH OPERATIONAL LEADERS ON CHANGE MANAGEMENT.  IDENTIFIES & UNDERSTANDS KEY STRATEGIC GOALS OF THE ORGANIZATION TO ENSURE ALIGNMENT OF REQUIRED HR BUSINESS PARTNER (HRBP) RESOURCES AND SUPPORT FOR SUCCESS. DEVELOPS AND IMPLEMENTS ACTION PLANS AND METRICS IN COLLABORATION WITH THE HRBPS.  ASSESSES CURRENT STRUCTURE OF HRBP MODEL AND MAKES RECOMMENDATIONS FOR HOW TO IMPROVE EFFECTIVENESS OF SPAULDING STRATEGIC HRBP MODEL/STRUCTURE, CONSIDERING MGB SYSTEM AND SPAULDING OPERATIONAL TRANSFORMATION. CONSIDERS CHANGE MANAGEMENT IMPACT ON LOCAL OPERATIONS AND OPERATION LEADERS, PARTNERING WITH PEOPLE & ORGANIZATIONAL DEVELOPMENT TEAM FOR CHANGE MANAGEMENT SUPPORT.DEVELOPS PLAN FOR RESTRUCTURING, INCLUDING FUNDAMENTAL HR PROCESS & MANAGEMENT EDUCATION, AND WITH THE RVP, IMPLEMENTS CHANGES TO HRBP STRUCTURE.  ENSURES EFFECTIVE COMMUNICATION OF CRITICAL INFORMATION RELATED TO THE ORGANIZATIONAL TRANSFORMATION AND SYSTEM-WIDE PRIORITIES TO THE HRBP TEAM TO SUPPPRT EMPLOYEES THROUGH ORGANIZATIONAL RESTRUCTURING AND SERVICE LINE DEVELOPMENT.  PROVIDES MANAGEMENT OVERSIGHT TO DESIGNATED HR BUSINESS PARTNERS TEAM TO IMPLEMENT AND EVALUATE PROGRAMS, PLANS, AND INITIATIVES THAT RESULT IN INCREASED ORGANIZATIONAL EFFECTIVENESS AND LEADERSHIP ENGAGEMENT.  LEVERAGES DASHBOARD TO MEASURE ON-GOING PROGRESS IN KEY HR-RELATED AREA, INCLUDING KEY METRICS IDENTIFIED FOR LEADERS TO USE WORKFORCE ANALYTICS EFFECTIVELY.ANALYZES METRICS ON RECRUITMENT, EMPLOYEE TURNOVER AND DATA IMPACTING ABILITY TO STAFF, AND PRESENTS FINDINGS OPERATIONAL LEADERS IN ADDITION TO PROPOSING SOLUTIONS TO ADDRESS ANY OPERATIONAL CONCERNS.  DEVELOPS AND IMPLEMENTS HUMAN CAPITAL PLANS TO SUPPORT THE SPAULDING’S OPERATIONS AND GROWTH.ADVISES EXECUTIVE LEADERS AND HRBPS ON THE HUMAN CAPITAL STRATEGY INCLUDING HOW TO IDENTIFY TRENDS AND AREAS OF CONCERN ACROSS THE SYSTEM, AS WELL AS DEVELOPING AND IMPLEMENTING SOLUTIONS.  LEADS HRBP TEAM TO CONDUCT ORGANIZATIONAL AND TEAM CLIMATE ASSESSMENTS AND DEVELOP INTERVENTIONS TO ADDRESS CONFLICTS AND GAPS.  ENGAGES LEADERSHIP IN WORKING WITH HRBPS AS STRATEGIC BUSINESS PARTNERS, AND SUPPORTS CONTINUED DEVELOPMENT OF STRATEGIC CAPABILITIES FOR HRBPS.  LEADS HRBP TEAM WITH IMPLEMENTING SYSTEM-WIDE CHANGES INCLUDING MGB POLICY ALIGNMENT, BENEFITS CHANGES, COMPENSATION ASSESSMENTS, AND STRATEGIC WORKFORCE PLANNING, AND WITH ORGANIZATIONAL CHANGES RESULTING FROM SPAULDING ORGANIZATIONAL REDESIGN.  COLLABORATE WITH THE EMPLOYEE RELATIONS TEAM TO OVERSEE THE DAY TO DAY EMPLOYEE RELATIONS CASES, WORKING TO RESOLVE CONFLICT AND COACH SUPERVISORY & MANAGERIAL STAFF TO EFFECTIVELY MANAGE PERFORMANCE OF THEIR TEAMS.  ENSURES APPROPRIATE LEVEL OF SUPPORT IS PROVIDED TO HRBPS AND BUSINESS LEADERS BY THE HR SHARED SERVICES AND CENTERS OF EXPERTISE (HR COES).RESPONSIBLE FOR COLLABORATING WITH MGB HR DEPARTMENTS AND LEADERS, INCLUDING TOTAL REWARDS, TALENT ACQUISITION, EMPLOYEE RELATIONS, DIVERSITY AND INCLUSION, HR OPERATIONS AND COMPLIANCE, TO ENSURE SUPPORT OF CONTINUOUS ALIGNMENT AND COORDINATION OF HR AND WORKFORCE PRIORITIES AND INITIATIVES.WORKS WITH MGB HR OD TEAM TO ADDRESS LEADERSHIP AND TEAM DEVELOPMENT NEEDS.  EVALUATES PERFORMANCE OF HR SERVICE DELIVERY AGAINST NEEDS OF INDIVIDUAL BUSINESS SEGMENTS. ROUTINELY SURVEYS MANAGERS FOR FEEDBACK.  WORKS ACROSS HUMAN RESOURCES TO ENSURE THE MOST EFFECTIVE & EFFICIENT HR-RELATED PROCESSES, SYSTEMS AND INTERACTIONS THAT ADD VALUE TO LEADERSHIP AND ADDRESS DAY-TO-DAY OPERATIONAL ISSUES AND CHALLENGES. \n\nQUALIFICATIONS\n\n A BACHELOR’S DEGREE IN BUSINESS, HR, ORGANIZATIONAL DEVELOPMENT, OR RELATED FIELD IS REQUIRED. AN ADVANCED DEGREE IS DESIRABLE.  10+ YEARS OF INCREASINGLY RESPONSIBLE HR EXPERIENCE.  PHR, SPHR OR PHR CERTIFICATION IS DESIRABLE.  BROAD EXPERIENCE AS HUMAN RESOURCES PROFESSIONAL INCLUDINGER/LR, TALENT MANAGEMENT, RECRUITMENT AND RETENTION, COMPENSATION, BENEFITS, HRIS AND LEADERSHIP DEVELOPMENT.  EXPERIENCE TRANSITIONING TO A STRATEGIC HRBP MODEL AND IMPLEMENTING SIGNIFICANT OPERATIONAL CHANGES PREFERRED. \n\nPRIMARY LOCATION\n\nMA-CHARLESTOWN-MGB SPAULDING CHARLESTOWN\n\nWORK LOCATIONS\n\nMGB SPAULDING CHARLESTOWN\n\nJOB\n\nHUMAN RESOURCES - MANAGEMENT\n\nORGANIZATION\n\nMASS GENERAL BRIGHAM\n\nSCHEDULE\n\nFULL-TIME\n\nSTANDARD HOURS\n\n40\n\nSHIFT\n\nDAY JOB\n\nEMPLOYEE STATUS\n\nREGULAR\n\nRECRUITING DEPARTMENT\n\nMGB HUMAN RESOURCES\n\nJOB POSTING\n\nAPR 17, 2024",
    "job_skill_set": [
      "HR Management",
      "Talent Strategy",
      "Change Management",
      "Workforce Planning",
      "Employee Relations",
      "Recruitment and Retention",
      "Compensation and Benefits",
      "HRIS",
      "Leadership Development",
      "Organizational Development",
      "Data Analysis",
      "Performance Management",
      "Operational Transformation",
      "Collaboration",
      "Communication",
      "Problem Solving",
      "Leadership",
      "Strategic Thinking",
      "Interpersonal Skills",
      "Conflict Resolution",
      "Adaptability",
      "Coaching",
      "Feedback Reception",
      "Diversity and Inclusion",
      "Strategic HRBP Model",
      "Human Capital Planning"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "and",
      "benefits",
      "capital",
      "change",
      "coaching",
      "collaboration",
      "communication",
      "compensation",
      "conflict",
      "data",
      "development",
      "director",
      "diversity",
      "employee",
      "executive",
      "feedback",
      "hospital",
      "hr",
      "hrbp",
      "hris",
      "human",
      "inclusion",
      "interpersonal",
      "leadership",
      "management",
      "model",
      "of",
      "operational",
      "organizational",
      "performance",
      "planning",
      "problem",
      "reception",
      "recruitment",
      "rehabilitation",
      "relations",
      "resolution",
      "resources",
      "retention",
      "skills",
      "solving",
      "spaulding",
      "strategic",
      "strategy",
      "talent",
      "thinking",
      "transformation",
      "workforce"
    ]
  },
  {
    "job_id": "3901636810",
    "job_title": "Human Resources Coordinator",
    "category": "HR",
    "job_description": "*PLEASE NO SOLICITATIONS FROM 3RD PARTY AGENCIES. WE RESPECT THE WORK YOU DO, BUT WILL NOT BE OUTSOURCING THE RECRUITMENT OF THIS POSITION.\nHUMAN RESOURCES COORDINATOR  DIY MEDIA GROUP IS EXCITED TO ANNOUNCE THE JOB OPENING FOR AN HR COORDINATOR. IN THIS ROLE, YOU’LL BE SUPPORTING A SMALL HR TEAM AND VERY QUICKLY GAIN EXPOSURE TO ALL AREAS WITHIN HR. YOU WILL IMMEDIATELY CONTRIBUTE TO THE TEAM’S SUCCESS AS YOU LEARN BEST PRACTICES FOR HR ADMINISTRATION. AS YOU MASTER NEW SKILLS, YOU’LL TAKE OWNERSHIP OF HR PROCESSES AND PROJECTS OF INCREASING RESPONSIBILITY. THIS ROLE IS PART OF A DOCUMENTED CAREER PATH TO SUPPORT YOUR GROWTH INTO AN HR GENERALIST. BECAUSE THE HR COORDINATOR WILL REPORT DIRECTLY TO THE VICE PRESIDENT OF HUMAN RESOURCES, YOU’LL HAVE DIRECT ACCESS AND VISIBILITY TO A MEMBER OF DIY’S C-SUITE. THE HR TEAM SUPPORTS APPROXIMATELY 200+ EMPLOYEES WITH APPROXIMATELY 50% REPORTING ONSITE FOR MANUFACTURING POSITIONS AND 50% WORKING REMOTELY NATIONWIDE. TO BEST SUPPORT OUR MANUFACTURING EMPLOYEES, THE HR COORDINATOR WILL REPORT FULL-TIME ONSITE TO OUR PENNSAUKEN, NJ (SOUTH JERSEY/PHILADELPHIA AREA) HEADQUARTERS. ONCE TRAINED AND ABLE TO WORK INDEPENDENTLY, THE HR COORDINATOR WILL HAVE THE OPTION TO WORK FROM HOME ONE DAY PER WEEK. EDUCATIONAL/EXPERIENCE REQUIREMENTS:BACHELOR’S DEGREE IN HR OR IN BUSINESS (WITH A CONCENTRATION IN HR). DIRECT WORK EXPERIENCE SUCH AS AN HR INTERNSHIP, HR CERTIFICATION OR RELEVANT MILITARY EXPERIENCE MAY BE CONSIDERED IN LIEU OF A DEGREE. MUST POSSESS A BASIC UNDERSTANDING OF EMPLOYMENT LAWS SUCH AS FMLA, ADA, FLSA, ETC.PREVIOUS HRIS/ATS/REPORTING EXPERIENCE IS A PLUS. RESPONSIBILITIES / TASKS: (THIS IS A BRIEF OVERVIEW. A DETAILED JOB DESCRIPTION WILL BE PROVIDED AS PART OF THE INTERVIEW PROCESS.)BE THE PRIMARY POINT OF CONTACT FOR GENERAL HR SUPPORT SUCH AS DESIGNING EMPLOYEE ANNOUNCEMENTS AND RECOGNITION (VIA CANVA) FOR OUR COMMUNICATIONS BOARD; CREATING AND DEACTIVATING EMPLOYEE ID BADGES; RESETTING SYSTEM PASSWORDS; AND FULFILLING REQUESTS FOR UNEMPLOYMENT AND EMPLOYMENT VERIFICATION FORMS.OWN THE FULL RECRUITING LIFE CYCLE: JOB POSTING, PHONE SCREENING, INTERVIEW SCHEDULING, BACKGROUND AND REFERENCE CHECKING, EXTENDING EMPLOYMENT OFFERS AND ASSISTING THE TRAINING MANAGER WITH NEW HIRE ONBOARDING.PROVIDE EMPLOYEE BENEFITS SUPPORT WITH ENROLLMENT, QUALIFIED LIFE CHANGES, CLAIMS QUESTIONS AND OFF-BOARDING. MAINTAIN HR COMPLIANCE THROUGH PROCESSES SUCH AS MANDATED ANNUAL SAFETY AND DIVERSITY TRACKING AND REPORTING, AND BY PROVIDING EMPLOYEES WITH REQUIRED LEGAL UPDATES AND NOTIFICATIONS.SUPPORT EMPLOYEE ENGAGEMENT THROUGH OWNERSHIP OF THE COMPANY’S ANNIVERSARY RECOGNITION PROGRAM AND EMPLOYEE COMMUNICATION BOARDS.BE AN HR CHAMPION BY ENSURING ALL EMPLOYEES KNOW THE BENEFITS AND DEVELOPMENT OPPORTUNITIES AVAILABLE THROUGH DIY. PROACTIVELY SEEK OPPORTUNITIES FOR INDIVIDUAL, DEPARTMENTAL AND COMPANY CONTINUOUS IMPROVEMENT. SPECIAL SKILLS REQUIRED:MUST ALIGN WITH DIY’S CORE VALUES: -LOVE YOUR CUSTOMER -BE WORLD CLASS -DO THE RIGHT THING -SEEK GROWTH -COMMUNICATE CLEARLY -EMBRACE OUR COMMUNITY -SHOW RESPECTMUST POSSESS PROFICIENCY WITH ALL MICROSOFT OFFICE PROGRAMS AND VIRTUAL MEETING PLATFORMS SUCH AS ZOOM AND HAVE THE TECHNICAL APTITUDE TO LEARN AND MASTER HR SYSTEMS SUCH AS PAYLOCITY (HRIS) AND PLANSOURCE (BENEFITS PORTAL).MUST BE ABLE TO FOCUS AND PAY CLOSE ATTENTION TO DETAIL.MUST DEMONSTRATE STRONG COMMUNICATION, INTERPERSONAL AND TIME MANAGEMENT SKILLS AND HAVE THE WILLINGNESS AND ABILITY TO COMMUNICATE IN FRONT OF GROUPS (I.E. TOWN HALL MEETINGS, ORIENTATIONS, DEPARTMENT HUDDLES, ETC.).MUST BE ABLE TO ESTABLISH AND MAINTAIN STRONG BUSINESS RELATIONSHIPS WITH ALL LEVELS WITHIN THE ORGANIZATION AND EXTERNAL BUSINESS PARTNERS.MUST BE A TEAM PLAYER AND EXHIBIT FLEXIBILITY IN AN ENVIRONMENT WHERE PRIORITIES AND RESPONSIBILITIES CONSTANTLY CHANGE.MUST BE TRUSTWORTHY AND MAINTAIN CONFIDENTIALITY WITH SENSITIVE EMPLOYEE, DEPARTMENT, AND COMPANY INFORMATION.BILINGUAL SKILLS ARE A PLUS. PHYSICAL REQUIREMENTS:THIS IS A FULL-TIME ONSITE POSITION WITH THE OPPORTUNITY TO WORK ONE SCHEDULED DAY FROM HOME PER WEEK, ONCE TRAINED.MUST BE ABLE TO PERFORM AT A COMPUTER WORKSTATION FOR UP TO 8 HOURS PER DAY, INCLUDING FINE MANIPULATION OF A KEYBOARD AND MOUSE, AND ON-CAMERA VIRTUAL MEETINGS.\nTO APPLY: DO NOT APPLY VIA LINKEDIN. TO BE FORMALLY CONSIDERED, YOU MUST COMPLETE OUR ONLINE APPLICATION AT WWW.DIYMEDIAGROUP.COM/OPEN-POSITIONS. WE ARE A GOVERNMENT CONTRACTOR AND THEREFORE, WE ARE UNABLE TO ACCEPT LINKEDIN PROFILES IN LIEU OF APPLICATIONS.\nEEO EMPLOYER F/M/VET/DISABLEDIF YOU'D LIKE MORE INFORMATION ABOUT YOUR EEO RIGHTS AS AN APPLICANT UNDER THE LAW, PLEASE DOWNLOAD THE AVAILABLE EEO IS THE LAW APPLICANT: HTTPS://WWW.EEOC.GOV/SITES/DEFAULT/FILES/MIGRATED_FILES/EMPLOYERS/POSTER_SCREEN_READER_OPTIMIZED.PDF\nPLEASE REVIEW OUR PAY TRANSPARENCY NONDISCRIMINATION PROVISION AT: HTTPS://WWW.DOL.GOV/SITES/DOLGOV/FILES/OFCCP/PDF/PAY-TRANSP_ENGLISH_UNFORMATTEDESQA508C.PDF",
    "job_skill_set": [
      "Microsoft Office",
      "communication",
      "interpersonal skills",
      "time management",
      "teamwork",
      "attention to detail",
      "problem solving",
      "bilingual skills",
      "HRIS",
      "ATS",
      "Canva",
      "Paylocity",
      "Plansource",
      "employment laws",
      "flexibility",
      "trustworthiness"
    ],
    "short_keywords": [
      "ats",
      "attention",
      "bilingual",
      "canva",
      "communication",
      "coordinator",
      "detail",
      "employment",
      "flexibility",
      "hr",
      "hris",
      "human",
      "interpersonal",
      "laws",
      "management",
      "microsoft",
      "office",
      "paylocity",
      "plansource",
      "problem",
      "resources",
      "skills",
      "solving",
      "teamwork",
      "time",
      "to",
      "trustworthiness"
    ]
  },
  {
    "job_id": "3887474527",
    "job_title": "Human Resources Generalist",
    "category": "HR",
    "job_description": "WE'RE NOT JUST IN THE PACKAGING BUSINESS–WE'RE IN THE \"WOW\" BUSINESS\n\nPREGIS IS IN THE PACKAGING BUSINESS TO PROTECT WHAT MATTERS. WE ARE COMMITTED TO PROVIDING OUR CUSTOMERS AND EMPLOYEES SUSTAINABLE GROWTH THROUGH PURPOSE-DRIVEN INNOVATION AND CUSTOMER-CENTRIC PACKAGING SOLUTIONS. IF YOU ARE LOOKING FOR A COMPANY THAT IS THRIVING ACROSS VARIOUS HIGH GROWTH INDUSTRIES AND IS INNOVATIVE, CUSTOMER FOCUSED, HIGH INTEGRITY, BELIEVES IN STRONG TEAMWORK AND COLLABORATION, PREGIS IS THE COMPANY FOR YOU. CHECK OUT THE PREGIS PURPOSE TO LEARN HOW SUSTAINABILITY AND SOCIAL RESPONSIBILITY IS AT THE VERY CORE OF OUR COMPANY DNA. \n\nPOSITION SUMMARY \nPREGIS CORPORATION, A LEADING GLOBAL PROVIDER OF INNOVATIVE PACKAGING SOLUTIONS, SEEKS A HUMAN RESOURCES GENERALIST BASED AT ITS PLYMOUTH, IN MANUFACTURING FACILITY. \nTHIS INDIVIDUAL WILL BE PRIMARILY RESPONSIBLE FOR THE DAY-TO-DAY ADMINISTRATION OF HUMAN RESOURCES PROGRAMS AND PROCESSES FOR PLANT PERSONNEL INCLUDING COMPENSATION, BENEFITS, TRAINING AND RECRUITING, AND WILL ALSO SUPPORT THE TALENT NEEDS OF THE SALARIED TEAM IN THE LOCATION. THIS POSITION WILL ALSO SUPPORT EMPLOYEE ENGAGEMENT AND HEALTH AND SAFETY INITIATIVES INCLUDING BUILDING A STRONG SAFETY CULTURE, COMPLETING SAFETY TRAINING, AND INITIATING ACCIDENT INVESTIGATION WHEN NECESSARY.  \nRESPONSIBILITIES \nRESPONSIBLE FOR ALL ASPECTS OF TALENT AND CULTURE IN THE LOCATION; PARTNER CLOSELY WITH THE PLANT MANAGER AND LEADERSHIP TEAM TO ENSURE A SAFE AND ENGAGED WORKFORCE.WORK WITH PLANT MANAGER TO DETERMINE PLANT LEVEL STAFFING; PARTICIPATE/COORDINATE RECRUITMENT EFFORTS FOR EXEMPT, NON-EXEMPT, AND TEMPORARY WORKERS WITHIN PROCESS AND PROCEDURE;RECRUIT FOR ALL HOURLY ROLES IN THE PLANT AND MANAGE ALL TEMP LABORPARTNER PRIMARILY WITH PLANT MANAGER AS WELL AS OTHER DEPARTMENT LEADS TO ASSESS, RESPOND AND ESCALATE EMPLOYEE ISSUES AS NEEDED TO ENSURE APPROPRIATE RESOLUTION.PROCESS PRE-EMPLOYMENT REQUIREMENTS INCLUDING DRUG TESTS AND BACKGROUND CHECKS AS REQUIRED.COMPLETE ORIENTATION AND ONBOARDING OF NEW EMPLOYEES INCLUDING PERIODIC FOLLOW UP TO ENSURE ASSIMILATION AND ENGAGEMENTCOMMUNICATE BENEFIT CHANGES TO EMPLOYEESCOORDINATE WORKERS COMPENSATION AS REQUIRED.COMPLETE REQUIRED PAPERWORK AS NEEDED TO EFFECT EMPLOYMENT-RELATED CHANGES (HIRING, TERMINATION, ROLE CHANGES, COMPENSATION CHANGES)COMPLETE WAGE STUDIES FOR HOURLY WORKERS AS NEEDED AND MAKE RECOMMENDATIONS REGARDING ADJUSTMENTS TO MAINTAIN MARKET COMPETITIVENESSMAINTAIN A POSITIVE EMPLOYEE RELATIONS CULTURE WITH FOCUS ON BUILDING STRONG COMMUNICATIONS BETWEEN SUPERVISORS AND TEAM MEMBERSMAINTAIN RECORDS AND PREPARE DOCUMENTATION TO MAINTAIN GOVERNMENTAL AND LEGAL COMPLIANCE.CONDUCT EXIT INTERVIEWSENSURE COMPLIANCE WITH ALL FEDERAL, STATE, AND LOCAL EMPLOYMENT LAWSASSISTS WITH THE DELIVERY OF EFFECTIVE EHS TRAINING TO SUPERVISORS AND EMPLOYEES.PARTICIPATE IN SAFETY AUDITS OF OPERATIONS TO IDENTIFY EXISTING/POTENTIAL HAZARDOUS CONDITIONS.PARTICIPATES IN THE IMPLEMENTATION OF SAFETY GUIDELINES AND RELATED HEALTH AND SAFETY COMMUNICATIONS AND EDUCATIONAL INFORMATION.MAINTAINS SAFETY RECORDS TO ENSURE COMPLIANCE WITH DOCUMENTATION PRACTICES.PARTICIPATES IN ACCIDENT INVESTIGATION AND PROVIDES RECOMMENDATIONS TO PREVENT RECURRENCE.IMPLEMENT PROGRAMS TO REDUCE WORKER’S COMPENSATION COSTS.OTHER DUTIES AS ASSIGNED  \nEXPERIENCE & SKILLS \nBACHELOR’S DEGREE REQUIREDMANUFACTURING INDUSTRY EXPERIENCE PREFERRED.BI-LINGUAL PREFERREDEXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLS TO ALL ORGANIZATION LEVELSSTRONG PROBLEM-SOLVING SKILLSABILITY TO RESPOND QUICKLY AND EFFICIENTLY IN EMERGENCY SITUATIONS EXERCISING A CALM APPROACHPROACTIVE IN APPROACH; SHOWS OWNERSHIP AND DRIVEABILITY TO MANAGE MULTIPLE PRIORITIES SIMULTANEOUSLYABILITY TO DE-ESCALATE SITUATIONS AND HELP MANAGE CONFLICTSTRONG COMPUTER SKILLS: INTERMEDIATE KNOWLEDGE OF MICROSOFT OFFICE SUITE INCLUDING WORD, EXCEL, POWERPOINT AND OUTLOOK\n\n\nDIVERSITY AND INCLUSION\n\nWE BELIEVE IN DIVERSITY OF THOUGHT AND BRINGING TOGETHER OTHER TRAITS AND CHARACTERISTICS THAT MAKE AN INDIVIDUAL BRING A UNIQUE EXPERIENCE TO PREGIS. WE STRIVE TO FOSTER AN INCLUSIVE ENVIRONMENT WHERE BEHAVIORS AND SOCIAL NORMS ENSURE PEOPLE ARE WELCOME. \n\nAFFIRMATIVE ACTION/EEO STATEMENT/INCLUSION \nWE OFFER EQUAL EMPLOYMENT OPPORTUNITIES TO ALL EMPLOYEES AND APPLICANTS FOR EMPLOYMENT AND PROHIBIT DISCRIMINATION AND HARASSMENT OF ANY TYPE BASED ON RACE, COLOR, RELIGION, AGE, SEX, NATIONAL ORIGIN, DISABILITY STATUS, GENETICS, PROTECTED VETERAN STATUS, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, OR ANY OTHER CHARACTERISTIC PROTECTED BY FEDERAL, STATE OR LOCAL LAWS. WE SUPPORT INCLUSION AND BELIEVE IN WELCOMING A COLLECTIVE SUM OF INDIVIDUAL DIFFERENCES, THOUGHTS, TRAITS, AND CHARACTERISTICS TO REPRESENT PREGIS’ CULTURE AND ACHIEVEMENTS.\n\nVISIT US AT WWW.PREGIS.COM FOR MORE INFORMATION ABOUT PREGIS LLC.",
    "job_skill_set": [
      "human resources administration",
      "recruitment",
      "employee engagement",
      "compensation management",
      "benefits administration",
      "Microsoft Office Suite",
      "data compliance",
      "communication",
      "problem solving",
      "conflict management",
      "proactive approach",
      "multitasking",
      "teamwork",
      "calm under pressure",
      "ownership and drive",
      "safety training",
      "accident investigation",
      "bilingual communication"
    ],
    "short_keywords": [
      "accident",
      "administration",
      "and",
      "approach",
      "benefits",
      "bilingual",
      "calm",
      "communication",
      "compensation",
      "compliance",
      "conflict",
      "data",
      "drive",
      "employee",
      "engagement",
      "generalist",
      "hr",
      "human",
      "investigation",
      "management",
      "microsoft",
      "multitasking",
      "office",
      "ownership",
      "pressure",
      "proactive",
      "problem",
      "recruitment",
      "resources",
      "safety",
      "solving",
      "suite",
      "teamwork",
      "training",
      "under"
    ]
  },
  {
    "job_id": "3901349998",
    "job_title": "Human Resources Coordinator",
    "category": "HR",
    "job_description": "BE A PART OF OUR REVOLUTIONARY MISSION!OUR MISSION IS TO BECOME THE FIRST TRULY GLOBAL PEOPLE-FOCUSED F&B BRAND. TO ACHIEVE THIS, WE STRIVE TO CREATE A CULTURE BASED AROUND OUR VIRTUES AND OPERATIONAL EXCELLENCE WITHIN OUR THREE COMPANY FOCUS AREAS: A HIGH DEGREE OF EMPLOYEE ENGAGEMENT, DELIVERING GREAT GUEST EXPERIENCES AND SECURING A STRONG FINANCIAL PERFORMANCE.OUR UNIQUE COMPANY CULTURE IS THE BACKBONE OF OUR COMPANY’S SUCCESS, WHICH RELIES ON OUR EMPLOYEES TO ADHERE TO AND PROMOTE OUR COMPANY VIRTUES: POSITIVE ATTITUDE, INCLUSION, SOCIAL TIES, AND GROWTH.WE CONSIST OF A DIVERSE RANGE OF PEOPLE WITH DIFFERENT AND UNIQUE SKILL SETS, WHO ALL HAVE IN COMMON THAT THEY’RE EXTREMELY PASSIONATE ABOUT THEIR WORK. WE ARE FIRST AND FOREMOST LOOKING FOR A PERSON WITH THE RIGHT MINDSET AND PERSONALITY.\nJOB SUMMARY – WHAT IT’S ALL ABOUT\nAS A HUMAN RESOURCES COORDINATOR, YOU WILL PLAY A CRUCIAL ROLE IN OUR HR TEAM, SUPPORTING VARIOUS FUNCTIONS TO ENSURE THE SMOOTH OPERATION OF HR PROCESSES. YOUR RESPONSIBILITIES WILL INCLUDE ASSISTING WITH ONBOARDING, AND EMPLOYEE RELATIONS, AS WELL AS HANDLING ADMINISTRATIVE TASKS. YOU'LL BE RESPONSIBLE FOR COORDINATING RECRUITMENT EFFORTS, FACILITATING NEW HIRE ONBOARDING, MANAGING EMPLOYEE INQUIRIES, AND MAINTAINING ACCURATE RECORDS. WE'RE SEEKING A DETAIL-ORIENTED INDIVIDUAL WITH EXCELLENT COMMUNICATION SKILLS AND A PROACTIVE APPROACH TO JOIN OUR TEAM AND CONTRIBUTE TO THE SUCCESS OF OUR ORGANIZATION.SUCCESS AS A HUMAN RESOURCES COORDINATOR DEMANDS STRONG COMMUNICATION, ATTENTION TO DETAIL, ADAPTABILITY, AND ETHICAL INTEGRITY. IT HINGES ON ADEPTLY MANAGING ADMINISTRATIVE TASKS, NAVIGATING DIVERSE INTERACTIONS, AND UPHOLDING HR POLICIES WITH DISCRETION. PROACTIVITY AND COLLABORATION FOSTER POSITIVE RELATIONSHIPS AND CONTRIBUTE TO A THRIVING ORGANIZATIONAL CULTURE.\nKEY RESPONSIBILITIES – WHAT YOU’LL DO\nEMPLOYEE ONBOARDING AND TRAINING: COORDINATE AND FACILITATE NEW EMPLOYEE ORIENTATION AND ONBOARDING PROCESS, ENSURE ALL NECESSARY PAPERWORK, TRAINING MATERIALS, AND RESOURCES ARE PREPARED AND AVAILABLE FOR NEW HIRES, AND ASSIST IN CONDUCTING INITIAL TRAINING SESSIONS FOR NEW EMPLOYEES. RECORD KEEPING AND COMPLIANCE: MAINTAIN ACCURATE AND UP-TO-DATE EMPLOYEE RECORDS AND HR DATABASES, MANAGER PERSONNEL FILES, INCLUDING EMPLOYMENT CONTRACTS, AND PERFORMANCE EVALUATIONS, ENSURE COMPLIANCE WITH DATA PROTECTION AND CONFIDENTIALITY GUIDELINES.\nEMPLOYEE RELATIONS: ASSIST IN RESOLVING MINOR EMPLOYEE ISSUES AND CONFLICTS, ESCALATING MORE COMPLEX MATTERS TO HR MANAGEMENT, CONTRIBUTE TO FOSTERING A POSITIVE AND INCLUSIVE WORK ENVIRONMENT, FACILITATE EFFECTIVE COMMUNICATION BETWEEN HR, MANAGEMENT AND EMPLOYEES.\nCOMMUNICATION AND INFORMATION MANAGEMENT: UPDATE COMPANY COMMINATION CHANNELS WITH HR-RELATED ANNOUNCEMENTS AND INFORMATION, STAY OPEN TO LEARNING NEW HR SOFTWARE AND TOOLS TO ENHANCE EFFICIENCY. \nCONTINUOUS IMPROVEMENT AND ADAPTATION: ADAPT TO CHANGING HR PROCESSES AND CONTRIBUTE IDEAS FOR CONTINUOUS IMPROVEMENT, OPEN TO INCREASING DUTIES AND AD HOC RESPONSIBILITIES. \nTHE JUICE – OUR BENEFITS\nMEDICAL/DENTAL/VISION COVERAGECOMMUTER REIMBURSEMENT ACCOUNT THROUGH AMERIFLEX401K PLAN FOR RETIREMENT SAVINGSEMPLOYEE MEAL PLANFREE COFFEE – DUH’NEW PARENT LEAVEAN OPPORTUNITY TO MAKE A REAL IMPACT ON THE PEOPLE AROUND YOU, BOTH BY GROWING THEM AND BY CONNECTING THEM TO REAL FOODA COLLABORATIVE TEAM OF PEOPLE WHO LIVE OUR CORE VALUES AND HAVE YOUR BACK.A CLEAR CAREER PATH WITH OPPORTUNITIES FOR DEVELOPMENT, BOTH PERSONALLY AND PROFESSIONALLY.\nKEY QUALIFICATIONS – WHAT YOU’VE GOT\nMINIMUM 1 YEAR IN AN HR COORDINATOR OR SIMILAR ROLE.EXPERIENCE IN THE FOOD & BEVERAGE INDUSTRY IS DESIRABLE.EXCELLENT INTERPERSONAL SKILLS.STRONG ORGANIZATIONAL SKILLS.A RESOURCEFUL, SOLUTION-ORIENTED APPROACH TO JOB RESPONSIBILITIES. \nNOTICE OF NON-DISCRIMINATION POLICYHTTPS://TINYURL.COM/JOEJUICENOTICE",
    "job_skill_set": [
      "employee onboarding",
      "record keeping",
      "HR software",
      "data protection compliance",
      "administrative tasks",
      "recruitment coordination",
      "performance evaluations",
      "HR policies",
      "communication",
      "attention to detail",
      "adaptability",
      "proactivity",
      "collaboration",
      "interpersonal skills",
      "problem solving",
      "ethical integrity"
    ],
    "short_keywords": [
      "adaptability",
      "administrative",
      "attention",
      "collaboration",
      "communication",
      "compliance",
      "coordination",
      "coordinator",
      "data",
      "detail",
      "employee",
      "ethical",
      "evaluations",
      "hr",
      "human",
      "integrity",
      "interpersonal",
      "keeping",
      "onboarding",
      "performance",
      "policies",
      "proactivity",
      "problem",
      "protection",
      "record",
      "recruitment",
      "resources",
      "skills",
      "software",
      "solving",
      "tasks",
      "to"
    ]
  },
  {
    "job_id": "3904947962",
    "job_title": "Vice President Human Resources",
    "category": "HR",
    "job_description": "VISITING NURSE HEALTH SYSTEM, CELEBRATING ITS 75TH ANNIVERSARY, IS LOOKING FOR A DYNAMIC, MISSION-DRIVEN HUMAN RESOURCE VICE PRESIDENT TO LEAD THE HUMAN RESOURCES OPERATION. WE ARE A NOT-FOR-PROFIT ORGANIZATION OF 400 EMPLOYEES IN SANDY SPRINGS, GA, PROVIDING HOME HEALTH, HOSPICE, PALLIATIVE, AND COMMUNITY CARE SERVICES ACROSS THE ATLANTA METRO AREA. THE VICE PRESIDENT OF HUMAN RESOURCES IS RESPONSIBLE FOR THE OVERALL STRATEGIC DIRECTION AND OVERSIGHT OF THE HUMAN RESOURCES FUNCTION, INCLUDING RECRUITMENT, COMPENSATION, EMPLOYEE BENEFITS, EMPLOYEE RELATIONS, PAYROLL, EMPLOYEE HEALTH, LEADERSHIP DEVELOPMENT, AND COMPLIANCE WITH FEDERAL AND STATE REGULATIONS. THE POSITION WILL REPORT TO THE PRESIDENT AND CEO. OUR CURRENT VP OF HUMAN RESOURCES IS RETIRING AND WILL PROVIDE ONBOARDING AND ACTIVE SUPPORT THROUGHOUT 2024. THE IDEAL CANDIDATE WILL TAKE US OVER THE FINISHING LINE OF A SIGNIFICANT REDESIGN IN HUMAN RESOURCES OPERATIONS, PROCESS IMPROVEMENTS, STAFFING, AND IMPLEMENTATION OF ADP'S WORKFORCE NOW PLATFORM. WE NEED SOMEONE WHOSE HR LEADERSHIP RUNS WIDE AND DEEP, FOCUSING ON STRATEGY, INNOVATION, AND TECHNOLOGY WITH A PEOPLE-FIRST MINDSET. AT VNHS, DATA IS A DRIVING FOCAL POINT TO SUPPORT IMPACTFUL HR FRAMEWORKS THAT SUCCESSFULLY ATTRACT, REWARD, DEVELOP, AND RETAIN TOP TALENT. IF YOU ARE AN ENGAGING LEADER WHO LOVES A CHALLENGE WITH BROAD-BASED TECHNICAL HR SKILLS AND YOUR HEART, EXPERIENCE AND QUALIFICATIONS ALIGN WITH WHAT WE SEEK, CLICK TO SEND YOUR RESUME. VISITING NURSE HEALTH SYSTEM PROVIDES EQUAL EMPLOYMENT OPPORTUNITIES TO ALL EMPLOYEES AND APPLICANTS FOR EMPLOYMENT AND PROHIBITS DISCRIMINATION AND HARASSMENT OF ANY TYPE WITHOUT REGARD TO RACE, COLOR, RELIGION, AGE, SEX, NATIONAL ORIGIN, DISABILITY STATUS, GENETICS, PROTECTED VETERAN STATUS, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, OR ANY OTHER CHARACTERISTIC PROTECTED BY FEDERAL, STATE, OR LOCAL LAWS.  \n",
    "job_skill_set": [
      "strategic direction",
      "recruitment",
      "compensation",
      "employee benefits",
      "employee relations",
      "payroll",
      "process improvements",
      "HR technology",
      "communication",
      "innovation",
      "problem solving",
      "people-first mindset",
      "engagement",
      "collaboration",
      "employee health",
      "leadership development",
      "compliance",
      "ADP Workforce Now",
      "data analysis",
      "leadership"
    ],
    "short_keywords": [
      "adp",
      "analysis",
      "benefits",
      "collaboration",
      "communication",
      "compensation",
      "compliance",
      "data",
      "development",
      "direction",
      "employee",
      "engagement",
      "health",
      "hr",
      "human",
      "improvements",
      "innovation",
      "leadership",
      "mindset",
      "now",
      "payroll",
      "peoplefirst",
      "president",
      "problem",
      "process",
      "recruitment",
      "relations",
      "resources",
      "solving",
      "strategic",
      "technology",
      "vice",
      "workforce"
    ]
  },
  {
    "job_id": "3904086620",
    "job_title": "Human Resources Generalist",
    "category": "HR",
    "job_description": "HR GENERALISTWE ARE SEEKING AN EXPERIENCED HR GENERALIST TO JOIN OUR TEAM AND SUPPORT VARIOUS HUMAN RESOURCES FUNCTIONS. THE IDEAL CANDIDATE WILL HAVE A COMPREHENSIVE UNDERSTANDING OF HR PRINCIPLES AND PRACTICES, EXCELLENT COMMUNICATION SKILLS, AND THE ABILITY TO HANDLE MULTIPLE TASKS EFFICIENTLY. THE HR GENERALIST WILL BE RESPONSIBLE FOR RECRUITMENT, EMPLOYEE RELATIONS, PERFORMANCE MANAGEMENT, BENEFITS ADMINISTRATION, AND OTHER HR-RELATED TASKS TO ENSURE THE SMOOTH OPERATION OF THE ORGANIZATION'S HUMAN RESOURCES DEPARTMENT.\nRESPONSIBILITIES:RECRUITMENT AND ONBOARDING:MANAGE THE FULL RECRUITMENT CYCLE, INCLUDING JOB POSTINGS, SCREENING RESUMES, CONDUCTING INTERVIEWS, AND MAKING HIRING RECOMMENDATIONS.COORDINATE AND CONDUCT NEW EMPLOYEE ORIENTATION PROGRAMS TO ENSURE SMOOTH ONBOARDINGEMPLOYEE RELATIONS:SERVE AS A POINT OF CONTACT FOR EMPLOYEE INQUIRIES AND CONCERNS, PROVIDING GUIDANCE AND SUPPORT AS NEEDED.ADDRESS EMPLOYEE RELATIONS ISSUES PROMPTLY AND EFFECTIVELY, FOSTERING A POSITIVE WORK ENVIRONMENT.PERFORMANCE MANAGEMENT:ADMINISTER PERFORMANCE APPRAISAL PROCESSES, INCLUDING GOAL SETTING, PERFORMANCE REVIEWS, AND DEVELOPMENT PLANNING.PROVIDE COACHING AND SUPPORT TO MANAGERS AND EMPLOYEES TO IMPROVE PERFORMANCE AND ACHIEVE ORGANIZATIONAL GOALS.BENEFITS ADMINISTRATION:MANAGE EMPLOYEE BENEFITS PROGRAMS, INCLUDING HEALTH INSURANCE, RETIREMENT PLANS, AND OTHER PERKS.ASSIST EMPLOYEES WITH BENEFITS ENROLLMENT, CHANGES, AND INQUIRIES.HR POLICIES AND COMPLIANCE:ENSURE COMPLIANCE WITH ALL FEDERAL, STATE, AND LOCAL EMPLOYMENT LAWS AND REGULATIONS.DEVELOP AND MAINTAIN HR POLICIES AND PROCEDURES, ENSURING THEY ARE UP-TO-DATE AND COMMUNICATED EFFECTIVELY.TRAINING AND DEVELOPMENT:IDENTIFY TRAINING NEEDS AND DEVELOP PROGRAMS TO ENHANCE EMPLOYEE SKILLS AND KNOWLEDGE.COORDINATE EMPLOYEE TRAINING SESSIONS AND WORKSHOPS.HR DATA MANAGEMENT:MAINTAIN ACCURATE EMPLOYEE RECORDS AND HR DATABASES.GENERATE HR REPORTS AND ANALYTICS AS NEEDED FOR MANAGEMENT REVIEW.HR PROJECTS AND INITIATIVES:PARTICIPATE IN HR PROJECTS AND INITIATIVES, SUCH AS PROCESS IMPROVEMENTS, EMPLOYEE ENGAGEMENT PROGRAMS, AND DIVERSITY INITIATIVES.COLLABORATE WITH OTHER DEPARTMENTS TO SUPPORT ORGANIZATIONAL GOALS AND OBJECTIVES.\nQUALIFICATIONS:BACHELOR'S DEGREE IN HUMAN RESOURCES, BUSINESS ADMINISTRATION, OR RELATED FIELD.PROVEN EXPERIENCE AS AN HR GENERALIST OR SIMILAR ROLE.IN-DEPTH KNOWLEDGE OF HR PRINCIPLES, PRACTICES, AND REGULATIONS.STRONG INTERPERSONAL AND COMMUNICATION SKILLS.ABILITY TO HANDLE CONFIDENTIAL INFORMATION WITH DISCRETION AND PROFESSIONALISM.EXCELLENT ORGANIZATIONAL AND TIME MANAGEMENT SKILLS.HR CERTIFICATION (E.G., SHRM-CP, PHR) IS A PLUS.",
    "job_skill_set": [
      "HR principles",
      "recruitment",
      "employee relations",
      "HR policies and compliance",
      "training and development",
      "HR data management",
      "communication",
      "interpersonal skills",
      "organizational skills",
      "time management",
      "discretion",
      "problem solving",
      "collaboration",
      "performance management",
      "benefits administration",
      "HR certification"
    ],
    "short_keywords": [
      "administration",
      "and",
      "benefits",
      "certification",
      "collaboration",
      "communication",
      "compliance",
      "data",
      "development",
      "discretion",
      "employee",
      "generalist",
      "hr",
      "human",
      "interpersonal",
      "management",
      "organizational",
      "performance",
      "policies",
      "principles",
      "problem",
      "recruitment",
      "relations",
      "resources",
      "skills",
      "solving",
      "time",
      "training"
    ]
  },
  {
    "job_id": "3887481930",
    "job_title": "Director of Human Resources",
    "category": "HR",
    "job_description": "OUR CLIENT IS A GROWING PRIVATE EQUITY FIRM BASED IN MIAMI, FL THAT SPECIALIZES IN INVESTMENTS ACROSS VARIOUS INDUSTRIES AND ARE COMMITTED TO FOSTERING GROWTH AND INNOVATION IN THEIR PORTFOLIO COMPANIES. AS A DYNAMIC AND FORWARD-THINKING FIRM, THEY ARE SEEKING A HIGHLY SKILLED DIRECTOR OF HUMAN RESOURCES TO JOIN THEIR TEAM AND CONTRIBUTE TO THEIR CONTINUED SUCCESS.\n \n AS THE DIRECTOR OF HUMAN RESOURCES, YOU WILL PLAY A PIVOTAL ROLE IN CREATING THE HR DEPARTMENT FROM SCRATCH IN THEIR NEW ACCOUNTING DIVISION. THIS IS A SOLO ROLE, SO NO PRIOR PEOPLE MANAGEMENT EXPERIENCE IS REQUIRED. THIS POSITION REPORTS DIRECTLY TO THE EXECUTIVE LEADERSHIP TEAM AND REQUIRES A HANDS-ON APPROACH TO BUILDING AND MANAGING HR FUNCTIONS FROM THE GROUND UP. THE IDEAL CANDIDATE WILL HAVE EXTENSIVE EXPERIENCE IN ESTABLISHING HR FRAMEWORKS, PARTICULARLY IN THE CONTEXT OF MERGERS AND ACQUISITIONS AND WILL THRIVE IN A SOLO PRACTITIONER ROLE WITH NO DIRECT REPORTS.\n \n DIRECTOR OF HUMAN RESOURCES RESPONSIBILITIES:DEVELOP AND IMPLEMENT HR POLICIES, PROCEDURES AND INITIATIVES TAILORED TO MEET THE UNIQUE NEEDS OF A GROWING PE FIRMESTABLISH AND MAINTAIN HR INFRASTRUCTURE, INCLUDING BUT NOT LIMITED TO, PAYROLL, EMPLOYEE RELATIONS, PERFORMANCE MANAGEMENT, COMPENSATION AND BENEFITS, TALENT ACQUISITION AND COMPLIANCELEAD THE HR DUE DILIGENCE PROCESS FOR MERGERS AND ACQUISITIONS, ENSURING SEAMLESS INTEGRATION OF NEW ENTITIES INTO THE ORGANIZATIONPROVIDE STRATEGIC GUIDANCE TO SENIOR MANAGEMENT ON HR-RELATED MATTERS, INCLUDING WORKFORCE PLANNING, ORGANIZATIONAL DESIGN AND EMPLOYEE ENGAGEMENTSERVE AS A TRUSTED ADVISOR TO EMPLOYEES AT ALL LEVELS, ADDRESSING INQUIRIES, CONCERNS AND PROVIDING GUIDANCE ON HR-RELATED ISSUESCOLLABORATE WITH EXTERNAL VENDORS AND LEGAL COUNSEL AS NECESSARY TO ENSURE COMPLIANCE WITH FEDERAL, STATE AND LOCAL REGULATIONSCHAMPION A CULTURE OF DIVERSITY, EQUITY AND INCLUSION, FOSTERING AN ENVIRONMENT WHERE ALL EMPLOYEES FEEL VALUED AND EMPOWERED TO SUCCEEDSTAY ABREAST OF INDUSTRY TRENDS AND BEST PRACTICES IN HR, CONTINUALLY SEEKING OPPORTUNITIES FOR PROCESS IMPROVEMENT AND INNOVATION\n DIRECTOR OF HUMAN RESOURCES REQUIREMENTS:BACHELOR'S DEGREE IN HUMAN RESOURCES, BUSINESS ADMINISTRATION OR RELATED FIELD; ADVANCED DEGREE OR HR CERTIFICATION PREFERRED7+ YEARS OF PROGRESSIVE HR EXPERIENCE, WITH A PROVEN TRACK RECORD OF BUILDING HR DEPARTMENTS FROM SCRATCHSTRONG KNOWLEDGE OF HR PRINCIPLES, PRACTICES AND EMPLOYMENT LAW, PARTICULARLY IN THE CONTEXT OF MERGERS AND ACQUISITIONSEXCELLENT INTERPERSONAL AND COMMUNICATION SKILLS, WITH THE ABILITY TO INTERACT EFFECTIVELY WITH INDIVIDUALS AT ALL LEVELS OF THE ORGANIZATIONEXCEPTIONAL PROBLEM-SOLVING ABILITIES AND SOUND JUDGMENT, WITH THE CAPACITY TO NAVIGATE COMPLEX AND SENSITIVE SITUATIONS WITH TACT AND DIPLOMACYHIGH LEVEL OF INTEGRITY AND PROFESSIONALISM, WITH A COMMITMENT TO MAINTAINING CONFIDENTIALITY AND UPHOLDING ETHICAL STANDARDSABILITY TO WORK AUTONOMOUSLY AND PRIORITIZE MULTIPLE TASKS IN A FAST-PACED ENVIRONMENT, DEMONSTRATING RESILIENCE AND ADAPTABILITY TO CHANGING PRIORITIESPROFICIENCY IN HRIS SYSTEMS AND MICROSOFT OFFICE SUITE\n IF THIS SOUNDS LIKE YOU, APPLY TODAY! WE LOOK FORWARD TO HEARING FROM YOU. \n \n THANK YOU,\n \n KRISTINA HANN \n PROJECT MANAGER, NATIONAL SEARCH \n LASALLE NETWORK LASALLE NETWORK IS AN EQUAL OPPORTUNITY EMPLOYER M/F/D/V. LASALLE NETWORK IS THE LEADING PROVIDER OF DIRECT HIRE AND TEMPORARY STAFFING SERVICES. FOR OVER TWO DECADES, LASALLE HAS HELPED ORGANIZATIONS HIRE FASTER AND CONNECT TOP TALENT WITH OPPORTUNITIES, FROM ENTRY-LEVEL POSITIONS TO THE C-SUITE. WITH UNITS SPECIALIZING IN ACCOUNTING AND FINANCE, ADMINISTRATIVE, MARKETING, TECHNOLOGY, SUPPLY CHAIN, HEALTHCARE REVENUE CYCLE, CALL CENTER, HUMAN RESOURCES AND EXECUTIVE SEARCH. LASALLE OFFERS STAFFING AND RECRUITING SOLUTIONS TO COMPANIES OF ALL SIZES AND ACROSS ALL INDUSTRIES. LASALLE NETWORK IS THE PREMIER STAFFING AND RECRUITING FIRM, EARNING OVER 100 CULTURE, REVENUE AND INDUSTRY-BASED AWARDS FROM MAJOR PUBLICATIONS AND HAVING ITS COMPANY EXPERTS REGULARLY CONTRIBUTE INSIGHTS ON RETENTION STRATEGIES, HIRING TRENDS AND HIRING CHALLENGES, AND MORE TO NATIONAL NEWS OUTLETS.",
    "job_skill_set": [
      "HR policies",
      "payroll",
      "employee relations",
      "performance management",
      "compensation and benefits",
      "talent acquisition",
      "HRIS systems",
      "Microsoft Office Suite",
      "organizational design",
      "communication",
      "problem-solving",
      "interpersonal skills",
      "integrity",
      "professionalism",
      "autonomy",
      "resilience",
      "adaptability",
      "trustworthiness",
      "HR infrastructure",
      "compliance",
      "mergers and acquisitions",
      "workforce planning",
      "employee engagement"
    ],
    "short_keywords": [
      "acquisition",
      "acquisitions",
      "adaptability",
      "and",
      "autonomy",
      "benefits",
      "communication",
      "compensation",
      "compliance",
      "design",
      "director",
      "employee",
      "engagement",
      "hr",
      "hris",
      "human",
      "infrastructure",
      "integrity",
      "interpersonal",
      "management",
      "mergers",
      "microsoft",
      "of",
      "office",
      "organizational",
      "payroll",
      "performance",
      "planning",
      "policies",
      "problemsolving",
      "professionalism",
      "relations",
      "resilience",
      "resources",
      "skills",
      "suite",
      "systems",
      "talent",
      "trustworthiness",
      "workforce"
    ]
  },
  {
    "job_id": "3891005007",
    "job_title": "Human Resources Manager",
    "category": "HR",
    "job_description": "WHY JOIN GROUPESTAHL?WE VALUE WORK/LIFE BALANCE.AS A FAMILY-OWNED BUSINESS, WE KNOW OUR WORK FAMILY IS JUST ONE ASPECT OF LIFE. WE OFFER FLEXIBILITY IN THE WORKPLACE TO ACCOMMODATE LIFE OUTSIDE OF WORK. WE OFFER GENEROUS PTO PACKAGES AND OPPORTUNITY TO EARN ADDITION TIME OFF THROUGHOUT THE YEAR.WE TAKE HEALTH AND WELLNESS SERIOUSLY.WE OFFER COMPREHENSIVE BENEFITS PACKAGES WITH LOW PREMIUMS AND FRONT-END DEDUCTIBLES. CONTRIBUTE PRE-TAX DOLLARS TO YOUR FSA OR HSA ACCOUNTS. EARN ADDITIONAL PTO BY PARTICIPATING IN HEALTHY ACTIVITIES!WE DON’T BELIEVE IN JUST GETTING A JOB; WE BELIEVE IN CAREERS.WITH ONGOING TRAINING AND OPPORTUNITIES FOR PERSONAL DEVELOPMENT, WE BELIEVE IN FOSTERING CAREER GROWTH. LOOKING TO TAKE YOUR CAREER TO THE NEXT STEP? WE OFFER TUITION REIMBURSEMENT!WE BELIEVE IN MAKING A DIFFERENCE (AND HAVING FUN WHILE DOING IT).WHETHER WERE EATING HOT DOGS TO CELEBRATE CONEY DAY OR PLAYING HOCKEY WITH DETROIT RED WINGS ALUMNI TO RAISE MONEY FOR MICHIGAN DISABLED VETERANS. WERE A FAMILY-OWNED COMPANY WHO HAS FAMILY-FRIENDLY FUN YEAR-ROUND! WERE ALL ABOUT HAVING FUN AND MAKING A DIFFERENCE.NEED MORE REASONS TO JOIN STAHLS? READ MORE ABOUT OTHER BENEFITS AND PERKS HERE!WHAT WE DO:GROUPESTAHL IS A LEADING INTERNATIONAL MANUFACTURER, DISTRIBUTOR, AND DIRECT SUPPLIER IN THE FIELD OF CUSTOM TEXTILE PRINTING.\nTHE HUMAN RESOURCE MANAGER WILL LEAD AND DIRECT THE ROUTINE FUNCTIONS OF THE HUMAN RESOURCES (HR) DEPARTMENT INCLUDING HIRING AND INTERVIEWING STAFF, ADMINISTERING PAY, BENEFITS, AND LEAVE, AND ENFORCING COMPANY POLICIES AND PRACTICES.\nSUPERVISORY RESPONSIBILITIES:RECRUITS, INTERVIEWS, HIRES, AND TRAINS NEW STAFF IN THE DEPARTMENT.OVERSEES THE DAILY WORKFLOW OF THE DEPARTMENT.PROVIDES CONSTRUCTIVE AND TIMELY PERFORMANCE EVALUATIONS.HANDLES DISCIPLINE AND TERMINATION OF EMPLOYEES IN ACCORDANCE WITH COMPANY POLICY.\nDUTIES/RESPONSIBILITIES:PARTNERS WITH THE LEADERSHIP TEAM TO UNDERSTAND AND EXECUTE THE ORGANIZATION’S HUMAN RESOURCE AND TALENT STRATEGY PARTICULARLY AS IT RELATES TO CURRENT AND FUTURE TALENT NEEDS, RECRUITING, RETENTION, AND SUCCESSION PLANNING.PROVIDES SUPPORT AND GUIDANCE TO HR GENERALISTS, MANAGEMENT, AND OTHER STAFF WHEN COMPLEX, SPECIALIZED, AND SENSITIVE QUESTIONS AND ISSUES ARISE; MAY BE REQUIRED TO ADMINISTER AND EXECUTE ROUTINE TASKS IN DELICATE CIRCUMSTANCES SUCH AS PROVIDING REASONABLE ACCOMMODATIONS, INVESTIGATING ALLEGATIONS OF WRONGDOING, AND TERMINATIONS.MANAGES THE TALENT ACQUISITION PROCESS, WHICH MAY INCLUDE RECRUITMENT, INTERVIEWING, AND HIRING OF QUALIFIED JOB APPLICANTS, PARTICULARLY FOR MANAGERIAL, EXEMPT, AND PROFESSIONAL ROLES; COLLABORATES WITH DEPARTMENTAL MANAGERS TO UNDERSTAND SKILLS AND COMPETENCIES REQUIRED FOR OPENINGS.ANALYZES TRENDS IN COMPENSATION AND BENEFITS; RESEARCHES AND PROPOSES COMPETITIVE BASE AND INCENTIVE PAY PROGRAMS TO ENSURE THE ORGANIZATION ATTRACTS AND RETAINS TOP TALENT.CREATES LEARNING AND DEVELOPMENT PROGRAMS AND INITIATIVES THAT PROVIDE INTERNAL DEVELOPMENT OPPORTUNITIES FOR EMPLOYEES.OVERSEES EMPLOYEE DISCIPLINARY MEETINGS, TERMINATIONS, AND INVESTIGATIONS.MAINTAINS COMPLIANCE WITH FEDERAL, STATE, AND LOCAL EMPLOYMENT LAWS AND REGULATIONS, AND RECOMMENDED BEST PRACTICES; REVIEWS POLICIES AND PRACTICES TO MAINTAIN COMPLIANCE.MAINTAINS KNOWLEDGE OF TRENDS, BEST PRACTICES, REGULATORY CHANGES, AND NEW TECHNOLOGIES IN HUMAN RESOURCES, TALENT MANAGEMENT, AND EMPLOYMENT LAW.PERFORMS OTHER DUTIES AS ASSIGNED.\nREQUIRED SKILLS/ABILITIES:EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS.EXCELLENT INTERPERSONAL, NEGOTIATION, AND CONFLICT RESOLUTION SKILLS.EXCELLENT ORGANIZATIONAL SKILLS AND ATTENTION TO DETAIL.STRONG ANALYTICAL AND PROBLEM-SOLVING SKILLS.ABILITY TO PRIORITIZE TASKS AND TO DELEGATE THEM WHEN APPROPRIATE.ABILITY TO ACT WITH INTEGRITY, PROFESSIONALISM, AND CONFIDENTIALITY.THOROUGH KNOWLEDGE OF EMPLOYMENT-RELATED LAWS AND REGULATIONS.PROFICIENT WITH MICROSOFT OFFICE SUITE OR RELATED SOFTWARE.PROFICIENCY WITH OR THE ABILITY TO QUICKLY LEARN THE ORGANIZATION’S HRIS AND TALENT MANAGEMENT SYSTEMS.EDUCATION AND EXPERIENCE:BACHELOR’S DEGREE IN HUMAN RESOURCES, BUSINESS ADMINISTRATION, OR RELATED FIELD PREFERRED.A MINIMUM OF THREE YEARS OF HUMAN RESOURCE MANAGEMENT EXPERIENCE REQUIRED.SHRM-CP OR SHRM-SCP HIGHLY DESIRED.",
    "job_skill_set": [
      "human resources management",
      "employment law",
      "talent acquisition",
      "Microsoft Office Suite",
      "HRIS",
      "data analysis",
      "performance evaluation",
      "conflict resolution",
      "training and development",
      "recruitment",
      "benefits administration",
      "communication",
      "interpersonal skills",
      "organizational skills",
      "problem solving",
      "integrity",
      "professionalism",
      "attention to detail",
      "negotiation",
      "delegation",
      "confidentiality"
    ],
    "short_keywords": [
      "acquisition",
      "administration",
      "analysis",
      "and",
      "attention",
      "benefits",
      "communication",
      "confidentiality",
      "conflict",
      "data",
      "delegation",
      "detail",
      "development",
      "employment",
      "evaluation",
      "hr",
      "hris",
      "human",
      "integrity",
      "interpersonal",
      "law",
      "management",
      "manager",
      "microsoft",
      "negotiation",
      "office",
      "organizational",
      "performance",
      "problem",
      "professionalism",
      "recruitment",
      "resolution",
      "resources",
      "skills",
      "solving",
      "suite",
      "talent",
      "to",
      "training"
    ]
  },
  {
    "job_id": "3905882432",
    "job_title": "Human Resources Director",
    "category": "HR",
    "job_description": "INSERO TALENT SOLUTIONS IS RECRUITING A HUMAN RESOURCES DIRECTOR FOR A FAST GROWING MANUFACTURING COMPANY IN ITHACA, NY.\nOVERVIEW:AS THE HR DIRECTOR, YOU WILL BE RESPONSIBLE FOR LEADING AND MANAGING ALL ASPECTS OF THE HUMAN RESOURCES FUNCTION WITHIN OUR ORGANIZATION. YOU WILL PLAY A CRITICAL ROLE IN DEVELOPING AND IMPLEMENTING HR STRATEGIES, POLICIES, AND PROGRAMS TO SUPPORT OUR BUSINESS OBJECTIVES AND FOSTER A POSITIVE WORK ENVIRONMENT. REPORTING DIRECTLY TO THE PRESIDENT AND CEO, YOU WILL SERVE AS A KEY MEMBER OF THE SENIOR LEADERSHIP TEAM.\nKEY RESPONSIBILITIES:STRATEGIC HR PLANNING: DEVELOP AND IMPLEMENT HR STRATEGIES ALIGNED WITH THE COMPANY'S GOALS AND OBJECTIVES. COLLABORATE WITH SENIOR MANAGEMENT TO IDENTIFY HR PRIORITIES AND INITIATIVES. ANTICIPATE AND ADDRESS FUTURE HR NEEDS TO SUPPORT ORGANIZATIONAL GROWTH AND CHANGE. TALENT ACQUISITION AND MANAGEMENT: OVERSEE THE RECRUITMENT AND SELECTION PROCESS TO ATTRACT AND RETAIN TOP TALENT. DEVELOP AND IMPLEMENT EFFECTIVE ONBOARDING AND RETENTION STRATEGIES. ENSURE FAIR AND EQUITABLE COMPENSATION AND BENEFITS STRUCTURES. LEAD PERFORMANCE MANAGEMENT EFFORTS, INCLUDING GOAL SETTING, EVALUATIONS, AND CAREER DEVELOPMENT. EMPLOYEE RELATIONS AND COMPLIANCE: PROVIDE GUIDANCE AND SUPPORT ON EMPLOYEE RELATIONS ISSUES, ENSURING FAIR AND CONSISTENT RESOLUTION. ENSURE COMPLIANCE WITH ALL RELEVANT EMPLOYMENT LAWS AND REGULATIONS. DEVELOP AND ENFORCE COMPANY POLICIES AND PROCEDURES. PROMOTE A CULTURE OF DIVERSITY, EQUITY, AND INCLUSION THROUGHOUT THE ORGANIZATION. TRAINING AND DEVELOPMENT: IDENTIFY TRAINING AND DEVELOPMENT NEEDS AND DESIGN RELEVANT PROGRAMS. OVERSEE EMPLOYEE TRAINING INITIATIVES TO ENHANCE SKILLS AND CAPABILITIES. FOSTER A CULTURE OF CONTINUOUS LEARNING AND PROFESSIONAL GROWTH.HR OPERATIONS AND ADMINISTRATION: MANAGE HR SYSTEMS AND PROCESSES, INCLUDING PAYROLL, BENEFITS ADMINISTRATION, AND HRIS. OVERSEE THE ADMINISTRATION OF EMPLOYEE RECORDS AND DOCUMENTATION. ENSURE ACCURACY AND INTEGRITY OF HR DATA AND REPORTING. LEADERSHIP AND TEAM MANAGEMENT: LEAD AND DEVELOP A HIGH-PERFORMING HR TEAM. PROVIDE COACHING, MENTORSHIP, AND FEEDBACK TO TEAM MEMBERS. FOSTER A COLLABORATIVE AND SUPPORTIVE WORK ENVIRONMENT.\nQUALIFICATIONS:BACHELOR’S DEGREE IN HUMAN RESOURCES, BUSINESS ADMINISTRATION, OR RELATED FIELD; MASTER’S DEGREE PREFERRED. 15 YEARS OF PROGRESSIVE HR EXPERIENCE, WITH 5 YEARS IN A LEADERSHIP ROLE. STRONG KNOWLEDGE OF EMPLOYMENT LAWS, REGULATIONS, AND BEST PRACTICES. DEMONSTRATED EXPERIENCE IN DEVELOPING AND IMPLEMENTING HR STRATEGIES AND PROGRAMS. EXCELLENT LEADERSHIP, COMMUNICATION, AND INTERPERSONAL SKILLS. ABILITY TO BUILD RELATIONSHIPS AND INFLUENCE STAKEHOLDERS AT ALL LEVELS OF THE ORGANIZATION. SHRM OR HRCI CERTIFICATION PREFERRED. THIS JOB DESCRIPTION OUTLINES THE KEY RESPONSIBILITIES AND QUALIFICATIONS FOR THE HR DIRECTOR ROLE. THE SUCCESSFUL CANDIDATE WILL BE A STRATEGIC THINKER, ADEPT AT MANAGING PEOPLE AND PROCESSES, AND COMMITTED TO FOSTERING A POSITIVE AND INCLUSIVE WORKPLACE CULTURE.",
    "job_skill_set": [
      "talent acquisition",
      "employee relations",
      "compliance with employment laws",
      "training and development",
      "HRIS management",
      "payroll administration",
      "data reporting",
      "HR policies development",
      "coaching and mentorship",
      "leadership",
      "communication",
      "interpersonal skills",
      "collaboration",
      "problem solving",
      "relationship building",
      "adaptability",
      "continuous learning",
      "HR strategy development",
      "performance management",
      "diversity and inclusion initiatives",
      "stakeholder management",
      "strategic thinking",
      "influence"
    ],
    "short_keywords": [
      "acquisition",
      "adaptability",
      "administration",
      "and",
      "building",
      "coaching",
      "collaboration",
      "communication",
      "compliance",
      "continuous",
      "data",
      "development",
      "director",
      "diversity",
      "employee",
      "employment",
      "hr",
      "hris",
      "human",
      "inclusion",
      "influence",
      "initiatives",
      "interpersonal",
      "laws",
      "leadership",
      "learning",
      "management",
      "mentorship",
      "payroll",
      "performance",
      "policies",
      "problem",
      "relations",
      "relationship",
      "reporting",
      "resources",
      "skills",
      "solving",
      "stakeholder",
      "strategic",
      "strategy",
      "talent",
      "thinking",
      "training",
      "with"
    ]
  }
]