[
  {
    "job_id": "3906225539",
    "job_title": "Client Sales Consultant",
    "category": "SALES",
    "job_description": "JOB TYPE\n\nFULL-TIME\n\nDESCRIPTION\n\nPAYLOCITY IS AN AWARD-WINNING PROVIDER OF CLOUD-BASED HR AND PAYROLL SOFTWARE SOLUTIONS, OFFERING THE MOST COMPLETE PLATFORM FOR THE MODERN WORKFORCE. THE COMPANY HAS BECOME ONE OF THE FASTEST-GROWING HCM SOFTWARE PROVIDERS WORLDWIDE BY OFFERING AN INTUITIVE, EASY-TO-USE PRODUCT SUITE THAT HELPS BUSINESSES AUTOMATE AND STREAMLINE HR AND PAYROLL PROCESSES, ATTRACT AND RETAIN TALENT, AND BUILD A STRONG WORKPLACE CULTURE.\n\nWHILE TRADITIONAL HR AND PAYROLL PROVIDERS AUTOMATE BASIC HR PROCESSES SUCH AS PAYROLL AND BENEFITS ADMINISTRATION, PAYLOCITY GOES FURTHER BY DEVELOPING TOOLS THAT HR AND BUSINESSES NEED TO COMPETE FOR TALENT AND DELIVER AGAINST THE EXPECTATIONS OF THE MODERN WORKFORCE.\n\nWE GIVE OUR EMPLOYEES WHAT THEY NEED TO SUCCEED, INCLUDING GREAT BENEFITS AND PERKS! WE OFFER MEDICAL, DENTAL, VISION, LIFE, DISABILITY, AND A 401(K) MATCH, AS WELL AS PERKS THAT SUPPORT YOU, YOUR FAMILY, AND YOUR FINANCES. AND IF IT’S CAREER DEVELOPMENT YOU DESIRE, WE PROVIDE THAT, TOO! AT PAYLOCITY, PEOPLE MATTER MOST AND HAVE ALWAYS BEEN AT THE HEART OF OUR BUSINESS.\n\nAS PART OF THE SALES & MARKETING TEAM, YOU’LL HELP US SOLVE CHALLENGES AND SUCCEED AS YOU GROW AND UNDERSTAND THE UNIQUE NEEDS OF OUR CLIENTS AND TAILOR EASY-TO-USE SOLUTIONS TO DELIVER THE PERFORMANCE THEY NEED.\n\nWITH A POSITION IN SALES & MARKETING, YOU’LL STRENGTHEN OUR RELATIONSHIPS WITH CLIENTS, ANTICIPATE THEIR NEEDS, AND THINK OUTSIDE THE BOX TO UNLOCK NEW POSSIBILITIES.\n\nPOSITION OVERVIEW\n\nTHE CLIENT SALES CONSULTANT IS AN INSIDE SALES ROLE THAT IS RESPONSIBLE FOR GENERATING ADDITIONAL REVENUE THROUGH THE CLIENT BASE. IN THIS ROLE, YOU WILL BE DEVELOPING BUSINESS RELATIONSHIPS WITH C – LEVEL EXECUTIVES AND IDENTIFYING THEIR BUSINESS OBJECTIVES AND ALIGNING PAYLOCITY SOLUTIONS TO MEET THOSE OBJECTIVES.\n\nLOCATIONS: LAKE MARY, FL (HYBRID SCHEDULE)\n\nREPORTS TO: CURRENT CLIENT CONSULTANT MANAGER\n\nTHE BELOW REPRESENTS THE PRIMARY DUTIES OF THE POSITION, OTHERS MAY BE ASSIGNED AS NEEDED. TO PERFORM THIS JOB SUCCESSFULLY, AN INDIVIDUAL MUST BE ABLE TO PERFORM EACH ESSENTIAL DUTY SATISFACTORILY. THE REQUIREMENTS LISTED BELOW ARE REPRESENTATIVE OF THE KNOWLEDGE, SKILL, AND/OR ABILITY REQUIRED. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS.\n\nRESPONSIBILITIES\n\nPOSSESS A COMPLETE UNDERSTANDING OF PAYLOCITY SERVICES, PRODUCTS, INTERNAL SALES TOOLS, AND PROCESSES.LEAD GENERATION BY CONTACTING CLIENTS FOR HUMAN RESOURCE, SELF-SERVICE, TIME AND LABOR MANAGEMENT, AND OTHER ANCILLARY SERVICES.USING SALES AND NEGOTIATION SKILLS, PRESENT PAYLOCITY PRODUCTS AND SERVICES THAT MEETS CLIENT’S NEEDS, CONDUCT PRODUCT DEMONSTRATIONS VIA THE WEB, PREPARE AND PRESENT PROPOSALS, AND PROVIDE APPROPRIATE FOLLOW-UP THROUGHOUT THE SALES PROCESS.HANDLE OBJECTIONS.CLOSE ANCILLARY BUSINESS TO MEET OR EXCEED ASSIGNED MONTHLY SALES QUOTAS WHILE MAINTAINING OR EXCEEDING MINIMUM SALES ACTIVITY STANDARDS.COMPLETE AND OBTAIN APPROPRIATE DOCUMENTATION REQUIRED BY INTERNAL DEPARTMENTS FOR IMPLEMENTATION.SET APPROPRIATE CLIENT EXPECTATIONS.MAINTAIN CUSTOMER RELATIONSHIP MANAGEMENT (CRM) DATABASE.OTHER DUTIES AS ASSIGNED.\n\nREQUIREMENTS\n\n1+ YEARS OF B2B FULL SALES CYCLE EXPERIENCE (PREFERRED)SELF-DRIVEN, AMBITIOUS PROFESSIONAL WITH THE DESIRE TO CONSISTENTLY MEET AND EXCEED ASSIGNED QUOTAS.ABILITY TO PERSUADE AND NEGOTIATE.STRONG ACTIVE LISTENING SKILLS TO BE ABLE TO UNCOVER CLIENT NEEDS AND OBJECTIVES.STRONG WRITTEN AND ORAL COMMUNICATIONS SKILLS TO EFFECTIVELY PRESENT PAYLOCITY.STRONG CUSTOMER SERVICE SKILLS.ABILITY TO ESTABLISH PRIORITIES AND WORK INDEPENDENTLY.PROFICIENCY WITH THE INTERNET AND MS OFFICE APPLICATIONS SUCH AS WORD, EXCEL AND POWERPOINT.\n\nPAYLOCITY IS AN EQUAL-OPPORTUNITY EMPLOYER. PAYLOCITY IS COMMITTED TO THE FULL INCLUSION OF ALL INDIVIDUALS. WE RECRUIT, TRAIN, COMPENSATE, AND PROMOTE REGARDLESS OF RACE, RELIGION, COLOR, NATIONAL ORIGIN, SEX, DISABILITY, AGE, VETERAN STATUS, AND OTHER PROTECTED STATUS AS REQUIRED BY APPLICABLE LAW. AT PAYLOCITY, WE BELIEVE DIVERSITY MAKES US BETTER.\n\nWE EMBRACE AND ENCOURAGE OUR EMPLOYEES’ DIFFERENCES IN AGE, CULTURE, ETHNICITY, FAMILY OR MARITAL STATUS, GENDER IDENTITY OR EXPRESSION, LANGUAGE, NATIONAL ORIGIN, PHYSICAL AND MENTAL ABILITY, POLITICAL AFFILIATION, RACE, RELIGION OR SPIRITUAL BELIEF, SEXUAL ORIENTATION, SOCIO-ECONOMIC STATUS, VETERAN STATUS, AND OTHER CHARACTERISTICS THAT MAKE OUR EMPLOYEES UNIQUE. WE ACTIVELY CULTIVATE THESE DIFFERENCES THROUGH OUR EMPLOYEE RESOURCE GROUPS (ERGS), EMPLOYEE EXPERIENCES, PERSPECTIVES, TALENTS, AND APPROACHES TO DRIVE INNOVATION IN THE SOFTWARE AND SERVICES WE PROVIDE OUR CUSTOMERS.\n\nWE COMPLY WITH FEDERAL AND STATE DISABILITY LAWS AND MAKE REASONABLE ACCOMMODATIONS FOR APPLICANTS AND EMPLOYEES WITH DISABILITIES. TO REQUEST REASONABLE ACCOMMODATION IN THE JOB APPLICATION OR INTERVIEW PROCESS, PLEASE CONTACT ACCESSIBILITY@PAYLOCITY.COM.",
    "job_skill_set": [
      "B2B Sales",
      "Sales Cycle Management",
      "MS Office (Word, Excel, PowerPoint)",
      "Lead Generation",
      "Negotiation",
      "Time Management",
      "Communication",
      "Active Listening",
      "Customer Service",
      "Persuasion",
      "Problem Solving",
      "Self-Motivation",
      "Relationship Building",
      "Adaptability",
      "CRM Software",
      "Product Demonstration"
    ],
    "short_keywords": [
      "active",
      "adaptability",
      "b2b",
      "building",
      "client",
      "communication",
      "consultant",
      "crm",
      "customer",
      "cycle",
      "demonstration",
      "excel",
      "generation",
      "lead",
      "listening",
      "management",
      "ms",
      "negotiation",
      "office",
      "persuasion",
      "powerpoint",
      "problem",
      "product",
      "relationship",
      "sales",
      "selfmotivation",
      "service",
      "software",
      "solving",
      "time",
      "word"
    ]
  },
  {
    "job_id": "3900959791",
    "job_title": "Retail Sales Associate Part Time",
    "category": "SALES",
    "job_description": "RETAIL SALES ASSOCIATE – PART-TIME \n\nWE INVEST IN OUR PEOPLE AND CONTINUOUSLY WORK TOWARDS FOSTERING AN INSPIRATIONAL, INCLUSIVE, AND INNOVATIVE CULTURE, SO THAT EVERY TEAM MEMBER HAS A TRUE SENSE OF BELONGING. WE HELP PEOPLE CONFIDENTLY EXPRESS THEIR TRUE SELVES SO THEY CAN BE THEIR BEST. \n\nWE HAVE IMMEDIATE OPENINGS – START RIGHT AWAY! \n\n COMPETITIVE HOURLY RATES FLEXIBLE SCHEDULES TO MEET YOUR AVAILABILITY! TUITION REIMBURSEMENT GENEROUS EMPLOYEE DISCOUNT ON FIRST PURCHASE ONGOING DISCOUNTS ON PURCHASE MADE AT ANY TAILORED BRANDS STORE.\n\nWHAT YOU BRING\n\n CUSTOMER SERVICE – OR AS WE CALL IT – CULTURE OF CUSTOMER-OBSESSION BY BEING CUSTOMER-READY AND DELIVERING A WORLD-CLASS EXPERIENCE EVERY DAY DESIRE TO LEARN AND ADAPT TO NEW PROGRAMS ABILITY TO WORK WELL AND CONSULT WITH RETAIL SALES ASSOCIATES AT ALL LEVELS AND CONTRIBUTE TO A POSITIVE WORK ENVIRONMENT\n\nOUR RETAIL SALES ASSOCIATES ARE RESPONSIBLE FOR ALL ASPECTS OF THE CUSTOMER EXPERIENCE WITHIN MULTIPLE BUSINESSES (RETAIL, RENTAL, CUSTOM, AND OMNI-CHANNEL) WITHIN A STORE LOCATION INCLUDING, BUT NOT LIMITED TO:\n\n ENGAGE AS A MEMBER OF A HIGH-PERFORMING TEAM THROUGH TRUST, COMMITMENT, AND A FOCUS ON RESULTS. BUILD A RELATIONSHIP WITH YOUR CUSTOMER FROM GREETING THROUGH POST-SALE CONTACT. CONSISTENTLY DEMONSTRATE THE BENCHMARK SELLING TECHNIQUES FOR RETAIL SALES, CUSTOM CLOTHING SALES, AND SPECIAL OCCASION RENTALS. CONTINUOUSLY ENCOURAGE AND PARTICIPATE IN TEAM SELLING AND POSITIVELY IMPACT THE ACHIEVEMENT OF THE STORE SALES VOLUME AND METRICS GOALS. ASSIST WITH VISUALLY MERCHANDISING, SET UP, AND OTHER STORE-RELATED PROJECTS, AS WELL AS CONDUCTING MERCHANDISE STOCK COUNTS. HANDLE THE CASH REGISTER, AS A CASHIER, AT THE POINT OF SALE IN THE STORE.\n\nPHYSICAL REQUIREMENTS\n\n ABILITY TO STAND AND WALK FOR THE MAJORITY OF WORK SHIFT, FREQUENTLY BEND, SQUAT AND TWIST, LIFT UP TO 50 LBS., CLIMB A LADDER TO REACH MERCHANDISE AND OR SUPPLIES, AND SEE AND DISTINGUISH BETWEEN FABRIC PATTERNS AND COLORS.\n\nYOU MAY HAVE THE OPPORTUNITY TO VOLUNTARILY WORK BETWEEN MULTIPLE STORE OR SITE LOCATIONS, AND ACROSS MULTIPLE BRANDS.\n\nPAY RANGE: $15.00 - $18.75\n\nWE TAKE INTO CONSIDERATION AN INDIVIDUAL’S SKILLS, BACKGROUND, AND EXPERIENCE IN DETERMINING FINAL SALARY. BASE PAY INFORMATION IS BASED ON MARKET LOCATION AND MAY BE SUBJECT TO PREVAILING WAGE LAWS, IF APPLICABLE\n\nREASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS\n\nOUR COMPANY CELEBRATES DIVERSITY AND PROVIDES EQUAL EMPLOYMENT OPPORTUNITY TO ALL APPLICANTS AND EMPLOYEES WITHOUT REGARD TO RACE, COLOR, SEX, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, NATIONAL ORIGIN, RELIGION, VETERAN OR MILITARY STATUS, AGE, PHYSICAL OR MENTAL DISABILITY, MARITAL STATUS, OR ANY OTHER PROTECTED STATUS UNDER THE LAW.\n\nWORK LOCATIONS: 00072 FISHKILL 1083 ROUTE 9 STE 7 FISHKILL 12524\n\nJOB: SALES\n\nORGANIZATION: JOS.A.BANK\n\nSHIFT: VARIABLE\n\nZONE: NORTHEAST",
    "job_skill_set": [
      "customer service",
      "sales techniques",
      "teamwork",
      "communication",
      "adaptability",
      "relationship building",
      "problem solving",
      "positive attitude",
      "trust and commitment",
      "cash handling",
      "visual merchandising",
      "stock management",
      "retail operations",
      "lifting up to 50 lbs"
    ],
    "short_keywords": [
      "50",
      "adaptability",
      "and",
      "associate",
      "attitude",
      "building",
      "cash",
      "commitment",
      "communication",
      "customer",
      "handling",
      "lbs",
      "lifting",
      "management",
      "merchandising",
      "operations",
      "part",
      "positive",
      "problem",
      "relationship",
      "retail",
      "sales",
      "service",
      "solving",
      "stock",
      "teamwork",
      "techniques",
      "time",
      "to",
      "trust",
      "up",
      "visual"
    ]
  },
  {
    "job_id": "3904704937",
    "job_title": "Sales Proposal Manager",
    "category": "SALES",
    "job_description": "THE SALES PROPOSAL MANAGER IS RESPONSIBLE FOR THE QUALITY AND ON-TIME DELIVERY OF WINNING CUSTOMER PROPOSALS. IN THIS ROLE YOU PLAN, COORDINATE, AND EXECUTE THE PROCESS FROM CONCEPT TO SIGN-OFF ON FIXED PRICE AND OTHER PROPOSALS.\n\nTHIS IS A KEY ROLE LEADING A SMALL BUT INFLUENTIAL TEAM, WHICH ENABLES OUR SALES EFFORTS AND CLEARLY DEFINES WAYS TO MEET CUSTOMER CONTRACT NEEDS.\n\nAT SWISSLOG, WE ARE PROUD OF THE SOLUTIONS AND SERVICES WE PROVIDE TO CUSTOMERS ACROSS THE GLOBE. THIS ROLE REQUIRES A STRATEGIC MINDSET, AS WELL AS A DRIVE TO DELIVER VIABLE, CLEARLY DOCUMENTED AND COSTED SOLUTIONS THAT MAKE A DIFFERENCE FOR OUR CUSTOMERS.\n\nRESPONSIBILITIES\n\nMANAGE THE DELIVERY OF ALL PROPOSALS FOR AUTOSTORE AND INTEGRATED SOLUTIONS NEW BUSINESS SALES.BUILD AND LEAD A TEAM OF 2-5 PROFESSIONAL SALES PROPOSAL ENGINEERS.ESTABLISH CLEAR COMMUNICATION ON THE STATUS OF ALL PROPOSALS WITH THE EXTENDED SWISSLOG TEAMS. HIGHLIGHTING MILESTONES AND DRIVING TO MEET THE AGREED MILESTONES.ENSURE BEST PRACTICES ARE FOLLOWED ACROSS THE PROPOSAL PROCESS.ENSURE ACCURACY AND OWNERSHIP OF PROPOSAL INPUTS FROM ALL GROUPS.BUILD COMPETENCIES WITHIN THE TEAM THROUGH TRAINING AND MENTORING.DRIVE OPERATIONAL IMPROVEMENTS TO INCREASE EFFICIENCY, TIMELINESS AND QUALITY OF PROPOSALS. BE SMART RATHER THAN BUSY.\n\nPLANNING FOR GROWTH\n\nHELP BUILD A STRONG LEARNING ORGANIZATION THAT WILL FIT THE NEEDS OF OUR GROWING BUSINESS, WHILE BRINGING NEW EXCITING AND ENHANCED SOLUTIONS TO OUR CUSTOMERS.\n\nCOMMUNICATION\n\nYOU WILL SET A CLEAR TIMELINE FOR ALL PROPOSAL FUNCTIONS WITHIN SWISSLOG AND ALSO FOR ALL NEEDED 3RD PARTY INPUT. YOU WILL ENSURE EVERYONE HAS THE NEEDED DATA TO PROVIDE INPUT THAT BUILDS A RISK-FREE PROPOSAL.\n\nCREATE ALIGNMENT\n\nASSURE THAT THE PROPOSAL, CONSULTING AND SYSTEM ENGINEERING TEAMS ARE FULLY ALIGNED AND WORKING EFFECTIVELY WITH ALL OTHER TEAMS IN THE REGION, CREATING A COOPERATIVE ENVIRONMENT TO ENSURE WE PRODUCE WINNING SOLUTIONS WITH CLEAR EVIDENCE SUPPORTING COSTS.\n\nCUSTOMER FOCUS\n\nWORK VERY CLOSELY WITH OUR SALES TEAM, REVIEWING THEIR NEEDS, AND DIRECT VARIOUS TEAMS TO CREATE WINNING PROPOSALS. \n\nDATA DRIVEN.\n\nKEY TO OUR SUCCESS ARE CUSTOMER SOLUTIONS THAT MEET THE NEEDED PERFORMANCE AND DESIGN CRITERIA. YOU WILL ENSURE CLEAR DATA DRIVEN SOLUTIONS AND ORGANIZATIONAL BUY-IN SO THAT WE CAN DELIVER ON OUR PROMISES\n\nREPORTING\n\nYOU WILL SETUP AND DRIVE TRANSPARENT REPORTING OF THE GROUP’S ACTIVITIES TO ENSURE WE ARE DELIVERING ON TIME AND IN FULL, AND ENSURING THE GROUP ENABLES THE SALES ORGANIZATION.\n\nTEAM MANAGEMENT\n\nLEVERAGE LEADERSHIP SKILLS AND EXPERIENCES TO CONTINUOUSLY IMPROVE THE PROPOSAL FUNCTION. IDENTIFY ANY SKILLS GAPS IN THE TEAM AND CREATE PLANS TO FILL THOSE GAPS THROUGH PLANNED STRUCTURED INTERNAL DEVELOPMENT AND EXTERNAL RECRUITMENT AS NEEDED.\n\nCULTURE OF PERFORMANCE\n\nTHROUGH YOUR LEADERSHIP YOU WILL BUILD A HIGH-PERFORMANCE FOCUSED TEAM THAT CELEBRATES ACHIEVING GREAT RESULTS AND THAT OTHERS LOOK TO FOR INSPIRATION.\n\nBUILDING GLOBAL COMPETENCE\n\nYOU WILL WORK CLOSELY WITH OTHER GLOBAL TEAMS TO SHARE BEST PRACTICES AND OPTIMIZE THE PROCESSES.\n\nCUSTOMER FOCUS\n\nANTICIPATE, BE ACCOUNTABLE FOR AND DELIVER ON INTERNAL AND EXTERNAL CUSTOMER COMMITMENTS.ENSURE BOTH YOU AND YOUR PROJECT TEAM(S) UNDERSTAND AND FULFIL CUSTOMER REQUIREMENTS.BUILD A NETWORK OF GOOD WORKING RELATIONSHIPS WITH YOUR PROJECT TEAM(S), INTERNAL AND EXTERNAL CUSTOMERS.\n\nANALYTICAL THINKING AND DECISION MAKING\n\nMAKE WELL-INFORMED, EFFECTIVE AND TIMELY DECISIONS WITH DUE DILIGENCE AND CONSIDERATION OF THE RISKS INVOLVED.FORMULATE OBJECTIVES, PLANS AND PRIORITIES FOR YOURSELF AND YOUR PROJECT TEAM(S), TAKING INTO CONSIDERATION PROJECT TEAM, DEPARTMENT, ORGANIZATIONAL AND CUSTOMER NEEDS.\n\nAPPLICATION REQUIREMENTS\n\nBACHELOR'S DEGREE IN ENGINEERING, PROJECT MANAGEMENT, OR BUSINESS OR EQUIVALENT EXPERIENCE5+ YEARS’ EXPERIENCE WORKING IN PROJECTS TYPE BUSINESS.5+ YEARS’ EXPERIENCE CREATING CUSTOMER PROPOSALS. HAVE WORKING KNOWLEDGE OF THE WAREHOUSE AND DISTRIBUTION BUSINESS SECTORHAVE MANAGED A TEAM OF UP TO 5 PROFESSIONALS IS PREFERRED\n\nABOUT SWISSLOG\n\nSWISSLOG IS SHAPING THE #FUTURE OF #INTRALOGISTICS. AS PART OF THE KUKA GROUP, WE ARE AT THE FOREFRONT OF TECHNOLOGY THAT IS CHANGING THE WORLD. SERVING SOME OF THE BIGGEST AND MOST EXCITING BRANDS ACROSS THE GLOBE, WE'RE A TEAM OF 2,000 PROFESSIONALS AND 50 NATIONALITIES, WORKING TOGETHER TO TRANSFORM INTRALOGISTICS WITH SMART MINDS AND FRESH PERSPECTIVES. WITH OUR FLEXIBLE, #ROBOTIC AND #DATA-DRIVEN AUTOMATED SOLUTIONS, WE ARE POWERING THE SUPPLY CHAIN AND TAKING THE INDUSTRY FORWARD. #JOINOURTEAM AND BRING IDEAS TO LIFE!",
    "job_skill_set": [
      "project management",
      "customer proposals",
      "data analysis",
      "team management",
      "reporting",
      "operational improvements",
      "communication",
      "leadership",
      "analytical thinking",
      "customer focus",
      "strategic mindset",
      "collaboration",
      "problem solving",
      "mentoring",
      "engineering",
      "warehouse and distribution knowledge"
    ],
    "short_keywords": [
      "analysis",
      "analytical",
      "and",
      "collaboration",
      "communication",
      "customer",
      "data",
      "distribution",
      "engineering",
      "focus",
      "improvements",
      "knowledge",
      "leadership",
      "management",
      "manager",
      "mentoring",
      "mindset",
      "operational",
      "problem",
      "project",
      "proposal",
      "proposals",
      "reporting",
      "sales",
      "solving",
      "strategic",
      "team",
      "thinking",
      "warehouse"
    ]
  },
  {
    "job_id": "3889705310",
    "job_title": "Entry Level Sales -- No Experience Necessary!",
    "category": "SALES",
    "job_description": "JOB DESCRIPTION\n\nNO EXPERIENCE NECESSARY -- WE WILL TRAIN YOU!\n\nARE YOU LOOKING FOR AN OPPORTUNITY TO MAKE $40K - $60K+ A YEAR?\n\nHOMEFIX CUSTOM REMODELING OFFERS A TRUE CAREER OPPORTUNITY WITH THE ABILITY TO ADVANCE WITHIN THE COMPANY AND GROW! OUR TOP EARNERS MAKE WELL OVER $80K!\n\nWE DON’T THROW YOU TO WOLVES. IT’S NOT SINK OR SWIM HERE.\n\nWE OFFER:\n\nA REAL TRAINING PROGRAM!REAL COMPENSATION PLANS!EASILY OBTAINABLE MONTHLY BONUSES!BEST OF ALL, WE PROVIDE HIGH QUALITY LEADS!\n\nIF YOU DON’T HAVE EXPERIENCE, DON’T WORRY!\n\nHCR OFFERS A STATE-OF-THE-ART TRAINING PLATFORM! WE PROVIDE A TRUE TEAM ENVIRONMENT, WEEKLY IN-PERSON TRAININGS AS WELL AS VARIOUS RESOURCES AND MANAGERS TO ASSIST YOU ALONG THE WAY. WE WANT EVERY EMPLOYEE THAT REPRESENTS HOMEFIX CUSTOM REMODELING TO BE HIGHLY TRAINED AND PROFESSIONAL, SO WE PROVIDE MANY WAYS TO HELP AND FACILITATE YOUR SUCCESS.\n\nHCR IS BUILT ON A SOLID FOUNDATION WITH 32 YEARS OF LEADERSHIP TAKING CARE OF OUR CUSTOMERS AND OUR EMPLOYEES! WE TREAT EVERYONE FAIRLY AND WITH RESPECT AS WE TRULY CARE ABOUT AND VALUE OUR EMPLOYEES.\n\nAPPLY NOW IF YOU’RE READY TO JUMP START YOUR SALES CAREER OR PUSH YOUR CURRENT SALES CAREER TO THE NEXT LEVEL!\n\nCOMPANY DESCRIPTION\n\nDYNAMIC AND GROWING HOME IMPROVEMENT COMPANY WITH ENDLESS OPPORTUNITIES FOR ADVANCEMENT AND GROWTH. AMAZING COMPANY CULTURE THAT PROMOTES INDIVIDUALISM, NURTURES CREATIVITY AND NEW IDEAS. WE CONDUCT EMPLOYEE REVIEWS REGULARLY AND REWARD PRODUCTION, IMPROVEMENT AND RESULTS.\n\nDO YOU FIND YOURSELF ASKING THIS QUESTION? \"HOW AM I SUPPOSED TO HAVE 3-5 YEARS EXPERIENCE IF NOBODY WILL GIVE ME A CHANCE?\" IF SO, LOOK NO FURTHER. YOU HAVE FOUND THE COMPANY THAT HAS AND WILL CONTINUE TO PERSONALLY CREATE THE FUTURE LEADERS OF THE HOME IMPROVEMENT INDUSTRY!\n\nHCR HAS SERVED HOMEOWNERS SINCE 1990. WE HAVE MADE THOUSANDS OF HOMEOWNERS HAPPY THROUGH THE YEARS WITH THREE SIMPLE RULES FOR RUNNING OUR BUSINESS: HIRE GREAT PEOPLE, CHOOSE THE BEST PRODUCTS, AND WHEN THERE'S A PROBLEM, MAKE IT RIGHT!\n\nDYNAMIC AND GROWING HOME IMPROVEMENT COMPANY WITH ENDLESS OPPORTUNITIES FOR ADVANCEMENT AND GROWTH. AMAZING COMPANY CULTURE THAT PROMOTES INDIVIDUALISM, NURTURES CREATIVITY AND NEW IDEAS. WE CONDUCT EMPLOYEE REVIEWS REGULARLY AND REWARD PRODUCTION, IMPROVEMENT AND RESULTS. DO YOU FIND YOURSELF ASKING THIS QUESTION? \"HOW AM I SUPPOSED TO HAVE 3-5 YEARS EXPERIENCE IF NOBODY WILL GIVE ME A CHANCE?\" IF SO, LOOK NO FURTHER. YOU HAVE FOUND THE COMPANY THAT HAS AND WILL CONTINUE TO PERSONALLY CREATE THE FUTURE LEADERS OF THE HOME IMPROVEMENT INDUSTRY! HCR HAS SERVED HOMEOWNERS SINCE 1990. WE HAVE MADE THOUSANDS OF HOMEOWNERS HAPPY THROUGH THE YEARS WITH THREE SIMPLE RULES FOR RUNNING OUR BUSINESS: HIRE GREAT PEOPLE, CHOOSE THE BEST PRODUCTS, AND WHEN THERE'S A PROBLEM, MAKE IT RIGHT!",
    "job_skill_set": [
      "sales",
      "customer service",
      "training",
      "teamwork",
      "communication",
      "problem solving",
      "adaptability",
      "lead generation",
      "creativity"
    ],
    "short_keywords": [
      "adaptability",
      "communication",
      "creativity",
      "customer",
      "entry",
      "experience",
      "generation",
      "lead",
      "level",
      "necessary",
      "no",
      "problem",
      "sales",
      "service",
      "solving",
      "teamwork",
      "training"
    ]
  },
  {
    "job_id": "3903823981",
    "job_title": "Hershey's Part-Time Territory Sales Associate (Ontario, CA)",
    "category": "SALES",
    "job_description": "SUMMARY:\n\nLOCATION: ONTARIO, CA\n\nFLEXIBLE SCHEDULES AVAILABLE\n\nTO BE CONSIDERED FOR THIS ROLE, CANDIDATES MUST RESIDE IN OR BE WILLING TO COMMUTE TO: FONTANA, JURUPA VALLEY, ONTARIO, RANCHO CUCAMONGA, UPLAND\n\nTHIS IS A REMOTE POSITION\n\nTHIS POSITION WILL REQUIRE YOU TO DRIVE YOUR PERSONAL VEHICLE 20-30 MILES PER DAY IN YOUR ASSIGNED TERRITORY. MILEAGE MAY VARY DEPENDING ON WHERE YOU LIVE IN COMPARISON TO THE TERRITORY. NO CAR ALLOWANCE IS PROVIDED; HOWEVER, MILEAGE FOR TRAVEL WILL BE REIMBURSED AT 62 CENTS PER MILE.\n\nA PART-TIME ROLE AS A TERRITORY SALES ASSOCIATE (TSA) IS A GREAT WAY FOR A RELATIONSHIP-ORIENTED PERSON TO FLEX THEIR SELLING SKILLS WHILE REPRESENTING SOME OF THE BIGGEST AND MOST EXCITING BRANDS IN AMERICA! OUR TSAS WILL SELL AND INSURE BEST IN CLASS MERCHANDISING TO INCLUDE BUILDING DISPLAYS, INCREASING DISTRIBUTION OF OUR TOP SELLING ITEMS, AND REPLENISHING PERMANENT SECONDARY DISPLAYS.\n\nWORK SCHEDULE\n\nTHIS POSITION IS CONSIDERED “CONTINUOUS PART-TIME” WORKING 20-25 HOURS PER WEEK. ON AVERAGE, A TSA WILL VISIT BETWEEN 6-10+ ACCOUNTS PER DAY. THIS ROLE OFFERS FLEXIBLE WORK SCHEDULES BASED ON PERSONAL NEEDS, TERRITORY NEEDS AND BEING PRESENT IN STORES WHEN KEY DECISION MAKERS ARE AVAILABLE. YOUR WORKDAY SHOULD OVERLAP THE CORE HOURS OF 6:00AM TO 4:00PM, MONDAY THROUGH FRIDAY, UNLESS OTHERWISE REQUIRED BY BUSINESS NEEDS.\n\nA TSA EARNS AN HOURLY WAGE PLUS AN ANNUAL CASH BONUS, 401K, AND PAID VACATION.\n\nMAJOR DUTIES & RESPONSIBILITIES\n\nSELL AND MAINTAIN 100% DISTRIBUTION OF ALL “AUTHORIZED” HERSHEY ITEMS IN ASSIGNED TERRITORY. ENSURING FLAWLESS RETAIL EXECUTION OF HEADQUARTER SALES AND MERCHANDISING PLANS (RETAIL EXECUTION PLAN) WITH VARIOUS RETAILERS.ACHIEVE ALL MERCHANDISING OBJECTIVES THROUGH THE EFFECTIVE USE OF PERMANENT SECONDARY DISPLAYS AND OTHER DISPLAY VEHICLES ESTABLISHED WITHIN THE RETAIL EXECUTION PLAN.REPORTING OF WEEKLY ACTIVITY, EXPENSES, ACCOUNT CHANGES, PROMOTIONS AND ALL ADMINISTRATIVE FUNCTIONS WITHIN ASSIGNED TERRITORY.REPORTING OF DAILY ACTIVITIES THROUGH THE USE OF TABLETS, SUBMITTING UPON COMPLETION OF EACH DAY.RESPONSIBLE FOR SALES TERRITORY - VARIES DUE TO TERRITORY SIZE, NUMBER OF RETAILERS, AND LOCATION.\n\nJOB REQUIREMENTS NEEDED:\n\nMUST HAVE A VALID US STATE ISSUED DRIVER’S LICENSEMUST HAVE A PERSONAL VEHICLE IN SOUND OPERATING CONDITIONUST MAINTAIN PERSONAL AUTO INSURANCE INDICATING MINIMUM COVERAGE OF $100,000 PER PERSON / $100,000 PER ACCIDENT / $100,000 PROPERTY DAMAGE. THE POLICY MUST PERMIT BUSINESS USE.MUST RESIDE OR BE WILLING TO COMMUTE WITHIN THE TERRITORY BOUNDARIES AS LISTED IN THE JOB DESCRIPTIONMUST BE ABLE TO DRIVE LONG DISTANCES TO MAKE MULTIPLE SALES CALLS ON A DAILY BASISMUST BE ABLE TO LIFT 10-40 LBS. ON A REGULAR BASIS WITH OR WITHOUT REASONABLE ACCOMMODATIONSMUST BE ABLE TO BEND, KNEEL, STOOP DOWN AND DEMONSTRATE MANUAL DEXTERITY ON A FREQUENT BASIS WITH OR WITHOUT REASONABLE ACCOMMODATIONSMUST BE ABLE TO USE TABLET TECHNOLOGYMUST HAVE DAILY ACCESS TO WIRELESS INTERNETMUST HAVE FLEXIBILITY AND ADAPTABILITY TO CHANGES IN TERRITORY COVERAGEAVAILABILITY TO WORK 20-25 HOURS PER WEEKEDUCATION: HIGH SCHOOL DIPLOMA OR GED EQUIVALENTEXPERIENCE: 3-4 YEARS FOOD MERCHANDISING IS PREFERRED BUT NOT REQUIRED\n\nSO, WHAT DO YOU SAY? WOULD YOU LIKE TO REPRESENT FUN BRANDS LIKE REESE’S, HERSHEY’S KISSES, TWIZZLERS AND JOLLY RANCHERS IN YOUR SPARE TIME?\n\nIF SO…APPLY TODAY! WE’D LOVE TO HEAR FROM YOU!\n\n2/2023",
    "job_skill_set": [
      "sales",
      "merchandising",
      "relationship building",
      "flexibility",
      "adaptability",
      "communication",
      "time management",
      "problem solving",
      "tablet technology",
      "valid driver's license",
      "personal vehicle",
      "auto insurance",
      "lifting (10-40 lbs)",
      "bending and kneeling",
      "wireless internet access",
      "reporting"
    ],
    "short_keywords": [
      "1040",
      "access",
      "adaptability",
      "and",
      "associate",
      "auto",
      "bending",
      "building",
      "ca",
      "communication",
      "drivers",
      "flexibility",
      "hersheys",
      "insurance",
      "internet",
      "kneeling",
      "lbs",
      "license",
      "lifting",
      "management",
      "merchandising",
      "ontario",
      "parttime",
      "personal",
      "problem",
      "relationship",
      "reporting",
      "sales",
      "solving",
      "tablet",
      "technology",
      "territory",
      "time",
      "valid",
      "vehicle",
      "wireless"
    ]
  },
  {
    "job_id": "3901961218",
    "job_title": "On-Premise Sales Consultant - NOVA East",
    "category": "SALES",
    "job_description": "WHAT YOU NEED TO KNOW\n\nOPEN YOUR FUTURE TO INCREDIBLE CAREER POTENTIAL. WORK FOR AN INDUSTRY-LEADER WHO INVESTS IN THEIR PEOPLE. SOUTHERN GLAZER’S WINE & SPIRITS IS NORTH AMERICA’S PREEMINENT WINE AND SPIRITS DISTRIBUTOR, AS WELL AS A FAMILY-OWNED, PRIVATELY HELD COMPANY WITH A 50+ YEAR LEGACY OF SUCCESS. WE WERE NAMED BY NEWSWEEK AS A MOST LOVED WORKPLACE AND ARE INCLUDED ON THE FORBES LISTS FOR LARGEST PRIVATE COMPANIES AND BEST EMPLOYERS FOR DIVERSITY.\n\nSOUTHERN GLAZER’S OFFERS A COMPETITIVE COMPENSATION PACKAGE WITH EXPECTED FIRST YEAR TOTAL EARNINGS BETWEEN $50000 - $70000 / YEAR INCLUDING INCENTIVES AND AUTO ALLOWANCE/REIMBURSEMENT. THIS SALARY RANGE IS AN AVERAGE RANGE FOR THIS POSITION. IN DETERMINING A FINAL OFFER, THE COMPANY WILL EVALUATE A SPECIFIC CANDIDATE'S EDUCATION, SKILLS AND EXPERIENCE AND WILL MAKE AN OFFER APPROPRIATELY.\n\nAS A FULL-TIME EMPLOYEE, YOU CAN CHOOSE FROM A FULL MENU OF OUR TOP SHELF BENEFITS, INCLUDING COMPREHENSIVE MEDICAL AND PRESCRIPTION DRUG COVERAGE, DENTAL AND VISION PLANS, TAX-SAVING FLEXIBLE SPENDING ACCOUNTS, DISABILITY COVERAGE, LIFE INSURANCE PLANS, AND A 401(K) PLAN. WE ALSO OFFER TUITION REIMBURSEMENT, A WELLNESS PROGRAM, PARENTAL LEAVE, VACATION ACCRUAL, PAID SICK LEAVE, AND MORE.\n\nAT SOUTHERN GLAZER’S, YOU’LL ENJOY AN ENVIRONMENT WHERE CONTINUOUS LEARNING AND GROWTH ARE SUPPORTED AND EXPERIENCE A CULTURE WHERE YOU ARE RESPECTED, AND YOUR VOICE IS HEARD. IF YOU’RE LOOKING TO FILL YOUR GLASS WITH OPPORTUNITY, COME JOIN OUR FAMILY.\n\nOVERVIEW\n\nTHE SALES CONSULTANT REPRESENTS SOUTHERN GLAZER’S IN THE MARKET AS A MEMBER OF THE SOUTHERN GLAZER’S FAMILY. THIS INDIVIDUAL IS PASSIONATE, INNOVATIVE, AND SELF-MOTIVATED WITH A BUSINESS-ORIENTED AND CUSTOMER-FOCUSED MINDSET. THE SALES CONSULTANT’S PRIMARY RESPONSIBILITIES ARE TO VISIT THE CUSTOMER, HAVE THE RIGHT CONSULTATIVE SALES CONVERSATIONS, AND INCREASE SALES REVENUE. FACE-TO-FACE CONSULTATIVE SELLING BUILT ON TRUSTING RELATIONSHIPS DRIVES MAXIMUM VALUE TO OUR CUSTOMER AND SUPPLIER PARTNERS AS WELL AS TO THE SGWS ORGANIZATION.\n\nPRIMARY RESPONSIBILITIES\n\nBUILD POSITIVE, CREDIBLE, LASTING CUSTOMER RELATIONSHIPS BASED ON TRUSTDISCOVER AND IDENTIFY CUSTOMER BUSINESS GROWTH NEEDSDEVELOP A CUSTOMER BUSINESS GROWTH PLAN FOR EACH ACCOUNT AND BUILD A PIPELINE OF SELLING OPPORTUNITIES TO DRIVE INCREMENTAL SALES ABOVE BASE BUSINESSANALYZE DATA AND INSIGHTS TO INCREASE SALES, GROW CUSTOMER BUSINESS, AND BETTER ACHIEVE OBJECTIVESREGULARLY AND CONSISTENTLY PRE-PLAN ACCOUNT VISITS WITH AN AGENDA, SERVICE PURPOSE, AND SELLING OPPORTUNITIES DOCUMENTED IN CRM (PROOF)PRIORITIZE SALES ACTIVITIES TO ACHIEVE OBJECTIVES BASED ON EACH CUSTOMER BUSINESS GROWTH PLANVISIT ACCOUNTS REGULARLY, CAPTURE VISIT NOTES, AND BUILD VISIT PLANS CONSIDERING PREVIOUS VISIT OUTCOMES AND DOCUMENT IN CRM (PROOF)MAINTAIN DEEP KNOWLEDGE OF SGWS PRODUCTS AND CORRECTLY PRESENT AND POSITION THEM IN EACH ACCOUNTPROPOSE SELLING SOLUTIONS TO EACH CUSTOMER AND WIN THE SALE USING CONSULTATIVE SELLING SKILLSACHIEVE INTERNAL SGWS AND SUPPLIER OBJECTIVES AS PRIORITIZED BY MANAGEMENTMANAGE CUSTOMER ISSUE RESOLUTION, SEEK ADDITIONAL OPPORTUNITIES TO SUPPORT THE CUSTOMER’S NEEDS, AND SUPPORT BUSINESS GROWTH BY PROVIDING CUSTOMERS WITH USEFUL INFORMATION AND GUIDANCEADAPT THE SELLING APPROACH BASED ON EACH CUSTOMER’S BUYING STYLES AND INDIVIDUAL BUSINESS NEEDSBE KNOWLEDGEABLE AND EXPERIENCED IN ALL ACCOUNTS STAYING CURRENT WITH WHAT COMPETITORS ARE OFFERING AND HOW SGWS PRODUCTS ARE POSITIONED RELATIVE TO THE COMPETITIONDOCUMENT AND MAINTAIN ACCOUNT- AND CUSTOMER-SPECIFIC INFORMATION IN CRM (PROOF)PARTICIPATE IN SALES MEETINGS, ON-SITE TRAINING, AND SUPPLIER EVENTS AS REQUIREDPERFORM OTHER DUTIES AS ASSIGNE\n\nADDITIONAL PRIMARY RESPONSIBILITIES\n\nMINIMUM QUALIFICATIONS\n\n21 YEARS OR OLDERABLE TO ANALYZE AND UNDERSTAND DATA AND INFORMATIONABLE TO LEVERAGE SGWS TECHNOLOGY TO PERFORM DUTIES AND RESPONSIBILITIESABLE TO BUILD AND STRUCTURE CUSTOMER PRESENTATIONS AND PRODUCT PROPOSALSPROFICIENT IN USING MOBILE DEVICES (E.G., IPAD®, SMARTPHONE) AND ONLINE COMMUNICATION TECHNIQUES (EMAIL, POSTING, TEXTING, ETC.) IN A PROFESSIONAL MANNERABLE TO CONSISTENTLY ACHIEVE RESULTS, EVEN UNDER TOUGH CIRCUMSTANCESABLE TO TAKE RESPONSIBILITY FOR OWN ACTIONS AND RESULTS; COMMITS TO PROVIDING A CONSISTENTLY HIGH LEVEL OF SERVICE TO CUSTOMERS, SUPPLIERS, COLLEAGUES, AND MANAGEMENTABLE TO COMMUNICATE EFFECTIVELY THROUGH VARIOUS METHODS AND EXPRESS SELF CLEARLY AND CONCISELY WHILE APPROPRIATELY TAILORING THE MESSAGE TO THE AUDIENCEABLE TO BE NIMBLE IN AMBIGUITY; BE OPEN TO CHANGE; EMBRACE INNOVATIVE IDEASTEAM PLAYER; WORKS COLLABORATIVELY WITH OTHERSABLE TO WORK IN A FAST-PACED, RESULTS-DRIVEN ENVIRONMENTMUST POSSESS A RELIABLE VEHICLE, A VALID DRIVER’S LICENSE, AND THE ABILITY TO OBTAIN AND MAINTAIN AUTO LIABILITY INSURANCE ON THEIR VEHICLE IN COMPLIANCE WITH SGWS COMPANY REQUIREMENTS.HIGH SCHOOL DIPLOMA OR GED REQUIREDABLE TO TRAVEL AS NEEDED\n\nPHYSICAL DEMANDS\n\n PHYSICAL DEMANDS WITH ACTIVITY OR CONDITION FOR A CONSIDERABLE AMOUNT OF TIME MAY INCLUDE SITTING AND TYPING/KEYBOARDING USING A COMPUTER (E.G., KEYBOARD, MOUSE, AND MONITOR) OR MOBILE DEVICEPHYSICAL DEMANDS WITH ACTIVITY OR CONDITION MAY INCLUDE WALKING, BENDING, REACHING, STANDING, SQUATTING, AND STOOPINGPHYSICAL DEMANDS WITH ACTIVITY OR CONDITION FOR A CONSIDERABLE AMOUNT OF TIME INCLUDE DRIVING THROUGHOUT THE DAY WITH SEGMENTS UP TO 2 HOURSMAY REQUIRE LIFTING/LOWERING, PUSHING, CARRYING, OR PULLING UP TO 56LBS\n\nEEO STATEMENT\n\nSOUTHERN GLAZER'S WINE AND SPIRITS, AN AFFIRMATIVE ACTION/EEO EMPLOYER, PROHIBITS DISCRIMINATION AND HARASSMENT OF ANY TYPE AND PROVIDES EQUAL EMPLOYMENT OPPORTUNITIES TO ALL EMPLOYEES AND APPLICANTS FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, AGE, SEX, NATIONAL ORIGIN, DISABILITY STATUS, GENETICS, PROTECTED VETERAN STATUS, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, OR ANY OTHER CHARACTERISTIC PROTECTED BY FEDERAL, STATE OR LOCAL LAWS. THIS POLICY APPLIES TO ALL TERMS AND CONDITIONS OF EMPLOYMENT, INCLUDING RECRUITING, HIRING, PLACEMENT, PROMOTION, TERMINATION, LAYOFF, RECALL, TRANSFER, LEAVES OF ABSENCE, COMPENSATION AND TRAINING. SOUTHERN GLAZER'S WINE AND SPIRITS PROVIDES COMPETITIVE COMPENSATION BASED ON ESTIMATED PERFORMANCE LEVEL CONSISTENT WITH THE PAST RELEVANT EXPERIENCE, KNOWLEDGE, SKILLS, ABILITIES AND EDUCATION OF EMPLOYEES. UNLESS OTHERWISE EXPRESSLY STATED, ANY PAY RANGES POSTED HERE ARE ESTIMATES FROM OUTSIDE OF SOUTHERN GLAZER'S WINE AND SPIRITS AND DO NOT REFLECT SOUTHERN GLAZER'S PAY BANDS OR RANGES.",
    "job_skill_set": [
      "communication",
      "relationship building",
      "self-motivation",
      "teamwork",
      "problem solving",
      "customer focus",
      "time management",
      "consultative selling",
      "CRM software",
      "data analysis",
      "mobile device proficiency",
      "customer presentations",
      "product proposals",
      "sales strategy development",
      "market knowledge",
      "adaptability"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "building",
      "communication",
      "consultant",
      "consultative",
      "crm",
      "customer",
      "data",
      "development",
      "device",
      "east",
      "focus",
      "knowledge",
      "management",
      "market",
      "mobile",
      "nova",
      "onpremise",
      "presentations",
      "problem",
      "product",
      "proficiency",
      "proposals",
      "relationship",
      "sales",
      "selfmotivation",
      "selling",
      "software",
      "solving",
      "strategy",
      "teamwork",
      "time"
    ]
  },
  {
    "job_id": "3902863704",
    "job_title": "Part-Time Retail Sales Associate",
    "category": "SALES",
    "job_description": "AT KOHL’S OUR STRATEGY IS TO BECOME THE MOST TRUSTED RETAILER OF CHOICE FOR THE ACTIVE AND CASUAL LIFESTYLE. BE PART OF A TEAM CULTURE THAT VALUES DIVERSITY AND INCLUSION, WORKS HARD TO HELP EACH OTHER SUCCEED, AND CELEBRATES EACH OTHER'S WINS TO DELIVER A BEST-IN-CLASS EXPERIENCE FOR OUR CUSTOMERS. ABOUT THE ROLE IN THIS ROLE, YOU WILL ENGAGE AND CONNECT WITH OUR CUSTOMERS BY PROVIDING EXCELLENT CUSTOMER SERVICE THROUGH OUR HOSPITALITY MENTALITY APPROACH. YOU WILL OFFER INFORMATION TO THE CUSTOMER ON CURRENT MERCHANDISE ASSORTMENT, STORE PROMOTIONS AND EVENTS, AND EXECUTE OPERATIONAL PROCESSES EFFECTIVELY AND EFFICIENTLY TO DRIVE SALES.\n\nKEY ACCOUNTABILITIES\n\nSUPPORT SALES, HOSPITALITY, OPERATIONS, PEOPLE AND CONVERSION THROUGH OUR SHOP C3 PROGRAM.\n\nDRIVE SALES\n\nDRIVE SALES BY PROVIDING AN INSPIRING ENVIRONMENT THAT MOTIVATES CUSTOMERS TO ADD TO THEIR BASKET\n\nBUILD TRUST TO SOLVE THE CUSTOMER SHOPPING NEEDS\n\nLEVERAGE OMNI CHANNEL OFFERINGS TO DELIVER A FRICTIONLESS CUSTOMER EXPERIENCEACCURATELY DELIVER ON OUR OPERATIONAL PROCESSES, BOPUS, BOSS, MLS, SFS\n\nBUILD RAPPORT AND MAKE A GENUINE CONNECTION WITH THE CUSTOMER\n\nACKNOWLEDGE AND ASSIST CUSTOMERS THROUGH OUR COMPANY PROGRAMS COMPLETE TRANSACTIONS ACCURATELY AND EFFICIENTLY WHILE ENGAGING CUSTOMERSCOURTEOUS AND RESPONSIVE TO REQUESTS AND QUESTIONSANSWER QUESTIONS QUICKLY AND ACCURATELY\n\nBE A SAVINGS CONSULTANT TO HELP CUSTOMERS SAVE WITH A KOHL’S CARD\n\nCONVERTS, OPENS AND ACTIVATES KOHL’S CARD APPLICATIONSPROMOTE OUR LOYALTY PROGRAMS BY EDUCATING CUSTOMERS \n\nESSENTIAL FUNCTIONS\n\nTHE REQUIREMENTS LISTED BELOW ARE REPRESENTATIVE OF FUNCTIONS AN ASSOCIATE WILL BE REQUIRED TO PERFORM AND THE ASSOCIATE MAY BE REQUIRED TO PERFORM ADDITIONAL FUNCTIONS. THE COMPANY MAY REVISE THIS JOB DESCRIPTION FROM TIME TO TIME. TO PERFORM THIS JOB SUCCESSFULLY, AN INDIVIDUAL MUST BE ABLE TO PERFORM EACH ESSENTIAL DUTY SATISFACTORILY. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS, ABSENT UNDUE HARDSHIP.\n\nABILITY TO PERFORM THE KEY ACCOUNTABILITIESABILITY TO MAINTAIN PROMPT AND REGULAR ATTENDANCE AS SET BY THE COMPANY. ABILITY TO COMPLY WITH DRESS CODE REQUIREMENTS.ABILITY TO LEARN AND COMPLY WITH ALL COMPANY POLICIES, PROCEDURES, STANDARDS AND GUIDELINES.ABILITY TO RECEIVE, UNDERSTAND AND PROACTIVELY RESPOND TO DIRECTION FROM SUPERVISORS/MANAGERS AND OTHER COMPANY PERSONNEL. ABILITY TO WORK AS PART OF A TEAM AND INTERACT EFFECTIVELY WITH OTHERS.ABILITY TO WORK IN A FAST PACED ENVIRONMENT AND ACCOMPLISH MULTIPLE TASKS WITHIN ESTABLISHED TIMEFRAMES.ABILITY TO SATISFACTORILY COMPLETE COMPANY TRAINING PROGRAMS.BASIC MATH AND READING SKILLS, LEGIBLE HANDWRITING, AND BASIC COMPUTER OPERATION.ABILITY TO OPERATE AND COMMUNICATE ON MULTIPLE FREQUENCY DEVICES, HANDHELD SCANNERS, AND OTHER TECHNOLOGY EQUIPMENT AS DIRECTED.AVAILABILITY TO WORK DAYS, NIGHTS, AND WEEKENDS.PERFORM WORK IN ACCORDANCE WITH THE PHYSICAL REQUIREMENTS SECTION. \n\nPHYSICAL REQUIREMENTS\n\nMUST BE ABLE TO LIFT UP TO 50 LBS. FREQUENTLY AND OCCASIONALLY OVER 50 LBS. WITH A TWO PERSON LIFT.ABILITY TO CLIMB, SQUAT, STOOP, KNEEL, CROUCH, BEND, TWIST, REACH, LIFT, GRASP, PUSH AND PULL ON A FREQUENT BASIS.ABILITY TO STAND AND/WALK FOR THE DURATION OF A SCHEDULED SHIFT (AT LEAST 8 HOURS).ABILITY TO VISUALLY VERIFY INFORMATION AND LOCATE AND INSPECT MERCHANDISE.ABILITY TO WEAR A FACE MASK OR COVERING AND OTHER PERSONAL PROTECTIVE EQUIPMENT.ABILITY TO WITHSTAND EXPOSURE TO VARYING TEMPERATURES, HUMIDITY, AND OTHER ELEMENTS WHILE PERFORMING CERTAIN JOB DUTIES INCLUDING BUT NOT LIMITED TO CURBSIDE, TRUCK UNLOAD, ETC.\n\nPREFERRED QUALIFICATIONS\n\nCLIENT FACING RETAIL OR SERVICE INDUSTRY EXPERIENCEEXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLS WITH THE ABILITY TO INFLUENCE IN A CLEAR AND CONCISE MANNER.NATURALLY CURIOUS; DESIRE TO LEARNCOMMITMENT TO VALUING DIVERSITY AND CONTRIBUTING TO AN INCLUSIVE WORK ENVIRONMENT \n\nPAY STARTS AT: $14.50\n\nREQ# : R327982\n\n",
    "job_skill_set": [
      "customer service",
      "sales",
      "merchandise knowledge",
      "cash handling",
      "communication",
      "teamwork",
      "problem solving",
      "customer engagement",
      "basic math",
      "computer operation",
      "technology equipment operation",
      "adaptability",
      "curiosity",
      "inclusivity"
    ],
    "short_keywords": [
      "adaptability",
      "associate",
      "basic",
      "cash",
      "communication",
      "computer",
      "curiosity",
      "customer",
      "engagement",
      "equipment",
      "handling",
      "inclusivity",
      "knowledge",
      "math",
      "merchandise",
      "operation",
      "parttime",
      "problem",
      "retail",
      "sales",
      "service",
      "solving",
      "teamwork",
      "technology"
    ]
  },
  {
    "job_id": "3905835040",
    "job_title": "Entry Level Sales Representative ",
    "category": "SALES",
    "job_description": "ARE YOU COMPETITIVE? SELF DRIVEN? OUTGOING? ENJOY TRAVELING?AT SAFINC WE ARE ALL OF THE ABOVE! WHETHER YOU ARE LOOKING TO SPRING INTO YOUR NEXT SALES CAREER, HIT THE CEILING WITH YOUR LAST COMPANY WITH NO MORE GROWTH OR ARE LOOKING TO START YOUR FIRST CAREER WITHIN THE INDUSTRY WE ARE HIRING!\nWE ARE CURRENTLY LOOKING FOR CANDIDATES THAT ARE:COMFORTABLE MEETING WITH BUSINESS OWNERS AND CLIENTS IN PERSONNATURAL LEADERS THAT CAN DEMONSTRATE HOW TO LEAD FROM THE FRONTOUTGOING AND WILLING TO NETWORKWILLING TO LEARN AND GENERATE THEIR NEXT OWN SUCCESSLOOKING FOR A CHALLENGE\nJOB REQUIREMENTS:COMMUTE TO OFFICE DAILY18 YEARS OR OLDERBUSINESS PROFESSIONAL ATTIREMINIMUM 1 TO 2 YEARS OF CUSTOMER SERVICE EXPERIENCEHIGHSCHOOL DIPLOMA OR HIGHERPASS BACKGROUND CHECK\nBENEFITS:HANDS ON TRAINING AND DEVELOPMENTROOM FOR SELF-DRIVEN PROMOTIONSWEEKLY COMPETITIONS AND INCENTIVESTEAM ORIENTED OFFICE0 SENIORITY, STRICTLY MERIT BASED",
    "job_skill_set": [
      "customer service",
      "sales",
      "business communication",
      "networking",
      "leadership",
      "self-driven",
      "competitive",
      "willingness to learn",
      "teamwork",
      "problem solving",
      "outgoing"
    ],
    "short_keywords": [
      "business",
      "communication",
      "competitive",
      "customer",
      "entry",
      "leadership",
      "learn",
      "level",
      "networking",
      "outgoing",
      "problem",
      "representative",
      "sales",
      "selfdriven",
      "service",
      "solving",
      "teamwork",
      "to",
      "willingness"
    ]
  },
  {
    "job_id": "3888029103",
    "job_title": "Retail Sales Associate",
    "category": "SALES",
    "job_description": "WHEN YOU JOIN VERIZON\n\nVERIZON IS ONE OF THE WORLD'S LEADING PROVIDERS OF TECHNOLOGY AND COMMUNICATIONS SERVICES, TRANSFORMING THE WAY WE CONNECT AROUND THE WORLD. WE'RE A HUMAN NETWORK THAT REACHES ACROSS THE GLOBE AND WORKS BEHIND THE SCENES. WE ANTICIPATE, LEAD, AND BELIEVE THAT LISTENING IS WHERE LEARNING BEGINS. IN CRISIS AND IN CELEBRATION, WE COME TOGETHER-LIFTING UP OUR COMMUNITIES AND STRIVING TO MAKE AN IMPACT TO MOVE THE WORLD FORWARD. IF YOU'RE FUELED BY PURPOSE, AND POWERED BY PERSISTENCE, EXPLORE A CAREER WITH US. HERE, YOU'LL DISCOVER THE RIGOR IT TAKES TO MAKE A DIFFERENCE AND THE FULFILLMENT THAT COMES WITH LIVING THE #NETWORKLIFE.\n\nWHAT YOU'LL BE DOING...\n\nAS A FULL-TIME VERIZON RETAIL SALES ASSOCIATE, YOU'LL HAVE THE OPPORTUNITY TO GROW YOUR CAREER WITH A TEAM FOCUSED ON UNLOCKING YOUR FULL POTENTIAL AND SALES SUCCESS WITHIN ONE OF OUR RETAIL STORES. HERE'S WHAT YOU CAN EXPECT:GENERATE RETAIL SALES BY USING YOUR PASSION FOR CUTTING-EDGE TECHNOLOGY, AND EXCEPTIONAL CUSTOMER SERVICE TO EXPAND THE VERIZON NETWORK.\nLEARN AND UNCOVER CUSTOMERS' NEEDS BY CREATING CONNECTIONS AND ASKING THE RIGHT QUESTIONS.\nPOSITION PRODUCT INSIGHTS AND SOLUTION RECOMMENDATIONS TO PROVIDE CUSTOMERS WITH A COMPLETE TOP-DOWN SALES SOLUTION.\nCLOSE SALES BY USING PHENOMENAL COMMUNICATION SKILLS TO FULFILL CUSTOMER NEEDS WITH SIMPLE AND INTUITIVE TECH SOLUTIONS. \nCONTINUOUSLY DEVELOP YOURSELF THROUGH ONGOING TRAINING AND UP-SKILL IN OPERATIONAL FUNCTIONS ACROSS MERCHANDISING AND INVENTORY.\nREFINE YOUR SALES SKILLS THROUGH OUTBOUND CALLS TO CURRENT VERIZON CUSTOMERS INTERESTED IN OUR PRODUCTS AND SERVICES.\n\nJOIN VERIZON TODAY AND BE ELIGIBLE FOR A $2,500 SIGN-ON BONUS! (SUBJECT TO THE TERMS AND CONDITIONS OF THE AWARD)\n\nWE'RE HIRING IMMEDIATELY AND THIS ISN'T YOUR AVERAGE THIS ENTRY-LEVEL POSITION! WHETHER YOU'RE EARLY IN YOUR CAREER OR A SEASONED SALES PROFESSIONAL, JOIN TODAY AND EARN FROM $49,000 TO $59,000 A YEAR, WHICH INCLUDES BASE PAY AND TARGET INDIVIDUAL-BASED COMMISSION. PLANNING TO GO ABOVE AND BEYOND? OUR COMMISSION PROGRAM ALLOWS UNLIMITED OPPORTUNITY WHICH COULD ALLOW TOP EARNERS TO MAKE AN EXTRA $10,000 OR MORE PER YEAR IN ADDITION TO THE COMPENSATION RANGE QUOTED EARLIER. COMPENSATION VARIES BY GEOGRAPHY AND PERFORMANCE.\n\nOUR COMPREHENSIVE BENEFITS (STARTING DAY ONE) AND PERKS ARE DESIGNED TO HELP YOU MOVE FORWARD IN YOUR CAREER AND IN YOUR LIFE OUTSIDE OF VERIZON. FROM HEALTH AND WELL-BEING BENEFITS TO INVESTMENT IN YOUR EDUCATION AND CAREER, WE'VE GOT YOU COVERED!\nBEST IN CLASS MEDICAL, DENTAL, AND VISION\nVERIZON 401(K) PLAN WITH MATCHING CONTRIBUTIONS UP TO 6% OF ELIGIBLE PARTICIPANT CONTRIBUTIONS TO THE PLAN, QUALIFIED STUDENT LOAN REPAYMENTS, OR A COMBINATION OF BOTH (EFFECTIVE JANUARY 1, 2024) \n$2,500 STOCK GRANT PER YEAR, PART OF VERIZON'S STOCK TOGETHER AWARD PROGRAM\nSALES RECOGNITION PROGRAMS THAT HAVE, IN THE PAST, AWARDED TOP PERFORMERS WITH ALL INCLUSIVE TRAVEL TO DOMESTIC AND INTERNATIONAL DESTINATIONS, GIFTS, AND OTHER INCENTIVES\nFIVE WEEKS OF PAID TIME OFF (VACATION, HOLIDAYS, PERSONAL DAYS)\n8 WEEKS OF PAID PARENTAL LEAVE FOR ELIGIBLE NEW PARENTS (FOR NEW MOMS, WHEN PAIRED WITH SHORT-TERM DISABILITY, THIS BENEFIT PROVIDES UP TO 16 WEEKS OF PAID TIME-OFF)\nUP TO $8K PER YEAR IN TUITION ASSISTANCE\nDISCOUNTS UP TO 50% OFF ON VERIZON PRODUCTS AND SERVICES\nADDITIONAL EMPLOYEE DISCOUNTS ON ATTRACTIONS, AUTOMOTIVE, TRAVEL AND MORE.\n\nTOO GOOD TO BE TRUE? HEAR FROM OUR VERIZON RETAIL TEAM MEMBERS ON WHAT IT'S LIKE TO BE PART OF A TEAM THAT INVESTS IN YOU. FROM OUR IN-PERSON NEW HIRE EXPERIENCE AND AWARD-WINNING TRAINING PROGRAMS TO OUR INCLUSIVE CULTURE OF LEARNING AND AMAZING BENEFITS, YOU'LL BE ABLE TO APPLY YOUR SKILLS WHILE ELEVATING YOUR CAREER.\n\nWHAT WE'RE LOOKING FOR...\n\nYOU'LL NEED TO HAVE:HIGH SCHOOL DIPLOMA OR GED.\nONE OR MORE YEARS OF WORK EXPERIENCE.\nWILLINGNESS TO WORK EVENINGS, WEEKENDS, AND HOLIDAYS (YOU'LL KNOW YOUR SCHEDULE FOUR WEEKS IN ADVANCE).\nOPENNESS TO PICK UP ADDITIONAL SHIFTS AND EARN MORE INCOME, TYPICALLY DURING THE SUMMER MONTHS, NOVEMBER THROUGH DECEMBER, AND/OR DURING PEAK VACATION PERIODS. \n\nEVEN BETTER IF YOU HAVE ONE OR MORE OF THE FOLLOWING:EXPERIENCE WORKING IN A COMMISSION-BASED ENVIRONMENT.\nDEMONSTRATED SALES EXPERIENCE COMMUNICATING WITH CUSTOMERS TO FIND SOLUTIONS. \nCUSTOMER SERVICE EXPERIENCE.\n\nIF VERIZON AND THIS ROLE SOUND LIKE A FIT FOR YOU, WE ENCOURAGE YOU TO APPLY EVEN IF YOU DON'T MEET EVERY \"EVEN BETTER\" QUALIFICATION LISTED ABOVE. \n\nAFTER YOU APPLY...\n\nYOU MAY BE REQUIRED TO TAKE AN ASSESSMENT. IT TAKES ABOUT 20 MINUTES TO COMPLETE. IF YOU'RE SELECTED TO MOVE FORWARD, ONE OF OUR RECRUITERS WILL REACH OUT TO TELL YOU MORE ABOUT THE ROLE AND ANSWER YOUR QUESTIONS.\n\nWHERE YOU'LL BE WORKING\n\nIN THIS WORKSITE-BASED ROLE, YOU'LL WORK ONSITE AT A DEFINED LOCATION(S).\n\nSCHEDULED WEEKLY HOURS\n40\n\nEQUAL EMPLOYMENT OPPORTUNITY\n\nWE'RE PROUD TO BE AN EQUAL OPPORTUNITY EMPLOYER - AND CELEBRATE OUR EMPLOYEES' DIFFERENCES, INCLUDING RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, AGE, DISABILITY, AND VETERAN STATUS. AT VERIZON, WE KNOW THAT DIVERSITY MAKES US STRONGER. WE ARE COMMITTED TO A COLLABORATIVE, INCLUSIVE ENVIRONMENT THAT ENCOURAGES AUTHENTICITY AND FOSTERS A SENSE OF BELONGING. WE STRIVE FOR EVERYONE TO FEEL VALUED, CONNECTED, AND EMPOWERED TO REACH THEIR POTENTIAL AND CONTRIBUTE THEIR BEST. CHECK OUT OUR DIVERSITY AND INCLUSION PAGE TO LEARN MORE.",
    "job_skill_set": [
      "sales",
      "customer service",
      "communication",
      "technology",
      "inventory management",
      "outbound calling",
      "teamwork",
      "problem solving",
      "adaptability",
      "persistence",
      "learning orientation",
      "time management",
      "merchandising"
    ],
    "short_keywords": [
      "adaptability",
      "associate",
      "calling",
      "communication",
      "customer",
      "inventory",
      "learning",
      "management",
      "merchandising",
      "orientation",
      "outbound",
      "persistence",
      "problem",
      "retail",
      "sales",
      "service",
      "solving",
      "teamwork",
      "technology",
      "time"
    ]
  },
  {
    "job_id": "3904362984",
    "job_title": "Sales Manager (Part Time) - 24H210",
    "category": "SALES",
    "job_description": "QUESTIONNAIRE-3-52\n\n1321\n\nEMPLOYEE TYPE\n\nREGULAR\n\nIF YOU ARE A CURRENT CARTER’S EMPLOYEE, YOU MUST APPLY THROUGH THE INTERNAL CAREER LINK WITHIN THE MY CAREER & PERFORMANCE APP IN WORKDAY. DO NOT APPLY USING THE BELOW EXTERNAL APPLICATION. \n\nCARTER’S, INC. IS THE LARGEST BRANDED MARKETER IN NORTH AMERICA OF APPAREL EXCLUSIVELY FOR BABIES AND YOUNG CHILDREN. THE COMPANY OWNS THE CARTER’S AND OSHKOSH B’GOSH BRANDS, TWO OF THE MOST RECOGNIZED BRANDS IN THE MARKETPLACE. THESE BRANDS ARE SOLD IN LEADING DEPARTMENT STORES, NATIONAL CHAINS, AND SPECIALTY RETAILERS DOMESTICALLY AND INTERNATIONALLY. THEY ARE ALSO SOLD THROUGH MORE THAN 1,000 COMPANY-OPERATED STORES IN THE UNITED STATES, CANADA, AND MEXICO AND ONLINE AT WWW.CARTERS.COM, WWW.OSHKOSH.COM, WWW.CARTERSOSHKOSH.CA, AND WWW.CARTERS.COM.MX. THE COMPANY’S CHILD OF MINE BRAND IS AVAILABLE AT WALMART, ITS JUST ONE YOU BRAND IS AVAILABLE AT TARGET, AND ITS SIMPLE JOYS BRAND IS AVAILABLE ON AMAZON. THE COMPANY ALSO OWNS SKIP HOP, A GLOBAL LIFESTYLE BRAND FOR FAMILIES WITH YOUNG CHILDREN. CARTER’S IS HEADQUARTERED IN ATLANTA, GEORGIA. ADDITIONAL INFORMATION MAY BE FOUND AT WWW.CARTERS.COM.\n\nBABY CLOTHING, KIDS CLOTHES, TODDLER CLOTHES | CARTER'S\n\nSHOP FOR BABY CLOTHING, BABY NECESSITIES AND ESSENTIALS AT CARTERS.COM, THE MOST TRUSTED NAME IN BABY, KIDS, AND TODDLER CLOTHING. SHOP OUR SELECTION OF CUTE BABY & KIDS CLOTHING.\n\nPOSITION PURPOSE \n\nTHE SALES MANAGER’S PURPOSE IS TO UPHOLD THE CARTER’S MISSION, VISION, AND VALUES IN ORDER TO SUPPORT A HIGH PERFORMING TEAM THAT CONSISTENTLY DELIVERS TOP END RESULTS. THE SM IN PARTNERSHIP WITH THE STORE MANAGEMENT TEAM, OVERSEES THE OVERALL PRODUCTIVITY FOR THEIR STORE. THE SM RESPONSIBILITY INCLUDES SUPPORTING THE MANAGEMENT TEAM IN DRIVING FINANCIAL RESULTS THROUGH EXCEPTIONAL STORE STANDARDS, EXECUTION OF COMPANY STRATEGIES, AND POSITIVE CUSTOMER INTERACTION.\n\nESSENTIAL JOB FUNCTION (TASKS, DUTIES AND RESPONSIBILITES MOST IMPORTANT)\n\nPEOPLE\n\nCOMMUNICATES PROFESSIONALLY AND EFFECTIVELY WITH THE TEAM; MANAGEMENT AND ASSOCIATES.REGULARLY COMMUNICATES EMPLOYEE CONCERNS TO THE STORE MANAGER FOR QUICK RESOLUTION.ASSISTS IN HIRING; ACTIVELY RECRUITS AND COMPLETES CANDIDATE APPLICATION REVIEW TO ENSURE OPEN POSITIONS ARE FILLED TIMELY.OFFERS CONSISTENT, IN THE MOMENT, FEEDBACK TO STORE TEAM.RECOGNIZES AND REWARDS EXCEPTIONAL PERFORMANCE TO INCREASE EMPLOYEE ENGAGEMENT.RECEIVES FEEDBACK WITH POSITIVE INTENT AND MAKES EFFORTS TO TAKE APPROPRIATE ACTION ON THAT FEEDBACK.PARTNERS WITH STORE MANAGER TO ADDRESS PERFORMANCE CONCERNS OF ASSOCIATES.\n\nPERFORMANCE\n\nMAINTAINS THE COMPANY STANDARD OF A NEAT, CLEAN, AND ORGANIZED STORE.MEETS AND DEMONSTRATES EXCEPTIONAL CUSTOMER SERVICE BEHAVIORS AND MAINTAINS HIGH STANDARDS THROUGHOUT THE STORE.RESPONSIBLE FOR LEADING AND EXECUTING AN ASSIGNED DIVISION OF RESPONSIBILITY (DOR) THROUGH PLANNING AND DETAILED FOLLOW THROUGH.PERFORMS LEADER ON DUTY RESPONSIBILITIES BY DRIVING RESULTS AND RESPONDS TO CUSTOMER CONCERNS TIMELY AND WITH APPROPRIATE RESOLUTION.ASSISTS STORE MANAGEMENT WITH MODIFYING SCHEDULES BASED ON BUSINESS CLIMATE TO MAXIMIZE SALES AND PRODUCTIVITY.REGULARLY COMMUNICATES WITH STORE MANAGER TO DISCUSS STRENGTHS, OPPORTUNITIES, AND TRENDS IN BUSINESS.UTILIZES CUSTOMER FEEDBACK TO IDENTIFY AREAS OF OPPORTUNITY TO IMPLEMENT ACTIONS TO DRIVE RESULTS.\n\nPROCESS\n\nSUPPORTS THE PLANNING AND EXECUTION OF STORE PROCESSES AND MERCHANDISE PLACEMENT IN AN EFFICIENT MANNER WHILE FOLLOWING BRAND GUIDELINES.SUPPORTS STORE TEAM WITH ASSET PROTECTION THROUGH A CONSISTENT LEVEL OF CUSTOMER SERVICE, EDUCATION, AND OPERATIONAL CONTROLS.EXECUTES COMPANY DIRECTIVES WITHIN TIMELINES INCLUDING VISUAL, SIGNAGE, MARKDOWNS, AND SALES PROMOTIONS.BUILDS CUSTOMER LOYALTY THROUGH THE COMPANY SPONSORED PROGRAMS.ENSURES ALL COMPANY POLICIES AND PROCEDURES ARE FOLLOWED PER COMPANY STANDARDS.\n\nKNOWLEDGE, SKILLS, AND ABILITIES\n\nHIGH SCHOOL DEGREE OR GED MINIMUM REQUIREMENT, ASSOCIATES DEGREE PREFERRED OR EQUIVALENT COMBINATION OF EDUCATION AND EXPERIENCE.MINIMUM OF 1 YEAR IN RETAIL STORE MANAGEMENT.DEMONSTRATED CUSTOMER ENGAGEMENT SKILLS.DEMONSTRATES STRONG LISTENING, WRITTEN, AND ORAL COMMUNICATION SKILLS.ABILITY TO HANDLE MULTIPLE TASKS CONCURRENTLY.BASIC COMPUTER SKILLS.MUST BE AT LEAST 18 YEARS OLD.\n\nPHYSICAL DEMANDS \n\nABILITY TO LIFT 40 POUNDS ON A REGULAR BASIS.ABILITY TO STAND FOR LONG PERIODS OF TIME; CLIMB UP AND DOWN A LADDER.CONSTANT WALKING AND STANDING; FREQUENT BENDING, STOOPING, REACHING, PUSHING, AND PULLING.\n\nAVAILABILITY REQUIREMENTS\n\nREGULAR WORK FREQUENCY IS REQUIRED TO REMAIN AN ACTIVE EMPLOYEE.AVAILABILITY CHANGES MUST BE APPROVED BY THE STORE MANAGER AND WILL BE REVIEWED BASED ON BUSINESS NEEDS. SCHEDULED WORKING SHIFTS RANGE FROM 3-8 HOURS IN LENGTH (APPLICABLE STATE LAWS APPLY).\n\nNOTE: THIS JOB DESCRIPTION IS NOT INTENDED TO BE ALL-INCLUSIVE. THE DUTIES DESCRIBED MAY BE CHANGED OR REASSIGNED AT THE DISCRETION OF MANAGEMENT, AND THE EMPLOYEE MAY BE REQUIRED TO PERFORM DUTIES THAT ARE NOT LISTED IN THE JOB DESCRIPTION.\n\nCARTERS IS COMMITTED TO CREATING A DIVERSE ENVIRONMENT AND IS PROUD TO BE AN EQUAL OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, GENDER, GENDER IDENTITY, SEXUAL ORIENTATION, NATIONAL ORIGIN, GENETICS, DISABILITY, AGE, VETERAN STATUS, OR ANY OTHER STATUS PROTECTED BY FEDERAL, STATE, OR LOCAL LAW.",
    "job_skill_set": [
      "customer service",
      "merchandise placement",
      "basic computer skills",
      "financial results analysis",
      "communication",
      "teamwork",
      "problem solving",
      "employee engagement",
      "multitasking",
      "retail management"
    ],
    "short_keywords": [
      "24h210",
      "analysis",
      "basic",
      "communication",
      "computer",
      "customer",
      "employee",
      "engagement",
      "financial",
      "management",
      "manager",
      "merchandise",
      "multitasking",
      "part",
      "placement",
      "problem",
      "results",
      "retail",
      "sales",
      "service",
      "skills",
      "solving",
      "teamwork",
      "time"
    ]
  },
  {
    "job_id": "3894284827",
    "job_title": "Route Sales Professional Express Route",
    "category": "SALES",
    "job_description": "REQ39081\n\nEMPLOYMENT TYPE: REGULAR\n\nLOCATION: HAZEL PARK,MI\n\nHAVE YOU EVER ENJOYED ARNOLD®, BROWNBERRY® OR OROWEAT® BREAD? A THOMAS’® ENGLISH MUFFIN OR BAGEL? OR PERHAPS SNACKED ON A SARA LEE®, ENTENMANN’S® OR MARINELA® CAKE OR DONUT? IF THE ANSWER IS YES, THEN YOU KNOW BIMBO BAKERIES USA!\n\nMORE THAN 20,000 ASSOCIATES IN BAKERIES, SALES CENTERS, OFFICES AND ON SALES ROUTES WORK TO ENSURE OUR CONSUMERS HAVE THE FRESHEST PRODUCTS AT EVERY MEAL. IN ADDITION TO COMPETITIVE PAY AND BENEFITS, WE PROVIDE A SAFE AND INCLUSIVE WORK ENVIRONMENT THAT APPRECIATES DIVERSITY, PROMOTES DEVELOPMENT AND ALLOWS OUR ASSOCIATES TO BE THEIR AUTHENTIC SELVES.\n\nROUTE SALES PROFESSIONAL EXPRESS ROUTE\n\nCOME JOIN THE LARGEST BAKING COMPANY IN THE WORLD AND OUR FAMILY OF 20,000 ASSOCIATES NATIONWIDE!\n\nTOP REASONS TO WORK AT BIMBO BAKERIES USA\n\nBASE PAY ($275.00) + COMMISSION (ANNUALIZED MINIMUM SALARY OF $52,000). 1ST SHIFT OPENING (6 AM - 2 PM, MONDAY - FRIDAY). FULL BENEFITS OFFERED: MEDICAL, DENTAL, VISION, RETIREMENT PLAN. \n\nWHAT YOU WILL BE DOING\n\nMERCHANDISING, STOCKING, AND PROPER ONGOING ROTATION OF PRODUCT ON STORE SHELVES AND DISPLAYS, ENSURING BEST QUALITY AND FRESHNESS OF PRODUCTS. DRIVE SALES THROUGH THE ACQUISITION OF NEW DISPLAY SPACE, INCREMENTAL DISPLAYS AND THROUGH USING SALES DATA TO ESTABLISH OTHER STORE-LEVEL PLANS. FOLLOW UP ON NEW ACCOUNT OPPORTUNITIES AND BUILD EFFECTIVE CUSTOMER RELATIONSHIPS WHILE ENSURING PROMOTIONS ARE EXECUTED. INTRODUCE NEW PRODUCTS AND SERVICES TO MAXIMIZE SALES AND SHELF SPACE WITHIN EXISTING ACCOUNTS AND WHEN SOLICITING NEW CUSTOMERS. CONDUCT DAILY ROUTE SETTLEMENT PROCEDURES TO ACCOUNT FOR ALL PRODUCTS, INVOICES, AND CASH WHILE MAINTAINING PROPER INVENTORY COUNTS. DRIVE COMPANY ROUTE TRUCK SAFELY. COMPLETE DOT (US DEPARTMENT OF TRANSPORTATION) DAILY LOG AND SUBMIT OTHER DOCUMENTATION, PAPERWORK, AND DEPOSITS ON TIME. \n\nPOSITION REQUIREMENTS\n\nMUST BE AT LEAST 21 YEARS OF AGE OR OLDER. MUST HAVE A VALID DRIVER’S LICENSE WITH A SAFE DRIVING RECORD. MUST BE ABLE TO ACQUIRE AND MAINTAIN A DOT MEDICAL CARD. MUST BE ABLE TO CLIMB, PUSH/PULL, BEND, STOOP, AND KNEEL FOR EXTENDED PERIODS AS WELL AS PERFORM FREQUENT REACHING AND USE OF FINGERS. 1-3 YEARS OF RELATED EXPERIENCE IN DSD (DIRECT SALES DISTRIBUTION) IS PREFERRED. EQUAL OPPORTUNITY EMPLOYER/DISABLE/VETERANS [OR VETS]. \n\nTHE PHYSICAL AND MENTAL DEMANDS DESCRIBED IN EACH JOB POSTING ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY AN ASSOCIATE TO SUCCESSFULLY PERFORM THE ESSENTIAL FUNCTIONS OF EACH JOB. REASONABLE ACCOMMODATIONS MAY BE REQUESTED TO ENABLE QUALIFIED INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS OF EACH JOB.\n\nBIMBO BAKERIES USA IS AN EQUAL OPPORTUNITY EMPLOYER WITH A POLICY THAT PROVIDES EQUAL EMPLOYMENT OPPORTUNITY FOR APPLICANTS AND EMPLOYEES REGARDLESS OF RACE, COLOR, RELIGION, SEX (INCLUDING PREGNANCY, SEXUAL ORIENTATION, OR GENDER IDENTITY), NATIONAL ORIGIN, AGE, DISABILITY, GENETIC INFORMATION, MARITAL STATUS, VETERAN STATUS, ANY OTHER CLASSIFICATION PROTECTED BY LAW.",
    "job_skill_set": [
      "merchandising",
      "stocking",
      "customer relationship management",
      "inventory management",
      "documentation and paperwork",
      "communication",
      "teamwork",
      "problem solving",
      "time management",
      "adaptability",
      "customer service",
      "attention to detail",
      "sales data analysis",
      "valid driver's license",
      "DOT medical card",
      "route driving",
      "DSD experience"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "and",
      "attention",
      "card",
      "communication",
      "customer",
      "data",
      "detail",
      "documentation",
      "dot",
      "drivers",
      "driving",
      "dsd",
      "experience",
      "express",
      "inventory",
      "license",
      "management",
      "medical",
      "merchandising",
      "paperwork",
      "problem",
      "professional",
      "relationship",
      "route",
      "sales",
      "service",
      "solving",
      "stocking",
      "teamwork",
      "time",
      "to",
      "valid"
    ]
  },
  {
    "job_id": "3901800178",
    "job_title": "Sales Operations Manager",
    "category": "SALES",
    "job_description": "RESPONSIBILITIES\n\nJOB DESCRIPTION\n\n AS A CRITICAL PARTNER TO SALES AND OPERATIONS LEADERSHIP THE SALES OPS MANAGER WILL LEAD STRATEGIC TOTAL ENTERPRISE SALES OPERATIONS INCLUDING BUT NOT LIMITED TO: STRATEGIC GROWTH INITIATIVE EXECUTION, MACRO-LEVEL ORDER BOOK MANAGEMENT, INVENTORY ALLOCATIONS, SALES-FACING ATS VISIBILITY, HOT MARKET STRATEGY AND EXECUTION, SEASONAL AND IN-SEASON ORDER FILE HAND OFFS AND DROP REPORTING, AND CONTINUOUS IMPROVEMENT OF OVERALL SALES TOOLS AND REPORTING.  ACCOUNTABLE FOR DRIVING TOWARDS ACHIEVING WHOLESALE AND 1 ST PARTY FINANCIAL TARGETS  OWN CROSS FUNCTIONAL STRATEGIC AND PROCESS ALIGNMENT AND CRITICAL INPUTS TO WEEKLY AND MONTHLY SALES AND OPERATIONS MEETINGS  MONITOR KPIS AND KEY PROGRAMS FOR SALES THAT CONTRIBUTE TO FANATICS STRATEGIC AND REVENUE PLANS  DESIGN & IMPLEMENT BEST PRACTICES FOR WHOLESALE AND 1 ST PARTY SALES MANAGEMENT INCLUDING BUT NOT LIMITED TO EXECUTIVE DASHBOARDS, OPEN ORDER STATUS MEETINGS AND REPORTS  LIAISON BETWEEN SALES AND INTERNAL OPERATIONS STAKEHOLDERS SUCH AS WAREHOUSE/PRODUCTION TEAMS, PLANNING, RETAIL SERVICES  OPTIMIZE USE OF SALES TOOLS AND ENFORCE BEST PRACTICES. DEVELOP AND IMPLEMENT INITIATIVES (IE: TOOLS, PROCESS, ASSETS) THAT ACCELERATE THE PRODUCTIVITY OF A SALES MANAGER  USE BI DATA TO DRIVE DECISION-MAKING AND COMMUNICATION AROUND ORDER BOOK & ONBOARD SALES TEAM TO ALL BI FEATURES FOR SELF-SERVE REPORTING  USE DATA-DRIVEN DECISION-MAKING AND FIRST PRINCIPLES TO CONSISTENTLY IMPROVE OUR PROCESSES AND ADDRESS MAJOR GAPS/IMPROVEMENT OPPORTUNITIES  PARTICIPATE IN AND LEAD USER ACCEPTANCE TESTING (UAT) AND PROVIDE DETAILED FEEDBACK ON NEW SYSTEM ENHANCEMENTS  ABILITY TO INFLUENCE AND COMMUNICATE IMPORTANT FEEDBACK FROM SALES AND CUSTOMERS TO INTERNAL CROSS FUNCTIONAL TEAMS  CONTINUOUS IMPROVEMENT – PLAY A KEY ROLE ON THE TEAM TO IDENTIFY OPPORTUNITIES, DEVELOP STRATEGIES, AND DESIGN EXECUTION OF PROJECTS AND PROGRAMS TO INCREASE SALES PRODUCTIVITY AND IMPROVE OPERATIONAL EXCELLENCE \n\nREQUIREMENTS:\n\n 4-6 YEARS SALES OPERATIONS, MERCHANDISING OPERATIONS OR PLANNING EXPERIENCE REQUIRED  BACHELOR’S DEGREE PREFERRED OR EQUIVALENT WORK EXPERIENCE  LICENSED SPORTS INDUSTRY KNOWLEDGE AND/OR EXPERIENCE HIGHLY DESIRED  ADVANCED EXCEL, POWERPOINT SKILLS, COMPUTER PROFICIENT WITH MICROSOFT APPLICATIONS  MICROSTRATEGY OR OTHER DATA QUERYING TOOL EXPERIENCE REQUIRED  SALES FORCE OR OTHER CRM SYSTEM EXPERIENCE PREFERRED  EXPERT LEVEL ANALYTICAL AND QUANTITATIVE SKILLS  EXCELLENT ORGANIZATION SKILLS  STRONG PROFESSIONAL AND PROACTIVE COMMUNICATION SKILLS INCLUDING THE ABILITY TO WORK IN A TEAM ENVIRONMENT, SOLID WRITTEN AND VERBAL COMMUNICATOR  ABILITY TO MEET DEADLINES, PRIORITIZE WORKLOAD, ADAPT TO CHANGE, AND MAINTAIN COMPOSURE UNDER PRESSURE  POSITIVE ATTITUDE WITH FLEXIBILITY AND ADAPTS QUICKLY TO CHANGE \n\nABOUT US\n\nFANATICS IS BUILDING A LEADING GLOBAL DIGITAL SPORTS PLATFORM. THE COMPANY IGNITES THE PASSIONS OF GLOBAL SPORTS FANS AND MAXIMIZES THE PRESENCE AND REACH FOR HUNDREDS OF SPORTS PARTNERS GLOBALLY BY OFFERING INNOVATIVE PRODUCTS AND SERVICES ACROSS FANATICS COMMERCE, FANATICS COLLECTIBLES, AND FANATICS BETTING & GAMING, ALLOWING SPORTS FANS TO BUY, COLLECT AND BET. THROUGH THE FANATICS PLATFORM, SPORTS FANS CAN BUY LICENSED FAN GEAR, JERSEYS, LIFESTYLE AND STREETWEAR PRODUCTS, HEADWEAR, AND HARDGOODS; COLLECT PHYSICAL AND DIGITAL TRADING CARDS, SPORTS MEMORABILIA, AND OTHER DIGITAL ASSETS; AND BET AS THE COMPANY BUILDS ITS SPORTSBOOK AND IGAMING PLATFORM. FANATICS HAS AN ESTABLISHED DATABASE OF OVER 100 MILLION GLOBAL SPORTS FANS, A GLOBAL PARTNER NETWORK WITH OVER 900 SPORTS PROPERTIES, INCLUDING MAJOR NATIONAL AND INTERNATIONAL PROFESSIONAL SPORTS LEAGUES, TEAMS, PLAYERS ASSOCIATIONS, ATHLETES, CELEBRITIES, COLLEGES, AND COLLEGE CONFERENCES, AND OVER 2,000 RETAIL LOCATIONS, INCLUDING ITS LIDS RETAIL BUSINESS STORES. \n\nAS A MARKET LEADER WITH MORE THAN 18,000 EMPLOYEES, AND HUNDREDS OF PARTNERS, SUPPLIERS, AND VENDORS WORLDWIDE, WE TAKE RESPONSIBILITY FOR DRIVING TOWARD MORE ETHICAL AND SUSTAINABLE PRACTICES. WE ARE COMMITTED TO BUILDING AN INCLUSIVE FANATICS COMMUNITY, REFLECTING AND REPRESENTING SOCIETY AT EVERY LEVEL OF THE BUSINESS, INCLUDING OUR EMPLOYEES, VENDORS, PARTNERS AND FANS. FANATICS IS ALSO DEDICATED TO MAKING A POSITIVE IMPACT IN THE COMMUNITIES WHERE WE ALL LIVE, WORK, AND PLAY THROUGH STRATEGIC PHILANTHROPIC INITIATIVES.\n\nORGANIZATION\n\nFANATICS COMMERCE IS A LEADING DESIGNER, MANUFACTURER, AND SELLER OF LICENSED FAN GEAR, JERSEYS, LIFESTYLE AND STREETWEAR PRODUCTS, HEADWEAR, AND HARDGOODS. IT OPERATES A VERTICALLY-INTEGRATED PLATFORM OF DIGITAL AND PHYSICAL CAPABILITIES FOR LEADING SPORTS LEAGUES, TEAMS, COLLEGES, AND ASSOCIATIONS GLOBALLY – AS WELL AS ITS FLAGSHIP SITE, WWW.FANATICS.COM.\n\nFANATICS COMMERCE HAS A BROAD RANGE OF ONLINE, SPORTS VENUE, AND VERTICAL APPAREL PARTNERSHIPS WORLDWIDE, INCLUDING COMPREHENSIVE PARTNERSHIPS WITH LEADING LEAGUES, TEAMS, COLLEGES, AND SPORTS ORGANIZATIONS ACROSS THE WORLD—INCLUDING THE NFL, NBA, MLB, NHL, MLS, FORMULA 1, AND AUSTRALIAN FOOTBALL LEAGUE (AFL); THE DALLAS COWBOYS, GOLDEN STATE WARRIORS, PARIS SAINT-GERMAIN, MANCHESTER UNITED, CHELSEA FC, AND TOKYO GIANTS; THE UNIVERSITY OF NOTRE DAME, UNIVERSITY OF ALABAMA, AND UNIVERSITY OF TEXAS; THE INTERNATIONAL OLYMPIC COMMITTEE (IOC), ENGLAND RUGBY, AND THE UNION OF EUROPEAN FOOTBALL ASSOCIATIONS (UEFA).",
    "job_skill_set": [
      "Sales Operations",
      "Data Analysis",
      "Quantitative Skills",
      "Communication",
      "Teamwork",
      "Problem Solving",
      "Adaptability",
      "Organization",
      "Leadership",
      "Strategic Thinking",
      "Time Management",
      "Excel",
      "PowerPoint",
      "CRM Systems",
      "MicroStrategy",
      "Inventory Management"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "communication",
      "crm",
      "data",
      "excel",
      "inventory",
      "leadership",
      "management",
      "manager",
      "microstrategy",
      "operations",
      "organization",
      "powerpoint",
      "problem",
      "quantitative",
      "sales",
      "skills",
      "solving",
      "strategic",
      "systems",
      "teamwork",
      "thinking",
      "time"
    ]
  },
  {
    "job_id": "3906232228",
    "job_title": "Sales Associate Target Optical",
    "category": "SALES",
    "job_description": "REQUISITION ID:  842357\n\nSTORE #: 004956 TARGET OPTICAL\n\nPOSITION:PART-TIME\n\nTOTAL REWARDS: BENEFITS/INCENTIVE INFORMATION \n\nAT TARGET OPTICAL, WE ARE ON A MISSION TO BE THE ALLY THAT WOW'S! ALL FAMILIES SHOPPING AT TARGET, BY OFFERING AN EASY AND INSPIRING OPTICAL EXPERIENCE, NO MATTER WHEN, WHERE OR HOW THEY SHOP - AND HAVING A BLAST WHILE DOING IT!\n\nWE OFFER FLEXIBLE WORK SCHEDULES AND COMPETITIVE COMPENSATION PACKAGES INCLUDING MEDICAL & DENTAL BENEFITS, EMPLOYEE DISCOUNTS ON EYEWEAR, TUITION REIMBURSEMENT AND PAID TIME OFF. AT TARGET OPTICAL, WE PRIDE OURSELVES ON BUILDING A CULTURE WHERE WE FOCUS AND INVEST IN PEOPLE. WE ARE A FAST-GROWING BRAND AND ARE LOOKING FOR PEOPLE WHO ARE PASSIONATE, ENTHUSIASTIC AND GROWTH ORIENTED. AND BECAUSE WE ARE PART OF EYEWEAR INDUSTRY LEADER, LUXOTTICA, THERE IS PLENTY OF OPPORTUNITIES TO GROW YOUR CAREER WITHIN TARGET OPTICAL AND BEYOND.\n\nGENERAL FUNCTION \n\nTHE SALES ASSOCIATE IS RESPONSIBLE FOR CREATING AN OUTSTANDING OPTICAL EXPERIENCE FOR OUR GUESTS BY BRINGING TOGETHER THEIR KNOWLEDGE, EXPERIENCES AND PERSONALITY TOGETHER WITH THE GUESTS NEEDS AND OUR HIGH QUALITY FASHION BRANDS.\n\nMAJOR DUTIES AND RESPONSIBILITIES\n\nCONSISTENTLY DELIVER SALES PLAN AND COMPANY OBJECTIVES THROUGH CULTIVATING EXISTING CUSTOMER RELATIONSHIPS AND BUILDING NEW ONES.UTILIZES OPTICAL PRESCRIPTION TO RECOMMEND SPECIFIC LENSES AND LENS COATINGS.ASSISTS PATIENTS IN THE SELECTION OF FRAMES AND COORDINATES FRAMES WITH OPTICAL MEASUREMENTS ASSISTING OUR CUSTOMERS IN CHOOSING THE PERFECT VISION SOLUTION.CONDUCTS MEASUREMENTS USING APPROPRIATE OPTICAL TOOLS AND CONSULTS WITH OPTICIAN AS NEEDED.ACTIVELY PARTICIPATES AND CONTRIBUTES TO A POSITIVE STORE ENVIRONMENT, FOSTERING STRONG, PROFESSIONAL RELATIONSHIPS WITH PEERS, MANAGEMENT, DOCTORS AND SUPPORT STAFF (TARGET HOST PARTNERS).TAKES PRIDE IN THE APPEARANCE OF STORE & SHOWS INITIATIVE TO KEEP DISPLAYS & INVENTORY CLEAN, ATTRACTIVE & ORGANIZED.HELPS FOSTER AN INCLUSIVE CULTURE BY TREATING CUSTOMERS AND COLLEAGUES WITH RESPECT\n\nBASIC QUALIFICATIONS\n\nHIGH SCHOOL DIPLOMA OR GED1+ YEARS EXPERIENCE IN RETAIL OR CUSTOMER SERVICEFAMILIARITY WITH POINT OF SALE SYSTEM, COMPUTERS & CALCULATORS WITH BASIC PHONE AND MATH SKILLSEMBRACE NEW TECHNOLOGY & CHANGE WITH HIGH LEVEL OF ACCURACYABILITY TO SELL THROUGH USE OF SALES SKILLS AND ACCOUNTABILITY FOR SALES RESULTS, WITH A DESIRE TO MEET GOALS.STRONG COMMUNICATION SKILLS (BOTH ORAL AND WRITTEN)SELF-MOTIVATOR WITH A DEMONSTRATED ABILITY TO MULTI-TASK; ABILITY TO RESPOND FLEXIBLY IN A QUICKLY CHANGING ENVIRONMENT\n\nTARGET OPITICAL IS PART OF THE LUXOTTICA, N.A FAMILY. LUXOTTICA IS A LEADER IN THE DESIGN, MANUFACTURE AND DISTRIBUTION OF FASHION, LUXURY AND SPORTS EYEWEAR.\n\nEMPLOYEE PAY IS DETERMINED BY MULTIPLE FACTORS, INCLUDING GEOGRAPHY, EXPERIENCE, QUALIFICATIONS, SKILLS AND LOCAL MINIMUM WAGE REQUIREMENTS. IN ADDITION, YOU MAY ALSO BE OFFERED A COMPETITIVE BONUS AND/OR COMMISSION PLAN, WHICH COMPLEMENTS A FIRST-CLASS TOTAL REWARDS PACKAGE. BENEFITS MAY INCLUDE HEALTH CARE, RETIREMENT SAVINGS, PAID TIME OFF/VACATION, AND VARIOUS EMPLOYEE DISCOUNTS.\n\nUPON REQUEST AND CONSISTENT WITH APPLICABLE LAWS, ESSILORLUXOTTICA WILL PROVIDE REASONABLE ACCOMMODATIONS TO INDIVIDUALS WITH DISABILITIES WHO NEED ASSISTANCE IN THE APPLICATION AND HIRING PROCESS.  TO REQUEST A REASONABLE ACCOMMODATION, PLEASE CALL THE LUXOTTICA ETHICS COMPLIANCE HOTLINE AT 1-888-887-3348 (BE SURE TO PROVIDE YOUR NAME AND CONTACT INFORMATION SO THAT WE MAY FOLLOW UP IN A TIMELY MANNER) OR EMAIL HRCOMPLIANCE@LUXOTTICARETAIL.COM.\n\n \n\nWE ARE AN EQUAL OPPORTUNITY EMPLOYER.  ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, GENDER, NATIONAL ORIGIN, SOCIAL ORIGIN, SOCIAL CONDITION, BEING PERCEIVED AS A VICTIM OF DOMESTIC VIOLENCE, SEXUAL AGGRESSION OR STALKING, RELIGION, AGE, DISABILITY, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, CITIZENSHIP, ANCESTRY, VETERAN OR MILITARY STATUS, MARITAL STATUS, PREGNANCY (INCLUDING UNLAWFUL DISCRIMINATION ON THE BASIS OF A LEGALLY PROTECTED PREGNANCY OR MATERNITY LEAVE), GENETIC INFORMATION OR ANY OTHER CHARACTERISTICS PROTECTED BY LAW. NATIVE AMERICANS IN THE US RECEIVE PREFERENCE IN ACCORDANCE WITH TRIBAL LAW.",
    "job_skill_set": [
      "retail experience",
      "customer service",
      "sales skills",
      "computer skills",
      "communication",
      "multi-tasking",
      "teamwork",
      "initiative",
      "customer relationship building",
      "respectfulness",
      "optical knowledge",
      "point of sale system",
      "optical measurements",
      "basic math skills",
      "technology adaptation",
      "self-motivation",
      "flexibility",
      "positive attitude"
    ],
    "short_keywords": [
      "adaptation",
      "associate",
      "attitude",
      "basic",
      "building",
      "communication",
      "computer",
      "customer",
      "experience",
      "flexibility",
      "initiative",
      "knowledge",
      "math",
      "measurements",
      "multitasking",
      "of",
      "optical",
      "point",
      "positive",
      "relationship",
      "respectfulness",
      "retail",
      "sale",
      "sales",
      "selfmotivation",
      "service",
      "skills",
      "system",
      "target",
      "teamwork",
      "technology"
    ]
  },
  {
    "job_id": "3904370034",
    "job_title": "Territory Sales Executive - Orlando, FL",
    "category": "SALES",
    "job_description": "PASSIONATE ABOUT PRECISION MEDICINE AND ADVANCING THE HEALTHCARE INDUSTRY?\n\nRECENT ADVANCEMENTS IN UNDERLYING TECHNOLOGY HAVE FINALLY MADE IT POSSIBLE FOR AI TO IMPACT CLINICAL CARE IN A MEANINGFUL WAY. TEMPUS' PROPRIETARY PLATFORM CONNECTS AN ENTIRE ECOSYSTEM OF REAL-WORLD EVIDENCE TO DELIVER REAL-TIME, ACTIONABLE INSIGHTS TO PHYSICIANS, PROVIDING CRITICAL INFORMATION ABOUT THE RIGHT TREATMENTS FOR THE RIGHT PATIENTS, AT THE RIGHT TIME.\n\nRESPONSIBILITIES \n\nDRIVE STRATEGIC BUSINESS EXPANSION/COLLABORATION OPPORTUNITIES WITH THE FOLLOWING:MAJOR U.S. CANCER CENTERS AND CLINICS / TOP 20 LARGEST ONCOLOGY PRACTICES IN THE TERRITORYKEY OPINION LEADERS (KOLS) AND ACADEMIC MEDICAL CENTERS (AMCS) WITHIN THE SPECIFIED TERRITORY.STRUCTURE DETAILED STRATEGIC PLANS FOR GAINING AND RETAINING NEW AND EXISTING CLIENTS.MAXIMIZE CLIENT-BILL CONTRACTING OPPORTUNITIESIMPLEMENT LABORATORY SERVICES AGREEMENTS (LSA’S) WITH BILL ACCOUNT INSTITUTIONSCOLLABORATE AND COORDINATE WITH ALL SALES POSITIONS (VP, SALES, RSD’S, DSM’S, SAM’S, AND GL’S) TO ENSURE SUCCESSFUL ATTAINMENT OF COMPANY GOALS AND OBJECTIVESIDENTIFY AND DEVELOP PARTNERING OPPORTUNITIES BETWEEN PROSPECTIVE ONCOLOGY CLIENTS AND TEMPUS.PROMOTE AND DRIVE COMPLIANCE WITH NEW WEB-BASED MOLECULAR INFORMATION TOOLS FOR ALL CLIENTSCONTINUALLY ANALYZE COMPETITIVE LANDSCAPE AND ENVIRONMENT WITHIN ASSIGNED ACCOUNTS TO DETERMINE TRENDS AND PROVIDE CUSTOMER FEEDBACK TO TEMPUS LEADERSHIPMONITOR PERFORMANCE OF SALES TO ENSURE OBJECTIVES ARE METDEVELOP AND IMPLEMENT A COMPREHENSIVE BUSINESS PLAN FOR THE TERRITORY THAT WILL BE INCLUSIVE OF BUDGETS, TRAVEL, TERRITORY MANAGEMENT, GOAL SETTING, ETC.WORK EFFECTIVELY WITH INDIVIDUALS ACROSS MULTIPLE DEPARTMENTS THROUGHOUT TEMPUSEMBRACE, EMBODY AND REPRESENT THE TEMPUS COMPANY CULTURE AT ALL TIMES TO EXTERNAL AND INTERNAL CONSTITUENTS\nREQUIRED SKILLS\n\nABILITY TO PROVIDE AN INTEGRATED MOLDX/SAAS SOLUTION USING TEMPUS’S SEQUENCING TECHNOLOGY TO PROSPECTS AND CUSTOMERS.ABILITY TO ENGAGE IN A CONSULTATIVE SELLING PROCESS THAT OVERCOMES OBJECTIONS AND INDIFFERENCES WHILE CONNECTING CLIENT NEEDS WITH TEMPUS’ CAPABILITIES.COMFORTABLE SELLING AT THE EXECUTIVE LEVEL (CEO, COO, CFO)KEEN UNDERSTANDING OF THE PAYOR AND REIMBURSEMENT ENVIRONMENT IN THE ONCOLOGY AND DIAGNOSTIC SPACEABILITY TO WORK INDEPENDENTLY, COMMUNICATE PROACTIVELY, MANAGE MULTIPLE PROJECTS AND PRIORITIZE DAILY TASKS WHILE MANAGING CRITICAL DEADLINESSTRONG UNDERSTANDING OF MOLECULAR DIAGNOSTICS FOR ONCOLOGY AND THE EVOLVING COMPETITIVE LANDSCAPEABILITY TO MAINTAIN AN OUTSTANDING LEVEL OF MARKET, CUSTOMER, DISTRIBUTION AND PRODUCT KNOWLEDGE NECESSARY TO ACCOMPLISH SALES AND MARKETING OBJECTIVESEXCELLENT KNOWLEDGE OF ONCOLOGY, HEMATOLOGY, CHEMOTHERAPEUTICS AND TARGETED AGENTSEXCELLENT NEGOTIATION AND CUSTOMER SERVICE SKILLSOUTSTANDING STRATEGIC SALES ACCOUNT PLANNING SKILLSSUPERIOR LISTENING AND PROBLEM SOLVING SKILLSABILITY TO HANDLE SENSITIVE INFORMATION AND MAINTAIN A VERY HIGH LEVEL OF CONFIDENTIALITYDEMONSTRATE CONSISTENT CLOSING ABILITIES THROUGHOUT THE SALES CYCLEPOSSESS A VERY POSITIVE ATTITUDE AND AN UNDERSTANDING OF THE DYNAMICS INVOLVED WITH ORGANIZATIONAL GROWTH AND CHANGEIMPECCABLE ORAL AND VERBAL COMMUNICATION AND PRESENTATION SKILLSMUST BE VERY PROFICIENT WITH ALL MICROSOFT OFFICE PRODUCTS – PARTICULARLY EXCEL AND POWERPOINTEFFECTIVE AND REGULAR UTILIZATION OF SALESFORCE.COMABILITY TO DEVELOP AND UTILIZE CROSS-FUNCTIONAL RELATIONSHIPS TO FACILITATE THE ACCOMPLISHMENT OF WORK GOALS AND OBJECTIVES.ADVANCED PRESENTATION SKILLS AND BUSINESS ACUMEN A NECESSITYABILITY TO WORK EFFECTIVELY WITH MINIMAL DIRECTION FROM, OR INTERFACE WITH, MANAGERPROBLEM SOLVING, DECISION MAKING AND TECHNICAL LEARNINGADVANCED WRITTEN AND ORAL COMMUNICATION SKILLSSTRONG ADMINISTRATIVE SKILLS AND SOPHISTICATION TO MANAGE BUSINESS IN COMPLEX ENVIRONMENTSDEMONSTRATE TEMPUS’ VALUES BY ACTING WITH INTEGRITY, RESPECT AND TRUST FREQUENT TRAVEL ( > 50%) THROUGHOUT THE TERRITORY AS NEEDED\n\nREQUIRED EDUCATION & EXPERIENCE\n\nB.S. IN LIFE SCIENCE, BIOLOGY, BUSINESS OR MARKETING – MBA PREFERRED3+ YEARS OF DIRECT ACCOUNT MANAGEMENT EXPERIENCE IN A MOLECULAR DIAGNOSTIC SETTING WITH A HISTORY OF PROVEN PAST PERFORMANCE THAT HAS MET AND EXCEEDED EXPECTATIONS.CANDIDATE MUST HAVE 5+ YEARS OF EXPERIENCE WORKING WITH MAJOR CANCER CENTERS AND CLINICS, ONCOLOGY GPO’S, LARGE HEALTH SYSTEMS, IHDN’S, AND LARGE ONCOLOGY PRACTICES.DEMONSTRATED MEASURABLE REVENUE GENERATION AT EITHER A DIAGNOSTIC, PHARMACEUTICAL OR RELEVANT BIOTECHNOLOGY COMPANY. \n\nWE ARE AN EQUAL OPPORTUNITY EMPLOYER. WE DO NOT DISCRIMINATE ON THE BASIS OF RACE, RELIGION, COLOR, NATIONAL ORIGIN, GENDER, SEXUAL ORIENTATION, AGE, MARITAL STATUS, VETERAN STATUS, OR DISABILITY STATUS.\n\n",
    "job_skill_set": [
      "Negotiation",
      "Market Analysis",
      "Business Acumen",
      "Project Management",
      "Revenue Generation",
      "Healthcare Knowledge",
      "Communication",
      "Problem Solving",
      "Teamwork",
      "Time Management",
      "Adaptability",
      "Integrity",
      "Customer Service",
      "Listening Skills",
      "Positive Attitude",
      "Confidentiality",
      "Molecular Diagnostics",
      "Consultative Selling",
      "Salesforce.com",
      "Microsoft Office (Excel, PowerPoint)",
      "Strategic Sales Account Planning"
    ],
    "short_keywords": [
      "account",
      "acumen",
      "adaptability",
      "analysis",
      "attitude",
      "business",
      "communication",
      "confidentiality",
      "consultative",
      "customer",
      "diagnostics",
      "excel",
      "executive",
      "fl",
      "generation",
      "healthcare",
      "integrity",
      "knowledge",
      "listening",
      "management",
      "market",
      "microsoft",
      "molecular",
      "negotiation",
      "office",
      "orlando",
      "planning",
      "positive",
      "powerpoint",
      "problem",
      "project",
      "revenue",
      "sales",
      "salesforcecom",
      "selling",
      "service",
      "skills",
      "solving",
      "strategic",
      "teamwork",
      "territory",
      "time"
    ]
  },
  {
    "job_id": "3886215535",
    "job_title": "Sales Associate/ Business Development Representative [73651]",
    "category": "SALES",
    "job_description": "ONWARD SEARCH IS LOOKING FOR A SALES ASSOCIATE/ BUSINESS DEVELOPMENT REPRESENTATIVE FOR OUR CLIENT IN THE REAL ESTATE INDUSTRY. THIS PERSON WILL PLAY A PIVOTAL ROLE SERVING AS A STRATEGIC RESOURCE TO REALTORS HELPING THEM IMPROVE DIGITAL MARKETING AND ADVERTISING INITIATIVES.\n**MUST BE HYBRID IN RICHMOND, VA-- 4 DAYS A WEEK ON SITE** MINIMUM OF THREE YEARS OF EXPERIENCE IN A CORPORATE ENVIRONMENT WITH AT LEAST TWO YEARS IN A B2B SALES ROLE** BASE SALARY: $65-75K (BASED ON EXPERIENCE)OTE: $105-115K DOEGUARANTEE ON FIRST 3 MONTHS!!PAID RELO!\nKEY RESPONSIBILITIES:STRATEGIC PARTNERSHIP: CULTIVATE IMPACTFUL RELATIONSHIPS WITH CLIENTS TO DRIVE ADVERTISING REVENUE VIA A SUBSCRIPTION MODEL.BUSINESS EXPANSION: UTILIZE OUTBOUND CALLS TO GENERATE NEW BUSINESS OPPORTUNITIES AND SUCCESSFULLY CLOSE DEALS.VIRTUAL PRESENTATIONS: SHOWCASE THE VALUE OF OUR CLIENT’S OFFERING THROUGH ENGAGING VIRTUAL PRESENTATIONS.PROACTIVE ACHIEVEMENT: SURPASS MONTHLY SALES GOALS AND PERFORMANCE METRICS.COLLABORATIVE SPIRIT: WORK CLOSELY WITH COLLEAGUES TO COLLECTIVELY DRIVE REVENUECLIENT-CENTRIC FOCUS: DELIVER TOP-NOTCH CUSTOMER SUPPORT, TAILOR SOLUTIONS TO CLIENT NEEDS, AND ENSURE THOSE SOLUTIONS ARE SUCCESSFUL\nESSENTIAL CRITERIA:BACHELOR’S DEGREE MINIMUM OF THREE YEARS OF EXPERIENCE IN A CORPORATE ENVIRONMENT WITH AT LEAST TWO YEARS IN A B2B SALES ROLEPROVEN SUCCESS IN A CORPORATE SALES ENVIRONMENT.DEMONSTRATED ABILITY TO MANAGE AND NURTURE CUSTOMER RELATIONSHIPS.RESULTS-DRIVEN MINDSET WITH ANALYTICAL CAPABILITIES.FLEXIBILITY AND ADAPTABILITY TO NAVIGATE A DYNAMIC, HIGH-GROWTH ENVIRONMENT.",
    "job_skill_set": [
      "B2B Sales",
      "Digital Marketing",
      "Virtual Presentations",
      "Customer Relationship Management (CRM)",
      "Analytical Skills",
      "Outbound Calling",
      "Communication",
      "Collaboration",
      "Customer Support",
      "Results-Driven Mindset",
      "Flexibility",
      "Adaptability",
      "Advertising"
    ],
    "short_keywords": [
      "73651",
      "adaptability",
      "advertising",
      "analytical",
      "associate",
      "b2b",
      "business",
      "calling",
      "collaboration",
      "communication",
      "crm",
      "customer",
      "development",
      "digital",
      "flexibility",
      "management",
      "marketing",
      "mindset",
      "outbound",
      "presentations",
      "relationship",
      "representative",
      "resultsdriven",
      "sales",
      "skills",
      "support",
      "virtual"
    ]
  },
  {
    "job_id": "3905305025",
    "job_title": "Manager, Sales Development",
    "category": "SALES",
    "job_description": "THE SALES TEAM AT LOOP IS THE ENGINE THAT POWERS THE BUSINESS. IN AN EVER EVOLVING MARKET AND COMPANY, THE SALES TEAM SEEKS TO PROVIDE REVENUE AND STABILITY THAT CAN ACCELERATE OUR VISION TO MARKET.\n\nRIGHT AWAY, WE’VE LISTED WHAT WE THINK YOU’LL BE SPENDING YOUR TIME ON. WE’RE GROWING FAST, AND GROWTH MEANS THE CHALLENGES WE’LL WORK ON TOGETHER WILL CHANGE AS WE LEAD LOOP THROUGH NEW AND DIFFERENT PHASES.\n\nTHIS IS AN INDISPENSABLE ROLE WITH US, SO WE’LL BE LOOKING FOR YOU TO HAVE EXAMPLES OF WHEN YOU’VE TACKLED THESE CHALLENGES THROUGHOUT YOUR CAREER. WE’VE LAID OUT THE EXPERIENCE WE THINK IS IMPORTANT TO SET YOU UP FOR SUCCESS IN THIS ROLE. BUT, WE APPRECIATE THAT DIFFERENT HUMANS WILL SOLVE PROBLEMS IN DIFFERENT WAYS, SO WE DON’T EXPECT YOU TO FIT EXACTLY IN A BOX OF REQUIREMENTS.\n\nLOOP HQ IS A STATE-OF-THE-ART OFFICE LOCATED IN COLUMBUS, OHIO, AND MORE THAN HALF OF OUR TEAM WORKS REMOTELY ACROSS THE UNITED STATES AND CANADA (BRITISH COLUMBIA & ONTARIO). YOU CAN CHOOSE TO JOIN US IN THE COLUMBUS OFFICE OR STAY FULLY REMOTE IN THIS ROLE.\n\nWHAT YOU’LL DO:\n\nHIRE, TRAIN, AND DEVELOP SALES DEVELOPMENT REPRESENTATIVES (SDRS)CREATE AN ENERGETIC SALES ENVIRONMENT EVERY DAY FOR YOUR TEAM BY CELEBRATING SUCCESS AND FAILURE, ALWAYS WITH A FOCUS ON WHAT TO LEARN AND HOW TO IMPROVEDEVELOP AND MAINTAIN A DEEP UNDERSTANDING OF OUR MARKET SPACE, ITS PLAYERS, OUR BUYERS AND THEIR PAIN POINTS, OUR PLATFORM AND THE IMPACT IT HAS ON THE MERCHANTS WE SERVEDEVELOP AND EXECUTE ON EFFECTIVE PIPELINE CAMPAIGNS WITH CLOSE ALIGNMENT WITH ACCOUNT EXECUTIVES AND MARKETINGACTIVELY MONITOR SDR AND GROUP DATA AND MEASUREMENTS – BOTH LEADING PERFORMANCE INDICATORS AND RESULTS – TO PROACTIVELY IDENTIFY OPPORTUNITIES FOR INDIVIDUAL SDR AND TEAM IMPROVEMENT AND TO CONTINUOUSLY ACHIEVE TOP PERFORMANCESOLICIT AND PROVIDE TIMELY FEEDBACK TO PEERS AND LEADERSHIP IN SALES, MARKETING, AND PARTNERSEMBRACE AND DRIVE ADOPTION OF LOOP’S STANDARD SELLING FRAMEWORK AND UNDERLYING PROCESSES AND TOOLSETCONDUCT RETROSPECTIVES ON MONTHLY AND QUARTERLY SDR PERFORMANCE, AND PERFORM ROOT CAUSE ANALYSIS WHEN RESULTS ARE INCONSISTENT WITH EXPECTATIONSACT DECISIVELY WITH TRANSPARENCY, AND MAKE DECISIONS THROUGH THE LENS OF LOOP’S CORE VALUES \n\nYOUR EXPERIENCE: \n\n3+ YEARS OF EXPERIENCE IN B2B SAAS SALESIF YOU HAVE EXPERIENCE WORKING WITH SHOPIFY, ECOMMERCE, AND/OR THE POST-PURCHASE ECOSYSTEM, THAT IS A HUGE PLUS FOR US!YOU’VE DIRECTLY MANAGED SALES DEVELOPMENT REPRESENTATIVES AND/OR ACCOUNT EXECUTIVES AND CAN SPEAK TO HOW YOU’VE MADE AN IMPACT ON THEIR CAREERSYOU’VE WORKED AT A STARTUP COMPANY (OR A FEW) AND KNOW WHAT IT MEANS TO MAKE IT THROUGH THE VARIOUS STAGES OF RAPID GROWTHEXPERIENCE RECRUITING, HIRING, AND DEVELOPING HIGH-PERFORMING TEAMS AND LEADING THEM THROUGH CONTINUOUS CHANGE AS THE DAY-TO-DAY OPERATING ENVIRONMENT EVOLVES IN ORDER TO SCALEHAVE AN ATTITUDE THAT TRULY NOTHING IS “NOT YOUR JOB.” YOU SHOULD FEEL EXCITED BY THE NEED TO ACT LIKE AN OWNER TO SOLVE PROBLEMS AND DIG IN, WHEREVER NEEDEDYOU HAVE A COLLABORATIVE WORK STYLE AND HAVE CREATED EXCEPTIONAL PARTNERSHIPS WITH YOUR PEERS IN SALES AND MARKETING AS WELL AS WITH OTHER INTERNAL AND EXTERNAL STAKEHOLDERS, AND QUICKLY BECAME ONE OF THEIR FAVORITE PEOPLE TO WORK WITH\n\n$75,400 - $113,000 A YEAR\n\nWE KNOW THAT MAKING DECISIONS ABOUT YOUR CAREER AND COMPENSATION IS A HUGE DEAL. BECAUSE OF THAT, WE’RE INCREDIBLY THOUGHTFUL ABOUT OUR COMPENSATION STRATEGY. WE WANT YOU TO FEEL SAFE AND EXCITED, BUT ALSO COMFORTABLE WITH THE COMPENSATION PACKAGE OF A STARTUP. WE’VE OUTLINED SOME IMPORTANT INFORMATION FOR YOU HERE, BUT PLEASE KNOW THERE’S A LOT MORE TO COMPENSATION THAN WE CAN COVER IN THIS JOB POSTING.\n\nTHE POSTED SALARY RANGE IS THE BASE SALARY FOR THIS OPPORTUNITY. THE SALARY RANGE IS SUBJECT TO CHANGE, AND MAY BE ADJUSTED IN THE FUTURE.\n\nTHE ACTUAL ANNUAL SALARY PAID FOR THIS POSITION WILL BE BASED ON SEVERAL FACTORS, INCLUDING, BUT NOT LIMITED TO: YOUR PRIOR EXPERIENCE AND SKILLS RELATED TO THE POSITION, GEOGRAPHIC LOCATION, COMPANY NEEDS, CURRENT MARKET DEMANDS, AND YOUR TOTAL COMPENSATION GOALS.\n\nTHIS POSITION IS ALSO ELIGIBLE FOR AN ANNUAL COMMISSION EXPECTED TO BE IN THE $40,600 TO $60,900 RANGE.\n\nGREAT HUMANS DESERVE GREAT BENEFITS! AT LOOP, YOU’LL BE ELIGIBLE FOR BENEFITS SUCH AS: MEDICAL, DENTAL, AND VISION INSURANCE, FLEXIBLE PTO, COMPANY HOLIDAYS, SICK & SAFE LEAVE, PARENTAL LEAVE, 401K, MONTHLY WELLNESS BENEFIT, HOME WORKSTATION BENEFIT, PHONE/INTERNET BENEFIT, AND EQUITY.\n\nIN A PERFECT WORLD, LOOP WOULDN'T EXIST. IF WE HAD OUR WAY, WE'D LIVE IN A WORLD WHERE WE'RE MINDFUL ABOUT HOW WE CONSUME, WE LOVE EVERY PRODUCT WE OWN, AND WE SHAREVALUES WITH THE BRANDS WHO CREATE THEM. IN REALITY, COMMERCE ISN'T PERFECT AND OFTEN BREAKS. LOOP CREATES SECONDCHANCES.\n\nWE'RE STARTING BY REVOLUTIONIZING THE POST-PURCHASE EXPERIENCE. WE'VE TAKEN ONE OF THE MOST FRAGILE COMMERCE INTERACTIONS - RETURNS - AND TURNED IT INTO SOMETHING CONSUMERS ACTUALLY LOVE, AND THAT DEEPENS OUR CONNECTION TO BRANDS AND PRODUCTS.\n\nWE TAKE CONNECTION SERIOUSLY ON THE INSIDE, TOO. WE'RE BUILDING A WORK EXPERIENCE THAT ALLOWS YOU TO BE A HUMAN FIRST AND PRIORITIZES EMPATHY AND WELLBEING. WE VIEW LOOP AS A SPECIAL PLACE IN YOUR CAREER TO SHAPE THE FUTURE OF AN INDUSTRY AND BECOME A BETTER PERSON WHILE DOING IT. YOU CAN GROW FASTER HERE IN A SHORTER AMOUNT OF TIME - WE'LL GIVE YOU SPACE AND TRUST YOU TO FILL IT.\n\nLEARN MORE ABOUT US HERE: HTTPS://LOOPRETURNS.COM/CAREERS.\n\nYOU CAN REVIEW OUR PRIVACY NOTICE HERE.\n\n",
    "job_skill_set": [
      "Team Leadership",
      "Collaboration",
      "Problem Solving",
      "Adaptability",
      "Communication",
      "Decision Making",
      "Motivation",
      "B2B SaaS Sales",
      "Sales Development Management",
      "Pipeline Campaign Development",
      "Data Analysis",
      "Recruiting and Hiring",
      "Ecommerce Knowledge",
      "Sales Framework Adoption",
      "Root Cause Analysis",
      "Performance Measurement",
      "Empathy",
      "Feedback Provision"
    ],
    "short_keywords": [
      "adaptability",
      "adoption",
      "analysis",
      "and",
      "b2b",
      "campaign",
      "cause",
      "collaboration",
      "communication",
      "data",
      "decision",
      "development",
      "ecommerce",
      "empathy",
      "feedback",
      "framework",
      "hiring",
      "knowledge",
      "leadership",
      "making",
      "management",
      "manager",
      "measurement",
      "motivation",
      "performance",
      "pipeline",
      "problem",
      "provision",
      "recruiting",
      "root",
      "saas",
      "sales",
      "solving",
      "team"
    ]
  },
  {
    "job_id": "3887947315",
    "job_title": "Software Sales Engineer",
    "category": "SALES",
    "job_description": "JOB TITLE:\n\nSOFTWARE SALES ENGINEER\n\nROLE OVERVIEW:\n\nTRELLIX IS HIRING A GHE SOFTWARE SALES ENGINEER.\n\nABOUT THE COMPANY:\n\nTRELLIX IS A GLOBAL COMPANY REDEFINING THE FUTURE OF CYBERSECURITY. THE COMPANY’S OPEN AND NATIVE EXTENDED DETECTION AND RESPONSE (XDR) PLATFORM HELPS ORGANIZATIONS CONFRONTED BY TODAY’S MOST ADVANCED THREATS GAIN CONFIDENCE IN THE PROTECTION AND RESILIENCE OF THEIR OPERATIONS. TRELLIX’S SECURITY EXPERTS, ALONG WITH AN EXTENSIVE PARTNER ECOSYSTEM, ACCELERATE TECHNOLOGY INNOVATION THROUGH MACHINE LEARNING AND AUTOMATION TO EMPOWER OVER 40,000 BUSINESS AND GOVERNMENT CUSTOMERS. MORE AT HTTPS://TRELLIX.COM.\n\nABOUT YOU:\n\nYOU WILL LEAD AND ENGAGE THROUGHOUT THE SALES LIFECYCLE FROM DISCOVERING THE CUSTOMER’S NEEDS, WRITING PROPOSALS, SOLUTION DEMONSTRATION, ARCHITECTING SOLUTIONS, BUILDING THE CUSTOMER'S TRUST AND LEADING THE PROOF OF CONCEPT TO GAIN THE TECHNICAL WIN.\n\nYOUR SALES FOCUS WILL BE ALIGNED TO GOVERNMENT, HEALTHCARE AND EDUCATION CUSTOMERS. YOU WILL ALSO BE REQUIRED TO WORK IN COLLABORATION WITH YOUR DIRECT SE MANAGER AND REGIONAL SALES DIRECTORS TO CONTRIBUTE TO SALES STRATEGY AND TEAM INITIATIVES THAT CREATE A PIPELINE, CUSTOMER EXCELLENCE AND BEST PRACTICES ON TECHNICAL WINS.\n\nABOUT THE ROLE:\n\nOWN THE SOLUTION SALES ACTIVITIES WITHIN THE SALES PROCESS TO GAIN THE TECHNICAL WIN AND THE CUSTOMERS’ TRUST. PARTICIPATE IN SOLUTION LED SALES CALLS AND PROSPECT VISITS, QUALIFYING THE CUSTOMER’S REQUIREMENTS. GATHER REQUIREMENTS, DEVELOP USE CASES, AND FULLY UNDERSTAND THE CLIENT'S BUSINESS NEEDS AND CONSTRAINTS. PROVIDE EXEMPLARY TECHNICAL EXPERTISE ON CUSTOMER PRODUCT AND SOLUTION DEMONSTRATIONS. CREATE UNSOLICITED SOLUTION PROPOSALS AND ENSURE IT MEETS OR EXCEEDS THE CUSTOMER’S REQUIREMENTS AND IS FIT FOR THE INTENDED PURPOSE. OWNERSHIP OF THE TECHNICAL OR SOLUTION RESPONSE TO RFIS/RFPS AND ORCHESTRATION OF THE VIRTUAL TEAMS TO HELP DELIVER A COMPREHENSIVE CONSULTATIVE RESPONSE. PRESENT A SOLUTION PROPOSAL TO THE CUSTOMER, DEMONSTRATE HOW WE SOLVE THE CUSTOMER’S REQUIREMENTS AND HOW THIS ALIGNS WITH THE CUSTOMERS’ OUTCOMES AND DIFFERENTIATES FROM THE COMPETITION. WHEN REQUIRED, LEAD THE PROOF OF VALUE (POV) FROM ENGAGEMENT, OWNERSHIP OF ALL ACTIVITIES AND ORCHESTRATION, THROUGH TO COMPLETION. PLAY A PRO-ACTIVE \"TECHNICAL ACCOUNT MANAGEMENT\" ROLE WITHIN YOUR TARGET ACCOUNTS INCLUDING BUILDING A TRUSTED RELATIONSHIP, MONITORING/MANAGING CUSTOMER ISSUES IN PARTNERSHIP WITH SUPPORT, EXPAND THE EXISTING FOOTPRINT AND DRIVE COMPETITIVE DISPLACEMENTS. A MENTOR FOR SES AND A TEAM PLAYER, SHARING BEST PRACTICES, PROVIDING FEEDBACK TO PRODUCT. TECHNICAL ACCOUNT LEAD FOR CUSTOMER EXECUTIVE BRIEFING EVENTS. SUPPORT CUSTOMER BETA ACTIVITIES AND EARLY ADOPTER PROGRAMS. PARTICIPATE IN THE GLOBAL PRESALES ENABLEMENT PROGRAM, THROUGH THE DELIVERY OF FORMAL CLASSROOM TRAINING. ADHERE TO CORPORATE GUIDELINES AND COMPLIANCE. \n\nABOUT YOU: \n\nEXCELLENT COMMUNICATION SKILLS AT TECHNICAL AND BUSINESS LEVEL. 3+ YEARS OF PROVEN CYBERSECURITY EXPERIENCE. TECHNICAL SPECIALIST IN ONE OF THESE TECHNOLOGIES: TRELLIX SOLUTIONS & ARCHITECTURES; CLOUD AND VIRTUALIZATION SECURITY; DATA PROTECTION AND PRIVACY; NETWORK, WEB PROXY AND SDWAN; WORKLOAD AND CONTAINER SECURITY . YOUR EXPERTISE IS VALIDATED WITH INDUSTRY RELEVANT CERTIFICATION SUCH AS AWS, AZURE, GCP, CISSP, CEH YOU LOVE PRESENTING AND SHOWCASING INNOVATIVE TECHNOLOGIES, SOLUTIONS AND APPROACHES WITH THE MARKET.  YOU WILL INSTINCTIVELY UNDERSTAND CUSTOMER CONTEXT AND CAPABILITY, AND BE ABLE TO ADAPT TO USE CASES AND IMPROVEMENT OPPORTUNITIES RELEVANT TO OUR CUSTOMERS. SOLUTIONS NEED TO BE PROPERLY SPECIFIED AND SIZED – YOU WILL BE ATTENTIVE TO TECHNICAL DETAIL TO ENSURE CUSTOMER BILLS OF MATERIAL MEET THEIR USE CASE REQUIREMENTS. YOU ARE AMBITIOUS AND HAVE APPETITE TO LEARN. THIS ROLE IS AN EXCELLENT OPPORTUNITY TO EXPAND YOUR SKILLSET AND EXPOSURE TO CYBERSECURITY AT SCALE. \n\nTHIS POSITION IS PAID (IN PART) ON A COMMISSION BASIS. THE BASE PAY RANGE IS $110,250 - $204,750. THE ON TARGET EARNINGS (OTE) RANGE (BASE PAY PLUS ON TARGET COMMISSION) IS $157,503 – $292,505. ACTUAL BASE PAY WITHIN THE BASE PAY RANGE AND ACTUAL OTE WITHIN THE OTE RANGE WILL DEPEND ON VARYING CIRCUMSTANCES, INCLUDING THE WORK LOCATION, INDIVIDUAL QUALIFICATIONS, COMPANY BUDGET AND OTHER OPERATIONAL BUSINESS NEEDS. COMPENSATION MAY ALSO INCLUDE LONG-TERM INCENTIVES, SUBJECT TO VARIOUS METRICS AND COMPANY POLICY.\n\nCOMPANY BENEFITS AND PERKS:\n\nWE WORK HARD TO EMBRACE DIVERSITY AND INCLUSION AND ENCOURAGE EVERYONE TO BRING THEIR AUTHENTIC SELVES TO WORK EVERY DAY. WE OFFER A VARIETY OF SOCIAL PROGRAMS, FLEXIBLE WORK HOURS AND FAMILY-FRIENDLY BENEFITS TO ALL OF OUR EMPLOYEES.\n\nRETIREMENT PLANSMEDICAL, DENTAL AND VISION COVERAGEPAID TIME OFFPAID PARENTAL LEAVESUPPORT FOR COMMUNITY INVOLVEMENT\n\nWE'RE SERIOUS ABOUT OUR COMMITMENT TO DIVERSITY WHICH IS WHY WE PROHIBIT DISCRIMINATION BASED ON RACE, COLOR, RELIGION, GENDER, NATIONAL ORIGIN, AGE, DISABILITY, VETERAN STATUS, MARITAL STATUS, PREGNANCY, GENDER EXPRESSION OR IDENTITY, SEXUAL ORIENTATION OR ANY OTHER LEGALLY PROTECTED STATUS.",
    "job_skill_set": [
      "customer requirements gathering",
      "solution demonstration",
      "communication",
      "customer relationship management",
      "presentation skills",
      "cybersecurity",
      "solution architecture",
      "cloud security",
      "data protection",
      "network security",
      "virtualization security",
      "workload security",
      "container security",
      "AWS certification",
      "Azure certification",
      "GCP certification",
      "CISSP certification",
      "CEH certification",
      "technical proposal writing",
      "proof of concept",
      "technical account management",
      "teamwork",
      "problem solving",
      "adaptability",
      "mentoring",
      "collaboration",
      "attention to detail",
      "ambition"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "ambition",
      "architecture",
      "attention",
      "aws",
      "azure",
      "ceh",
      "certification",
      "cissp",
      "cloud",
      "collaboration",
      "communication",
      "concept",
      "container",
      "customer",
      "cybersecurity",
      "data",
      "demonstration",
      "detail",
      "engineer",
      "gathering",
      "gcp",
      "management",
      "mentoring",
      "network",
      "of",
      "presentation",
      "problem",
      "proof",
      "proposal",
      "protection",
      "relationship",
      "requirements",
      "sales",
      "security",
      "skills",
      "software",
      "solution",
      "solving",
      "teamwork",
      "technical",
      "to",
      "virtualization",
      "workload",
      "writing"
    ]
  },
  {
    "job_id": "3904096330",
    "job_title": "Salesforce Vlocity/OmniStudio Developer",
    "category": "SALES",
    "job_description": "JOB TITLE : SALESFORCE VLOCITY/OMNISTUDIO DEVELOPERLOCATION : NEWARK, NJ POSITION TYPE : CONTRACT \nJOB DESCRIPTION: EXPERIENCE/GOOD TO HAVE: MINIMUM 4+ YEAR OF HANDS ON EXPERIENCE AS CORE DEVELOPER.VLOCITY/OMNISTUDIO DEVELOPER/CONSULTANT CERTIFICATE WILL PREFERRED.EXPERIENCE WORKING WITHIN THE INSURANCE DOMAIN USING VLOCITY/OMNISTUDIO WILL BE AN ADDED ADVANTAGE.",
    "job_skill_set": [
      "Problem Solving",
      "Teamwork",
      "Communication",
      "Salesforce Vlocity",
      "OmniStudio",
      "Insurance Domain Knowledge",
      "Core Development",
      "Consultant Certification"
    ],
    "short_keywords": [
      "certification",
      "communication",
      "consultant",
      "core",
      "developer",
      "development",
      "domain",
      "insurance",
      "knowledge",
      "omnistudio",
      "problem",
      "sales",
      "salesforce",
      "solving",
      "teamwork",
      "vlocity",
      "vlocityomnistudio"
    ]
  },
  {
    "job_id": "3895812688",
    "job_title": "Senior Salesforce Developer",
    "category": "SALES",
    "job_description": "DESCRIPTION\n\nEVERY DAY, WE WORK TOGETHER FOR WHAT MATTERS – BOLD, SWIFT, AND EQUITABLE CLIMATE ACTION.\n\nABOUT THE ROLE\n\n3DEGREES IS A CERTIFIED B CORP COMMITTED TO LEADING TRANSFORMATIONAL CHANGE IN HOW COMPANIES ENGAGE WITH CLIMATE ISSUES. TECHNOLOGY IS FUNDAMENTAL TO ACHIEVING OUR MISSION, AND THAT'S WHERE YOU COME IN. AS THE SENIOR SALESFORCE DEVELOPER AT 3DEGREES, YOU'LL BE MORE THAN JUST AN IT LEADER, YOU'LL BE A DIGITAL VISIONARY. YOUR EXPERTISE WILL SUPPORT OUR TEAMS TO EMPOWER COMPANIES AROUND THE WORLD TO REDUCE THEIR CARBON FOOTPRINT, AIDING THE QUEST FOR A SUSTAINABLE FUTURE. YOU WILL HELP INTEGRATE OUR TECHNOLOGY INFRASTRUCTURE, PIONEERING SOLUTIONS THAT IMPROVE EFFICIENCY AND DRIVE INNOVATION.\n\nTHIS IS A FULL-TIME EXEMPT POSITION AND WILL REPORT TO THE SYSTEMS ARCHITECT. THIS POSITION IS OPEN TO CANDIDATES IDEALLY BASED WITHIN A COMMUTABLE DISTANCE OF OUR OFFICES INCLUDING PORTLAND, ME, NEW YORK, NY , SAN FRANCISCO, CALIFORNIA OR PORTLAND, OR; WHERE YOU'LL ENJOY A FLEXIBLE HYBRID WORKING ENVIRONMENT. EXCEPTIONAL CANDIDATES BASED OUTSIDE OF THE LISTED LOCATIONS MAY ALSO BE CONSIDERED. IN ADDITION, YOU AGREE TO TRAVEL, PERIODICALLY TO 3DEGREE'S OFFICES FOR TRAINING OR TEAM COLLABORATION AND TO CONFERENCES AND CUSTOMERS AS REQUIRED. FREQUENCY AND CADENCE IS TEAM DEPENDENT, BUT ON AVERAGE IS 1-6 TIMES ANNUALLY.\n\nWHAT YOU’LL DO\n\nYOUR RESPONSIBILITIES INCLUDE DEVELOPING AND MAINTAINING SALESFORCE CUSTOMIZATIONS, CONFIGURATIONS, AND INTEGRATIONS TO SUPPORT SEVERAL BUSINESS PROCESSES AND OBJECTIVES. COLLABORATING CLOSELY WITH THE SALES, MARKETING, AND OPERATIONS TEAMS, YOU'LL IDENTIFY OPPORTUNITIES FOR PROCESS IMPROVEMENTS AND IMPLEMENT SOLUTIONS TO OPTIMIZE BUSINESS PERFORMANCE. ADDITIONALLY, YOU WILL WORK WITH IT TEAMS TO ENSURE SMOOTH INTEGRATION BETWEEN SALESFORCE AND OTHER BUSINESS SYSTEMS.\n\nLEAD SALESFORCE DEVELOPMENT PROJECTS, ENSURING ALIGNMENT WITH BUSINESS OBJECTIVES CREATE AND MAINTAIN CUSTOM SALESFORCE SOLUTIONS TO BOOST BUSINESS TEAMS’ PERFORMANCE INTEGRATE SALESFORCE WITH VARIOUS BUSINESS SYSTEMS, ENHANCING DATA FLOW MANAGE SALESFORCE SECURITY SETTINGS, WORKFLOWS, AND USER ACCESS CONTROLS DEVELOP AUTOMATION IN SALESFORCE FOR PROCESS EFFICIENCY LIAISE WITH BUSINESS TEAMS TO TRANSLATE NEEDS INTO SALESFORCE FUNCTIONALITIES BUILD CUSTOM REPORTS AND DASHBOARDS FOR SALES INSIGHTS CONDUCT SALESFORCE END-USER TRAINING AND DEVELOP EDUCATIONAL RESOURCES KEEP ABREAST OF SALESFORCE UPDATES AND EMERGING TECHNOLOGIES TROUBLESHOOT SALESFORCE INTEGRATION ISSUES IN COLLABORATION WITH INTEGRATION TEAMS PERFORM REGULAR SYSTEM AUDITS FOR DATA ACCURACY AND EFFICIENCY COLLABORATE WITH OTHER IT RESOURCES TO ALIGN SALESFORCE WITH BUSINESS TECHNOLOGY STRATEGIES IDENTIFY AND IMPLEMENT PROCESS IMPROVEMENTS IN SALESFORCE WORK WITH IT ARCHITECTS, INTEGRATION DEVELOPERS, AND OTHER PLATFORM DEVELOPERS TO DESIGN AND IMPLEMENT COMPLEX CROSS-PLATFORM SOLUTIONS \n\nABOUT YOU\n\nAS A SENIOR SALESFORCE DEVELOPER, YOU WILL BE CRITICAL IN ENHANCING OUR BUSINESS TEAMS’ EFFECTIVENESS THROUGH THE SALESFORCE PLATFORM. YOUR EXPERTISE IN SALESFORCE DEVELOPMENT, COMBINED WITH A STRONG UNDERSTANDING OF BUSINESS OPERATIONS AND PLATFORM INTEGRATIONS, WILL BE PIVOTAL IN DRIVING OUR STRATEGY AND SUPPORTING OUR BROADER ORGANIZATIONAL GOALS. WE BELIEVE AN INDIVIDUAL WITH THE FOLLOWING SKILLS, EXPERIENCE, AND SUBJECT MATTER EXPERTISE WOULD BE WELL-SUITED TO BE SUCCESSFUL IN THIS ROLE:\n\n5+ YEARS OF EXPERIENCE IN SALESFORCE DEVELOPMENT, WITH A FOCUS ON BOTH ADMIN AND DEVELOPER ROLES B.S. DEGREE IN COMPUTER SCIENCE, INFORMATION SYSTEMS, OR EQUIVALENT PROFESSIONAL EXPERIENCE STRONG EXPERTISE IN SALESFORCE, INCLUDING VARIOUS SALESFORCE CLOUDS (SALES, SERVICE, MARKETING, ETC.) AND SALESFORCE DEVELOPMENT ENVIRONMENTS PROFICIENCY IN APEX, VISUALFORCE, AND SALESFORCE LIGHTNING MUST HAVE EXTENSIVE EXPERIENCE WITH SALESFORCE FLOW, TRIGGERS, VALIDATION RULES, IN-DEPTH KNOWLEDGE OF AND EXPERIENCE WITH RESTFUL AND SOAP API PROTOCOLS UNDERSTANDING OF API SECURITY STANDARDS AND PROTOCOLS (OAUTH, JWT, ETC.) SKILLED IN MULTIPLE PROGRAMMING LANGUAGES RELEVANT TO SALESFORCE (E.G., JAVA, JAVASCRIPT) FAMILIARITY WITH BOTH SQL/SOQL AND NOSQL DATABASES AS WELL AS JSON FORMAT EXPERTISE IN DATA MAPPING AND TRANSFORMATION TECHNIQUES PROFICIENCY IN PROCESS MAPPING AND DOCUMENTATION TOOLS LIKE LUCID CHART EXPERIENCE WITH CI/CD PRACTICES IN SALESFORCE, INCLUDING THE USE OF DEVELOPMENT ORGS PROFICIENCY IN VERSION CONTROL SYSTEMS LIKE GIT/GITHUB UNDERSTANDING OF EVENT-DRIVEN AND MESSAGE-DRIVEN ARCHITECTURES IN SALESFORCE KNOWLEDGE OF DATA PRIVACY STANDARDS AND REGULATIONS APPLICABLE TO SALESFORCE EXCELLENT COMMUNICATION SKILLS FOR EFFECTIVE COLLABORATION WITH TECHNICAL AND NON-TECHNICAL STAKEHOLDERS STRONG PROBLEM-SOLVING SKILLS AND THE ABILITY TO WORK UNDER PRESSURE GOOD DOCUMENTATION PRACTICES WITHIN SALESFORCE EXPERIENCE WITH AGILE DEVELOPMENT FRAMEWORKS AND METHODOLOGIES PREVIOUS EXPERIENCE AS A BUSINESS ANALYST PREFERRED COMBINATION OF AT LEAST ONE SALESFORCE DEVELOPER AND ONE OTHER ADVANCED CERTIFICATION (E.G., SALESFORCE CERTIFIED PLATFORM DEVELOPER I/II, SALESFORCE CERTIFIED APP BUILDER, ADVANCED SALESFORCE ADMINISTRATOR, APPLICATION/SYSTEM ARCHITECT, ETC.) \n\nHOW WE DEFINE SUCCESS\n\nWITHIN 30 DAYS,\n\nGAIN AN UNDERSTANDING OF 3DEGREES IT INFRASTRUCTURE, SALESFORCE INTEGRATION NEEDS, CURRENT IMPLEMENTATIONS, AND THE PORTFOLIO OF ONGOING SALESFORCE DEVELOPMENT PROJECTS BEGIN CONTRIBUTING TO ONGOING SALESFORCE PROJECTS, SUGGESTING IMPROVEMENTS, AND GRASPING BUSINESS REQUIREMENTS \n\nWITHIN 90 DAYS,\n\nASSUME RESPONSIBILITY FOR MANAGING AND ADMINISTERING OUR SALESFORCE PLATFORM LEAD NEW SALESFORCE PROJECTS, INITIATING THE DELIVERY OF SOLUTIONS \n\nWITHIN 6 MONTHS,\n\nESTABLISH YOURSELF INTERNALLY AS THE KEY RESOURCE FOR SALESFORCE IMPLEMENTATIONS, SIGNIFICANTLY ENHANCING OUR SALESFORCE CAPABILITIES SUCCESSFULLY LEAD AND COMPLETE A SALESFORCE PROJECT, DEMONSTRATING ENHANCED BUSINESS PROCESSES/OPERATIONS AND PROCESS EFFICIENCY \n\nCOMPENSATION & BENEFITS\n\nCOMPENSATION: THE MINIMUM AND MAXIMUM SALARY FOR THIS POSITION IS $105,000 TO $151,000 IN THE US. THE LEVEL OF PAY WITHIN THE RANGE WILL DEPEND ON A VARIETY OF JOB-RELATED FACTORS THAT MAY INCLUDE LOCATION, ROLE REQUIREMENTS, RELEVANT PRIOR EXPERIENCE AND/OR EDUCATION, OR PARTICULAR SKILLS AND EXPERTISE BENEFITS: THIS POSITION IS ELIGIBLE FOR A BENEFITS PACKAGE THAT INCLUDES MEDICAL, DENTAL, VISION, 401K, FLEXIBLE PAID TIME OFF, AND MORE. ADDITIONAL INFORMATION REGARDING THE BENEFITS AVAILABLE FOR THIS POSITION CAN BE FOUND BY CLICKING HERE SUPPLEMENTAL PAY: THIS POSITION IS ELIGIBLE FOR DISCRETIONARY BONUS PROGRAMS INCLUDING THE COMPANY’S PROFIT-SHARING PROGRAM AND AN ANNUAL PERFORMANCE BONUS BASED ON PERSONAL, DEPARTMENT, AND COMPANY GOALS THIS COMPENSATION AND BENEFITS INFORMATION IS BASED ON 3DEGREES’ GOOD FAITH ESTIMATE AS OF THE DATE OF PUBLICATION AND MAY BE MODIFIED IN THE FUTURE \n\nOUR COMMITMENT TO DIVERSITY, INCLUSION, AND EQUITY\n\n3DEGREES IS AN EQUAL-OPPORTUNITY EMPLOYER. WE ARE COMMITTED TO CREATING AN INCLUSIVE ENVIRONMENT WHERE DIFFERENT PERSPECTIVES CONTRIBUTE TO BETTER SOLUTIONS. 3DEGREES WELCOMES PEOPLE REGARDLESS OF RACE, COLOR, RELIGION, NATIONAL ORIGIN, GENDER, GENDER IDENTITY OR GENDER EXPRESSION, AGE, SEX, PREGNANCY, MARITAL STATUS, ANCESTRY, DISABILITY, MILITARY OR VETERAN STATUS, SEXUAL ORIENTATION, GENETIC INFORMATION, OR ANY OTHER CATEGORY PROTECTED BY LAW.",
    "job_skill_set": [
      "Communication",
      "Problem Solving",
      "Collaboration",
      "Adaptability",
      "Leadership",
      "Training",
      "Analytical Thinking",
      "Salesforce Development",
      "Apex",
      "Visualforce",
      "Salesforce Lightning",
      "Salesforce Flow",
      "RESTful API",
      "SOAP API",
      "Java",
      "JavaScript",
      "SQL",
      "SOQL",
      "NoSQL",
      "JSON",
      "Data Mapping",
      "CI/CD Practices",
      "Git/GitHub",
      "Agile Development",
      "Salesforce Security Settings",
      "Salesforce Customizations",
      "Salesforce Integrations",
      "Salesforce Reports",
      "Salesforce Dashboards",
      "Documentation"
    ],
    "short_keywords": [
      "adaptability",
      "agile",
      "analytical",
      "apex",
      "api",
      "cicd",
      "collaboration",
      "communication",
      "customizations",
      "dashboards",
      "data",
      "developer",
      "development",
      "documentation",
      "flow",
      "gitgithub",
      "integrations",
      "java",
      "javascript",
      "json",
      "leadership",
      "lightning",
      "mapping",
      "nosql",
      "practices",
      "problem",
      "reports",
      "restful",
      "sales",
      "salesforce",
      "security",
      "senior",
      "settings",
      "soap",
      "solving",
      "soql",
      "sql",
      "thinking",
      "training",
      "visualforce"
    ]
  },
  {
    "job_id": "3900957818",
    "job_title": "Sales & Customer Service",
    "category": "SALES",
    "job_description": "SOLARCRAFT IS SEEKING A SMART SALES & CUSTOMER SERVICE ASSISTANT. FULL TRAINING IS PROVIDED TO MAKE THE RIGHT CANDIDATE AN EXPERT ON SOLAR, BATTERY ENERGY STORAGE AND THE CLEAN ENERGY INDUSTRY. \nRECENT AWARDS INCLUDE: TOP SOLAR INSTALLER (MARIN INDEPENDENT JOURNAL), BEST SOLAR & BATTERY INSTALLER (MARIN MAGAZINE) AND FAVORITE LOCAL BUSINESS (NEXTDOOR).  IN THIS ROLE, YOU WILL WORK ACROSS MULTIPLE DEPARTMENTS TO HELP SOLARCRAFT ACHIEVE TEAM SALES GOALS AND DELIVER A WONDERFUL CLIENT EXPERIENCE. RESPONSIBILITIES INCLUDE:\nSALES INTAKE / CUSTOMER EXPERIENCE – RESPOND PROMPTLY AND PROFESSIONALLY TO EMAILS AND CALLS FROM PROSPECTIVE CLIENTS. THIS POSITION IS THE INITIAL CONTACT FOR INCOMING SALES CALLS, SO SPEAKING CLEARLY IN A FRIENDLY AND PROFESSIONAL MANNER IS CRITICAL, THIS ROLE WILL –· HELP TO QUALIFY SALES OPPORTUNITIES AND GATHER INFORMATION FROM HOME AND BUSINESS OWNERS· SCHEDULE APPOINTMENTS WITH OUR TEAM OF ENERGY CONSULTANTS· COLLECT ENERGY USAGE INFORMATION FROM THE CLIENTS AND ASSIST WITH DATA COLLECTION METHODS. · ANSWER OUR MAIN LINE AND DIRECT CALLS, AND OCCASIONALLY BACK-UP FOR INCOMING SERVICE CALLS.· SEND OUT REWARDS AND THANK MEMBERS OF THE COMMUNITY THAT REFER BUSINESS TO SOLARCRAFT.· CREATION AND DELIVERY OF OWNERS’ MANUALS TO CLIENTS.\nSALES SUPPORT – ASSIST ENERGY CONSULTANTS (OUR SALES REPS), MARKETING MANAGERS AND COMPANY LEADERS WITH SALES AND MARKETING ACTIVITIES.\nADMINISTRATIVE SUPPORT - ENTER LEADS AND INTAKE INFO INTO CRM (SOLARNEXUS) AND OTHER INDUSTRY-SPECIFIC SOFTWARE PROGRAMS, AND CREATE DROPBOX FOLDERS TO STORE AND ORGANIZE PROJECT INFO. CLIENT CONTACT AND SYSTEM MONITORING– PERFORM SOLAR PRODUCTION TRACKING AND REPORTING ON PROJECTS AFTER SOLAR SYSTEMS ARE INSTALLED AT ESTABLISHED MILESTONES.\n QUALIFICATIONS:· EXTREMELY ORGANIZED AND DETAIL ORIENTED· 6 MONTHS+ CUSTOMER SERVICE EXPERIENCE WITH POSITIVE ATTITUDE· CONSISTENTLY WORKS IN A PROFESSIONAL AND PRESENTABLE MANNER APPROPRIATE WITH ROLE· AA DEGREE OR HIGHER· IT/DIGITAL PROFICIENCY: MUST BE ABLE TO USE MICROSOFT OFFICE, INCLUDING: WORD, EXCEL, AND OUTLOOK, AND OTHER SALES ONLINE TOOLS.· BILINGUAL PREFERRED BUT NOT REQUIRED. WHY PEOPLE LOVE WORKING AT SOLARCRAFTCOMPETITIVE PAY, PAID TIME OFF + 9 COMPANY-PAID HOLIDAYSHEALTH INSURANCE WITH COMPANY SUBSIDY FOR YOURSELF AND DEPENDENTSEMPLOYEE STOCK OWNERSHIP PLAN AND 401(K) MATCHINGON-THE-JOB TRAINING AND EDUCATION IN SOLAR ENERGYOPPORTUNITIES FOR ADVANCEMENT WITHIN A RAPIDLY GROWING BUSINESS AND INDUSTRYHOLIDAY PARTIES AND TEAM BUILDING EVENTS",
    "job_skill_set": [
      "sales support",
      "CRM software",
      "data collection",
      "communication",
      "organization",
      "teamwork",
      "professionalism",
      "problem solving",
      "positive attitude",
      "customer service",
      "Microsoft Office",
      "solar energy knowledge",
      "bilingual"
    ],
    "short_keywords": [
      "attitude",
      "bilingual",
      "collection",
      "communication",
      "crm",
      "customer",
      "data",
      "energy",
      "knowledge",
      "microsoft",
      "office",
      "organization",
      "positive",
      "problem",
      "professionalism",
      "sales",
      "service",
      "software",
      "solar",
      "solving",
      "support",
      "teamwork"
    ]
  },
  {
    "job_id": "3902922510",
    "job_title": "Inside Sales Representative (No cold calls)",
    "category": "SALES",
    "job_description": "**THIS IS A GREAT OPPORTUNITY FOR RECENT COLLEGE GRADUATES LOOKING TO KICK OFF THEIR CAREER**\nAT LEGAL & GENERAL AMERICA, WE AIM TO MAKE A POSITIVE DIFFERENCE IN THE LIVES OF OUR CUSTOMERS, PARTNERS, COLLEAGUES, AND THE COMMUNITIES IN WHICH THEY LIVE. AS A RECOGNIZED MARKET LEADER OF TERM LIFE INSURANCE, WE’RE WORKING TO TRANSFORM OUR BUSINESS THROUGH INNOVATION AND TECHNOLOGY TO PROVIDE PRODUCTS AND SOLUTIONS THAT HELP AMERICAN FAMILIES SECURE THEIR FINANCIAL FUTURES. WE ARE A FUTURE-FOCUSED COMPANY, PASSIONATE ABOUT WHAT WE DO AND HOW WE DO IT. THIS MEANS WORKING WITH PACE AND ENERGY TO REACH OUR GOALS, AND CHALLENGING OURSELVES TO ACHIEVE MORE. WE STRIVE TO CREATE A UNIQUE ENVIRONMENT WHERE BALANCE BETWEEN WORK AND LIFE IS POSSIBLE. OUR EMPLOYEES' PASSION, DEDICATION AND HARD WORK, AS WELL AS OUR CAREER DEVELOPMENT OPPORTUNITIES, BENEFITS, AND EMPLOYEE ACTIVITIES CONTRIBUTE TO OUR POSITIVE WORKPLACE CULTURE. THE INSIDE SALES REPRESENTATIVE WILL HANDLE A BLEND OF INBOUND AND OUTBOUND CALLS (NO COLD CALLING!) GENERATED THROUGH VARIOUS MARKETING TACTICS WHILE DELIVERING PROMPT, ACCURATE AND EXCEPTIONAL CUSTOMER SERVICE TO CUSTOMERS. RESPOND TO ALL INQUIRIES AND FOLLOW-UPS IN A TIMELY MANNER WHILE MEETING OR EXCEEDING SALES, QUALITY AND TIME SERVICE GOALS. RESPONSIBILITIESHANDLE AND PROCESS SALES LEADS WITHIN ESTABLISHED SERVICE STANDARDS AND QUALITY GUIDELINES. SALES LEADS ARE GENERATED BY VARIOUS MARKETING EFFORTS TO INCLUDE ONLINE, TELEVISION, RADIO AND DIRECT MAIL ADVERTISING AND MAY BE INBOUND CALLS ON A TOLL-FREE NUMBER AND OUTBOUND CALLS IN RESPONSE TO REQUESTS FOR INFORMATION.CONDUCT A NEEDS-BASED ANALYSIS OF COVERAGE FOR ALL POTENTIAL CUSTOMERS. DEMONSTRATE A KNOWLEDGEABLE AND THOUGHT-FULL APPROACH TO CUSTOMER NEEDS AND PRESENT A PLAN THAT IS APPROPRIATE AND UPHOLD COMPANY CORE VALUES IN HOW WE DELIVER SERVICES.PROMOTE THE BENEFITS, COVERAGE AND TERMS OF PRODUCTS TO POTENTIAL CUSTOMERS BEFORE CLOSING THE SALE. MAXIMIZE OPPORTUNITIES TO CROSS-SELL AND UP-SELL SUPPLEMENTAL PRODUCTS. ENSURE CUSTOMER UNDERSTANDING WITH DETAILED APPROACH TO EXPLAINING COMPANY PRODUCTS, SERVICES, BEST PRACTICES, AND FINANCIAL STRENGTH.MAINTAIN ACCURATE KNOWLEDGE OF PRODUCTS AND CORE COMPETITORS THROUGH MARKET RESEARCH. ACQUIRE INDUSTRY INTELLIGENCE ON COMPETITOR PRODUCTS, RATES, SALES, AND STRATEGIES.COMPLETE APPLICATIONS, MANDATORY FORMS AND ALL OTHER NECESSARY DOCUMENTS TO COMPLETE THE SALE. OBTAIN CUSTOMER DEMOGRAPHICS, HEALTH ASSESSMENT, NON-MEDICAL AND FINANCIAL RISK FACTORS REQUIRED FOR QUOTE AND SALE.QUOTE AND OFFER PROFESSIONAL RECOMMENDATION OF COVERAGE BASED ON UNDERWRITING RATING CLASS AND THOROUGH NEEDS ANALYSIS. QUOTE IS SUBJECT TO UNDERWRITING APPROVAL AND MAY REQUIRE RESELLING COVERAGE AT A DIFFERENT RATING CLASS.MAINTAIN FOLLOW-UP APPOINTMENTS FOR CALLS NOT CLOSED IN CALL CENTER CRM.MAINTAIN ACCURATE CLIENT RECORDS USING EXCEL SPREADSHEETS, CLIENT RECORD MANAGEMENT SYSTEMS AND VARIOUS CONTACT MANAGEMENT TACTICS.PARTICIPATE IN WEEKLY SALES MEETINGS AND PERFORMANCE REVIEWS WITH SALES MANAGEMENT.CONSISTENTLY MEET AND/OR EXCEED MONTHLY SALES TARGETS, COMPANY OBJECTIVES, AND QUALITY METRICS.PROCESS ALL OTHER DUTIES AS ASSIGNED BY DEPARTMENT MANAGEMENT.\nQUALIFICATIONSEDUCATIONHIGH SCHOOL DIPLOMA OR EQUIVALENTLIFE INSURANCE LICENSE IN HOME STATE, PREFERREDMUST OBTAIN THE REQUIRED STATE LICENSE WITH THE TIME PERIOD DESIGNATED BY THE COMPANY EXPERIENCE/KNOWLEDGE3+ YEARS EXPERIENCE IN A SALES RELATED POSITIONEXPERIENCE WORKING IN A SALES ENVIRONMENT, PREFERABLY IN AN INBOUND/OUTBOUND CALL CENTER USING COMPUTERS AND NAVIGATING AMONG MULTIPLE SYSTEMS AND SCREENS SKILLSEXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS, INCLUDING WELL DEVELOPED INTERPERSONAL SKILLSSTRONG RELATIONSHIP MANAGEMENT SKILLSTHRIVE IN A FAST-PACED, HIGH-ENERGY CALL CENTER ENVIRONMENTDEMONSTRATED TIME MANAGEMENT SKILLS AND THE ABILITY TO MANAGE MULTIPLE PRIORITIESABILITY TO WORK INDEPENDENTLY AND WITHIN A COLLABORATIVE ENVIRONMENTPROFICIENCY WITH MICROSOFT OFFICE SUITE (WORD AND EXCEL)FLEXIBILITY TO WORK 8 HOUR SHIFTS WITHIN THE CALL CENTER OPERATING HOURS OF MONDAY THROUGH SUNDAY FROM 8:00 AM TO 11:00 PM (OR AS BUSINESS DEMANDS). ALL SHIFTS WILL INCLUDE EVENINGS AND/OR WEEKENDS.\nWHAT’S IN IT FOR YOU?\nTHE EXPECTED HIRING COMPENSATION RANGE FOR THIS POSITION IS $38,000 ANNUALLY PLUS COMMISSION (AVERAGE TOTAL COMPENSATION INCLUDING COMMISSION TYPICALLY AVERAGES BETWEEN $55,000 AND $65,000). THIS ROLE WILL BE WORKING IN A HYBRID ENVIRONMENT WITH UP TO 3 DAYS IN OFFICE PER WEEK.\nTHE TOTAL COMPENSATION PACKAGE FOR THIS POSITION MAY INCLUDE OTHER ELEMENTS, SUCH AS A SIGN-ON BONUS, LONG TERM INCENTIVES, AND ANNUAL BONUSES. THIS ROLE IS ELIGIBLE TO PARTICIPATE IN THE LEGAL & GENERAL AMERICA ANNUAL INCENTIVE PLAN. THIS ROLE HAS 10 VACATION DAYS AND 10 SICK DAYS THAT ARE ACCRUED ON A BI-WEEKLY BASIS. EMPLOYEES ALSO HAVE 9 PAID HOLIDAYS THROUGHOUT THE CALENDAR YEAR.\nWE HAVE A COMPETITIVE COMPENSATION AND BENEFITS PACKAGE FOCUSED ON YOUR OVERALL WELLBEING. EMPLOYEE BENEFITS INCLUDE HEALTH, LIFE, AND DENTAL INSURANCE; 401K WITH COMPANY MATCH UP TO 6% AS WELL AS A PENSION PACKAGE; GENEROUS TIME OFF; AND WELLBEING INITIATIVES THROUGHOUT THE YEAR (WE LIKE DOING FUN STUFF). WE’RE BIG ON PROFESSIONAL DEVELOPMENT AND WE’LL SUPPORT AND MENTOR YOU IN YOUR CAREER PROGRESSION AND EXPECT YOU TO HELP US PAY IT FORWARD BY HELPING US DEVELOP TOMORROW'S LEADERS AND GROWTH-FOCUSED PROFESSIONALS. WE VALUE OUR TEAMS AND OUR COMMUNITIES AND BELIEVE IN GIVING BACK. ENJOY TIME OFF TO VOLUNTEER FOR THOSE CAUSES THAT MATTER MOST TO YOU!\nIF HIRED, EMPLOYEE WILL BE IN AN “AT-WILL POSITION” AND THE COMPANY RESERVES THE RIGHT TO MODIFY BASE SALARY (AS WELL AS ANY OTHER DISCRETIONARY PAYMENT OR COMPENSATION PROGRAM) AT ANY TIME, INCLUDING FOR REASONS RELATED TO INDIVIDUAL PERFORMANCE, COMPANY OR INDIVIDUAL DEPARTMENT/TEAM PERFORMANCE, AND MARKET FACTORS. THE COMPANY RESERVES THE RIGHT TO CHANGE BENEFITS PLANS AT ANY TIME.\nWE ARE AN EQUAL OPPORTUNITY EMPLOYER AND VALUE DIVERSITY AT OUR COMPANY. WE DO NOT DISCRIMINATE BASED ON RACE, RELIGION, COLOR, NATIONAL ORIGIN, SEX, GENDER, GENDER EXPRESSION, SEXUAL ORIENTATION, AGE, MARITAL STATUS, VETERAN STATUS, OR DISABILITY STATUS. WE WILL ENSURE THAT INDIVIDUALS WITH DISABILITIES ARE PROVIDED REASONABLE ACCOMMODATION TO PARTICIPATE IN THE JOB APPLICATION OR INTERVIEW PROCESS, PERFORM ESSENTIAL JOB FUNCTIONS, AND RECEIVE OTHER BENEFITS AND PRIVILEGES OF EMPLOYMENT. PLEASE CONTACT US TO REQUEST ACCOMMODATION.",
    "job_skill_set": [
      "sales",
      "customer service",
      "independence",
      "Microsoft Office Suite",
      "CRM software",
      "market research",
      "data entry",
      "needs-based analysis",
      "life insurance knowledge",
      "communication",
      "relationship management",
      "time management",
      "teamwork",
      "flexibility",
      "problem solving",
      "adaptability"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "calls",
      "cold",
      "communication",
      "crm",
      "customer",
      "data",
      "entry",
      "flexibility",
      "independence",
      "inside",
      "insurance",
      "knowledge",
      "life",
      "management",
      "market",
      "microsoft",
      "needsbased",
      "no",
      "office",
      "problem",
      "relationship",
      "representative",
      "research",
      "sales",
      "service",
      "software",
      "solving",
      "suite",
      "teamwork",
      "time"
    ]
  },
  {
    "job_id": "3898165307",
    "job_title": "Inside Sales Specialist",
    "category": "SALES",
    "job_description": "POSITION OVERVIEW: LHH RECRUITMENT IS SEEKING A DEDICATED AND DRIVEN INSIDE SALES SPECIALIST TO JOIN OUR CLIENT'S DYNAMIC TEAM BASED IN TUKWILA, WA. THE IDEAL CANDIDATE WILL BE RESPONSIBLE FOR PROMOTING PRODUCTS, GAINING NEW BUSINESS, AND INPUTTING ORDERS FOR THEIR PHARMACEUTICAL PRODUCTS. WE ARE SEEKING CANDIDATES WITH A BACKGROUND IN CUSTOMER SERVICE (IDEALLY B2B) OR SALES WHO ARE READY FOR A NEW ADVENTURE. OUR CLIENT OFFERS GREAT BENEFITS AND GROWTH OPPORTUNITIES. \nPOSITION DETAILS:DURATION: DIRECT HIREPAY: $26-$31 PER HOURLOCATION: ONSITE IN TUKWILA, WAHOURS: M-F, FULL TIMEGREAT BENEFITS INCLUDING PTO AND SICK TIME, 401K WITH COMPANY MATCH, HSA, AND MEDICAL, DENTAL AND VISION\nKEY RESPONSIBILITIES:ESTABLISH AND MAINTAIN RELATIONSHIPS WITH HEALTHCARE PROVIDERS, PHARMACISTS, AND DECISION-MAKERS WITHIN THE MEDICAL COMMUNITY THROUGH EMAILS AND PHONE CALLS.PRESENT AND SELL COMPANY PRODUCTS, ENSURING CLIENTS ARE INFORMED ABOUT THE FEATURES, BENEFITS, AND USES OF EACH PRODUCT.RECEIVE, PROCESS AND INPUT ORDERS VIA PHONE, EMAIL AND ERP SYSTEM. MAINTAIN ACCURATE RECORDS OF SALES, CLIENT INTERACTIONS, AND OTHER RELEVANT ACTIVITIES.\nQUALIFICATIONS:BACHELOR'S DEGREE IN BUSINESS, MARKETING, OR A RELATED FIELD PREFERRED; HIGH SCHOOL DIPLOMA OR GED REQUIRED.PROVEN SALES OR B2B CUSTOMER SERVICE EXPERIENCE EXPERIENCE.EXCELLENT VERBAL AND WRITTEN COMMUNICATION ABILITIES.PROFICIENT IN MICROSOFT OFFICE SUITE.EXPERIENCE USING AN ERP IS A BIG PLUS. \n\nBENEFIT OFFERINGS INCLUDE MEDICAL, DENTAL, VISION, LIFE INSURANCE, SHORT-TERM DISABILITY, ADDITIONAL VOLUNTARY BENEFITS, EAP PROGRAM, COMMUTER BENEFITS AND 401K PLAN. OUR PROGRAM PROVIDES EMPLOYEES THE FLEXIBILITY TO CHOOSE THE TYPE OF COVERAGE THAT MEETS THEIR INDIVIDUAL NEEDS. AVAILABLE PAID LEAVE MAY INCLUDE PAID SICK LEAVE, WHERE REQUIRED BY LAW; ANY OTHER PAID LEAVEREQUIRED BY FEDERAL, STATE, OR LOCAL LAW; AND HOLIDAY PAY UPON MEETING ELIGIBILITY CRITERIA.  EQUAL OPPORTUNITY EMPLOYER/VETERANS/DISABLEDTO READ OUR CANDIDATE PRIVACY INFORMATION STATEMENT, WHICH EXPLAINS HOW WE WILL USE YOUR INFORMATION, PLEASE VISIT HTTPS://WWW.LHH.COM/CANDIDATE-PRIVACY/THE COMPANY WILL CONSIDER QUALIFIED APPLICANTS WITH ARREST AND CONVICTION RECORDS.FROM <HTTPS://WWW.LINKEDIN.COM/TALENT/HIRE/831220084/JOB-POST>",
    "job_skill_set": [
      "sales",
      "Microsoft Office Suite",
      "order processing",
      "communication",
      "relationship building",
      "problem solving",
      "teamwork",
      "adaptability",
      "customer service",
      "ERP systems"
    ],
    "short_keywords": [
      "adaptability",
      "building",
      "communication",
      "customer",
      "erp",
      "inside",
      "microsoft",
      "office",
      "order",
      "problem",
      "processing",
      "relationship",
      "sales",
      "service",
      "solving",
      "specialist",
      "suite",
      "systems",
      "teamwork"
    ]
  },
  {
    "job_id": "3888931879",
    "job_title": "Sales Enablement & Training Manager",
    "category": "SALES",
    "job_description": "PREDICTIVE ANALYTICS AND MACHINE LEARNING POWER SOCURE’S GROUNDBREAKING TECHNOLOGY AND FUEL OUR MISSION TO VERIFY 100% OF GOOD IDENTITIES IN REAL TIME AND COMPLETELY ELIMINATE IDENTITY FRAUD ON THE INTERNET.\n\nSOCURE IS THE WORLD LEADER IN DIGITAL IDENTITY VERIFICATION AND FRAUD PREVENTION. OUR RECENT AWARDS INCLUDE FORBES 2022 AMERICA’S BEST STARTUP EMPLOYERS, THE FORBES CLOUD 100, THE DELOITTE TECHNOLOGY FAST 500, AND INC. 5000’S FASTEST GROWING COMPANIES.\n\nLISTEN TO WHY SOME OF THE WORLD’S TOP TECHNOLOGY INVESTORS SEE THE ENORMOUS, TRANSFORMATIVE POTENTIAL IN SOCURE’S MISSION AND PRODUCTS:\n\nHTTPS://WWW.YOUTUBE.COM/WATCH?V=IFM9_JPQCV8\n\nABOUT THE ROLE:\n\nSOCURE IS LOOKING FOR AN EXPERIENCED SALES ENABLEMENT AND TRAINING MANAGER TO JOIN THE GROWING TEAM AT SOCURE. THIS CRITICAL ROLE WILL HELP EMPOWER SALES GROWTH AND ENSURE EFFECTIVENESS OF ENABLEMENT PROGRAMS THROUGH METHODICAL EXECUTION ON ONBOARDING, RAMP, UPSKILLING AND RESKILLING OF THE SALES TEAMS. A SUCCESSFUL CANDIDATE WILL BUILD OUR TRAINING PROGRAMS AND CURRICULUM IN COORDINATION WITH THE TEAM’S OBJECTIVES AND PRODUCT ROLLOUT PLANS, CRAFT ENABLEMENT ASSETS, FACILITATE LIVE TRAINING SESSIONS, COACH, RUN SIMULATIONS, AND PREPARE ON-DEMAND RESOURCES.\n\nAS A SALES ENABLEMENT AND TRAINING MANAGER, YOU WILL REPORT TO THE VP OF SALES ENABLEMENT AND COLLABORATE WITH MARKETING, SALES LEADERSHIP AND PRODUCT ORGANIZATIONS AS WELL AS SUBJECT MATTER EXPERTS ACROSS THE COMPANY TO ENSURE OUR SALES TEAMS ARE BEST-EQUIPPED TO EXCEL IN THEIR ROLES.\n\nRESPONSIBILITIES:\n\n DEVELOP TRAINING CONTENT:CREATE, UPDATE, AND MAINTAIN A COMPREHENSIVE LIBRARY OF TRAINING MATERIALS, INCLUDING PRESENTATIONS, VIDEOS, DOCUMENTATION, ETC. COLLABORATE WITH SUBJECT MATTER EXPERTS, SALES LEADERS, PRODUCT MARKETING, AND PRODUCT TEAMS TO ENSURE TRAINING CONTENT IS ACCURATE, UP-TO-DATE, AND ALIGNED WITH THE LATEST INDUSTRY TRENDS AND PRODUCT DEVELOPMENTS. OPTIMIZE MARKETING CONTENT FOR ENGAGEMENT AND EFFECTIVE CUSTOMER INTERACTIONS CURRICULUM DESIGN:CREATE A STRUCTURED TRAINING CURRICULUM THAT ALIGNS WITH THE SPECIFIC NEEDS OF THE SALES TEAM AND THE STRATEGIC PRIORITIES OF THE BUSINESS. CONTINUOUSLY ADAPT AND EVOLVE THE CURRICULUM TO ADDRESS CHANGING MARKET CONDITIONS AND EMERGING FRAUD PREVENTION TRENDS.  ELEVATE ONBOARDING EXPERIENCE:MANAGE AND ENHANCE THE SALES ONBOARDING PROGRAM TO DRAMATICALLY EXPEDITE THE RAMP-UP PROCESS FOR NEW SALES HIRES. INTRODUCE AND PROMOTE INNOVATIVE LEARNING TOOLS AND SALES TECHNIQUES TO SCALE ONBOARDING AS THE COMPANY GROWS.  UPSKILL AND RESKILL TALENT:ENSURE THAT ALL MEMBERS OF THE GTM ORGANIZATION, INCLUDING SALES, SOLUTION CONSULTANTS, ACCOUNT MANAGERS, AND TECHNICAL ACCOUNT MANAGERS, HAVE THE NECESSARY PRODUCT, TECHNOLOGY, AND MARKET EXPERTISE. BUILD AND MANAGE PRODUCT AND VERTICAL CERTIFICATION PROGRAMS.  COACH TALENT:CO-DESIGN THE COACHING PROGRAM WITH THE SALES LEADERSHIP TO ENSURE EVERY CUSTOMER-FACING SOCUREAN HAS OPTIMAL PERFORMANCE AND IS PREPARED TO SUCCEED BE A PASSIONATE COACH AND SOCURE ADVOCATE:BE THE OUTSTANDING EXPERT IN SOCURE PRODUCT SUITE, GAIN DEEP KNOWLEDGE OF THE CUSTOMER AND THE MARKET\n\nQUALIFICATIONS:\n\n7+ YEARS OF EXPERIENCE IN SALES ENABLEMENT OR DIRECT SALES WITHIN THE ENTERPRISE SAAS INDUSTRY, PREFERABLY IN FRAUD PROTECTION, IDENTITY VERIFICATION, IDENTITY MANAGEMENT OR DIGITAL CUSTOMER ACQUISITION. 3+ YEARS OF DIRECT EXPERIENCE IN SALES ENABLEMENT, LEARNING DEVELOPMENT, OR SALES STRATEGY. THOROUGH UNDERSTANDING OF ENTERPRISE SAAS SALES PROCESSES, SALES METHODOLOGIES (MEDDPICC, CHALLENGER, COMMAND OF THE MESSAGE, OR OTHER), AND THE BUYER'S JOURNEY. EXCELLENT COMMUNICATION, PRESENTATION, AND INTERPERSONAL ABILITIES. DATA-DRIVEN APPROACH WITH A TRACK RECORD OF SETTING AND ACHIEVING SUCCESS METRICS AND QUALIFYING IMPROVEMENTS. SOLID PROJECT MANAGEMENT AND ORGANIZATIONAL SKILLS. ABILITY TO LEAD WITH PASSION AND MOTIVATE A DIVERSE TEAM IN A FAST-PACED, HIGH-GROWTH REMOTE ENVIRONMENT. \n\nSALARY DISCLOSURE:\n\nBASE SALARY RANGE: $140,000-160,000\n\nTHIS REPRESENTS THE EXPECTED SALARY RANGE FOR THIS JOB REQUISITION. FINAL OFFERS MAY VARY FROM THE AMOUNT LISTED BASED ON FACTORS INCLUDING GEOGRAPHY, CANDIDATE EXPERIENCE AND EXPERTISE, AND OTHER JOB RELATED FACTORS. SOCURE'S COMPENSATION AND REWARDS PACKAGE FOR FULL TIME ROLES INCLUDES A MARKET COMPETITIVE SALARY, EQUITY, COMPREHENSIVE BENEFITS, AND, FOR APPLICABLE ROLES, COMMISSIONS PLANS OR AN ANNUAL DISCRETIONARY PERFORMANCE BONUS.\n\nSOCURE IS ALL ABOUT ENCOURAGING PEOPLE TO PUSH THE BOUNDARIES OF WHAT’S POSSIBLE THROUGH TOP-TIER PERFORMANCE, INNOVATION, OWNERSHIP, AND SHARED EXPERTISE.\n\nWE EMPOWER EXCELLENCE BY PROVIDING GREAT PERKS AND BENEFITS TO BOTH OUR FULLY REMOTE EMPLOYEES IN NORTH AMERICA AND OUR HYBRID TEAMS IN INDIA.\n\nTO LEARN MORE, CHECK OUT SOCURE’S CAREER PAGE: HTTPS://WWW.SOCURE.COM/COMPANY/CAREERS\n\nSOCURE IS AN EQUAL OPPORTUNITY EMPLOYER AND VALUE DIVERSITY OF ALL KINDS AT OUR COMPANY. WE DO NOT DISCRIMINATE ON THE BASIS OF RACE, RELIGION, COLOR, NATIONAL ORIGIN, GENDER, SEXUAL ORIENTATION, AGE, MARITAL STATUS, VETERAN STATUS, OR DISABILITY STATUS.\n\nTO LEARN MORE ABOUT HOW OUR WORK IS CHANGING THE WORLD, CHECK OUT THESE ARTICLES AND VIDEOS:\n\nSOCURE IS FORBES' 2022 BEST STARTUP EMPLOYER: HTTPS://BIT.LY/3FBNW8SSOCURE ACCELERATES ONBOARDING FOR 50+ CRYPTO, NEOBANKS, AND MORE: HTTPS://BIT.LY/3DWN2K7SOCURE'S IMPACT ON FINANCIAL INCLUSION: HTTPS://WWW.YOUTUBE.COM/WATCH?V=Y6NBC6S1WSUSOCURE'S IMPACT ON FRAUD PREVENTION: HTTPS://WWW.YOUTUBE.COM/WATCH?V=M46UG8QYKE4ARCHIVES & PRESS RELEASES: HTTPS://LEARN.SOCURE.COM/ABOUT/PRESS-RELEASE",
    "job_skill_set": [
      "training development",
      "product knowledge",
      "communication",
      "coaching",
      "interpersonal skills",
      "leadership",
      "adaptability",
      "team collaboration",
      "problem solving",
      "sales enablement",
      "curriculum design",
      "project management",
      "data analysis",
      "SaaS sales processes",
      "sales methodologies",
      "certification programs",
      "motivation"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "certification",
      "coaching",
      "collaboration",
      "communication",
      "curriculum",
      "data",
      "design",
      "development",
      "enablement",
      "interpersonal",
      "knowledge",
      "leadership",
      "management",
      "manager",
      "methodologies",
      "motivation",
      "problem",
      "processes",
      "product",
      "programs",
      "project",
      "saas",
      "sales",
      "skills",
      "solving",
      "team",
      "training"
    ]
  },
  {
    "job_id": "3904925249",
    "job_title": "Industrial Sales Representative",
    "category": "SALES",
    "job_description": "ABTREX INDUSTRIES, INC, A 50+-YEAR-OLD FAMILY BUSINESS WHOSE PURPOSE IS TO PROTECT OUR CUSTOMER’S ASSETS AND THE ENVIRONMENT FROM THE BAD STUFF WELCOMES YOU.WE ALL WORK TOGETHER TO DOUBLE IN SIZE AS A TURNKEY MANUFACTURING AND INSTALLATION COMPANY WITHIN THE NEXT 5 YEARS.WE SPECIALIZE IN ABTREX RUBBER LININGS, OUR SWEET SPOT. IF YOU WANT TO BELONG TO A TEAM THAT DOES THIS WELL EVERY DAY, THIS COMPANY’S A GREAT FIT FOR YOU.CLIENTS ARE COMPANIES PROCESSING, STORAGE, AND ANCILLARY STEEL EQUIPMENT THAT NEEDS PROTECTION FROM ABRASION AND CORROSION ANYWHERE IN THE WORLD. IF YOU HAVE EXPERIENCE WORKING WITH THIS TYPE OF CLIENT – OR WANT THAT EXPERIENCE – THIS ROLE WILL BE A GREAT FIT.\nRESPONSIBILITIES\nYOU’LL LOVE COMING TO WORK EVERY DAY IF YOU GET, WANT, AND HAVE THE CAPACITY TO DO:PROSPECT CUSTOMERSDEVELOP AND MAINTAIN RELATIONSHIPSPRESENT ABTREX INDUSTRIES' CAPABILITIES AND SOLUTIONSVET INQUIRIESPREPARE PRICE ESTIMATES USING MATERIAL TAKE-OFFS AND LABOR ESTIMATESPROJECT MANAGE LARGE FIELD JOBS\nYOU’LL HAVE SUCCESS HERE IF YOU VALUE CLEAR PROCESSES AND FEEL QUALIFIED TO DO THE FOLLOWING THINGS:SUPPLY PRODUCTS AND KNOWLEDGEAPPLY CREATIVE QUALITY SOLUTIONS TO MINIMIZE CUSTOMER DOWNTIMEESTABLISH RELATIONSHIPS THAT CUSTOMERS CAN RELY ON\nWE TRAIN OUR TEAM TO HELP THEM SUCCEED, AND EVERYONE ON OUR TEAM HELPS WITH OUR SUCCESS. IN THIS ROLE, YOU’LL BE ACCOUNTABLE TO HIT THE FOLLOWING NUMBERS EACH WEEK:RECEIVE 5 NEW REQUESTS FOR PRICINGCLOSE ON $75K IN NEW WORKIMPROVE YOUR CLOSE RATIO\nIF YOU WANT TO COME TO WORK, LEARN, AND HIT THOSE NUMBERS, YOU’LL BE RECOGNIZED AND REWARDED.\nQUALIFICATIONS\nYOU WILL LOVE IT HERE IF YOU:GET IT DONEBELIEVE REPUTATION IS KEYARE GROWTH ORIENTEDFOCUS ON SAFETYHAVE STEEL FABRICATION (ASME PREFERRED) OR INDUSTRIAL LINING INDUSTRY EXPERIENCE\nABOUT ABTREX INDUSTRIES\nOUR COMPANY RUNS ON EOS PURELY. THAT MEANS AS A MEMBER OF THIS TEAM, YOU WILL HAVE A LEADER WHO:GIVES CLEAR DIRECTIONSMAKES SURE YOU HAVE THE NECESSARY TOOLSACTS WITH THE GREATER GOOD IN MINDDELEGATES APPROPRIATELYTAKES TIME TO TRULY UNDERSTAND YOUR ROLE AND HOW YOU CAN HELP THE COMPANYMAKES THEIR EXPECTATIONS CLEARCOMMUNICATES WELLHAS EFFECTIVE MEETINGSMEETS ONE-ON-ONE WITH YOU QUARTERLY OR MORE, IF NEEDEDREWARDS AND RECOGNIZES YOUR PERFORMANCE\nTO LEARN MORE ABOUT OUR COMPANY CULTURE AND THE RECRUITMENT PROCESS, PLEASE VISIT: HTTPS://ABTREX.COM/CAREERS/\nBENEFITS OFFERED BY THE COMPANY:401(K)401(K) MATCHINGDENTAL INSURANCEHEALTH INSURANCEHEALTH SAVINGS ACCOUNTLIFE INSURANCEPAID TIME OFFVISION INSURANCESHORT TERM DISABILITY",
    "job_skill_set": [
      "sales",
      "customer relationship management",
      "communication",
      "teamwork",
      "problem solving",
      "reliability",
      "accountability",
      "project management",
      "price estimation",
      "steel fabrication",
      "industrial lining",
      "material take-offs",
      "abrasion and corrosion protection",
      "creativity",
      "growth orientation",
      "focus on safety"
    ],
    "short_keywords": [
      "abrasion",
      "accountability",
      "and",
      "communication",
      "corrosion",
      "creativity",
      "customer",
      "estimation",
      "fabrication",
      "focus",
      "growth",
      "industrial",
      "lining",
      "management",
      "material",
      "on",
      "orientation",
      "price",
      "problem",
      "project",
      "protection",
      "relationship",
      "reliability",
      "representative",
      "safety",
      "sales",
      "solving",
      "steel",
      "takeoffs",
      "teamwork"
    ]
  },
  {
    "job_id": "3902749520",
    "job_title": "Fleet Solutions Sales Manager",
    "category": "SALES",
    "job_description": "REQUISITION ID: 121284\n\nSPONSORSHIP AVAILABLE: NO\n\nRELOCATION ASSISTANCE AVAILABLE: NO\n\nGOODYEAR. MORE DRIVEN.\n\nGAIN COMPETITIVE ADVANTAGE WITH FLEETS IN ORDER TO PROFITABLY GROW BUSINESS AND GAIN MARKET SHARE.\n\nCAPTURE THE FULL VALUE OF THE GOODYEAR BRAND IN THE MARKETPLACE.\n\nDEVELOP STRONG, STRATEGIC CUSTOMER RELATIONSHIPS WITH NATIONAL ACCOUNT AND LOCAL BOOK CUSTOMERS.\n\nGROW EXISTING ACCOUNTS TO MAINTAIN OR GAIN SHARE OF ACCOUNT.\n\nPRIMARY RESPONSIBILITIES\n\nLEADS SELL-OUT ACTIVITY IN ASSIGNED TERRITORY TO MEET OR EXCEED INDIVIDUAL SALES OBJECTIVES. MAINTAINS AND GROWS SHARE OF ACCOUNT WITH EXISTING CUSTOMERS. ACT AS A PARTNER TO FLEET CUSTOMERS IN ALL ASPECTS OF ACCOUNT MANAGEMENT. PARTNERS WITH CTSC OR SERVICING DEALER TO ENSURE FLEET NEEDS ARE MET.CREATES STRATEGIES AND SUPPORTING TACTICS TO GROW WITH EXISTING ACCOUNTS IN ALIGNMENT WITH THE OVERALL GOODYEAR COMMERCIAL PBU STRATEGY. PROFITABLY GROW NATIONAL ACCOUNT AND LOCAL BOOK BUSINESS, WHILE MINIMIZING CHURN RATE.DRIVES SOLUTIONS-BASED SELLING TO USE DATA AND TOOLS AS PART OF A CONSULTATIVE SALES RELATIONSHIP. SELLS THE VALUE OF GOODYEAR’S TOTAL SOLUTION TO WIN WITH FLEETS. SELLS CRADLE TO GRAVE SOLUTIONS TO FLEETS (OE/NEW TIRE/RETREAD). \n\nREQUIRED EDUCATION AND EXPERIENCE\n\nAT LEAST 3 YEARS OF SALES EXPERIENCE WITH A BACHELOR’S DEGREE; OR IN LIEU OF DEGREE, AT LEAST 8 YEARS SALES EXPERIENCE EXPERIENCE MANAGING STRATEGIC CUSTOMER RELATIONSHIPSEXPERIENCE PROSPECTING FOR GROWTH OPPORTUNITIES BY DEVELOPING AND EXECUTING INNOVATIVE SALES STRATEGIESB2B SALES EXPERIENCE PREFERRED     \n\nDESIRED SKILLS AND ABILITIES\n\nEXPERT IN SOLUTIONS-BASED SELLING COMPETENCYSTRONG TIME MANAGEMENT SKILLS, BUSINESS AND FINANCIAL ACUMEN TO DRIVE PROFITABLE GROWTHCUSTOMER SERVICE ORIENTATION, LEADERSHIP BY INFLUENCE AND EFFECTIVE COLLABORATION (CTSC/DEALERS, SUPPLY CHAIN, FINANCE, ETC.)ORGANIZATIONAL KNOW-HOW, UNDERSTANDING OF HOW THINGS GET DONE, STRONG NEGOTIATION SKILLS\n\nGOODYEAR IS ONE OF THE WORLD'S LARGEST TIRE COMPANIES. IT EMPLOYS ABOUT 71,000 PEOPLE AND MANUFACTURES ITS PRODUCTS IN 55 FACILITIES IN 22 COUNTRIES AROUND THE WORLD. ITS TWO INNOVATION CENTERS IN AKRON, OHIO, AND COLMAR-BERG, LUXEMBOURG, STRIVE TO DEVELOP STATE-OF-THE-ART PRODUCTS AND SERVICES THAT SET THE TECHNOLOGY AND PERFORMANCE STANDARD FOR THE INDUSTRY. FOR MORE INFORMATION ABOUT GOODYEAR AND ITS PRODUCTS, GO TO WWW.GOODYEAR.COM/CORPORATE.\n\nTHE PAY RANGE FOR THIS POSITION IS 87017 - 161606 /YR; HOWEVER, BASE PAY OFFERED MAY VARY DEPENDING ON FACTORS SUCH-AS JOB-RELATED KNOWLEDGE, SKILLS, EXPERIENCE, AND MARKET LOCATION. SELECTED CANDIDATES MAY BE ELIGIBLE FOR A NUMBER OF BENEFITS, INCLUDING: MEDICAL, PRESCRIPTION, DENTAL, VISION, 401(K), LIFE INSURANCE, DISABILITY, TUITION ASSISTANCE, SICK AND VACATION TIME, AS WELL AS TIRE DISCOUNTS.\n\nGOODYEAR IS AN EQUAL EMPLOYMENT OPPORTUNITY AND AFFIRMATIVE ACTION EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARDS TO THAT INDIVIDUAL'S RACE, COLOR, RELIGION OR CREED, NATIONAL ORIGIN OR ANCESTRY, SEX (INCLUDING PREGNANCY), SEXUAL ORIENTATION, GENDER IDENTITY, AGE, PHYSICAL OR MENTAL DISABILITY, VETERAN STATUS, GENETIC INFORMATION, ETHNICITY, CITIZENSHIP, OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW.\n\nIF YOU NEED REASONABLE ACCOMMODATION TO COMPLETE THE ONLINE APPLICATION, OR ANY OTHER PART OF THE EMPLOYMENT PROCESS, PLEASE CONTACT THE GOODYEAR CANDIDATE CARE LINE AT 330.796.4500.\n\nCLICK HERE FOR MORE INFORMATION ABOUT EQUAL EMPLOYMENT OPPORTUNITY LAWS, AND HERE FOR ADDITIONAL SUPPLEMENTARY INFORMATION.\n\n",
    "job_skill_set": [
      "sales experience",
      "solutions-based selling",
      "strategic customer relationship management",
      "time management",
      "business acumen",
      "negotiation skills",
      "account management",
      "data analysis",
      "financial acumen",
      "customer service orientation",
      "leadership by influence",
      "effective collaboration",
      "organizational skills",
      "problem solving",
      "communication",
      "B2B sales"
    ],
    "short_keywords": [
      "account",
      "acumen",
      "analysis",
      "b2b",
      "business",
      "by",
      "collaboration",
      "communication",
      "customer",
      "data",
      "effective",
      "experience",
      "financial",
      "fleet",
      "influence",
      "leadership",
      "management",
      "manager",
      "negotiation",
      "organizational",
      "orientation",
      "problem",
      "relationship",
      "sales",
      "selling",
      "service",
      "skills",
      "solutions",
      "solutionsbased",
      "solving",
      "strategic",
      "time"
    ]
  },
  {
    "job_id": "3884442278",
    "job_title": "Leisure Sales Manager",
    "category": "SALES",
    "job_description": "THE GROUP\n\nMANDARIN ORIENTAL HOTEL GROUP IS THE AWARD-WINNING OWNER AND OPERATOR OF SOME OF THE WORLD’S MOST LUXURIOUS HOTELS, RESORTS AND RESIDENCES. HAVING GROWN FROM ITS ASIAN ROOTS INTO A GLOBAL BRAND, THE GROUP NOW OPERATES 38 HOTELS AND NINE RESIDENCES AND 23 EXCLUSIVE HOMES IN 25 COUNTRIES AND TERRITORIES, WITH EACH PROPERTY REFLECTING THE GROUP’S ORIENTAL HERITAGE AND UNIQUE SENSE OF PLACE. MANDARIN ORIENTAL HAS A STRONG PIPELINE OF HOTELS AND RESIDENCES UNDER DEVELOPMENT AND IS A MEMBER OF THE JARDINE MATHESON GROUP.\n\nTHE HOTEL\n\nA STUNNING FUSION OF MODERN DESIGN WITH STYLISH ORIENTAL FLAIR, MANDARIN ORIENTAL, NEW YORK FEATURES 244 ELEGANT GUESTROOMS AND SUITES — ALL WITH BREATH-TAKING VIEWS OF MANHATTAN AND FIVE-STAR HOSPITALITY. LUXURIOUS AMENITIES INCLUDE MO LOUNGE, ALL-DAY DINING OVERLOOKING CENTRAL PARK AND THE MANHATTAN SKYLINE; A 14,500 SQUARE-FOOT FIVE-STAR MANDARIN ORIENTAL SPA; AND A STATE-OF-THE-ART FITNESS CENTER WITH A 75-FOOT LAP POOL. IN ADDITION, THERE IS PREMIUM MEETING AND EVENT SPACE, INCLUDING A 6,000 SQUARE-FOOT PILLAR-LESS BALLROOM WITH THREE WALLS OF WINDOWS OVERLOOKING CENTRAL PARK. LOCATED IN COLUMBUS CIRCLE’S DEUTSCHE BANK CENTER, MANDARIN ORIENTAL, NEW YORK IS IN AN IDYLLIC LOCATION JUST STEPS AWAY FROM WORLD-CLASS DINING, SHOPPING AND ENTERTAINMENT, INCLUDING THE BROADWAY THEATER DISTRICT, LINCOLN CENTER, CENTRAL PARK, JAZZ AT LINCOLN CENTER AND THE SHOPS OF COLUMBUS CIRCLE.\n\nSTRATEGIC INTENT\n\nLOOKING TO PURSUE APPLICANTS WITH EXPERIENCE IN THE LUXURY HOTEL MARKET, PREFERABLY IN BOTH LEISURE AND GROUP SALES FOR CLIENTS TO ACHIEVE MAXIMUM MARKET SHARE WITHIN THIS SEGMENT.\n\nSCOPE OF POSITION\n\nTHE CANDIDATE IS RESPONSIBLE FOR ENSURING THE HOTEL ACHIEVES MULTI-SEGMENT REVENUE GOALS BY PROACTIVELY TARGETING CURRENT ACCOUNTS AND PROSPECTING NEW HIGH VALUE ACCOUNTS IN THEIR SALES TERRITORY WHILE MANAGING EXPENSES TO BUDGET. THE INDIVIDUAL WILL OVERSEE OVERALL DAY TO DAY OPERATION, PLANNING, AND LONG-TERM OUTLOOK OF THIS SEGMENT.\n\nDUTIES AND RESPONSIBILITIES\n\nSUPPORT COMPANY’S PHILOSOPHY AND COMPANY CULTURE THROUGH THE USE OF PILLARS OF LEGENDARY QUALITY EXPERIENCE, DEPARTMENTAL LEGENDARY QUALITY EXPERIENCES ON A DAILY BASIS AND THROUGH THE USE OF GUIDING PRINCIPLES AND D.E.L.I.G.H.T AS PART OF ENSURING GUEST SATISFACTION AND THE ACHIEVEMENT OF OUR MISSION STATEMENT.ENSURE HOTEL ACHIEVES BUDGETED ANNUAL REVENUES IN THEIR TERRITORY AND SEGMENTSANALYSE AND EVALUATE CLIENT PRODUCTION AND IMPLEMENT SALES ACTION PLANSAS SUBJECT MATTER EXPERT, CONTRIBUTE TOWARDS BUDGETING PROCESS, PRODUCTION ANALYSIS AND TO FEEDBACK ON MARKET CONDITIONSACTIVELY SOLICITS NEW BUSINESS TO STEAL SHARE FROM THE COMPETITIVE SET AND ENGAGE IN CLIENT ACTIVITIES INCLUDING TRADESHOWS, ROADSHOWS, SALES CALLS, EVENTS, SITE INSPECTIONS ENTERTAINMENT, MEET & GREET, PHONE AND EMAIL SOLICITATION.UTILIZE DELPHI SYSTEM FOR ACTIVITY LOGGING AND ACCOUNT MANAGEMENT, CVENT FOR RFP MANAGEMENT AND HMS FOR HOTEL INVENTORY / RESERVATIONSWORKS CLOSELY WITH THE GLOBAL SALES TEAMS TO ENSURE REVENUE GOALS ARE ACHIEVEDWORKS WITH INTERNAL DEPARTMENTS TO ENSURE CLEAR COMMUNICATION FOR ALL VIPS AND ANY SPECIAL REQUESTS ARE MET FOR IN-HOUSE GUESTSREMAIN AVAILABLE TO HOTEL COLLEAGUES AT ALL TIMESATTEND MEETINGS AS NEEDED INCLUDING MORNING MEETING, TEAM HUDDLE, GRC, RESUME, VIP MEETING, REVENUE MEETING, AND SALES & MARKETING MONTHLY MEETINGENSURE POST TRIP REPORTS AND EXPENSE REPORTS ARE SUBMITTED IN A TIMELY MANNERPROVIDE FEEDBACK AND MARKET INFORMATION ON CHANGING MARKET CONDITIONS, INCLUDING TRENDS ON THE COMPETITION, AS A RESULT OF DIRECT SALES SOLICITATION, TELEPHONE, READING MATERIAL AND INTERACTION WITH COMPETITIVE HOTEL STAFF\n\nNOTE: THE ABOVE IS NOT AN ALL-INCLUSIVE LIST OF JOB DUTIES AND RESPONSIBILITIES. MANDARIN ORIENTAL, NEW YORK RESERVES THE RIGHT TO ADD, DELETE, CHANGE OR MODIFY THE JOB DUTIES AND RESPONSIBILITIES DESCRIBED IN THIS JOB DESCRIPTION AT ITS DISCRETION WITH NOTICE.\n\nREQUIREMENTS\n\nMANDATORY\n\nMUST HAVE A MINIMUM OF 3 YEARS’ EXPERIENCE IN LUXURY HOTEL ENVIRONMENT READING, WRITING AND ORAL PROFICIENCY IN THE ENGLISH LANGUAGEMUST BE WILLING TO WORK A FLEXIBLE SCHEDULE IN ORDER TO ACCOMPLISH ALL MAJOR RESPONSIBILITIES AND TASKS.MUST BE ABLE TO MOVE THROUGHOUT THE HOTEL TO CONDUCT SITE INSPECTIONSMUST BE ABLE TO TRAVEL ON SALES TRIPS, ROADSHOWS, TRADESHOWS AND TRAININGMUST BE A SELF-MOTIVATOR AND MOTIVATOR OF OTHERS.MUST WORK IN A SAFE, PRUDENT AND ORGANIZED MANNER.MUST HAVE MATHEMATICAL SKILLS, COMPUTER SOFTWARE APTITUDE AND HOTEL OPERATION KNOWLEDGE.MUST BE ABLE TO RELATE TO ALL LEVELS OF MANAGEMENTMUST HAVE THE ABILITY TO HANDLE MULTIPLE TASKS AT ONE TIMEMUST HAVE SUPERIOR ORGANIZATIONAL SKILLS\n\nDESIRABLE \n\nPRIOR EXPERIENCE AS A SALES MANAGER IN A LUXURY HOTEL ENVIRONMENTREADING, WRITING AND ORAL PROFICIENCY IN THE SPANISH LANGUAGE AND PORTUGUESE LANGUAGEKNOWLEDGE OF SPECIFIC HOSPITALITY INDUSTRY APPLICATIONS DELPHI, CVENT, HMS AND AGENCY360\n\nSALARY RANGE\n\n$80,000 – 95,000",
    "job_skill_set": [
      "luxury hotel experience",
      "sales management",
      "computer software aptitude",
      "hospitality industry applications",
      "communication",
      "self-motivation",
      "teamwork",
      "organizational skills",
      "problem solving",
      "customer service",
      "multitasking",
      "account management",
      "budgeting",
      "Delphi",
      "Cvent",
      "HMS",
      "mathematical skills",
      "flexibility"
    ],
    "short_keywords": [
      "account",
      "applications",
      "aptitude",
      "budgeting",
      "communication",
      "computer",
      "customer",
      "cvent",
      "delphi",
      "experience",
      "flexibility",
      "hms",
      "hospitality",
      "hotel",
      "industry",
      "leisure",
      "luxury",
      "management",
      "manager",
      "mathematical",
      "multitasking",
      "organizational",
      "problem",
      "sales",
      "selfmotivation",
      "service",
      "skills",
      "software",
      "solving",
      "teamwork"
    ]
  },
  {
    "job_id": "3890895186",
    "job_title": "Sales Manager",
    "category": "SALES",
    "job_description": "SUMMARY:\nTHE SALES MANAGER IS A ROLE MODEL FOR BUILDING AND MAINTAINING GUEST RELATIONSHIPS THAT ARE THE FOUNDATION OF THE COMPANY’S RETAIL SALES SUCCESS. THIS POSITION WILL WORK WITH THE STORE MANAGER TO DEVELOP AND LEAD RETAIL SALES ASSOCIATES IN THE IMPLEMENTATION OF THE COMPANY’S SALES APPROACH, PERFORM STORE OPERATIONS FUNCTIONS SUCH AS OPENING AND CLOSING THE STORE, AND MAINTAIN COMPLIANCE WITH THE COMPANY’S POLICIES AND OPERATING PROCEDURES TO ENSURE THE DELIVERY OF AN EXCEPTIONAL IN-STORE EXPERIENCE FOR EVERY GUEST THAT RESULTS IN INCREASED STORE SALES, PROFITABILITY AND GUEST LOYALTY.\nTHE SALES MANAGER IS RESPONSIBLE FOR COACHING SALES TECHNIQUE AND SALES PERFORMANCE FOR THE RETAIL SALES ASSOCIATES (RSA). THIS POSITION IS ALSO RESPONSIBLE FOR ENSURING THAT ALL RSAS COMPLETE AND IMPLEMENT ALL DESIGNATED TRAINING.THE SALES MANAGER IS ACCOUNTABLE FOR ASSISTING IN MEETING AND EXCEEDING GUEST SATISFACTION AND SALES TARGETS, WHICH INCLUDES SALES PER GUEST (SPG), GROSS MARGIN, (DIGITAL) NET PROMOTER SCORE ((D)NPS) AND OTHER KEY PERFORMANCE METRICS.\nRESPONSIBILITIES:CO-LEAD THE STORE RETAIL SALES ASSOCIATES IN MEETING AND EXCEEDING SALES GOALS, SALES PER GUEST (SPG), (DIGITAL) NET PROMOTER SCORE ((D)NPS) AND OTHER KEY PERFORMANCE METRICS. OPTIMIZE GUEST CONVERSION AND SALES TICKETS BY ENSURING THE DEPLOYMENT OF THE COMPANY’S SALES APPROACH.MAINTAIN A VISIBLE PRESENCE ON THE SALES FLOOR, ROLE MODELING THE SELLING PROCESS, PERSONALLY INTERACTING WITH GUESTS AND BEING IN A POSITION TO POSITIVELY IMPACT THE SALES PROCESS AND ENSURE THE COMPANY’S BRAND IS PROPERLY REPRESENTED. RESOLVE GUEST ISSUES IN A PROFESSIONAL, HELPFUL MANNER THAT STRIKES THE PROPER BALANCE BETWEEN GUEST SATISFACTION AND FINANCIAL RESPONSIBILITY TO THE COMPANY.PARTICIPATE IN DEVELOPING AND IMPLEMENTING SALES PLANS TO CREATE A CULTURE OF ACCOUNTABILITY AND TO ENSURE A CONTINUED FOCUS ON SALES PERFORMANCE AND OTHER GOAL ATTAINMENT.ENSURE COMPLIANCE WITH STORE OPERATING POLICES AND PROCEDURES, INCLUDING ADVERTISING AND PROMOTIONS, MERCHANDISE LAYOUTS, PRICING, BEGINNING AND END-OF DAY, STORE APPEARANCE, HUMAN RESOURCES, HEALTH AND SAFETY, ETC. MAINTAIN OPERATIONAL STANDARDS AND OFFICE ADMINISTRATIVE ROUTINES AND PROCESSES.USE STAFFING-TO-TRAFFIC METHODOLOGIES TO PROPERLY STAFF AND MANAGE THE SALES FLOOR; PRIORITIZE DAILY RESPONSIBILITIES AND TASKS.ANALYZE OPERATIONAL AND FINANCIAL REPORTS TO DETERMINE THE STORE’S RESULTS AND PERFORMANCE TRENDS, AND TAKE PROMPT CORRECTIVE ACTION TO REMEDY SIGNIFICANT VARIANCE.CREATE AN ENGAGING, POSITIVE WORKING ENVIRONMENT AND STRONG SELLING CULTURE; RECOGNIZE AND REWARD TOP PERFORMERS.SERVE AS THE MANAGER ON DUTY, MANAGING THE STORE IN THE ABSENCE OF THE STORE MANAGER.PARTICIPATE IN “VELOCITY WALKS” TO ASSESS AND RESPOND TO CATEGORY SALES PERFORMANCE.MAINTAIN HIGH LEVELS OF KNOWLEDGE ON ALL COMPANY PRODUCTS, PROMOTIONS AND STORE PROCEDURES.ASSIST WITH EMPLOYMENT DECISIONS AND/OR RECOMMENDATIONS ON HIRING, IMPROVEMENT PLANS, TRANSFERS, PROMOTIONS, CORRECTIVE ACTIONS, TERMINATIONS, PAY ADJUSTMENTS, ETC.COORDINATE AND MANAGE THE WORK OF EMPLOYEES BY DIRECTING MEMBERS OF THE TEAM TO MEET THE AREA’S GOALS. AUDIT REGULARLY TO ENSURE STANDARD OPERATING PROCEDURES ARE BEING ADHERED TO.MANAGE EMPLOYEE PERFORMANCE AND ASSIST EMPLOYEES IN MAKING IMPROVEMENTS TO THEIR PERFORMANCE THROUGH COACHING, MENTORING AND ADMINISTERING PERFORMANCE REVIEWS. RECOMMEND, PLAN AND/OR IMPLEMENT EMPLOYEE TRAINING AND SKILL DEVELOPMENT ACTIVITIES.AUDIT, MAINTAIN AND ENSURE EMPLOYEE TIME-KEEPING AND ABSENTEE RECORDS ARE ACCURATE.COMMUNICATE COMPANY AND DEPARTMENTAL ISSUES AND GOALS AND FACILITATE EMPLOYEE GROWTH AND DEVELOPMENT THROUGH WEEKLY TEAM MEETINGS, REGULAR INDIVIDUAL EMPLOYEE MEETINGS, COACHING, TRAINING, AND COMPANY-OFFERED LEARNING OPPORTUNITIES.DEMONSTRATE THE COMPANY’S CORE AND GROWTH VALUES IN THE PERFORMANCE OF ALL JOB FUNCTIONS.\n\nAT ASHLEY, WE’RE MORE THAN A BUSINESS…WE’RE FAMILY. AS THE LARGEST MANUFACTURER OF HOME FURNISHINGS IN THE WORLD, WE KNOW WHAT IT TAKES TO BUILD INCREDIBLE FURNITURE AND FUTURE LEADERS. WE’RE PROBLEM SOLVERS WITH THE GRIT TO PERSEVERE DURING CHALLENGING TIMES AND INNOVATORS WHO WON'T COAST WHEN TIMES ARE GOOD. WE CREATE SOLUTIONS, NOT EXCUSES. AND NEVER SETTLE FOR STATUS QUO. IT’S THE REASON WE’RE ALWAYS SEARCHING FOR BETTER WAYS TO DELIVERING AN EXCEPTIONAL CUSTOMER EXPERIENCE. THAT'S WHY ASHLEY FURNITURE IS #1 IN OUR INDUSTRY. READY TO GROW? YOU’VE COME TO THE RIGHT PLACE. ASHLEY FURNITURE HAS A “GROWTH MINDSET”, AND ONCE YOU JOIN OUR TEAM, YOU’LL LEARN FROM THE BEST IN THE BUSINESS. APPLY TODAY AND FIND YOUR HOME AT ASHLEY!\nCOMPENSATION: INDIVIDUAL COMPENSATION PACKAGES ARE BASED ON VARIOUS FACTORS UNIQUE TO EACH CANDIDATE, INCLUDING SKILL SET, EXPERIENCE, QUALIFICATIONS, AND OTHER JOB-RELATED FACTORS. \nANNUAL SALARY: $67,700-$79,000. EMPLOYEES ARE ALSO ELIGIBLE TO EARN MONTHLY, QUARTERLY, AND ANNUAL INCENTIVES BASED UPON STORE SALES; ACCORDING TO HISTORICAL DATA, IF STORE SALES TARGETS ARE MET, EMPLOYEES CAN EXPECT TO RECEIVE BETWEEN $17,250 AND $30,000, DEPENDING UPON STORE SALES VOLUME. \nPROFIT SHARING IS AVAILABLE TO ELIGIBLE EMPLOYEES; THIS DISCRETIONARY PROGRAM IS DEPENDENT ON THE PROFITABILITY OF THE COMPANY. \nBENEFITS: WHEN YOU JOIN OUR FAMILY, YOU ARE ELIGIBLE TO PARTICIPATE IN OUR COMPREHENSIVE BENEFITS PROGRAMS WHICH INCLUDES HEALTH, DENTAL, VISION, LIFE/DISABILITY, FLEXIBLE SPENDING ACCOUNTS, 401(K), PAID HOLIDAYS, 80 HOURS PAID VACATION AND 40 HOURS OF CALIFORNIA PAID SICK LEAVE. BENEFITS MAY VARY BASED ON POSITION AND LOCATION, SO WE ENCOURAGE YOU TO SPEAK WITH THE RECRUITING TEAM DURING THE INTERVIEW PROCESS. \nASHLEY VALUES ITS DIVERSITY AND IS PROUD TO BE AN EQUAL OPPORTUNITY EMPLOYER. ALL EMPLOYMENT DECISIONS ARE MADE ON THE BASIS OF AN INDIVIDUAL’S SKILLS, QUALIFICATIONS, MERIT, AND BUSINESS NEED.",
    "job_skill_set": [
      "sales techniques",
      "store operations",
      "performance metrics analysis",
      "staff management",
      "employee training",
      "customer relationship management",
      "financial reporting",
      "time-keeping management",
      "leadership",
      "communication",
      "problem solving",
      "teamwork",
      "coaching",
      "mentoring",
      "customer service",
      "adaptability",
      "engagement",
      "motivation",
      "compliance management",
      "merchandise layout"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "coaching",
      "communication",
      "compliance",
      "customer",
      "employee",
      "engagement",
      "financial",
      "layout",
      "leadership",
      "management",
      "manager",
      "mentoring",
      "merchandise",
      "metrics",
      "motivation",
      "operations",
      "performance",
      "problem",
      "relationship",
      "reporting",
      "sales",
      "service",
      "solving",
      "staff",
      "store",
      "teamwork",
      "techniques",
      "timekeeping",
      "training"
    ]
  },
  {
    "job_id": "3904392403",
    "job_title": "In House Vacation Sales Concierge (Phones) *$2,000 Sign-on Bonus Potential!",
    "category": "SALES",
    "job_description": "*$2,000 SIGN ON BONUS POTENTIAL*\n\n$1,000 PAID AFTER 45 DAYS$1,000 PAID AFTER SIX MONTHS OF EMPLOYMENTELIGIBILITY: MUST HAVE WORKED IN THE TIMESHARE INDUSTRY FOR AT LEAST ONE YEAR\n\nMARRIOTT VACATION CLUB®, A LEADER IN THE VACATION OWNERSHIP INDUSTRY, IS SEEKING MOTIVATED INDIVIDUALS WITH CONCIERGE AND TELEMARKETING EXPERIENCE TO JOIN OUR AWARD-WINING SALES AND MARKETING TEAM. WE ARE CURRENTLY LOOKING FOR DRIVEN INDIVIDUALS WITH OUTGOING PERSONALITIES WHO ARE FINANCIALLY MOTIVATED TO WORK WITH GUESTS IN MARRIOTT VACATION CLUB PROPERTIES TO PROMOTE THE MARRIOTT VACATION CLUB DESTINATIONS® PROGRAM.\n\nWHAT'S IN IT FOR YOU? \n\nHOTEL AND RESORT DISCOUNTS IMMEDIATE 401(K) COMPANY MATCH UP TO 6% UNCAPPED EARNING POTENTIAL (WAGES, MONTHLY INCENTIVES, ANNUAL BONUSES, CONTESTS) POSITIVE WORK ENVIRONMENT GROWTH AND DEVELOPMENT OPPORTUNITIES \n\nWHAT YOU WILL DO? \n\nMAKE PRE- AND POST-ARRIVAL TELEMARKETING CALLS WHILE OFFERING ELEVATED CONCIERGE SERVICES TO ALL ARRIVING OWNERS AND GUESTS. SCHEDULE SALES PRESENTATIONS AND MANAGE CUSTOMER EXPECTATIONS. PROVIDE THE HIGHEST LEVEL OF SERVICE TO EXCEED BUDGETED SALES PRESENTATIONS AND VOLUME PRODUCTION GOALS. ENSURE THAT ALL OWNERS AND GUESTS ATTENDING A SALES PRESENTATION MEET ELIGIBILITY REQUIREMENTS AND ARE OPEN TO LEARNING MORE ABOUT MARRIOTT VACATION CLUB PRODUCTS AND SERVICES. \n\nWHAT ARE THE REQUIREMENTS?\n\nENJOY TALKING ON THE PHONE AND/OR INTERACTING WITH GUESTS IN PERSON BOLD PERSUASION SKILLS COMPUTER SKILLS STAND, SIT AND WALK FOR EXTENDED PERIODS OF TIME FLEXIBLE SCHEDULE INCLUDING WEEKENDS AND HOLIDAYS CONCIERGE, TELEMARKETING AND/OR SALES EXPERIENCE PREFERRED \n\nMARRIOTT VACATIONS WORLDWIDE IS AN EQUAL OPPORTUNITY EMPLOYER COMMITTED TO HIRING A DIVERSE WORKFORCE AND SUSTAINING AN INCLUSIVE CULTURE.",
    "job_skill_set": [
      "telemarketing",
      "sales experience",
      "computer skills",
      "persuasion",
      "communication",
      "customer service",
      "flexibility",
      "motivation",
      "concierge services"
    ],
    "short_keywords": [
      "2000",
      "bonus",
      "communication",
      "computer",
      "concierge",
      "customer",
      "experience",
      "flexibility",
      "house",
      "in",
      "motivation",
      "persuasion",
      "phones",
      "potential",
      "sales",
      "service",
      "services",
      "signon",
      "skills",
      "telemarketing",
      "vacation"
    ]
  },
  {
    "job_id": "3901949867",
    "job_title": "Sales Account Executive",
    "category": "SALES",
    "job_description": "LOOKING TO BUILD YOUR CAREER AND DESIGN YOUR FUTURE? YOU HAVE COME TO THE RIGHT PLACE. \n\nDESCRIPTIVE SUMMARY\n\nTHE SALES ACCOUNT EXECUTIVE (AE) WILL FOCUS ON DEVELOPING, NURTURING, AND EXPANDING A SINGLE-FAMILY BUILDER ACCOUNT BASE TO DEVELOP A ROBUST SALES PIPELINE AND ACHIEVE BUDGETED SALES GOALS. TO BE SUCCESSFUL IN THIS ROLE, THE CANDIDATE WILL ACTIVELY PROSPECT AND CONTRACT NEW BUSINESS TO MEET BOTH TOP LINE AND GROSS MARGIN GOALS OF THE ASSIGNED TERRITORY. THE IDEAL CANDIDATE WILL BE A PROACTIVE GO-GETTER, RELATIONSHIP BUILDER, AND WILL CONSISTENTLY MEETING GROSS MARGIN TARGETS TO POSITIVELY IMPACT COMPANY GROWTH.\n\nESSENTIAL FUNCTIONS\n\nACHIEVE AND EXCEED SALES TARGETS AND TARGETED KPI’S SET BY ILG LEADERSHIP.UTILIZE SALESFORCE.COM SYSTEM TO VALUE, TRACK, CONVERT SALES OPPORTUNITIES AND TO DEVELOP AND CONTRACT NEW BUSINESS THROUGH LEAD GENERATION, OPPORTUNITY IDENTIFICATION, AND OPPORTUNITY CONVERSION.DEVELOP AND MAINTAIN STRONG RELATIONSHIPS WITH EXISTING ACCOUNTS, BUILDERS, CONTRACTORS, AND KEY STAKEHOLDERS, ENSURING CUSTOMER SATISFACTION, AND FOSTERING LONG-TERM PARTNERSHIPS.MAINTAIN TARGETED GROSS MARGIN PERCENTAGE(S) FOR THE ACCOUNT PORTFOLIO, MEETING OR EXCEEDING BRANCH PROFITABILITY TARGETS.LEVERAGE DEFINED BEHAVIORS TO ACHIEVE SPECIFIC OBJECTIVES AND MEASURES FOR THE ROLE, TO INCLUDE: BUSINESS PLANNING, WINNING IN SINGLE-FAMILY, MULTI-FAMILY, DESIGN, AND TECHNOLOGY SALES.CONDUCT QUARTERLY BUSINESS REVIEWS AT TOP ACCOUNTS WITH SENIOR MANAGEMENT, REPORT ON YTD PROGRESS VS REVENUE, AND KEY FOCUS AREAS IDENTIFIED IN YOUR BUSINESS PLAN. MANAGE PRICING ACTIONS, PRODUCT EXPANSION, AND MERCHANDISING PRODUCT ASSORTMENTS.PREPARE BIDS, TAKE-OFFS, JOB CHANGE ORDERS, AND PROFESSIONAL SALES PRESENTATIONS.NEGOTIATE PRICING AND TERMS OF SALE TO CLOSE DEALS AND ACHIEVE SALES TARGETS.COLLABORATE WITH CUSTOMERS TO IDENTIFY THEIR NEEDS AND RECOMMEND APPROPRIATE PRODUCTS AND SERVICES.STAY UPDATED ON INDUSTRY DEVELOPMENTS, COMPETITOR ACTIVITIES, AND MARKET TRENDS TO IDENTIFY GROWTH OPPORTUNITIES AND MAINTAIN A COMPETITIVE EDGE.ENSURE TIMELY CONTRACT EXECUTION AND COMPLETION, INCLUDING NECESSARY CHANGES DUE TO PRICING.PROVIDE NECESSARY INFORMATION TO INTERNAL TEAMS SUCH AS DESIGN CONSULTANTS AND PRODUCTION MANAGERS.MAINTAIN BID FOLDERS FOR FUTURE UPDATES AND MANAGE INTERNAL BILLING INQUIRIES AND SPEC CHANGES.ASSIST IN THE CONVERSION OF NEW BUILDER DIVISIONS TO ILG PROPRIETARY DESIGN SOFTWARE, DESIGN MY HOME.SERVE AS AN ADVOCATE WITH COLLECTION EFFORTS WHEN NECESSARY.FLEXIBLE TO CHANGE, QUICKLY EMBRACING NEW JOB DUTIES AS ASSIGNED THROUGHOUT THE YEAR.\n\n\nEDUCATION & EXPERIENCE\n\nCOLLEGE DIPLOMA OR EQUIVALENT REQUIRED.PROVEN TRACK RECORD OF SUCCESS IN OUTSIDE SALES, WITH AT LEAST 3-5 YEARS OF EXPERIENCE IN B2B SALES OR RELEVANT INDUSTRY.KNOWLEDGE OF CONSTRUCTION, BUILDING MATERIALS, OR MANUFACTURING IS HIGHLY DESIRABLE – SALES TO SINGLE FAMILY BUILDERS STRONGLY PREFERRED.ABILITY TO BUDGET, FORECAST, AND CREATE DEFINED BUSINESS PLANS TO ATTACK ASSIGNED MSA’S.ABILITY TO UNDERSTAND BLUEPRINTS RELATED TO BUILDER’S FLOOR PLANS STRONGLY PREFERRED.EXCELLENT COMMUNICATION SKILLS, WITH ABILITY TO RESOLVE CONFLICTS AND ISSUES PROFESSIONALLY.STRONG ORGANIZATIONAL SKILLS TO TRACK AND MANAGE ALL ASPECTS OF THE ORDERING AND PRODUCTION PROCESS.ABILITY TO WORK EFFECTIVELY IN A FAST-PACED ENVIRONMENT, MEETING DEADLINES CONSISTENTLY.OWNERSHIP MENTALITY AND ABILITY TO BUILD AND MAINTAIN INTERPERSONAL RELATIONSHIPS.EXCELLENT NEGOTIATION AND PERSUASION ABILITIES, WITH A RESULTS-ORIENTED MINDSET.SELF-MOTIVATED AND DRIVEN TO ACHIEVE AND EXCEED SALES TARGETS.PROFICIENCY IN USING CRM SOFTWARE (SALESFORCE PREFERRED), POWERPOINT, EXCEL AND THE BALANCE OF THE MICROSOFT OFFICE SUITE.SALESFORCE.COM USE IN A PRIOR ROLE PREFERRED.\n\n\nIF YOU LIKE WORKING WITH A GROWING CLOSE KNIT TEAM AND HELPING HOME OWNERS DESIGN THE HOME OF THEIR DREAMS, COME BUILD YOUR CAREER WITH US!\n\nALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, INDIVIDUAL WITH DISABILITIES, VETERAN STATUS, GENDER IDENTITY OR NATIONAL ORIGIN.",
    "job_skill_set": [
      "Microsoft Office Suite",
      "Communication",
      "Relationship Building",
      "Self-Motivation",
      "Organizational Skills",
      "Problem Solving",
      "Teamwork",
      "Conflict Resolution",
      "Results-Oriented Mindset",
      "Interpersonal Skills",
      "Salesforce",
      "B2B Sales",
      "Negotiation",
      "CRM Software",
      "Blueprint Understanding",
      "Business Planning",
      "Sales Presentations",
      "Market Analysis",
      "Lead Generation",
      "Flexibility"
    ],
    "short_keywords": [
      "account",
      "analysis",
      "b2b",
      "blueprint",
      "building",
      "business",
      "communication",
      "conflict",
      "crm",
      "executive",
      "flexibility",
      "generation",
      "interpersonal",
      "lead",
      "market",
      "microsoft",
      "mindset",
      "negotiation",
      "office",
      "organizational",
      "planning",
      "presentations",
      "problem",
      "relationship",
      "resolution",
      "resultsoriented",
      "sales",
      "salesforce",
      "selfmotivation",
      "skills",
      "software",
      "solving",
      "suite",
      "teamwork",
      "understanding"
    ]
  },
  {
    "job_id": "3905243514",
    "job_title": "Salesforce Technical Lead/ Architect",
    "category": "SALES",
    "job_description": "JD:\nUNDERSTANDS SALESFORCE ARCHITECTURE OPTIONS, DESIGN TRADE-OFFS, AND HAS THE ABILITY TO COMMUNICATE DESIGN CHOICES BASED ON SALESFORCE BEST PRACTICES.ABILITY TO REVIEW THE APEX CODE AND PROVIDE INPUTS AND RECOMMENDATIONS TO DEVELOPERS.AWARE OF GLOBALIZATION (MULTI-LANGUAGE, MULTI-CURRENCY) APPLICATION DESIGN CONSIDERATIONS ON A PROJECT.ABLE TO IDENTIFY DEVELOPMENT-RELATED RISKS, CONSIDERATIONS, AND LIMITS FOR THE PLATFORM.EXPERIENCE WITH DIFFERENT TYPES OF DEVELOPMENT PATTERNS/PRINCIPLES.AWARE OF PLATFORM-SPECIFIC DESIGN PATTERNS AND KEY LIMITS.FAMILIARITY WITH CODE DEVELOPMENT ON THE FORCE.COM PLATFORM.UNDERSTANDS OBJECT-ORIENTED DESIGN PATTERNS.EXPERIENCE WITH PROJECT AND DEVELOPMENT LIFECYCLE METHODOLOGIES.EXPERT IN BUILDING COMPONENTS WITH LIGHTNING EXPERIENCE IN AURA FRAMEWORKSTRONG, PRESENTATION AND CUSTOMER RELATIONSHIP SKILLSEXPERIENCE IN SOQL & SOSL WITH CONSIDERATION TO GOVERNOR LIMITS FOR DATA MANIPULATION USING PLATFORM DATABASE OBJECTSEXPERIENCE IN ONE-WAY INTEGRATION AND BIDIRECTIONAL INTEGRATION OF APPEXCHANGE APPLICATION WITH SALESFORCE.EXPERIENCE IN SYSTEM INTEGRATION USING WEB SERVICES API – SOAP API, REST API.HANDS ON EXPERIENCE IN TESTING APEX CLASSES USING TEST CLASSES AND DEBUGGING APEX CLASSES AND TRIGGERS.ABILITY TO GUIDE ON SALESFORCE DATA MODEL AND SECURITY ASPECTS LIKE OWD, PROFILES AND ROLES.PROVIDES EXPERIENCED GUIDANCE ON THE APPROPRIATE CHOICE REGARDING INTEGRATION IMPLEMENTATION WITH NFR CONSIDERATION.ABLE TO IDENTIFY DEVELOPMENT-RELATED RISKS, CONSIDERATIONS, AND LIMITS FOR THE PLATFORM.FAMILIARITY WITH CODE DEPLOYMENT PROCESS ON THE FORCE.COM PLATFORM.RESPONSIBLE FOR DOCUMENTING DESIGN.EXPERIENCE WITH PROJECT AND DEVELOPMENT LIFECYCLE METHODOLOGIESUNDERSTANDS STRATEGIES TO BUILD AN OPTIMIZED AND PERFORMANT SOLUTIONABLE TO PROVIDE INPUTS ON LARGE DATA VOLUME, PERFORMANCE TUNING ETC. FOR LARGE BUSINESS APPLICATIONS.FOCUSED ON OVERALL SOLUTION AND PROVIDE INPUTS ON CONNECTED PIECES IN THE SYSTEM.HAS HELD A TECHNICAL ARCHITECT ROLE ON MULTIPLE COMPLEX SYSTEM DESIGN OR HAS GAINED EQUIVALENT KNOWLEDGE THROUGH PARTICIPATION AND EXPOSURE TO THESE TYPES OF PROJECTSKNOWLEDGE OF ENTERPRISE APPLICATION INTEGRATION AND COMMON TOOLS AND CONCEPTS USED IN SALESFORCE IMPLEMENTATION.ABLE TO TIMELY HIGHLIGHT THE DATA MIGRATION AND NFR SPECIFIC RISKS AND SUGGEST ALTERNATE SOLUTIONS.HIGHER CERTIFICATE IN SFDC PLATFORM",
    "job_skill_set": [
      "Communication",
      "Customer Relationship Management",
      "Problem Solving",
      "Documentation",
      "Team Leadership",
      "Risk Management",
      "Salesforce Architecture",
      "Apex Code Review",
      "Globalization Design",
      "Development Patterns",
      "Force.com Development",
      "Object-Oriented Design",
      "SOQL & SOSL",
      "Integration (SOAP API, REST API)",
      "Testing APEX Classes",
      "Salesforce Data Model",
      "Integration Implementation",
      "Code Deployment Process",
      "Performance Tuning",
      "Enterprise Application Integration",
      "Data Migration",
      "Salesforce Certification"
    ],
    "short_keywords": [
      "apex",
      "api",
      "application",
      "architect",
      "architecture",
      "certification",
      "classes",
      "code",
      "communication",
      "customer",
      "data",
      "deployment",
      "design",
      "development",
      "documentation",
      "enterprise",
      "forcecom",
      "globalization",
      "implementation",
      "integration",
      "lead",
      "leadership",
      "management",
      "migration",
      "model",
      "objectoriented",
      "patterns",
      "performance",
      "problem",
      "process",
      "relationship",
      "rest",
      "review",
      "risk",
      "sales",
      "salesforce",
      "soap",
      "solving",
      "soql",
      "sosl",
      "team",
      "technical",
      "testing",
      "tuning"
    ]
  },
  {
    "job_id": "3902358002",
    "job_title": "Sales Account Manager",
    "category": "SALES",
    "job_description": "WE ARE LOOKING FOR A SALES ACCOUNT MANAGER TO ADD TO OUR AMAZING TEAM IN GRAPEVINE, TX!\nCHICKEN N PICKLE, THE HOTTEST ENTERTAINMENT CONCEPT IN TOWN, IS LOOKING FOR A SALES ACCOUNT MANAGER. OUR BRAND IS THAT OF A RAMBUNCTIOUS, MULTI-GENERATIONAL FAMILY THAT WORKS HARD AND PLAYS EVEN HARDER. WE ARE DRIVEN TO PROVIDE OUR EMPLOYEES WITH A SUPPORTIVE, MEANINGFUL WORK ENVIRONMENT BY BRINGING ALL VOICES TO THE TABLE AND PROVIDING OPPORTUNITIES FOR MENTORSHIP WITH CAREER GROWTH. WE ARE LOOKING FOR INDIVIDUALS TO HELP GROW OUR CONCEPT. \nAS A SALES ACCOUNT MANAGER, YOU’LL BUILD STRONG COMMUNITY PARTNERSHIPS, NETWORK, AND STRATEGIZE WITH OUR GUESTS ON BUILDING A LASTING EXPERIENCE AT CHICKEN N PICKLE. AS A SUCCESSFUL SALES ACCOUNT MANAGER, YOU WILL HAVE THE FOLLOWING EXPERIENCES: ACCOUNT MANAGEMENT, BUSINESS DEVELOPMENT, MARKET RESEARCH, SALES PROSPECTING, PUBLIC RELATIONS, CUSTOMER RELATIONSHIP MANAGEMENT, EVENT PLANNING COORDINATION, LOGISTICS OVERSIGHT, REVENUE MANAGEMENT ALONG WITH EXPERT COMMUNICATION SKILLS. IF YOU ARE A CURRENT B2B SALES LEADER CAPABLE OF SHOWING OTHERS THE INFLUENCE AND FINESSE OF SALES AND LOVE THE OPPORTUNITY TO CREATE AN AWESOME GUEST EXPERIENCE, WE’D LOVE TO HEAR FROM YOU! \nRESPONSIBILITIES…. EMBODY CHICKEN N PICKLE’S CORE VALUES: AUTHENTICITY, COMMUNITY, CONNECTION, INTEGRITY AND QUALITY DEMONSTRATES AND SUPPORTS A CULTURE OF DIVERSITY, EQUITY AND INCLUSIONPROACTIVELY ENGAGES IN OUTBOUND SALES ACTIVITY AND NETWORKING IN THE COMMUNITY TO ESTABLISHED BUSINESS DEVELOPMENT STANDARDS FOR THE VENUE TO GROW SALES REVENUES FOR PRIVATE EVENTS MARKET RESEARCH TO DEVISE STRATEGIES TO GENERATE AND DEVELOP NEW BUSINESS BY KNOWING THE LOCAL BUSINESSES, CHAMBERS AND ASSOCIATIONS WORK WITH THE TOP BUSINESSES IN THE MARKET TO FOSTER CLIENT RELATIONSHIPS THROUGH ONGOING COMMUNICATION WITH CONTACTS ENSURING REPEAT BUSINESS, REFERRALS AND TO GROW ACCOUNTS WORK WITH CHAMBERS, VISITOR’S BUREAU, SPORTS COMMISSIONS, THIRD PARTY EVENT PLANNERS, CONVENTION CENTERS, ETC. TO FIND NEW OPPORTUNITIESSTRATEGICALLY NEGOTIATE TO CLOSE EVENT SALES INCLUSIVE OF CREATING ESTIMATES, PROPOSALS, UPSELLING, SITE TOURS, FOOD TASTINGS, MEETINGS, LUNCHES, ETC.CONTRIBUTE TO THE OVERALL SALES TEAM GOALS BY MEETING AND EXCEEDING PERSONAL QUOTASUTILIZE AND CREATE REPORTS AND DASHBOARDS TO ENSURE PERSONAL AND DEPARTMENT KEY PERFORMANCE INDICATORS (KPI’S) ARE BEING MET OR EXCEEDEDPERFORM REVENUE FORECASTS AND WIN/LOSS ANALYSIS TO MEASURE AGAINST QUOTAS MANAGE CUSTOMER RELATIONSHIPS FOR ALL KEY ACCOUNTSMANAGE ALL LEADS WITH A SENSE OF URGENCY, ACCURACY AND PROFESSIONALISM CREATE, MANAGE AND CONFIRM EVENT BOOKINGS WITHIN CRM SYSTEM INCLUDING THE DOCUMENTATION OF ALL PROSPECT AND EVENT CLIENT COMMUNICATION WITH GREAT ATTENTION TO DETAILACT AS A POINT OF CONTACT TO KEY ACCOUNTS AS THEY ARRIVE FOR THEIR EVENTSMONITOR, TRACK AND FOLLOW UP ON LEADS ALONG TENTATIVE BOOKINGSCALL UPON CONTACTS TO SEE WHAT WENT WELL AND WHAT COULD BE IMPROVEDFOSTER CLIENT RELATIONSHIPS THROUGH ONGOING COMMUNICATION TO ENSURE REPEAT BUSINESS OR REFERRALSCOLLABORATE ON CREATING SALES CAMPAIGNS FOCUSED ON CONTINUING TO BUILD AND NURTURE RELATIONSHIPS THAT WILL DRIVE REPEAT SALES AID IN MAINTAINING APPROVED VENDOR LIST FOR A VARIETY OF NEEDS TO ENSURE SUCCESSFUL PRIVATE AND PROPERTY WIDE EVENTS MARKET PROPERTY WIDE THEMED EVENTS TO CLIENTS TO GET THEM ON PROPERTY TO EXPERIENCE CHICKEN N PICKLEMAINTAIN FOCUS ON LOCATION AND COMPANY STRATEGIC GOALS ENSURE THE TEAM IS BOOKING SPACE ON THE PROPERTY WITHIN THE DOCUMENTED GUIDELINESFRIENDLY, POSITIVE, OUTGOING PERSONALITY WHO RELATES WELL AND GETS ALONG WITH PEOPLE COMMUNICATION:COMMUNICATE WITH THE EVENT HOSTESS AND EVENT MANAGER ON EVENT DETAILS, CHANGES/UPDATES TO ALLOW FOR A SUCCESSFUL EVENT EXECUTION BY OPERATIONS AND THE CULINARY TEAMMAINTAIN AND ENSURE THE BEOS HAVE ALL THE REQUIRED INFORMATIONATTENDANCE IN BEO/OPERATIONS MEETINGS CHARACTER TRAITS:MANAGE AN INDEPENDENT WORK SCHEDULE WITH INTEGRITY AND AS EXPECTEDEAGER TO LEARN NEW SALES SKILLSCONTRIBUTE TO A COLLABORATIVE ENVIRONMENT WITH THE SALES TEAM AND OTHER DEPARTMENTS WITHIN THE RESTAURANTMAINTAIN A CALM, EVEN-TEMPERED, CUSTOMER-FOCUSED DEMEANORUNDERSTAND PROCESSES AND THE ABILITY TO FIND INFORMATION QUICKLYABILITY TO WORK FOR AND LEAN INTO A START-UP MENTALITY\nKEY QUALIFICATIONS…. 5+ YEARS PREVIOUS SALES EXPERIENCE IN HOSPITALITY, RESTAURANT OR ENTERTAINMENT VENUE FOCUS ON EVENT SALES, PREFERRED STRONG CONSULTATIVE SALES EXPERIENCE ABILITY TO WORK IN A FAST-PACED AND FLUID ENVIRONMENT EXCELLENT SELF-ACCOUNTABILITY FOR HIGH PERSONAL STANDARDS OF CONDUCT AND PROFESSIONALISM ABILITY TO COMMUNICATE EFFECTIVELY WITH GUESTS, RETURN GUESTS, CO-WORKERS AND MANAGEMENT FLEXIBLE IN APPROACH; CAN READILY ADAPT TO BUSINESS AND TEAM NEEDS AND CHANGES EXCELLENT INTERPERSONAL AND PEOPLE SKILLS AS WELL AS VERBAL AND WRITTEN COMMUNICATION SKILLS EXCELLENT COMPUTER SKILLS AND ABILITY TO LEARN NEW SOFTWARE PROGRAMS ABILITY TO WORK EVENINGS, WEEKENDS AND HOLIDAYS AND IN THE RESTAURANT ON AN AS-NEEDED BASISABILITY TO TRAVEL AND MEET FACE-TO-FACE WITH POTENTIAL AND EXISTING GUESTS BACHELOR’S DEGREE IN SALES/MARKETING OR BUSINESS, PREFERRED",
    "job_skill_set": [
      "account management",
      "business development",
      "sales prospecting",
      "customer relationship management",
      "event planning coordination",
      "computer skills",
      "communication",
      "interpersonal skills",
      "teamwork",
      "adaptability",
      "problem solving",
      "integrity",
      "customer-focused demeanor",
      "self-accountability",
      "collaboration",
      "positive attitude",
      "market research",
      "public relations",
      "logistics oversight",
      "revenue management",
      "CRM systems"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "attitude",
      "business",
      "collaboration",
      "communication",
      "computer",
      "coordination",
      "crm",
      "customer",
      "customerfocused",
      "demeanor",
      "development",
      "event",
      "integrity",
      "interpersonal",
      "logistics",
      "management",
      "manager",
      "market",
      "oversight",
      "planning",
      "positive",
      "problem",
      "prospecting",
      "public",
      "relations",
      "relationship",
      "research",
      "revenue",
      "sales",
      "selfaccountability",
      "skills",
      "solving",
      "systems",
      "teamwork"
    ]
  },
  {
    "job_id": "3886879562",
    "job_title": "Salesforce Developer",
    "category": "SALES",
    "job_description": "ROLE RESPONSIBILITIES:• DEVELOPMENT AND TESTING TO REQUIREMENTS• CONFIDENT PRESENTING OPTIONS AND DESIGNS TO BUSINESS AND TECHNOLOGY STAKEHOLDERS• ANALYSE, REVIEW AND DOCUMENT BUSINESS, FUNCTIONAL, AND TECHNICAL REQUIREMENTS• DOCUMENT AND DEVELOP CODE ACCORDING TO SPECIFICATIONS AND STANDARDS• PREPARE TEST DATA AND PLAN AND CONDUCT BASIC UNIT OR MODULE TESTING• PROVIDE SUPPORT FOR QUALITY ASSURANCE TESTING AND DEFECT RESOLUTION• PARTICIPATE IN PROJECT TEAM MEETINGS AND COMMUNICATE EFFECTIVELY WITH INTERNAL AND CLIENTPEERS, ARCHITECTS, SYSTEM ANALYSTS, BUSINESS ANALYSTS, PROJECT MANAGERS, QUALITY CONTROL, ANDACROSS OTHER TECHNOLOGY TEAM BOUNDARIES, REPORTING PROJECT STATUS AS REQUIRED• SUPPORT ALPHA’S INTERNAL PRODUCT/ACCELERATOR DEVELOPMENT• ABILITY TO MENTOR AND COACH TEAM MEMBERS• SENIOR STAKEHOLDER MANAGEMENT AND INFLUENCING SKILLS DEMONSTRATED BOTH WITH CLIENTS ANDCOLLEAGUES• FOCUS ON TEAM ACHIEVEMENT, NOT JUST INDIVIDUAL GOALS• SUPERB INTERPERSONAL SKILLS, WITH ABILITY TO INFLUENCE AND LEAD• WILLINGNESS TO TRAVEL AND BUSINESS LANGUAGE FLUENCY IN ENGLISHROLE REQUIREMENTS (SKILLS, EXPERIENCE AND QUALIFICATIONS):• 2+ YEARS’ EXPERIENCE AS A SALESFORCE DEVELOPER, IDEALLY IN A CONSULTANCY OR SALESFORCE PARTNER,INCLUDING:• CONFIGURATION OF OBJECTS AND FIELDS, PAGE LAYOUTS, WORKFLOW RULES, APPROVAL PROCESSES, PROCESS BUILDER,ROLES, PROFILES AND SHARING RULES• CODE DEVELOPMENT OF LIGHTNING COMPONENTS, VISUALFORCE PAGES, CUSTOM CONTROLLERS, TRIGGERS, BATCHPROCESSES, CUSTOM SOAP/REST WEB SERVICES• UNDERSTANDING OF OBJECT-ORIENTED PRINCIPLES AND PATTERNS• UNDERSTANDING OF DATABASE DESIGN PRINCIPLES• EXPERIENCE OF AN AGILE ENVIRONMENT• AN INTEREST IN FINANCIAL SERVICES, AND THE ASSET & WEALTH MANAGEMENT INDUSTRY• AN EXEMPLARY ACADEMIC BACKGROUND INCLUDING A MINIMUM OF A 2:1 DEGREE FROM A LEADING INSTITUTION• LIGHTNING AND APEX DEVELOPMENT, PLATFORM I CERTIFIED, PREFERABLY PLATFORM II CERTIFIED• INTERMEDIATE JAVASCRIPT• INTERMEDIATE HTML AND CSS SKILLS• EXCELLENT FACE TO FACE AND WRITTEN COMMUNICATION SKILLS• EXPERIENCE WITH THE FOLLOWING WOULD ALSO BE AN ADVANTAGE• MS DYNAMICS• .NET EXPERIENCE• SQL (MSSQL OR OTHER)• MARKETING AUTOMATION: PARDOT, MARKETING CLOUD, MARKETO, ELOQUA• ETL: TALEND, BOOMI, INFORMATICA• CMS: ADOBE EXPERIENCE MANAGER, SITECORE• CI / BUILD SYSTEMS: JENKINS, BAMBOO, GITHUB, AZURE DEVOPS• LOW CODE PLATFORMS: MENDIX, OUTSYSTEMS• RPA: BLUE PRISM• WORKFLOW: K2, BOOMI FLOW• IOS AND/OR ANDROID MOBILE DEVELOPMENT",
    "job_skill_set": [
      "Communication",
      "Teamwork",
      "Interpersonal Skills",
      "Problem Solving",
      "Adaptability",
      "Salesforce Development",
      "Lightning Components",
      "Visualforce Pages",
      "Apex Development",
      "JavaScript",
      "HTML",
      "CSS",
      "SQL",
      "Agile Methodology",
      "Database Design Principles",
      "ETL Tools",
      "CMS",
      "CI/CD Systems",
      "Low Code Platforms",
      "RPA",
      "Mobile Development",
      "Mentoring",
      "Stakeholder Management",
      "Influencing Skills"
    ],
    "short_keywords": [
      "adaptability",
      "agile",
      "apex",
      "cicd",
      "cms",
      "code",
      "communication",
      "components",
      "css",
      "database",
      "design",
      "developer",
      "development",
      "etl",
      "html",
      "influencing",
      "interpersonal",
      "javascript",
      "lightning",
      "low",
      "management",
      "mentoring",
      "methodology",
      "mobile",
      "pages",
      "platforms",
      "principles",
      "problem",
      "rpa",
      "sales",
      "salesforce",
      "skills",
      "solving",
      "sql",
      "stakeholder",
      "systems",
      "teamwork",
      "tools",
      "visualforce"
    ]
  },
  {
    "job_id": "3904963149",
    "job_title": "Sales Associate / Jewelry Consultant - Kay Jewelers - Westland Mall - Hialeah, FL",
    "category": "SALES",
    "job_description": "WE HAVE MANY OPPORTUNITIES AVAILABLE ON OUR OTHER CAREER SITE PAGES. CLICK HERE TO LINK TO OUR CAREERS PAGE!\n\nAT KAY, WE KNOW THAT LOVE IS UNSTOPPABLE. WHICH IS WHY WE’RE DEVOTED TO HELPING CUSTOMERS CELEBRATE LIFE AND EXPRESS LOVE IN WAYS EVERY BIT AS DYNAMIC AS THEY ARE MEMORABLE. FROM CLASSIC MUST-HAVES TO THE LATEST TRENDS, OUR SELECTION OF QUALITY, RESPONSIBLY-SOURCED JEWELRY HAS BECOME PART OF SO MANY LOVE STORIES OVER THE LAST CENTURY. KAY JEWELERS IS PART OF SIGNET JEWELERS, A PURPOSE-DRIVEN COMPANY WHO BELIEVES LOVE INSPIRES LOVE. SIGNET IS ALSO “GREAT PLACE TO WORK-CERTIFIED”™. THERE ARE DYNAMIC CAREER PATHS AWAITING YOU – REWARDING OPPORTUNITIES TO IMPACT THE LIVES OF OTHERS AND INSPIRE LOVE. JOIN US!\n\nKAY JEWELERS IS NOW HIRING SEASONAL, PART-TIME, AND FULL-TIME TEAM MEMBERS!\n\nALSO APPLY FOR OUR NEW CONCIERGE POSITION FOR THE HOLIDAY SEASON. SEASONAL SALES SUPPORT TO ASSIST WITH CONSISTENT DELIVERY OF EXCELLENT CUSTOMER SERVICE, OPERATIONAL STANDARDS, AND COMPLIANCE IN ALL AREAS OF OPERATIONAL ACTIVITY. SUPPORTS THE CREATION OF A CUSTOMER FIRST CULTURE IN BY TAKING OWNERSHIP AND CONTROL OF THE DAY TO DAY CUSTOMER TRAFFIC, LINE QUEUE, AND ADMINISTRATIVE DUTIES OF THE STORE AND TO ACHIEVE AND MAINTAIN THE HIGHEST LEVEL OF EFFICIENCY, SAFETY, AND SECURITY.\n\nDO YOU THRIVE ON BUILDING PERSONAL RELATIONSHIPS THAT WILL LAST A LIFETIME? JOIN OUR TEAM TODAY TO HELP OUR CUSTOMERS CELEBRATE LIFE AND EXPRESS LOVE!\n\nYOUR ROLE AT KAY JEWELERS\n\nAS A PART OF OUR SALES TEAM YOU ARE RESPONSIBLE FOR PROVIDING A SUPERIOR EXPERIENCE TO OUR VALUED CUSTOMERS. IN ADDITION, YOU WILL:\n\n ENGAGE CUSTOMERS IN CONVERSATION TO UNDERSTAND THEIR NEEDS AND DESIRES ABILITY TO PRESENT MERCHANDISE AND SHARE DETAILED INFORMATION REGARDING FEATURES AND BENEFITS OF PRODUCTS PROVIDE INFORMATION REGARDING EXTENDED SERVICE PLANS AND FINANCING OPTIONS MEET INDIVIDUAL AND TEAM SALES GOALS\n\n\nWE THINK YOU’D BE GREAT FOR THIS ROLE IF YOU HAVE:\n\n A DESIRE TO HELP OUR CUSTOMERS CELEBRATE THE SPECIAL MOMENTS IN THEIR LIVES STRONG CUSTOMER SERVICE, SALES, RETAIL AND/OR JEWELRY EXPERIENCE FLEXIBLE AVAILABILITY TO WORK DURING “PEAK” RETAIL HOURS SUCH AS NIGHTS, WEEKENDS, AND HOLIDAYS A POSITIVE, CUSTOMER-FOCUSED APPROACH IN DELIVERING AN EXCEPTIONAL CUSTOMER EXPERIENCE STRONG COMMUNICATION AND RELATIONAL SKILLS\n\n\nWE PUT OUR PEOPLE FIRST BY OFFERING THE FOLLOWING BENEFITS:\n\n BASE PAY PLUS COMMISSION ON SALES MEDICAL, DENTAL, VISION AND PRESCRIPTION INSURANCE (FULL-TIME TEAM MEMBERS) 401(K) PAID TIME OFF (FULL-TIME AND PART-TIME TEAM MEMBERS) PAID HOLIDAYS (FULL-TIME TEAM MEMBERS) TUITION REIMBURSEMENT, INCLUDING DCA COURSES BASED ON POSITION TRAINING — ASSOCIATE TRAINING SYSTEM, MANAGEMENT TRAINING SYSTEM, DISTRICT MANAGER IN TRAINING, CAREER DEVELOPMENT AND MORE MERCHANDISE DISCOUNTS INCENTIVE TRIPS AND CONTESTS\n\n\nKAY JEWELERS IS PART OF THE SIGNET JEWELERS FAMILY AND IS AN EQUAL OPPORTUNITY EMPLOYER COMMITTED TO PROMOTING INCLUSION AND DIVERSITY FOR ALL EMPLOYEES. WE VALUE INTEGRITY, TEAMWORK AND OFFER OPPORTUNITIES FOR ADVANCEMENT AS PART OF OUR PROMOTE FROM WITHIN PHILOSOPHY.\n\nPLEASE KNOW THAT WHILE WE APPRECIATE EVERY APPLICANT'S INTEREST IN JOINING OUR TEAM, WE CAN ONLY CONTACT THOSE SELECTED FOR FURTHER CONSIDERATION.\n\nDON'T FORGET, WE HAVE MANY OPPORTUNITIES AVAILABLE ON OUR OTHER CAREER SITE PAGES. CLICK HERE TO LINK TO OUR CAREERS PAGE!",
    "job_skill_set": [
      "customer service",
      "sales",
      "retail experience",
      "communication",
      "administrative duties",
      "relationship building",
      "flexibility",
      "positive attitude",
      "teamwork",
      "problem solving",
      "jewelry experience",
      "merchandise presentation",
      "financing options knowledge"
    ],
    "short_keywords": [
      "administrative",
      "associate",
      "attitude",
      "building",
      "communication",
      "consultant",
      "customer",
      "duties",
      "experience",
      "financing",
      "fl",
      "flexibility",
      "hialeah",
      "jewelers",
      "jewelry",
      "kay",
      "knowledge",
      "mall",
      "merchandise",
      "options",
      "positive",
      "presentation",
      "problem",
      "relationship",
      "retail",
      "sales",
      "service",
      "solving",
      "teamwork",
      "westland"
    ]
  },
  {
    "job_id": "3904367702",
    "job_title": "Sales Consultant",
    "category": "SALES",
    "job_description": "6001 - NEWARK - 2070 STAFFORD WAY, NEWARK, DELAWARE, 19711 CARMAX, THE WAY YOUR CAREER SHOULD BE!\n\nDRIVEN BY THE DESIRE TO PROVIDE AN ICONIC CUSTOMER EXPERIENCE\n\nAT CARMAX, WE ENSURE CUSTOMERS CAN BUY THE VEHICLES THEY WANT IN A WAY THAT SUITS THEM. THAT DEMANDS A SPECIAL KIND OF SALES CONSULTANT: ONE WHO TAKES TIME TO BUILD RELATIONSHIPS WITH CUSTOMERS IN ORDER TO UNDERSTAND THEIR TRUE NEEDS. JOIN US, AND YOU WILL HELP EACH CUSTOMER PURCHASE THE RIGHT CAR, NOT THE MOST EXPENSIVE ONE. WE’VE BECOME THE NATION’S LARGEST RETAILER OF USED CARS DUE TO OUR HONESTY AND TRANSPARENCY, AND THOSE SAME TRAITS WILL HELP YOU SUCCEED TOO.\n\nWHAT YOU WILL DO – ESSENTIAL RESPONSIBILITIES\n\nUSE YOUR KNOWLEDGE OF CARMAX INVENTORY TO ASSIST CUSTOMERS IN FINDING A VEHICLE THAT MEETS THEIR NEEDSGUIDE CUSTOMERS EVERY STEP OF THE WAY, FROM SALE OR APPRAISAL TO TEST DRIVES AND ARRANGING FINANCING APPLICATIONSCOMPLETE ALL RELEVANT RECORDS AND DOCUMENTATION TO ENSURE SMOOTH TRANSACTIONS FOR OUR CUSTOMERS\n\nCARMAX PAYS NEW SALES CONSULTANTS A COMPETITIVE WAGE WHILE TRAINING AND THROUGH THE FIRST 640 HOURS OF SELLING, AFTER WHICH COMMISSIONS BECOME THE PRIMARY BASE OF PAY.\n\nLEARN AND SUCCEED AS PART OF A TEAM\n\nTHIS IS A HIGH ENERGY SALES ENVIRONMENT WHERE YOU WILL WORK AS A TEAM TO MEET GOALS AND WE’LL GIVE YOU EVERYTHING YOU NEED TO BE SUCCESSFUL. AUTO SALES EXPERIENCE IS NOT NECESSARY – WE PROVIDE PAID TRAINING AND A PERSONAL SALES MENTOR WHO IS DEDICATED TO YOUR ONGOING DEVELOPMENT. BRING US YOUR ABILITY TO CONNECT WITH PEOPLE AND BUILD RELATIONSHIPS, AND WE’LL HELP YOU SUCCEED. THE PROSPECTS ARE BRIGHT FOR SALES PROFESSIONALS WHO ASPIRE TO BECOME MENTORS, MANAGERS AND BUSINESS LEADERS, AND WHO ARE READY TO WORK AND LEARN AS PART OF A TEAM.\n\nQUALIFICATIONS AND REQUIREMENTS\n\nSALES AND CUSTOMER SERVICE EXPERIENCE, IN AN AREA SUCH AS RETAIL, IS PREFERREDGOOD LISTENING SKILLS AND A STRONG CUSTOMER FOCUSHIGH LEVEL OF SELF-MOTIVATION\n\nABOUT CARMAX\n\nCARMAX DISRUPTED THE AUTO INDUSTRY BY DELIVERING THE HONEST, TRANSPARENT AND HIGH-INTEGRITY EXPERIENCE CUSTOMERS WANT AND DESERVE. THIS INNOVATIVE THINKING AROUND THE WAY CARS ARE BOUGHT AND SOLD HAS HELPED US BECOME THE NATION’S LARGEST RETAILER OF USED CARS, WITH OVER 200 LOCATIONS NATIONWIDE.\n\nOUR AMAZING TEAM OF MORE THAN 25,000 ASSOCIATES WORK TOGETHER TO DELIVER ICONIC CUSTOMER EXPERIENCES. ALONG THE WAY, WE HELP EVERY ASSOCIATE GROW THEIR CAREER AND ACHIEVE THEIR BEST, AT WORK AND IN THEIR COMMUNITY. WE ARE RECOGNIZED FOR OUR COMMITMENT TO TRAINING AND DIVERSITY AND ARE ONE OF THE FORTUNE 100 BEST COMPANIES TO WORK FOR®.\n\nCARMAX IS AN EQUAL OPPORTUNITY EMPLOYER, AND ALL QUALIFIED CANDIDATES WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, GENETIC INFORMATION, NATIONAL ORIGIN, PROTECTED VETERAN STATUS, DISABILITY STATUS, OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW.\n\nUPON AN APPLICANT'S REQUEST, CARMAX WILL CONSIDER REASONABLE ACCOMMODATION TO COMPLETE THE CARMAX JOB APPLICATION .",
    "job_skill_set": [
      "sales experience",
      "customer service",
      "documentation",
      "inventory knowledge",
      "relationship building",
      "listening skills",
      "self-motivation",
      "teamwork",
      "communication",
      "financing applications"
    ],
    "short_keywords": [
      "applications",
      "building",
      "communication",
      "consultant",
      "customer",
      "documentation",
      "experience",
      "financing",
      "inventory",
      "knowledge",
      "listening",
      "relationship",
      "sales",
      "selfmotivation",
      "service",
      "skills",
      "teamwork"
    ]
  },
  {
    "job_id": "3895849271",
    "job_title": "Sales Manager",
    "category": "SALES",
    "job_description": "POSITION SUMMARY: OUR SALES MANAGER HAS MANAGING PARTNERRESPONSIBILITIES FOR A TEAM OF 5-25 EXECUTIVE CONSULTANTS IN MARKETING J.GALT'S SAAS MEMBERSHIPS AND CONSULTING SERVICES. IN ADDITION, THE MANAGINGPARTNER/SALES MANAGER REPRESENTS J. GALT IN ATTRACTING MEMBERSHIPS THROUGHCHANNEL PARTNERS, STRATEGIC ALLIANCES, CHAMBERS OF COMMERCE, AND STATE,TRADE, AND PROFESSIONAL ASSOCIATIONS.\nOUR MISSION: WE BELIEVE IN HELPING SMALL AND MEDIUM-SIZED BUSINESSESSUCCEED. IT IS TRAGIC THAT MOST BUSINESS OWNERS CARRY THE CREDIT NEEDS OFTHEIR BUSINESS. THEY OFTEN RELY ON PERSONAL CREDIT CARDS, OR THEY SIGNPERSONALLY FOR THE BUSINESS TO ACCESS THE FUNDING, EQUIPMENT, OR FACILITIES THEBUSINESS REQUIRES TO OPERATE.\nWHAT WE DO: J. GALT FINANCE SUITE OFFERS A SAAS PLATFORM AND CONSULTATIVESERVICES TO SMALL AND MEDIUM-SIZED BUSINESS OWNERS. OUR SYSTEM INCLUDES APROVEN 7-STEP PROCESS TO BUILD CREDIT FOR A BUSINESS AROUND THE BUSINESS EINWITHOUT PERSONAL GUARANTEES OR USING THE OWNER’S PERSONAL CREDIT PROFILE.\nJ. GALT IS SEEKING SIX-FIGURE SALES TALENT AND AGGRESSIVE GROWTH-ORIENTEDEXECUTIVES WITH A PROVEN TRACK RECORD OF SUCCESS. SUCCESSFUL CANDIDATES WILLPOSSESS A(N):\n• MINIMUM 10 YEARS OF SUCCESSFUL BUSINESS EXPERIENCE IN A MARKETING-INTENSIVE BUSINESS• UNCOMPROMISING NEED FOR TOP-LEVEL EARNINGS• HIGH ENERGY, SELF-DISCIPLINED, SELF-STARTER WITH A POSITIVE ATTITUDE• GOAL-ORIENTED WITH A LIFELONG QUEST FOR PERSONAL DEVELOPMENT ANDCAREER GROWTH• PERSUASIVE COMMUNICATION SKILLS IN ORAL & WRITTEN FORM• COMFORTABLE SPEAKING IN FRONT OF GROUPS IN PERSON OR VIRTUALLY• TOP-NOTCH CONSULTATIVE SALES SKILLS• COMFORTABLE MARKETING TO PROFESSIONALS AND C-LEVEL EXECUTIVES• SUPERIOR TIME MANAGEMENT AND ORGANIZATION SKILLS AND A DESIRE TO WORK FROM A HOME-BASED OFFICE• PROFESSIONAL APPEARANCE AND DEMEANOR• PASSION TO MARKET A SAAS PRODUCT THAT SOLVES A SMALL BUSINESS OWNER'SMOST VEXING PROBLEM\nWHY J. GALT? | WHAT WE OFFER• 1ST-YEAR EARNINGS EXPECTATIONS OF $125K-$175K• LONG-TERM EARNINGS EXPECTATIONS OF $350K+• WEEKLY PERSONAL PRODUCTION EARNINGS• WEEKLY OVERRIDE TEAM PRODUCTION EARNINGS• $7,500 QUICK START BONUS AFTER 90 DAYS.• $5,000 MONTHLY PERSONAL PERFORMANCE BONUS• $5,000 MONTHLY BUSINESS UNIT PERFORMANCE BONUS• 5-FIGURE QUARTERLY AND 6-FIGURE ANNUAL BONUS OPPORTUNITIES FOR TOP PRODUCERS• SUBSTANTIAL OPPORTUNITY FOR PROMOTION AND CAREER ADVANCEMENT• ADDITIONAL EARNINGS FROM CROSS-PROMOTION STRATEGIES WITH SISTER COMPANIES IN THE COST-REDUCTION CONSULTING SPACE\nPROMOTION OPPORTUNITIES: CHIEF REVENUE OFFICER | EQUITY STAKEHOLDER\nMAIN DUTIES & RESPONSIBILITIESTHE MANAGING PARTNER CONTRIBUTES SIGNIFICANTLY TO PERSONAL PRODUCTION,KEY CHANNEL RELATIONSHIPS, AS WELL AS HIRING, TRAINING, AND DEVELOPING ATEAM OF 5-25 EXECUTIVE CONSULTANTS. IN SUMMATION, A MANAGING PARTNERHAS COMPLETE CONTROL OF A J. GALT BUSINESS CREDIT CONSULTING PRACTICE.\nRESPONSIBILITIES INCLUDE:• ATTRACTING MEMBERSHIPS THROUGH CHANNEL PARTNERS• FORMING STRATEGIC ALLIANCES WITH STATE, TRADE, AND PROFESSIONAL ASSOCIATIONS• FORMING PARTNERSHIPS WITH CHAMBERS OF COMMERCE• IN-PERSON AND VIRTUAL PRESENTATIONS• DELIVERING BUSINESS CREDIT SEMINARS TO GROUPS OF 5-50 BUSINESS OWNERS• MONITORING AND IMPROVING THE SALES PERFORMANCE OF DIRECT REPORTS• DEVELOPING SALES STRATEGIES• MANAGING THE SALES PROCESS THROUGH THE J. GALT SALES APP• LEADING TEAM MEETINGS• MEETING MONTHLY, QUARTERLY, AND ANNUAL SALES TARGETS",
    "job_skill_set": [
      "time management",
      "communication",
      "organization",
      "persuasiveness",
      "teamwork",
      "sales management",
      "consultative sales",
      "marketing",
      "business development",
      "team leadership",
      "presentation skills",
      "strategic alliances",
      "SaaS knowledge",
      "sales strategy development",
      "performance monitoring",
      "goal-oriented",
      "self-discipline",
      "positive attitude",
      "personal development",
      "adaptability",
      "professional demeanor"
    ],
    "short_keywords": [
      "adaptability",
      "alliances",
      "attitude",
      "business",
      "communication",
      "consultative",
      "demeanor",
      "development",
      "goaloriented",
      "knowledge",
      "leadership",
      "management",
      "manager",
      "marketing",
      "monitoring",
      "organization",
      "performance",
      "personal",
      "persuasiveness",
      "positive",
      "presentation",
      "professional",
      "saas",
      "sales",
      "selfdiscipline",
      "skills",
      "strategic",
      "strategy",
      "team",
      "teamwork",
      "time"
    ]
  },
  {
    "job_id": "3906257415",
    "job_title": "Commercial Sales Manager",
    "category": "SALES",
    "job_description": "POSITION TITLE: COMMERCIAL SALES MANAGER\n\nREPORTS TO: DIRECTOR OF BUSINESS DEVELOPMENT\n\nWE HAVE AN EXCITING OPPORTUNITY FOR A MOTIVATED, HIGH ENERGY, RESOURCEFUL CHANGE AGENT WHO IS EXCITED ABOUT DEVELOPING STRATEGY AND BUILDING MOTUS TO THE NEXT LEVEL. THE COMMERCIAL SALES MANAGER WILL BE RESPONSIBLE FOR DEVELOPING SALES STRATEGIES, IDENTIFYING NEW OPPORTUNITIES, CREATING NEW BUSINESS PLANS WHICH ASSESS EBITDA, AND BUILDING RELATIONSHIPS WITH OEMS AND TIER 1 SUPPLIERS. A SUCCESSFUL CANDIDATE WILL BE COMPETITIVE, DRIVEN AND PASSIONATE ABOUT WINNING.\n\nRESPONSIBILITIES\n\nDEVELOP A BUSINESS STRATEGY TO DEFINE, VALIDATE AND IMPROVE OUR EXISTING PLANS AND PRODUCTSEFFECTIVELY PARTNER WITH AN ACCOUNT MANAGER TO PROFITABLY SECURE REPLACEMENT AND NEW BUSINESS FOR REVENUE GROWTHBUILD RELATIONSHIPS WITH OEMS AND TIER 1 SUPPLIERSFOLLOW MARKET TRENDS AND CHANGES, INCLUDING REGULATORY, COMPETITIVE ASSESSMENTS AND MARKET GROWTH ESTIMATESBUILD ON EXISTING RELATIONSHIPS WITH IMPACT TIER 1 AND OEM CUSTOMERS AND PROFITABLY GROW THE BOOK OF BUSINESSGENERATE AND PRESENT RFQ’S, BUSINESS REVIEWS, BUSINESS PLANS, BUSINESS CASES, PROGRAM AND CUSTOMER UPDATES AND PRICING STRATEGY TO INTERNAL TEAMS AND MANAGEMENTGENERATE AND PRESENT CUSTOMER QUOTATIONS AND NEGOTIATE PRICING WITH CUSTOMERPROVIDE INPUT TO THE PRODUCT ENGINEERING TEAM TO ENSURE THAT PRODUCT ROADMAPS ARE ALIGNED WITH IDENTIFIED GROWTH OPPORTUNITIESACT AS A PARTNER BETWEEN SALES AND OTHER INTERNAL DEPARTMENTS AND ACTIVELY PARTICIPATE IN CROSS FUNCTIONAL PROJECT\n\nREQUIREMENTS\n\nBACHELOR’S DEGREE IN BUSINESS, ENGINEERING OR RELATEDMULTIPLE YEARS OF BUSINESS DEVELOPMENT EXPERIENCE PREFERRED. FOCUSED ON CUSTOMER PARTNERSHIPS WITH ABILITY TO DEVELOP THESE RELATIONSHIPS AND ACQUIRE PROFITABLE BUSINESSSIGNIFICANT INTERFACE IN PRIOR ROLES WITH MANUFACTURING TEAM MEMBERSOEM EXPERIENCE AND KNOWLEDGE OF OEMS IN THE SOUTH EAST UNITED STATES A PLUSOUTSTANDING CUSTOMER COMMUNICATION SKILLS ARE ESSENTIAL FOR SUCCESS IN THIS POSITIONEXCELLENT PRESENTATION SKILLS, ABILITY TO COMMUNICATE EFFECTIVELY WITH CUSTOMERS AND INTERNAL STAKEHOLDERS INCLUDING THE EXECUTIVE LEVELABILITY TO BECOME AN EXPERT IN MULTIPLE DIFFERENT PRODUCTS AND WORK WITH MULTIPLE CUSTOMERSABILITY TO TRAVEL",
    "job_skill_set": [
      "business planning",
      "customer relationship management",
      "market analysis",
      "pricing strategy negotiation",
      "communication",
      "teamwork",
      "problem solving",
      "competitive drive",
      "resourcefulness",
      "adaptability",
      "customer focus",
      "relationship building",
      "motivation",
      "strategic thinking",
      "sales strategy development",
      "EBITDA assessment",
      "RFQ generation",
      "product engineering collaboration",
      "cross-functional project participation",
      "OEM knowledge",
      "presentation skills"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "assessment",
      "building",
      "business",
      "collaboration",
      "commercial",
      "communication",
      "competitive",
      "crossfunctional",
      "customer",
      "development",
      "drive",
      "ebitda",
      "engineering",
      "focus",
      "generation",
      "knowledge",
      "management",
      "manager",
      "market",
      "motivation",
      "negotiation",
      "oem",
      "participation",
      "planning",
      "presentation",
      "pricing",
      "problem",
      "product",
      "project",
      "relationship",
      "resourcefulness",
      "rfq",
      "sales",
      "skills",
      "solving",
      "strategic",
      "strategy",
      "teamwork",
      "thinking"
    ]
  },
  {
    "job_id": "3887910179",
    "job_title": "Apparel Sales Outfitter-1",
    "category": "SALES",
    "job_description": "POSITION SUMMARY:\n\nTHE SALES OUTFITTER PERFORMS VARIOUS SELLING / CUSTOMER SERVICE ACTIVITIES, TO INCLUDE GREETING AND ACKNOWLEDGING ALL CUSTOMERS IN A PROMPT AND FRIENDLY MANNER, HANDLING MERCHANDISE WITH CARE, PROVIDING INFORMATION, ASSISTANCE, AND DIRECTION TO CUSTOMERS.\n\nESSENTIAL FUNCTIONS:\n\nSUPPORTS A STRONG COMMITMENT TO WORLD CLASS CUSTOMER SERVICE AND ENSURES A PLEASANT AND PRODUCTIVE SHOPPING EXPERIENCE FOR ALL CUSTOMERS.INSURES A PLEASANT AND PRODUCTIVE SHOPPING EXPERIENCE FOR ALL CUSTOMERSDEMONSTRATES PRODUCT TO CUSTOMERS.REPLENISHES PRODUCT ON SHELVES AS REQUIRED PER MERCHANDISING GUIDELINES.REMAINS PRODUCT “EXPERT” THROUGH ONGOING PRODUCT KNOWLEDGE TRAINING.REMAINS KNOWLEDGEABLE OF ADVERTISED SALES; MAINTAINS PRICING AND SIGNING.ASSISTS WITH \"SEASONAL\" FLOOR MERCHANDISE MOVES.RESTOCKS MERCHANDISE AS REQUIRED.KEEPS WORK AREA CLEAN, NEAT AND WELL STOCKED WITH SUPPLIES.FOLLOWS ALL COMPANY POLICIES AND PROCEDURES.PROVIDES A LEGENDARY EXPERIENCE FOR EVERY CUSTOMER, EVERY TIME BY ASSISTING CUSTOMERS IN MAKING BUYING DECISIONS BY:IDENTIFYING AND EVALUATING CUSTOMERS' NEEDS,MAKING PRODUCT RECOMMENDATIONS BASED OFF OF THIS ANALYSIS,PROMOTING PROGRAMS INCLUDING, BUT NOT LIMITED TO CLUB MEMBERSHIP, VOC AND IN-STORE PICK-UP.ALL OTHER DUTIES AS ASSIGNED\n\nEXPERIENCE/QUALIFICATIONS:\n\nMINIMUM DEGREE REQUIRED: HIGH SCHOOL EDUCATION OR EQUIVALENT EXPERIENCE\n\nKNOWLEDGE, SKILLS, AND ABILITY: \n\nABILITY TO CALCULATE FIGURES SUCH AS DISCOUNTS AND MAKE CHANGE TO CUSTOMERSABILITY TO COMMUNICATE IN A FRIENDLY AND PROFESSIONAL MANNER TO OUR CUSTOMERS AND OTHER ASSOCIATESABILITY TO ESTABLISH AND MAINTAIN EFFECTIVE WORKING RELATIONSHIPS WITH MANAGEMENT, COWORKERS AND CUSTOMERSABILITY TO OPERATE COMPUTERIZED POINT OF SALE REGISTER SYSTEM\n\nTRAVEL REQUIREMENTS:\n\nN/A\n\nPHYSICAL REQUIREMENTS:\n\nCONSTANTLY STAND AND/OR WALK DURING SHIFTOCCASIONALLY ASCEND OR DESCEND LADDERS, STAIRS, RAMPS, ETC.CONSTANTLY COMMUNICATE WITH OTHERS TO EXCHANGE INFORMATIONOCCASIONALLY REPEAT MOTIONS THAT MAY INCLUDE THE WRISTS, HANDS AND/OR FINGERSOCCASIONALLY OPERATE MACHINERY AND/OR POWER TOOLSOCCASIONALLY OPERATE MOTOR VEHICLES OR HEAVY EQUIPMENTLIGHT WORK THAT INCLUDES MOVING OBJECTS UP TO 20 POUNDS CONSTANTLY, MAY OCCASIONALLY MOVE AND LIFT OBJECTS UP TO 100 POUNDS OR MORE (UTILIZING A TEAM LIFT AS NEEDED)OCCASIONALLY WORK IN TIGHT AND CONFINED SPACESOCCASIONALLY WORK IN NOISY ENVIRONMENTS\n\nINDEPENDENT JUDGEMENT:\n\nPERFORMS TASKS AND DUTIES UNDER GENERAL SUPERVISION, USING ESTABLISHED PROCEDURES AND INNOVATION. CHOOSES FROM LIMITED ALTERNATIVES TO RESOLVE PROBLEMS. OCCASIONAL INDEPENDENT JUDGMENT IS REQUIRED TO COMPLETE WORK ASSIGNMENTS. OFTEN MAKES RECOMMENDATIONS TO WORK PROCEDURES, POLICIES, AND PRACTICES.\n\nPART TIME BENEFITS SUMMARY:\n\nENJOY DISCOUNTS ON RETAIL MERCHANDISE, OUR RESTAURANTS, WORLD-CLASS RESORTS AND CONSERVATION ATTRACTIONS!\n\nDENTALVISIONVOLUNTARY BENEFITS401K RETIREMENT SAVINGSPAID HOLIDAYSPAID VACATIONBASS PRO CARES FUNDAND MORE!\n\nBASS PRO SHOPS IS AN EQUAL OPPORTUNITY EMPLOYER. HIRING DECISIONS ARE ADMINISTERED WITHOUT REGARD TO RACE, COLOR, CREED, RELIGION, SEX, PREGNANCY, SEXUAL ORIENTATION, GENDER IDENTITY, AGE, NATIONAL ORIGIN, ANCESTRY, CITIZENSHIP STATUS, DISABILITY, VETERAN STATUS, GENETIC INFORMATION, OR ANY OTHER BASIS PROTECTED BY APPLICABLE FEDERAL, STATE OR LOCAL LAW.\n\nREASONABLE ACCOMMODATIONS\n\nQUALIFIED INDIVIDUALS WITH KNOWN DISABILITIES MAY BE ENTITLED TO REASONABLE ACCOMMODATION UNDER THE AMERICANS WITH DISABILITIES ACT AND CERTAIN STATE OR LOCAL LAWS.\n\nIF YOU NEED A REASONABLE ACCOMMODATION FOR ANY PART OF THE APPLICATION PROCESS, PLEASE VISIT YOUR NEAREST LOCATION OR CONTACT US AT HRCOMPLIANCE@BASSPRO.COM.\n\nCABELA'S",
    "job_skill_set": [
      "customer service",
      "merchandising",
      "product knowledge",
      "point of sale system",
      "mathematical calculations",
      "inventory management",
      "communication",
      "teamwork",
      "problem solving",
      "relationship building",
      "adaptability",
      "attention to detail"
    ],
    "short_keywords": [
      "adaptability",
      "apparel",
      "attention",
      "building",
      "calculations",
      "communication",
      "customer",
      "detail",
      "inventory",
      "knowledge",
      "management",
      "mathematical",
      "merchandising",
      "of",
      "outfitter1",
      "point",
      "problem",
      "product",
      "relationship",
      "sale",
      "sales",
      "service",
      "solving",
      "system",
      "teamwork",
      "to"
    ]
  },
  {
    "job_id": "3889712511",
    "job_title": "Sales Manager",
    "category": "SALES",
    "job_description": "POSITION SUMMARY: OUR SALES MANAGER HAS MANAGING PARTNERRESPONSIBILITIES FOR A TEAM OF 5-25 EXECUTIVE CONSULTANTS IN MARKETING J.GALT'S SAAS MEMBERSHIPS AND CONSULTING SERVICES. IN ADDITION, THE MANAGINGPARTNER/SALES MANAGER REPRESENTS J. GALT IN ATTRACTING MEMBERSHIPS THROUGHCHANNEL PARTNERS, STRATEGIC ALLIANCES, CHAMBERS OF COMMERCE, AND STATE,TRADE, AND PROFESSIONAL ASSOCIATIONS.\nOUR MISSION: WE BELIEVE IN HELPING SMALL AND MEDIUM-SIZED BUSINESSESSUCCEED. IT IS TRAGIC THAT MOST BUSINESS OWNERS CARRY THE CREDIT NEEDS OFTHEIR BUSINESS. THEY OFTEN RELY ON PERSONAL CREDIT CARDS, OR THEY SIGNPERSONALLY FOR THE BUSINESS TO ACCESS THE FUNDING, EQUIPMENT, OR FACILITIES THEBUSINESS REQUIRES TO OPERATE.\nWHAT WE DO: J. GALT FINANCE SUITE OFFERS A SAAS PLATFORM AND CONSULTATIVESERVICES TO SMALL AND MEDIUM-SIZED BUSINESS OWNERS. OUR SYSTEM INCLUDES APROVEN 7-STEP PROCESS TO BUILD CREDIT FOR A BUSINESS AROUND THE BUSINESS EINWITHOUT PERSONAL GUARANTEES OR USING THE OWNER’S PERSONAL CREDIT PROFILE.\nJ. GALT IS SEEKING SIX-FIGURE SALES TALENT AND AGGRESSIVE GROWTH-ORIENTEDEXECUTIVES WITH A PROVEN TRACK RECORD OF SUCCESS. SUCCESSFUL CANDIDATES WILLPOSSESS A(N):\n• MINIMUM 10 YEARS OF SUCCESSFUL BUSINESS EXPERIENCE IN A MARKETING-INTENSIVE BUSINESS• UNCOMPROMISING NEED FOR TOP-LEVEL EARNINGS• HIGH ENERGY, SELF-DISCIPLINED, SELF-STARTER WITH A POSITIVE ATTITUDE• GOAL-ORIENTED WITH A LIFELONG QUEST FOR PERSONAL DEVELOPMENT AND CAREER GROWTH• PERSUASIVE COMMUNICATION SKILLS IN ORAL & WRITTEN FORM• COMFORTABLE SPEAKING IN FRONT OF GROUPS IN PERSON OR VIRTUALLY• TOP-NOTCH CONSULTATIVE SALES SKILLS• COMFORTABLE MARKETING TO PROFESSIONALS AND C-LEVEL EXECUTIVES• SUPERIOR TIME MANAGEMENT AND ORGANIZATION SKILLS AND A DESIRE TO WORK FROM A HOME-BASED OFFICE• PROFESSIONAL APPEARANCE AND DEMEANOR• PASSION TO MARKET A SAAS PRODUCT THAT SOLVES A SMALL BUSINESS OWNER'S MOST VEXING PROBLEM\nWHY J. GALT? | WHAT WE OFFER• 1ST-YEAR EARNINGS EXPECTATIONS OF $125K-$175K• LONG-TERM EARNINGS EXPECTATIONS OF $350K+• WEEKLY PERSONAL PRODUCTION EARNINGS• WEEKLY OVERRIDE TEAM PRODUCTION EARNINGS• $7,500 QUICK START BONUS AFTER 90 DAYS.• $5,000 MONTHLY PERSONAL PERFORMANCE BONUS• $5,000 MONTHLY BUSINESS UNIT PERFORMANCE BONUS• 5-FIGURE QUARTERLY AND 6-FIGURE ANNUAL BONUS OPPORTUNITIES FOR TOPPRODUCERS• SUBSTANTIAL OPPORTUNITY FOR PROMOTION AND CAREER ADVANCEMENT• ADDITIONAL EARNINGS FROM CROSS-PROMOTION STRATEGIES WITH SISTERCOMPANIES IN THE COST-REDUCTION CONSULTING SPACE\nPROMOTION OPPORTUNITIES: CHIEF REVENUE OFFICER | EQUITY STAKEHOLDER\nMAIN DUTIES & RESPONSIBILITIESTHE MANAGING PARTNER CONTRIBUTES SIGNIFICANTLY TO PERSONAL PRODUCTION,KEY CHANNEL RELATIONSHIPS, AS WELL AS HIRING, TRAINING, AND DEVELOPING ATEAM OF 5-25 EXECUTIVE CONSULTANTS. IN SUMMATION, A MANAGING PARTNERHAS COMPLETE CONTROL OF A J. GALT BUSINESS CREDIT CONSULTING PRACTICE.\nRESPONSIBILITIES INCLUDE:• ATTRACTING MEMBERSHIPS THROUGH CHANNEL PARTNERS• FORMING STRATEGIC ALLIANCES WITH STATE, TRADE, AND PROFESSIONALASSOCIATIONS• FORMING PARTNERSHIPS WITH CHAMBERS OF COMMERCE• IN-PERSON AND VIRTUAL PRESENTATIONS• DELIVERING BUSINESS CREDIT SEMINARS TO GROUPS OF 5-50 BUSINESS OWNERS• MONITORING AND IMPROVING THE SALES PERFORMANCE OF DIRECT REPORTS• DEVELOPING SALES STRATEGIES• MANAGING THE SALES PROCESS THROUGH THE J. GALT SALES APP• LEADING TEAM MEETINGS• MEETING MONTHLY, QUARTERLY, AND ANNUAL SALES TARGETS",
    "job_skill_set": [
      "sales management",
      "team development",
      "time management",
      "performance monitoring",
      "communication",
      "goal-oriented",
      "self-discipline",
      "positive attitude",
      "persuasiveness",
      "organization",
      "leadership",
      "adaptability",
      "professional demeanor",
      "consultative sales",
      "marketing",
      "strategic alliances",
      "presentation skills",
      "SaaS knowledge",
      "sales strategy development",
      "personal development"
    ],
    "short_keywords": [
      "adaptability",
      "alliances",
      "attitude",
      "communication",
      "consultative",
      "demeanor",
      "development",
      "goaloriented",
      "knowledge",
      "leadership",
      "management",
      "manager",
      "marketing",
      "monitoring",
      "organization",
      "performance",
      "personal",
      "persuasiveness",
      "positive",
      "presentation",
      "professional",
      "saas",
      "sales",
      "selfdiscipline",
      "skills",
      "strategic",
      "strategy",
      "team",
      "time"
    ]
  },
  {
    "job_id": "3887920988",
    "job_title": "Associate, Part Time Sales",
    "category": "SALES",
    "job_description": "COMPANY OVERVIEW\n\nSLEEP NUMBER TEAM MEMBERS ARE PART OF A PASSIONATE, PURPOSE-DRIVEN CULTURE THAT SUPPORTS IMPROVING THE HEALTH AND WELLBEING OF SOCIETY THROUGH HIGHER QUALITY SLEEP. WE ARE NOT JUST FOCUSED ON OUR CUSTOMERS, HOWEVER; BEING EMPLOYED BY SLEEP NUMBER MEANS YOUR PERSONAL WELLBEING IS IMPORTANT, TOO. AS WE CONTINUE TO GROW, WE ARE LOOKING FOR TEAM MEMBERS WHO WILL BRING THEIR UNIQUE PERSONALITIES, BACKGROUNDS, AND SKILLS TO WORK. WHETHER YOU ARE ENTERING, RETURNING, OR EXPERIENCED IN THE WORKFORCE, WE HAVE A PLACE FOR YOU.\n\nIN OUR 35+ YEARS IN THE INDUSTRY WE HAVE IMPROVED OVER 14 MILLION LIVES, AND WE ARE JUST GETTING STARTED. WITH 5,000+ TEAM MEMBERS NATIONWIDE SUPPORTING WORK DISCIPLINES FROM TECHNOLOGY TO MANUFACTURING, RETAIL STORES TO FIELD SERVICES TECHNICIANS, CORPORATE TEAMS TO CUSTOMER SERVICE, WE ARE A SLEEP INNOVATION LEADER BECAUSE OF OUR TEAM MEMBERS. NOW IS A GREAT TIME TO JOIN US AS WE INVEST FURTHER IN OUR PEOPLE AND SLEEP INNOVATION. #TEAMSLEEPNUMBER\n\nAT SLEEP NUMBER, WE BELIEVE QUALITY SLEEP CAN AND WILL CHANGE THE WORLD. IT'S OUR PURPOSE. AND IT STARTS WITH YOU. OUR ASSOCIATE, PART TIME SALES POSITION OFFERS A GREAT WAY TO BALANCE YOUR PERSONAL AND PROFESSIONAL LIFE WITH A FULFILLING PART-TIME CAREER. IN THIS ROLE YOU WILL WORK COHESIVELY WITH SALES TEAM MEMBERS TO ENGAGE, SUPPORT, AND PROVIDE CUSTOMER SERVICE TO SLEEP NUMBER CUSTOMERS. IF YOU CONSIDER YOURSELF AS HAVING SKILLS AND EXPERIENCES THAT SUPPORT BEING SELF-MOTIVATED, COMPETITIVE, PASSIONATE, A KNOWLEDGE-SEEKER, CARING, AND A COMMUNICATOR – THIS ROLE IS FOR YOU!\n\nLETS DREAM BIG...\n\nALL TEAM MEMBERS RECEIVE A 360 SMART BED 30% EVERYDAY TEAM MEMBER DISCOUNTS – BUY LUXURY SHEETS, PILLOWS, BLANKETS COMPETITIVE HOURLY BASE RATESUNCAPPED COMMISSION ON SALES3 SHIFTS PER WEEK: AVERAGE 24 HOURS PER WEEK ELIGIBLE FOR FULL-TIME BENEFITS; MEDICAL, DENTAL, VISION, SPENDING AND SAVINGS ACCOUNTS, 401K MATCHVACATION AND SICK TIME EARNED EVERY HOUR YOU WORKTECHNICAL TRAINING WORKING WITH BLUETOOTH TECHNOLOGY AND IOT PLATFORMS REPRESENT A PREMIERE BRAND AND DELIVER PROVEN QUALITY SLEEP! \n\nMAKE QUALITY SLEEP YOUR PASSION BY...\n\nMINIMUM H.S. DIPLOMA OR EQUIVALENT REQUIREDLEADING CUSTOMERS TO “THE BEST SLEEP OF THEIR LIFE”COMMUNICATING PRODUCT FEATURES AND BENEFITS AND PROMOTIONAL INFORMATIONBECOMING A TRUSTED, SUCCESSFUL “SLEEP EXPERT”MAKING A CONNECTION WITH A DIVERSE ARRAY OF CUSTOMERSPARTICIPATING IN THE CREATION OF YOUR PART-TIME SCHEDULEBRINGING YOUR PRIOR EXPERIENCE IN A CUSTOMER-FACING ROLE, PREFERABLY HIGH-END SALES\n\nWELLBEING\n\nOUR COMPANY'S PURPOSE IS TO IMPROVE THE HEALTH AND WELLBEING OF SOCIETY.\n\nWELLBEING IS MORE THAN A CATCHPHRASE - IT'S A MOVEMENT THAT PERMEATES OUR COMPANY AND THROUGH OUR TEAM MEMBERS. WE ARE DEDICATED TO ENHANCING AND SUPPORTING THE WELLBEING OF OUR TEAM MEMBERS AND THEIR FAMILIES THROUGH BENEFITS, PROGRAMS, AND RESOURCES ACROSS OUR FIVE WELLBEING PILLARS OF EMOTIONAL, FINANCIAL, CAREER, COMMUNITY, AND PHYSICAL HEALTH, WITH SLEEP AT THE CENTER.\n\nBY JOINING OUR TEAM, IN ADDITION TO OFFERING COMPETITIVE PAY PROGRAMS, WE ARE PROUD TO OFFER ELIGIBLE TEAM MEMBERS AN EXTENSIVE BENEFITS PACKAGE INCLUDING, BUT NOT LIMITED TO MEDICAL AND PHARMACY BENEFITS, DENTAL, LIFE AND DISABILITY INSURANCE, A MATCHED 401(K) PLAN, PAID TIME OFF, AND MUCH MORE.\n\nEXAMPLES OF HOW WE INVEST IN YOUR WELLBEING\n\nSLEEP - OUR 360® SMART BED FOR TEAM MEMBERS, AND DISCOUNTS ON OUR INNOVATIONS AND SLEEP SOLUTIONS FOR YOURSELF AND FRIENDS AND FAMILY THROUGHOUT THE YEAR.PHYSICAL - WIDE RANGE OF WELLBEING RESOURCES AND SERVICES THROUGH OUR MEDICAL PLANS TO IMPROVE YOUR PHYSICAL HEALTH. EMOTIONAL - ACCESS TO MENTAL HEALTH RESOURCES, CAREGIVING SUPPORT, PAID TIME OFF AND PARENTAL LEAVE TO SUPPORT YOUR EMOTIONAL WELLBEING. WORK FOR YOUR DAY FLEXIBILITY, AVAILABLE FOR SELECT CORPORATE ROLES. FINANCIAL - COMPETITIVE BASE AND VARIABLE PAY PROGRAMS, ABILITY TO SAVE FOR THE FUTURE THROUGH A MATCHED 401(K) PLAN AND FINANCIAL SUPPORT TO RECOVER FROM AN ILLNESS OR INJURY.COMMUNITY - PAID TIME OFF FOR VOLUNTEERING AND CONNECTIONS TO OUR COMMUNITIES THROUGH OUR DIVERSITY, EQUITY & INCLUSION INITIATIVES, AND SUPPORT FOR CHARITABLE CAUSES.CAREER - OPPORTUNITIES FOR CAREER DEVELOPMENT AND CONTINUOUS LEARNING, INCLUDING A TUITION REIMBURSEMENT PROGRAM.\n\nSAFETY\n\nSAFETY IS A TOP PRIORITY FOR SLEEP NUMBER SUPPORTING CUSTOMERS AND TEAM MEMBERS WELLBEING. COVID-19 PRECAUTION(S) ARE IN PLACE CONSISTENT WITH CDC GUIDELINES, U.S. DEPARTMENT OF LABOR’S OCCUPATIONAL HEALTH & SAFETY ADMINISTRATION (OSHA), AND STATE/LOCAL LAWS.\n\nEEO STATEMENT\n\nSLEEP NUMBER IS AN EQUAL OPPORTUNITY EMPLOYER. WE ARE COMMITTED TO RECRUITING, HIRING AND PROMOTING QUALIFIED PEOPLE AND PROHIBIT DISCRIMINATION BASED ON RACE, COLOR, MARITAL STATUS, RELIGION, SEX (INCLUDING GENDER, GENDER IDENTITY, GENDER EXPRESSION, TRANSGENDER STATUS, PREGNANCY, CHILDBIRTH, AND MEDICAL CONDITIONS RELATED TO PREGNANCY OR CHILDBIRTH), SEXUAL ORIENTATION, AGE, NATIONAL ORIGIN OR ANCESTRY, CITIZENSHIP STATUS, PHYSICAL OR MENTAL DISABILITY, GENETIC INFORMATION (INCLUDING TESTING AND CHARACTERISTICS), VETERAN STATUS, UNIFORMED SERVICEMEMBER STATUS OR ANY OTHER STATUS PROTECTED BY FEDERAL, STATE, OR LOCAL LAW.\n\nAMERICANS WITH DISABILITIES ACT (ADA)\n\nIT IS SLEEP NUMBER’S POLICY TO PROVIDE REASONABLE ACCOMMODATIONS TO QUALIFIED INDIVIDUALS WITH DISABILITIES DURING THE APPLICATION PROCESS, CONSISTENT WITH APPLICABLE LAW. WE MAY REQUIRE SUPPORTING MEDICAL OR RELIGIOUS DOCUMENTATION WHERE APPLICABLE AND PERMISSIBLE BY LAW. IF YOU ARE A QUALIFIED INDIVIDUAL, YOU MAY REQUEST A REASONABLE ACCOMMODATION AT ANY TIME DURING THE SELECTION PROCESS, INCLUDING IF YOU ARE UNABLE OR OTHERWISE LIMITED IN YOUR ABILITY TO ACCESS OPEN ROLES HERE.",
    "job_skill_set": [
      "customer service",
      "sales",
      "communication",
      "technical training",
      "self-motivated",
      "passionate",
      "caring",
      "teamwork",
      "adaptability",
      "Bluetooth technology",
      "IOT platforms",
      "competitive",
      "knowledge-seeker"
    ],
    "short_keywords": [
      "adaptability",
      "associate",
      "bluetooth",
      "caring",
      "communication",
      "competitive",
      "customer",
      "iot",
      "knowledgeseeker",
      "part",
      "passionate",
      "platforms",
      "sales",
      "selfmotivated",
      "service",
      "teamwork",
      "technical",
      "technology",
      "time",
      "training"
    ]
  },
  {
    "job_id": "3884986864",
    "job_title": "Territory Service and Sales Representative",
    "category": "SALES",
    "job_description": "ECOLAB IS HIRING AND WE ARE EXCITED TO TURN YOUR NEXT OPPORTUNITY INTO A CAREER! ARE YOU SOMEONE WHO USES YOUR HANDS-ON SKILLS TO SOLVE PROBLEMS? DO YOU ENJOY THE HOSPITALITY INDUSTRY BUT ARE LOOKING FOR A CAREER THAT ALLOWS FOR A FLEXIBLE SCHEDULE? WE ARE LOOKING FOR SELF-MOTIVATED PEOPLE TO JOIN US IN SOLVING PROBLEMS THROUGH SERVICING EXISTING CUSTOMERS WHILE ALSO GROWING BUSINESS TO ACHIEVE YOUR SALES GOALS.\n\nJOIN ECOLAB AS A TERRITORY SERVICE AND SALES REPRESENTATIVE IN THE PENSACOLA, FL MARKET. AS AN INDUSTRY LEADER, WE’RE GROWING AND NEED TALENTED PEOPLE LIKE YOU TO HELP US CONTINUE TO PROTECT THE WORLD’S MOST VITAL RESOURCES. YOU WILL SERVE AS THE FACE OF ECOLAB, SERVICING LAUNDRIES AND DISH MACHINES, DISPENSING EQUIPMENT, AND SYSTEMS FOR OUR CUSTOMERS TO HELP ACHIEVE OUR MUTUAL GOAL OF A CLEANER, SAFER & HEALTHIER ENVIRONMENT FOR ALL.\n\nJOB SNAPSHOT\n\nCOMPANY VEHICLE PROVIDED FOR BUSINESS USEPAID DRIVE TIME (COMMUTE) TO CUSTOMER SITESPARTICIPATE IN BEST-IN-CLASS TRAINING PROGRAMSTART AND END YOUR DAY AT HOMEPRIMARILY DAY SHIFT\n\nWHAT’S IN IT FOR YOU\n\nCOMPREHENSIVE BENEFITS STARTING DAY 1 INCLUDING: MEDICAL, DENTAL, VISION, MATCHING 401K, COMPANY PAID PENSION, STOCK PURCHASE PLAN, PAID TIME OFF (VACATION + DISABILITY BENEFITS) AND MORE!ENJOY A PAID TRAINING PROGRAM (INCLUDING PAID TRAVEL TIME) LEVERAGING A BLENDED APPROACH INCLUDING DIGITAL LEARNING, CLASSROOM TRAINING, LIVE DEMONSTRATIONS, AND ON-THE-JOB TRAINING WITH FIELD PROFESSIONALS TO CERTIFY THAT ASSOCIATES ARE SAFE, CONFIDENT, AND PROFICIENT IN THEIR ROLES. WE OFFER AN AWARD-WINNING TRAINING APPROACH AT A STATE-OF-THE-ART TRAINING FACILITY IN EAGAN, MN. RECEIVE A COMPANY SERVICE VEHICLE AND CELL PHONE FOR BUSINESS USE. WE PAY FOR FUEL, DRIVE TIME TO CUSTOMER SITES, AND TIME FOR SERVICE MAINTENANCE ON YOUR VEHICLE OPPORTUNITIES FOR GROWTH AND DEVELOPMENT: CARVE OUT A LONG TERM, ADVANCED CAREER PATH TOWARDS SERVICE, SALES, OR MANAGEMENT WITH OPPORTUNITY FOR TUITION REIMBURSEMENTINDEPENDENT WORK ENVIRONMENT WHERE YOU WILL MANAGE YOUR MONTHLY SCHEDULEACCESS TO BEST-IN-CLASS RESOURCES, TOOLS, AND TECHNOLOGYGROW YOUR INCOME AS YOU DRIVE GROWTHTHRIVE IN A COMPANY THAT VALUES A CULTURE OF SAFETY TO INCLUDE TOP-NOTCH SAFETY TRAINING (INCLUDING A DEFENSIVE DRIVING COURSE) AND PERSONAL PROTECTION EQUIPMENTTHE OPPORTUNITY TO TAKE ON SOME OF THE WORLD’S MOST MEANINGFUL CHALLENGES, HELPING CUSTOMERS ACHIEVE CLEAN WATER, SAFE FOOD, AND HEALTHY ENVIRONMENTSTHE SUPPORT OF AN ORGANIZATION THAT BELIEVES IT IS VITAL TO INCLUDE AND ENGAGE DIVERSE PEOPLE, PERSPECTIVES, AND IDEAS TO ACHIEVE OUR BEST\n\nWHAT YOU WILL DO\n\nSERVICE CUSTOMERS \n\nUSE YOUR PROBLEM-SOLVING SKILLS TO CONDUCT PREVENTATIVE AND CORRECTIVE MAINTENANCE ON LAUNDRIES AND DISH MACHINES, DISPENSING EQUIPMENT, AND SYSTEMSASSIST IN THE INSTALLATION OF EQUIPMENT AND SOLUTIONSDEMONSTRATE SAFE EQUIPMENT USE, ENSURING YOUR CUSTOMERS’ OPERATIONS ARE FULLY FUNCTIONAL, AND TEAMS ARE PROPERLY TRAINEDPROVIDE EMERGENCY SERVICE TO EXISTING CUSTOMERS VIA PHONE OR IN PERSON, AS NEEDEDMANAGE EQUIPMENT, PARTS, AND INVENTORY TO CONTROL COSTS\n\nPROVIDE SOLUTIONS \n\nCOMMUNICATE OUR TOTAL VALUE TO THE CUSTOMER TO MEET THEIR NEEDS AND GROW SALES WITHIN EXISTING CUSTOMER ACCOUNTSLEVERAGE TOOLS AND TECHNOLOGY (INCLUDING TABLET AND MOBILE PHONE APPS) TO CONDUCT SERVICE VISITS AND RECOMMEND UNIQUE PROGRAMS AND SOLUTIONS TO CUSTOMERS\n\nPOSITION DETAILS\n\nTHIS IS A FIELD-BASED POSITION AND MAY REQUIRE TRAVEL TO THE FOLLOWING LOCATIONS AND SURROUNDING AREAS:\n\nMILTON, NAVARRE, GULF BREEZE\n\nAFTER COMPLETING AN INITIAL TRAINING PROGRAM, YOU WILL BE SERVICING ESTABLISHED CUSTOMERS INCLUDING RESTAURANTS, HOTELS, SCHOOLS, LONG-TERM CARE FACILITIES, AND MORE WITHIN AN ASSIGNED TERRITORY. IN SOME CASES, WHERE A TERRITORY IS NOT IMMEDIATELY AVAILABLE, ASSOCIATES WILL BE ASSIGNED A SUPPORTING ROLE UNTIL A TERRITORY ASSIGNMENT BECOMES AVAILABLE.\n\nWEEKEND ROTATION\n\nGENERALLY, 1 IN EVERY 3 WEEKENDS ARE REQUIRED (BASED ON BUSINESS DEMAND)\n\nMINIMUM QUALIFICATIONS\n\nHIGH SCHOOL DIPLOMA OR GED1 YEAR OF MECHANICAL SERVICE, CUSTOMER SERVICE, FOOD SERVICE OR HOSPITALITY INDUSTRY-RELATED EXPERIENCE OR ASSOCIATES DEGREEAVAILABILITY TO PROVIDE EMERGENCY ASSISTANCE TO CUSTOMERS WHICH MAY OCCUR AT NIGHT, ON WEEKENDS AND OVER HOLIDAYSPOSITION REQUIRES A CURRENT AND VALID DRIVER'S LICENSENO IMMIGRATION SPONSORSHIP AVAILABLE\n\nPHYSICAL DEMANDS\n\nPOSITION REQUIRES THE PERFORMANCE OF ALL ESSENTIAL FUNCTIONS OF THE JOB, WITH OR WITHOUT REASONABLE ACCOMMODATION, INCLUDING:\n\nLIFTING 50 LBS. FREQUENTLYPUSHING/PULLING OCCASIONALLYSTANDING/BENDING/STOOPING FREQUENTLYWORKING IN CONFINED SPACESDISTINGUISHING COLOR (TOOLS MAY BE ACCOMMODATED)ABILITY TO WORK OVERTIMEDRIVE A COMPANY VEHICLE AS REQUIRED TO PERFORM JOB DUTIES (PRE-EMPLOYMENT AND ONGOING MOTOR VEHICLE RECORD CHECKS WILL BE PERFORMED TO DETERMINE ELIGIBILITY TO DRIVE A COMPANY VEHICLE)\n\nPREFERRED QUALIFICATIONS\n\nASSOCIATES DEGREE OR OTHER ADVANCED TRAINING OR CERTIFICATIONSPREVIOUS MECHANICAL PROBLEM-SOLVING EXPERIENCE (E.G. PLUMBING, ELECTRICAL, HVAC AND/OR MECHANICAL EXPERIENCE) IN A MILITARY ENVIRONMENT AND/OR INDUSTRIES RELATED TO FOOD SERVICE, LAUNDRY, HOUSEKEEPING, HOSPITALITY AND/OR POOL AND SPA\n\nABOUT ECOLAB INSTITUTIONAL\n\nOUR INSTITUTIONAL TEAM POWERS POSITIVE OUTCOMES FOR CUSTOMERS GLOBALLY IN HOSPITALITY, FOODSERVICE, LONG-TERM CARE, AND OTHER INDUSTRIES BY DELIVERING WHAT MATTERS MOST TO THEM: DELIGHTED GUESTS, PROTECTED REPUTATIONS AND OPTIMIZED OPERATIONS. WE BUILD LONG-LASTING RELATIONSHIPS THROUGH UNMATCHED EXPERTISE, SCIENCE-BASED GUIDANCE AND ACTIONABLE INSIGHTS IN CLEANLINESS, FOOD SAFETY, PUBLIC HEALTH AND MORE. OUR WORK SAFEGUARDS OUR CUSTOMERS’ BRANDS, AS WELL AS THEIR GUESTS AND EMPLOYEES.\n\nBENEFITS\n\nECOLAB STRIVES TO PROVIDE COMPREHENSIVE AND MARKET-COMPETITIVE BENEFITS TO MEET THE NEEDS OF OUR ASSOCIATES AND THEIR FAMILIES. CLICK HERE TO SEE OUR BENEFITS.\n\nIF YOU ARE VIEWING THIS POSTING ON A SITE OTHER THAN OUR ECOLAB CAREER WEBSITE, VIEW OUR BENEFITS AT JOBS.ECOLAB.COM/WORKING-HERE.\n\nCOVID-19 VACCINE NOTICE\n\nDUE TO LOCAL MANDATES AND CUSTOMER REQUIREMENTS, APPLICANTS FOR CERTAIN CUSTOMER-FACING POSITIONS MUST BE FULLY VACCINATED (WHICH IN SOME SITUATIONS REQUIRES A BOOSTER IF ELIGIBLE), UNLESS A RELIGIOUS OR MEDICAL ACCOMMODATION IS REQUESTED BY THE APPLICANT AND APPROVED BY ECOLAB.\n\nAMERICANS WITH DISABILITIES ACT (ADA)\n\nECOLAB WILL PROVIDE REASONABLE ACCOMMODATION (SUCH AS A QUALIFIED SIGN LANGUAGE INTERPRETER OR OTHER PERSONAL ASSISTANCE) WITH OUR APPLICATION PROCESS UPON REQUEST AS REQUIRED TO COMPLY WITH APPLICABLE LAWS. IF YOU HAVE A DISABILITY AND REQUIRE ACCOMMODATION ASSISTANCE IN THIS APPLICATION PROCESS, PLEASE VISIT THE RECRUITING SUPPORT LINK IN THE FOOTER OF EACH PAGE OF OUR CAREER WEBSITE.\n\nOUR COMMITMENT TO DIVERSITY AND INCLUSION\n\nAT ECOLAB, WE BELIEVE THE BEST TEAMS ARE DIVERSE AND INCLUSIVE, AND WE ARE ON A JOURNEY TO CREATE A WORKPLACE WHERE EVERY ASSOCIATE CAN GROW AND ACHIEVE THEIR BEST. WE ARE COMMITTED TO FAIR AND EQUAL TREATMENT OF ASSOCIATES AND APPLICANTS. WE RECRUIT, HIRE, PROMOTE, TRANSFER AND PROVIDE OPPORTUNITIES FOR ADVANCEMENT ON THE BASIS OF INDIVIDUAL QUALIFICATIONS AND JOB PERFORMANCE. IN ALL MATTERS AFFECTING EMPLOYMENT, COMPENSATION, BENEFITS, WORKING CONDITIONS, AND OPPORTUNITIES FOR ADVANCEMENT, WE WILL NOT DISCRIMINATE AGAINST ANY ASSOCIATE OR APPLICANT FOR EMPLOYMENT BECAUSE OF RACE, RELIGION, COLOR, CREED, NATIONAL ORIGIN, CITIZENSHIP STATUS, SEX, SEXUAL ORIENTATION, GENDER IDENTITY AND EXPRESSIONS, GENETIC INFORMATION, MARITAL STATUS, AGE, DISABILITY, OR STATUS AS A COVERED VETERAN.\n\nIN ADDITION, WE ARE COMMITTED TO FURTHERING THE PRINCIPLES OF EQUAL EMPLOYMENT OPPORTUNITY (EEO) THROUGH AFFIRMATIVE ACTION (AA). OUR GOAL IS TO FULLY UTILIZE MINORITY, FEMALE, DISABLED AND COVERED VETERAN INDIVIDUALS AT ALL LEVELS OF THE WORKFORCE. ECOLAB IS A PLACE WHERE YOU CAN GROW YOUR CAREER, OWN YOUR FUTURE AND IMPACT WHAT MATTERS.\n\nWE WILL CONSIDER FOR EMPLOYMENT ALL QUALIFIED APPLICANTS, INCLUDING THOSE WITH CRIMINAL HISTORIES, IN A MANNER CONSISTENT WITH THE REQUIREMENTS OF APPLICABLE STATE AND LOCAL LAWS, INCLUDING THE CITY OF LOS ANGELES’ FAIR CHANCE INITIATIVE FOR HIRING ORDINANCE AND THE SAN FRANCISCO FAIR CHANCE ORDINANCE.",
    "job_skill_set": [
      "customer service",
      "problem-solving",
      "inventory management",
      "safety training",
      "driving",
      "communication",
      "self-motivation",
      "time management",
      "teamwork",
      "adaptability",
      "customer relationship management",
      "flexibility",
      "problem-solving mindset",
      "mechanical service",
      "preventative maintenance",
      "corrective maintenance",
      "equipment installation",
      "tablet and mobile apps"
    ],
    "short_keywords": [
      "adaptability",
      "and",
      "apps",
      "communication",
      "corrective",
      "customer",
      "driving",
      "equipment",
      "flexibility",
      "installation",
      "inventory",
      "maintenance",
      "management",
      "mechanical",
      "mindset",
      "mobile",
      "preventative",
      "problemsolving",
      "relationship",
      "representative",
      "safety",
      "sales",
      "selfmotivation",
      "service",
      "tablet",
      "teamwork",
      "territory",
      "time",
      "training"
    ]
  },
  {
    "job_id": "3900939460",
    "job_title": "Sales Consultant",
    "category": "SALES",
    "job_description": "COMPANY DESCRIPTION\n WE SUGGEST YOU ENTER DETAILS HERE.\n ROLE DESCRIPTION\n THIS IS A FULL-TIME ON-SITE ROLE AS A SALES CONSULTANT AT ALTURA HOMES LOCATED IN CANTON, TX. AS A SALES CONSULTANT, YOU WILL BE RESPONSIBLE FOR PROMOTING AND SELLING HOMES, PROVIDING EXCELLENT CUSTOMER SERVICE, AND GUIDING CUSTOMERS THROUGH THE HOME BUYING PROCESS. YOUR RESPONSIBILITIES WILL ALSO INCLUDE CONDUCTING MARKET RESEARCH, DEVELOPING SALES STRATEGIES, AND MAINTAINING RELATIONSHIPS WITH CLIENTS. THIS IS AN EXCITING OPPORTUNITY TO JOIN A REPUTABLE COMPANY AND CONTRIBUTE TO ITS GROWTH.\n QUALIFICATIONS\n PRIOR EXPERIENCE IN SALES OR A RELATED FIELDEXCELLENT COMMUNICATION AND INTERPERSONAL SKILLSSTRONG NEGOTIATION SKILLSABILITY TO WORK INDEPENDENTLY AND AS PART OF A TEAMKNOWLEDGE OF THE REAL ESTATE INDUSTRY AND CURRENT MARKET TRENDSATTENTION TO DETAIL AND STRONG ORGANIZATIONAL SKILLSPROFICIENCY IN MICROSOFT OFFICE SUITEFAMILIARITY WITH CRM SOFTWARE IS A PLUSHIGH SCHOOL DIPLOMA OR EQUIVALENT; BACHELOR'S DEGREE PREFERRED",
    "job_skill_set": [
      "sales",
      "customer service",
      "market research",
      "sales strategies",
      "Microsoft Office Suite",
      "communication",
      "interpersonal skills",
      "teamwork",
      "independence",
      "attention to detail",
      "organizational skills",
      "real estate knowledge",
      "CRM software",
      "negotiation"
    ],
    "short_keywords": [
      "attention",
      "communication",
      "consultant",
      "crm",
      "customer",
      "detail",
      "estate",
      "independence",
      "interpersonal",
      "knowledge",
      "market",
      "microsoft",
      "negotiation",
      "office",
      "organizational",
      "real",
      "research",
      "sales",
      "service",
      "skills",
      "software",
      "strategies",
      "suite",
      "teamwork",
      "to"
    ]
  },
  {
    "job_id": "3900967044",
    "job_title": "Sales Associate",
    "category": "SALES",
    "job_description": "SALES ASSOCIATE\nWHO WE ARENOTHING EXPRESSES STYLE AND PERSONALITY LIKE A FRESH PAIR OF KICKS! AT KIZIK, WE BELIEVE THAT THERE’S MORE TO LIFE THAN TYING SHOES. WE ARE THE HOME OF HANDS-FREE SHOES.\nWE OFFER THE PERFECT FUSION OF FASHION AND FUNCTIONALITY - OUR SHOES ARE MADE WITH THE HIGHEST GRADE MATERIALS, SO THEY LIVE UP TO OUR PROMISE OF MAKING EVERYDAY SHOE WEAR EASIER. WE TAKE PRIDE IN OUR DESIGNS!\nWHY DO PEOPLE WANT TO WORK AT KIZIK? WELL, A GROWING COMPANY THAT’S DISRUPTING THE FOOTWEAR INDUSTRY IS BOUND TO GET ATTENTION. BUT IT'S MORE THAN THAT. IF YOU LIKE COLLABORATING WITH SUPER-SMART PEOPLE WHO KNOW HOW TO MAKE HARD WORK FUN, YOU WANT TO MAKE A DIFFERENCE, AND YOU WANT TO BE IN AN ENVIRONMENT WHERE PEOPLE LOVE TO SEE YOU GROW, COME JOIN OUR TEAM. WE’RE LOOKING FOR PEOPLE WHO ARE AS PASSIONATE ABOUT BRINGING JOY TO THE EVERYDAY AS WE ARE.\nWHAT YOU’LL DOCOME “KICK IT” WITH US! AS A KIZIK SALES ASSOCIATE, YOU’LL BE RESPONSIBLE FOR ENGAGING WITH CUSTOMERS AND ADHERING TO SALES FLOOR OPERATIONS. YOUR RESPONSIBILITIES WILL INCLUDE (BUT ARE NOT LIMITED TO):\nSHARING THE KIZIK BRAND STORY AND PRODUCT KNOWLEDGE WITH CUSTOMERSFORMING CUSTOMER RELATIONSHIPS FOR THE BRAND TRANSACTING POS SALES ACCURATELY AND MAINTAIN REPORTING AS NECESSARYTAKING PART IN STORE BUILD-OUT AND ASSISTING WITH ON-GOING VISUAL MERCHANDISING OF THE STORE AND PRODUCTSUPPORTING THE PLANNING AND EXECUTION OF IN-STORE SPECIAL EVENTSDAILY STORE OPERATIONS AND MAINTENANCE INCLUDING LIGHT CLEANING, TRASH, RECEIVING SHIPMENT, ORGANIZING STOCK, ETC\nWHAT WE’RE LOOKING FORFUN, EASY-GOING PEOPLE WHO:\nHAVE A PASSION FOR CUSTOMER SERVICE AND HOSPITALITYPOSSESS EXCELLENT COMMUNICATION SKILLSARE ORGANIZED AND HAVE A KEEN ATTENTION TO DETAILARE PROACTIVE, SELF-MOTIVATED AND EAGER TO LEARN NEW THINGS HAVE THE ABILITY TO WORK FLEXIBLE SHIFTS - INCLUDING WEEKENDS AND HOLIDAYS\nCOMPENSATION AND PERKSCOMPETITIVE PAYPERFORMANCE-BASED BONUS INCENTIVEEMPLOYEE DISCOUNTFREE SHOES!",
    "job_skill_set": [
      "reporting",
      "customer service",
      "communication",
      "attention to detail",
      "proactivity",
      "self-motivation",
      "team collaboration",
      "flexibility",
      "POS transactions",
      "visual merchandising",
      "stock organization"
    ],
    "short_keywords": [
      "associate",
      "attention",
      "collaboration",
      "communication",
      "customer",
      "detail",
      "flexibility",
      "merchandising",
      "organization",
      "pos",
      "proactivity",
      "reporting",
      "sales",
      "selfmotivation",
      "service",
      "stock",
      "team",
      "to",
      "transactions",
      "visual"
    ]
  },
  {
    "job_id": "3902758181",
    "job_title": "Seasonal Sales Associate",
    "category": "SALES",
    "job_description": "JOB OVERVIEW\n\nTHE CONSULTANT IS RESPONSIBLE FOR ALL ASPECTS OF THE CUSTOMER EXPERIENCE WITHIN MULTIPLE-BUSINESSES (RETAIL, RENTAL, CUSTOM, AND OMNI-CHANNEL) WITHIN A STORE LOCATION. TO BE SUCCESSFUL IN THIS ROLE THE CONSULTANT NEEDS TO SUPPORT AND POSITIVELY IMPACT A CULTURE OF CUSTOMER-OBSESSION, BY BEING CUSTOMER-READY AND DELIVERING A WORLD-CLASS EXPERIENCE EACH AND EVERY DAY. THE CONSULTANT IS EXPECTED TO ENGAGE AS A MEMBER OF A HIGH-PERFORMING TEAM THROUGH TRUST, COMMITMENT, AND A FOCUS ON RESULTS. THE CONSULTANT MUST NAVIGATE THROUGH CHANGE IN ORDER TO ADAPT TO NEW PROGRAMS IN A TIMELY MANNER AND TO ACHIEVE THE EXPECTED OUTCOME. IN ADDITION THE CONSULTANT WILL CONTRIBUTE TO A HEALTHY CULTURE BY WORKING WELL WITH AND DEMONSTRATING RESPECT FOR COLLEAGUES AT ALL LEVELS AND CONSISTENTLY CONTRIBUTE TO A POSITIVE WORK ENVIRONMENT.\n\nESSENTIAL FUNCTIONS\n\n CONSISTENTLY DEMONSTRATE THE BENCHMARK SELLING TECHNIQUES FOR RETAIL SALES, CUSTOM CLOTHING SALES, AND SPECIAL OCCASION RENTALS, AS TRAINED BY MANAGEMENT AND AS DESCRIBED IN CORPORATE TRAINING MATERIALS. CONTINUOUSLY ENCOURAGE AND PARTICIPATE IN TEAM SELLING. BUILD A RELATIONSHIP WITH YOUR CUSTOMER FROM GREETING THROUGH POST-SALE CONTACT. PARTICIPATE IN MONITORING AND POSITIVELY IMPACT THE ACHIEVEMENT OF THE STORE SALES VOLUME AND METRICS GOALS. MEET AND MAINTAIN YOUR OWN PERSONAL VOLUME GOAL WHILE MAINTAINING AN ABOVE AVERAGE QUALITY OF SALE. WHEN POSSIBLE USE TAILORS FOR ALL ALTERATION FITTINGS. WHEN TAILORS ARE NOT AVAILABLE, BE ABLE TO ACCURATELY FIT THE CUSTOMER AND PROVIDE RECOMMENDATIONS FOR ALTERATIONS. ASSIST IN RECEIVING SHIPMENTS, PUTTING AWAY NEW MERCHANDISE, MAINTAINING A CLEAN, NEAT, SIZED AND ORGANIZED STORE BASED ON OUR MERCHANDISING TO SELL STANDARDS. ASSIST WITH VISUALLY MERCHANDISING THE STORE, INCLUDING COMPLYING WITH BRAND STANDARDS WITH REGARD TO ALL VISUAL MERCHANDISING TASKS. HELP MONITOR THE SECURITY OF ALL COMPANY PROPERTY. REPORT OR DOCUMENT DAMAGED OR MISSING PRODUCT. ASSIST IN CONDUCTING MERCHANDISE STOCK COUNTS AS REQUESTED BY YOUR STORE MANAGEMENT TEAM. REPORT ANY DISCREPANCIES TO THE MANAGER ON DUTY. EFFECTIVELY PARTICIPATE AS A MEMBER OF A STORE TEAM WHERE EMPLOYEES ARE HELD ACCOUNTABLE FOR NOT ONLY INDIVIDUAL PERFORMANCE, BUT ALSO FOR INTERACTING WITH THE GREATER STORE TEAM IN MANNER THAT SUPPORTS THE ACHIEVEMENT OF ESTABLISHED TEAM GOALS. MAINTAIN A WORKPLACE FREE OF HARASSMENT AND DISCRIMINATION BY STRICTLY ADHERING TO THE COMPANY’S ANTI-DISCRIMINATION AND HARASSMENT POLICIES AND PROMPTLY REPORTING TO YOUR REGIONAL MANAGER, ZONE VICE PRESIDENT AND THE HUMAN RESOURCES DEPARTMENT ANY CONCERNS THAT MAY ARISE UNDER THOSE POLICIES.\n\nPHYSICAL REQUIREMENTS\n\n ABILITY TO STAND AND WALK FOR THE MAJORITY OF WORK SHIFT, FREQUENTLY BEND, SQUAT AND TWIST, LIFT UP TO 50 LBS., CLIMB A LADDER TO REACH MERCHANDISE AND OR SUPPLIES, AND SEE AND DISTINGUISH BETWEEN FABRIC PATTERNS AND COLORS.\n\nYOU MAY HAVE THE OPPORTUNITY TO VOLUNTARILY WORK BETWEEN MULTIPLE STORE OR SITE LOCATIONS, AND ACROSS MULTIPLE BRANDS. \n\nREASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS.\n\nOUR COMPANY CELEBRATES DIVERSITY AND PROVIDES EQUAL EMPLOYMENT OPPORTUNITY TO ALL APPLICANTS AND EMPLOYEES WITHOUT REGARD TO RACE, COLOR, SEX, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, NATIONAL ORIGIN, RELIGION, VETERAN OR MILITARY STATUS, AGE, PHYSICAL OR MENTAL DISABILITY, MARITAL STATUS, OR ANY OTHER PROTECTED STATUS UNDER THE LAW.\n\nWORK LOCATIONS: 04635 PLAZA 173 17330 W BLUEMOUND RD BROOKFIELD 53045\n\nJOB: SALES\n\nORGANIZATION: MEN'S WEARHOUSE\n\nSHIFT: VARIABLE\n\nZONE: MIDWEST",
    "job_skill_set": [
      "retail sales",
      "customer service",
      "sales metrics analysis",
      "product knowledge",
      "communication",
      "teamwork",
      "adaptability",
      "problem solving",
      "customer relationship building",
      "respectfulness",
      "accountability",
      "positive attitude",
      "visual merchandising",
      "alteration fitting",
      "inventory management",
      "team selling"
    ],
    "short_keywords": [
      "accountability",
      "adaptability",
      "alteration",
      "analysis",
      "associate",
      "attitude",
      "building",
      "communication",
      "customer",
      "fitting",
      "inventory",
      "knowledge",
      "management",
      "merchandising",
      "metrics",
      "positive",
      "problem",
      "product",
      "relationship",
      "respectfulness",
      "retail",
      "sales",
      "seasonal",
      "selling",
      "service",
      "solving",
      "team",
      "teamwork",
      "visual"
    ]
  },
  {
    "job_id": "3899525451",
    "job_title": "Outside Sales Representative",
    "category": "SALES",
    "job_description": "CONLAN TIRE IS SEEKING A SUCCESSFUL AND DRIVEN SALESPERSON TO PURSUE AND CULTIVATE NEW BUSINESS RELATIONSHIPS. THIS POSITION REQUIRES AN ENTHUSIASTIC, POSITIVE ATTITUDE AND THE ABILITY TO CHANGE QUICKLY TO MEET CUSTOMER DEMANDS AND MARKET CHANGES. NOT ONLY IS THIS ROLE FINANCIALLY REWARDING IN AN ECONOMY PROOF INDUSTRY, IT ALSO PROVIDES AN OPPORTUNITY FOR FUTURE GROWTH AND CAREER ADVANCEMENT WITHIN OUR ORGANIZATION.\nSUPPLEMENTAL BENEFITS:$500 / MONTH TRUCK ALLOWANCE AND FUEL CARDFIRST YEAR GUARANTEED INCENTIVE\nTHE IDEAL CANDIDATE WILL POSSESS THE FOLLOWING:3 YEARS’ EXPERIENCE IN BUSINESS TO BUSINESS SALESKNOWLEDGE OF COMMERCIAL TIRES AND RETREADING A PLUS, BUT NOT REQUIREDABILITY TO MULTITASK AND CONTINUALLY PRIORITIZE A CHANGING WORKLOADSTRONG ORGANIZATIONAL SKILLS AND ATTENTION TO DETAILAN AGGRESSIVE AND COMPETITIVE NATURE TO DRIVE SALES GROWTHTHE CONFIDENCE TO CLOSE A SALESUPERIOR COMMUNICATION SKILLS – INCLUDING LISTENING AND SPEAKING/WRITINGCOLLEGE DEGREE PREFERRED BUT NOT REQUIRED\nDUTIES INCLUDE, BUT ARE NOT LIMITED TO:BUSINESS TO BUSINESS SALES OF NEW TIRES, TIRE RETREADS, AND TIRE RELATED SERVICESWORKING WITH CUSTOMERS TO HELP MANAGE THEIR INVENTORY LEVELS AT SHOP AND WAREHOUSE LOCATIONSDROPPING OFF NEW INVENTORY TO CUSTOMERS AND PICKING UP TIRES THAT WILL BE RETREADED (LARGER INVENTORY LEVELS WILL BE COORDINATED WITH A COMPANY DRIVER)VEHICLE ALLOWANCE AND FUEL CARD PROVIDED\nTHIS POSITION OFFERS A COMPETITIVE SALARY AND BENEFITS PACKAGE, IN ADDITION TO A PERFORMANCE-BASED INCENTIVE PLAN. IF YOU WANT TO BE PART OF A GROWING AND INNOVATIVE GROUP, DRIVEN TO BE A LEADING TIRE SERVICE PROVIDER, APPLY TODAY!",
    "job_skill_set": [
      "inventory management",
      "organizational skills",
      "communication",
      "positive attitude",
      "adaptability",
      "attention to detail",
      "business to business sales",
      "knowledge of commercial tires",
      "sales closing",
      "multitasking",
      "competitive nature"
    ],
    "short_keywords": [
      "adaptability",
      "attention",
      "attitude",
      "business",
      "closing",
      "commercial",
      "communication",
      "competitive",
      "detail",
      "inventory",
      "knowledge",
      "management",
      "multitasking",
      "nature",
      "of",
      "organizational",
      "outside",
      "positive",
      "representative",
      "sales",
      "skills",
      "tires",
      "to"
    ]
  },
  {
    "job_id": "3905878393",
    "job_title": "Sales And Marketing Specialist",
    "category": "SALES",
    "job_description": "SEEKING SALES AND MARKETING SPECIALISTS - NO LICENSE REQUIRED!\n- **NO LICENSE REQUIRED:** JOIN IMPACT HEALTH SHARING AS A SALES AND MARKETING SPECIALIST.- **IMMEDIATE BENEFITS:** EARN UPFRONT COMMISSIONS, BONUSES, AND RESIDUAL INCOME FROM DAY ONE.- **COMPREHENSIVE TRAINING:** ACCESS TAILORED SALES AND MARKETING TRAINING FOR NATIONWIDE SUCCESS.- **TARGET NATIONAL CLIENTS:** CULTIVATE RELATIONSHIPS AND SECURE DEALS WITH CLIENTS ACROSS THE COUNTRY.- **WEEKLY REWARDS:** ENJOY PROMPT PAYMENTS, ENSURING CONSISTENT REWARDS FOR YOUR SALES AND MARKETING EFFORTS.- **LEAD SALES AND MARKETING INITIATIVES:** UTILIZE YOUR SKILLS TO DEVELOP STRATEGIES, GENERATE LEADS, AND DRIVE SALES GROWTH.- **FLEXIBLE OPPORTUNITIES:** CHOOSE BETWEEN FULL-TIME OR PART-TIME ROLES TO SUIT YOUR LIFESTYLE.\nOUR SALES AND MARKETING APPROACH AIMS TO EXPAND ACCESS TO AFFORDABLE HEALTHCARE SOLUTIONS NATIONWIDE. JOIN US AND OFFER PLANS STARTING AT JUST $73 FOR INDIVIDUALS AND $378 FOR FAMILIES OF 3 OR MORE. AS A NON-PROFIT ORGANIZATION, YOU'LL SEAMLESSLY NAVIGATE THE SALES AND MARKETING PROCESS, ALIGNING WITH OUR COMMITMENT TO IMPACTFUL NATIONAL EFFORTS.\n**VISUALIZE THE IMPACT OF SALES AND MARKETING SPECIALISTS:**\nAS A SALES AND MARKETING SPECIALIST, ENVISION THE SIGNIFICANT IMPACT OF YOUR EFFORTS IN PROVIDING NATIONWIDE ACCESS TO AFFORDABLE HEALTHCARE SOLUTIONS, WHILE EARNING UPFRONT COMMISSIONS AND BONUSES. YOUR SKILLS IN SALES AND MARKETING WILL BE CRUCIAL IN DRIVING GROWTH AND EXPANDING OUR REACH. WITH AN IMPRESSIVE 98% CLIENT RETENTION RATE, YOUR CONTRIBUTIONS WILL HELP MAINTAIN OUR POSITION IN THE MARKET.\n**READY TO DRIVE SALES AND MARKETING?**\nAPPLY TODAY AND BECOME A VITAL PART OF OUR TEAM. DON'T MISS THE OPPORTUNITY TO CONTRIBUTE TO EXPANDING ACCESS TO VALUABLE HEALTHCARE SOLUTIONS ACROSS THE NATION!",
    "job_skill_set": [
      "sales",
      "strategic planning",
      "client relationship management",
      "training",
      "communication",
      "teamwork",
      "problem solving",
      "flexibility",
      "initiative",
      "marketing",
      "lead generation"
    ],
    "short_keywords": [
      "and",
      "client",
      "communication",
      "flexibility",
      "generation",
      "initiative",
      "lead",
      "management",
      "marketing",
      "planning",
      "problem",
      "relationship",
      "sales",
      "solving",
      "specialist",
      "strategic",
      "teamwork",
      "training"
    ]
  },
  {
    "job_id": "3894219997",
    "job_title": "Territory Service and Sales Representative",
    "category": "SALES",
    "job_description": "ECOLAB IS HIRING AND WE ARE EXCITED TO TURN YOUR NEXT OPPORTUNITY INTO A CAREER! ARE YOU SOMEONE WHO USES YOUR HANDS-ON SKILLS TO SOLVE PROBLEMS? DO YOU ENJOY THE HOSPITALITY INDUSTRY BUT ARE LOOKING FOR A CAREER THAT ALLOWS FOR A FLEXIBLE SCHEDULE? WE ARE LOOKING FOR SELF-MOTIVATED PEOPLE TO JOIN US IN SOLVING PROBLEMS THROUGH SERVICING EXISTING CUSTOMERS WHILE ALSO GROWING BUSINESS TO ACHIEVE YOUR SALES GOALS.\n\nJOIN ECOLAB AS A TERRITORY SERVICE AND SALES REPRESENTATIVE IN THE WYTHEVILLE , VA MARKET. AS AN INDUSTRY LEADER, WE’RE GROWING AND NEED TALENTED PEOPLE LIKE YOU TO HELP US CONTINUE TO PROTECT THE WORLD’S MOST VITAL RESOURCES. YOU WILL SERVE AS THE FACE OF ECOLAB, SERVICING LAUNDRIES AND DISH MACHINES, DISPENSING EQUIPMENT, AND SYSTEMS FOR OUR CUSTOMERS TO HELP ACHIEVE OUR MUTUAL GOAL OF A CLEANER, SAFER & HEALTHIER ENVIRONMENT FOR ALL.\n\nJOB SNAPSHOT\n\nCOMPANY VEHICLE PROVIDED FOR BUSINESS USEPAID DRIVE TIME (COMMUTE) TO CUSTOMER SITESPARTICIPATE IN BEST-IN-CLASS TRAINING PROGRAMSTART AND END YOUR DAY AT HOMEPRIMARILY DAY SHIFT\n\nWHAT’S IN IT FOR YOU\n\nCOMPREHENSIVE BENEFITS STARTING DAY 1 INCLUDING: MEDICAL, DENTAL, VISION, MATCHING 401K, COMPANY PAID PENSION, STOCK PURCHASE PLAN, PAID TIME OFF (VACATION + DISABILITY BENEFITS) AND MORE!ENJOY A PAID TRAINING PROGRAM (INCLUDING PAID TRAVEL TIME) LEVERAGING A BLENDED APPROACH INCLUDING DIGITAL LEARNING, CLASSROOM TRAINING, LIVE DEMONSTRATIONS, AND ON-THE-JOB TRAINING WITH FIELD PROFESSIONALS TO CERTIFY THAT ASSOCIATES ARE SAFE, CONFIDENT, AND PROFICIENT IN THEIR ROLES. WE OFFER AN AWARD-WINNING TRAINING APPROACH AT A STATE-OF-THE-ART TRAINING FACILITY IN EAGAN, MN. RECEIVE A COMPANY SERVICE VEHICLE AND CELL PHONE FOR BUSINESS USE. WE PAY FOR FUEL, DRIVE TIME TO CUSTOMER SITES, AND TIME FOR SERVICE MAINTENANCE ON YOUR VEHICLE OPPORTUNITIES FOR GROWTH AND DEVELOPMENT: CARVE OUT A LONG TERM, ADVANCED CAREER PATH TOWARDS SERVICE, SALES, OR MANAGEMENT WITH OPPORTUNITY FOR TUITION REIMBURSEMENTINDEPENDENT WORK ENVIRONMENT WHERE YOU WILL MANAGE YOUR MONTHLY SCHEDULEACCESS TO BEST-IN-CLASS RESOURCES, TOOLS, AND TECHNOLOGYGROW YOUR INCOME AS YOU DRIVE GROWTHTHRIVE IN A COMPANY THAT VALUES A CULTURE OF SAFETY TO INCLUDE TOP-NOTCH SAFETY TRAINING (INCLUDING A DEFENSIVE DRIVING COURSE) AND PERSONAL PROTECTION EQUIPMENTTHE OPPORTUNITY TO TAKE ON SOME OF THE WORLD’S MOST MEANINGFUL CHALLENGES, HELPING CUSTOMERS ACHIEVE CLEAN WATER, SAFE FOOD, AND HEALTHY ENVIRONMENTSTHE SUPPORT OF AN ORGANIZATION THAT BELIEVES IT IS VITAL TO INCLUDE AND ENGAGE DIVERSE PEOPLE, PERSPECTIVES, AND IDEAS TO ACHIEVE OUR BEST\n\nWHAT YOU WILL DO\n\nSERVICE CUSTOMERS \n\nUSE YOUR PROBLEM-SOLVING SKILLS TO CONDUCT PREVENTATIVE AND CORRECTIVE MAINTENANCE ON LAUNDRIES AND DISH MACHINES, DISPENSING EQUIPMENT, AND SYSTEMSASSIST IN THE INSTALLATION OF EQUIPMENT AND SOLUTIONSDEMONSTRATE SAFE EQUIPMENT USE, ENSURING YOUR CUSTOMERS’ OPERATIONS ARE FULLY FUNCTIONAL, AND TEAMS ARE PROPERLY TRAINEDPROVIDE EMERGENCY SERVICE TO EXISTING CUSTOMERS VIA PHONE OR IN PERSON, AS NEEDEDMANAGE EQUIPMENT, PARTS, AND INVENTORY TO CONTROL COSTS\n\nPROVIDE SOLUTIONS \n\nCOMMUNICATE OUR TOTAL VALUE TO THE CUSTOMER TO MEET THEIR NEEDS AND GROW SALES WITHIN EXISTING CUSTOMER ACCOUNTSLEVERAGE TOOLS AND TECHNOLOGY (INCLUDING TABLET AND MOBILE PHONE APPS) TO CONDUCT SERVICE VISITS AND RECOMMEND UNIQUE PROGRAMS AND SOLUTIONS TO CUSTOMERS\n\nPOSITION DETAILS\n\nTHIS IS A FIELD-BASED POSITION AND MAY REQUIRE TRAVEL TO THE FOLLOWING LOCATIONS AND SURROUNDING AREAS:\n\nHILLSVILLEGALAX\n\nAFTER COMPLETING AN INITIAL TRAINING PROGRAM, YOU WILL BE SERVICING ESTABLISHED CUSTOMERS INCLUDING RESTAURANTS, HOTELS, SCHOOLS, LONG-TERM CARE FACILITIES, AND MORE WITHIN AN ASSIGNED TERRITORY. IN SOME CASES, WHERE A TERRITORY IS NOT IMMEDIATELY AVAILABLE, ASSOCIATES WILL BE ASSIGNED A SUPPORTING ROLE UNTIL A TERRITORY ASSIGNMENT BECOMES AVAILABLE.\n\nWEEKEND ROTATION\n\nGENERALLY, 2 IN EVERY 6 WEEKENDS ARE REQUIRED (BASED ON BUSINESS DEMAND)\n\nMINIMUM QUALIFICATIONS\n\nHIGH SCHOOL DIPLOMA OR GED1 YEAR OF MECHANICAL SERVICE, CUSTOMER SERVICE, FOOD SERVICE OR HOSPITALITY INDUSTRY-RELATED EXPERIENCE OR ASSOCIATES DEGREEAVAILABILITY TO PROVIDE EMERGENCY ASSISTANCE TO CUSTOMERS WHICH MAY OCCUR AT NIGHT, ON WEEKENDS AND OVER HOLIDAYSPOSITION REQUIRES A CURRENT AND VALID DRIVER'S LICENSENO IMMIGRATION SPONSORSHIP AVAILABLE\n\nPHYSICAL DEMANDS\n\nPOSITION REQUIRES THE PERFORMANCE OF ALL ESSENTIAL FUNCTIONS OF THE JOB, WITH OR WITHOUT REASONABLE ACCOMMODATION, INCLUDING:\n\nLIFTING 50 LBS. FREQUENTLYPUSHING/PULLING OCCASIONALLYSTANDING/BENDING/STOOPING FREQUENTLYWORKING IN CONFINED SPACESDISTINGUISHING COLOR (TOOLS MAY BE ACCOMMODATED)ABILITY TO WORK OVERTIMEDRIVE A COMPANY VEHICLE AS REQUIRED TO PERFORM JOB DUTIES (PRE-EMPLOYMENT AND ONGOING MOTOR VEHICLE RECORD CHECKS WILL BE PERFORMED TO DETERMINE ELIGIBILITY TO DRIVE A COMPANY VEHICLE)\n\nPREFERRED QUALIFICATIONS\n\nASSOCIATES DEGREE OR OTHER ADVANCED TRAINING OR CERTIFICATIONSPREVIOUS MECHANICAL PROBLEM-SOLVING EXPERIENCE (E.G. PLUMBING, ELECTRICAL, HVAC AND/OR MECHANICAL EXPERIENCE) IN A MILITARY ENVIRONMENT AND/OR INDUSTRIES RELATED TO FOOD SERVICE, LAUNDRY, HOUSEKEEPING, HOSPITALITY AND/OR POOL AND SPA\n\nABOUT ECOLAB INSTITUTIONAL\n\nOUR INSTITUTIONAL TEAM POWERS POSITIVE OUTCOMES FOR CUSTOMERS GLOBALLY IN HOSPITALITY, FOODSERVICE, LONG-TERM CARE, AND OTHER INDUSTRIES BY DELIVERING WHAT MATTERS MOST TO THEM: DELIGHTED GUESTS, PROTECTED REPUTATIONS AND OPTIMIZED OPERATIONS. WE BUILD LONG-LASTING RELATIONSHIPS THROUGH UNMATCHED EXPERTISE, SCIENCE-BASED GUIDANCE AND ACTIONABLE INSIGHTS IN CLEANLINESS, FOOD SAFETY, PUBLIC HEALTH AND MORE. OUR WORK SAFEGUARDS OUR CUSTOMERS’ BRANDS, AS WELL AS THEIR GUESTS AND EMPLOYEES.\n\nBENEFITS\n\nECOLAB STRIVES TO PROVIDE COMPREHENSIVE AND MARKET-COMPETITIVE BENEFITS TO MEET THE NEEDS OF OUR ASSOCIATES AND THEIR FAMILIES. CLICK HERE TO SEE OUR BENEFITS.\n\nIF YOU ARE VIEWING THIS POSTING ON A SITE OTHER THAN OUR ECOLAB CAREER WEBSITE, VIEW OUR BENEFITS AT JOBS.ECOLAB.COM/WORKING-HERE.\n\nCOVID-19 VACCINE NOTICE\n\nDUE TO LOCAL MANDATES AND CUSTOMER REQUIREMENTS, APPLICANTS FOR CERTAIN CUSTOMER-FACING POSITIONS MUST BE FULLY VACCINATED (WHICH IN SOME SITUATIONS REQUIRES A BOOSTER IF ELIGIBLE), UNLESS A RELIGIOUS OR MEDICAL ACCOMMODATION IS REQUESTED BY THE APPLICANT AND APPROVED BY ECOLAB.\n\nAMERICANS WITH DISABILITIES ACT (ADA)\n\nECOLAB WILL PROVIDE REASONABLE ACCOMMODATION (SUCH AS A QUALIFIED SIGN LANGUAGE INTERPRETER OR OTHER PERSONAL ASSISTANCE) WITH OUR APPLICATION PROCESS UPON REQUEST AS REQUIRED TO COMPLY WITH APPLICABLE LAWS. IF YOU HAVE A DISABILITY AND REQUIRE ACCOMMODATION ASSISTANCE IN THIS APPLICATION PROCESS, PLEASE VISIT THE RECRUITING SUPPORT LINK IN THE FOOTER OF EACH PAGE OF OUR CAREER WEBSITE.\n\nOUR COMMITMENT TO DIVERSITY AND INCLUSION\n\nAT ECOLAB, WE BELIEVE THE BEST TEAMS ARE DIVERSE AND INCLUSIVE, AND WE ARE ON A JOURNEY TO CREATE A WORKPLACE WHERE EVERY ASSOCIATE CAN GROW AND ACHIEVE THEIR BEST. WE ARE COMMITTED TO FAIR AND EQUAL TREATMENT OF ASSOCIATES AND APPLICANTS. WE RECRUIT, HIRE, PROMOTE, TRANSFER AND PROVIDE OPPORTUNITIES FOR ADVANCEMENT ON THE BASIS OF INDIVIDUAL QUALIFICATIONS AND JOB PERFORMANCE. IN ALL MATTERS AFFECTING EMPLOYMENT, COMPENSATION, BENEFITS, WORKING CONDITIONS, AND OPPORTUNITIES FOR ADVANCEMENT, WE WILL NOT DISCRIMINATE AGAINST ANY ASSOCIATE OR APPLICANT FOR EMPLOYMENT BECAUSE OF RACE, RELIGION, COLOR, CREED, NATIONAL ORIGIN, CITIZENSHIP STATUS, SEX, SEXUAL ORIENTATION, GENDER IDENTITY AND EXPRESSIONS, GENETIC INFORMATION, MARITAL STATUS, AGE, DISABILITY, OR STATUS AS A COVERED VETERAN.\n\nIN ADDITION, WE ARE COMMITTED TO FURTHERING THE PRINCIPLES OF EQUAL EMPLOYMENT OPPORTUNITY (EEO) THROUGH AFFIRMATIVE ACTION (AA). OUR GOAL IS TO FULLY UTILIZE MINORITY, FEMALE, DISABLED AND COVERED VETERAN INDIVIDUALS AT ALL LEVELS OF THE WORKFORCE. ECOLAB IS A PLACE WHERE YOU CAN GROW YOUR CAREER, OWN YOUR FUTURE AND IMPACT WHAT MATTERS.\n\nWE WILL CONSIDER FOR EMPLOYMENT ALL QUALIFIED APPLICANTS, INCLUDING THOSE WITH CRIMINAL HISTORIES, IN A MANNER CONSISTENT WITH THE REQUIREMENTS OF APPLICABLE STATE AND LOCAL LAWS, INCLUDING THE CITY OF LOS ANGELES’ FAIR CHANCE INITIATIVE FOR HIRING ORDINANCE AND THE SAN FRANCISCO FAIR CHANCE ORDINANCE.",
    "job_skill_set": [
      "customer service",
      "problem-solving",
      "inventory management",
      "self-motivation",
      "communication",
      "independent work",
      "flexibility",
      "teamwork",
      "customer relationship management",
      "adaptability",
      "time management",
      "mechanical service",
      "preventative maintenance",
      "corrective maintenance",
      "equipment installation",
      "tablet and mobile apps",
      "safety training",
      "driving"
    ],
    "short_keywords": [
      "adaptability",
      "and",
      "apps",
      "communication",
      "corrective",
      "customer",
      "driving",
      "equipment",
      "flexibility",
      "independent",
      "installation",
      "inventory",
      "maintenance",
      "management",
      "mechanical",
      "mobile",
      "preventative",
      "problemsolving",
      "relationship",
      "representative",
      "safety",
      "sales",
      "selfmotivation",
      "service",
      "tablet",
      "teamwork",
      "territory",
      "time",
      "training",
      "work"
    ]
  },
  {
    "job_id": "3904391566",
    "job_title": "Sleep Expert - Sales",
    "category": "SALES",
    "job_description": "NOW HIRING! \n\nSLEEP EXPERT – SALES \n\nIS YOUR CURRENT JOB A NIGHTMARE? MAKE IT A DREAM!\n\nMATTRESS FIRM\n\nTHE MOST TRUSTED AUTHORITY ON SLEEP\n\nWE’RE NO ORDINARY MATTRESS COMPANY. IN JUST OVER 30 YEARS, MATTRESS FIRM HAS BECOME AMERICA’S LARGEST SPECIALTY MATTRESS RETAILER. WITH MORE THAN 2,400 STORES NATIONWIDE AND A TEAM OF MORE THAN 6,000 SLEEP EXPERTS®, WE HAVE HELPED MILLIONS OF PEOPLE GET BETTER SLEEP. THAT’S WHO WE ARE AND WHAT WE DO—BECAUSE EVERYONE DESERVES A GREAT NIGHT’S SLEEP.\n\nHELPING PEOPLE SLEEP WELL SO THEY LIVE WELL\n\nDID YOU KNOW WE SPEND A THIRD OF OUR LIVES IN BED? THAT’S WHY OUR PRIORITY IS MAKING SURE EVERYONE’S EIGHT HOURS ARE PERFECT. WE’RE LOOKING FOR PASSIONATE, AMBITIOUS PEOPLE: INNOVATORS, ACTION TAKERS, GROWTH SEEKERS AND LIFE CHANGERS. YOUR JOURNEY WILL BEGIN WITH AN EXTENSIVE, CUSTOMER-CENTRIC RETAIL SALES TRAINING PROGRAM THAT EMPOWERS YOU TO CREATE A LIFE-CHANGING IN-STORE EXPERIENCE AND HELP CUSTOMERS BUILD THE PERFECT SLEEP SANCTUARY. HELPING PEOPLE SLEEP WELL SO THEY LIVE WELL IS AT THE CORE OF WHAT WE DO. THE RIGHT MATTRESS MATTERS, AND SO DOES THE RIGHT CAREER.\n\nMATTRESS FIRM TAKES PRIDE IN OUR PURPOSE OF HELPING PEOPLE SLEEP WELL TO LIVE WELL, AND WE DEEPLY INVEST IN EVERY NEW SALES ASSOCIATE COMING ON BOARD TO LIVE UP TO THAT PROMISE. OUR AWARD-WINNING TALENT DEVELOPMENT PROGRAMS INCLUDE AN EDUCATION PATH DESIGNED TO SUPPORT ALL NEW SALES ASSOCIATES' LEARNING PROFICIENCY FOR SPECIALTY RETAIL. NOT ONLY DO WE INVEST IN TRAINING, BUT ALL NEW SALES ASSOCIATES ARE ELIGIBLE FOR A PERFORMANCE-BASED BONUS AFTER THEIR SIXTH MONTH OF EMPLOYMENT.\n\nWHY WORK FOR MATTRESS FIRM?\n\nOUR TEAMS ARE PASSIONATE, AND OUR CULTURE IS INSPIRING YOU’LL BE SURROUNDED BY AMBITIOUS PEOPLE: INNOVATORS, ACTION TAKERS; LIFE CHANGERS THAT WILL INSPIRE YOU EXCELLENT GROWTH OPPORTUNITIES THROUGH EDUCATION AND DEVELOPMENT PROGRAMS GREAT BENEFITS GET PAID ON DEMAND MENTAL HEALTH AND LIFE RESOURCES GREAT EMPLOYEE DISCOUNTS: MATTRESSES AND SLEEP ACCESSORIES CELL PHONES AND ELECTRONICS TRAVEL CAR AND HOME LOANS AND MORE MEDICAL, DENTAL, PRESCRIPTION, AND VISION PLANS 401(K) WITH EMPLOYER MATCHING SOME POSITIONS HAVE BASE PAY OR UNCAPPED COMMISSION \n\nJOB DESCRIPTION\n\nTHE SLEEP EXPERT WILL ELEVATE AND ENHANCE THE CUSTOMER'S IN-STORE EXPERIENCE BY BEING A TRUSTED SLEEP AUTHORITY AND OFFERING BEST-IN-CLASS PRODUCTS. SLEEP EXPERTS WILL EXECUTE THE MATTRESS FIRM SELLING PROGRAMS AND SUPPORT A SEAMLESS OMNI-CHANNEL EXPERIENCE TO CREATE A COMPELLING AND ENGAGING ENVIRONMENT THAT PUTS THE CUSTOMER AT THE CENTER.\n\nCREATE AN ENVIRONMENT WHERE THE CUSTOMER IS ALWAYS AT THE CENTER BY CULTIVATING STRONG RELATIONSHIPS PROVIDE TECHNICAL AND PRODUCT KNOWLEDGE INFORMATION TO CUSTOMERS, SERVE AS SUBJECT MATTER EXPERT DRIVE INDIVIDUAL SALES PERFORMANCE AND KPIS WHILE DEMONSTRATING COMPANY VALUES AND SUPPORTING COMPANY INITIATIVES EXECUTE CURRENT VISUAL MERCHANDISING AND POP STANDARDS ADHERE TO COMPANY MERCHANDISING AND MARKETING PROGRAMS TO STANDARD FOLLOW COMPANY POLICY AND EXECUTE COMPANY STANDARDS ON APPEARANCE AND FUNCTIONALITY MAINTAIN CUSTOMER RELATIONSHIPS DURING AND POST-PURCHASE (E.G., RESOLVING ISSUES, DELIVER REMINDERS, RESOLVING CONCERNS ETC.) SEEK AND ACCEPT CONSTRUCTIVE FEEDBACK FOR CONTINUOUS PERSONAL, PROFESSIONAL AND PERFORMANCE DEVELOPMENT CONTINUE TO DEVELOP SKILLS, COMPETENCIES, PRODUCT KNOWLEDGE THROUGH ASSIGNED COURSE WORK, TRAINING AND OTHER COMPANY LED ACTIVITIES MAINTAIN AWARENESS OF COMPETITION, ADVERTISEMENTS AND SERVICES OFFERED, DEVELOP STRATEGIES TO COUNTER LEVERAGE SOCIAL MEDIA TO POSITIVELY IMPACT BRAND AWARENESS AND INCREASE SALES ENSURE TIMELY OPEN AND CLOSING PROCEDURES FOLLOW ALL COMPANY PROCEDURES ON CASH HANDLING INCLUDING ACCEPTANCE OF PAYMENT AND DEPOSIT PROCESSES ABILITY TO PUSH AND PULL AND LIFT UP TO 50 POUNDS TO ASSIST CUSTOMERS WITH LOAD OUTS AND IN STORE PURCHASES ADHERE TO ALL SALES PROCESSING POLICIES TO ENSURE THE PROPER CREATION AND EXECUTION OF CUSTOMER INVOICING PROFESSIONAL COMMUNICATION AND REPRESENTATION OF COMPANY BRAND IN ALL INTERNAL AND EXTERNAL INTERACTIONS COMPLETE ALL REQUIRED TRAINING MODULES AND CERTIFICATIONS PRIOR TO THE DUE DATE ENSURE ALL SAFETY POLICIES AND PROCEDURES ARE FOLLOWED TO MAINTAIN A SAFE WORK ENVIRONMENT FOR ALL COMMUNICATE PROFESSIONALLY WITH ALL INTERNAL AND EXTERNAL CONTACTS FOLLOW ALL COMPANY POLICIES AND EXECUTE COMPANY STANDARDS ON APPEARANCE AND FUNCTIONALITY AS WELL AS APPROPRIATE BRAND REPRESENTATION COMMUNICATES ANY CONCERNS OR ISSUES TO LEADERSHIP TO ENSURE PROPER EFFICIENCY OF DEPARTMENT AND COMPANY OPERATIONS \n\nLIFE AT MATTRESS FIRM\n\nOUR MISSION AND VISION\n\nAS AMERICA’S MOST TRUSTED AUTHORITY ON SLEEP, OUR MISSION IS TO HELP PEOPLE FIND THE MATTRESS OF THEIR DREAMS. WITH LOW PRICES, THE BEST BRANDS AND THE KNOWLEDGE OF OUR SLEEP EXPERTS®, WE MAKE IT EASY TO GET A GREAT NIGHT’S SLEEP, EVERY NIGHT.\n\nHISTORY\n\nIN JUST OVER 30 YEARS, MATTRESS FIRM HAS BECOME AMERICA’S LARGEST SPECIALTY MATTRESS RETAILER. WITH MORE THAN 2,400 STORES NATIONWIDE AND A TEAM OF MORE THAN 6,000 SLEEP EXPERTS®, WE HAVE HELPED MILLIONS OF PEOPLE GET BETTER SLEEP.\n\nBENEFITS BEYOND A PAYCHECK\n\nWE SUPPORT YOU JUST LIKE WE SUPPORT OUR CUSTOMERS—THAT’S WHY WE OFFER AN EXTENSIVE RANGE OF BENEFITS DESIGNED TO SUPPORT YOU, YOUR FAMILY, AND YOUR FUTURE.\n\nDIVERSITY, EQUITY AND INCLUSION\n\nWE BELIEVE IN AN INCLUSIVE ENVIRONMENT THAT ATTRACTS, DEVELOPS AND RETAINS TOP TALENT. OUR DIVERSITY, EQUITY & INCLUSION COUNCIL WORKS TO PROMOTE THE CULTIVATION OF A WORK ENVIRONMENT THAT EMBRACES AND CELEBRATES ALL THE INDIVIDUALS, BACKGROUNDS AND PERSPECTIVES THAT REFLECT THE COMMUNITIES WE SERVE.\n\nGIVING BACK TO OUR COMMUNITY\n\nWHETHER IT’S VOLUNTEERING AT A FOSTER CARE AGENCY, FOOD BANK OR EVEN AN ANIMAL SHELTER, WE BELIEVE IN GIVING BACK TO OUR ASSOCIATES AND THE COMMUNITIES THEY LIVE AND WORK IN. THAT'S WHY WE'RE PROUD TO SUPPORT ORGANIZATIONS DEDICATED TO HELPING PEOPLE FOLLOW THEIR DREAMS AND THRIVE.\n\nDIVERSE CANDIDATES ARE ENCOURAGED TO APPLY\n\nMATTRESS FIRM IS AN EQUAL EMPLOYMENT OPPORTUNITY EMPLOYER AND IS COMMITTED TO MAINTAINING A NON-DISCRIMINATORY WORK ENVIRONMENT AND DOES NOT DISCRIMINATE AGAINST ANY APPLICANT OR EMPLOYEE FOR EMPLOYMENT ON THE BASIS OF RACE, COLOR, RELIGION, SEX, NATIONAL ORIGIN, AGE, DISABILITY, VETERAN STATUS, MARITAL STATUS, SEXUAL ORIENTATION, GENDER IDENTITY, OR ANY OTHER CHARACTERISTIC PROTECTED BY APPLICABLE LAW. MATTRESS FIRM IS COMMITTED TO CREATING A DYNAMIC WORK ENVIRONMENT THAT VALUES DIVERSITY AND INCLUSION, RESPECT AND INTEGRITY, CUSTOMER FOCUS, AND INNOVATION.\n\nPAY RANGE\n\n60,000-85,000\n\nNOW DON’T FALL ASLEEP OUT THERE… THE SOONER THAT WE RECEIVE YOUR APPLICATION, THE CLOSER YOU ARE TO THE CAREER OF YOUR DREAMS!\n\nDIVERSE CANDIDATES ARE ENCOURAGED TO APPLY\n\nMATTRESS FIRM IS AN EQUAL EMPLOYMENT OPPORTUNITY EMPLOYER AND IS COMMITTED TO MAINTAINING A NON-DISCRIMINATORY WORK ENVIRONMENT, AND DOES NOT DISCRIMINATE AGAINST ANY APPLICANT OR EMPLOYEE FOR EMPLOYMENT ON THE BASIS OF RACE, COLOR, RELIGION, SEX, NATIONAL ORIGIN, AGE, DISABILITY, VETERAN STATUS, MARITAL STATUS, SEXUAL ORIENTATION, GENDER IDENTITY, OR ANY OTHER CHARACTERISTIC PROTECTED BY APPLICABLE LAW. MATTRESS FIRM IS COMMITTED TO CREATING A DYNAMIC WORK ENVIRONMENT THAT VALUES DIVERSITY AND INCLUSION, RESPECT AND INTEGRITY, CUSTOMER FOCUS, AND INNOVATION.",
    "job_skill_set": [
      "sales",
      "product knowledge",
      "omni-channel experience",
      "social media marketing",
      "training and development",
      "communication",
      "relationship building",
      "teamwork",
      "problem solving",
      "adaptability",
      "feedback acceptance",
      "customer focus",
      "initiative",
      "professionalism",
      "customer service",
      "visual merchandising",
      "cash handling",
      "lifting (up to 50 pounds)"
    ],
    "short_keywords": [
      "50",
      "acceptance",
      "adaptability",
      "and",
      "building",
      "cash",
      "communication",
      "customer",
      "development",
      "experience",
      "expert",
      "feedback",
      "focus",
      "handling",
      "initiative",
      "knowledge",
      "lifting",
      "marketing",
      "media",
      "merchandising",
      "omnichannel",
      "pounds",
      "problem",
      "product",
      "professionalism",
      "relationship",
      "sales",
      "service",
      "sleep",
      "social",
      "solving",
      "teamwork",
      "to",
      "training",
      "up",
      "visual"
    ]
  },
  {
    "job_id": "3905208764",
    "job_title": "Sales Executive",
    "category": "SALES",
    "job_description": "MY CLIENT IS ONE OF THE #1 COMPANIES IN THE LOGISTICS INDUSTRY AND ARE HIGHLY SPECIALIZED TO SERVICE ORGANIZATIONS IN THE TECHNOLOGY SECTOR. THEY HAVE BEEN AROUND FOR 25 YEARS AND HAVE CONSISTENTLY MET AND EXCEEDED THEIR GROWTH TARGETS YEAR OVER YEAR.\nTHEY ARE A LEADER IN THEIR SPACE AND INDUSTRIES SERVICED INCLUDE, BUT ARE NOT LIMITED TO, MEDICAL DEVICE, ELECTRONICS AND AEROSPACE. THIS POSITION IS AN EXPANSION ROLE. THEY HAVE ALMOST ZERO TURNOVER. DESPITE THE ECONOMIC DOWNTURN, THIS COMPANY HAS CONTINUED TO THRIVE AND EXPAND! ONCE YOU BRING ON A CLIENT, YOU MAINTAIN AND GROW THE ACCOUNT. IT IS YOUR ACCOUNT FOR LIFE. YOU ACTUALLY GET THE OPPORTUNITY TO BUILD A BOOK OF BUSINESS. YOUR NEW BUSINESS QUOTA DOES NOT INCREASE EVERY YEAR BECAUSE THEY UNDERSTAND YOU ALSO NEED TO FOCUS ON YOUR EXISTING ACCOUNT BASE. YOU EARN RESIDUAL COMMISSION FOR THE LIFE OF THE ACCOUNT AND BECAUSE OF THAT TOP REPS IN THE COMPANY MAKE BETWEEN $400K-$700K PER YEAR.\nPERKS:GENEROUS BASE SALARY AND BONUS. THEY OFFER FULL MEDICAL BENEFITS THAT ARE 70% EMPLOYER PAID FOR EMPLOYEE AND DEPENDENTS, MATCHING 401K, HOME OFFICE, CAR ALLOWANCE, CELL, LAPTOP, AND GENEROUS EXPENSE ACCOUNT.REQUIREMENTS: WE ARE LOOKING FOR A HIGH-ENERGY, DRIVEN INDIVIDUAL WITH EXCELLENT COMMUNICATION SKILLS WHO IS READY FOR AN OPPORTUNITY TO DRIVE SALES AND IMPACT REVENUE GROWTH.TO SUCCEED, YOU’LL NEED TO BE BOTH A FARMER AND A HUNTER, BE PERSISTENT IN YOUR APPROACH AND BE SOMEONE WHO WON’T TAKE NO FOR AN ANSWER.THESE TRAITS ARE ESSENTIAL TO HELPING GET OUR SALES TEAM INTO NEW DOORS AND GENERATE ADDITIONAL BUSINESS WITH EXISTING CUSTOMERS.IF YOU ARE QUALIFIED, PLEASE SEND RESUME FOR REVIEW.",
    "job_skill_set": [
      "sales",
      "account management",
      "business development",
      "customer relationship management (CRM)",
      "communication",
      "persistence",
      "teamwork",
      "high energy",
      "problem solving",
      "logistics knowledge"
    ],
    "short_keywords": [
      "account",
      "business",
      "communication",
      "crm",
      "customer",
      "development",
      "energy",
      "executive",
      "high",
      "knowledge",
      "logistics",
      "management",
      "persistence",
      "problem",
      "relationship",
      "sales",
      "solving",
      "teamwork"
    ]
  },
  {
    "job_id": "3884931298",
    "job_title": "Sales Representative",
    "category": "SALES",
    "job_description": "JOIN MOXIE AS OUR NEW OUTSIDE SALES REPRESENTATIVE\n\nWE GET IT. YOU DIDN’T GROW UP THINKING YOU’D LAND IN SALES AT A PEST CONTROL COMPANY. GUESS WHAT? NEITHER DID WE, WHICH IS EXACTLY WHY WE CREATED MOXIE.\n\nWE’RE MORE THAN A PEST CONTROL COMPANY. OUR MISSION IS TO IMPROVE THE QUALITY OF LIFE FOR OUR CUSTOMERS, TEAM AND COMMUNITY.\n\nCALL US OLD-FASHIONED, BUT WE BELIEVE THAT KINDNESS IS CONTAGIOUS. PART OF THAT MEANS HELPING OUR NEIGHBORS FEEL AT HOME IN THEIR HOMES AGAIN—PEST FREE.\n\nTHIS IS WHERE YOU COME IN.\n\nWHY YOU’LL LOVE COMING TO WORK\n\nWE ADVOCATE FOR SETTING OUR TEAM MEMBERS UP FOR SUCCESS FROM DAY ONE. THAT STARTS WITH COMPREHENSIVE PAID TRAINING ON A STRUCTURED SALES PROCESS THAT EQUIPS YOU WITH THE TOOLS AND KNOWLEDGE YOU’LL NEED TO EXCEL.\n\nAFTER TRAINING, YOU’LL HIT THE GROUND RUNNING WITH A STEADY STREAM OF PRE-SET, PRE-QUALIFIED APPOINTMENTS WAITING FOR YOU EVERY DAY. WITH LEADS PROVIDED FOR YOU, YOU CAN FOCUS YOUR ENERGY ON WHAT YOU DO BEST—BUILDING RELATIONSHIPS, PROVIDING PREMIUM SOLUTIONS IN TERMITE CONTROL AND INSULATION, CLOSING DEALS AND MAKING HOMES SAFER AND MORE COMFORTABLE FOR OUR NEIGHBORS.\n\nWHAT YOU’RE EXCITED TO BRING TO MOXIE\n\nWE OPERATE AT A RAPID PACE AND WE’RE SEEKING INDIVIDUALS WHO CAN KEEP UP. IF YOU’RE QUICK ON YOUR FEET WITH OUTSTANDING COMMUNICATION SKILLS AND A TRACK RECORD OF SURPASSING SALES TARGETS, YOU’LL FIT RIGHT IN!\n\nHERE, WE VALUE YOUR DRIVE FOR BOTH PERSONAL AND INCOME GROWTH AND WE OFFER PLENTY OF OPPORTUNITIES TO HELP YOU WITH BOTH. IF YOU THRIVE IN A COMPETITIVE ENVIRONMENT, YOU’LL ALSO LOVE THE EXCITEMENT OF OUR SALES TOURNAMENTS AND INCENTIVE COMPETITIONS.\n\nCOMPENSATION\n\nFIND STABILITY AND OPPORTUNITY, EARNING COMMISSION WITH A DRAW AND UNLIMITED EARNINGS RANGING FROM $120,000 TO $180,000+ BASED ON YOUR PERFORMANCE. ADD IN MEDICAL, DENTAL, AND VISION COVERAGE PLUS A 401K PLAN—ALL PROVIDED UNDER A W-2 UMBRELLA. THAT’S NOT ALL! WE OFFER A COMPANY VEHICLE, CELL PHONE REIMBURSEMENT AND PRESIDENT’S CLUB TRIPS THAT HAVE TAKEN EMPLOYEES TO ALASKA, HAWAII, PANAMA AND BEYOND!\n\nLOCATION:\n\nMOXIE IS BOOMING IN BOSTON . IF YOU LIVE IN THE AREA, WE’D LOVE FOR YOU TO CONSIDER MOXIE!\n\nJOIN US\n\nBY JOINING US, YOU'RE NOT ONLY CONTRIBUTING TO THE DEVELOPMENT OF A PREMIUM BRAND BUT ALSO PLAYING A PIVOTAL ROLE IN MAKING IT A HOUSEHOLD NAME. BUT YOU’RE NOT JUST BUILDING MOXIE. YOU ARE TRANSFORMING YOUR OWN CAREER. WHILE IT MIGHT TAKE 5-10 YEARS TO CLIMB THE CORPORATE LADDER SOMEWHERE ELSE, WE FAST-TRACK YOUR SUCCESS, WITH THE POTENTIAL FOR GROWTH TO LEADERSHIP IN AS LITTLE AS 12 MONTHS. IF YOU’RE SEEKING A SUPPORTIVE ENVIRONMENT AND ARE COMMITTED TO YOUR PROFESSIONAL DEVELOPMENT, THE SKY'S THE LIMIT AT MOXIE! WE CAN’T WAIT TO HEAR FROM YOU!",
    "job_skill_set": [
      "sales",
      "communication",
      "customer relationship management",
      "lead generation",
      "problem solving",
      "product knowledge",
      "teamwork",
      "adaptability",
      "drive",
      "competitive spirit",
      "kindness",
      "personal growth",
      "negotiation",
      "time management"
    ],
    "short_keywords": [
      "adaptability",
      "communication",
      "competitive",
      "customer",
      "drive",
      "generation",
      "growth",
      "kindness",
      "knowledge",
      "lead",
      "management",
      "negotiation",
      "personal",
      "problem",
      "product",
      "relationship",
      "representative",
      "sales",
      "solving",
      "spirit",
      "teamwork",
      "time"
    ]
  },
  {
    "job_id": "3904716628",
    "job_title": "Sales District Manager",
    "category": "SALES",
    "job_description": "DESCRIPTION\n\nJD PENDING\n\nMINIMUM QUALIFICATIONS\n\n BACHELOR'S DEGREE: NO DEGREE SPECIFIED  TYPICALLY MINIMUM 2 YEARS RELEVANT EXP \n\nPREFERRED QUALIFICATIONS\n\n B2B SALES EXPERIENCE, COLD CALLING SALES EXPERIENCE, DEMONSTRATED SUCCESSFUL PERFORMANCE IN PREVIOUS SALES JOB",
    "job_skill_set": [
      "Sales Performance",
      "Communication",
      "Problem Solving",
      "B2B Sales",
      "Cold Calling",
      "Negotiation"
    ],
    "short_keywords": [
      "b2b",
      "calling",
      "cold",
      "communication",
      "district",
      "manager",
      "negotiation",
      "performance",
      "problem",
      "sales",
      "solving"
    ]
  }
]