[
  {
    "job_id": "3887709924",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "CHARGER LOGISTICS IS A WORLD CLASS ASSET-BASED CARRIER. WE SPECIALIZE IN DELIVERING ASSETS, ON TIME AND ON BUDGET. WITH THE DIVERSE FLEET OF EQUIPMENT, WE CAN HANDLE A RANGE OF FREIGHT, INCLUDING DEDICATED LOADS, SPECIALIZED HAULS, TEMPERATURE-CONTROLLED GOODS AND HAZMAT CARGO.CHARGER LOGISTICS INVESTS TIME AND SUPPORT INTO ITS EMPLOYEES TO PROVIDE THEM WITH THE ROOM TO LEARN AND GROW THEIR EXPERTISE AND WORK THEIR WAY UP. WE ARE ENTREPRENEURIAL-MINDED ORGANIZATION THAT WELCOMES AND SUPPORT INDIVIDUAL IDEA AND STRATEGIES. WE ARE CURRENTLY LOOKING TO HIRE AN EXPERIENCED AND DYNAMIC BUSINESS DEVELOPMENT MANAGER. YOU MAY BE REQUIRED TO TRAVEL TO OUR CANADA OFFICE OCCASIONALLY.JOB DUTIES:THE BUSINESS DEVELOPMENT MANAGER WILL WORK CLOSELY WITH THE PRESIDENT AND DIRECTOR OF SALES TO DEVELOP TERRITORY AND ACCOUNT STRATEGIES TO SUPPORT SALES GROWTH.IDENTIFY NEW BUSINESS OPPORTUNITIES AND CONSTANTLY STRIVE TO MAINTAIN STRONG RELATIONSHIPS WITH EXISTING BUSINESS ACCOUNTS.YOU'RE READY TO TAKE ON COMPLICATED PROBLEMS AND GIVE BACK WELL THOUGHT OUT SOLUTIONS. YOU'RE NOT AFRAID TO BUILD A PROSPECT LIST AND MAKE A COLD CALLS. BUT YOU ALSO UNDERSTAND THE VALUE OF NETWORKING AND MAKING CONNECTIONS.YOU WILL ALSO BE RESPONSIBLE FOR MANAGING AND DEFINING FINANCIAL RESOURCES SUCH AS, MONITORING BUDGETS RELATED TO YOUR PROJECTS AND PROVIDING INPUT OR ANALYSIS FOR FINANCIAL DECISIONS THAT IMPACT YOUR PARTICULAR PROJECT.AS A BUSINESS DEVELOPMENT MANAGER AT CHARGER, YOU ARE WILLING TO LEARN THE BUSINESS AND GROW THE COMPANY OVER A LONG TERM. YOU ARE SOMEONE WHO INVESTS TIME INTO BUILDING AND FOSTERING RELATIONSHIPS TO TRULY EARN NEW ACCOUNTS. \n\nREQUIREMENTS\n\nPROVEN TRACK RECORD WITH A STRONG FOCUS ON NEW BUSINESS DEVELOPMENT INCLUDING COLD CALLING, SETTING APPOINTMENTS, PRESENTING AND MEETING WITH POTENTIAL CUSTOMERS, PRICING, PROPOSALS THROUGH TO 'CLOSING THE DEAL'.5+ YEARS OF SALES AND ACCOUNT MANAGEMENT EXPERIENCE IN TRANSPORTATION INDUSTRY, HIGHLY PREFERRED.EXPERIENCE WORKING B2B SALES INVOLVING COMPLEX DEALS.STRONG KNOWLEDGE AND UNDERSTANDING OF THE SALES PLANNING PROCESS.ABILITY TO INTERFACE WITH ALL REQUIRED LEVELS AT A CUSTOMER (ENTRY LEVEL TO SENIOR EXECUTIVE)STRONG VERBAL, WRITTEN, AND PRESENTATION SKILLS & STRONG INTERPERSONAL AND CUSTOMER RELATION SKILLS.STRONG NEGOTIATION SKILLS WITH PROVEN CLOSING ABILITY.HIGH ENERGY AND GENUINE PASSION FOR \"SELLING\".ABILITY TO FUNCTION INDEPENDENTLY WITH LITTLE OR NO SUPERVISION AS WELL AS FUNCTION IN A TEAM ENVIRONMENT.COLLEGE OR UNIVERSITY DEGREE IN A MARKETING OR BUSINESS-RELATED FIELD IS AN ASSET. \n\nBENEFITS\n\nCOMPETITIVE SALARYHEALTHCARE BENEFIT PACKAGECAREER GROWTH",
    "job_skill_set": [
      "business development",
      "sales",
      "account management",
      "negotiation",
      "financial analysis",
      "sales planning",
      "B2B sales",
      "presentation skills",
      "customer relationship management",
      "budget monitoring",
      "marketing",
      "communication",
      "interpersonal skills",
      "problem solving",
      "teamwork",
      "independence",
      "adaptability",
      "entrepreneurial mindset",
      "relationship building",
      "passion for selling",
      "cold calling"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "analysis",
      "b2b",
      "budget",
      "building",
      "business",
      "businessdevelopment",
      "calling",
      "cold",
      "communication",
      "customer",
      "development",
      "entrepreneurial",
      "financial",
      "for",
      "independence",
      "interpersonal",
      "management",
      "manager",
      "marketing",
      "mindset",
      "monitoring",
      "negotiation",
      "passion",
      "planning",
      "presentation",
      "problem",
      "relationship",
      "sales",
      "selling",
      "skills",
      "solving",
      "teamwork"
    ]
  },
  {
    "job_id": "3903476328",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "✨YOUR NEXT “INTRAPRENEUR” CHALLENGE IS JUST ONE CLICK AWAY! THIS IS NOT YOUR AVERAGE SALES JOB -- INSTEAD, THIS IS A LEADERSHIP POSITION THAT IS IN THE FOREFRONT OF MIGSO-PCUBED'S ORGANIZATIONAL GROWTH.OUR BOSTON HUB, IS LOOKING FOR A BUSINESS MANAGER TO KEEP PACE WITH THE RAPID EXPANSION OF THE MARKET. THIS IS YOUR OPPORTUNITY TO JOIN THE LARGEST GLOBAL CONSULTING COMPANY THAT SPECIALIZES IN PROGRAM PROJECT MANAGEMENT SERVICES AND SOLUTIONS, WHERE YOU WILL HAVE THE CHANCE TO GROW AND MANAGE NEW CLIENT ACCOUNTS, BUILD YOUR TEAM, AND MANAGE YOUR PROFIT CENTER.\nYOUR NEXT CHALLENGEYOUR GOAL IS TO DEVELOP AND EXPAND OUR BUSINESS AND YOUR NETWORK WHILE FOSTERING RELATIONSHIPS WITH CLIENTS, CANDIDATES, AND CONSULTANTS ACROSS DIFFERENT INDUSTRIES.\nBUSINESS MANAGERS TAKE OWNERSHIP OF THREE ESSENTIAL ELEMENTS OF THE ORGANIZATION:BUSINESS DEVELOPMENT: MAINTAINING A BUSINESS DEVELOPMENT ‘DRUMBEAT’ IS CRITICAL. BUSINESS MANAGERS ARE RESPONSIBLE FOR BUILDING THEIR TARGET COMPANY PORTFOLIO, IDENTIFYING GROWTH OPPORTUNITIES WITHIN THEIR BUSINESS UNIT, MANAGE THE SCOPE OF ACTIVITY BY BUILDING RELATIONSHIPS WITH KEY ACCOUNT CUSTOMERS, AND SELL EXPERT-LEVEL PROJECT MANAGEMENT SERVICES.MANAGEMENT AND RECRUITMENT: OUR PEOPLE ARE OUR CORE COMPETENCY. YOU WILL PARTNER WITH OUR TALENT ACQUISITION TEAM TO INTERVIEW AND HIRE THE RIGHT CANDIDATES TO SUPPORT AND DEVELOP YOUR HUB’S CONSULTANT TEAM. THEN, AS A MANAGER AND LEADER OF YOUR TEAM, YOU HELP TO IDENTIFY GROWTH AREAS AND EMPOWER YOUR TEAM TO REACH THEIR POTENTIAL THROUGHOUT THEIR CAREER (COACHING, CAREER PATH DEVELOPMENT, ETC.).PROFIT CENTER MANAGEMENT: ENSURE PROJECT SUCCESS IN PARTNERSHIP WITH YOUR CONSULTANTS, DELIVERY MANAGERS, AND CLIENTS. MANAGE REVENUE GROWTH AND PROFITABILITY OBJECTIVES OF YOUR BUSINESS UNIT, WHILE GUARANTEEING CLIENT SATISFACTION.\nWHO ARE YOU?YOU HAVE AT LEAST A BACHELOR’S DEGREE IN ENGINEERING OR IN BUSINESS, WITH 3-5 YEARS OF EXPERIENCE IN EITHER SALES OR CLIENT ACCOUNT MANAGEMENT EXPERIENCE.\nYOU HAVE A KEEN INTEREST IN VARIOUS INDUSTRIAL SECTORS AND THEIR CHALLENGES. YOU LOVE TO HELP CUSTOMERS SOLVE THEIR CRITICAL PROBLEMS WITH OUR PROJECT MANAGEMENT SERVICES AND SOLUTIONS. IDEALLY, YOU HAVE ALREADY HAD THE OPPORTUNITY TO DISCOVER PROJECT MANAGEMENT OVER THE COURSE OF YOUR PAST EXPERIENCES, BUT WE ARE WILLING TO INVEST IN YOU TO QUICKLY DEVELOP YOUR KNOWLEDGE OF OUR SERVICES AND SOLUTIONS AND THE VALUE BENEFITS THOSE SERVICES BRING TO OUR CUSTOMERS.\nYOU ARE BUSINESS-MINDED AND RESULTS-ORIENTED. YOUR SUCCESS IN THIS POSITION RELIES ON YOUR SELF-DISCIPLINE, CONSISTENCY, AND YOUR DESIRE TO LEAD AND UNITE MULTIDISCIPLINARY TEAMS. YOUR ABILITY TO BUILD AND MAINTAIN IMPACTFUL RELATIONSHIPS INTERNALLY AND WITH CLIENTS IS CRITICAL TO YOUR SUCCESS.\nOUR PROMISEBY JOINING OUR COMPANY AS A BUSINESS MANAGER, YOU WILL BE ABLE TAKE ADVANTAGE OF MENTORSHIP, TRAINING AND DEVELOPMENT PROVIDED BY YOUR HUB LEADERSHIP AND A GLOBAL COMMUNITY OF BUSINESS MANAGERS HERE TO SUPPORT YOUR GOALS AND PROGRESSION. WE WILL TAILOR YOUR ONBOARDING AND CONTINUED SUPPORT FOR YOU IN ALL ASPECTS OF YOUR SKILL DEVELOPMENT—MANAGEMENT AND LEADERSHIP, RECRUITMENT, TECHNICAL KNOWLEDGE, OR SALES TACTICS AND STRATEGIES. YOUR METRICS ARE CLEARLY DEFINED FROM THE BEGINNING, AND YOU WILL HAVE VISIBILITY TO YOUR PROGRESS IN ALIGNMENT TO THOSE METRICS. WE OFFER A GENEROUS INCENTIVE REWARD PACKAGE BASED ON THE ACHIEVEMENT OF YOUR RESULTS AGAINST SET TARGETS ON A QUARTERLY BASIS.TODAY, WE ARE RECRUITING OUR LEADERS OF TOMORROW!✨\nCOMPENSATIONMIGSO-PCUBED BELIEVES IN FAIR AND EQUITABLE COMPENSATION. THE REASONABLE ESTIMATE OF THE CURRENT TOTAL COMPENSATORY SALARY RANGE FOR THIS ROLE IS $90,000 - $110,000 (DEPENDING ON EXPERIENCE) ANNUALLY FOR BOSTON. IN ADDITION TO BASE SALARY, EMPLOYEES WILL PARTICIPATE IN AN ANNUAL PERFORMANCE-BASED INCENTIVE PROGRAM. THE WAGE RANGE FOR THIS ROLE TAKES INTO ACCOUNT THE WIDE RANGE OF FACTORS THAT ARE CONSIDERED IN MAKING COMPENSATION DECISIONS INCLUDING BUT NOT LIMITED TO SKILL SETS; EXPERIENCE AND TRAINING; CERTIFICATIONS; AND OTHER BUSINESS AND ORGANIZATIONAL NEEDS.\nBENEFITS AND PERKSMP OFFERS COMPREHENSIVE CONTRIBUTIONS TO MEDICAL, DENTAL, AND VISION FOR YOU AND YOUR DEPENDENTS. WE ALSO INCLUDE A NOTABLE PTO PLAN, PAID HOLIDAYS, A 401K WITH COMPANY MATCH, AND PROFESSIONAL DEVELOPMENT OPPORTUNITIES.\nEQUAL OPPORTUNITY STATEMENTMIGSO-PCUBED RECOGNIZES THE CIVIL RIGHT OF EVERY PERSON TO OBTAIN AND MAINTAIN EMPLOYMENT WITHOUT DISCRIMINATION. WE HAVE A LONGSTANDING POLICY THAT NO INDIVIDUAL MAY BE REFUSED A JOB, DISCHARGED, OR DISCRIMINATED AGAINST IN ANY WAY DUE TO ANY PROTECTED CHARACTERISTICS ESTABLISHED BY LOCAL, STATE AND FEDERAL LAW. IN ALL RESPECTS, MIGSO-PCUBED IS COMMITTED TO A POLICY OF FULL AND FAIR EQUAL EMPLOYMENT UNDER THE LAW AND APPLIES THIS IN ALL EMPLOYMENT DECISIONS, INCLUDING RECRUITMENT, HIRING, COMPENSATION, ENGAGEMENT STAFFING, TRAINING, PROMOTION, TRANSFER, AND TERMINATION.",
    "job_skill_set": [
      "business development",
      "client account management",
      "project management",
      "recruitment",
      "team management",
      "business knowledge",
      "leadership",
      "relationship building",
      "self-discipline",
      "communication",
      "problem solving",
      "multidisciplinary teamwork",
      "results-oriented",
      "sales tactics",
      "profitability management",
      "engineering knowledge",
      "consistency",
      "coaching"
    ],
    "short_keywords": [
      "account",
      "building",
      "business",
      "businessdevelopment",
      "client",
      "coaching",
      "communication",
      "consistency",
      "development",
      "engineering",
      "knowledge",
      "leadership",
      "management",
      "manager",
      "multidisciplinary",
      "problem",
      "profitability",
      "project",
      "recruitment",
      "relationship",
      "resultsoriented",
      "sales",
      "selfdiscipline",
      "solving",
      "tactics",
      "team",
      "teamwork"
    ]
  },
  {
    "job_id": "3887726231",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "CHARGER LOGISTICS IS A WORLD CLASS ASSET-BASED CARRIER. WE SPECIALIZE IN DELIVERING OUR ASSETS, ON TIME AND ON BUDGET. WITH THE DIVERSE FLEET OF EQUIPMENT, WE CAN HANDLE A RANGE OF FREIGHT, INCLUDING DEDICATED LOADS, SPECIALIZED HAULS, TEMPERATURE-CONTROLLED GOODS AND HAZMAT CARGO.CHARGER LOGISTICS INVESTS TIME AND SUPPORT INTO ITS EMPLOYEES TO PROVIDE THEM WITH THE ROOM TO LEARN AND GROW THEIR EXPERTISE AND WORK THEIR WAY UP. WE ARE ENTREPRENEURIAL-MINDED ORGANIZATION THAT WELCOMES AND SUPPORT INDIVIDUAL IDEA AND STRATEGIES. WE ARE CURRENTLY LOOKING TO HIRE AN EXPERIENCED AND DYNAMIC BUSINESS DEVELOPMENT REPRESENTATIVE. YOU MAY BE REQUIRED TO TRAVEL TO OUR CANADA OFFICE OCCASIONALLY.JOB DUTIES:A BUSINESS DEVELOPMENT REPRESENTATIVE WILL WORK CLOSELY WITH THE BUSINESS DEVELOPMENT MANAGER TO DEVELOP TERRITORY AND ACCOUNT STRATEGIES TO SUPPORT SALES GROWTH IN THE USA REGION.IDENTIFY NEW BUSINESS OPPORTUNITIES AND CONSTANTLY STRIVE TO MAINTAIN STRONG RELATIONSHIPS WITH EXISTING BUSINESS ACCOUNTS.YOU'RE READY TO TAKE ON COMPLICATED PROBLEMS AND GIVE BACK WELL THOUGHT OUT SOLUTIONS. YOU'RE NOT AFRAID TO BUILD A PROSPECT LIST AND MAKE A COLD CALLS. BUT YOU ALSO UNDERSTAND THE VALUE OF NETWORKING AND MAKING CONNECTIONS.YOU WILL ALSO BE RESPONSIBLE FOR MANAGING AND DEFINING FINANCIAL RESOURCES SUCH AS, MONITORING BUDGETS RELATED TO YOUR PROJECTS AND PROVIDING INPUT OR ANALYSIS FOR FINANCIAL DECISIONS THAT IMPACT YOUR PARTICULAR PROJECT.AS A BUSINESS DEVELOPMENT MANAGER AT CHARGER, YOU ARE WILLING TO LEARN THE BUSINESS AND GROW THE COMPANY OVER A LONG TERM. YOU ARE SOMEONE WHO INVESTS TIME INTO BUILDING AND FOSTERING RELATIONSHIPS TO TRULY EARN NEW ACCOUNTS. \n\nREQUIREMENTS\n\n6 MONTHS OF INSIDE SALES AND ACCOUNT MANAGEMENT EXPERIENCE IN TRANSPORTATION AND LOGISTICS FIELD WOULD BE AN ASSETS.COLLEGE OR UNIVERSITY DEGREE IN SALES & MARKETING OR BUSINESS RELATED FIELD IS REQUIRED. STRONG KNOWLEDGE AND UNDERSTANDING OF THE SALES PLANNING PROCESS.ABILITY TO INTERFACE WITH ALL REQUIRED LEVELS AT A CUSTOMER (ENTRY LEVEL TO SENIOR EXECUTIVE)STRONG VERBAL, WRITTEN, AND PRESENTATION SKILLS & STRONG INTERPERSONAL AND CUSTOMER RELATION SKILLS.STRONG NEGOTIATION SKILLS WITH PROVEN CLOSING ABILITY.HIGH ENERGY AND GENUINE PASSION FOR \"SELLING\".ABILITY TO FUNCTION INDEPENDENTLY WITH LITTLE OR NO SUPERVISION AS WELL AS FUNCTION IN A TEAM ENVIRONMENT.COLLEGE OR UNIVERSITY DEGREE IN A MARKETING OR BUSINESS-RELATED FIELD IS AN ASSET. \n\nBENEFITS\n\nCOMPETITIVE SALARYCAREER GROWTHHEALTHCARE BENEFIT PACKAGE",
    "job_skill_set": [
      "sales",
      "presentation skills",
      "budget management",
      "customer relationship management",
      "marketing knowledge",
      "communication",
      "interpersonal skills",
      "problem solving",
      "teamwork",
      "relationship building",
      "adaptability",
      "account management",
      "negotiation",
      "logistics knowledge",
      "cold calling",
      "financial analysis",
      "independence",
      "entrepreneurial mindset"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "analysis",
      "budget",
      "building",
      "business",
      "businessdevelopment",
      "calling",
      "cold",
      "communication",
      "customer",
      "development",
      "entrepreneurial",
      "financial",
      "independence",
      "interpersonal",
      "knowledge",
      "logistics",
      "management",
      "marketing",
      "mindset",
      "negotiation",
      "presentation",
      "problem",
      "relationship",
      "representative",
      "sales",
      "skills",
      "solving",
      "teamwork"
    ]
  },
  {
    "job_id": "3901941411",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "BUSINESS DEVELOPMENT REPRESENTATIVE\nWHO WE ARE...... FACILITYONE IS A SOFTWARE COMPANY DEDICATED TO PROVIDING A HIGH-VALUE SOLUTION TO MAKE IT EASY FOR OUR CUSTOMERS TO MANAGE SAFE, PRODUCTIVE, AND WELL-MAINTAINED PHYSICAL ENVIRONMENTS. WE LEVERAGE OUR PRODUCT AND KNOWLEDGE OF THE INDUSTRY TO HELP OUR CUSTOMERS IMPROVE EFFICIENCIES AND SAVE MONEY.\nWHO WE ARE LOOKING FOR…… AS A BUSINESS DEVELOPMENT REPRESENTATIVE, YOU WILL BE RESPONSIBLE FOR SUPPORTING OUR SALES TEAM BY IDENTIFYING AND CREATING NEW QUALIFIED LEADS ACROSS INDUSTRIES. YOU WILL BE THE FIRST POINT OF CONTACT WITH POTENTIAL CUSTOMERS AND PLAY A CRUCIAL ROLE IN DRIVING THE GROWTH OF OUR BUSINESS. THIS ROLE REQUIRES DETERMINATION, FOCUS, TENACITY, AND RESILIENCY, AND YOU WILL HAVE THE OPPORTUNITY TO DIRECTLY IMPACT COMPANY GROWTH.\nRESPONSIBILITIES…… PARTNER CLOSELY WITH ACCOUNT EXECUTIVES TO IDENTIFY AND SOURCE NET-NEW PIPELINE THAT LEADS TO CLOSED REVENUE AND QUOTA ATTAINMENT.FOLLOW-UP FROM DIRECT MARKETING CAMPAIGNS SUCH AS EMAIL BLASTS AND WEBINARS. DIRECTLY EXECUTE TELEPHONE-BASED SALES CALLS AND QUALIFYING PROSPECTS FOR THE PURCHASE OF OUR SOFTWARE SOLUTIONS. ASSIST OUR SALES TEAM IN GATHERING INFORMATION ON EACH OPPORTUNITY, SUCH AS THE COMPETITIVE LANDSCAPE, FACILITY-SPECIFIC PAIN POINTS, ETC.CONDUCT THOROUGH MARKET RESEARCH INTO PROSPECTS, AND CONCISELY AND ACCURATELY COMMUNICATE KEY INFORMATION WITH THE SALES TEAM. ATTEND AND/OR ASSIST WITH INDUSTRY EVENTS, AS NEEDED.UTILIZE A VARIETY OF TOOLS INCLUDING LINKEDIN, ZOOMINFO, AND OTHER SOURCES AND GROUPS TO UNCOVER OPPORTUNITIES. MAINTAIN AND UPDATE THE CRM REGULARLY.\nQUALIFICATIONS & FIT…… 2+ YEARS EXPERIENCE AS A BUSINESS DEVELOPMENT REPRESENTATIVE, WITH A STRONG PREFERENCE FOR EXPERIENCE WORKING WITH SAAS SALESPROVEN SUCCESS WITH ARTICULATING MESSAGING VIA PHONE AND EMAILPROVEN TRACK RECORD OF MEETING AND EXCEEDING TARGETSOUTSTANDING WRITTEN AND VERBAL COMMUNICATION SKILLSCRM EXPERIENCE, HUBSPOT PREFERREDABILITY TO WORK INDEPENDENTLY WHILE BEING A STRONG TEAM PLAYER\n BENEFITS….. WE KNOW OUR EMPLOYEES ARE OUR MOST VALUABLE RESOURCE, SO WE'VE DESIGNED OUR BENEFITS TO ALIGN WITH THEIR WANTS AND NEEDS, AND TO ENSURE THEIR PERSONAL AND PROFESSIONAL WELL-BEING.SKIP THE COMMUTE! WE ARE A FLEXIBLE, REMOTE-FIRST TEAM WITH AN OFFICE IN CHARLOTTE, NORTH CAROLINA. WE PROVIDE EMPLOYEES WITH WORK EQUIPMENT AS WELL AS A MONTHLY INTERNET STIPENDGENEROUS HEALTH COVERAGE INCLUDING MEDICAL, DENTAL, VISION, AND SHORT- AND LONG-TERM DISABILITY COVERAGEFLEXIBLE VACATION - WE HAVE AN UNLIMITED PTO POLICY WITH NO ACCRUALS, SO NO NEED TO WORRY ABOUT 'USE IT OR LOSE IT'!401K MATCHING - FACILITYONE PROVIDES A 4% MATCH ON 401(K) CONTRIBUTIONS TO HELP OUR EMPLOYEES INVEST IN THEIR FUTURES.ANNUAL WELLNESS BENEFITS, WHICH CAN BE USED TOWARDS GYM MEMBERSHIPS, FITNESS CLASSES OR APPS, WORKOUT EQUIPMENT, ETC.\"FURTERNITY\" LEAVE - WE UNDERSTAND THAT PETS ARE AN IMPORTANT PART OF OUR EMPLOYEE'S LIVES. PERSONAL TIME CAN BE USED TO ADOPT OR CARE FOR A FURRY FRIEND.\nOUR CULTURE...... A BIT ABOUT US - WE ARE LOOKING FOR PEOPLE WHO AREN’T JUST INTERESTED IN WORKING AT A SMALL COMPANY; WE NEED PEOPLE WHO ARE EXCITED ABOUT BUILDING A GREAT COMPANY! HERE ARE SOME OF THE KEY PRINCIPALS WE VALUE IN AN EMPLOYEE:MINDFUL COLLABORATION WE VALUE THOUGHTFUL HONESTY, TREATING EACH OTHER WITH RESPECT AS A COHESIVE TEAM, AND EMBRACING BOTH VICTORIES AND FAILURES.CREATIVE PROBLEM-SOLVING WE BELIEVE THAT FOR EVERY PROBLEM, THERE IS A SOLUTION, ESPECIALLY WITH GREAT TEAMWORK, OUT-OF-THE-BOX IDEAS, AND IMAGINATIVE THINKING!AMBITIOUS SUCCESS WE CHALLENGE OURSELVES AS A GROWING ORGANIZATION TO EXCEL BY SETTING GOALS, PRIORITIZING ACCOUNTABILITY, AND RECOGNIZING RESULTS.\nIF YOU LIKE WHAT YOU HEAR AND YOU’RE PASSIONATE ABOUT JOINING A TEAM LIKE THE ONE WE’VE DESCRIBED, WE’D LOVE TO TALK!\nCOMPENSATION: $45-55K BASE PLUS BONUS. SALARY RANGES ARE DETERMINED BY LOCATION, LEVEL, EXPERIENCE, AND SKILLS. THIS WILL BE DISCUSSED FURTHER WITH THE TALENT TEAM DURING THE HIRING PROCESS.FACILITYONE IS AN EQUAL OPPORTUNITY EMPLOYER. WE VALUE DIVERSITY AND ARE COMMITTED TO CREATING AN INCLUSIVE ENVIRONMENT FOR ALL EMPLOYEES. ALL HIRING DECISIONS ARE MADE BASED ON BUSINESS NEEDS AND INDIVIDUAL MERIT REGARDLESS OF AGE, RACE, SEX, RELIGION, GENDER IDENTITY, SEXUAL ORIENTATION, OR MARITAL, VETERAN, OR DISABILITY STATUS.",
    "job_skill_set": [
      "CRM",
      "Sales Calls",
      "LinkedIn",
      "Communication",
      "Teamwork",
      "Problem Solving",
      "Determination",
      "Focus",
      "Tenacity",
      "Resiliency",
      "Collaboration",
      "Creativity",
      "Ambition",
      "SaaS",
      "Market Research",
      "Email Marketing",
      "ZoomInfo",
      "HubSpot"
    ],
    "short_keywords": [
      "ambition",
      "business",
      "businessdevelopment",
      "calls",
      "collaboration",
      "communication",
      "creativity",
      "crm",
      "determination",
      "development",
      "email",
      "focus",
      "hubspot",
      "linkedin",
      "market",
      "marketing",
      "problem",
      "representative",
      "research",
      "resiliency",
      "saas",
      "sales",
      "solving",
      "teamwork",
      "tenacity",
      "zoominfo"
    ]
  },
  {
    "job_id": "3891263985",
    "job_title": "New Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "THIS POSITION CAN WORK REMOTE ANYWHERE IN THE US! \n\nOUTSIDE SALES DUTIES: PROMOTING AND SELLING A PORTFOLIO OF HANKISON BRANDED RENTAL PACKAGES DIRECTLY TO NEW AND EXISTING CUSTOMERS TO MEET ASSIGNED SALES TARGETS. STRATEGICALLY IDENTIFYING AND CALLING ON NEW BUSINESS TARGETS WITHIN STRATEGIC GEOGRAPHIES AND INDUSTRY CHANNEL PARTNERS THROUGHOUT THE U.S. UTILIZING VALUE-SELLING TECHNIQUES TO COMMUNICATE OUR VALUE PROPOSITION IN A CONSULTATIVE WAY AND ARTICULATE WHY A CUSTOMER SHOULD CHOOSE HANKISON AND OUR PRODUCTS.\n\nCREATING, MONITORING, AND REVISING LEAD GENERATION PLANS TO ENSURE A STRUCTURED AND SUBSTANTIVE SALES OPPORTUNITY PIPELINE.\n\nENGAGING WITH THE ORGANIZATION TO QUALIFY OPPORTUNITIES AND DELIVER SALES PRESENTATIONS TO SECURE THE CUSTOMER. ATTEND TRADE SHOWS AS REQUIRED.\n\nINSIDE SALES DUTIES: QUOTE EQUIPMENT RENTALS TO CUSTOMERS UPON REQUEST. FACILITATE THE ON-RENT AND OFF-RENT ACTIVITIES WITH THE CUSTOMER. MAINTAIN SAP, SIRIUS E, AND AVAILABILITY DATABASES. QUOTE AND INVOICE FREIGHT AND OTHER PERIPHERALS TO THE CUSTOMER. BE THE CUSTOMER FACING REPRESENTATIVE WITH THE CUSTOMER AND WORK CLOSES WITH OUTSIDE SALES AND OPERATIONS TO ENSURE THE CUSTOMER’S REQUIREMENTS ARE MET.\n\nRESPONSIBILITIES (NOT MEANT TO BE EXHAUSTIVE)\n\nTHE BELOW-LISTED RESPONSIBILITIES ARE INTENDED TO DESCRIBE THE GENERAL NATURE AND LEVEL OF WORK BEING PERFORMED. THEY ARE NOT INTENDED TO BE AN EXHAUSTIVE LIST OF ALL RESPONSIBILITIES OR DUTIES REQUIRED. PEOPLE PERFORMING THIS FUNCTION WILL BE EXPECTED TO PERFORM OTHER DUTIES AS ASSIGNED.\n\n MANAGE THE NEW BUSINESS DEVELOPMENT PIPELINE, GROW EXISTING CUSTOMERS, AND ESTABLISH RELATIONSHIPS WITH AIR SUPPLY ORGANIZATIONS THROUGHOUT THE U.S. PROVIDE THE NATIONAL SALES MANAGER REGULAR UPDATES ON SALES FORECASTS WHEN PROJECTS SHIFT THAT COULD IMPACT REVENUE. MAINTAIN REGULAR FACE-TO-FACE CONTACT WITH CLIENTS AND RECORD DATA TO FEED SALES METRICS. PROVIDE APPLICABLE MARKET AND COMPETITIVE FEEDBACK TO THE NSM AND RSMS RESPECTIVELY. CONTINUOUS COMMUNICATION WITH INSIDE SALES GROUP KEEPING ABREAST OF CUSTOMERS UPCOMING OPEN RENTAL AND SALES ACTIVITY. ADVISE MANAGEMENT, OTHER SALES PERSONNEL, CUSTOMERS, AND POTENTIAL CUSTOMERS ON ANY ISSUES THAT MAY IMPACT THE DELIVERY OR PERFORMANCE OF OUR EQUIPMENT. MAINTAIN A RECORD AND UPDATE OF ALL QUOTE OPPORTUNITIES. MAINTAIN THE HIGHEST LEVEL OF ETHICAL BUSINESS STANDARDS IN SUPPORT OF ITS / HANKISON RENTAL CORPORATE POLICIES. MUST HAVE A FUNDAMENTAL TECHNICAL APTITUDE TO HELP UNDERSTAND, ARTICULATE, AND EVEN ADDRESS PROBLEMS, ASSESS RISKS, AND DEVELOP RECOMMENDATIONS FOR POTENTIAL CUSTOMER ISSUES. WHEN WORKING IN AN INSIDE SALES CAPACITY, ENSURE ALL CUSTOMER REQUIREMENTS ARE MET AND COMMUNICATE WITH OPERATIONS THE TIMING AND NEEDS OF THE CUSTOMER. MUST BE ABLE TO DELIVER STRONG PRESENTATIONS, BOTH WRITTEN AND ORAL. MUST BE ABLE TO CONDUCT ON-SITE DEMONSTRATIONS OF AIR DRYER TECHNOLOGY ON OCCASION. MUST BE ABLE TO WORK COHESIVELY WITH THE TEAM AND BE FLEXIBLE ON BOTH INSIDE SALES AND OUTSIDE SALES ACTIVITIES WHILE IN THIS HYBRID ROLE.\n\nQUALIFICATIONS, EDUCATION AND/OR EXPERIENCE\n\n BS OR BA IN BUSINESS AND 2 YEARS INDUSTRIAL SALES EXPERIENCE, PREFERABLY IN THE EQUIPMENT RENTAL INDUSTRY. EXCELLENT SALES, CUSTOMER SERVICE, AND CUSTOMER RELATIONSHIP BUILDING SKILLS. PROFICIENT PRESENTATION, VERBAL AND WRITTEN COMMUNICATION SKILLS. THE ABILITY TO READ, ANALYZE AND INTERPRET TECHNICAL DESIGN DRAWINGS. MUST BE EFFECTIVE AT MANAGING MULTIPLE TASKS. MUST HAVE MECHANICAL APTITUDE COMBINED WITH A STRONG SALES BACKGROUND. AN INTENSELY STRONG SELF-MOTIVATION AND THE ABILITY TO WORK INDEPENDENTLY IN A FOCUSED WAY IS A MUST. EXCELLENT PC SKILLS WITH KNOWLEDGE OF MICROSOFT OFFICE; SAP AND/OR SIRIUS PREFERRED AIR COMPRESSOR, DRYER, AND / OR RENTAL EXPERIENCE PREFERRED.\n\nPHYSICAL DEMANDS\n\nTHE PHYSICAL DEMANDS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY AN EMPLOYEE TO SUCCESSFULLY PERFORM THE ESSENTIAL FUNCTIONS OF THIS JOB. WHILE PERFORMING THE DUTIES OF THIS JOB, THE EMPLOYEE MAY BE REQUIRED TO WORK OUTSIDE OF NORMAL BUSINESS HOURS. THE EMPLOYEE MUST OCCASIONALLY LIFT AND/OR MOVE UP TO 25 POUNDS. MUST BE WILLING AND ABLE TO TRAVEL UP TO 50% OF THE TIME.\n\n#DRO",
    "job_skill_set": [
      "sales",
      "customer service",
      "presentation skills",
      "technical aptitude",
      "Microsoft Office",
      "lead generation",
      "mechanical aptitude",
      "data analysis",
      "self-motivation",
      "communication",
      "relationship building",
      "teamwork",
      "flexibility",
      "problem solving",
      "time management",
      "SAP",
      "Sirius",
      "equipment rental",
      "air compressor knowledge",
      "air dryer technology"
    ],
    "short_keywords": [
      "air",
      "analysis",
      "aptitude",
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "compressor",
      "customer",
      "data",
      "development",
      "dryer",
      "equipment",
      "flexibility",
      "generation",
      "knowledge",
      "lead",
      "management",
      "mechanical",
      "microsoft",
      "new",
      "office",
      "presentation",
      "problem",
      "relationship",
      "rental",
      "representative",
      "sales",
      "sap",
      "selfmotivation",
      "service",
      "sirius",
      "skills",
      "solving",
      "teamwork",
      "technical",
      "technology",
      "time"
    ]
  },
  {
    "job_id": "3906258056",
    "job_title": "VP, Business Development and Strategic Partnerships",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "THE CARBON ROBOTICS LASERWEEDER™ IMPLEMENT USES PRECISION COMPUTER VISION AND SOPHISTICATED AI TO KILL WEEDS WITH MILLIMETER ACCURACY. LASERWEEDING DELIVERS CONSISTENCY THAT PUTS GROWERS BACK IN CONTROL OF THEIR SCHEDULES AMID LABOR SHORTAGES, CHEMICAL COMPLEXITY, AND RISING COSTS. FOR HIGH-DENSITY CROPS, LASERWEEDING IS THE ONLY AUTOMATED SOLUTION. DESIGNED IN SEATTLE AND BUILT IN DETROIT, IT’S THE FUTURE OF WEED CONTROL.\n\nWE’RE A TEAM WHO WANTS MORE! CARBON ROBOTICS OFFERS MORE! MORE PROFESSIONAL GROWTH, BIGGER PROBLEMS TO SOLVE, MISSION DRIVEN PROGRESS IN EVERY TASK! THERE’S INTERESTING PROBLEMS WITH A BREADTH OF EXPOSURE BECAUSE LASER WEEDING TOUCHES MORE THAN YOU THINK!\n\nWE ARE A NO-NONSENSE TEAM OF PASSIONATE PEOPLE WITH A BIAS FOR ACTION. WE KNOW THAT OUR ABILITY TO EXECUTE ON OUR IDEAS IS WHAT SETS US APART. WE DO WHAT WE SAY WE ARE GOING TO DO, EXTERNALLY AND INTERNALLY. WE TRUST OUR PEOPLE TO ACT INDEPENDENTLY AND MAKE PRACTICAL, REAL-WORLD DECISIONS.\n\nJOIN THE WEEDING REVOLUTION AND FOLLOW CARBON ROBOTICS ON LINKEDIN, YOUTUBE, TWITTER AND INSTAGRAM.\n\nARE YOU READY TO HELP US DESIGN AND BUILD OUR LASERWEEDER THAT SOLVE REAL PROBLEMS IN OUR FOOD SUPPLY?\n\nCARBON ROBOTICS IS SEEKING A VICE PRESIDENT OF BUSINESS DEVELOPMENT AND STRATEGIC PARTNERSHIPS PLAYS A CRITICAL ROLE IN DRIVING THE GROWTH AND EXPANSION OF THE COMPANY THROUGH IDENTIFYING, DEVELOPING, AND NURTURING STRATEGIC PARTNERSHIPS. THIS ROLE REQUIRES A BLEND OF STRATEGIC THINKING, BUSINESS ACUMEN, AND RELATIONSHIP-BUILDING SKILLS TO ESTABLISH MUTUALLY BENEFICIAL ALLIANCES AND DRIVE REVENUE GROWTH THROUGH CUSTOMER AND FINANCIAL PARTNERSHIPS. THE VP WILL BE RESPONSIBLE FOR IDENTIFYING NEW BUSINESS OPPORTUNITIES, NEGOTIATING PARTNERSHIPS, AND CULTIVATING RELATIONSHIPS.\n\nRESPONSIBILITIES:\n\nSTRATEGIC PLANNING: DEVELOP AND EXECUTE THE COMPANY'S BUSINESS DEVELOPMENT STRATEGY IN ALIGNMENT WITH OVERALL CORPORATE OBJECTIVES. IDENTIFY NEW MARKET OPPORTUNITIES, ASSESS POTENTIAL PARTNERSHIPS, AND PRIORITIZE INITIATIVES TO DRIVE GROWTH. PARTNERSHIP DEVELOPMENT: PROACTIVELY IDENTIFY AND EVALUATE POTENTIAL STRATEGIC PARTNERSHIPS, INCLUDING ALLIANCES, JOINT VENTURES, AND DISTRIBUTION AGREEMENTS. DEVELOP A PIPELINE OF PARTNERSHIP OPPORTUNITIES AND MANAGE THE END-TO-END PARTNERSHIP LIFECYCLE. NEGOTIATION AND DEAL-MAKING: LEAD NEGOTIATIONS WITH POTENTIAL PARTNERS TO SECURE FAVORABLE TERMS AND AGREEMENTS. COLLABORATE WITH LEGAL AND FINANCE TEAMS TO STRUCTURE DEALS THAT ALIGN WITH THE COMPANY'S OBJECTIVES WHILE MITIGATING RISKS. RELATIONSHIP MANAGEMENT: CULTIVATE AND MAINTAIN RELATIONSHIPS WITH KEY PARTNERS, STAKEHOLDERS, AND INDUSTRY INFLUENCERS. SERVE AS THE PRIMARY POINT OF CONTACT FOR STRATEGIC PARTNERS, ENSURING ALIGNMENT OF GOALS AND EFFECTIVE COMMUNICATION. MARKET ANALYSIS: CONDUCT MARKET RESEARCH AND ANALYSIS TO IDENTIFY EMERGING TRENDS, COMPETITIVE THREATS, AND OPPORTUNITIES FOR GROWTH. STAY ABREAST OF INDUSTRY DEVELOPMENTS AND COMPETITOR ACTIVITIES TO INFORM STRATEGIC DECISION-MAKING. CROSS-FUNCTIONAL COLLABORATION: COLLABORATE WITH INTERNAL TEAMS, INCLUDING PRODUCT DEVELOPMENT, MARKETING, AND SALES, TO ALIGN PARTNERSHIP INITIATIVES WITH BROADER BUSINESS OBJECTIVES. DRIVE CROSS-FUNCTIONAL PROJECTS TO ENSURE SUCCESSFUL IMPLEMENTATION OF PARTNERSHIP STRATEGIES. PERFORMANCE TRACKING AND REPORTING: ESTABLISH KEY PERFORMANCE INDICATORS (KPIS) TO MEASURE THE EFFECTIVENESS OF PARTNERSHIP INITIATIVES. TRACK PERFORMANCE METRICS, ANALYZE RESULTS, AND PROVIDE REGULAR REPORTING TO SENIOR LEADERSHIP. TEAM COLLABORATION: BUILD STRONG TEAM COLLABORATION WITH KEY CARBON ROBOTICS STAKEHOLDERS TO EXECUTE TOWARD COMPANY GOALS. \n\nREQUIREMENTS:\n\nBACHELOR'S DEGREE IN BUSINESS, MARKETING, OR RELATED FIELD; MBA OR ADVANCED DEGREE REQUIRED. PROVEN TRACK RECORD OF SUCCESS IN BUSINESS DEVELOPMENT AND STRATEGIC PARTNERSHIPS. STRONG NEGOTIATION SKILLS WITH A DEMONSTRATED ABILITY TO STRUCTURE COMPLEX DEALS. EXCELLENT COMMUNICATION AND INTERPERSONAL SKILLS, WITH THE ABILITY TO BUILD RAPPORT AND INFLUENCE STAKEHOLDERS AT ALL LEVELS. STRATEGIC THINKER WITH THE ABILITY TO ANALYZE MARKET TRENDS AND IDENTIFY GROWTH OPPORTUNITIES. EXPERIENCE LEADING AND MOTIVATING CROSS-FUNCTIONAL TEAMS IN A DYNAMIC ENVIRONMENT. RESULTS-ORIENTED MINDSET WITH A FOCUS ON DRIVING REVENUE GROWTH AND ACHIEVING BUSINESS OBJECTIVES. FAMILIARITY WITH RELEVANT INDUSTRIES, SUCH AS TECHNOLOGY, FINANCE, OR HEALTHCARE, PREFERRED. ABILITY TO TRAVEL AS NEEDED UP TO 70% OF THE TIME. PARTNER WITH EXECUTIVE LEADERSHIP TO SUPPORT ADDITIONAL INITIATIVES AS NEEDED. \n\nCARBON ROBOTICS FOLLOWS EQUITABLE HIRING PRACTICES. FLEXIBILITY IN OUR HIRING PROCESS ALLOWS HIRING OF TALENT AT LEVELS DIFFERENT FROM WHAT ARE POSTED. THE COMPENSATION RANGE OUTLINED IS BASED ON A TARGET BUDGETED BASE SALARY. INDIVIDUAL BASE PAY DEPENDS ON VARIOUS FACTORS SUCH AS RELEVANT EXPERIENCE AND SKILL, INTERVIEW ASSESSMENTS AND RESPONSIBILITY OF ROLE, JOB DUTIES/REQUIREMENTS. OFFERS ARE DETERMINED USING OUR EQUITABLE HIRING PRACTICES. CARBON ROBOTICS OFFERS ADDITIONAL COMPENSATION IN THE FORM OF BENEFITS PREMIUMS, PRE-IPO STOCK OPTIONS AND ON TARGET EARNING COMMISSIONS FOR APPROPRIATE POSITIONS. BASE PAY RANGES ARE REVIEWED EACH YEAR. WE ARE COMMITTED TO THE PRINCIPLE OF PAY EQUITY – PAYING EMPLOYEES EQUITABLY FOR SIMILAR WORK.\n\nCARBON ROBOTICS' BASE SALARY PAY RANGE:\n\n$180,000—$250,000 USD\n\nWHY WOULD YOU JOIN CARBON ROBOTICS?\n\nPASSION FOR BUILDING TEAMS CAPABLE OF SOLVING UNIQUELY INTERESTING PROBLEMS. INNOVATION WHILE DISRUPTING THE MARKET IS WHAT WE DO. PROFILED IN WSJ AND FORBES, CARBON ROBOTICS IS POISED TO BECOME THE NEXT BILLION DOLLAR COMPANY IN THE RAPIDLY GROWING WORLDWIDE AG-TECH INDUSTRY.\n\nWE OFFER COMPETITIVE COMPENSATION AND BENEFITS TO OUR FULL TIME US BASED* EMPLOYEES, INCLUDING: \n\nCOMPETITIVE SALARIESPRE-IPO STOCK OPTIONSGENEROUS BENEFITS:FULLY-PAID MEDICAL, DENTAL, AND VISION INSURANCE PREMIUMS FOR YOU AND ALL DEPENDENTSLIFE INSURANCELONG TERM DISABILITYFLEXIBLE PTO401(K) PLANPET INSURANCECOMMUTER BENEFITSWORK CULTURE: BE A PART OF AN INCLUSIVE AND TIGHT-KNIT COMPANY CULTURE THAT VALUES INNOVATION AND MISSION-DRIVEN SUCCESS. INTERNATIONALLY BASED EMPLOYEES BENEFITS VARIES\n\nCARBON ROBOTICS IS BUILDING A CULTURE OF DIVERSITY AND INCLUSION FOR ALL. WE WELCOME EVERYONE’S VOICE AND BELIEVE IN OPEN AND TRANSPARENT COMMUNICATION. WE BELIEVE THE BEST PRODUCTS, SERVICES, AND COMPANIES ARE BUILT BY STRONG TEAMS THAT INCLUDE A DIVERSITY OF BACKGROUNDS, PERSPECTIVES, IDEAS, AND EXPERIENCES. WE ARE COMMITTED TO SUPPORTING AND ENABLING GROWTH AND OPPORTUNITY FOR EVERY EMPLOYEE AT EVERY LEVEL. THIS IS THE FOUNDATION TO WHICH WE WILL BUILD A TRULY UNIQUE ENVIRONMENT.\n\nWE ARE EQUALLY COMMITTED TO EQUAL EMPLOYMENT OPPORTUNITY, AND IT IS FOUNDATIONAL TO HOW WE RECRUIT AND HIRE OUR TALENTED TEAM. EMPLOYMENT IS DETERMINED BASED UPON CAPABILITIES AND QUALIFICATIONS WITHOUT DISCRIMINATION ON THE BASIS OF RACE, CREED, COLOR, RELIGION, SEX, GENDER IDENTIFICATION AND EXPRESSION, MARITAL STATUS, MILITARY STATUS OR STATUS AS AN HONORABLY DISCHARGE/VETERAN, PREGNANCY (INCLUDING POTENTIAL PREGNANCY, PREGNANCY-RELATED CONDITIONS, AND CHILDBEARING), SEXUAL ORIENTATION, AGE (40 AND OVER), NATIONAL ORIGIN, ANCESTRY, CITIZENSHIP OR IMMIGRATION STATUS, PHYSICAL, MENTAL, OR SENSORY DISABILITY , HIV/AIDS OR HEPATITIS C STATUS, GENETIC INFORMATION, STATUS AS AN ACTUAL OR PERCEIVED VICTIM OF DOMESTIC VIOLENCE, SEXUAL ASSAULT, OR STALKING, OR ANY OTHER PROTECTED CLASS AS ESTABLISHED BY LAW.\n\n#TALENTACQUISITION #LASERWEEDING #LASERWEEDER #WEEDCONTROL #AGTECH #AGTECHNOLOGY #FARMTECH #ROBOTICS #LASERS #LASERSANDROBOTS #MISSIONDRIVEN #AI #STARTUP #WEAREHIRING #COMPUTERVISION #MACHINELEARNING #CARBONROBOTICS",
    "job_skill_set": [
      "business development",
      "strategic partnerships",
      "negotiation",
      "market analysis",
      "financial analysis",
      "project management",
      "cross-functional collaboration",
      "customer relationship management",
      "data analysis",
      "marketing",
      "sales",
      "strategic thinking",
      "communication",
      "interpersonal skills",
      "team collaboration",
      "problem solving",
      "results-oriented mindset",
      "independence",
      "influence",
      "flexibility",
      "leadership",
      "AI",
      "computer vision",
      "MBA"
    ],
    "short_keywords": [
      "ai",
      "analysis",
      "and",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "computer",
      "crossfunctional",
      "customer",
      "data",
      "development",
      "financial",
      "flexibility",
      "independence",
      "influence",
      "interpersonal",
      "leadership",
      "management",
      "market",
      "marketing",
      "mba",
      "mindset",
      "negotiation",
      "partnerships",
      "problem",
      "project",
      "relationship",
      "resultsoriented",
      "sales",
      "skills",
      "solving",
      "strategic",
      "team",
      "thinking",
      "vision",
      "vp"
    ]
  },
  {
    "job_id": "3899524220",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "BUSINESS DEVELOPMENT MANAGER – COMMERCIAL STAFFING\nFEATURED MAU EMPLOYEE BENEFITS:COMPETITIVE BASE SALARY AND UNCAPPED COMMISSIONMEDICAL, DENTAL, VISION AND COMPANY PAID LONG TERM DISABILITY INSURANCESPAID HOLIDAYS, VACATION, AND PERSONAL TIMEHEALTH CLUB REIMBURSEMENT PROGRAM401K AND SALARY CONTINUATION PROGRAMEDUCATION REIMBURSEMENT PROGRAMSUBSCRIPTION TO SANDLER SALES TRAINING PROGRAM – WEEKLY PROFESSIONAL DEVELOPMENT OPPORTUNITIES AND ONE-ON-ONE COACHING\nJOB SUMMARY:THE BUSINESS DEVELOPMENT MANAGER ROLE IS CRITICAL IN SUPPORTING THE SUSTAINED GROWTH MAU HAS EXPERIENCED SINCE ITS INCEPTION IN 1973. THIS POSITION IS RESPONSIBLE FOR INCREASING SALES THROUGH NEW BUSINESS GROWTH FOR ALL MAU’S SEGMENTS IN THE ASSIGNED TERRITORY. SUCCESSFUL BUSINESS DEVELOPMENT MANAGER CAN \"HUNT\" AND DELIVER SERVICE WITH A SENSE OF URGENCY WHICH LEADS TO SIGNIFICANT EARNING POTENTIAL.\nKEY RESPONSIBILITIES:DEVELOP A SALES PIPELINE THROUGH LEAD GENERATION, FOLLOW UP, AND CLOSING OF NEW BUSINESS.COLLABORATE WITH THE B2B MARKETING TEAM ON LEAD GENERATION AND MARKET RESEARCH.CONSULT WITH EXISTING CUSTOMERS TO EXPAND OUR RELATIONSHIP INTO NEW BUSINESS OFFERINGS.DELIVER A CONSULTATIVE SELLING APPROACH TO IDENTIFY AND MEET CLIENT NEEDS.PRESENT SOLUTION OPTIONS TO KEY LEADERS, EXECUTIVES, AND SELECTION COMMITTEES.LEVERAGE TECHNOLOGY AND MARKET INTELLIGENCE TOOLS SUCH AS, SALESFORCE, PARDOT, ZOOM INFO, AND SALES NAVIGATOR TO OPTIMIZE TERRITORY PLAN.BUILD AND MAINTAIN TRUSTING RELATIONSHIPS WITH CURRENT AND PROSPECTIVE CLIENTS.MAINTAIN A WORKING KNOWLEDGE OF THE LOCAL MARKET AND COMPETITIVE LANDSCAPE.COLLABORATE WITH HIRING MANAGERS, RECRUITERS, AND OTHER INTERNAL AND EXTERNAL STAKEHOLDERS TO DELIVER EFFICIENT AND EFFECTIVE BUSINESS SOLUTIONS TO CLIENTS.CLOSE NEW BUSINESS TO MEET TERRITORY SALES GOALS AND PASS LEADS TO OTHER SALES DIVISIONS AS IDENTIFIED.\nEDUCATION AND EXPERIENCE REQUIREMENTS:BACHELOR’S DEGREE IN BUSINESS ADMINISTRATION OR RELATED FIELD (REQUIRED)5-7 YEARS OF B2B SALES EXPERIENCE (REQUIRED)EXPERIENCE SELLING SERVICE-ORIENTED SOLUTIONS (PREFERRED)EXPERIENCE SELLING STAFFING SOLUTIONS (PREFERRED)PROFICIENCY USING CRM TOOLS; SALESFORCE (PREFERRED)ETHICAL CONDUCT (REQUIRED FOR ALL MAU TEAM MEMBERS)PERSONAL EFFECTIVENESS/CREDIBILITY (REQUIRED FOR ALL MAU TEAM MEMBERS)RESULTS DRIVEN WITH A STRONG BUSINESS ACUMEN INCLUDING FINANCIAL MANAGEMENTNETWORKING AND LEAD GENERATIONTERRITORY MANAGEMENT AND MARKET ANALYSISCONSULTATIVE SELLING\nPHYSICAL DEMANDS:THIS POSITION MAY REQUIRE THE FOLLOWING TO BE PERFORMED WITH OR WITHOUT REASONABLE ACCOMMODATION.\nABOUT MAU:MAU WORKFORCE SOLUTIONS IS AN INNOVATIVE GLOBAL COMPANY WITH EXTENSIVE EXPERIENCE PROVIDING SOLUTIONS FOR SUCCESS IN STAFFING, RECRUITING, TECHNOLOGY AND OUTSOURCING TO OUR CLIENTS, EMPLOYEES AND APPLICANTS. HEADQUARTERED IN AUGUSTA, GA SINCE 1973, MAU IS A FAMILY AND MINORITY-OWNED COMPANY OFFERING BETTER PROCESSES AND BETTER PEOPLE TO CREATE EFFICIENCIES AND GREATER PROFITS FOR OUR CLIENTS. OUR RELATIONSHIPS WITH WORLD-CLASS COMPANIES, OUR TRAINING PROGRAMS AND OUR CULTURE OF FAMILY ALLOW MAU TO OFFER BETTER RESULTS, BETTER JOBS AND BETTER LIVES TO THOSE WHO WORK WITH US.",
    "job_skill_set": [
      "B2B Sales",
      "Lead Generation",
      "Consultative Selling",
      "Market Analysis",
      "Territory Management",
      "Service-oriented Solutions",
      "Financial Management",
      "Communication",
      "Relationship Building",
      "Results Driven",
      "Personal Effectiveness",
      "Ethical Conduct",
      "Collaboration",
      "Problem Solving",
      "Networking",
      "Trustworthiness",
      "Urgency",
      "Salesforce",
      "CRM Tools",
      "Staffing Solutions"
    ],
    "short_keywords": [
      "analysis",
      "b2b",
      "building",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "conduct",
      "consultative",
      "crm",
      "development",
      "driven",
      "effectiveness",
      "ethical",
      "financial",
      "generation",
      "lead",
      "management",
      "manager",
      "market",
      "networking",
      "personal",
      "problem",
      "relationship",
      "results",
      "sales",
      "salesforce",
      "selling",
      "serviceoriented",
      "solutions",
      "solving",
      "staffing",
      "territory",
      "tools",
      "trustworthiness",
      "urgency"
    ]
  },
  {
    "job_id": "3904389998",
    "job_title": "Business Development Consultant",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "BENEFITS START DAY 1 FOR FULL-TIME COLLEAGUES - NO WAITING PERIOD!\n\nFOR MORE INFORMATION ABOUT OUR BENEFITS, SEE BELOW!\n\nWE ARE PROUD TO BE A MEMBER OF THE RENTOKIL FAMILY OF COMPANIES, THE GLOBAL LEADER IN PEST CONTROL AND OTHER SERVICES ACROSS MORE THAN 90 COUNTRIES. WE PRIDE OURSELVES ON BEING A TRUSTED PARTNER TO MANY OF THE WORLD'S LEADING BRANDS AND SERVE CONSUMER AND BUSINESS CUSTOMERS ACROSS MULTIPLE INDUSTRIES. WE ARE EXTREMELY PROUD OF OUR LEGACY OF EXCELLENCE AND CONSTANTLY WORK TO FULFILL OUR MISSION TO \"PROTECT PEOPLE, ENHANCE LIVES, AND PRESERVE THE PLANET.\"\n\nWHAT DO OUR BUSINESS DEVELOPMENT CONSULTANTS DO?\n\nBUSINESS DEVELOPMENT CONSULTANTS ARE RESPONSIBLE FOR THE DEVELOPMENT AND PERFORMANCE OF ALL SALES ACTIVITIES IN ASSIGNED REGION. THEY ARE THE FIRST POINT OF CONTACT WITH CUSTOMERS AND ARE RESPONSIBLE FOR THE ACHIEVEMENT OF MAXIMUM PROFITABILITY AND GROWTH, IN LINE WITH COMPANY VISION AND VALUES. IN ADDITION, THEY EXECUTE SALES PLANS AND STRATEGIES TO EXPAND THE CUSTOMER BASE IN THE MARKETING AREA VIA TRADE SHOWS, HOME OWNERS’ ASSOCIATIONS AND INDUSTRY EVENTS\n\nJOB RESPONSIBILITIES INCLUDE, BUT ARE NOT LIMITED TO THE FOLLOWING:\n\nDEVELOP A TERRITORY GROWTH PLAN AND PROVIDE UPDATES ON PROGRESS VS. PLAN VIA CRM.SECURE PROSPECTIVE CLIENT APPOINTMENTS VIA PARTICIPATION IN TARGETED PROSPECTING, DROP-OFFS, COLD CALLING AND OTHER SELLING STRATEGIES (I.E. MARKETING LEAD GENERATION).PREPARE FOR APPOINTMENTS BY EXECUTING PROSPECTIVE CLIENT RESEARCH, TAILORING SALES MATERIALS AND LEVERAGING AVAILABLE RESOURCES.MEET WITH PROSPECTIVE CLIENTS TO SECURE THEIR BUSINESS. EXECUTE APPROPRIATE FOLLOW-UP CLIENT MEETINGS TO COMPLETE SALES PROCESS.MEET CLIENT TIME-LINES AND DELIVERABLES FOR SERVICE VIA CLOSE COORDINATION WITH OPERATION STAKEHOLDERS.PERFORM OTHER RELATED DUTIES AS ASSIGNED INCLUDING PARTICIPATION IN COMPANY MEETINGS, COMMUNICATION AND EVENTS.\n\nWHAT DO YOU NEED?\n\nHIGH SCHOOL DIPLOMA OR GED, COLLEGE PREFERREDBACHELOR’S DEGREE OR EQUIVALENT COMBINATION OF EXPERIENCE, EDUCATION AND TRAININGPREFERABLY 3-5 YEARS SALES EXPERIENCE IN A HUNTING CAPACITYSTRONG BUSINESS ACUMEN WITH BACKGROUND IN SALES, RELATIONSHIP DEVELOPMENT AND/OR EXCELLENT CUSTOMER EXPERIENCEEXPERIENCE ANALYZING FINANCIAL REPORTS, IN A COMPLEX, FAST-PACED ENVIRONMENTAVAILABLE TO TRAVEL AS NEEDED (30% OR MORE)WORKING KNOWLEDGE OF SALESFORCE.COMPROFESSIONAL OFFICE ENVIRONMENTTHE WORK REQUIRES STRENUOUS PHYSICAL EXERTION AND THE EMPLOYEE MAY BE REQUIRED TO DRIVE, STAND, WALK, BEND, SIT, CLIMB, KNEEL AND CROUCH FOR EXTENDED PERIODS OF TIME, AS WELL AS SEE, TALK, HEAR AND USE HANDS AND ARMS TO GRASP, HANDLE, REACH AND FEEL.ABILITY TO LIFT UP TO 50 LBS. IN A REPETITIOUS MANNER.AVAILABLE TO WORK MONDAY-FRIDAY AND SATURDAYS AS NEEDED.MUST PASS PRE-EMPLOYMENT BACKGROUND SCREENMUST POSSESS A VALID DRIVER’S LICENSE AND PASS MOTOR VEHICLE RECORD SEARCH.\n\nBASE PAY RANGE: $53,000 - $60,000/YEAR\n\nANNUAL EARNING POTENTIAL: $67,000 - $108,900/YEAR\n\nIN ADDITION TO THE BASE PAY, A COLLEAGUE WORKING IN THIS ROLE WHO HAS COMPLETED TRAINING MAY BE ELIGIBLE TO EARN ADDITIONAL MONETARY COMPENSATION INCLUDING OVERTIME, INCENTIVE AND/OR COMMISSION PAY. TOTAL ANNUAL EARNING POTENTIAL MAY VARY BASED ON PERFORMANCE, ASSIGNED ROUTES AND ACHIEVING KEY PERFORMANCE INDICATORS (\"KPIS\").\n\nWHY CHOOSE RENTOKIL ?\n\nA CAREER WITH RENTOKIL CAN BE A PROFESSIONAL TRAJECTORY FILLED WITH OPPORTUNITY. WE PRIDE OURSELVES ON BEING A WORLD-CLASS TEAM THAT REWARDS HIGH PERFORMANCE, AND WE LOVE TO PROMOTE FROM WITHIN. WE OFFER COMPETITIVE PAY AND MANY OF OUR ROLES OFFER PERFORMANCE INCENTIVES.\n\nBELOW YOU'LL FIND INFORMATION ABOUT SOME OF WHAT RENTOKIL HAS TO OFFER. ALL FULL-TIME COLLEAGUES QUALIFY FOR THE FOLLOWING AND PART-TIME COLLEAGUES QUALIFY FOR MOST BENEFITS AFTER THEY MEET CERTAIN CRITERIA.\n\nCLICK HERE TO READ MORE ABOUT OUR TOTAL REWARDS PROGRAM WHICH INCLUDES: \n\nPROFESSIONAL AND PERSONAL GROWTH\n\nMULTIPLE AVENUES TO GROW YOUR CAREERRENTOKIL IS A DRUG FREE WORKPLACE.TRAINING AND DEVELOPMENT PROGRAMS AVAILABLETUITION REIMBURSEMENT BENEFITS (FOR FT COLLEAGUES)\n\nHEALTH AND WELLNESS\n\nHEALTH BENEFITS INCLUDING MEDICAL, DENTAL, VISION, DISABILITY, AND LIFE INSURANCE PLUS MUCH MOREFULL-TIME COLLEAGUES ARE ELIGIBLE TO BEGIN ENROLLMENT IMMEDIATELY UPON HIRE WITH BENEFITS STARTING ON DAY\n\nSAVINGS AND RETIREMENT\n\n401(K) RETIREMENT PLAN WITH COMPANY-MATCHING CONTRIBUTIONS \n\nWORK-LIFE BALANCE\n\nVACATION DAYS & SICK DAYSCOMPANY-PAID HOLIDAYS & FLOATING HOLIDAYSA COMPANY MINDSET THAT PRIORITIZES HEALTH, SAFETY, AND FLEXIBILITY\n\nWE ARE LOOKING FOR INDIVIDUALS WHO WANT TO MAKE A DIFFERENCE WHERE OUR CUSTOMERS LIVE AND WORK.  IS THAT YOU?\n\nOUR COMPANIES ARE PROUD TO BE AFFIRMATIVE ACTION (AA) AND EQUAL OPPORTUNITY EMPLOYERS (EOE) INCLUSIVE OF VETERANS AND THOSE WITH DISABILITIES.\n\nBY APPLYING TO THIS POSITION, YOU CONSENT TO RECEIVE AN INITIAL TEXT MESSAGE TO COLLECT YOUR COMMUNICATION PREFERENCES. MESSAGE AND DATA RATES MAY APPLY. YOU CAN OPT-OUT ANY TIME.",
    "job_skill_set": [
      "sales",
      "CRM",
      "financial analysis",
      "marketing lead generation",
      "customer experience",
      "communication",
      "relationship development",
      "problem solving",
      "teamwork",
      "adaptability",
      "time management",
      "negotiation",
      "Salesforce.com",
      "territory growth planning"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "business",
      "businessdevelopment",
      "communication",
      "consultant",
      "crm",
      "customer",
      "development",
      "experience",
      "financial",
      "generation",
      "growth",
      "lead",
      "management",
      "marketing",
      "negotiation",
      "planning",
      "problem",
      "relationship",
      "sales",
      "salesforcecom",
      "solving",
      "teamwork",
      "territory",
      "time"
    ]
  },
  {
    "job_id": "3885831622",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "IT'S FUN TO WORK IN A COMPANY WHERE PEOPLE TRULY BELIEVE IN WHAT THEY'RE DOING!\n\nWE'RE COMMITTED TO BRINGING PASSION AND CUSTOMER FOCUS TO THE BUSINESS.\n\nCORPORATE OVERVIEW\n\nIN TODAY’S CYBER THREAT LANDSCAPE, PROTECTION STARTS WITH PEOPLE. AT PROOFPOINT, THAT SIMPLE TRUTH FUELS OUR PASSION FOR PROTECTING USERS, THE DATA THEY CREATE, AND THE SYSTEMS THEY RELY ON FROM A UNIQUELY PEOPLE-CENTRIC PERSPECTIVE. AND WE’RE JUST AS PASSIONATE ABOUT FINDING THE RIGHT PEOPLE TO HELP US IN THAT MISSION. WHEN YOU JOIN PROOFPOINT, YOU’RE HELPING TO\n\nBUILD AND ENHANCE OUR PROVEN SECURITY PLATFORMBLEND INNOVATION AND SPEED IN A CONSTANTLY EVOLVING CLOUD ENVIRONMENTANALYZE NEW THREATS AND OFFER DEEP INSIGHT THROUGH DATA-DRIVEN INTELCOLLABORATE WITH CUSTOMERS TO HELP SOLVE THEIR TOUGHEST SECURITY CHALLENGES\n\nWE ARE SINGULARLY DEVOTED TO HELPING OUR CUSTOMERS PROTECT THEIR GREATEST ASSETS AND BIGGEST SECURITY RISK THEIR PEOPLE. THAT’S WHY WE’RE A LEADER IN NEXT-GENERATION CYBERSECURITY—AND WHY MORE THAN HALF OF THE FORTUNE 100 TRUST US AS A SECURITY PARTNER.\n\nABOUT THE BUSINESS DEVELOPMENT TEAM\n\nTHE PROOFPOINT BUSINESS DEVELOPMENT TEAM IS A GROUP OF AMBITIOUS INNOVATORS THAT ENJOY THE THRILL OF FINDING CREATIVE SOLUTIONS IN FAST-PACED ENVIRONMENTS. EAGER TO GROW THEIR SALES SKILLSETS, OUR BUSINESS DEVELOPMENT REPRESENTATIVES (BDRS) ARE COLLABORATIVE TEAM PLAYERS WHO ARE ALWAYS WILLING TO SHARE THEIR WINNING SALES TACTICS WITH THEIR PEERS. BDRS AT PROOFPOINT HAVE A DIRECT IMPACT ON THE SUCCESS OF OUR SALES ORGANIZATION. HAVING OWNERSHIP OF A CRITICAL PIECE OF THE SALES PROCESS, THEY TAKE PRIDE IN CONNECTING POTENTIAL CUSTOMERS WITH OUR AWARD-WINNING LINEUP OF CYBERSECURITY SOLUTIONS.\n\nOUR BUSINESS DEVELOPMENT REPS ARE TRUSTED PARTNERS, WORKING SIDE-BY-SIDE WITH OUR FIELD, TERRITORY AND ENTERPRISE ACCOUNT MANAGERS TO CAPTURE MARKET SHARE ACROSS THE USA. THEY ARE HIGHLY VALUED MEMBERS OF OUR ORGANIZATION AND FOR THIS REASON, PROOFPOINT HEAVILY INVESTS IN THEIR PROFESSIONAL GROWTH AND EMPOWERS THEM WITH THE RESOURCES AND SUPPORT TO ADVANCE THEIR CAREERS, WHETHER THAT BE AS AN ACCOUNT REPRESENTATIVE, CUSTOMER SUCCESS MANAGER, PROGRAM MANAGER, OR ANY OTHER OPPORTUNITY OF INTEREST.\n\nIF YOU ARE READY TO JOIN A TEAM THAT ALLOWS YOU THE AUTONOMY TO GROW YOUR PROFESSIONAL SALES SKILLSET, CONSIDER PROOFPOINT.\n\nABOUT THE ROLE BUSINESS DEVELOPMENT REPRESENTATIVE\n\nWE’RE LOOKING FOR A COLLABORATIVE TEAM PLAYER TO JOIN OUR RAPIDLY GROWING BUSINESS DEVELOPMENT TEAM IN DRAPER, UT. THIS IS A HYBRID WORK SCHEDULE WITH THREE DAYS IN THE OFFICE. THE IDEAL CANDIDATE WILL DEMONSTRATE THEIR ADAPTABILITY AND CREATIVE COMMUNICATION SKILLS AS THEY IDENTIFY, ENGAGE WITH AND QUALIFY POTENTIAL CUSTOMERS IN THEIR ASSIGNED TERRITORY. OUR MOST SUCCESSFUL BDRS CREATE INTEGRITY FOR THEMSELVES IN THE EYES OF THEIR BUSINESS PARTNERS BY COMING PREPARED TO MEETINGS, ASKING THOUGHTFUL QUESTIONS AND FOCUSING ON QUALITY OVER QUANTITY. THIS IS A HIGHLY VISIBLE ROLE WHERE YOU WILL, WHEN READY, HAVE THE OPPORTUNITY TO SHOWCASE YOUR WORK TO EXECUTIVES AND PARTICIPATE IN DEMO CALLS WITH CUSTOMERS.\n\nBUSINESS DEVELOPMENT REPRESENTATIVES ARE EQUIPPED WITH CRM TOOLS LIKE SALESFORCE.COM AND OUTREACH, AS WELL AS SOCIAL MEDIA CAMPAIGNS, TO ENSURE THEY HAVE THE RESOURCES THEY NEED TO BE SUCCESSFUL. THE BUSINESS DEVELOPMENT REPRESENTATIVE ROLE IS UNIQUE AT PROOFPOINT COMPARED TO OTHER COMPANIES, BECAUSE HERE, YOU WILL HAVE THE OPPORTUNITY TO DO MUCH MORE THAN SCHEDULE CLIENT MEETINGS AND COLD CALL FROM A SCRIPT. YOU WILL HAVE THE CHANCE TO USE YOUR JUDGEMENT, SHARE YOUR IDEAS AND FORM LASTING RELATIONSHIPS AND EXPERIENCES THAT WILL HELP SHAPE THE NEXT STEPS IN YOUR PROFESSIONAL JOURNEY.\n\nTHIS IS AN EXCITING OPPORTUNITY FOR SOMEONE WHO IS INTERESTED IN JOINING A HIGH GROWTH, FAST PACED TECH COMPANY IN THE IN-DEMAND INDUSTRY OF ENTERPRISE CYBERSECURITY. AT PROOFPOINT YOU WILL BE DRIVEN BY THE DESIRE TO LEARN, GROW, AND SUCCEED IN YOUR PROFESSIONAL SALES OR MARKETING JOURNEY.\n\nWHY PROOFPOINT\n\nAT PROOFPOINT WE PRIDE OURSELVES ON OUR PEOPLE-CENTRIC APPROACH TO SUCCESS AND INNOVATION, WHICH EXTENDS TO HOW WE DESIGN ROLES WITHIN OUR ORGANIZATION AND HIRE TALENT AROUND THE WORLD. THE CYBERSECURITY LANDSCAPE IS EVER-EVOLVING, AND WE RECOGNIZE THAT THE SKILLS NEEDED TOMORROW MAY BE DIFFERENT THAN THE SKILLS NEEDED TODAY. THEREFORE, WE SEEK INDIVIDUALS FROM A VARIETY OF BACKGROUNDS WITH A RANGE OF WORK HISTORIES WHO CAN LEVERAGE THEIR RELEVANT EXPERIENCE AS WELL AS TRANSFERRABLE SKILLS TO HELP OUR COMPANY GROW. CRITICAL THINKERS, PROBLEM SOLVERS, COLLABORATORS, COMMUNICATORS, AND FUTURE-ORIENTED CREATIVES NEED APPLY. IT’S NOT ABOUT WHERE YOU STARTED, OR WHERE YOU’RE COMING FROM, IT’S ABOUT WHERE YOU CAN GO WITH PROOFPOINT\n\nIF YOU LIKE WILD GROWTH AND WORKING WITH HAPPY, ENTHUSIASTIC OVER-ACHIEVERS, YOU'LL ENJOY YOUR CAREER WITH US!\n\n",
    "job_skill_set": [
      "CRM Tools",
      "Salesforce.com",
      "Collaboration",
      "Communication",
      "Problem Solving",
      "Adaptability",
      "Critical Thinking",
      "Creativity",
      "Customer Focus",
      "Judgment",
      "Social Media Campaigns",
      "Data Analysis",
      "Cybersecurity Knowledge"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "business",
      "businessdevelopment",
      "campaigns",
      "collaboration",
      "communication",
      "creativity",
      "critical",
      "crm",
      "customer",
      "cybersecurity",
      "data",
      "development",
      "focus",
      "judgment",
      "knowledge",
      "media",
      "problem",
      "representative",
      "salesforcecom",
      "social",
      "solving",
      "thinking",
      "tools"
    ]
  },
  {
    "job_id": "3902951563",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "IF YOU WANT TO RESHAPE THE WORLD AND DISCOVER YOUR GREATEST POTENTIAL, SAINT-GOBAIN PROVIDES ONE-OF-A-KIND OPPORTUNITIES FOR INNOVATIVE PROBLEM SOLVERS. WE'RE ONE OF ONLY TWO COMPANIES IN THE WORLD THAT IS CONSISTENTLY RECOGNIZED AS BOTH A TOP GLOBAL EMPLOYER AND A TOP 100 GLOBAL INNOVATOR, BUT SAINT-GOBAIN'S REMARKABLE STORY AND CULTURE OF INNOVATION BEGINS WITH A TEAM OF NEARLY 200,000 CREATIVE, DIVERSE AND PASSIONATE TEAM MEMBERS COLLABORATING ACROSS THE GLOBE. WE ARE COMMITTED TO OUR MISSION TO IMPROVE LIVES BECAUSE, EVERY DAY, WE WITNESS THE ENORMOUS IMPACT OF OUR EFFORTS ON THE WORLD AROUND US.\nTHE BUSINESS DEVELOPMENT MANAGER WILL BE RESPONSIBLE FOR SALES AND MARKETING ACTIVITIES RELATED TO THE DEVELOPMENT OF OUR SEALING BUSINESS TOWARD NEW CUSTOMERS AND APPLICATIONS IN SEMICONDUCTOR INDUSTRY. THE ROLE COMBINES A HIGH LEVEL PROSPECTIVE STRATEGIC MARKETING WORK AT A GLOBAL SCOPE, TOGETHER WITH A FIELD BUSINESS DEVELOPMENT ACTIVITY TO APPROACH, INITIATE AND WIN SALES WITH NORTH AMERICAN CUSTOMERS\nRESPONSIBILITIESANALYZE & MONITOR EXISTING AND UP AND COMING PLAYERS AND TECHNOLOGIES IN THE SEMICONDUCTOR CHIP MAKING INDUSTRY AND IDENTIFY OPPORTUNITIES FOR OMNISEALS SOLUTIONS TO GROW. WILL NEED TO CLOSELY WORK WITH THE TECHNICAL TEAM AND THE OPERATIONS TEAM TO CONTRIBUTE TO DEVELOPING NEW OFFERINGS TAILORED TO THIS MARKET\nEXPLORE, ASSESS, AND DEVELOP NEW BUSINESS OPPORTUNITIES WITH CUSTOMERS (LARGE COMPANIES AND START-UPS) THAT ARE ACTIVE IN THE SEMICONDUCTOR MANUFACTURING PROCESS OR SEEKING TO DISRUPT THE INDUSTRY BY ACTIVELY DEVELOPING NEW SOLUTIONS. USING THE MARKET INTELLIGENCE TO ADJUST THE BUSINESS STRATEGY AS NEEDED\nCOLLECTING ALL KEY FIELD INFORMATION (VOICE OF CUSTOMER, NEW MARKET NEEDS AND TRENDS, COMPETITIVE AND INTELLIGENCE INFORMATION), PARTICIPATE IN TRADE SHOWS, AND WORK WITH MANUFACTURING OPERATIONS TO PROVIDE ACCURATE AND TIMELY INFORMATION REGARDING CUSTOMER DEMAND TO SUPPORT SALES AND SERVICE OBJECTIVES\nHANDS ON DRIVING AND EXECUTION OF THE SALES PROCESS AT NEW AND EXISTING CUSTOMERS WITHIN THE SEMICONDUCTOR INDUSTRY VIA CUSTOMER VISITS, DIGITAL MARKETING, AND GENERATING NEW OPPORTUNITIES. RESPONSIBLE FOR SALES CYCLE AND CUSTOMER RELATIONS FOR EXISTING AND PROSPECTIVE CUSTOMERS\nPROVIDE SUPPORT TO THE SALES ORGANIZATIONS IN EUROPE AND ASIA TO DIRECT THEM TOWARD THE IDENTIFIED OPPORTUNITIES AND ACTIVELY SUPPORT MARKETING COMMUNICATIONS EFFORTS TOWARD THE SEMICONDUCTOR CHIP MANUFACTURING INDUSTRY\nQUALIFICATIONSBACHELOR'S DEGREE IN ENGINEERING OR TECHNICAL DISCIPLINE5+ YEARS' EXPERIENCE WORKING IN B2B SALES WITH FOCUS ON TECHNICAL SALES OF COMPONENTS (MUST READ BLUEPRINTS AND BE ABLE TO INTERFACE WITH ENGINEERS ON TECHNICAL ASPECTS OF APPLICATION)3+ YEARS' EXPERIENCE WORKING IN B2B SALES WITH MECHANICAL COMPONENTS IN SEMICONDUCTOR INDUSTRY3+ YEARS' EXPERIENCE DEVELOPING KNOWLEDGE OF SEMICONDUCTOR INDUSTRY AND CHIP MAKING PROCESSPROVEN RELATIONSHIP BUILDING SKILLS AND COMMERCIAL AWARENESS, TO UNDERSTAND THE CUSTOMER'S BUSINESS NEEDS AND IDENTIFY PLANS TO DELIVER THEMSTRATEGIC THINKING AND ANALYTIC CAPABILITYORGANIZATIONAL INFLUENCING SKILLS\nSAINT-GOBAIN PROVIDES EQUAL EMPLOYMENT OPPORTUNITIES (EEO) TO ALL EMPLOYEES AND APPLICANTS FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, GENDER, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, NATIONAL ORIGIN, AGE, DISABILITY, GENETIC INFORMATION, MARITAL STATUS, AMNESTY, OR STATUS AS A COVERED VETERAN IN ACCORDANCE WITH APPLICABLE FEDERAL, STATE AND LOCAL LAWS. SAINT-GOBAIN IS AN EQUAL OPPORTUNITY EMPLOYER OF INDIVIDUALS WITH DISABILITIES AND SUPPORTS THE HIRING OF VETERANS. THIS POSITION IS SUBJECT TO EXPORT CONTROLS UNDER THE INTERNATIONAL TRAFFIC IN ARMS REGULATIONS (ITAR). QUALIFIED APPLICANTS FOR THE POSITION MUST MEET THE ITAR DEFINITION OF “U.S. PERSON” AT 22 C.F.R. 120.15 AS A: U.S. CITIZEN, U.S. NATIONAL, LAWFUL PERMANENT RESIDENT, OR OTHERWISE A PROTECTED INDIVIDUAL (INCLUDING FOR EXAMPLE REFUGEES AND ASYLEES).\nEMPLOYEES HAVE THE FLEXIBILITY TO CHOOSE THE BENEFITS THAT BEST FIT THEIR INDIVIDUAL NEEDS.HEALTH AND WELLBEING – SUPPORTING YOUR WELLBEING, TO THRIVE IN LIFE AND WORK.MEDICAL, PRESCRIPTION DRUG, VISION, AND DENTAL INSURANCEHEALTHCARE SAVING ACCOUNT AND FLEXIBLE SPENDING ACCOUNT OPTIONSLIVEWELL WELLNESS PROGRAMEMPLOYEE ASSISTANCE PROGRAM (EAP)PAID TIME OFF AND PAID PARENTAL LEAVERETIREMENT AND PROTECTION - HELPING TO MAKE THE FUTURE LIFE YOU WANT A REALITY.401(K) WITH COMPANY MATCH, RETIREMENT ACCUMULATION PLAN (RAP), CASH BALANCE PENSION PLANCOMPANY-PROVIDED LIFE INSURANCE, AD&D, SHORT-TERM DISABILITYVOLUNTARY EMPLOYEE AND DEPENDENT LIFE INSURANCE, LONG-TERM DISABILITY, CRITICAL ILLNESS AND ACCIDENT INSURANCEADDITIONAL BENEFITS – HELPING SHAPE THE EXPERIENCE AND IMPACT YOU WANTCOMMUTER BENEFITSGROUP LEGALIDENTITY THEFT PROTECTIONAUTO AND HOME INSURANCEPET INSURANCE AND DISCOUNTSBACK-UP CHILD & ELDER CAREPERKSPOT EMPLOYEE DISCOUNT PROGRAM",
    "job_skill_set": [
      "Technical Sales",
      "Sales Process Management",
      "Customer Relationship Management",
      "Engineering or Technical Discipline",
      "Strategic Thinking",
      "Analytic Capability",
      "Relationship Building",
      "Organizational Influencing",
      "Communication",
      "Problem Solving",
      "Collaboration",
      "Adaptability",
      "B2B Sales",
      "Market Intelligence",
      "Mechanical Components Knowledge",
      "Semiconductor Industry Knowledge",
      "Blueprint Reading",
      "Digital Marketing"
    ],
    "short_keywords": [
      "adaptability",
      "analytic",
      "b2b",
      "blueprint",
      "building",
      "business",
      "businessdevelopment",
      "capability",
      "collaboration",
      "communication",
      "components",
      "customer",
      "development",
      "digital",
      "discipline",
      "engineering",
      "industry",
      "influencing",
      "intelligence",
      "knowledge",
      "management",
      "manager",
      "market",
      "marketing",
      "mechanical",
      "or",
      "organizational",
      "problem",
      "process",
      "reading",
      "relationship",
      "sales",
      "semiconductor",
      "solving",
      "strategic",
      "technical",
      "thinking"
    ]
  },
  {
    "job_id": "3902925331",
    "job_title": "Head of Business Development & Investor Relations",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "HEAD OF BUSINESS DEVELOPMENT & INVESTOR RELATIONS - WEALTH MANAGEMENT – CONNECTICUT, US\nTHIS ROLE IS PIVOTAL IN DRIVING THE FUTURE SUCCESS OF A GLOBAL WEALTH MANAGEMENT FIRM, DEDICATED TO BEING A TRUSTED STEWARD OF RESOURCES ACROSS GENERATIONS AND ECONOMIC CYCLES. THE SELECTED CANDIDATE WILL BE INSTRUMENTAL IN MAINTAINING EXISTING INVESTOR RELATIONSHIPS AND LEADING ALL INVESTOR ACQUISITION EFFORTS. \nA STRONG BACKGROUND IN CAPITAL RAISING FROM GLOBAL HIGH-NET-WORTH FAMILIES AND FOUNDATIONS IS ESSENTIAL, ALONG WITH SOPHISTICATED COMMUNICATION SKILLS WITH INVESTORS, THIRD-PARTY MARKETING FIRMS, AND THE DEVELOPMENT OF EXCEPTIONAL CLIENT COMMUNICATIONS. THE IDEAL CANDIDATE SHOULD BE INTELLECTUALLY CURIOUS, WITH A GLOBAL PERSPECTIVE AND OPENNESS TO LEARNING AND GROWTH WITHIN THE FIRM.\nKEY RESPONSIBILITIES:LEAD ALL MARKETING ACTIVITIES, INCLUDING MESSAGING, PROSPECT TARGETING, PIPELINE MANAGEMENT, SELLING, AND EXECUTION.UNDERTAKE PROACTIVE OUTREACH TO PROSPECTIVE INVESTORS, FOCUSING PARTICULARLY ON GLOBAL HIGH-NET-WORTH FAMILIES AND FOUNDATIONS.DEVELOP AND DISTRIBUTE CONTENT AND MATERIALS TO ARTICULATE THE FIRM’S INVESTMENT STRATEGY AND ETHOS.EMPLOY A PROCESS-DRIVEN APPROACH TO MANAGING RELATIONSHIPS AND REFILLING THE PROSPECT PIPELINE.COLLABORATE WITH THE FIRM’S PARTNERS ON MESSAGING AND MARKETING STRATEGY.PREPARE AND EXECUTE MARKETING MATERIALS, PRESENTATIONS, AND INVESTOR COMMUNICATIONS.ENGAGE PROACTIVELY WITH THE FIRM'S INVESTOR BASE TO COMMUNICATE FUND UPDATES, STRATEGIES, AND HANDLE INQUIRIES. STAY UPDATED ON MARKET TRENDS AND REGULATORY CHANGES.MANAGE DDQ’S, RFP’S, PITCH BOOKS, CRM MANAGEMENT, BASIC CLIENT PORTFOLIO ANALYTICS, AND ACCURATELY RESPOND TO CLIENT QUESTIONS.COORDINATE BUSINESS DEVELOPMENT INITIATIVES, INCLUDING CONFERENCES, ON-SITE MEETINGS, CONFERENCE CALLS, AND INVESTOR EVENTS AS NECESSARY.\nQUALIFICATIONS:A MINIMUM OF 8 YEARS OF EXPERIENCE IN INVESTOR RELATIONS, WITH LEADERSHIP ROLES OVERSEEING BUSINESS DEVELOPMENT AND SELLING TO INSTITUTIONS AND/OR HIGH-NET-WORTH INDIVIDUALS.UNCOMPROMISING ON HONESTY AND ATTENTION TO DETAIL. CANDID, RESPONSIBLE, HIGHLY ARTICULATE, AND A GOOD LISTENER. STRONG INTERPERSONAL SKILLS WITH A WELL-BALANCED, PROCESS-DRIVEN APPROACH.ABILITY TO LEVERAGE CULTURAL AND BUSINESS ACUMEN TO EFFECTIVELY COMMUNICATE WITH INTERNATIONAL INVESTORS AND FAMILY OFFICES, TAILORING PRESENTATIONS AND COMMUNICATIONS TO THEIR PREFERRED APPROACH.PROFICIENT IN WRITTEN COMMUNICATION AND CAPABLE OF EFFECTIVELY ARTICULATING COMPLEX INVESTMENT STRATEGIES TO ADDRESS SPECIFIC REQUIREMENTS AND CONCERNS OF FAMILY OFFICES, FOSTERING TRUST AND LONG-TERM PARTNERSHIPS.UNDERSTANDING OF THE MARKETS AND MACRO INVESTMENT STRATEGIES.A VALUE-ADDED SELLING APPROACH, CAPABLE OF ADDING INSIGHTS AS A BASIS FOR BUILDING RELATIONSHIPS.ABILITY TO UNDERSTAND AND ADDRESS THE SPECIFIC REQUIREMENTS AND CONCERNS OF FAMILY OFFICES, FOSTERING TRUST AND LONG-TERM PARTNERSHIPS.COMPETENCE TO REVIEW AND NEGOTIATE LEGAL, INVESTMENT MANAGEMENT, AND PARTNERSHIP AGREEMENTS.EXPERIENCED USER OF CRM SYSTEMS, AND FAMILIAR WITH HF PERFORMANCE ANALYSIS DATA.MULTILINGUAL PROFICIENCY IS PREFERRED.\nEDUCATIONAL REQUIREMENTS:BACHELOR’S DEGREE IN FINANCE, BUSINESS, ECONOMICS, OR A RELATED FIELD. AN ADVANCED DEGREE (MBA, CFA, OR EQUIVALENT) IS HIGHLY PREFERRED.A CLEAR UNDERSTANDING OF THE ASSET MANAGEMENT AND ALTERNATIVE ASSET MANAGEMENT INDUSTRY IS A SIGNIFICANT ADVANTAGE.\nCOMPENSATIONTHE COMPENSATION PACKAGE FOR THIS ROLE HAS BEEN CAREFULLY STRUCTURED TO ATTRACT THE MOST QUALIFIED PROFESSIONALS IN THE FIELD, REFLECTING THE PIVOTAL NATURE OF THE POSITION AND THE SIGNIFICANT IMPACT ON OUR CLIENT'S WEALTH MANAGEMENT STRATEGY. IT INCLUDES A COMPETITIVE SALARY, PERFORMANCE-BASED BONUSES, AND THE POTENTIAL FOR SIGNIFICANT PROFESSIONAL GROWTH WITHIN A LEADING GLOBAL WEALTH MANAGEMENT FIRM.\nWE ENCOURAGE CANDIDATES FROM ALL BACKGROUNDS TO APPLY, REAFFIRMING OUR COMMITMENT TO DIVERSITY AND INCLUSION, AND WELCOMING APPLICATIONS REGARDLESS OF RACE, RELIGION, GENDER IDENTITY OR EXPRESSION, SEXUAL ORIENTATION, NATIONAL ORIGIN, GENETICS, DISABILITY, AGE, OR VETERAN STATUS.",
    "job_skill_set": [
      "market analysis",
      "performance analysis",
      "business development",
      "presentation skills",
      "content development",
      "communication",
      "interpersonal skills",
      "attention to detail",
      "process-driven approach",
      "cultural acumen",
      "trust building",
      "listening skills",
      "responsibility",
      "adaptability",
      "capital raising",
      "investor relations",
      "CRM management",
      "investment strategy",
      "legal negotiation",
      "multilingual proficiency",
      "intellectual curiosity"
    ],
    "short_keywords": [
      "acumen",
      "adaptability",
      "analysis",
      "approach",
      "attention",
      "building",
      "business",
      "businessdevelopment",
      "capital",
      "communication",
      "content",
      "crm",
      "cultural",
      "curiosity",
      "detail",
      "development",
      "head",
      "intellectual",
      "interpersonal",
      "investment",
      "investor",
      "legal",
      "listening",
      "management",
      "market",
      "multilingual",
      "negotiation",
      "of",
      "performance",
      "presentation",
      "processdriven",
      "proficiency",
      "raising",
      "relations",
      "responsibility",
      "skills",
      "strategy",
      "to",
      "trust"
    ]
  },
  {
    "job_id": "3902782563",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "COMPANY DESCRIPTIONTRU LEAF INTERNATIONAL IS A COMPANY BASED IN CHICAGO, IL, DEDICATED TO CURATING SUPERIOR TOBACCO LEAF PRODUCTS DERIVED FROM NATURE'S FINEST RESOURCES. WITH A FOCUS ON HEALTH AND PURITY, TRU LEAF ENSURES THAT ITS TOBACCO LEAVES ARE FREE OF ANY HARMFUL ADDITIVES. THE COMPANY BELIEVES THAT SMOKING IS A CEREMONIOUS EXPERIENCE, WHERE EACH INHALATION REPRESENTS A MOMENT OF CONTEMPLATION AND ENJOYMENT. TRU LEAF STRIVES TO ENRICH THESE MOMENTS BY PROVIDING PREMIUM TOBACCO LEAVES THAT ELEVATE THE SMOKING EXPERIENCE AND CONTRIBUTE TO A BALANCED AND GRATIFYING LIFESTYLE FOR ITS LEAF FAMILY.\nROLE DESCRIPTIONTHIS IS A FULL-TIME ON-SITE ROLE AS A BUSINESS DEVELOPMENT REPRESENTATIVE AT TRU LEAF INTERNATIONAL. THE BUSINESS DEVELOPMENT REPRESENTATIVE WILL BE RESPONSIBLE FOR DAILY TASKS INCLUDING INSIDE SALES, LEAD GENERATION, COMMUNICATION, SALES, AND BUSINESS DEVELOPMENT. THE ROLE INVOLVES DEVELOPING AND IMPLEMENTING STRATEGIES TO EXPAND THE CUSTOMER BASE, BUILDING AND MAINTAINING STRONG BUSINESS RELATIONSHIPS, AND ACHIEVING SALES TARGETS.\nQUALIFICATIONSOUTBOUND SALES, SALES, AND BUSINESS DEVELOPMENT SKILLSEXPERIENCE IN LEAD GENERATION AND COMMUNICATIONEXCELLENT INTERPERSONAL AND NEGOTIATION SKILLSABILITY TO WORK INDEPENDENTLY AND COLLABORATIVELYSTRONG CUSTOMER RELATIONSHIP MANAGEMENT SKILLSEXPERIENCE IN THE TOBACCO INDUSTRY IS A PLUSEXPERIENCE IN A CRM SOFTWARE IS A PLUS",
    "job_skill_set": [
      "sales",
      "lead generation",
      "customer relationship management",
      "CRM software",
      "business development",
      "communication",
      "interpersonal skills",
      "negotiation",
      "independent work",
      "collaborative work",
      "tobacco industry knowledge"
    ],
    "short_keywords": [
      "business",
      "businessdevelopment",
      "collaborative",
      "communication",
      "crm",
      "customer",
      "development",
      "generation",
      "independent",
      "industry",
      "interpersonal",
      "knowledge",
      "lead",
      "management",
      "negotiation",
      "relationship",
      "representative",
      "sales",
      "skills",
      "software",
      "tobacco",
      "work"
    ]
  },
  {
    "job_id": "3905299905",
    "job_title": "Intern - Business Development",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "REQUIREMENTS\n\n DESCRIPTION & REQUIREMENTS \n\nTHIS INDIVIDUAL WILL SUPPORT BUSINESS DEVELOPMENT PROFESSIONALS PERFORMING OPERATIONS POLICY RESEARCH AND ANALYSIS. SUPPORT TASKS WILL INCLUDE MARKET ANALYSIS, IDENTIFICATION OF TECHNOLOGY TRENDS, DEVELOPMENT OF COMPETITIVE ASSESSMENTS, AND DETAILED RESEARCH INTO CUSTOMER MISSION AND STRATEGY. THE INDIVIDUAL WILL SUPPORT PROPOSAL OPERATIONS FOR ASSIGNED OPPORTUNITIES.\n\nCHARACTERISTIC S NECESSARY FOR SUCCESS INCLUDE: BUSINESS AND TECHNICAL VISION; DISCIPLINED STRATEGIC THINKING; STRONG COMMUNICATIONS SKILLS; ANALYTICAL PRESENTATION AND PROBLEM-SOLVIN G SKILLS; THE ABILITY TO GAIN INTERN AL SUPPORT; AND THE ABILITY TO ESTABLISH AND MAINTAIN A SOLID WORKING RELATIONSHIP WITH TECHNICAL STAFF, MANAGERS, AND PEERS.\n\nESSENTIAL DUTIES AND RESPONSIBILITIES:\n\n CONDUCT BUSINESS ANALYSIS TO SUPPORT THE BUSINESS DEVELOPMENT DEPARTMENT.  SUPPORT PROCESS IMPROVEMENTS AND PROJECT DELIVERABLES.  RESEARCH POTENTIAL MARKET TRENDS.  ASSIST IN SPECIAL PROJECTS IN THE BUSINESS DEVELOPMENT DEPARTMENT.  ASSIST WITH AD-HOC REPORTING AND OTHER TASKS. \n\nMINIMUM REQUIREMENTS\n\nMINIMUM REQUIREMENTS:\n\n CURRENTLY ENROLLED IN AN ACCREDITED COLLEGE OR UNIVERSITY AND PURSUING A COLLEGE DEGREE IN A RELATED FIELD.  MUST HAVE COMPLETED A MINIMUM 2 YEARS OF COURSEWORK.  ABILITY TO PERFORM COMFORTABLY IN A FAST-PACED, DEADLINE-ORIENTED WORK ENVIRONMENT.  SKILLED IN STANDARD COMPUTER APPLICATIONS AND PLATFORMS SUCH AS OUTLOOK AND MS OFFICE SUITE, POWERPOINT, AND EXCEL.  EXCELLENT INTERPERSONAL COMMUNICATION, TEAMWORK, AND CUSTOMER SERVICE SKILLS.  DEMONSTRATED ABILITY TO JUGGLE MULTIPLE PRIORITIES WITH SUPERIOR ATTENTION TO DETAIL. \n\nEEO STATEMENT\n\nACTIVE MILITARY SERVICE MEMBERS, THEIR SPOUSES, AND VETERAN CANDIDATES OFTEN EMBODY THE CORE COMPETENCIES MAXIMUS DEEMS ESSENTIAL, AND BRING A RESILIENCY AND DEPENDABILITY THAT GREATLY ENHANCES OUR WORKFORCE. WE RECOGNIZE YOUR UNIQUE SKILLS AND EXPERIENCES, AND WANT TO PROVIDE YOU WITH A CAREER PATH THAT ALLOWS YOU TO CONTINUE MAKING A DIFFERENCE FOR OUR COUNTRY. WE’RE PROUD OF OUR CONNECTIONS TO ORGANIZATIONS DEDICATED TO SERVING VETERANS AND THEIR FAMILIES. IF YOU ARE TRANSITIONING FROM MILITARY TO CIVILIAN LIFE, HAVE PRIOR SERVICE, ARE A RETIRED VETERAN OR A MEMBER OF THE NATIONAL GUARD OR RESERVES, OR A SPOUSE OF AN ACTIVE MILITARY SERVICE MEMBER, WE HAVE CHALLENGING AND REWARDING CAREER OPPORTUNITIES AVAILABLE FOR YOU. A COMMITTED AND DIVERSE WORKFORCE IS OUR MOST IMPORTANT RESOURCE. MAXIMUS IS AN AFFIRMATIVE ACTION/EQUAL OPPORTUNITY EMPLOYER. MAXIMUS PROVIDES EQUAL EMPLOYMENT OPPORTUNITIES TO ALL QUALIFIED APPLICANTS WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, PROTECTED VETERAN STATUS OR DISABLED STATUS.\n\nPAY TRANSPARENCY\n\nMAXIMUS COMPENSATION IS BASED ON VARIOUS FACTORS INCLUDING BUT NOT LIMITED TO JOB LOCATION, A CANDIDATE'S EDUCATION, TRAINING, EXPERIENCE, EXPECTED QUALITY AND QUANTITY OF WORK, REQUIRED TRAVEL (IF ANY), EXTERNAL MARKET AND INTERNAL VALUE ANALYSIS INCLUDING SENIORITY AND MERIT SYSTEMS, AS WELL AS INTERNAL PAY ALIGNMENT. ANNUAL SALARY IS JUST ONE COMPONENT OF MAXIMUS'S TOTAL COMPENSATION PACKAGE. OTHER REWARDS MAY INCLUDE SHORT- AND LONG-TERM INCENTIVES AS WELL AS PROGRAM-SPECIFIC AWARDS. ADDITIONALLY, MAXIMUS PROVIDES A VARIETY OF BENEFITS TO EMPLOYEES, INCLUDING HEALTH INSURANCE COVERAGE, LIFE AND DISABILITY INSURANCE, A RETIREMENT SAVINGS PLAN, PAID HOLIDAYS AND PAID TIME OFF. COMPENSATION RANGES MAY DIFFER BASED ON CONTRACT VALUE BUT WILL BE COMMENSURATE WITH JOB DUTIES AND RELEVANT WORK EXPERIENCE. AN APPLICANT'S SALARY HISTORY WILL NOT BE USED IN DETERMINING COMPENSATION. MAXIMUS WILL COMPLY WITH REGULATORY MINIMUM WAGE RATES AND EXEMPT SALARY THRESHOLDS IN ALL INSTANCES.",
    "job_skill_set": [
      "MS Office Suite",
      "PowerPoint",
      "Excel",
      "reporting",
      "communication",
      "teamwork",
      "problem solving",
      "analytical thinking",
      "strategic thinking",
      "attention to detail",
      "interpersonal skills",
      "time management",
      "market analysis",
      "competitive assessments",
      "policy research",
      "technology trends identification"
    ],
    "short_keywords": [
      "analysis",
      "analytical",
      "assessments",
      "attention",
      "business",
      "businessdevelopment",
      "communication",
      "competitive",
      "detail",
      "development",
      "excel",
      "identification",
      "intern",
      "interpersonal",
      "management",
      "market",
      "ms",
      "office",
      "policy",
      "powerpoint",
      "problem",
      "reporting",
      "research",
      "skills",
      "solving",
      "strategic",
      "suite",
      "teamwork",
      "technology",
      "thinking",
      "time",
      "to",
      "trends"
    ]
  },
  {
    "job_id": "3885829894",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "IT'S FUN TO WORK IN A COMPANY WHERE PEOPLE TRULY BELIEVE IN WHAT THEY'RE DOING!\n\nWE'RE COMMITTED TO BRINGING PASSION AND CUSTOMER FOCUS TO THE BUSINESS.\n\nCORPORATE OVERVIEW\n\nIN TODAY’S CYBER THREAT LANDSCAPE, PROTECTION STARTS WITH PEOPLE. AT PROOFPOINT, THAT SIMPLE TRUTH FUELS OUR PASSION FOR PROTECTING USERS, THE DATA THEY CREATE, AND THE SYSTEMS THEY RELY ON FROM A UNIQUELY PEOPLE-CENTRIC PERSPECTIVE. AND WE’RE JUST AS PASSIONATE ABOUT FINDING THE RIGHT PEOPLE TO HELP US IN THAT MISSION. WHEN YOU JOIN PROOFPOINT, YOU’RE HELPING TO\n\nBUILD AND ENHANCE OUR PROVEN SECURITY PLATFORMBLEND INNOVATION AND SPEED IN A CONSTANTLY EVOLVING CLOUD ENVIRONMENTANALYZE NEW THREATS AND OFFER DEEP INSIGHT THROUGH DATA-DRIVEN INTELCOLLABORATE WITH CUSTOMERS TO HELP SOLVE THEIR TOUGHEST SECURITY CHALLENGES\n\nWE ARE SINGULARLY DEVOTED TO HELPING OUR CUSTOMERS PROTECT THEIR GREATEST ASSETS AND BIGGEST SECURITY RISK THEIR PEOPLE. THAT’S WHY WE’RE A LEADER IN NEXT-GENERATION CYBERSECURITY—AND WHY MORE THAN HALF OF THE FORTUNE 100 TRUST US AS A SECURITY PARTNER.\n\nABOUT THE BUSINESS DEVELOPMENT TEAM\n\nTHE PROOFPOINT BUSINESS DEVELOPMENT TEAM IS A GROUP OF AMBITIOUS INNOVATORS THAT ENJOY THE THRILL OF FINDING CREATIVE SOLUTIONS IN FAST-PACED ENVIRONMENTS. EAGER TO GROW THEIR SALES SKILLSETS, OUR BUSINESS DEVELOPMENT REPRESENTATIVES (BDRS) ARE COLLABORATIVE TEAM PLAYERS WHO ARE ALWAYS WILLING TO SHARE THEIR WINNING SALES TACTICS WITH THEIR PEERS.\n\nBDRS AT PROOFPOINT HAVE A DIRECT IMPACT ON THE SUCCESS OF OUR SALES ORGANIZATION. HAVING OWNERSHIP OF A CRITICAL PIECE OF THE SALES PROCESS, THEY TAKE PRIDE IN CONNECTING POTENTIAL CUSTOMERS WITH OUR AWARD-WINNING LINEUP OF CYBERSECURITY SOLUTIONS.\n\nOUR BUSINESS DEVELOPMENT REPS ARE TRUSTED PARTNERS, WORKING SIDE-BY-SIDE WITH OUR FIELD, TERRITORY AND ENTERPRISE ACCOUNT MANAGERS TO CAPTURE MARKET SHARE ACROSS THE USA. THEY ARE HIGHLY VALUED MEMBERS OF OUR ORGANIZATION AND FOR THIS REASON, PROOFPOINT HEAVILY INVESTS IN THEIR PROFESSIONAL GROWTH AND EMPOWERS THEM WITH THE RESOURCES AND SUPPORT TO ADVANCE THEIR CAREERS, WHETHER THAT BE AS AN ACCOUNT REPRESENTATIVE, CUSTOMER SUCCESS MANAGER, PROGRAM MANAGER, OR ANY OTHER OPPORTUNITY OF INTEREST.\n\nIF YOU ARE READY TO JOIN A TEAM THAT ALLOWS YOU THE AUTONOMY TO GROW YOUR PROFESSIONAL SALES SKILLSET, CONSIDER PROOFPOINT.\n\nABOUT THE ROLE BUSINESS DEVELOPMENT REPRESENTATIVE\n\nWE’RE LOOKING FOR A COLLABORATIVE TEAM PLAYER TO JOIN OUR RAPIDLY GROWING BUSINESS DEVELOPMENT TEAM IN DRAPER, UT. THIS POSITION IS HYBRID (THREE DAYS IN THE OFFICE). THE IDEAL CANDIDATE WILL DEMONSTRATE THEIR ADAPTABILITY AND CREATIVE COMMUNICATION SKILLS AS THEY IDENTIFY, ENGAGE WITH AND QUALIFY POTENTIAL CUSTOMERS IN THEIR ASSIGNED TERRITORY.\n\nOUR MOST SUCCESSFUL BDRS CREATE INTEGRITY FOR THEMSELVES IN THE EYES OF THEIR BUSINESS PARTNERS BY COMING PREPARED TO MEETINGS, ASKING THOUGHTFUL QUESTIONS AND FOCUSING ON QUALITY OVER QUANTITY. THIS IS A HIGHLY VISIBLE ROLE WHERE YOU WILL, WHEN READY, HAVE THE OPPORTUNITY TO SHOWCASE YOUR WORK TO EXECUTIVES AND PARTICIPATE IN DEMO CALLS WITH CUSTOMERS.\n\nBUSINESS DEVELOPMENT REPRESENTATIVES ARE EQUIPPED WITH CRM TOOLS LIKE SALESFORCE.COM AND OUTREACH, AS WELL AS SOCIAL MEDIA CAMPAIGNS, TO ENSURE THEY HAVE THE RESOURCES THEY NEED TO BE SUCCESSFUL. THE BUSINESS DEVELOPMENT REPRESENTATIVE ROLE IS UNIQUE AT PROOFPOINT COMPARED TO OTHER COMPANIES, BECAUSE HERE, YOU WILL HAVE THE OPPORTUNITY TO DO MUCH MORE THAN SCHEDULE CLIENT MEETINGS AND COLD CALL FROM A SCRIPT. YOU WILL HAVE THE CHANCE TO USE YOUR JUDGEMENT, SHARE YOUR IDEAS AND FORM LASTING RELATIONSHIPS AND EXPERIENCES THAT WILL HELP SHAPE THE NEXT STEPS IN YOUR PROFESSIONAL JOURNEY.\n\nTHIS IS AN EXCITING OPPORTUNITY FOR SOMEONE WHO IS INTERESTED IN JOINING A HIGH GROWTH, FAST PACED TECH COMPANY IN THE IN-DEMAND INDUSTRY OF ENTERPRISE CYBERSECURITY. AT PROOFPOINT YOU WILL BE DRIVEN BY THE DESIRE TO LEARN, GROW, AND SUCCEED IN YOUR PROFESSIONAL SALES OR MARKETING JOURNEY.\n\nWHY PROOFPOINT \n\nAT PROOFPOINT WE PRIDE OURSELVES ON OUR PEOPLE-CENTRIC APPROACH TO SUCCESS AND INNOVATION, WHICH EXTENDS TO HOW WE DESIGN ROLES WITHIN OUR ORGANIZATION AND HIRE TALENT AROUND THE WORLD. THE CYBERSECURITY LANDSCAPE IS EVER-EVOLVING, AND WE RECOGNIZE THAT THE SKILLS NEEDED TOMORROW MAY BE DIFFERENT THAN THE SKILLS NEEDED TODAY. THEREFORE, WE SEEK INDIVIDUALS FROM A VARIETY OF BACKGROUNDS WITH A RANGE OF WORK HISTORIES WHO CAN LEVERAGE THEIR RELEVANT EXPERIENCE AS WELL AS TRANSFERRABLE SKILLS TO HELP OUR COMPANY GROW. CRITICAL THINKERS, PROBLEM SOLVERS, COLLABORATORS, COMMUNICATORS, AND FUTURE-ORIENTED CREATIVES NEED APPLY. IT’S NOT ABOUT WHERE YOU STARTED, OR WHERE YOU’RE COMING FROM, IT’S ABOUT WHERE YOU CAN GO WITH PROOFPOINT\n\nIF YOU LIKE WILD GROWTH AND WORKING WITH HAPPY, ENTHUSIASTIC OVER-ACHIEVERS, YOU'LL ENJOY YOUR CAREER WITH US!\n\n",
    "job_skill_set": [
      "Collaboration",
      "Communication",
      "Problem Solving",
      "Creativity",
      "Critical Thinking",
      "Customer Focus",
      "CRM Tools",
      "Salesforce.com",
      "Social Media Campaigns",
      "Data Analysis",
      "Cybersecurity Solutions",
      "Adaptability"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "business",
      "businessdevelopment",
      "campaigns",
      "collaboration",
      "communication",
      "creativity",
      "critical",
      "crm",
      "customer",
      "cybersecurity",
      "data",
      "development",
      "focus",
      "media",
      "problem",
      "representative",
      "salesforcecom",
      "social",
      "solutions",
      "solving",
      "thinking",
      "tools"
    ]
  },
  {
    "job_id": "3901649881",
    "job_title": "Enterprise Business Development Representative - US",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "JOIN OUR DYNAMIC AI TEAM AS AN ENTERPRISE BUSINESS DEVELOPMENT REPRESENTATIVE AT SQUIRRO AMERICA, WHERE YOU'LL PLAY A PIVOTAL ROLE IN DRIVING OUR ENTERPRISE-READY GENERATIVE AI SOLUTION TO NEW HEIGHTS. WE ARE ON THE LOOKOUT FOR A MOTIVATED AND RESULTS-DRIVEN INDIVIDUAL WHO THRIVES ON CHALLENGES AND IS EAGER TO CONTRIBUTE TO THE GROWTH OF OUR CUTTING-EDGE TECHNOLOGY.\n\nABOUT US:SQUIRRO IS AT THE FOREFRONT OF ENTERPRISE-READY GENERATIVE AI SOLUTIONS, REVOLUTIONIZING SEARCH, INSIGHTS, AND AUTOMATION. OUR POWERFUL COMBINATION OF SEMANTIC SEARCH, MACHINE LEARNING, AND GENERATIVE AI EMPOWERS ORGANIZATIONS TO UNCOVER HIDDEN PATTERNS, TRENDS, AND CORRELATIONS IN THEIR DATA, FACILITATING INFORMED DECISION-MAKING AND FUELING BUSINESS GROWTH.\n\nWHY SQUIRRO?\n\nINNOVATIVE TECHNOLOGY: SQUIRRO'S SOLUTION INTEGRATES SEMANTIC SEARCH, MACHINE LEARNING, AND GENERATIVE AI, PROVIDING ORGANIZATIONS WITH UNPARALLELED CAPABILITIES TO VISUALIZE AND ANALYZE COMPLEX DATA EFFORTLESSLY.\n\nRESPONSIBILITIES\n\nINBOUND LEAD GENERATION AND QUALIFICATION: COLLABORATE WITH THE MARKETING TEAM TO MANAGE DAILY INBOUND AND OUTBOUND LEADS, EMPLOYING VARIOUS CHANNELS SUCH AS PHONE, EMAIL, AND LINKEDIN TO QUALIFY PROSPECTS.OUTBOUND LEAD GENERATION: WORK WITH AN ACCOUNT BASED STRATEGY TO BUILD US FOCUSED DEMAND FOR THE SOLUTION CREATING A GROWING LEAD PIPELINE FOR SALES. IDENTIFY AND PURSUE NEW BUSINESS OPPORTUNITIES TO CONTRIBUTE SIGNIFICANTLY TO THE COMPANY’S GROWTH.PROSPECT EDUCATION: EDUCATE AND NURTURE EARLY-PHASE PROSPECTS FOR POTENTIAL FUTURE OPPORTUNITIESCOLLABORATIVE CAMPAIGNS: COLLABORATE WITH SALES EXECUTIVES AND MANAGEMENT TO EXECUTE OUTBOUND CAMPAIGNS TARGETING SPECIFIC VERTICALS OR GEOGRAPHICAL MARKETS, CONTRIBUTING TO THE GROWTH OF THE SALES PIPELINE.VALUE PROPOSITION: UNDERSTAND SQUIRRO'S VALUE PROPOSITION TO ENGAGE EFFECTIVELY WITH DATA AND BUSINESS LEADERS ACROSS VARIOUS INDUSTRIES.ACTIVITY AND DATA ANALYSIS: ANALYZE AND REPORT ON WEEKLY ACTIVITIES, IDENTIFYING POTENTIAL OPTIMIZATIONS TO ENHANCE PERFORMANCE.DATA MANAGEMENT: MAINTAIN ACCURATE DATA LOGS OF ENGAGEMENTS AND ACTIVITIES USING HUBSPOT AND SALESFORCE.\n\nYOUR PROFILE\n\nAFFINITY TO SELLING SOFTWARE:\n\nHAVE A STRONG UNDERSTANDING OF THE TECHNICAL UNDERPINNINGS OF THE SOLUTIONS BUT ALSO THE ABILITY TO BE SALES MINDED\n\nCLIENT-CENTRIC APPROACH\n\nAN UNDERSTANDING OF HOW TO MAINTAIN RELATIONSHIPS WITH CLIENTS, UNDERSTANDING THEIR NEEDS AND PROPOSING TAILORED SOLUTIONS.\n\nANALYTICAL SKILLS\n\nSTRONG ANALYTICAL AND ORGANIZATIONAL SKILLS, WITH THE ABILITY TO HANDLE PRESSURE AND A HIGH VOLUME OF TASKS IN A RESULT-ORIENTED ENVIRONMENT.\n\nMARKET KNOWLEDGE\n\nPOSSESS AN IN-DEPTH UNDERSTANDING OF THE SAAS MARKET.\n\nPROFICIENCY WITH DIGITAL TOOLS\n\nPROFICIENT IN THE SALES/LEAD ADMINISTRATION PROCESS USING HUBSPOT AND SALESFORCE.\n\nADDITIONAL SKILLSET\n\nEDUCATION: BA/BS DEGREE OR EQUIVALENT EXPERIENCE REQUIRED.\n\nCOMMUNICATION EXCELLENCE: OUTSTANDING VERBAL AND WRITTEN COMMUNICATION SKILLS TO ENGAGE WITH KEY INTERNAL AND EXTERNAL PARTNERS AND PRESENT SALES MATERIALS EFFECTIVELY.\n\nTEAM COLLABORATION: ABILITY TO WORK IN A TEAM ENVIRONMENT WHILE BEING A DRIVEN SELF-STARTER.\n\nORGANIZATIONAL SKILLS: STRONG ORGANIZATIONAL SKILLS WITH THE ABILITY TO MULTITASK AND WORK UNDER TIGHT TIME CONSTRAINTS.\n\nCLEAN U-4: MAINTAIN A CLEAN U-4.\n\nIF YOU ARE READY TO EMBARK ON AN EXCITING JOURNEY WITH SQUIRRO AND CONTRIBUTE TO THE SUCCESS OF OUR INNOVATIVE AI SOLUTION, APPLY NOW TO JOIN OUR DYNAMIC TEAM OF FORWARD-THINKERS. ELEVATE YOUR CAREER WITH SQUIRRO!\n\nREPORTING\n\nTO THE CMO",
    "job_skill_set": [
      "Salesforce",
      "data analysis",
      "lead generation",
      "communication",
      "team collaboration",
      "client-centric approach",
      "analytical skills",
      "organizational skills",
      "self-starter",
      "multitasking",
      "generative AI",
      "semantic search",
      "machine learning",
      "HubSpot",
      "SaaS market knowledge"
    ],
    "short_keywords": [
      "ai",
      "analysis",
      "analytical",
      "approach",
      "business",
      "businessdevelopment",
      "clientcentric",
      "collaboration",
      "communication",
      "data",
      "development",
      "enterprise",
      "generation",
      "generative",
      "hubspot",
      "knowledge",
      "lead",
      "learning",
      "machine",
      "market",
      "multitasking",
      "organizational",
      "representative",
      "saas",
      "salesforce",
      "search",
      "selfstarter",
      "semantic",
      "skills",
      "team",
      "us"
    ]
  },
  {
    "job_id": "3904049863",
    "job_title": "Senior Director Business Development",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ROOM 8 GROUP IS THE WORLD’S FASTEST GROWING STRATEGIC PARTNER IN EXTERNAL GAME DEVELOPMENT, CO-DEVELOPMENT, ART, TRAILER PRODUCTION, AND QA FOR AAA CONSOLE, PC AND MOBILE TITLES. SINCE 2011, THE GROUP HAS CO-CREATED A MULTITUDE OF AWARD-WINNING PROJECTS FOR WORLD-LEADING VIDEO GAME IPS AND FRANCHISES, WORKING WITH PUBLISHERS SUCH AS MICROSOFT, SONY AND NINTENDO, WHILE LEVERAGING ITS OWN CUTTING-EDGE TOOLS AND R&D CAPABILITIES.THROUGH PRIMARILY ORGANIC GROWTH, THE PROUDLY INDEPENDENT COMPANY IS NOW HOME TO 1,400+ CREATIVES BASED IN EUROPE, NORTH AMERICA, AND SOUTH AMERICA.\nTHE SENIOR BUSINESS DEVELOPMENT DIRECTOR WILL BE JOINING A GLOBAL TEAM OF HIGHLY DEDICATED PROFESSIONALS PROVIDING WORLD CLASS SERVICE TO THE VIDEO GAMES INDUSTRY INTERNATIONALLY. THE IDEAL CANDIDATE WOULD BE AN ACCOMPLISHED SALES EXECUTIVE WITH DEMONSTRABLE SUCCESS IN GROWING NEW BUSINESS IN THE GAME DEVELOPMENT BUSINESS. THE POSITION INVOLVES CLOSE COLLABORATION WITH INTERNAL TEAMS AND EXTERNAL PROVIDERS TO ENSURE EXCELLENCE IN EXECUTION ACROSS TOUCHPOINTS FOR MAINTAINING AND GROWING BUSINESS WITH OUR CLIENTS.\nSUPERPOWERS YOU HAVE:MINIMUM 5 YEARS OF EXPERIENCE IN CORPORATE STRATEGY, CORPORATE DEVELOPMENT, SALES, AND BUSINESS DEVELOPMENT, AT LEAST 4 YEARS OF THIS WITH THE GAME DEVELOPMENT STUDIOS, INCLUDING EXPERIENCE WORKING IN THE STUDIOS THAT PROVIDE TRAILER PRODUCTION/CINEMATIC SERVICES;EXCEPTIONAL ORAL AND WRITTEN COMMUNICATION SKILLS, WITH SEASONED PRESENTATION SKILLS;KNOWLEDGE OF TECHNICAL PLATFORMS, BUSINESS MODELS AND TRENDS - WITH AN INDUSTRY FOCUS IN GAMING, STREAMING, OR GAME ENGINES;EXPERIENCE IN MANAGING AND MONITORING PERFORMANCE METRICS ACROSS ACCOUNTS AND ACCOUNT PORTFOLIOS;AWARENESS ABOUT ONLINE SERVICES AND MAJOR GAMES ENGINES (I.E., UNREAL ENGINE OR UNITY);EXCELLENT ORGANIZATION, PLANNING, AND PRIORITIZATION SKILLS WITH STRONG ATTENTION TO DETAIL;ABILITY TO MAINTAIN RELATIONSHIPS WITH MULTIPLE CLIENTS AND PRODUCTION TEAMS SIMULTANEOUSLY TO KEEP BOTH SIDES OF THE BUSINESS SATISFIED;GENUINE PASSION FOR THE GAMING INDUSTRY.\nBECOMING A PART OF THE ROOM 8 GROUP TEAM, YOU WILL:IDENTIFY NEW PROSPECTIVE CLIENTS, DEVELOP AND EXECUTE SALES DEVELOPMENT STRATEGIES;DRIVE ACCOUNT REVENUE WITHIN THE CLIENT/ACCOUNT PORTFOLIO;BE RESPONSIBLE FOR SALES AND UP-SALES ACTIVITIES BY ASSESSING OPPORTUNITIES, CREATING PROPOSALS AND PRESENTATIONS, ESTABLISHING RELATIONSHIPS WITH CLIENTS AND PROSPECTIVE CLIENTS, AND CLOSING/SIGNING NEW DEALS;GATHER INTELLIGENCE ON INDUSTRY, COMPETITORS AND MARKET TRENDS FROM PUBLIC AND NETWORK RESOURCES. TRACK AND SYNTHESIZE TRENDS AND TAKEAWAYS FROM GLOBAL GAMING MARKETS AND TURN THOSE INSIGHTS INTO ACTIONABLE APPROACHES;PARTICIPATE IN THE DEVELOPMENT OF BUSINESS STRATEGIES TO SUCCESSFULLY ACHIEVE CLIENT BUSINESS GOALS;STAY CLOSE TO THE ASSIGNED GAMING ECOSYSTEM SOURCE OPPORTUNITIES AND HAVE CLOSE DIALOGUE WITH DEVELOPERS AND FOUNDERS;BUILD AND DEVELOP LONG TERM AND QUALITY RELATIONSHIPS WITH GAME DEVELOPERS AND PUBLISHERS FROM PC, CONSOLE AND MOBILE GAMING SPACE AS WELL AS OTHER KEY ECOSYSTEM PLAYERS TO BUILD AND SOURCE STRATEGIC PARTNERSHIP OPPORTUNITIES;MANAGE PARTNER RELATIONSHIPS AND SET THE INDUSTRY STANDARD FOR TIMELY SUPPORT, REGULAR COMMUNICATIONS, AND PROMPT ASSISTANCE WITH ARISING ISSUES;PARTNER CLOSELY WITH INTERNAL AND EXTERNAL TEAMS TO ENSURE EXCELLENCE IN EXECUTION ACROSS TOUCHPOINTS;COMMUNICATE WITH CLIENTS CLEARLY AND ADDRESS PROMPTLY THEIR CONCERNS TO RESOLVE CONFLICTS;MONITOR COMPETITION TO IDENTIFY AND TEST NEW TRENDS AND BEST BUSINESS PRACTICES TO GAIN A COMPETITIVE ADVANTAGE.\nJOIN THE TEAM OF INSPIRING GAME DEV PROFESSIONALS, AND GET EVEN MORE:COMPETITIVE FINANCIAL REWARD (YES, WE ARE FAIR ENOUGH);CHALLENGES TO RAISE YOUR XPS SCORE (PROFESSIONAL TRAINING AND CONFERENCES, INTERNAL MENTORSHIP);HEALTH INSURANCE BENEFITS, PAID VACATION, AND SICK LEAVE;A CULTURE OF DIVERSITY AND INCLUSION TO UNITE THE MOST OUTSTANDING TALENTS;COMMUNITY OF PEOPLE WHO UNDERSTAND AND SHARE YOUR PASSION FOR GAMES.",
    "job_skill_set": [
      "business development",
      "sales",
      "corporate strategy",
      "performance metrics",
      "technical platforms",
      "proposal creation",
      "market analysis",
      "relationship management",
      "strategic partnerships",
      "communication",
      "presentation skills",
      "organization",
      "planning",
      "prioritization",
      "attention to detail",
      "conflict resolution",
      "team collaboration",
      "corporate development",
      "trailer production",
      "gaming industry knowledge",
      "game engines",
      "passion for gaming"
    ],
    "short_keywords": [
      "analysis",
      "attention",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "conflict",
      "corporate",
      "creation",
      "detail",
      "development",
      "director",
      "engines",
      "for",
      "game",
      "gaming",
      "industry",
      "knowledge",
      "management",
      "market",
      "metrics",
      "organization",
      "partnerships",
      "passion",
      "performance",
      "planning",
      "platforms",
      "presentation",
      "prioritization",
      "production",
      "proposal",
      "relationship",
      "resolution",
      "sales",
      "senior",
      "skills",
      "strategic",
      "strategy",
      "team",
      "technical",
      "to",
      "trailer"
    ]
  },
  {
    "job_id": "3904084138",
    "job_title": "Global Business Development Partner - 100% Remote",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "EXCITING OPPORTUNITY: GLOBAL BUSINESS DEVELOPMENT PARTNER - PERSONAL DEVELOPMENT / LEADERSHIP DEVELOPMENT INDUSTRY\nARE YOU A SELF-MOTIVATED INDIVIDUAL WITH AMBITIOUS FINANCIAL GOALS AND A BIG-PICTURE MINDSET? ARE YOU READY TO REDEFINE YOUR SUCCESS IN A SELF-EMPLOYED CAPACITY? IF SO, WE HAVE AN INCREDIBLE OPPORTUNITY FOR YOU TO LEVERAGE YOUR SKILLS AND PASSION AS A GLOBAL BUSINESS DEVELOPMENT PARTNER. IN THIS ROLE, YOU WILL BE INSTRUMENTAL IN DRIVING LONG-TERM SUCCESS BY PROMOTING OUR AWARD-WINNING PRODUCTS ON A GLOBAL SCALE. YOUR TIME AND TALENT WILL BE DIRECTLY REWARDED, MAKING THIS A TRULY UNIQUE OPPORTUNITY.\n IDEAL CANDIDATE: YOU ARE A DETERMINED PROFESSIONAL, EAGER TO REACH NEW HEIGHTS IN YOUR CAREER. YOU ARE EXCITED ABOUT ADVANCED TRAINING AND DEVELOPMENT OPPORTUNITIES THAT WILL PROPEL YOU TO SUCCESS. YOU HAVE A PROVEN TRACK RECORD OF SUCCESS AND ARE READY TO EMBRACE THE REWARDS OF BUSINESS OWNERSHIP. \nABOUT US: WE ARE A GLOBALLY RECOGNIZED LEADER IN THE PERSONAL DEVELOPMENT/LEADERSHIP DEVELOPMENT SECTOR. WE CREATE HIGHLY SOUGHT-AFTER LIFE IMPROVEMENT PROGRAMS THAT OUR CLIENTS ADORE. WE ARE SEEKING TALENTED PROFESSIONALS TO HELP US ACHIEVE OUR GLOBAL GROWTH OBJECTIVES. \nWHY JOIN US? • WORLD-CLASS BUSINESS COACHING & MENTORING• FLEXIBLE PART-TIME HOURS DETERMINED BY YOU• UNLIMITED WEALTH-GENERATING POTENTIAL• LONG-TERM SOLUTION FOR A SELF-EMPLOYMENT OPPORTUNITY (NOT JUST A JOB)• COMPREHENSIVE RANGE OF CUSTOM BUSINESS TOOLS WITH PERSONALIZED SUPPORT• EXTENSIVE TRAINING AND SUPPORT FOR OUR PARTNERS• WE HANDLE THE CLOSURE OF THE SALE FOR YOU \nWHAT YOU WILL BE DOING:STRATEGIC MARKETING, ADVERTISING, BRANDING, AND BUSINESS DEVELOPMENTINTERVIEWING, SELECTING AND BUILDING YOUR OWN TEAM.MENTORING, TRAINING AND GUIDING OTHERS.ENGAGING WITH ONGOING TRAINING.ATTENDING ONGOING ONLINE GLOBAL BUSINESS EVENTS.\nWHAT YOU NEED: • NO PRIOR EXPERIENCE IN THIS INDUSTRY IS NECESSARY, BUT READINESS TO WORK INDEPENDENTLY AND FOR YOURSELF IS CRUCIAL.• A MINIMUM COMMITMENT OF JUST 2 HOURS PER DAY, ALLOWING YOU TO START PART-TIME WITH THE POTENTIAL TO TRANSITION TO FULL-TIME.• ACCESS TO A COMPUTER & AND INTERNET CONNECTION IS ESSENTIAL. • A COMMITMENT TO PERSONAL GROWTH AND A PASSION FOR HELPING OTHERS ACHIEVE THEIR GOALS.\nIF THIS RESONATES WITH YOU, DON'T WAIT. APPLY NOW!\nAPPLICATION PROCESS:• SUBMIT YOUR APPLICATION, SUCCESSFUL CANDIDATES WILL RECEIVE A LINKEDIN MESSAGE AND EMAIL, REQUESTING YOU BOOK A TIME IN CALENDLY.\nPLEASE NOTE:• OUR BUSINESS DOES NOT OPERATE IN SPECIFIC REGIONS, INCLUDING THE PHILIPPINES, INDIA, PAKISTAN, AFRICA (EXCEPT SA), EGYPT, THE UAE, INDONESIA, CHINA, HONG KONG, AND RUSSIA. AND DOES NOT SUIT STUDENTS.",
    "job_skill_set": [
      "strategic marketing",
      "business development",
      "team building",
      "self-motivation",
      "ambition",
      "leadership",
      "mentoring",
      "training",
      "personal growth commitment",
      "independence",
      "advertising",
      "branding",
      "online event engagement",
      "computer proficiency",
      "internet connectivity",
      "passion for helping others"
    ],
    "short_keywords": [
      "100",
      "advertising",
      "ambition",
      "branding",
      "building",
      "business",
      "businessdevelopment",
      "commitment",
      "computer",
      "connectivity",
      "development",
      "engagement",
      "event",
      "for",
      "global",
      "growth",
      "helping",
      "independence",
      "internet",
      "leadership",
      "marketing",
      "mentoring",
      "online",
      "others",
      "partner",
      "passion",
      "personal",
      "proficiency",
      "remote",
      "selfmotivation",
      "strategic",
      "team",
      "training"
    ]
  }
]