[
  {
    "job_id": "3889130753",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "JOIN US FOR THIS INCREDIBLE OPPORTUNITY TO BE PART OF OUR MANAGEMENT TEAM AS A FULL-TIME BUSINESS DEVELOPMENT MANAGER AT THE KA'ANAPALI ALI'I LOCATED IN LAHAINA, HAWAII. CORALTREE RESIDENCE COLLECTION IS RECOGNIZED AS THE OUTSTANDING CHOICE IN MANAGING PREMIUM AND LUXURY RESIDENTIAL RESORTS, VACATION HOMES AND HOTELS; DEFINED BY PEOPLE WITH GENUINE PURPOSE, PRIDE, AND SENSE OF PLACE.\n\nWE OFFER EXCELLENT BENEFITS:\n\n FREE ROOM NIGHTS AT CORALTREE HOSPITALITY PROPERTIES!  FRIENDS AND FAMILY RECEIVE DISCOUNTED RATES AT CORALTREE HOSPITALITY GROUP PROPERTIES  EARN UP TO 24 DAYS OF PTO (PAID TIME OFF) IN YOUR FIRST YEAR.  401(K) RETIREMENT SAVINGS PLAN WITH A COMPANY MATCH  GROUP MEDICAL, DENTAL, VISION, LIFE, AND DISABILITY BENEFITS  EMPLOYEE ASSISTANCE PROGRAM  ACCESS TO EMPLOYEE DISCOUNTS FROM INDUSTRY-LEADING BRANDS IN TRAVEL, ENTERTAINMENT, AND RETAIL INCLUDING WALT DISNEY WORLD, LIVE NATION, SAMSUNG, HERTZ AND MANY MORE! \n\nSALARY: $70,000.00 - $80,000.00 PER YEAR PLUS INCENTIVE PAY\n\nTHE KA’ANAPALI ALI’I IS AN EQUAL OPPORTUNITY EMPLOYER. QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY OR PROTECTED VETERAN STATUS.\n\nRESPONSIBILITIES\n\nTHE BUSINESS DEVELOPMENT MANAGER WILL DEVELOP, LEAD, AND EXECUTE OUR HOMEOWNER ACQUISITION STRATEGY. THE BUSINESS DEVELOPMENT MANAGER COLLABORATES WITH OTHER COMPANY LEADERS, TO IDENTIFY, SOLICIT AND RECRUIT NON-PARTICIPATING OWNERS AT OUR PROPERTIES TO JOIN OUR RENTAL PROGRAMS. HE/SHE IS RESPONSIBLE FOR SECURING NEW RENTAL CONTRACTS BY CREATING AND CULTIVATING RELATIONSHIPS WITH REALTORS AND OTHER REFERRAL SOURCES, SOLICITING POTENTIAL HOMEOWNERS DIRECTLY AND BY WORKING WITH THE PROPERTY MANAGERS TO CREATE A PROACTIVE PROCESS TO GROW OUR RENTAL PROGRAMS. THIS DEMANDING ROLE REQUIRES A LEADER TO POSSESS EXCEPTIONAL COMMUNICATION SKILLS AND EXPERIENCE IN SALES OR HOSPITALITY WITHIN UPSCALE/LUXURY RESORTS. PRIOR EXPERIENCE IN HAWAII IS PREFERRED.\n\nQUALIFICATIONS\n\n COLLEGE DEGREE FROM ACCREDITED UNIVERSITY IN BUSINESS ADMINISTRATION, MARKETING, HOTEL AND RESTAURANT MANAGEMENT OR RELATED MAJOR PREFERRED.  6 - 8 YEARS OF EXPERIENCE IN SALES AND MARKETING OR RELATED PROFESSIONAL AREA PREFERRED.  PRIOR EXPERIENCE WITH CONDOMINIUM OR REAL ESTATE PROJECT INVOLVING DIRECT RESPONSIBILITY FOR HOMEOWNERS OR HOMEOWNERS’ ASSOCIATIONS RELATIONS.  FAMILIARITY WITH HOTEL PROPERTY MANAGEMENT SYSTEMS AND THE ABILITY TO LEARN NEW SOFTWARE AND RELATED APPLICATIONS.  DRIVE INNOVATION AND INITIATIVES TO IMPROVE OUR OWNER EXPERIENCE.  SUBJECT MATTER EXPERT FOR ALL CTRC-RELATED PRODUCTS AND SERVICES, AMENITIES, ETC.  PARTICIPATE AND ATTEND MONTHLY SAFETY COMMITTEE MEETINGS AND OFFER FEEDBACK.  MODELS, ENCOURAGES, AND DEMONSTRATES BEHAVIORS THAT FOSTER A CUSTOMER-CENTRIC CULTURE.  ACT AS AN AMBASSADOR OF CTRC.  EDUCATE HOMEOWNERS ON THE BENEFITS OF THE RENTAL PROGRAM AND CONVINCE HOMEOWNERS THAT CTRC IS THE OPTIMAL VACATION RENTAL MANAGEMENT SOLUTION FOR THEIR HOME IN HAWAII.  MANAGE RENTAL AGREEMENT UPLOAD, NEW OWNER COMMUNICATIONS AND OWNER PORTAL ACCESS.  MAINTAIN POSITIVE HOMEOWNER RELATIONSHIPS BY REPRESENTING THE VALUES OF CORALTREE RESIDENCE COLLECTION.  RESPONSIBLE FOR MAINTAINING OWNER RELATIONS BY COMMUNICATING AND HANDLING OWNER REQUESTS IN A TIMELY MANNER.  MAINTAIN AND ADMINISTER HOMEOWNER CUSTOMER RELATIONSHIP MANAGER DATABASE WITH RESIDENCE OWNERSHIP DETAILS, OWNER PREFERENCES, PERSONAL ANNIVERSARIES AND BIRTHDAYS AND OTHER PERTINENT CUSTOMER INFORMATION USEFUL IN RELATIONSHIP BUILDING.",
    "job_skill_set": [
      "sales",
      "marketing",
      "customer relationship management",
      "data management",
      "software proficiency",
      "contract negotiation",
      "communication",
      "relationship building",
      "leadership",
      "customer-centric mindset",
      "innovation",
      "team collaboration",
      "problem solving",
      "time management",
      "hospitality",
      "property management systems",
      "real estate knowledge"
    ],
    "short_keywords": [
      "building",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "contract",
      "customer",
      "customercentric",
      "data",
      "development",
      "estate",
      "hospitality",
      "innovation",
      "knowledge",
      "leadership",
      "management",
      "manager",
      "marketing",
      "mindset",
      "negotiation",
      "problem",
      "proficiency",
      "property",
      "real",
      "relationship",
      "sales",
      "software",
      "solving",
      "systems",
      "team",
      "time"
    ]
  },
  {
    "job_id": "3885333032",
    "job_title": "Business Development Associate",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ARE YOU LOOKING FOR A CAREER THAT'S DRIVEN BY GROWTH AND FORGING NEW CONNECTIONS? HAVE YOU CONSISTENTLY DEMONSTRATED AN APTITUDE FOR CULTIVATION OPPORTUNITIES AND FOSTERING BUSINESS RELATIONSHIPS? ARE YOU MOTIVATED BY THE CHALLENGE OF EXPANDING A CLIENT BASE?\nJOIN PACIFIC ADVISORS AS A BUSINESS DEVELOPMENT ASSOCIATE. WE'RE SEEKING INDIVIDUALS WHO ARE ENERGIZED BY DRIVING BUSINESS GROWTH AND CREATING NEW AVENUES FOR EXPANSION. OUR DISTINCTIVE APPROACH EMPOWERS YOU TO TAILOR YOUR STRATEGIES TO CAPITALIZE ON EMERGING OPPORTUNITIES, ALL WITH THE ESSENTIAL SUPPORT STRUCTURE IN PLACE.\nSTEP INTO A ROLE THAT CENTERS AROUND CLIENT EXPANSION AND PROFESSIONAL ADVANCEMENT. WE'RE GROWING OUR TEAM OF BUSINESS DEVELOPMENT REPRESENTATIVES WHO SHARE OUR VALUES AND COMMITMENT TO PROGRESS. IF YOU'RE PREPARED TO LEVERAGE YOUR SKILLS TO PROPEL OUR BUSINESS FORWARD, DISCOVER HOW YOU CAN BE PART OF A CULTURE THAT FOSTERS YOUR AMBITIONS.\nWHAT YOU’LL BE DOING…PIONEER THE DEVELOPMENT OF A CLIENT BASE, LEVERAGING YOUR SKILLS TO IDENTIFY AND SEIZE GROWTH PROSPECTS. COLLABORATE WITH CLIENTS TO CONTINUALLY REFINE THEIR FINANCIAL STRATEGIES, ALIGNING THEM WITH THEIR EVOLVING GOALS.CULTIVATE LASTING CLIENT RELATIONSHIPS BY SKILLFULLY ANALYZING DATA AND DEVISING STRATEGIES SUPPORTED BY APPROPRIATE PRODUCTS AND SERVICES.\nWHAT WE PROVIDE…COMPREHENSIVE DEVELOPMENTAL PROGRAMS AND TRAINING, BOTH LOCALLY AND NATIONALLY, TO EMPOWER YOU IN SHAPING YOUR ROLE.ACCESS TO TEAMS, TOOLS, AND RESOURCES THAT AMPLIFY YOUR CAPACITY TO MARKET YOUR SERVICES, EXPAND YOUR CLIENTELE, AND COMMUNICATE EFFECTIVELY.MENTORSHIP OPPORTUNITIES AND AVENUES FOR STRATEGIC PARTNERSHIPS.A COMPETITIVE BENEFITS PACKAGE ENCOMPASSING A DEFINED BENEFIT PLAN, 401(K) CHOICES, HEALTH, AND DENTAL INSURANCE, AND MORE.WE OFFER A PERFORMANCE-BASED COMPENSATION STRUCTURE THAT REWARDS HARD WORK AND SUCCESS. THIS MEANS THAT YOUR COMPENSATION WILL BE DIRECTLY TIED TO YOUR PERFORMANCE AND ACHIEVEMENTS. ANNUAL BASE PAY RANGE FROM $12,000 TO $78,000 PLUS INCENTIVE COMPENSATION INCLUDING COMMISSION AND BONUS.\nREQUIREMENTSMUST BE A US CITIZEN OR PERMANENT RESIDENTA FOUR-YEAR COLLEGE DEGREE PREFERREDWILLING TO OBTAIN APPROPRIATE INSURANCE & INVESTMENT LICENSING\nOUR MISSION: HELPING PEOPLE FINANCIALLY PRODUCE AND SUPPORT A GOOD LIFE FOR THE REST OF THEIR LIVES\nPLEASE VISIT OUR WEBSITE TO LEARN MORE ABOUT US: WWW.ACAREERTHATMATTERS.COM PACIFIC ADVISORS LLC (CA INSURANCE LICENSE #0K12914) IS AN AGENCY OF THE GUARDIAN LIFE INSURANCE COMPANY OF AMERICA (GUARDIAN), NEW YORK, NY. INSURANCE PRODUCTS OFFERED THROUGH ONE PACIFIC FINANCIAL & INSURANCE SOLUTIONS LLC, DBA OF PACIFIC ADVISORS LLC. SECURITIES PRODUCTS AND ADVISORY SERVICES OFFERED THROUGH PARK AVENUE SECURITIES LLC (PAS), MEMBER FINRA, SIPC. OSJ: 2875 MICHELLE DR. SUITE 110 IRVINE, CA 92606. 909-399-1100. PAS IS A WHOLLY OWNED SUBSIDIARY OF GUARDIAN. PACIFIC ADVISORS IS NOT AN AFFILIATE OR SUBSIDIARY OF PAS. PACIFIC ADVISORS IS NOT REGISTERED IN ANY STATE OR WITH THE U.S. SECURITIES AND EXCHANGE COMMISSION AS A REGISTERED INVESTMENT ADVISOR. #2023-157595. EXP. 6/25",
    "job_skill_set": [
      "business development",
      "client relationship management",
      "data analysis",
      "financial strategy",
      "marketing",
      "communication",
      "team collaboration",
      "problem solving",
      "motivation",
      "adaptability",
      "strategic thinking",
      "customer service",
      "insurance licensing",
      "investment licensing"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "associate",
      "business",
      "businessdevelopment",
      "client",
      "collaboration",
      "communication",
      "customer",
      "data",
      "development",
      "financial",
      "insurance",
      "investment",
      "licensing",
      "management",
      "marketing",
      "motivation",
      "problem",
      "relationship",
      "service",
      "solving",
      "strategic",
      "strategy",
      "team",
      "thinking"
    ]
  },
  {
    "job_id": "3891069909",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ABOUT THE TEAM:VIZIO'S DYNAMIC BUSINESS DEVELOPMENT TEAM IS LOOKING FOR A MANAGER OF BUSINESS DEVELOPMENT WHO WILL WORK CLOSELY WITH BUSINESS LEADERSHIP TO IDENTIFY, SCOPE, NEGOTIATE, AND LEAD PARTNERSHIPS WITH MEDIA COMPANIES TO SUPPORT VIZIO'S AWARD-WINNING CONNECTED TV PLATFORM, SMARTCAST. THIS FULL-TIME POSITION IS BASED IN IRVINE, CA, AND REPORTS TO THE SENIOR DIRECTOR OF BUSINESS DEVELOPMENT.\nWHAT YOU WILL DO:• IN THIS CRITICAL ROLE, YOU WILL HELP EVOLVE VIZIO'S SMARTCAST PLATFORM REGARDING THE BREADTH OF CONTENT, PARTNERSHIP UNIQUENESS, AND FINANCIAL IMPACT ON THE OVERALL VIZIO ORGANIZATION.• YOU WILL BE TASKED WITH TELLING THE COMPANY'S STORY TO VIZIO'S CONTENT PARTNERS AND ENSURING THEY UNDERSTAND VIZIO'S STRATEGIC DIRECTION. YOU MUST BE COMFORTABLE PRESENTING AND THINKING QUICKLY, DECISIVELY, AND PROACTIVELY WHILE REPRESENTING VIZIO'S BUSINESS INTERESTS.• SUCCESSFUL CANDIDATES WILL WORK CROSS-FUNCTIONALLY WITH ENGINEERING, PRODUCT, AND MARKETING TEAMS TO EVALUATE AND DRIVE THE ADOPTION OF VIZIO'S SMARTCAST PLATFORM. THIS POSITION OFFERS AN UNPARALLELED OPPORTUNITY TO LEVERAGE YOUR UNDERSTANDING OF THE MEDIA AND OTHER TECH INDUSTRIES INSIDE A FAST-PACED ENVIRONMENT TO STRUCTURE INNOVATIVE AND IMPACTFUL RELATIONSHIPS.\nABOUT YOU:• YOU HAVE YOUR BACHELOR’S DEGREE IN BUSINESS OR A RELATED FIELD.• YOU HAVE 5+ YEARS OF BUSINESS DEVELOPMENT EXPERIENCE.• YOU ARE COMFORTABLE DEALING WITH TECHNICAL SUBJECT MATTER AND MANAGING AMBIGUITY IN A FAST-PACED ENVIRONMENT.• YOU HAVE PRIOR KNOWLEDGE OF EMERGING DIGITAL MEDIA PLATFORMS (BONUS POINTS GIVEN TO CANDIDATES WITH CONNECTED TV BACKGROUNDS) AND EXPERIENCE WITH MULTIPLE BUSINESS MODELS SUCH AS AVOD, TVOD, AND SVOD.• YOU HAVE A BROAD UNDERSTANDING OF THE MEDIA INDUSTRY, RESEARCH, CREATIVE DEAL-MAKING, AND SUPERIOR NEGOTIATION SKILLS.• YOU HAVE BASIC PROJECT MANAGEMENT SKILLS AND CAN ADVANCE NEW BUSINESS INITIATIVES WITHIN THE ORGANIZATION. THIS INCLUDES DRAFTING PROJECT DOCUMENTATION, PRODUCING AND MANAGING TIMELINES, AND EFFECTIVELY IDENTIFYING AND COMMUNICATING WITH KEY STAKEHOLDERS.• YOU HAVE CRITICAL THINKING, BUSINESS DEVELOPMENT, PARTNERSHIP, AND PROJECT MANAGEMENT SKILLS.\nABOUT VIZIOWE ARE BEAUTIFULLY SIMPLE.HEADQUARTERED IN IRVINE, CALIFORNIA, VIZIO IS A LEADING HDTV BRAND IN AMERICA AND THE #1 SOUND BAR BRAND IN AMERICA. VIZIO'S MISSION IS TO DELIVER HIGH PERFORMANCE, SMARTER PRODUCTS WITH THE LATEST INNOVATIONS AT A SIGNIFICANT SAVINGS THAT WE CAN PASS ALONG TO OUR CONSUMERS. OUR LOYAL FOLLOWING AND INDUSTRY-WIDE PRAISE CONTINUES TO GROW AS WE REDEFINE WHAT IT MEANS TO BE SMART. VIZIO, INC. IS AN EQUAL OPPORTUNITY EMPLOYER COMMITTED TO DIVERSITY IN THE WORKPLACE. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARDS TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, GENDER EXPRESSION, NATIONAL ORIGIN, PROTECTED VETERAN STATUS, OR ANY OTHER BASIS PROTECTED BY APPLICABLE LAW, AND WILL NOT BE DISCRIMINATED AGAINST ON THE BASIS OF DISABILITY. WE DO NOT ACCEPT UNSOLICITED AGENCY RESUMES. WE WILL NOT PAY FEES TO ANY THIRD-PARTY AGENCY, OUTSIDE RECRUITER OR FIRM WITHOUT A MUTUALLY AGREED-UPON CONTRACT AND WILL NOT BE RESPONSIBLE FOR ANY AGENCY FEES ASSOCIATED WITH UNSOLICITED RESUMES. UNSOLICITED RESUMES WILL BE CONSIDERED OUR PROPERTY AND WILL BE PROCESSED ACCORDINGLY. FOR CALIFORNIA-BASED EMPLOYMENT: THE MINIMUM SALARY FOR THIS POSITION IS $90,000.00/YEAR. THE MAXIMUM SALARY FOR THIS POSITION $118,000.00/YEAR. IN ADDITION TO BASE SALARY, THE COMPENSATION PACKAGE ALSO INCLUDES ELIGIBILITY FOR AN ANNUAL BONUS, AS WELL AS EQUITY AND A RANGE OF MEDICAL, DENTAL, VISION AND OTHER BENEFITS.",
    "job_skill_set": [
      "business development",
      "project management",
      "teamwork",
      "negotiation",
      "media industry knowledge",
      "digital media platforms",
      "AVOD",
      "TVOD",
      "SVOD",
      "technical understanding",
      "cross-functional collaboration",
      "communication",
      "critical thinking",
      "problem solving",
      "adaptability",
      "presentation skills"
    ],
    "short_keywords": [
      "adaptability",
      "avod",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "critical",
      "crossfunctional",
      "development",
      "digital",
      "industry",
      "knowledge",
      "management",
      "manager",
      "media",
      "negotiation",
      "platforms",
      "presentation",
      "problem",
      "project",
      "skills",
      "solving",
      "svod",
      "teamwork",
      "technical",
      "thinking",
      "tvod",
      "understanding"
    ]
  },
  {
    "job_id": "3895543911",
    "job_title": "Manager/Senior Manager, Strategic Partnerships & Business Development",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "TO GET THE BEST CANDIDATE EXPERIENCE, PLEASE CONSIDER APPLYING FOR A MAXIMUM OF 3 ROLES WITHIN 12 MONTHS TO ENSURE YOU ARE NOT DUPLICATING EFFORTS.\n\nJOB CATEGORY\n\nDEVELOPMENT & STRATEGY\n\nJOB DETAILS\n\nABOUT SALESFORCE\n\nWE’RE SALESFORCE, THE CUSTOMER COMPANY, INSPIRING THE FUTURE OF BUSINESS WITH AI+ DATA +CRM. LEADING WITH OUR CORE VALUES, WE HELP COMPANIES ACROSS EVERY INDUSTRY BLAZE NEW TRAILS AND CONNECT WITH CUSTOMERS IN A WHOLE NEW WAY. AND, WE EMPOWER YOU TO BE A TRAILBLAZER, TOO — DRIVING YOUR PERFORMANCE AND CAREER GROWTH, CHARTING NEW PATHS, AND IMPROVING THE STATE OF THE WORLD. IF YOU BELIEVE IN BUSINESS AS THE GREATEST PLATFORM FOR CHANGE AND IN COMPANIES DOING WELL AND DOING GOOD – YOU’VE COME TO THE RIGHT PLACE.\n\nABOUT SALESFORCE\n\nWE’RE SALESFORCE, THE CUSTOMER COMPANY, INSPIRING THE FUTURE OF BUSINESS WITH AI+ DATA +CRM. LEADING WITH OUR CORE VALUES, WE HELP COMPANIES ACROSS EVERY INDUSTRY BLAZE NEW TRAILS AND CONNECT WITH CUSTOMERS IN A WHOLE NEW WAY. AND, WE EMPOWER YOU TO BE A TRAILBLAZER, TOO — DRIVING YOUR PERFORMANCE AND CAREER GROWTH, CHARTING NEW PATHS, AND IMPROVING THE STATE OF THE WORLD. IF YOU BELIEVE IN BUSINESS AS THE GREATEST PLATFORM FOR CHANGE AND IN COMPANIES DOING WELL AND DOING GOOD – YOU’VE COME TO THE RIGHT PLACE.\n\nROLE DESCRIPTION\n\nTHE GLOBAL TECHNOLOGY PARTNERSHIPS TEAM IS LOOKING FOR A DEDICATED INDIVIDUAL TO JOIN THE PRODUCT BUSINESS DEVELOPMENT TEAM. THIS IS A UNIQUE OPPORTUNITY TO JOIN A CENTRALIZED TEAM THAT DEVELOPS AND DRIVES NEW STRATEGIC PARTNERSHIP INITIATIVES ALIGNED TO OUR TOP CORPORATE AND PRODUCT PRIORITIES ACROSS ALL OF SALESFORCE. THESE STRATEGIC PARTNERSHIPS AND INITIATIVES DRIVE REVENUE, INCREASE CUSTOMER SUCCESS, DELIVER ON OUR PRODUCT ROADMAP, ELEVATE OUR BRAND, AND DIFFERENTIATE OUR COMPANY.\n\nAS A MEMBER OF THE PRODUCT BUSINESS DEVELOPMENT TEAM, YOU WILL BE A HIGHLY VISIBLE LEADER RESPONSIBLE FOR GENERATING, MANAGING, AND DRIVING SOME OF SALESFORCE’S MOST COMPLEX AND HIGH-IMPACT PARTNERSHIP ACTIVITIES. THIS INCLUDES GENERATING PARTNERSHIP STRATEGY, LEADING FINANCIAL ANALYSIS, AND HANDLING RELATIONSHIPS AND NEGOTIATIONS FOR PARTNERSHIP DEALS WHICH CAN BE NON-TRADITIONAL IN NATURE, REQUIRE SOPHISTICATED STAKEHOLDER MANAGEMENT, AND HAVE BROAD STRATEGIC IMPLICATIONS FOR SALESFORCE. THE ROLE WILL REQUIRE CONCURRENTLY DRIVING MULTIPLE DEALS OR INITIATIVES THAT CAN INVOLVE MANY PARTS OF OUR PRODUCT AND TECHNOLOGY PORTFOLIO AND REQUIRE WORKING SEAMLESSLY WITH CROSS-FUNCTIONAL STAKEHOLDERS IN PRODUCT, ENGINEERING, MARKETING, DISTRIBUTION, PROCUREMENT, FINANCE, OPERATIONS AND LEGAL.\n\nYOUR IMPACT\n\nBUILD OUT NEW PARTNERSHIP STRATEGIES, FINANCIAL ANALYSES, PRODUCT STRATEGIES, AND INTEGRATION PLANS FOR OUR PRODUCT BUSINESS DEVELOPMENT INITIATIVESEVANGELIZE STRATEGIES, BOTH QUANTITATIVELY AND QUALITATIVELY, WITH CROSS-FUNCTIONAL STAKEHOLDER AND EXECUTIVE AUDIENCES TO BUILD CONSENSUS AND ALIGNMENT ON EACH INITIATIVELEAD THE BUILDING AND DEVELOPMENT OF DESIGN ASSETS AS NEEDED TO COMMUNICATE OUR STRATEGIES AND IDEAS: THIS INCLUDES WELL-DESIGNED PITCH DECKS, PRODUCT MOCKUPS, AND WORKING TECHNOLOGY DEMOS WHERE APPROPRIATEPARTNER WITH OTHER GLOBAL TECHNOLOGY PARTNERSHIPS TEAM MEMBERS TO EXECUTE PARTNERSHIP INITIATIVES FROM INITIAL IDEA TO CLOSEBUILD AND MAINTAIN DEEP RELATIONSHIPS WITHIN PROSPECTIVE AND EXISTING STRATEGIC PARTNERS, AND WITH KEY STAKEHOLDERS FROM ACROSS SALESFORCE INCLUDING PRODUCT, LEGAL, SALES, ISV, ENGINEERING, INFRASTRUCTURE, MARKETING, AND PRREPRESENT OUR TEAM’S INITIATIVES, STRATEGIES, AND PLANS WITH EVP+ AND C-LEVEL AUDIENCES ACROSS BOTH SALESFORCE AND OUR STRATEGIC PARTNERSWORK WITH STRATEGIC PARTNERSHIP MARKETING AND ENABLEMENT TO DRIVE FIELD ENABLEMENT AND EDUCATION ON OUR PARTNERSHIPSPRESENT THE RELATIONSHIP STATUS AND INTEGRATIONS FOR THE PARTNERSHIPS AT THE SALESFORCE STRATEGIC INNOVATION CENTER (SIC) WITH C-LEVEL CUSTOMERS ON A REGULAR BASIS\n\nMINIMUM QUALIFICATIONS\n\nMINIMUM 5+ YEARS IN HIGH-TECH INDUSTRY (PREFERABLY ENTERPRISE SOFTWARE) IN THE FOLLOWING ROLES: STRATEGIC PARTNERSHIPS, BUSINESS DEVELOPMENT, CORPORATE DEVELOPMENT, PARTNER ENGINEERING, OR EQUIVALENTSTRONG PRODUCT KNOWLEDGE OF SALESFORCE PRODUCTS AND SERVICES OR EQUIVALENT TECHNOLOGIES IN THE MARKETPROVEN UNDERSTANDING OF AND WILLINGNESS TO LEARN PARTNER PRODUCTS, TECHNOLOGIES, AND SERVICESEXPERIENCE IN MESSAGING AND POSITIONING PRODUCT AND PARTNERSHIP VALUE PROPOSITIONS TO INTERNAL AND EXTERNAL AUDIENCESSTRONG EXECUTIVE PRESENCE WITH SHOWN ABILITY TO PRESENT IN FORMAL AND INFORMAL SETTINGSABILITY TO BUILD PRODUCT ROADMAPS AND WORK WITH AGILE ENGINEERING TEAMS\n\nPREFERRED QUALIFICATIONS\n\nSTRATEGIC AND ANALYTICAL PROBLEM SOLVER WHO IS ABLE TO BLEND TECHNOLOGY AND BUSINESS STRATEGY TO DEVELOP A COMPELLING VISION AND STRATEGY FOR PARTNERSHIP INITIATIVESSTELLAR PUBLIC SPEAKER WITH A STRONG CAPABILITY TO COMMUNICATE COMPLEX IDEAS IN A COMPELLING AND EASY-TO-DIGEST MANNER THROUGH BOTH VERBAL AND VISUAL STORYTELLINGDESIGN-ORIENTED WITH THE ABILITY TO COMMUNICATE SOPHISTICATED CONCEPTS AND IDEAS VISUALLYABILITY TO PRIORITIZE IN A DYNAMIC WORKING ENVIRONMENT AND BUILD EXCELLENT RAPPORT WITH INTERNAL TEAMS; TIGHT-KNIT COLLABORATION IS A REQUIREMENTCONSISTENT TRACK RECORD IN PERFORMING WELL IN A FAST-PACED ENVIRONMENT AND ORGANIZATIONAL SKILLS TO OPTIMALLY LEAD MULTIPLE PROJECTS\n\nOUR INVESTMENT IN YOU\n\nWORLD-CLASS ENABLEMENT AND ON-DEMAND TRAINING - CHECK OUT TRAILHEAD.COM FOR A SNEAK PEEK!EXPOSURE TO EXECUTIVE THOUGHT LEADERS WITH A PASSION FOR LIVING OUR VALUESCLEAR PATH TO PROMOTION WITH ACCELERATED LEADERSHIP DEVELOPMENT PROGRAMSWEEKLY 1:1 COACHING WITH YOUR LEADERSHIPFAST RAMP MENTORSHIP PROGRAMWEEK-LONG PRODUCT BOOTCAMPSANDLER SALES TRAINING\n\nVOLUNTEER OPPORTUNITIES\n\nHAVE YOU HEARD OF OUR 1:1:1 MODEL, FOCUSED ON GIVING BACK TO THE COMMUNITY? THE SUCCESS IN GIVING BACK HAVE HELPED US AND OUR TRAILBLAZER COMMUNITY BECOME A LEADER IN PHILANTHROPY, CULTURE, AND INNOVATION. WE ARE ONE OF THE WORLD’S MOST INNOVATIVE COMPANIES, ACCORDING TO FORBES, WE ARE #1 IN PEOPLE’S TOP 15 COMPANIES THAT CARE, AND ARE ON FORTUNE’S CHANGE THE WORLD LIST. VALUES CREATE VALUE. OUR VALUES HELPED DRIVE OUR REVENUE NUMBER TO $13.28 BILLION DOLLARS IN FISCAL YEARS IN 2019.\n\nWE HAVE A PUBLIC-FACING WEBSITE THAT EXPLAINS OUR VARIOUS BENEFITS FOR:\n\nHEALTH BENEFITSFINANCIAL BENEFITS AND PERKSTIME OFF AND LEAVE POLICIESPARENTAL BENEFITSPERKS AND DISCOUNTS\n\nVISIT HTTPS://WWW.SALESFORCEBENEFITS.COM/ FOR THE FULL BREAKDOWN.\n\nACCOMMODATIONS\n\nIF YOU REQUIRE ASSISTANCE DUE TO A DISABILITY APPLYING FOR OPEN POSITIONS PLEASE SUBMIT A REQUEST VIA THIS ACCOMMODATIONS REQUEST FORM.\n\nPOSTING STATEMENT\n\nAT SALESFORCE WE BELIEVE THAT THE BUSINESS OF BUSINESS IS TO IMPROVE THE STATE OF OUR WORLD. EACH OF US HAS A RESPONSIBILITY TO DRIVE EQUALITY IN OUR COMMUNITIES AND WORKPLACES. WE ARE COMMITTED TO CREATING A WORKFORCE THAT REFLECTS SOCIETY THROUGH INCLUSIVE PROGRAMS AND INITIATIVES SUCH AS EQUAL PAY, EMPLOYEE RESOURCE GROUPS, INCLUSIVE BENEFITS, AND MORE. LEARN MORE ABOUT EQUALITY AT WWW.EQUALITY.COM AND EXPLORE OUR COMPANY BENEFITS AT WWW.SALESFORCEBENEFITS.COM.\n\nSALESFORCE IS AN EQUAL EMPLOYMENT OPPORTUNITY AND AFFIRMATIVE ACTION EMPLOYER. QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER PERCEPTION OR IDENTITY, NATIONAL ORIGIN, AGE, MARITAL STATUS, PROTECTED VETERAN STATUS, OR DISABILITY STATUS. SALESFORCE DOES NOT ACCEPT UNSOLICITED HEADHUNTER AND AGENCY RESUMES. SALESFORCE WILL NOT PAY ANY THIRD-PARTY AGENCY OR COMPANY THAT DOES NOT HAVE A SIGNED AGREEMENT WITH SALESFORCE.\n\n﻿SALESFORCE WELCOMES ALL.\n\nPURSUANT TO THE SAN FRANCISCO FAIR CHANCE ORDINANCE AND THE LOS ANGELES FAIR CHANCE INITIATIVE FOR HIRING, SALESFORCE WILL CONSIDER FOR EMPLOYMENT QUALIFIED APPLICANTS WITH ARREST AND CONVICTION RECORDS.\n\nFOR NEW YORK-BASED ROLES, THE BASE SALARY HIRING RANGE FOR THIS POSITION IS $132,800 TO $225,500.\n\nFOR WASHINGTON-BASED ROLES, THE BASE SALARY HIRING RANGE FOR THIS POSITION IS $121,800 TO $206,700.\n\nFOR CALIFORNIA-BASED ROLES, THE BASE SALARY HIRING RANGE FOR THIS POSITION IS $132,800 TO $225,500.\n\nCOMPENSATION OFFERED WILL BE DETERMINED BY FACTORS SUCH AS LOCATION, LEVEL, JOB-RELATED KNOWLEDGE, SKILLS, AND EXPERIENCE. CERTAIN ROLES MAY BE ELIGIBLE FOR INCENTIVE COMPENSATION, EQUITY, BENEFITS. MORE DETAILS ABOUT OUR COMPANY BENEFITS CAN BE FOUND AT THE FOLLOWING LINK: HTTPS://WWW.SALESFORCEBENEFITS.COM.",
    "job_skill_set": [
      "business development",
      "stakeholder management",
      "CRM",
      "communication",
      "leadership",
      "collaboration",
      "problem solving",
      "adaptability",
      "relationship building",
      "strategic partnerships",
      "financial analysis",
      "product knowledge",
      "negotiation",
      "agile methodologies",
      "data analysis",
      "presentation skills",
      "project management",
      "product roadmap development",
      "technology integration",
      "public speaking",
      "strategic thinking",
      "organizational skills",
      "visual storytelling"
    ],
    "short_keywords": [
      "adaptability",
      "agile",
      "analysis",
      "building",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "crm",
      "data",
      "development",
      "financial",
      "integration",
      "knowledge",
      "leadership",
      "management",
      "manager",
      "managersenior",
      "methodologies",
      "negotiation",
      "organizational",
      "partnerships",
      "presentation",
      "problem",
      "product",
      "project",
      "public",
      "relationship",
      "roadmap",
      "skills",
      "solving",
      "speaking",
      "stakeholder",
      "storytelling",
      "strategic",
      "technology",
      "thinking",
      "visual"
    ]
  },
  {
    "job_id": "3887489419",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ABOUT THE JOB: PERRY IS A WORKFORCE TRANSFORMATION COMPANY DEDICATED TO BUILDING GOOD JOBS IN HEALTHCARE. BUILT BY DATA SCIENTISTS, PERRY IS A B CORP THAT PROMOTES FINANCIAL WELLNESS FOR EMPLOYERS AND EMPLOYEES BY RECOGNIZING OUTSTANDING PERFORMANCE IN REAL TIME. UTILIZING CUTTING-EDGE DATA SCIENCE AND ARTIFICIAL INTELLIGENCE, PERRY STREAMLINES HEALTHCARE OPERATIONS, MAKING AGENCIES MORE EFFICIENT AND ENHANCES THE CAREGIVER EXPERIENCE.\nAS A BUSINESS DEVELOPMENT REPRESENTATIVE AT PERRY, YOU WILL HAVE THE OPPORTUNITY TO PLAY A VITAL ROLE IN BUILDING OUR TOP-TIER GO-TO-MARKET FUNCTION FROM THE GROUND UP. BASED IN CHELSEA, NYC, YOU WILL WORK CLOSELY WITH OUR ACCOUNT EXECUTIVE AND GROWTH TEAMS TO DRIVE REVENUE DURING THIS NEXT STAGE OF OUR HYPERGROWTH. IF YOU ARE LOOKING TO JOIN A FAST-PACED TEAM WITH FANTASTIC EARNING AND CAREER GROWTH POTENTIALS, THIS IS THE PLACE TO BE!\nRESPONSIBILITIES:ACTIVELY ENGAGE IN OUTBOUND PROSPECTING, INCLUDING COLD-CALLING AND MESSAGING, TO QUALIFY LEADS AND INQUIRIES.COLLABORATE WITH ACCOUNT EXECUTIVES & GROWTH TO CREATE STRATEGIES FOR ACQUIRING NEW PROSPECTS AND ACCOUNTS.WORK CROSS-FUNCTIONALLY TO ENHANCE PERRY'S INTERNAL SYSTEMS AND PRODUCT OFFERINGS.SERVE AS A PERRY PRODUCT KNOWLEDGE EXPERT, GUIDING AGENCIES TO SOLUTIONS FOR THEIR CHALLENGES WITH INSIGHTFUL, CONSULTATIVE ADVICE.LEVERAGE VARIOUS SALES TOOLS AND PLATFORMS SUCH AS SALESFORCE, OUTREACH, APOLLO.IO, AND G-SUITE TO OPTIMIZE YOUR SALES PROCESSES AND OUTCOMES.MAINTAIN A STRONG FOCUS ON METRICS AND LEVERAGE DATA TO GUIDE DECISION-MAKING.CONSISTENTLY ACHIEVE SALES QUOTAS BY CONTRIBUTING TO EFFECTIVE OUTBOUND STRATEGIES.\nWHAT WE’RE LOOKING FOR:AT LEAST 1 YEAR+ OF PRIOR EXPERIENCE IN SALES DEVELOPMENT OR A RELATED FIELD.EXPERIENCE AND SUCCESS IN COLD-CALLING AND PROSPECTING, WITH AN UNDERSTANDING OF WORKING TOWARD MONTHLY QUOTAS.PROVEN TRACK RECORD OF MEETING OR EXCEEDING SALES TARGETS.ADAPTABILITY, COACHABILITY, A HIGH LEVEL OF MOTIVATION, AND A STRONG SENSE OF URGENCY, WITH COMFORT WORKING IN A FAST-PACED ENVIRONMENT.EXCELLENT COMMUNICATION SKILLS, WITH THE ABILITY TO EXPLAIN NEW TECHNOLOGIES TO DIVERSE AUDIENCES, INCLUDING C-LEVEL EXECUTIVES.STRONG ATTENTION TO DETAIL AND ORGANIZATIONAL SKILLS, EVEN WHEN MANAGING A LARGE NUMBER OF LEADS.A SENSE OF CURIOSITY AND A DESIRE TO CONTINUOUSLY LEARN, GROW, AND PROVIDE/RECEIVE FEEDBACK.\nWHAT WE OFFER:COMPETITIVE EMPLOYEE BENEFITS PACKAGE, INCLUDING HEALTHCARE, DENTAL, AND VISION COVERAGE.A DYNAMIC, SUPPORTIVE, AND COLLABORATIVE WORKPLACE CULTURE.SIGNIFICANT OPPORTUNITIES FOR CAREER DEVELOPMENT AND PROGRESSION.A CHANCE TO BE PART OF AN INNOVATIVE, VALUES-DRIVEN ORGANIZATION THAT IS CHANGING THE FACE OF HEALTHCARE.\nADDITIONAL DETAILSSALARY RANGE: THIS POSITION OFFERS A COMPETITIVE SALARY RANGE OF $80K-$100K OTE, COMMENSURATE WITH EXPERIENCE AND PERFORMANCE.LOCATION REQUIREMENT: THIS IS AN IN-OFFICE ROLE BASED IN OUR CHELSEA, MANHATTAN OFFICE, UNDERSCORING OUR COMMITMENT TO COLLABORATION AND TEAM DYNAMICS.\nHOW TO APPLY:IF YOU'RE PASSIONATE ABOUT SALES, EXCEL IN CHALLENGING ENVIRONMENTS, AND ARE EAGER TO MAKE A SIGNIFICANT IMPACT AT PERRY, WE'D LOVE TO HEAR FROM YOU. PLEASE SUBMIT YOUR RESUME TO BE CONSIDERED FOR THIS EXCITING OPPORTUNITY.\nTHANK YOU FOR YOUR INTEREST IN JOINING THE PERRY TEAM!\nPERRY IS AN EQUAL OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION WITHOUT REGARD TO RACE, COLOR, RELIGION, GENDER, GENDER IDENTITY OR EXPRESSION, SEXUAL ORIENTATION, NATIONAL ORIGIN, GENETICS, DISABILITY, AGE, OR VETERAN STATUS.\n\n",
    "job_skill_set": [
      "sales development",
      "cold-calling",
      "prospecting",
      "data analysis",
      "communication",
      "adaptability",
      "motivation",
      "organizational skills",
      "attention to detail",
      "curiosity",
      "teamwork",
      "coaching",
      "feedback",
      "Salesforce",
      "Outreach",
      "Apollo.io",
      "G-Suite"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "apolloio",
      "attention",
      "business",
      "businessdevelopment",
      "coaching",
      "coldcalling",
      "communication",
      "curiosity",
      "data",
      "detail",
      "development",
      "feedback",
      "gsuite",
      "motivation",
      "organizational",
      "outreach",
      "prospecting",
      "representative",
      "sales",
      "salesforce",
      "skills",
      "teamwork",
      "to"
    ]
  },
  {
    "job_id": "3899516898",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "JOB DESCRIPTIONBUSINESS DEVELOPMENT MANAGERCNC FOUNDATIONS IS A SPECIALIZED GEOTECHNICAL COMMERCIAL SUBCONTRACTOR, SERVICING THE MIDWEST, SOUTHEAST AND NORTH CENTRAL US, WORKING WITH GENERAL CONTRACTORS, DEVELOPERS AND CONSTRUCTION MANAGERS ON PROJECTS FOR GROUND IMPROVEMENT, EARTH RETENTION, DEEP FOUNDATIONS, SOIL STABILIZATION AND SETTLEMENT CONTROL. CNC FOUNDATIONS, INC. IS AN INNOVATIVE, HIGH INTEGRITY GROWING COMPANY WHO VALUES AND RESPECTS TEAM, FAMILIES AND CUSTOMERS.IN THIS HIGH-PROFILE POSITION, YOUR PRINCIPLE RESPONSIBILITY WILL BE BUSINESS DEVELOPMENT AND RELATIONSHIP DEVELOPMENT/MANAGEMENT WITH PROSPECTS, INFLUENCERS AND EXISTING CUSTOMERS. THESE PROSPECTS AND CUSTOMERS WILL INCLUDE ENGINEERS, PRINCIPALS, ESTIMATORS, PROJECT MANAGERS AND SENIOR LEADERSHIP. THE BUSINESS DEVELOPMENT MANAGER (BDM) WILL BE RESPONSIBLE FOR GROWING SALES IN THEIR TERRITORY BY DEVELOPING RELATIONSHIPS WITH KEY DECISION MAKERS WITHIN THE INDUSTRY AND RESEARCHING, UNDERSTANDING AND EXECUTING THEIR SALES BUSINESS PLAN TOWARD DEFINE REVENUE GOALS. OTHER DUTIES WILL INCLUDE BUT ARE NOT LIMITED TO CONTRACT NEGOTIATIONS, DAILY MANAGEMENT OF TERRITORY DEVELOPMENT AND MONITORING PROJECT SCHEDULES, WORKING WITH IN-HOUSE MARKETING TEAM TO CREATE AND IMPLEMENT MARKETING EFFORTS, COST CONTROL AND SECURING PAYMENT. YOUR RESPONSIBILITIES WILL INCLUDE DEVELOPING BUSINESS PLANS, MARKETING AND SALES OF DEEP FOUNDATION SYSTEMS, EARTH RETENTION, FOUNDATION REHABILITATION, SOIL STABILIZATION, SETTLEMENT CONTROL AND GROUND IMPROVEMENT SYSTEMS.QUALIFIED CANDIDATES SHOULD HAVE 7 OR MORE YEARS OF EXPERIENCE GROWING TECHNICAL SOLUTION SALES REVENUE WITHIN TERRITORY OR MARKET SEGMENT.OTHER REQUIREMENTS INCLUDE:· DEVELOPING EXTENSIVE KNOWLEDGE AND SKILLS WITHIN INDUSTRY WITH THE GOAL OF BECOMING A TRUSTED ADVISOR FOR CNC FOUNDATIONS CUSTOMERS.· PASSION FOR SALES AND LEARNING· DEMONSTRATED TENACIOUSNESS· DEMONSTRATED TECHNICAL APTITUDE· COMPETITIVE DRIVE AND ATTITUDE· EXTENSIVE TRAVEL THROUGHOUT TERRITORY (>25-35%)· DELIVERING EFFECTIVE AND PROFESSIONAL PRESENTATIONS· EFFECTIVE AND SUCCESSFUL NEGOTIATION WITH CUSTOMERS ON CONTRACTS AND PRICING· COMFORTABLE AND SKILLED AT ENGAGING WITH ENGINEERS, GENERAL CONTRACTORS, AND OWNERS.· EXCELLENT VERBAL AND WRITTEN COMMUNICATION· EXCELLENT ORGANIZATIONAL SKILLS· COMPUTER SKILLS INCLUDING MS WORD, EXCEL, OUTLOOK, POWERPOINT, ONENOTE, AND CRM· WORKING KNOWLEDGE OR EXPERIENCE IN GENERAL CONSTRUCTION, SHORING AND EARTH RETENTION, MICROPILES AND DRILLING A PLUS.COMPENSATION: COMMENSURATE WITH EXPERIENCEJOB TYPE: FULL-TIMEBENEFITS:\n401(K)DENTAL INSURANCEHEALTH INSURANCEPAID TIME OFFVISION INSURANCE\nSCHEDULE:\n8 HOUR SHIFT\nSUPPLEMENTAL PAY TYPES:\nCOMMISSION PAY\nEXPERIENCE:\nBUSINESS DEVELOPMENT: 1 YEAR (REQUIRED)SALES: 1 YEAR (REQUIRED)\nABILITY TO RELOCATE:\nST. LOUIS, MO: RELOCATE BEFORE STARTING WORK (REQUIRED)\nWILLINGNESS TO TRAVEL:\n50% (PREFERRED)\nWORK LOCATION: ON THE ROAD",
    "job_skill_set": [
      "business development",
      "sales",
      "contract negotiation",
      "marketing",
      "presentation skills",
      "project management",
      "relationship management",
      "communication",
      "organizational skills",
      "tenacity",
      "competitive drive",
      "adaptability",
      "problem solving",
      "teamwork",
      "customer engagement",
      "CRM software",
      "MS Office (Word, Excel, PowerPoint, Outlook, OneNote)",
      "technical solution sales",
      "general construction knowledge",
      "earth retention systems",
      "ground improvement systems",
      "soil stabilization",
      "settlement control"
    ],
    "short_keywords": [
      "adaptability",
      "business",
      "businessdevelopment",
      "communication",
      "competitive",
      "construction",
      "contract",
      "control",
      "crm",
      "customer",
      "development",
      "drive",
      "earth",
      "engagement",
      "excel",
      "general",
      "ground",
      "improvement",
      "knowledge",
      "management",
      "manager",
      "marketing",
      "ms",
      "negotiation",
      "office",
      "onenote",
      "organizational",
      "outlook",
      "powerpoint",
      "presentation",
      "problem",
      "project",
      "relationship",
      "retention",
      "sales",
      "settlement",
      "skills",
      "software",
      "soil",
      "solution",
      "solving",
      "stabilization",
      "systems",
      "teamwork",
      "technical",
      "tenacity",
      "word"
    ]
  },
  {
    "job_id": "3899526408",
    "job_title": "Cardiology Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "HEARTFLOW, INC. IS A MEDICAL TECHNOLOGY COMPANY ADVANCING THE DIAGNOSIS AND MANAGEMENT OF CORONARY ARTERY DISEASE, THE #1 CAUSE OF DEATH WORLDWIDE, USING CUTTING-EDGE TECHNOLOGY. THE FLAGSHIP PRODUCT—AN AI-DRIVEN, NON-INVASIVE CARDIAC TEST SUPPORTED BY THE ACC/AHA CHEST PAIN GUIDELINES CALLED THE HEARTFLOW FFR CT ANALYSIS—PROVIDES A COLOR-CODED, 3D MODEL OF A PATIENT’S CORONARY ARTERIES INDICATING THE IMPACT BLOCKAGES HAVE ON BLOOD FLOW TO THE HEART. HEARTFLOW IS THE FIRST AI-DRIVEN NON-INVASIVE INTEGRATED HEART CARE SOLUTION ACROSS THE CCTA PATHWAY THAT HELPS CLINICIANS IDENTIFY STENOSES IN THE CORONARY ARTERIES (ROADMAP™ANALYSIS), ASSESS CORONARY BLOOD FLOW (FFR CT ANALYSIS), AND CHARACTERIZE AND QUANTIFY CORONARY ATHEROSCLEROSIS (PLAQUE ANALYSIS). OUR PIPELINE OF PRODUCTS IS GROWING AND SO IS OUR TEAM; JOIN US IN HELPING TO REVOLUTIONIZE PRECISION HEARTCARE.\n\nHEARTFLOW IS A VC-BACKED, PRE-IPO COMPANY THAT HAS RECEIVED INTERNATIONAL RECOGNITION FOR EXCEPTIONAL STRIDES IN HEALTHCARE INNOVATION, IS SUPPORTED BY MEDICAL SOCIETIES AROUND THE WORLD, CLEARED FOR USE IN THE US, UK, EUROPE, JAPAN AND CANADA, AND HAS BEEN USED FOR MORE THAN 250,000 PATIENTS WORLDWIDE.\n\nTHE BUSINESS DEVELOPMENT REPRESENTATIVE (BDR) WILL BE THE FACE OF HEARTFLOW WITHIN A SPECIFIC GEOGRAPHIC REGION. THE BDR WILL WORK WITH CUSTOMERS TO ENSURE THAT THEY ARE EXTREMELY SUCCESSFUL WITH HEARTFLOW’S NON-INVASIVE CARDIOVASCULAR DIAGNOSTIC TECHNOLOGY. IT IS YOUR RESPONSIBILITY TO DRIVE ADOPTION THROUGH THE NETWORK OF REFERRING PHYSICIANS. YOU WILL WORK WITH YOUR ACCOUNTS PROACTIVELY TO SUPPORT, EDUCATE, AND PROVIDE SOLUTIONS TO BUILD HIGH CUSTOMER SATISFACTION. THIS IS A CUSTOMER- FACING ROLE WITH A PRIMARY FOCUS ON SPENDING TIME WITH CUSTOMERS INCLUDING CARDIOLOGISTS, PRIMARY CARE PHYSICIANS, NURSE PRACTITIONERS, AND BEYOND. EXPECT APPROXIMATELY 20-25% TRAVEL FROM A HOME OFFICE.\n\nTHE HEARTFLOW ANALYSIS IS A FIRST-OF-ITS-KIND NONINVASIVE TECHNOLOGY THAT HELPS CLINICIANS DIAGNOSE AND TREAT PATIENTS WITH SUSPECTED CORONARY ARTERY DISEASE (CAD).\n\nJOB RESPONSIBILITIES:\n\nWILL WORK WITH KEY STRATEGIC HEARTFLOW ACCOUNTS TO DRIVE GROWTH AND ADOPTION OF A CCTA AND FFRCT CLINICAL PATHWAY. IN THESE ACCOUNTS, THE BDR WILL DEVELOP AND EXECUTE BUSINESS DEVELOPMENT PLANS WORKING CLOSELY WITH THE ACCOUNT’S KEY STAKEHOLDERSFACILITATE CROSS-FUNCTIONAL COLLABORATION THROUGHOUT THE ORGANIZATION. TOOLS FOR PROGRAM DEVELOPMENT COULD INCLUDE KEY DEPLOYMENT OF HEARTFLOW INTERNAL LEADERSHIP AND PHYSICIAN MENTORS, ORGANIZING AND STAFFING OF DINNER PROGRAMS, VIP VISITS, ORGANIZING HEARTFLOW CT PATHWAY ROAD-SHOWS, REFERRING PHYSICIAN OFFICE MEETINGS, ETC. THIS ROLE WILL WORK CLOSELY WITH THE OTHER HEARTFLOW TEAM MEMBERS TO INCLUDE RESPECTIVE DSM, MARKETING, MARKET ACCESS, CT APPS, PRODUCT DEVELOPMENT AND CLINICALINCREASE HEARTFLOW USAGE WITHIN THE DESIGNATED KEY STRATEGIC HEARTFLOW ACCOUNT BY: 1) MAINTAINING AND BUILDING RELATIONSHIPS WITH REFERRING PHYSICIANS AND OTHER KEY CLINICAL STAKEHOLDERS 2) EDUCATING CUSTOMERS ON HEARTFLOW’S VALUE PROPOSITION BY GIVING PRESENTATIONS / HAVING DISCUSSIONS WITH REFERRING MDS 3) PROMOTING / CHAMPIONING HEARTFLOW AND BUILDING ADVOCACPRODUCTION/SUCCESS/ACHIEVEMENT OF THE BUSINESS DEVELOPMENT REPRESENTATIVE WILL BE EVALUATED AND BASED ON PERFORMANCE IN ACTIVE/TARGETED ACCOUNTS(METRICS): 1) MEET / EXCEED QUOTA FOR THE STRATEGIC HEARTFLOW ACCOUNT (WITHIN EXISTING CUSTOMER LOCATIONS) 2) CCTA GROWTH (CONVERSION OF NON-INVASIVE TESTS) AND FFRCT PENETRATION / CASE GROWTH OVER BASELINE (% AND $) IN ASSIGNED ACCOUNTS.\n\nSKILLS NEEDED:\n\nPROVEN SALES SKILLS AND TRACK-RECORD OF SALES ACHIEVEMENTACCOUNT DEVELOPMENT - EXPERIENCE BUILDING AND SUPPORTING STRONG CLINICAL PROGRAMS IS PREFERRED.CLINICAL / TECHNICAL PROFICIENCY - QUICK LEARNER ABLE TO GRASP NEW CLINICAL/TECHNICAL INFORMATION AND THEN DISSEMINATE TO CUSTOMERS.DEVELOP RELATIONSHIPS WITH KEY ACCOUNT STAKEHOLDERS, TO INCLUDE ADMIN, ADMIN SUPPORT, KEY CARDIOLOGISTS, KEY REFERRING PHYSICIAN PRACTICES, HOSPITAL MARKETING AND KEY STRATEGIC PERSONNEL TO DRIVE AWARENESS OF A CCTA/FFRCT PATHWAY, BROADEN HEARTFLOW REFERRALS, AND DEEPEN HEARTFLOW ADOPTION.WORK IN A CROSS FUNCTIONAL CAPACITY TO COORDINATE FIELD AND HQ RESOURCES NEEDED TO SUPPORT FOCUSED CUSTOMERS AND EXECUTE PROGRAM DEVELOPMENT PLANS, SUPPORT SALES, MARKETING, EDUCATION AND TRAINING.CUSTOMER-FOCUSED MENTALITY.ABILITY TO EXPLAIN MEDICAL TECHNOLOGIES TO REFERRING PHYSICIANS AND HEALTH CARE PROFESSIONALS.KNOWLEDGE OF CARDIAC PATIENT PATHWAYS AND DIAGNOSTIC TECHNOLOGY IS PREFERRED.SELF-MOTIVATED AND ABILITY TO INITIATE, ORGANIZE, AND COMPLETE PROJECTS.EXCELLENT PROBLEM-SOLVING ABILITY, ESPECIALLY UNDER PRESSURE.EXTREMELY STRONG WORK ETHIC.WORKS WELL IN A CROSS-FUNCTIONAL TEAM ENVIRONMENT.ABILITY TO WORK EFFECTIVELY WITH CUSTOMERS FROM A WIDE RANGE OF TECHNICAL AND CLINICAL BACKGROUNDS.EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS. PROFESSIONAL ETIQUETTE.EXPERIENCE WITH SALESFORCE.COM OR SIMILAR CRM\n\nEDUCATIONAL REQUIREMENTS & WORK EXPERIENCE\n\n4-YEAR DEGREE WITH5+YEARS OF RELATED SALES OR CLINICAL EXPERIENCE OR 2-YEAR DEGREE WITH7+ YEARS RELATED SALES OR CLINICAL EXPERIENCE.DEGREE IN SCIENCE, MEDICAL, BUSINESS, MARKETING OR TECHNICAL FIELD IS PREFERRED.PRIOR EXPERIENCE IN MEDICAL DEVICE, CARDIOLOGY PHARMACEUTICALS, CARDIOLOGY RADIO-PHARMACEUTICALS, HOSPITAL, OR MEDICAL SOFTWARE IS HIGHLY DESIREDEXPERIENCE WITH INTRODUCING NEW CARDIOVASCULAR TECHNOLOGIES INTO HOSPITALS IS HIGHLY DESIRED\n\nTHE PAY RANGE FOR THIS ROLE TAKES INTO ACCOUNT THE WIDE RANGE OF FACTORS THAT ARE CONSIDERED IN MAKING COMPENSATION DECISIONS INCLUDING BUT NOT LIMITED TO EXPERIENCE AND TRAINING; SKILL SETS; LICENSURE AND CERTIFICATIONS; AND OTHER BUSINESS AND ORGANIZATIONAL NEEDS. A REASONABLE ESTIMATE OF THE BASE SALARY COMPENSATION IS $135,000. THIS POSITION IS ELIGIBLE FOR DISCRETIONARY COMMISSION-BASED EARNINGS.\n\nWE ALSO OFFER A RANGE OF BENEFITS AND PROGRAMS TO MEET EMPLOYEE NEEDS BASED ON ELIGIBILITY. THESE BENEFITS INCLUDE COMPREHENSIVE HEALTH CARE COVERAGE, A HEALTH SAVINGS ACCOUNT, DISABILITY, AND LIFE INSURANCE, A CRITICAL ILLNESS AND ACCIDENT PLAN, A FLEX SPENDING ACCOUNT (MEDICAL AND DEPENDENT CARE), A 401K PLAN WITH A COMPANY MATCH, MENTAL HEALTH SUPPORT TASKHUMAN, EAP, FINANCIAL COACHING, ROCKET LAWYER, AND MORE. HEARTFLOW OFFERS 12 PAID HOLIDAYS, 15 VACATION DAYS, AND 80 HOURS OF SICK LEAVE.\n\nHEARTFLOW, INC. IS AN EQUAL OPPORTUNITY EMPLOYER. WE ARE COMMITTED TO A WORK ENVIRONMENT THAT SUPPORTS, INSPIRES, AND RESPECTS ALL INDIVIDUALS AND DO NOT DISCRIMINATE AGAINST ANY EMPLOYEE OR APPLICANT BECAUSE OF RACE, COLOR, RELIGION, MARITAL STATUS, AGE, NATIONAL ORIGIN, ANCESTRY, PHYSICAL OR MENTAL DISABILITY, MEDICAL CONDITION, PREGNANCY, GENETIC INFORMATION, GENDER, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, VETERAN STATUS, OR ANY OTHER STATUS PROTECTED UNDER FEDERAL, STATE, OR LOCAL LAW. THIS POLICY APPLIES TO EVERY ASPECT OF EMPLOYMENT AT HEARTFLOW, INCLUDING RECRUITMENT, HIRING, TRAINING, RELOCATION, PROMOTION, AND TERMINATION.\n\nPOSITIONS POSTED FOR HEARTFLOW ARE NOT INTENDED FOR OR OPEN TO THIRD PARTY RECRUITERS / AGENCIES. SUBMISSION OF ANY UNSOLICITED RESUMES FOR THESE POSITIONS WILL BE CONSIDERED TO BE FREE REFERRALS.\n\nUS LOCATIONS ONLY: ALL EMPLOYEES AND CONTINGENT WORKERS (CONTRACTOR, CONSULTANT, INTERNS OR TEMPORARY PERSONNEL) ARE REQUIRED TO BE VACCINATED AGAINST SARS-COV-2 AS RECOMMENDED BY CDC, UNLESS A REASONABLE ACCOMMODATION IS APPROVED. ALL PROSPECTIVE HIRES WILL BE EXPECTED TO PROVIDE PROOF OF VACCINATION ON THEIR FIRST DAY OF EMPLOYMENT.\n\n",
    "job_skill_set": [
      "sales",
      "account development",
      "project management",
      "business development",
      "cross-functional collaboration",
      "communication",
      "relationship building",
      "problem solving",
      "self-motivation",
      "work ethic",
      "teamwork",
      "customer focus",
      "adaptability",
      "clinical proficiency",
      "customer education",
      "medical technology explanation",
      "CRM software (Salesforce.com)",
      "cardiac patient pathways knowledge"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "building",
      "business",
      "businessdevelopment",
      "cardiac",
      "cardiology",
      "clinical",
      "collaboration",
      "communication",
      "crm",
      "crossfunctional",
      "customer",
      "development",
      "education",
      "ethic",
      "explanation",
      "focus",
      "knowledge",
      "management",
      "medical",
      "pathways",
      "patient",
      "problem",
      "proficiency",
      "project",
      "relationship",
      "representative",
      "sales",
      "salesforcecom",
      "selfmotivation",
      "software",
      "solving",
      "teamwork",
      "technology",
      "work"
    ]
  },
  {
    "job_id": "3906071645",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "GROWING DATA ANALYTICS AND MARKETING COMPANY IN THE CANNABIS SPACE IS ADDING TO IT'S TEAM. THE IDEAL CANDIDATE WILL CULTIVATE RELATIONSHIPS WITH PROSPECTIVE CLIENTS IN ORDER TO CATALYZE BUSINESS DEVELOPMENT SUCCESS.THIS INDIVIDUAL WILL SCHEDULE MEETINGS WITH PROSPECTS AND CLIENTS IN ORDER TO UNDERSTAND THEIR NEEDS. THEY WILL ALSO WORK CLOSELY WITH SALES AND MARKETING TEAMS TO UNCOVER NEW LEADS.\nMUST HAVES: \nYOU MUST HAVE SAAS BASED BDR EXPERIENCE, SELLING A PLATFORM, NOT A PRODUCTYOU MUST HAVE A HISTORY OF MAKING 50+ COLD DIALS AND 50+ COLD EMAILS PER DAYYOU MUST BE COMFORTABLE SELLING A NEW PRODUCT THAT'S GOING TO MARKET AND ISN'T YET A HOUSEHOLD NAME\nALL CANDIDATES MUST BE LOCATED IN THE UNITED STATES, COMPANY IS UNABLE TO PROVIDE VISA SPONSORSHIP. THIS IS A 100% REMOTE ROLE WITH UNCAPPED COMMISSION. \nRESPONSIBILITIES\nGENERATE APPOINTMENTS BY MEANS OF PROACTIVE OUTBOUND PROSPECTINGWORK DIRECTLY WITH SALES AND MARKETING TO DISCOVER OPPORTUNITIES FROM LEADSDEMONSTRATE AND TEACH STRONG SELLING AND INFLUENCING SKILLSPROSPECTING: IDENTIFY AND RESEARCH POTENTIAL CUSTOMERS OR BUSINESS OPPORTUNITIES THROUGH VARIOUS CHANNELS SUCH AS ONLINE RESEARCH, COLD CALLING, EMAIL OUTREACH, AND NETWORKING EVENTS.LEAD GENERATION: GENERATE LEADS AND INITIATE CONTACT WITH DECISION-MAKERS OR KEY STAKEHOLDERS WITHIN TARGET ACCOUNTS TO CREATE INTEREST IN THE COMPANY'S PRODUCTS OR SERVICES.QUALIFICATION: QUALIFY LEADS BY UNDERSTANDING THEIR NEEDS, PAIN POINTS, AND BUYING BEHAVIORS TO DETERMINE THEIR FIT FOR THE COMPANY'S OFFERINGS.APPOINTMENT SETTING: SCHEDULE MEETINGS, PRODUCT DEMONSTRATIONS, OR FOLLOW-UP CALLS BETWEEN QUALIFIED LEADS AND THE SALES TEAM TO FURTHER PROGRESS OPPORTUNITIES THROUGH THE SALES PIPELINE.RELATIONSHIP BUILDING: BUILD AND MAINTAIN STRONG RELATIONSHIPS WITH PROSPECTS AND CLIENTS THROUGH ONGOING COMMUNICATION AND ENGAGEMENT TO NURTURE LEADS AND FACILITATE THE SALES PROCESS.MAKE 50+ DIALS PER DAY, 50+ EMAILS PER DAY, NO FEAR OF THE PHONE AND COLD OUTREACH\nQUALIFICATIONS\nASSOCIATES OR BACHELOR'S DEGREE OR EQUIVALENT EXPERIENCE2-3+ YEARS' OF EXPERIENCE IN RELATED ROLESTRONG COMMUNICATION AND TIME MANAGEMENT SKILLSMUST BE COMFORTABLE COLD CALLING PROSPECTS AT A HIGH LEVEL OF ACTIVITY, A \"HUNTER MENTALITY\"MAKE 50+ DIALS PER DAY, 50+ EMAILS PER DAY, NO FEAR OF THE PHONE AND COLD OUTREACHMUST LIVE IN THE UNITED STATES",
    "job_skill_set": [
      "lead generation",
      "email outreach",
      "sales pipeline management",
      "relationship building",
      "communication tools",
      "communication",
      "time management",
      "problem solving",
      "influencing skills",
      "teamwork",
      "adaptability",
      "self-motivation",
      "negotiation",
      "networking",
      "SaaS",
      "cold calling",
      "appointment setting",
      "product demonstration",
      "online research"
    ],
    "short_keywords": [
      "adaptability",
      "appointment",
      "building",
      "business",
      "businessdevelopment",
      "calling",
      "cold",
      "communication",
      "demonstration",
      "development",
      "email",
      "generation",
      "influencing",
      "lead",
      "management",
      "negotiation",
      "networking",
      "online",
      "outreach",
      "pipeline",
      "problem",
      "product",
      "relationship",
      "representative",
      "research",
      "saas",
      "sales",
      "selfmotivation",
      "setting",
      "skills",
      "solving",
      "teamwork",
      "time",
      "tools"
    ]
  },
  {
    "job_id": "3894606769",
    "job_title": "Community Outreach Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ABOUT SCAN\n\nSCAN GROUP IS A NOT-FOR-PROFIT ORGANIZATION DEDICATED TO TACKLING THE MOST PRESSING ISSUES FACING OLDER ADULTS IN THE UNITED STATES. SCAN GROUP IS THE SOLE CORPORATE MEMBER OF SCAN HEALTH PLAN, ONE OF THE NATION’S LEADING NOT-FOR-PROFIT MEDICARE ADVANTAGE PLANS, SERVING MORE THAN 270,000 MEMBERS IN CALIFORNIA, ARIZONA, NEVADA, TEXAS AND NEW MEXICO. SCAN HAS BEEN A MISSION-DRIVEN ORGANIZATION DEDICATED TO KEEPING SENIORS HEALTHY AND INDEPENDENT FOR MORE THAN 40 YEARS AND IS KNOWN THROUGHOUT THE HEALTHCARE INDUSTRY AND NATIONALLY AS A LEADING EXPERT IN SENIOR HEALTHCARE. SCAN EMPLOYEES ARE A GROUP OF TALENTED, PASSIONATE PROFESSIONALS WHO ARE COMMITTED TO SUPPORTING OLDER ADULTS ON THEIR AGING JOURNEY, WHILE ALSO INNOVATING HEALTHCARE FOR SENIORS EVERYWHERE. EMPLOYEES ARE PROVIDED IN-DEPTH TRAINING AND ACCESS TO STATE-OF-THE-ART TOOLS NECESSARY TO DO THEIR JOBS, AS WELL AS DEVELOPMENT AND GROWTH OPPORTUNITIES. SCAN TAKES GREAT PRIDE IN RECOGNIZING OUR TEAM MEMBERS AS EXPERTS IN THEIR FIELDS AND REWARDING THEM FOR THEIR EFFORTS. IF YOU ARE INTERESTED IN BECOMING PART OF AN ORGANIZATION THAT IS INNOVATING SENIOR HEALTHCARE VISIT WWW.THESCANGROUP.ORG, WWW.SCANHEALTHPLAN.COM, OR FOLLOW US ON LINKEDIN, FACEBOOK, AND TWITTER.\n\nTHE JOB\n\nTHE ROLE OF A BUSINESS DEVELOPMENT MANAGER (AKA COMMUNITY OUTREACH BUSINESS DEVELOPMENT MANAGER) EMPHASIZES CLOSE COLLABORATION WITH THE DIRECTOR OF SALES PERFORMANCE AND OTHER SALES LEADERS. THIS POSITION ENGAGES WITH CENTERS OF INFLUENCE TO OBTAIN REFERRALS AND CONTRIBUTES TO MEMBERSHIP GROWTH THROUGH THE DEVELOPMENT OF LOCAL AREA AND COMMUNITY-BASED MARKETING. THE ROLE INVOLVES STRATEGIC NETWORKING IN A DEFINED TERRITORY AND REQUIRES SOME LOCAL TRAVEL FOR EVENTS. ADDITIONALLY, THE RESPONSIBILITIES OF COMMUNITY OUTREACH BUSINESS DEVELOPMENT MANAGER INCLUDE IMPLEMENTING TOP-DOWN INITIATIVES, PLANNING AND EXECUTING COMMUNITY EVENTS, AND WORKING CLOSELY WITH THE SALES TEAM TO TRACK LEAD CONVERSION AND ROI FOR ACTIVITIES. THE PERFORMANCE OF COMMUNITY OUTREACH BUSINESS DEVELOPMENT MANAGER IS MEASURED BASED ON LEAD AND SALES GOALS, ADHERENCE TO OPERATIONAL PROCESSES, AND SUCCESSFUL COLLABORATION WITH THE SALES TEAM.\n\nYOU WILL\n\nTHE ROLE OF A BUSINESS DEVELOPMENT MANAGER (AKA COMMUNITY OUTREACH BUSINESS DEVELOPMENT MANAGER) WILL PARTNER WITH ALL SALES LEADERS ACROSS ALL SALES CHANNELS TO ENSURE A CONTINUAL PIPELINE TO MEET ASSIGNED SALES/MEMBERSHIP GROWTH TARGETS.\n\nBUILD AND STRENGTHEN RELATIONSHIPS WITHIN THE LOCAL COMMUNITY TO INCLUDE LOCAL POLITICIANS, SENIOR CENTERS, PROVIDERS, AND OTHER CENTERS OF INFLUENCE. COORDINATE COMMUNITY MEETINGS AND EVENTS IN LOCAL MARKETS. REPRESENTING AT COMMUNITY/EMPLOYER/COMPANY-SPONSORED EVENTS TO PROMOTE THE COMPANY, RAISE AWARENESS, AND GENERATE LEADS AND RESULTING SALES.\n\nMAINTAINING CONSISTENT AND EFFECTIVE COMMUNICATION WITH EXTERNAL STAKEHOLDERS, ELECTED OFFICIALS, COUNTY AND COMMUNITY-BASED PROGRAMS AND ANY GROWTH OPPORTUNITIES.\n\nACHIEVE ASSIGNED SALES/MEMBERSHIP GROWTH TARGETS. TRACKING LEAD AND SALES CONVERSIONS.\n\nDEVELOP, IMPLEMENT, AND MONITOR PLANS FOCUSED ON LEAD GENERATION. GENERATING QUALIFIED LEADS THAT CONVERT INTO MEMBERS.\n\nHELP BUILD AND ADVANCE OUR BRAND AND VALUE PROPOSITIONS.\n\nANALYZES MAJOR COMPETITOR STRATEGIES. IDENTIFIES AND MONITORS CHANGING PATTERNS OF COMPETITION AND RECOMMENDS RESPONSES.\n\nCREATES BUSINESS CASES AND/OR OBTAINS RESOURCES (PEOPLE, FUNDING, MATERIAL, SUPPORT) BUSINESS INFORMATION NEEDS AND STRATEGIC INITIATIVES.\n\nADHERING TO THE HIGHEST LEVEL OF COMPLIANCE EXPECTATIONS.\n\nMEETING EXPECTED USE OF THE CUSTOMER RELATIONSHIP MANAGEMENT SYSTEM.\n\nADHERING TO ALL SALES OPERATIONS PROCESSES.\n\nKNOWING ALL ELEMENTS OF THE PRODUCT PORTFOLIO AND ASSOCIATED ELIGIBILITY GUIDELINES FOR VARIOUS ELECTION PERIODS.\n\nACTIVELY SUPPORT THE ACHIEVEMENT OF SCAN’S VISION AND GOALS.\n\nOTHER DUTIES AS ASSIGNED.\n\nYOUR QUALIFICATIONS\n\nHIGH SCHOOL DIPLOMA/GED; BACHELOR’S DEGREE.A COMPARABLE COMBINATION OF EDUCATION/EXPERIENCE AND/OR TRAINING WILL BE CONSIDERED EQUIVALENT TO THE EDUCATION LISTED ABOVE. 3+ YEARS’ PREVIOUS OUTSIDE SALES OR OUTREACH EXPERIENCE WITHIN THE MEDICARE COMMUNITY.5+ YEARS’ EXPERIENCE IN A COORDINATOR ROLE SUPPORTING SALES TEAM, PREVIOUS OUTSIDE SALES, OR OUTREACH EXPERIENCE WITHIN THE MEDICARE COMMUNITY; OR ANY COMBINATION OF EDUCATION, WHICH WOULD PROVIDE AN EQUIVALENT BACKGROUND.3+ YEARS’ EXPERIENCE WITH MS OFFICE - EXCEL (DATA INPUT, REPORTING, FORMULAS), WORD (CREATING DOCUMENTS, MEMO, SPELL CHECK), AND POWER POINT (DEVELOPING PRESENTATIONS AND MARKETING MATERIAL).MUST BE WILLING TO WORK SOME NIGHTS AND WEEKENDS.MEDICARE EXPERIENCE STRONGLY PREFERRED.EXPERIENCE IN BUSINESS/PRODUCT NETWORK DEVELOPMENT AND/ OR MARKETING EXPERIENCE.KNOWLEDGE OF HIPAA REGULATIONS AND PRIVACY LAWS.COMMUNICATE EFFECTIVELY AND PROFESSIONALLY.DELIVER PRESENTATIONS TO LEADERSHIP GROUPS, AND TEAM IN A COHESIVE, CONSISTENT MANNERCREATIVE SOLUTIONING SKILLS.CRITICAL THINKING.DECISION MAKING.DEMONSTRATED EXPERIENCE WORKING IN FAST-PACED OR IMPLEMENTATION ENVIRONMENT.TRAVEL 50+% OF THE TIME AND OUT OF TOWN TRAVEL- MUST HAVE A VALID DRIVER’S LICENSE, AUTOMOBILE INSURANCE AND RELIABLE TRANSPORTATION.\n\nWHAT'S IN IT FOR YOU?\n\nBASE SALARY RANGE: $92,400.00 TO $147,800.00 PER YEARWORK MODE: MOSTLY REMOTEAN ANNUAL EMPLOYEE BONUS PROGRAMROBUST WELLNESS PROGRAMGENEROUS PAID-TIME-OFF (PTO)ELEVEN PAID HOLIDAYS PER YEAR, PLUS 1 FLOATING HOLIDAY, PLUS 1 BIRTHDAY HOLIDAYEXCELLENT 401(K) RETIREMENT SAVING PLAN WITH EMPLOYER MATCH AND CONTRIBUTIONROBUST EMPLOYEE RECOGNITION PROGRAMTUITION REIMBURSEMENTAN OPPORTUNITY TO BECOME PART OF A TEAM THAT MAKES A DIFFERENCE TO OUR MEMBERS AND OUR COMMUNITY EVERY DAY!Y\n\nWE'RE ALWAYS LOOKING FOR TALENTED PEOPLE TO JOIN OUR TEAM! QUALIFIED APPLICANTS ARE ENCOURAGED TO APPLY NOW!\n\nAT SCAN WE BELIEVE THAT IT IS OUR BUSINESS TO IMPROVE THE STATE OF OUR WORLD. EACH OF US HAS A RESPONSIBILITY TO DRIVE EQUALITY IN OUR COMMUNITIES AND WORKPLACES. WE ARE COMMITTED TO CREATING A WORKFORCE THAT REFLECTS OUR COMMUNITY THROUGH INCLUSIVE PROGRAMS AND INITIATIVES SUCH AS EQUAL PAY, EMPLOYEE RESOURCE GROUPS, INCLUSIVE BENEFITS, AND MORE.\n\nSCAN IS PROUD TO BE AN EQUAL EMPLOYMENT OPPORTUNITY AND AFFIRMATIVE ACTION WORKPLACE. INDIVIDUALS SEEKING EMPLOYMENT WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, NATIONAL ORIGIN, RELIGION, AGE, SEX (INCLUDING PREGNANCY, CHILDBIRTH OR RELATED MEDICAL CONDITIONS), SEXUAL ORIENTATION, GENDER PERCEPTION OR IDENTITY, AGE, MARITAL STATUS, DISABILITY, PROTECTED VETERAN STATUS OR ANY OTHER STATUS PROTECTED BY LAW. A BACKGROUND CHECK IS REQUIRED.\n\n",
    "job_skill_set": [
      "sales",
      "community outreach",
      "lead generation",
      "data analysis",
      "marketing",
      "HIPAA knowledge",
      "presentation skills",
      "business development",
      "communication",
      "relationship building",
      "critical thinking",
      "problem solving",
      "team collaboration",
      "decision making",
      "creativity",
      "adaptability",
      "MS Office",
      "CRM systems"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "building",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "community",
      "creativity",
      "critical",
      "crm",
      "data",
      "decision",
      "development",
      "generation",
      "hipaa",
      "knowledge",
      "lead",
      "making",
      "manager",
      "marketing",
      "ms",
      "office",
      "outreach",
      "presentation",
      "problem",
      "relationship",
      "sales",
      "skills",
      "solving",
      "systems",
      "team",
      "thinking"
    ]
  },
  {
    "job_id": "3895543404",
    "job_title": "Business Development Manager - Utility Billing Software - Remote",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "OVERVIEW:\n\nCOMPANY OVERVIEW\n\nAS THE NATION'S LARGEST PRODUCER OF CLEAN, CARBON-FREE ENERGY, CONSTELLATION IS A COMPANY PURPOSELY-BUILT TO MEET THE CHALLENGES OF THE CLIMATE CRISIS. CONSTELLATION HAS BEEN THE LEADER IN CLEAN ENERGY PRODUCTION FOR MORE THAN A DECADE AND WE ARE GROWING OUR COMPANY AND CAPABILITIES. NOW, WE'RE ACCELERATING, SPEEDING OUR LOW-CARBON OR NO-CARBON POWER TO MORE PEOPLE IN MORE PLACES, DAY AND NIGHT, PROVIDING OUR CUSTOMERS AND COMMUNITIES WITH OPTIONS TO BUY, MANAGE AND USE ENERGY AS PART OF THEIR DECARBONIZATION MISSION. THE RACE IS ON TO CONFRONT THE CLIMATE CRISIS AND CONSTELLATION IS READY TO MEET THE CHALLENGE. COME JOIN US AS WE LEAD ENERGY, TOGETHER.\n\nTOTAL REWARDS\n\nCONSTELLATION OFFERS A WIDE RANGE OF BENEFITS AND REWARDS, DESIGNED TO HELP OUR EMPLOYEES THRIVE PROFESSIONALLY AND PERSONALLY. IN ADDITION TO HIGHLY COMPETITIVE SALARIES, WE OFFER A BONUS PROGRAM, 401(K) WITH COMPANY MATCH, EMPLOYEE STOCK PURCHASE PROGRAM; COMPREHENSIVE MEDICAL, DENTAL AND VISION BENEFITS, INCLUDING A ROBUST WELLNESS PROGRAM; PAID TIME OFF FOR VACATION, HOLIDAYS AND SICK DAYS; AND MUCH MORE.\n\nEXPECTED SALARY RANGE OF $89,100 TO $99,000, VARIES BASED ON EXPERIENCE, ALONG WITH COMPREHENSIVE BENEFITS PACKAGE THAT INCLUDES BONUS AND 401(K).\n\nRESPONSIBILITIES:\n\nLOCATION\n\nTHIS IS A REMOTE POSITION. OCCASIONAL TRAVEL IS REQUIRED, TO ATTEND CUSTOMER-SITE AND IN-OFFICE MEETINGS AS REQUIRED. CANDIDATES MUST RESIDE IN THE UNITED STATES.\n\nPRIMARY PURPOSE OF POSITION\n\nTHIS SALES PROFESSIONAL WILL BE RESPONSIBLE FOR PROSPECTING, DEVELOPING RELATIONSHIPS WITH CUSTOMERS AND ACQUIRING NEW BUSINESS.\n\nPRIMARY DUTIES AND ACCOUNTABILITIES\n\nABILITY TO IDENTIFY, PROSPECT AND CONTACT HIGH-LEVEL DECISION MAKERS IN RESPECTIVE BUSINESSES AND CULTIVATE CLIENT RELATIONSHIPS WITH RESPECTIVE FORTUNE 500 COMPANIES.\n\nPROACTIVELY MANAGE A PIPELINE OF CUSTOMER ACTIVITIES IN ORDER TO ACHIEVE FINANCIAL TARGETS.\n\nUNDERSTAND CUSTOMERS BUSINESS OBJECTIVES AND CURRENT CHALLENGES AS THEY RELATE TO UTILITY EXPENSE MANAGEMENT, AND PROVIDE SOLUTIONS TO MATCH THE CUSTOMER'S NEEDS.\n\nOUTSTANDING COMMUNICATION SKILLS WITH THE ABILITY TO SPEAK IN FRONT OF GROUPS AND C-LEVEL EXECUTIVES AND SENIOR DECISION MAKERS.\n\nMINIMUM QUALIFICATIONS\n\nBACHELORS DEGREE OR HIGHER IN BUSINESS (SALES, MARKETING, FINANCE OR ENGINEERING)\n\nAT LEAST 5 YEARS OF EXPERIENCE IN MARKETING AND/OR BUSINESS-TO-BUSINESS SALES.\n\nEXPERIENCE WITH AND HAVE SENIOR LEVEL CONTACTS AT BUSINESSES.\n\nEXPERIENCE PRESENTING AND CLOSING HIGH-LEVEL FORTUNE 500 CUSTOMERS\n\nEXCELLENT ORGANIZATION AND COMMUNICATION SKILLS, THE ABILITY TO MULTI-TASK AND SHIFT PRIORITIES AS NEEDED\n\nPROFICIENCY WITH MS OFFICE SUITE AND EXPERIENCE USING DATABASES\n\nALL CANDIDATES MUST HAVE THE ABILITY TO SPEAK, READ AND WRITE ENGLISH.\n\nQUALIFICATIONS:\n\nPREFERRED QUALIFICATIONS\n\nUTILITY BILL MANAGEMENT EXPERIENCE, ENERGY OR SOFTWARE SALES EXPERIENCE PREFERRED\n\nCANDIDATE MUST BE A SELF-STARTER AND BE ABLE TO WORK INDEPENDENTLY AND REMOTELY.\n\nCANDIDATE MUST HAVE ACCESS TO A HOME OFFICE AS THERE WILL BE NO REGIONAL FIELD OFFICE.",
    "job_skill_set": [
      "business development",
      "sales",
      "marketing",
      "finance",
      "MS Office Suite",
      "databases",
      "customer relationship management",
      "prospecting",
      "presentation skills",
      "closing sales",
      "communication",
      "organization",
      "multi-tasking",
      "independence",
      "relationship building",
      "problem solving",
      "utility billing software",
      "engineering"
    ],
    "short_keywords": [
      "billing",
      "building",
      "business",
      "businessdevelopment",
      "closing",
      "communication",
      "customer",
      "databases",
      "development",
      "engineering",
      "finance",
      "independence",
      "management",
      "manager",
      "marketing",
      "ms",
      "multitasking",
      "office",
      "organization",
      "presentation",
      "problem",
      "prospecting",
      "relationship",
      "remote",
      "sales",
      "skills",
      "software",
      "solving",
      "suite",
      "utility"
    ]
  },
  {
    "job_id": "3905867420",
    "job_title": "Director Of Business Development",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "COMPANY DESCRIPTIONSABAI GLOBAL, ALONG WITH ITS SUBSIDIARIES CBS (IBC), CASTLE IRB, ALPHA IRB, AND SHIELD CONSULTING, IS A SPECIALIZED CLINICAL RESEARCH FIRM SPECIALIZING IN IRB, IBC AND CONSULTING SOLUTIONS FOR THE LIFE SCIENCE INDUSTRY.\nROLE DESCRIPTIONTHIS IS A FULL-TIME REMOTE ROLE FOR A DIRECTOR OF BUSINESS DEVELOPMENT. THE DIRECTOR OF BUSINESS DEVELOPMENT WILL BE RESPONSIBLE FOR DAY-TO-DAY TASKS ASSOCIATED WITH NEW BUSINESS DEVELOPMENT, BUSINESS PLANNING, LEAD GENERATION, CONTRACT NEGOTIATION, CRM AND ACCOUNT MANAGEMENT.\nAS PART OF OUR TEAM, YOUR MAIN RESPONSIBILITIES WILL BE:USING STRATEGIC PROSPECTING TECHNIQUES TO HELP IDENTIFY NEW ACCOUNTS / OPPORTUNITIES.CREATING AND MANAGING A SALES PIPELINE TO MEET AND EXCEED GOALS.WORK CLOSELY WITH LEADERSHIP TO DEVELOP AND IMPLEMENT SALES STRATEGIES.INTERACTING WITH ALL INTERNAL BUSINESS DIVISIONS REGARDING PROPOSALS, CONTRACTS, TIMELINES ETC.BUILD RELATIONSHIPS AND SUPPORT CUSTOMERS WITH THE USE OF SABAI’S RESOURCES.DEVELOP ACCOUNT PLANS USING CUSTOMER'S ORGANIZATIONAL STRUCTURE, BUSINESS STRATEGIES, OBJECTIVES, ETC.PRESENT PROPOSALS AND CONTRACTS WITH SOLUTIONS, JUSTIFICATIONS, AND EXPECTED RESULTS TO OVERCOME OBJECTIONS TO SECURE NEW BUSINESS.NETWORKING WITH PEOPLE AT ALL LEVELS WITHIN TARGETED CUSTOMER / PROSPECT ORGANIZATIONS TO NAVIGATE COMPETITIVE ENVIRONMENTS AND BUILD CONSENSUS.TIMELY UPDATING AND MANAGEMENT OF COMPANY CRM TOOL.PREPARE AND ORGANIZE CLIENT PRESENTATIONS. PLAN AND ATTEND INDUSTRIAL EVENTS AND TRADESHOWS.TRAVEL IS REQUIRED.REQUIREMENTS:MINIMUM OF 5 YEARS BUSINESS DEVELOPMENT EXPERIENCE IN CLINICAL RESEARCH BUSINESS DEVELOPMENT WITH A DEMONSTRABLE TRACK RECORD OF CONSISTENTLY MEETING AND EXCEEDING GOALSIRB / IBC EXPERIENCE IS STRONGLY PREFERRED.A BACHELOR’S DEGREE IN A RELATED FIELD, MASTER’S DEGREE PREFERRED. EXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLSSTRONG TIME MANAGEMENT AND ORGANIZATIONAL SKILLSABILITY TO SUCCESSFULLY WORK INDEPENDENTLY AND WITHIN A TEAM ENVIRONMENT.OUTSTANDING NETWORKING SKILLS: DEMONSTRATED ABILITY TO SEEK OUT AND BUILD RELATIONSHIPS. ABILITY TO COMMUNICATE EFFECTIVELY AT SENIOR MANAGEMENT LEVEL.HUNTER MENTALITYDETAIL-ORIENTEDSTRATEGIC THINKER ",
    "job_skill_set": [
      "business development",
      "contract negotiation",
      "sales strategies",
      "lead generation",
      "account management",
      "client presentations",
      "strategic prospecting",
      "sales pipeline management",
      "communication",
      "time management",
      "organizational skills",
      "teamwork",
      "networking",
      "relationship building",
      "independence",
      "detail-oriented",
      "strategic thinking",
      "problem solving",
      "CRM",
      "clinical research",
      "IRB",
      "IBC"
    ],
    "short_keywords": [
      "account",
      "building",
      "business",
      "businessdevelopment",
      "client",
      "clinical",
      "communication",
      "contract",
      "crm",
      "detailoriented",
      "development",
      "director",
      "generation",
      "ibc",
      "independence",
      "irb",
      "lead",
      "management",
      "negotiation",
      "networking",
      "of",
      "organizational",
      "pipeline",
      "presentations",
      "problem",
      "prospecting",
      "relationship",
      "research",
      "sales",
      "skills",
      "solving",
      "strategic",
      "strategies",
      "teamwork",
      "thinking",
      "time"
    ]
  },
  {
    "job_id": "3886824680",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "WHO ARE MILLBOARD?\n\nMILLBOARD IS A PREMIUM DECKING AND CLADDING SOLUTIONS MANUFACTURER WITH AN EXPANDING INTERNATIONAL PRESENCE IN THE US, UK, FRANCE AND GERMANY WITH OUR PRODUCT BEING ENJOYED BY SATISFIED CUSTOMERS WORLDWIDE. WE PASSIONATELY BELIEVE OUR “LIVE. LIFE. OUTSIDE.” VALUE PROPOSITION IS THE BEST IN THE WORLD - AND IS REINFORCED BY A UNIQUE AND PATENTED TECHNOLOGY THAT IS POSITIVELY DISRUPTING AND RESONATING IN THE MARKET. INSPIRED BY NATURE BUT DESIGNED TO OUTPERFORM OTHERS IN TERMS OF LOOK AND FEEL, LONG-TERM DURABILITY, AND COST OF OWNERSHIP, MILLBOARD’S PORTFOLIO IS TRULY UNIQUE. \nWE HAVE A GENUINELY TEAM-FOCUSED CULTURE THAT EMPOWERS US ALL TO SUCCEED TOGETHER – JOIN ONE OF THE FASTEST GROWING AND MOST INNOVATIVE COMPANIES TO BE PART OF A DYNAMIC AND SUPPORTIVE ENVIRONMENT THAT OFFERS A HOST OF GENEROUS BENEFITS FOR PEOPLE WHO WANT TO BE THE BEST THEY CAN BE. \n\nWHAT’S THE ROLE?\n\nAS PART OF OUR GROWING SALES FUNCTION IN THE USA THE BUSINESS DEVELOPMENT MANAGER WILL BE INSTRUMENTAL IN MAXIMISING SALES THROUGH DEVELOPING AND MAINTAINING STABLE BUSINESS RELATIONSHIPS IN YOUR ASSIGNED REGION THROUGH FACE TO FACE CONTACT AND SELLING.\nTHIS IS A MASSIVE OPPORTUNITY FOR YOU - SELLING A PREMIUM AND HIGHLY REGARDED PRODUCT THAT HAS UNRIVALLED PRODUCT QUALITY, CRAFTMANSHIP, CUSTOMER CARE AND A STRONG REPUTATION. YOU WILL BE WELL SUPPORTED BOTH DOMESTICALLY AND FROM THE UK HEAD OFFICE WITH MARKETING, LEAD GENERATION AND ANYTHING ELSE YOU NEED TO HELP YOU SUCCEED.\nYOU’LL BE BUILDING SOLID AND PROFITABLE BUSINESS RELATIONSHIPS WITH DISTRIBUTORS, MERCHANTS, STOCKISTS, SPECIFIERS AND A WIDE RANGE OF OTHER SALES CHANNELS, SPENDING THE MAJORITY OF YOUR TIME ON THE ROAD VISITING POTENTIAL CLIENTS.\nTHIS ROLE WILL ENTAIL EXTENSIVE TRAVEL, BEING ON THE ROAD 9 DAYS OUT OF 10 AND WILL INCLUDE OVERNIGHT STAYS.\n\nKEY RESPONSIBILITIES:\n\nBUILD AND DEVELOP BUSINESS RELATIONSHIPS WHILST UPHOLDING BRAND REPUTATIONWORK WITHIN THE REGIONAL TEAM TO HIT AND OVERACHIEVE REGIONAL SALES TARGETSVISITING TOP DISTRIBUTORS AND GENERAL RESELLERS TO BUILD SALES RELATIONSHIPS, MANAGING APPROPRIATE MERCHANDISING AND PRODUCT TRAINING STAFFVISIT CONTRACTORS AND DEVELOPERS ON SITE TO HELP WITH BEST PRACTICE FOR INSTALLATIONSPRESENTING TECHNICAL INFORMATION AND SOLUTIONS TO ARCHITECTS / CONTRACTORS, AND SUPPORTING NEGOTIATION WHERE APPROPRIATEWORKING WITH LEAD GENERATION, INTERNAL SALES AND PROJECTS TEAMS TO OPTIMISE REGIONAL SALESCONDUCT ANNUAL REVIEWS FOR APPROVED INSTALLERSCONTINUALLY DEVELOP INDUSTRY KNOWLEDGE, REGULATIONS NEEDED AND KNOW-HOWWORK WITH MARKETING TO MAXIMISE POTENTIAL AND GAIN MARKET INSIGHTCOMPLETE DAILY KPI REPORTS AND VISIT FEEDBACK ON TIMEWORK WITH EXTERNAL SALES SUPPORT TO MANAGE YOUR CALENDAR AND BOOK APPOINTMENTS WITH CLIENTSALL OTHER DUTIES AS ASSIGNED\n\nYOUR BACKGROUND AND EXPERIENCE:\n\nPREVIOUS EXPERIENCE OF FACE-TO-FACE SELLING / PRESENTING IS REQUIREDPREVIOUS EXPERIENCE IN CONSTRUCTION MATERIALS AND WORKING WITH DISTRIBUTION / BUILDERS MERCHANTS IS HIGHLY PREFERREDPREVIOUS EXPERIENCE IN WORKING IN SPECIFICATION SALES IS HIGHLY PREFERREDSALES TARGET AND CUSTOMER CENTRIC DRIVENPRACTICAL KNOWLEDGE & UNDERSTANDING OF CONSTRUCTION PROCESSES WOULD BE AN ADVANTAGEABLE TO BUILD RELATIONSHIP WITH CLIENTS BUT BE FIRM WHEN NEEDEDOPEN AND HONEST ATTITUDE TO ALLHUNGRY, HUMBLE AND SMART (SEE PATRICK LENCIONI)WILLING TO LEARN AND DEVELOP, WITH A SELF-STARTER MIND-SET AND AN ENTHUSIASTIC ‘CAN DO’ ATTITUDEPROVEN ABILITY OF MEETING AND EXCEEDING INTERNAL AND EXTERNAL STAKEHOLDER REQUIREMENTS AND ABLE TO DEMONSTRATE THE ABILITY TO ACHIEVE OBJECTIVES AND EXCEED EXPECTATIONSABILITY TO ADAPT AND RESPOND TO CHANGESELF-MOTIVATED WITH INITIATIVE TO CONTINUE IMPROVEMENT THROUGH COMMUNICATION AND TEAMWORK\n\nWHAT’S IN IT FOR YOU?\n\nWHEN YOU JOIN MILLBOARD YOU’LL BE JOINING AN ORGANISATION THAT LIVES AND THRIVES BY ITS VALUES, AND WILL GIVE YOU EVERY OPPORTUNITY TO BE THE BEST YOU CAN BE. YOU’LL BE SURROUNDED BY LIKE-MINDED PEOPLE WHO ARE ALL PASSIONATE, SUPPORTIVE AND DEDICATED TO THEIR CRAFT. AS WELL AS OUR AMAZING CULTURE WE ALSO OFFER A HOST OF GENEROUS BENEFITS SUCH AS HEALTHCARE, 401K, COMMISSION. \n\nWE LOOK FORWARD TO YOUR APPLICATION!",
    "job_skill_set": [
      "face-to-face selling",
      "sales target achievement",
      "product training",
      "technical presentation",
      "lead generation",
      "relationship management",
      "communication",
      "teamwork",
      "self-motivation",
      "adaptability",
      "customer-centric approach",
      "problem-solving",
      "initiative",
      "honesty",
      "enthusiasm",
      "willingness to learn",
      "construction materials knowledge",
      "specification sales",
      "KPI reporting",
      "market insight analysis"
    ],
    "short_keywords": [
      "achievement",
      "adaptability",
      "analysis",
      "approach",
      "business",
      "businessdevelopment",
      "communication",
      "construction",
      "customercentric",
      "development",
      "enthusiasm",
      "facetoface",
      "generation",
      "honesty",
      "initiative",
      "insight",
      "knowledge",
      "kpi",
      "lead",
      "learn",
      "management",
      "manager",
      "market",
      "materials",
      "presentation",
      "problemsolving",
      "product",
      "relationship",
      "reporting",
      "sales",
      "selfmotivation",
      "selling",
      "specification",
      "target",
      "teamwork",
      "technical",
      "to",
      "training",
      "willingness"
    ]
  },
  {
    "job_id": "3901351059",
    "job_title": "Business Development Specialist",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "WE ARE LOOKING FOR SOMEONE WHO CAN EXECUTE! CAN YOU TYPE FAST? CAN YOU COLD CALL?CAN YOU EMAIL QUICKLY?CAN YOU SCHEDULE MEETINGS?ARE YOU LOOKING FOR A ROLE THAT IS PART TIME AND OFFERS FLEXIBLE HOURS? 5-15 HOURS A WEEKARE YOU LOOKING FOR A REMOTE ROLE?DO YOU HAVE A POSITIVE OUTLOOK ON LIFE?\nIF SO, APPLY NOW AND THE CEO WILL REVIEW YOUR APPLICATION. \nNO KNOWLEDGE OF BITCOIN, CRYPTOCURRENCY, OR BLOCKCHAIN TECHNOLOGY IS REQUIRED.",
    "job_skill_set": [
      "cold calling",
      "email communication",
      "scheduling",
      "positive outlook",
      "flexibility",
      "typing",
      "remote work"
    ],
    "short_keywords": [
      "business",
      "businessdevelopment",
      "calling",
      "cold",
      "communication",
      "development",
      "email",
      "flexibility",
      "outlook",
      "positive",
      "remote",
      "scheduling",
      "specialist",
      "typing",
      "work"
    ]
  },
  {
    "job_id": "3904086122",
    "job_title": "Sr. Business Development Manager, Amazon Air",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "DESCRIPTION\n\nAMAZON AIR IS LOOKING FOR A SENIOR BUSINESS DEVELOPMENT MANAGER TO OWN AND MANAGE THE EXECUTION OF CROSS-FUNCTIONAL COMMERCIAL PROJECTS WITHIN THE AMAZON AIR CARGO TEAM.\n\nTHE SENIOR BUSINESS DEVELOPMENT MANAGER FINDS AND EXECUTES VALUE-CREATION OPPORTUNITIES AND MANAGES RELATIONSHIPS ACROSS THE ENTIRE LIFECYCLE OF THE BUSINESS. AS TRUSTED ADVISORS, SENIOR BUSINESS DEVELOPMENT MANAGERS WORK ALONGSIDE AT A PROGRAMMATIC LEVEL, INFLUENCE THEIR BUSINESS PLANNING AND STRATEGY, AND LOOK AROUND CORNERS TO IDENTIFY OBSTACLES AND RECOMMEND SOLUTIONS, ENSURING OWNERS MAKE EFFECTIVE BUSINESS DECISIONS AND ARE SETUP FOR SUCCESS.\n\nOUR SENIOR BUSINESS DEVELOPMENT MANAGERS ARE LEADERS AND COLLABORATORS. THEY ARE ANALYTICAL AND CREATIVE, DEADLINE-DRIVEN, ORGANIZED, ABLE TO MULTI-TASK, AND HAVE STRONG INTERPERSONAL SKILLS INCLUDING A DEMONSTRATED ABILITY TO EARN TRUST, INSPIRE OTHERS, AND BE EMPATHETIC. YOU’LL BE AT THE CENTER OF CROSS-FUNCTIONAL TEAMS, ALL WORKING TOGETHER TO DELIVER THE HIGHEST QUALITY EXPERIENCE TO AMAZON CUSTOMERS.\n\nKEY JOB RESPONSIBILITIES\n\n SERVE AS KEY CONTRIBUTOR ON THE CARGO MANAGEMENT TEAM, DEFINING AND DELIVERING INITIATIVES THAT EXPAND THE CARGO PROGRAM MANAGE WORKING-LEVEL RELATIONSHIPS ACROSS THE ORGANIZATION IDENTIFY WORKFLOW INEFFICIENCIES AND WORK TO FORMULATE AND IMPLEMENT OPERATIONAL IMPROVEMENTS AT THE NETWORK LEVEL USE EXPERTISE AND JUDGMENT TO SELECT STAKEHOLDERS TO DETERMINE THE RIGHT GOALS, INFORM DECISIONS, AND DESIGN LONG-TERM SOLUTIONS COMMUNICATE GOALS, ROLES, RESPONSIBILITIES, AND DESIRED OUTCOMES TO CROSS-FUNCTIONAL PROJECT TEAMS TO GAIN BUY-IN AND DELIVER PROGRAMS MANAGE AND COORDINATE MULTIPLE PROJECT ASSIGNMENTS THAT CONTINUOUSLY IMPROVE CUSTOMERS’ EXPERIENCE AND DEVELOP BEST IN CLASS AIR CARGO CAPABILITIES ADDRESS BARRIERS THROUGH PROBLEM SOLVING, COMMUNICATION, AND ACTIVE COORDINATION WITH STAKEHOLDERS WORK WITHIN TIME CONSTRAINTS TO MEET BUSINESS CRITICAL NEEDS (OFTEN MANAGING MULTIPLE, TIME-SENSITIVE, AND HIGH PRIORITY INITIATIVES SIMULTANEOUSLY), WHILE MEASURING AND IDENTIFYING ACTIVITIES PERFORMED AND ENSURING SERVICE REQUIREMENTS ARE MET SYSTEMATICALLY ESCALATE PROBLEMS OR VARIANCES IN THE OPERATING PLAN TO THE RELEVANT OWNERS AND TEAMS, FOLLOWING THROUGH TO RESOLUTION TO ENSURE THEY ARE DELIVERED PREPARE AND DELIVER BUSINESS REVIEWS TO UPDATE SENIOR LEADERSHIP ON PROGRESS AND ROADBLOCKS TRAVEL DOMESTICALLY UP TO 30% OF THE TIME\n\nWE ARE OPEN TO HIRING CANDIDATES TO WORK OUT OF ONE OF THE FOLLOWING LOCATIONS:\n\nBELLEVUE, WA, USA | NASHVILLE, TN, USA\n\nBASIC QUALIFICATIONS\n\n BACHELOR’S DEGREE IN BUSINESS ADMINISTRATION, INDUSTRIAL ENGINEERING, LOGISTICS OR SIMILAR FIELD FROM AN ACCREDITED UNIVERSITY EXPERIENCE STRUCTURING AND NEGOTIATING COMPLEX AGREEMENTS AND LEADING CROSS-FUNCTIONAL GROUPS TO ORCHESTRATE AND SUCCESSFULLY COMPLETE DEALS EXPERIENCE WITH SALES CRM TOOLS SUCH AS SALESFORCE OR SIMILAR SOFTWARE EXPERIENCE USING DATA AND METRICS TO DRIVE IMPROVEMENTS EXPERIENCE OWNING PROGRAM STRATEGY, END TO END DELIVERY, AND COMMUNICATING RESULTS TO SENIOR LEADERSHIP 5+ YEARS OF EXPERIENCE IN AIR CARGO OR LOGISTICS\n\nPREFERRED QUALIFICATIONS\n\n EXPERIENCE PERSONALLY CLOSING LARGE COMPLEX DEALS END-TO-END EXPERIENCE DEVELOPING AND EXECUTING SALES STRATEGIES, TACTICS, PLANS, PROCESSES, SYSTEMS AND PROGRAMS EXPERIENCE INFLUENCING MULTIPLE STAKEHOLDERS AND LEADING CROSS FUNCTIONAL TEAMS ACROSS GEOGRAPHIES AND BUSINESS UNITS EXPERIENCE WORKING WITH TECHNICAL AND PRODUCT STAKEHOLDERS TO DEFINE REQUIREMENTS, PRIORITIZE FEATURES, AND INFLUENCE PRODUCT ROADMAPS MASTER'S DEGREE IN BUSINESS ADMINISTRATION OR RELATED FIELD 10+ YEARS OF AIR CARGO BUSINESS DEVELOPMENT EXPERIENCE EXPERIENCE WORKING WITH SENIOR LEVEL EXECUTIVES NEGOTIATING LONG TERM DEALS DEMONSTRABLE PROBLEM-SOLVING, MATHEMATICS AND ANALYTICAL SKILLS USING DATA TO DRIVE DECISIONS IN A BUSINESS ENVIRONMENT DEMONSTRATED ABILITY TO LEAD WITHOUT AUTHORITY WHEN CONFRONTED WITH DIFFICULT SITUATIONS, EXHIBITING ABILITY TO KEEP THE TEAM FOCUSED AND MOTIVATED\n\nAMAZON IS COMMITTED TO A DIVERSE AND INCLUSIVE WORKPLACE. AMAZON IS AN EQUAL OPPORTUNITY EMPLOYER AND DOES NOT DISCRIMINATE ON THE BASIS OF RACE, NATIONAL ORIGIN, GENDER, GENDER IDENTITY, SEXUAL ORIENTATION, PROTECTED VETERAN STATUS, DISABILITY, AGE, OR OTHER LEGALLY PROTECTED STATUS. FOR INDIVIDUALS WITH DISABILITIES WHO WOULD LIKE TO REQUEST AN ACCOMMODATION, PLEASE VISIT HTTPS://WWW.AMAZON.JOBS/EN/DISABILITY/US.\n\nOUR COMPENSATION REFLECTS THE COST OF LABOR ACROSS SEVERAL US GEOGRAPHIC MARKETS. THE BASE PAY FOR THIS POSITION RANGES FROM $90,500/YEAR IN OUR LOWEST GEOGRAPHIC MARKET UP TO $181,500/YEAR IN OUR HIGHEST GEOGRAPHIC MARKET. PAY IS BASED ON A NUMBER OF FACTORS INCLUDING MARKET LOCATION AND MAY VARY DEPENDING ON JOB-RELATED KNOWLEDGE, SKILLS, AND EXPERIENCE. AMAZON IS A TOTAL COMPENSATION COMPANY. DEPENDENT ON THE POSITION OFFERED, EQUITY, SIGN-ON PAYMENTS, AND OTHER FORMS OF COMPENSATION MAY BE PROVIDED AS PART OF A TOTAL COMPENSATION PACKAGE, IN ADDITION TO A FULL RANGE OF MEDICAL, FINANCIAL, AND/OR OTHER BENEFITS. FOR MORE INFORMATION, PLEASE VISIT HTTPS://WWW.ABOUTAMAZON.COM/WORKPLACE/EMPLOYEE-BENEFITS. THIS POSITION WILL REMAIN POSTED UNTIL FILLED. APPLICANTS SHOULD APPLY VIA OUR INTERNAL OR EXTERNAL CAREER SITE.\n\n\nCOMPANY - AMAZON.COM SERVICES LLC - A57\n\nJOB ID: A2617826",
    "job_skill_set": [
      "business development",
      "sales strategy",
      "data analysis",
      "project management",
      "stakeholder management",
      "analytical skills",
      "problem solving",
      "leadership",
      "communication",
      "collaboration",
      "interpersonal skills",
      "creativity",
      "organizational skills",
      "time management",
      "empathy",
      "motivation",
      "negotiation",
      "CRM tools",
      "air cargo logistics",
      "program strategy",
      "influence"
    ],
    "short_keywords": [
      "air",
      "amazon",
      "analysis",
      "analytical",
      "business",
      "businessdevelopment",
      "cargo",
      "collaboration",
      "communication",
      "creativity",
      "crm",
      "data",
      "development",
      "empathy",
      "influence",
      "interpersonal",
      "leadership",
      "logistics",
      "management",
      "manager",
      "motivation",
      "negotiation",
      "organizational",
      "problem",
      "program",
      "project",
      "sales",
      "skills",
      "solving",
      "sr",
      "stakeholder",
      "strategy",
      "time",
      "tools"
    ]
  },
  {
    "job_id": "3901979294",
    "job_title": "Business Development Center Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "I AM ON THE HUNT FOR A SUPERIOR BDC AGENT TO REPRESENT THE AUDI BRAND AND DELIVER AN EXCEPTIONAL CUSTOMER SERVICE EXPERIENCE. PLEASE MESSAGE ME DIRECTLY IF YOU WOULD LIKE TO JOIN OUR STATE OF THE ART FACILITY.",
    "job_skill_set": [
      "customer service",
      "communication",
      "teamwork",
      "problem solving",
      "adaptability"
    ],
    "short_keywords": [
      "adaptability",
      "business",
      "businessdevelopment",
      "center",
      "communication",
      "customer",
      "development",
      "problem",
      "representative",
      "service",
      "solving",
      "teamwork"
    ]
  },
  {
    "job_id": "3905857275",
    "job_title": "Business Development Manager - Dallas/Fort Worth",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "HAYWARD HOLDINGS . (NYSE \"HAYW\" ) IS THE LARGEST MANUFACTURER OF RESIDENTIAL SWIMMING POOL EQUIPMENT GLOBALLY, WITH A SIGNIFICANT PRESENCE IN THE COMMERCIAL POOL MARKET THAT IS CONTINUOUSLY GROWING. HEADQUARTERED IN CHARLOTTE, NORTH CAROLINA , HAYWARD DESIGNS, MANUFACTURES, AND MARKETS A FULL LINE OF RESIDENTIAL AND COMMERCIAL POOL AND SPA EQUIPMENT, INCLUDING PUMPS, FILTERS, HEATING, CLEANERS, SALT CHLORINATORS, AUTOMATION, LIGHTING, SAFETY, FLOW CONTROL, AND ENERGY SOLUTIONS AT OUR COMPANY-OWNED FACILITIES IN NORTH CAROLINA, TENNESSEE, ARIZONA, RHODE ISLAND, SPAIN, AND CHINA. WE HAVE DISTRIBUTION FACILITIES IN FRANCE, CANADA, AND ARIZONA.\nFOR OVER 80-YEARS, HAYWARD HAS BEEN ENHANCING POOL OWNERSHIP BY MANUFACTURING CUTTING-EDGE, ADVANCED POOL AND SPA EQUIPMENT. HAYWARD LISTENS TO OUR CUSTOMERS' NEEDS AND ENSURES THEY ARE IMPLEMENTED DURING THE DESIGN AND MANUFACTURING PROCESS. THE GOAL IS TO BECOME THE PREFERRED BRAND OF CHOICE WITH EVERY RESIDENTIAL AND COMMERCIAL SWIMMING POOL AND SPA.\nHIGH COMMISSION OPPORTUNITY FOR PERFORMANCE DRIVEN SALES LEADER. BUILDS NEW BUSINESS IN A SPECIFIC GEOGRAPHIC AREA. THE BUSINESS DEVELOPMENT MANAGER IS RESPONSIBLE FOR CONVERTING CUSTOMERS BY QUALIFYING AND IDENTIFYING NEW LEADS AND TARGET CUSTOMERS. THIS POSITION IS LOCATED IN DALLAS, TX.\nRESPONSIBILITIES\nIN ADDITION TO SEVERAL OF THE GENERAL DUTIES OF A DISTRICT SALES MANAGER, THE BUSINESS DEVELOPMENT MANAGER WILL STAY FOCUSED AS DESCRIBED BELOW.\n PRIMARY FOCUS IS TO CONVERT CUSTOMERS AND BUILD NEW BUSINESS  ROLE PROVIDES NO EXISTING ACCOUNTS, COMMISSION BASED BONUS ROLE  WORKS INDEPENDENTLY OF THE OTHER SELLERS IN THE REGION AND RECEIVES DIRECTION FROM RSM ON WHICH TARGETS ACCOUNTS TO CLOSE  DEVELOPS NEW TARGETS THROUGH ACTIVE PROSPECTING AND COLD CALLING ACTIVITIES  ANALYZES MARKET TRENDS AND SALES DATA TO IDENTIFY MARKET OPPORTUNITIES FOR FUTURE BUSINESS.  ASSIST THE SALES LEADERSHIP TEAM IN IDENTIFYING AND ACCURATELY FORECASTING MARKET SHARE OPPORTUNITIES.  THEY MUST CLEARLY AND CONVINCINGLY ARTICULATE THE ORGANIZATION’S OFFERINGS AND VALUE PROPOSITION AND OVERCOME INITIAL RESISTANCE FROM PROSPECTS.  DISPLAYS OR DEMONSTRATES PRODUCT, USING SAMPLES OR CATALOG, AND EXPLAINS FEATURES AND ATTRIBUTES AND ADVANTAGES OVER COMPETITION.  REVIEWS MARKET ANALYSES TO DETERMINE CUSTOMER REQUIREMENTS, VOLUME POTENTIAL, COMPETITIVE PRICING.  REPRESENTS COMPANY AT TRADE SHOWS AND ASSOCIATION MEETINGS TO PROMOTE PRODUCT.  COORDINATES BETWEEN CUSTOMER SERVICE, TECHNICAL SERVICE, ENGINEERING AND OTHER DEPARTMENTS AS APPROPRIATE.  CONTROLS EXPENDITURES OF PERSONAL GEOGRAPHIC DISTRICT TO CONFORM TO BUDGETARY REQUIREMENTS.  PROVIDES INPUT AND IMPLEMENTS ANNUAL NEW BUSINESS SALES PLAN FOR THE TERRITORY, INCLUDING SALES STRATEGY TO MEET THE NEW BUSINESS SALES QUOTAS ESTABLISHED BY THE DIRECTOR OF SALES OR REGIONAL SALES MANAGER.  MANAGES AND DEVELOPS CUSTOMER BASE THROUGH THE EFFECTIVE USE OF SALESFORCE CRM. IDENTIFIES NEW BUSINESS TARGETS AND EFFECTIVELY SCHEDULES TOUCHPOINTS AND SELLING OPPORTUNITIES.  PREPARES MONTHLY PROGRESS REPORTS, MONTHLY ITINERARY, WEEKLY CALL REPORTS AND WEEKLY EXPENSE REPORTS IN A TIMELY MANNER AND SUBMITS TO REGIONAL SALES MANAGER.  PERFORMS OTHER DUTIES AS ASSIGNED BY REGIONAL SALES MANAGER OR VICE PRESIDENT OF SALES. \nQUALIFICATIONS\n BACHELOR'S DEGREE (B.A.) FROM FOUR-YEAR COLLEGE OR UNIVERSITY PREFERRED.  A SUSTAINED LEVEL OF NEW BUSINESS SALES ACHIEVEMENT IS ESSENTIAL. MECHANICAL APTITUDE AND PERSONAL COMPUTER SKILLS ARE REQUIRED. SALES SUCCESS IN A B2B ENVIRONMENT WHERE MARKET GROWTH AND LARGE CUSTOMER CONVERSION WAS THE OBJECTIVE. ANALYTICAL THINKING AND STRATEGIC SELLING SKILLS WILL BE KEY. FAMILIARITY WITH AUTOMATED CONTROL SYSTEMS, BASIC ELECTRICITY, PLUMBING HYDRAULICS AND/OR WATER CHEMISTRY IS A PLUS. A BROAD KNOWLEDGE OF SWIMMING POOL EQUIPMENT AND HAYWARD’S PRODUCTS IS A PLUS. WORKING KNOWLEDGE OF ELECTRONIC CHLORINE GENERATION, AND SOLAR, GAS AND ELECTRIC HEATERS IS A PLUS.  MUST ALSO POSSESS A VALID DRIVER’S LICENSE AND BE ABLE TO DRIVE LONG DISTANCES AND TRAVEL BY PLANE.",
    "job_skill_set": [
      "Sales",
      "Business Development",
      "Strategic Selling",
      "Budget Management",
      "Communication",
      "Persuasion",
      "Independence",
      "Team Coordination",
      "Customer Service",
      "Problem Solving",
      "Networking",
      "Presentation Skills",
      "CRM (Salesforce)",
      "Market Analysis",
      "Analytical Thinking",
      "Mechanical Aptitude",
      "B2B Sales",
      "Product Knowledge (Swimming Pool Equipment)",
      "Forecasting",
      "Cold Calling",
      "Automated Control Systems",
      "Basic Electricity",
      "Plumbing Hydraulics",
      "Water Chemistry",
      "Electronic Chlorine Generation",
      "Solar Heaters",
      "Gas Heaters",
      "Electric Heaters",
      "Time Management",
      "Adaptability"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "analytical",
      "aptitude",
      "automated",
      "b2b",
      "basic",
      "budget",
      "business",
      "businessdevelopment",
      "calling",
      "chemistry",
      "chlorine",
      "cold",
      "communication",
      "control",
      "coordination",
      "crm",
      "customer",
      "dallasfort",
      "development",
      "electric",
      "electricity",
      "electronic",
      "equipment",
      "forecasting",
      "gas",
      "generation",
      "heaters",
      "hydraulics",
      "independence",
      "knowledge",
      "management",
      "manager",
      "market",
      "mechanical",
      "networking",
      "persuasion",
      "plumbing",
      "pool",
      "presentation",
      "problem",
      "product",
      "sales",
      "salesforce",
      "selling",
      "service",
      "skills",
      "solar",
      "solving",
      "strategic",
      "swimming",
      "systems",
      "team",
      "thinking",
      "time",
      "water",
      "worth"
    ]
  },
  {
    "job_id": "3902917331",
    "job_title": "Business Development Center Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "COMPANY DESCRIPTION HUDSON AUTO GROUP HAS BEEN PROVIDING SALES AND SERVICE TO THE GREATER JERSEY CITY AREA SINCE AUGUST 2006. THE COMPANY REPRESENTS THE HYUNDAI AND SUBARU FRANCHISES AND IS COMMITTED TO DELIVERING EXCEPTIONAL CUSTOMER EXPERIENCES IN THE AUTOMOTIVE INDUSTRY.\n ROLE DESCRIPTION THIS IS A FULL-TIME ON-SITE ROLE AS A BUSINESS DEVELOPMENT CENTER REPRESENTATIVE AT HUDSON AUTO GROUP LOCATED IN JERSEY CITY, NJ. THE BUSINESS DEVELOPMENT CENTER REPRESENTATIVE WILL BE RESPONSIBLE FOR ENGAGING WITH CUSTOMERS OVER THE PHONE, PROVIDING EXCELLENT CUSTOMER SERVICE, AND ENSURING CUSTOMER SATISFACTION. THE REPRESENTATIVE WILL ALSO PLAY A CRUCIAL ROLE IN DRIVING SALES BY EFFECTIVELY COMMUNICATING WITH POTENTIAL CUSTOMERS.\n QUALIFICATIONS PHONE ETIQUETTE, COMMUNICATION, AND CUSTOMER SERVICE SKILLSABILITY TO PROVIDE EXCEPTIONAL CUSTOMER SATISFACTIONEXPERIENCE IN SALES OR A CUSTOMER-FACING ROLESTRONG INTERPERSONAL AND COMMUNICATION SKILLSABILITY TO WORK IN A FAST-PACED ENVIRONMENTKNOWLEDGE OF AUTOMOTIVE INDUSTRY IS A PLUSHIGH SCHOOL DIPLOMA OR EQUIVALENT",
    "job_skill_set": [
      "phone etiquette",
      "customer service",
      "sales experience",
      "communication",
      "interpersonal skills",
      "ability to work in a fast-paced environment",
      "customer satisfaction focus",
      "automotive industry knowledge"
    ],
    "short_keywords": [
      "a",
      "ability",
      "automotive",
      "business",
      "businessdevelopment",
      "center",
      "communication",
      "customer",
      "development",
      "environment",
      "etiquette",
      "experience",
      "fastpaced",
      "focus",
      "in",
      "industry",
      "interpersonal",
      "knowledge",
      "phone",
      "representative",
      "sales",
      "satisfaction",
      "service",
      "skills",
      "to",
      "work"
    ]
  },
  {
    "job_id": "3884429683",
    "job_title": "New Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "POSITION: NEW BUSINESS DEVELOPMENT REPRESENTATIVE DEPARTMENT: SALES LEVEL: INDIVIDUAL CONTRIBUTOR REPORTS TO: DIRECTOR OF BUSINESS DEVELOPMENT \nPOSITION SUMMARY: AS A NEW BUSINESS DEVELOPMENT REPRESENTATIVE, YOU WILL GENERATE PROFITABLE SALES BY BUILDING AND GROWING LONG-TERM CLIENT RELATIONSHIPS IN THE BUSINESS AVIATION MARKETPLACE FOR BOTH EXISTING AND NEW LINES OF BUSINESS. YOU WILL DRAW FROM YOUR EXPERIENCE TO NETWORK AND PROSPECT FOR NEW CLIENTS ACROSS THE UNITED STATES. BEING A SELF-MOTIVATED, RESULTS ORIENTED INDIVIDUAL WILL HELP YOU SUCCEED. \nESSENTIAL FUNCTIONS: • ESTABLISH A STRONG AND THRIVING BASE OF CUSTOMERS THROUGH PROSPECTING AND NETWORKING WITH YOUR BUSINESS AVIATION CONTACTS. • DEVELOP STRATEGIES FOR WORKING WITH CUSTOMERS IN A PRIMARILY VIRTUAL MANNER, SUPPLEMENTING WITH OCCASIONAL IN PERSON NETWORKING. • ACCELERATE NEW CUSTOMER ACQUISITION AND MAINTAIN ACCURATE SALES PIPELINES AND REPORTING. • DEMONSTRATE ABILITY TO CLOSE SALES WITH EVIDENCE OF STRONG CLOSE PERCENTAGES. • WORK WITH MARKETING TO DEVELOP AND IMPLEMENT EFFECTIVE MARKETING CAMPAIGNS • HELP TO DEVELOP SALES STRATEGIES/PROCESS’ AND THE ABILITY TO TRAIN FUTURE EMPLOYEES ON PROCESS/STRATEGIES • DEVELOP LONG-TERM STRATEGIC RELATIONSHIPS WITH CUSTOMERS TO ENSURE IFCC IS THE FIRST CALL WHEN THEY NEED STAFFING ASSISTANCE. • ONCE NEW ACCOUNTS ARE SIGNED, ENSURE THEY ARE PROPERLY SET UP, LAUNCHED, AND MAINTAINED. • EXHIBIT SUPERIOR ON-GOING SERVICE OF ALL ACCOUNTS, FORECASTS, PROPOSALS, AND ACCOUNT ACTIVITIES WHILE MAINTAINING ACCURATE RECORDS IN THE COMPANY CRM. • MEET REVENUE AND SALES GOALS AS AGREED UPON AND SCHEDULED. • BE AN INTEGRAL PART OF EVOLVING THE COMPANY’S STRATEGIC GROWTH MODEL BY PROVIDING EDUCATED INPUT ON THE MARKET AND CUSTOMER FEEDBACK TO THE EXECUTIVE TEAM. • REPRESENT THE COMPANY BY ATTENDING TRADE SHOWS AND INDUSTRY EVENTS. • TRACK AND MONITOR YOUR OWN RESULTS AND BE PROUD TO SHARE THESE TRANSPARENTLY WITH MANAGEMENT.\n EDUCATION AND EXPERIENCE: • MINIMUM 3+ YEARS OF SALES EXPERIENCE IN THE STAFFING AND/OR AVIATION MARKETPLACE • A DEMONSTRATED TRACK RECORD OF SELLING TO A RANGE OF DECISION-MAKERS, FROM LARGE ENTERPRISE/FORTUNE 500 COMPANIES TO SMALL FLIGHT AND MAINTENANCE DEPARTMENTS. • STAFFING EXPERIENCE IS A STRONG PLUS. • EXPERIENCE WITH CRM AND ATS SOFTWARE \nSKILLS/ABILITIES/COMPETENCIES: • PROFICIENCY IN A MS OFFICE 365 ENVIRONMENT, INCLUDING EXCEL, WORD, POWERPOINT, AND TEAMS. • SELF-MOTIVATED, EXCEPTIONAL LISTENING SKILLS, AND THE ABILITY TO PROBLEM-SOLVE. • MUST BE COMFORTABLE IN A HANDS-ON, FAST PACED ENVIRONMENT AND HAVE A GET-IT-DONE ATTITUDE.",
    "job_skill_set": [
      "sales",
      "networking",
      "prospecting",
      "account management",
      "marketing campaigns",
      "staffing experience",
      "self-motivated",
      "problem solving",
      "communication",
      "relationship building",
      "results oriented",
      "adaptability",
      "teamwork",
      "training",
      "CRM software",
      "MS Office 365",
      "data analysis",
      "aviation industry knowledge",
      "listening skills",
      "transparency"
    ],
    "short_keywords": [
      "365",
      "account",
      "adaptability",
      "analysis",
      "aviation",
      "building",
      "business",
      "businessdevelopment",
      "campaigns",
      "communication",
      "crm",
      "data",
      "development",
      "experience",
      "industry",
      "knowledge",
      "listening",
      "management",
      "marketing",
      "ms",
      "networking",
      "new",
      "office",
      "oriented",
      "problem",
      "prospecting",
      "relationship",
      "representative",
      "results",
      "sales",
      "selfmotivated",
      "skills",
      "software",
      "solving",
      "staffing",
      "teamwork",
      "training",
      "transparency"
    ]
  },
  {
    "job_id": "3904704593",
    "job_title": "Enterprise Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "THE ROLE\n\nHERE AT MARIGOLD, WE’RE WORKING TO GROW OUR ENTERPRISE BUSINESS DEVELOPMENT TEAM. IF YOU’RE A DRIVEN AND GOAL-ORIENTED INDIVIDUAL WITH YOUR EYES ON STRATEGIC GROWTH, THIS IS THE ROLE FOR YOU.\n\nREPORTING TO THE BUSINESS DEVELOPMENT DIRECTOR, THE ENTERPRISE BUSINESS DEVELOPMENT REPRESENTATIVE (BDR) WILL BE RESPONSIBLE FOR DRIVING NEW QUALIFIED PIPELINE. BY USING STRATEGIC RESEARCH AND A TOP TIER TECHNOLOGY SUITE, YOU WILL IDENTIFY, NURTURE AND HELP QUALIFY NEW LEADS TO GENERATE WELL RESEARCHED, QUALIFIED MEETINGS FOR OUR ENTERPRISE ACCOUNT EXECUTIVE TEAM. YOU’LL BE PARTNERED WITH EXPERIENCED ENTERPRISE SALES REPS TO HELP UNLOCK NEW SELLING OPPORTUNITIES WITHIN OUR TARGETED ACCOUNT BASE.\n\nIN THIS ROLE YOU WILL\n\nUSE MODERN OMNI-CHANNEL BDR PROSPECTING TECHNIQUES TO INTRODUCE MARIGOLD SOLUTIONS TO OUR TARGETED ENTERPRISE ACCOUNT BASE.BECOME AN EXPERT IN TELLING THE MARIGOLD SOLUTION STORY AND VALUE PROPOSITIONS TO RECOMMEND HIGH LEVEL SOLUTIONS WE OFFER.PARTNER WITH OUR SALES ACCOUNT EXECUTIVE TEAM TO HELP GENERATE MEETINGS, BUILD SALES PIPELINE AND DRIVE DEALSUSE SALESFORCE AND OUTREACH TO METICULOUSLY ORGANIZE YOUR PROSPECTS AND PIPELINE.USE SOCIAL SELLING TO BUILD RELATIONSHIPS AND CREDIBILITY WITH YOUR TARGET ACCOUNTS.BE COMFORTABLE COLD CALLING, CREATING PERSONALIZED PROSPECTING VIDEOS, AND CRAFTING PERSONALIZED EMAILS.COLLABORATE AND SHARE EXPERIENCES WITH OTHER BDR’S ON YOUR TEAM - WIN TOGETHER.RECEIVE COACHING FROM 10+ YEAR EXPERIENCE BDR LEADER.ACCESS AND UTILIZE HIGH END TECH STACK TO HELP YOU ACHIEVE YOUR GOALS.\n\nWHAT MAKES A GREAT BDR CANDIDATE\n\n1+ YEARS EXPERIENCE PROSPECTING/SELLING SAAS TO LARGE ENTERPRISE ACCOUNTS.EXPERIENCE PROSPECTING TO B2C ACCOUNTS IS A PLUS.EXTREME OWNERSHIP IN TAKING CONTROL OF YOUR CONTROLLABLES AND PUSHING BEYOND THE MINIMUM.GROWTH MINDSET - NATURALLY DRIVEN TO SEEK FEEDBACK, LEARNING OPPORTUNITIES AND COACHING.HIGH CALIBER WRITTEN AND VERBAL COMMUNICATION SKILLS.SELF-MOTIVATION AND THE ABILITY TO WORK SUCCESSFULLY IN A FAST-PACED SALES ENVIRONMENT WITH A MIX OF SELF-MOTIVATION AND BEING COACHED.EAGERNESS TO COLLABORATE WITH OTHER PARTNERS LIKE AE’S, LEADERSHIP, MARKETING, ENABLEMENT.\n\nPERKS & BENEFITS\n\nCOMPETITIVE COMPENSATION AND BENEFITS PACKAGELIFE, AD&D, SHORT AND LONG TERM DISABILITY INSURANCE401(K) WITH COMPANY MATCHINGOPEN TIME AWAYPAID PARENTAL LEAVE",
    "job_skill_set": [
      "Communication",
      "Self-Motivation",
      "Collaboration",
      "Growth Mindset",
      "Ownership",
      "Adaptability",
      "Salesforce",
      "Outreach",
      "SaaS",
      "Social Selling",
      "Omni-channel Prospecting",
      "Video Prospecting",
      "Email Crafting"
    ],
    "short_keywords": [
      "adaptability",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "crafting",
      "development",
      "email",
      "enterprise",
      "growth",
      "mindset",
      "omnichannel",
      "outreach",
      "ownership",
      "prospecting",
      "representative",
      "saas",
      "salesforce",
      "selfmotivation",
      "selling",
      "social",
      "video"
    ]
  },
  {
    "job_id": "3906251327",
    "job_title": "Coordinator - Business Development (NY)",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "POSITION TITLE: COORDINATOR - BUSINESS DEVELOPMENT \n\nENTITY: KROLL BOND RATING AGENCY, LLC.\n\nEMPLOYMENT TYPE: FULL-TIME\n\nLOCATION: NEW YORK, NEW YORK, UNITED STATES\n\nSUMMARY/OVERVIEW\n\nKROLL BOND RATING AGENCY (KBRA) IS CURRENTLY SEARCHING FOR A BUSINESS DEVELOPMENT COORDINATOR TO JOIN OUR TEAM IN THE NEW YORK OFFICE. THE INDIVIDUAL WILL BUILD AN EXCITING CAREER WITH US AND SUPPORT OUR EXPONENTIAL GROWTH. THIS ROLE IS AN ENTRY LEVEL POSITION, PERFECT FOR A RECENT GRAD LOOKING TO BUILD A CAREER IN BUSINESS DEVELOPMENT, RELATIONSHIP MANAGEMENT AND SALES. THE INDIVIDUAL IS RESPONSIBLE FOR SUPPORTING THE BUSINESS DEVELOPMENT TEAM IN MARKETING THE FULL RANGE OF CAPABILITIES OF THE KBRA BUSINESS LINES. THE INDIVIDUAL WILL ASSIST IN THE DEVELOPMENT AND EXECUTION OF ALL ELEMENTS OF THE SALES PROCESS INCLUDING PRESENTATION PRODUCTION, CLIENT COMMUNICATIONS, CONFERENCES, MARKET RESEARCH, INTERNAL COMMUNICATIONS, DATABASE MANAGEMENT AND ALL OTHER FUNCTIONS THAT HELP THE TEAM ACHIEVE ITS MARKETING AND BUSINESS GOALS.\n\nSUPPORT BUSINESS DEVELOPMENT TEAM MEMBERS WITH CLIENT RELATIONSHIP BUILDING AND MANAGEMENT.ORGANIZE AND SCHEDULE MEETINGS WITH CLIENTS TO SUPPORT RELATIONSHIP MANAGEMENTASSIST IN PREPARATION OF PRESENTATIONS AND MATERIALS FOR QUARTERLY BOARD MEETINGSASSIST IN MARKET RESEARCH PROJECTS TO AID THE DEVELOPMENT OF SALES EFFORTS AND STRATEGIES.ASSIST IN THE PREPARATION AND DOCUMENTATION OF TRANSACTIONAL CONTRACTS FOR CLIENT ONBOARDING – DRAFTING ENGAGEMENT LETTERS, RUNNING POINT ON LEGAL NEGOTIATIONS, ALERTING RELEVANT INTERNAL ANALYSTS OF PENDING TRANSACTIONS, ORGANIZING SIGNATURE ON BOTH ENDSORGANIZE AND TRACK THE STAGES OF BUSINESS TRANSACTIONS, WHILE WORKING CLOSELY WITH BOTH THE ANALYTIC AND COMMERCIAL TEAMS, AS WELL AS SENIOR MANAGEMENTINPUT AND MAINTAIN CLIENT AND TRANSACTION DETAILS IN CRM SYSTEM AND OTHER DATABASES.FREQUENTLY UPDATE INTERNAL SYSTEMS TO MAINTAIN A CLEAN PIPELINE OF EXPECTED DEALS CLOSING EACH QUARTERLIAISE WITH ANALYTICAL TEAMS TO PROVIDE INFORMATION ON NEW TRANSACTIONS AND RECEIVE UPDATES ON EXPECTED DEAL TIMELINESMONITOR AND MAINTAIN HISTORICAL TRANSACTIONAL DATA FOR MARKETING GRAPHS AND STATISTICS.COORDINATE WITH LEGAL AND COMPLIANCE TEAMS TO MEET REGULATORY REQUIREMENTS.RUN REQUIRED COMPLIANCE CHECKS PRIOR TO ENGAGEMENT, ENGAGING LEGAL AND COMPLIANCE TEAMS WHEN NECESSARY.\n\nKEY SKILLS/EXPERIENCE\n\nBACHELOR’S DEGREE IN MARKETING, BUSINESS MANAGEMENT, ECONOMICS OR FINANCE.EXCELLENT COMPUTER SKILLS INCLUDING POWERPOINT, EXCEL, AND WORD; BLOOMBERG/SALESFORCE KNOWLEDGE A PLUS.STRONG VERBAL, WRITTEN AND PRESENTATION SKILLS ARE ESSENTIAL.CANDIDATE MUST BE ASSERTIVE, ORGANIZED, DETAIL ORIENTED, CREATIVE, ENERGETIC AND RESOURCEFUL.ABILITY TO TAKE INITIATIVE AND WORK INDEPENDENTLY, AS WELL AS WORK CLOSELY WITH PARTNERS IN A COLLABORATIVE ENVIRONMENT. \n\nSALARY RANGE\n\nTHE ANTICIPATED ANNUAL BASE SALARY RANGE FOR THIS FULL-TIME POSITION IS $70,000 TO $80,000. OFFER AMOUNTS ARE DETERMINED BY FACTORS SUCH AS EXPERIENCE, SKILLS, GEOGRAPHY, AND OTHER JOB-RELATED FACTORS.\n\nKBRA BENEFITS\n\nA HYBRID WORK SCHEDULE (TUESDAY, WEDNESDAY AND THURSDAYS IN THE OFFICE)COMPETITIVE BENEFITS AND PAID TIME OFFPAID FAMILY AND DISABILITY LEAVE401(K) PLAN, INCLUDING EMPLOYER MATCH (100% VESTED)EDUCATIONAL AND PROFESSIONAL DEVELOPMENT FINANCIAL ASSISTANCEEMPLOYEE REFERRAL BONUS PROGRAMCELL PHONE REIMBURSEMENT\n\nABOUT US\n\nKROLL BOND RATING AGENCY, LLC (KBRA) IS A FULL-SERVICE CREDIT RATING AGENCY REGISTERED WITH THE U.S. SECURITIES AND EXCHANGE COMMISSION AS AN NRSRO. KROLL BOND RATING AGENCY EUROPE LIMITED IS REGISTERED AS A CRA WITH THE EUROPEAN SECURITIES AND MARKETS AUTHORITY. KROLL BOND RATING AGENCY UK LIMITED IS REGISTERED AS A CRA WITH THE UK FINANCIAL CONDUCT AUTHORITY PURSUANT TO THE TEMPORARY REGISTRATION REGIME. IN ADDITION, KBRA IS DESIGNATED AS A DESIGNATED RATING ORGANIZATION BY THE ONTARIO SECURITIES COMMISSION FOR ISSUERS OF ASSET-BACKED SECURITIES TO FILE A SHORT FORM PROSPECTUS OR SHELF PROSPECTUS. KBRA IS ALSO RECOGNIZED BY THE NATIONAL ASSOCIATION OF INSURANCE COMMISSIONERS AS A CREDIT RATING PROVIDER.\n\nMORE INFO\n\nKBRA ENCOURAGES APPLICATIONS FROM ALL QUALIFIED INDIVIDUALS WITHOUT REGARD TO RACE, COLOR, RELIGION, GENDER, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, AGE, NATIONAL ORIGIN, MARITAL STATUS, CITIZENSHIP, DISABILITY, AND VETERAN STATUS OR ANY OTHER BASIS PROHIBITED BY FEDERAL, STATE OR LOCAL LAW.\n\n",
    "job_skill_set": [
      "PowerPoint",
      "Excel",
      "Word",
      "Salesforce",
      "Market Research",
      "CRM Systems",
      "Presentation Production",
      "Contract Drafting",
      "Communication",
      "Organization",
      "Detail-oriented",
      "Creativity",
      "Initiative",
      "Collaboration",
      "Assertiveness",
      "Resourcefulness",
      "Teamwork",
      "Bloomberg",
      "Compliance Checks"
    ],
    "short_keywords": [
      "assertiveness",
      "bloomberg",
      "business",
      "businessdevelopment",
      "checks",
      "collaboration",
      "communication",
      "compliance",
      "contract",
      "coordinator",
      "creativity",
      "crm",
      "detailoriented",
      "development",
      "drafting",
      "excel",
      "initiative",
      "market",
      "ny",
      "organization",
      "powerpoint",
      "presentation",
      "production",
      "research",
      "resourcefulness",
      "salesforce",
      "systems",
      "teamwork",
      "word"
    ]
  },
  {
    "job_id": "3900938989",
    "job_title": "Vice President of Business Development",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "VP OF BUSINESS DEVELOPMENT (FULLY REMOTE)\nTHE VP OF BUSINESS DEVELOPMENT WILL BE RESPONSIBLE FOR DEVELOPING AND EXECUTING BUSINESS DEVELOPMENT STRATEGIES TO DRIVE REVENUE GROWTH, EXPAND MARKET PRESENCE, AND BUILD STRATEGIC PARTNERSHIPS WITH CLIENTS AND INDUSTRY STAKEHOLDERS. THE VP OF BUSINESS DEVELOPMENT MUST HAVE A PROVEN TRACK RECORD IN HEALTH CARE, RETAIL HEALTH, TECHNOLOGY, AND PHARMA SECTORS, WORKING WITH LEADING BRANDS AND AGENCIES. THIS ROLE REQUIRES A STRATEGIC THINKER WITH A PROVEN TRACK RECORD OF SUCCESS AND DRIVING BUSINESS GROWTH, STRONG LEADERSHIP SKILLS, AND A DEEP UNDERSTANDING OF DIGITAL ADVERTISING TECHNOLOGY AND MARKET DYNAMICS.  \nWHAT YOU’LL DO:DRIVE SALES TO ENTERPRISE AND MID-TIER BRANDS ACROSS OUR SUITE OF THROTLE SOLUTIONS: IDENTITY RESOLUTION, AUDIENCE INTELLIGENCE, CUSTOMER DATA ONBOARDING, AND CLOSED-LOOP MEASUREMENT. IDENTIFY, NURTURE, DEVELOP AND NEGOTIATE NEW OPPORTUNITIES AND STRATEGIC RELATIONSHIPS WITH CONSUMER BRANDS AND/OR THEIR RESPECTIVE AGENCIES.USE CONSULTATIVE AND SOLUTION-SELLING SKILLS TO UNDERSTAND PROSPECTIVE CLIENT CHALLENGES AND MAKE COMPELLING RECOMMENDATIONS OF HOW THROTLE SOLUTIONS ADDRESS THEIR BUSINESS NEEDS.DEVELOP AND GROW EXISTING ACCOUNTS, WORKING IN COLLABORATION WITH OUR CUSTOMER SUCCESS TEAM.ENSURE THAT WE EXCEED CUSTOMER EXPECTATIONS AND LOCK IN RENEWALS.SUPPORT FINANCE IN GENERATING CUSTOMER INVOICES AND ENSURING PAYMENT.KEEP SALESFORCE UP TO DATE (ALWAYS), TRACK KEY METRICS, AND COMMUNICATE DEAL PROGRESS EFFECTIVELY INTERNALLY.REPRESENT THE VOICE OF THE CUSTOMER TO INFORM OUR SALES PROCESS, MARKETING MATERIALS, AND PRODUCT ROADMAP.THE POSITION WILL REQUIRE THAT THE INDIVIDUAL UNDERSTANDS ALL REGULATIONS AND LAWS APPLICABLE TO THEIR ASSIGNED ROLES AND RESPONSIBILITIES. ADDITIONALLY, THE INDIVIDUAL WILL BE RESPONSIBLE FOR THE DEVELOPMENT, IMPLEMENTATION, AND REGULAR MAINTENANCE OF POLICIES AND PROCEDURES THAT GOVERN THE WORK OF ASSIGNED ROLES AND RESPONSIBILITIES, INCLUDING COMPLIANCE WITH THE SECURITY REQUIREMENTS OF EPHI.WHAT WE’RE LOOKING FOR: 8+ YEARS OF SUCCESSFUL, QUOTA-CARRYING SALES/BUSINESS DEVELOPMENT EXPERIENCE WITH HEALTHCARE-FOCUSED COMPANIES, BRANDS AND AGENCIES, DIGITAL/PROGRAMMATIC MEDIA OR OTHER MARTECH DAAS / SAAS SALES.8+ YEARS OF EXPERIENCE DEVELOPING, MAINTAINING, AND OBTAINING MEETINGS WITH NEW AND EXISTING VP, SVP, AND C-LEVEL RELATIONSHIPS WITHIN THE HEALTHCARE SPACE. DEEP UNDERSTANDING OF THE HEALTHCARE ECOSYSTEM AND EXPERIENCE WORKING WITH PAYERS, DATA PROVIDERS, HEALTHCARE AGENCIES, RETAIL HEALTH CUSTOMERS, B2B HEALTH TECH, AND PHARMA. DEMONSTRABLE UNDERSTANDING OF MANAGEMENT CONSULTING, CUSTOMER EXPERIENCE, TECHNOLOGY, PRODUCT DEVELOPMENT, AND DIGITAL MARKETING WITHIN THE HEALTHCARE SPACE.EMPATHETIC, POSITIVE ATTITUDE WITH A DESIRE AND ASSERTIVENESS TO HELP OUR CUSTOMERS REACH THEIR GOALS AND OBJECTIVESRESULTS-DRIVEN MENTALITY, WITH A BIAS FOR SPEED AND ACTIONTHRIVES IN A GROWING COMPANY AND DYNAMIC ENVIRONMENT, WHERE WE’RE MOVING FAST, SCALING UP AND BUILDING NEW CAPABILITIES WHILE DELIVERING QUALITY SOLUTIONS FOR CUSTOMERS\nABOUT THROTLE:  THROTLE IS A LEADING IDENTITY COMPANY TRUSTED BY THE WORLD’S TOP BRANDS AND AGENCIES LOCATED IN RED BANK, NJ. AT THROTLE, WE EMPOWER BRANDS AT SCALE WITH TRUE INDIVIDUAL-BASED MARKETING USING A DATA-CENTRIC IDENTITY AND ONBOARDING APPROACH. THROTLE IS A COMPANY THAT TRULY VALUES ITS EMPLOYEES AND THEIR WORK-LIFE BALANCE. WE OFFER A COMPREHENSIVE, COMPETITIVE, AND INCLUSIVE SET OF HEALTH, FINANCIAL, AND OTHER BENEFITS THAT SUPPORT YOUR TOTAL WELL-BEING: COMPETITIVE COMPENSATION.COMPREHENSIVE BENEFITS INCLUDE MEDICAL, DENTAL, AND VISION.LIFE INSURANCE.LONG-TERM DISABILITY.A GENEROUS PTO PROGRAM.A 401K PLAN SUPPORTED BY A COMPANY MATCH.HALF DAY SUMMER FRIDAYS (CLOSE AT 1 P.M. MEMORIAL DAY TO LABOR DAY). EARLY FRIDAYS (OFFICE CLOSES AT 3 P.M.). HYBRID SCHEDULE (MONDAYS AND FRIDAYS WFH)THE OFFICE IS CLOSED BETWEEN CHRISTMAS AND NEW YEAR.COMPANY-SPONSORED LUNCH AT LEAST 1X A MONTH.  AND MUCH MORE!",
    "job_skill_set": [
      "business development",
      "sales",
      "healthcare knowledge",
      "digital advertising technology",
      "consultative selling",
      "market analysis",
      "strategic partnerships",
      "customer experience",
      "leadership",
      "strategic thinking",
      "communication",
      "problem solving",
      "results-driven mentality",
      "adaptability",
      "collaboration",
      "positive attitude",
      "customer relationship management (Salesforce)",
      "data onboarding",
      "compliance knowledge",
      "programmatic media",
      "martech",
      "product development",
      "empathy",
      "assertiveness"
    ],
    "short_keywords": [
      "adaptability",
      "advertising",
      "analysis",
      "assertiveness",
      "attitude",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "compliance",
      "consultative",
      "customer",
      "data",
      "development",
      "digital",
      "empathy",
      "experience",
      "healthcare",
      "knowledge",
      "leadership",
      "management",
      "market",
      "martech",
      "media",
      "mentality",
      "of",
      "onboarding",
      "partnerships",
      "positive",
      "president",
      "problem",
      "product",
      "programmatic",
      "relationship",
      "resultsdriven",
      "sales",
      "salesforce",
      "selling",
      "solving",
      "strategic",
      "technology",
      "thinking",
      "vice"
    ]
  },
  {
    "job_id": "3905866771",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "DESCRIPTION\nTHE BUSINESS DEVELOPMENT REPRESENTATIVE IS RESPONSIBLE FOR FACILITATING BUSINESS GROWTH AND ESTABLISHING NEW REFERRAL SOURCES BY BUILDING STRONG RELATIONSHIPS WITH HEALTHCARE PROVIDERS WHO ARE FOCUSED ON PROVIDING BETTER TREATMENT OPTIONS FOR MOOD DISORDERS, CHRONIC PAIN, AND MENTAL CLARITY. \nTHE BUSINESS DEVELOPMENT REPRESENTATIVE REPORTS TO THE EXECUTIVE DIRECTOR OF MARKETING AND PARTNERSHIPS AND THE CHIEF EXECUTIVE OFFICER.\nRESPONSIBILITIES \nTHE BUSINESS DEVELOPMENT REPRESENTATIVE RESPONSIBILITIES INCLUDE THE FOLLOWING:\nCALLING ON ESTABLISHED PARTNERS TO MAINTAIN BUSINESS RELATIONSHIP IDENTIFYING AND DEVELOPING NEW RELATIONSHIPS WITH REFERRAL SOURCES AND PARTNERS DISTRIBUTING PROMOTIONAL MATERIALS TO REFERRAL SOURCES (PHYSICIANS, MENTAL HEALTH PROFESSIONALS, PHYSICAL THERAPISTS, ETC.)EDUCATING REFERRAL SOURCES ON NEW OFFERINGS, EVENTS, AND RESEARCHHOSTING EVENTS SUCH AS LUNCH AND LEARNS AND EDUCATIONAL DINNERSPARTICIPATING IN COMMUNITY EVENTS, INCLUDING SOME NIGHTS AND WEEKENDS \nTHIS DESCRIPTION IS NOT DESIGNED TO CONTAIN A COMPREHENSIVE LISTING OF ACTIVITIES, DUTIES OR RESPONSIBILITIES THAT ARE REQUIRED OF THE INTERN. DUTIES, RESPONSIBILITIES AND ACTIVITIES MAY CHANGE OR NEW ONES MAY BE ASSIGNED AT ANY TIME WITH OR WITHOUT NOTICE.\nQUALIFICATIONS\nRELIABLE TRANSPORTATION IS REQUIREDMINIMUM 2 YEARS OF SALES EXPERIENCE IS PREFERREDBACHELOR’S DEGREE IN A RELATED FIELD IS PREFERREDMEDICAL EXPERIENCE IS PREFERRED \nDESIRED SKILL SET\nEXCELLENT COMMUNICATION SKILLS, BOTH WRITTEN AND VERBALSTRONG ANALYTICAL SKILLS, STRONG ORGANIZATIONAL SKILLS, AND DETAIL ORIENTEDMUST BE ABLE TO DEMONSTRATE BASIC COMPUTER SKILLS TO BE SUCCESSFULA WILLINGNESS TO LEARN, GAIN KNOWLEDGE, AND DEVELOP SKILLS TO IMPROVE WORK PERFORMANCE\nWE ARE AN EQUAL OPPORTUNITY EMPLOYER AND DO NOT DISCRIMINATE AGAINST ANY EMPLOYEE OR APPLICANT.\nCOMPENSATION\nCOMPENSATION DETAILS WILL BE ADDRESSED DURING THE INTERVIEW PROCESS. APPLICATION\nTO APPLY, PLEASE SUBMIT YOUR COVER LETTER, RESUME, AND A MINIMUM OF THREE REFERENCES AMI@SCENICCITYNEUROTHERAPY.COM IF YOU ARE NOT APPLYING THROUGH INDEED.",
    "job_skill_set": [
      "sales experience",
      "computer skills",
      "communication",
      "analytical skills",
      "organizational skills",
      "attention to detail",
      "willingness to learn",
      "medical knowledge"
    ],
    "short_keywords": [
      "analytical",
      "attention",
      "business",
      "businessdevelopment",
      "communication",
      "computer",
      "detail",
      "development",
      "experience",
      "knowledge",
      "learn",
      "medical",
      "organizational",
      "representative",
      "sales",
      "skills",
      "to",
      "willingness"
    ]
  },
  {
    "job_id": "3903476020",
    "job_title": "Engineering Business Development Specialist Intern",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "OVERVIEW\n\nWE ARE SEEKING A FULL-TIME ENGINEERING BUSINESS DEVELOPMENT SPECIALIST INTERN IN OUR OLATHE, KS LOCATION. IN THIS ROLE, YOU WILL BE RESPONSIBLE FOR PROVIDING GLOBAL PARTNERSHIP TOOLS, SYSTEMS AND OTHER RESOURCES NEEDED TO ENABLE GLOBAL PARTNERSHIPS AND ENGINEERING BUSINESS DEVELOPMENT. THESE TOOLS, SYSTEMS AND RESOURCES WILL ADVANCE OUR PARTNERSHIP COLLABORATIONS AND ALLOW EBD MANAGERS TO SWIFTLY COMPLETE BENEFICIAL PARTNERSHIPS AND CONTRACT TERMS FOR GARMIN AND FURTHERING GARMIN’S ENGINEERING & PRODUCT DEVELOPMENT.\n\nESSENTIAL FUNCTIONS\n\nINTERNALLY SUPPORT GARMIN’S GLOBAL EXTERNAL 3RD PARTY PARTNERSHIPS BY ANALYZING CONTRACT TOOLS, SYSTEMS, AND RESOURCESANALYZE THE INCLUSION OF PARTNER ASSETS IN MARCOM AND PRODUCT DELIVERABLES FOR 3RD PARTY COMPLIANCE, AS APPROPRIATE, AND ENSURE PRODUCTS ARE ACCURATELY REPRESENTED IN MARKETING MATERIALSBECOME A KEY CONTRIBUTOR TO TEAM BY ANALYZING NEW/CURRENT TOOLS & SYSTEMS AND IDENTIFYING NEW EFFICIENCIES/RESOURCES TO ENHANCE TOOLSETANALYZE EXISTING BUSINESS PROCESSES/PRACTICES IN ORDER TO RECOGNIZE AREAS FOR INTERNAL IMPROVEMENT AND POTENTIAL TOOLS FOR SUPPORTPROACTIVELY PROVIDE RECOMMENDATIONS TO EXECUTIVE MANAGEMENT ON TOOLS AND SYSTEMS TO IMPROVE DEPARTMENTAL PERFORMANCE AND OPERATIONAL BEST PRACTICESWORK WITH TEAM MEMBERS TO ESTABLISH PLANS AND ASSIST WITH COLLABORATION ACROSS DEPARTMENTS AS NEEDED TO FACILITATE ADHERENCE TO DEADLINES AND ACHIEVE DEPARTMENTAL GOALS\n\n\nBASIC QUALIFICATIONS\n\nCOMPLETED COURSEWORK IN A BUSINESS OR RELATED DEGREE DISCIPLINE OR POSSESS A COMBINATION OF EDUCATION & EXPERIENCEEXCELLENT ACADEMICS (CUMULATIVE GPA GREATER THAN OR EQUAL TO 3.0)PROVEN ANALYSIS EXPERIENCE AND/OR DEMONSTRATED KNOWLEDGE IN ANALYSIS, COMMUNICATION, OR GENERAL BUSINESS CONCEPTS/PROCESSESDEMONSTRATED STRONG AND EFFECTIVE VERBAL, WRITTEN, AND INTERPERSONAL COMMUNICATION SKILLSSTRONG ANALYTICAL AND ORGANIZATIONAL SKILLS WITH KEEN ATTENTION TO DETAILABILITY TO DEAL WITH CONFIDENTIAL COMPANY MATTERSPROFICIENT COMPUTER SKILLS IN MICROSOFT WORD, EXCEL, AND POWERPOINTDEMONSTRATED ABILITY TO GRASP NEW CONCEPTS QUICKLYDEMONSTRATED PROFICIENT AND EFFECTIVE DATA ENTRY SKILLS\n\n\nDESIRED QUALIFICATIONS\n\nPREVIOUS EXPERIENCE USING MICROSOFT OUTLOOKPREVIOUS INTERNSHIP EXPERIENCE EXTERNALLY OR INTERNALLY\n\n\nGARMIN INTERNATIONAL IS AN EQUAL OPPORTUNITY EMPLOYER. QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, RELIGION, COLOR, NATIONAL ORIGIN, CITIZENSHIP, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, VETERAN’S STATUS, AGE OR DISABILITY.\n\nTHIS POSITION IS ELIGIBLE FOR GARMIN'S BENEFIT PROGRAM. DETAILS CAN BE FOUND HERE: GARMIN BENEFITS",
    "job_skill_set": [
      "Microsoft Word",
      "Microsoft Excel",
      "Microsoft PowerPoint",
      "contract analysis",
      "communication",
      "organizational skills",
      "attention to detail",
      "team collaboration",
      "problem solving",
      "adaptability",
      "data analysis",
      "data entry",
      "business analysis"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "attention",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "contract",
      "data",
      "detail",
      "development",
      "engineering",
      "entry",
      "excel",
      "intern",
      "microsoft",
      "organizational",
      "powerpoint",
      "problem",
      "skills",
      "solving",
      "specialist",
      "team",
      "to",
      "word"
    ]
  },
  {
    "job_id": "3884448230",
    "job_title": "Business Development (Sales) Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ABOUT THIS OPPORTUNITY\n\nTHE BUSINESS DEVELOPMENT MANAGER MAINTAINS EXISTING CLIENT RELATIONSHIPS/ACCOUNTS AND PROSPECTS FOR NEW POTENTIAL CLIENTS FOR THE ASSIGNED TERRITORY TO ACHIEVE MARKET POSITION IN-LINE WITH THE NITTO AVECIA SALES BUDGET AND FINANCIAL GROWTH OBJECTIVES. AUTONOMOUSLY NEGOTIATE AND CLOSE BUSINESS DEALS. WORK WITH MARKET INTELLIGENCE TO MAINTAIN UP-TO-DATE KNOWLEDGE OF THE CURRENT MARKET CONDITIONS OF THE ASSIGNED TERRITORY. WORK WITH INTERNAL STAKEHOLDERS TO MANAGE CLIENT/PROSPECT REQUESTS AND IDENTIFY OPPORTUNITIES FOR IMPROVEMENT ACROSS THE ORGANIZATION TO INCREASE CLIENT SATISFACTION.\n\nKEY JOB RESPONSIBILITIES\n\n GROW AND RETAIN EXISTING CLIENT ACCOUNTS AND CONTINUOUSLY IMPROVE THE RELATIONSHIP PROSPECT FOR NEW POTENTIAL CLIENTS AND CONVERT THEM INTO ACCOUNTS WORK WITH THE INTERNAL STAKEHOLDERS TO DEVELOP AND DELIVER PROPOSALS THAT MEET CLIENT’S NEEDS, ADDRESS CONCERNS AND ACHIEVE OBJECTIVES UNDERSTAND NITTO AVECIA FINANCIAL GOALS AND PRICING MODELS TO PREPARE CLIENT PROPOSAL PRICING MAINTAIN CONSTANT TERRITORY DEMAND AND SALES DATA IN CRM AND OTHER DESIGNATED DATABASES UTILIZE MARKET AND COMPETITOR KNOWLEDGE TO IDENTIFY OPPORTUNITIES FOR NITTO AVECIA UNIQUE SELLING PROPOSITIONS AND KEY DIFFERENTIATORS PURSUE FACE-TO-FACE APPOINTMENTS WITH EXISTING AND PROSPECTIVE CLIENTS ON A REGULAR BASIS AND PRESENT INFORMATION AS NEEDED PARTICIPATE IN RELEVANT TRADE SHOWS, SYMPOSIA, CONFERENCES AND TRAININGS\n\n\nJOB KNOWLEDGE REQUIRED\n\n BACHELOR’S DEGREE IN CHEMISTRY, BIOLOGY, ENGINEERING OR OTHER RELATED FIELD MINIMUM 3 YEARS OF INDUSTRY EXPERIENCE OR RELEVANT BUSINESS DEVELOPMENT/SALES OR PROJECT MANAGEMENT EXPERIENCE EXPERIENCE WITH, AND DEMONSTRATED KNOWLEDGE OF CGMP API MANUFACTURING REQUIRED MUST POSSESS EXCELLENT PRESENTATION, WRITTEN AND VERBAL COMMUNICATION SKILLS ABLE TO TRAVEL WITHIN THE ASSIGNED TERRITORY AS REQUIRED MUST BE OUTGOING, ENERGETIC, SELF-MOTIVATING AND ABLE TO NETWORK WITH BUSINESS AND SCIENTIFIC STAFF OF CLIENTS/PROSPECTS.",
    "job_skill_set": [
      "CRM",
      "Market Intelligence",
      "Sales Negotiation",
      "Client Proposal Development",
      "Data Analysis",
      "Communication",
      "Networking",
      "Self-Motivation",
      "Presentation Skills",
      "Client Relationship Management",
      "Team Collaboration",
      "Problem Solving",
      "CGMP API Manufacturing Knowledge",
      "Bachelor’s Degree in Chemistry/Biology/Engineering"
    ],
    "short_keywords": [
      "analysis",
      "api",
      "bachelors",
      "business",
      "businessdevelopment",
      "cgmp",
      "chemistrybiologyengineering",
      "client",
      "collaboration",
      "communication",
      "crm",
      "data",
      "degree",
      "development",
      "in",
      "intelligence",
      "knowledge",
      "management",
      "manager",
      "manufacturing",
      "market",
      "negotiation",
      "networking",
      "presentation",
      "problem",
      "proposal",
      "relationship",
      "sales",
      "selfmotivation",
      "skills",
      "solving",
      "team"
    ]
  },
  {
    "job_id": "3887576060",
    "job_title": "Sr VP of Business Development - Solar",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "IF YOU ARE A SR VP OF BUSINESS DEVELOPMENT - SOLAR WITH EXPERIENCE, PLEASE READ ON!\n\nWHAT YOU WILL BE DOING\n\nAS THE SR VP OF SALES / BUSINESS DEVELOPMENT YOU WILL BE RESPONSIBLE FOR PLANNING AND IMPLEMENTING BOTH SHORT- AND LONG-RANGE SALES PROGRAMS, TARGETED TOWARD THE CALIFORNIA FOOD PROCESSING AND COLD STORAGE MARKETS. THIS POSITION WILL REPORT DIRECTLY TO THE COMPANIES CEO, AND TERRITORY WILL BE THROUGHOUT CALIFORNIA (CENTRAL CA).\n\nWHAT YOU NEED FOR THIS POSITION\n\nAT LEAST 8-10 YEARS EXPERIENCE\n\n ACCOUNT EXECUTIVE / SALES REP / SALES MANAGER DIRECTOR OF SALES VP OF SALES RENEWABLE ENERGY PROJECTS SOLAR POWER GENERATION / BATTERY STORAGE AGRICULTURAL PROJECTS WATER PROJECTS FOOD PROCESSING PLANTS EXPERIENCE IN CALIFORNIA FOOD PROCESSING AND/OR COLD STORAGE MARKETS. EXPERIENCE MANAGING CRMMUST BE LIVING IN CA TO BE CONSIDERED FOR POSITION\n\nWHAT'S IN IT FOR YOU\n\n SALARY: $170 - $200K (DOE) MEDICAL / DENTAL / VISION ESOP COMPANY 100% EMPLOYER PAID EMPLOYEE BENEFITS FOR PPO OR HMO 50% EMPLOYER PAID DEPENDENT PPO OR HMO COVERAGE 3 WEEKS PTO FOR ALL EMPLOYEES 8 PAID HOLIDAYS 6% EMPLOYER MATCH FOR 401K\n\nSO, IF YOU ARE A SR VP OF BUSINESS DEVELOPMENT - SOLAR WITH EXPERIENCE, PLEASE APPLY TODAY!\n\nEMAIL YOUR RESUME IN WORD TO\n\nLOOKING FORWARD TO RECEIVING YOUR RESUME THROUGH OUR WEBSITE AND GOING OVER THE POSITION WITH YOU. CLICKING APPLY IS THE BEST WAY TO APPLY, BUT YOU MAY ALSO:\n\nROMAN.SCOTT@CYBERCODERS.COM\n\nPLEASE DO NOT CHANGE THE EMAIL SUBJECT LINE IN ANY WAY. YOU MUST KEEP THE JOBID: LINKEDIN : RS14-1749304 -- IN THE EMAIL SUBJECT LINE FOR YOUR APPLICATION TO BE CONSIDERED.***\n\nROMAN SCOTT - LEAD RECRUITER - CYBERCODERS\n\nAPPLICANTS MUST BE AUTHORIZED TO WORK IN THE U.S.\n\nCYBERCODERS IS PROUD TO BE AN EQUAL OPPORTUNITY EMPLOYER\n\nALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, AGE, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, NATIONAL ORIGIN, ANCESTRY, CITIZENSHIP, GENETIC INFORMATION, REGISTERED DOMESTIC PARTNER STATUS, MARITAL STATUS, STATUS AS A CRIME VICTIM, DISABILITY, PROTECTED VETERAN STATUS, OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW. CYBERCODERS WILL CONSIDER QUALIFIED APPLICANTS WITH CRIMINAL HISTORIES IN A MANNER CONSISTENT WITH THE REQUIREMENTS OF APPLICABLE LAW. CYBERCODERS IS COMMITTED TO WORKING WITH AND PROVIDING REASONABLE ACCOMMODATION TO INDIVIDUALS WITH PHYSICAL AND MENTAL DISABILITIES. IF YOU NEED SPECIAL ASSISTANCE OR AN ACCOMMODATION WHILE SEEKING EMPLOYMENT, PLEASE CONTACT A MEMBER OF OUR HUMAN RESOURCES TEAM TO MAKE ARRANGEMENTS.\n\nCYBERCODERS WILL CONSIDER FOR EMPLOYMENT IN THE CITY OF LOS ANGELES QUALIFIED APPLICANTS WITH CRIMINAL HISTORIES IN A MANNER CONSISTENT WITH THE REQUIREMENTS OF THE LOS ANGELES FAIR CHANCE INITIATIVE FOR HIRING (BAN THE BOX) ORDINANCE.\n\n",
    "job_skill_set": [
      "business development",
      "leadership",
      "communication",
      "team collaboration",
      "problem solving",
      "sales management",
      "renewable energy",
      "solar power generation",
      "battery storage",
      "CRM management",
      "food processing",
      "cold storage",
      "project management",
      "territory planning",
      "strategic planning",
      "negotiation",
      "customer relationship management",
      "adaptability"
    ],
    "short_keywords": [
      "adaptability",
      "battery",
      "business",
      "businessdevelopment",
      "cold",
      "collaboration",
      "communication",
      "crm",
      "customer",
      "development",
      "energy",
      "food",
      "generation",
      "leadership",
      "management",
      "negotiation",
      "of",
      "planning",
      "power",
      "problem",
      "processing",
      "project",
      "relationship",
      "renewable",
      "sales",
      "solar",
      "solving",
      "sr",
      "storage",
      "strategic",
      "team",
      "territory",
      "vp"
    ]
  },
  {
    "job_id": "3898175049",
    "job_title": "Business Development Associate",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "TRS ROOFING SYSTEMS – HOUSTON, LLC, ESTABLISHED IN 2009, IS A COMMERCIAL ROOFING COMPANY BASED OUT OF THE WOODLANDS, TX. SPECIALIZING MOSTLY IN LOW SLOPE ROOFING AND METAL FABRICATION, SERVICING CLIENTS THROUGHOUT THE STATE OF TEXAS AND IN SOME CASES BEYOND. BUSINESS DEVELOPMENT ASSOCIATE:TRS ROOFING SYSTEMS – HOUSTON, LLC. IS SEEKING A MOTIVATED INDIVIDUAL TO JOIN OUR GROWING TEAM! THE BUSINESS DEVELOPMENT ASSOCIATE WILL WORK DIRECTLY WITH OUR EXISTING CUSTOMER BASE TO EXPAND CURRENT SALES AND CREATE NEW BUSINESS OPPORTUNITIES THROUGH MARKET RESEARCH.\nTHE BUSINESS DEVELOPMENT ASSOCIATE WILL PERFORM MARKET AND INDUSTRY RESEARCH TO ASSIST THE COMPANY IN SALES STRATEGIES BY GEOGRAPHIC LOCATION. THE ASSOCIATE WILL ALSO ANALYZE CURRENT CUSTOMER DATABASE TO GROW AND EXPAND OPERATIONS WITH EXISTING CUSTOMERS, BUILDING BRAND LOYALTY. RESPONSIBILITIES OVERVIEW:DEVELOP AND IMPLEMENT BUSINESS GROWTH STRATEGIES WITH THE TEAMMAINTAIN COMPANY AND CLIENT EXPECTATIONSMAINTAIN CLIENT RELATIONSHIPSDEMONSTRATE DEEP UNDERSTANDING OF SALES ANALYTICS TO FOCUS SALES STRATEGIESRESEARCH MARKET AND INDUSTRY TRENDS\nREQUIRED SKILLS:STRONG COMMUNICATION SKILLSSTRONG NEGOTIATION AND PERSUASION SKILLS.STRONG COLLABORATION SKILLSSTRONG COMPUTER SKILLS IN MICROSOFT RELATED PROGRAMS AND EXPERIENCE WITHIN A CRM PLATFORM IS PREFERREDBACHELOR’S DEGREE IS PREFERRED2 YEARS’ EXPERIENCE IN SIMILAR ROLE IS REQUIRED\nSKILLS AND RESPONSIBILITIES FOR THIS POSITION INCLUDE:STRONG CUSTOMER COMMUNICATION SKILLS INCLUDING VERBAL AND WRITTEN.POSITIVE ATTITUDE AND WILLINGNESS TO BE HELPFUL TO OUR CUSTOMERS AND COWORKERS.STRONG CLOSING SKILLS TO ENSURE IDEAL RESULTS FOR ALL PARTIES.ABILITY TO GROWING SALES WITHIN EXISTING CUSTOMER BASE.ABILITY TO KNOW AND PROCESS WHAT TRS DOES AND BE ABLE TO ACCURATELY DESCRIBE THAT TO OUR CLIENTS.BUILDING TRUST AND LONG-TERM RELATIONSHIPS WITH CLIENTS/CUSTOMERS.MAKING PROFESSIONAL DECISIONS IN A FAST-PACED ENVIRONMENT.DEEP UNDERSTANDING OF SALES ANALYTICS TO FOCUS SALES STRATEGIES.IDENTIFYING SALES AND SERVICES THAT WOULD APPEAL TO NEW AND EXISTING CLIENTS.MANAGING COMPANY AND CLIENT EXPECTATIONS.MARKET RESEARCH TO PUBLIC AND PRIVATE PROJECTS.CREATING SALES PITCHES.ASSISTING IN FINDING NEW SALES LEADS.RESEARCHING MARKET AND INDUSTRY TRENDS.\n",
    "job_skill_set": [
      "sales analytics",
      "market research",
      "CRM software",
      "Microsoft Office",
      "sales strategies",
      "customer database analysis",
      "sales pitches",
      "communication",
      "negotiation",
      "collaboration",
      "customer service",
      "problem solving",
      "relationship building",
      "positive attitude",
      "decision making"
    ],
    "short_keywords": [
      "analysis",
      "analytics",
      "associate",
      "attitude",
      "building",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "crm",
      "customer",
      "database",
      "decision",
      "development",
      "making",
      "market",
      "microsoft",
      "negotiation",
      "office",
      "pitches",
      "positive",
      "problem",
      "relationship",
      "research",
      "sales",
      "service",
      "software",
      "solving",
      "strategies"
    ]
  },
  {
    "job_id": "3884938234",
    "job_title": "Business Development Executive",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "JOB PURPOSETHE BUSINESS DEVELOPMENT EXECUTIVE POSITION DIRECTLY ENGAGES WITH PROSPECTIVE CUSTOMERS WITHIN A DEFINED GEOGRAPHIC TERRITORY IN ORDER TO DRIVE SALES GROWTH OPPORTUNITIES FOR THE COMPANY. THIS POSITION IS FOCUSED ON BUILDING A STRONG RELATIONSHIP WITH NEW AND EXISTING CUSTOMERS TO GENERATE AND CLOSE SALES OPPORTUNITIES. THIS POSITION WILL BE RESPONSIBLE FOR MANAGING THE SALES PROGRAM IN ORDER TO DEVELOP STRONG CLIENT RELATIONSHIPS THROUGH EFFECTIVE COMMUNICATIONS IN ALL ASPECTS OF THE SALE PROCESS INCLUDING INITIATION, CONTRACT NEGOTIATION AND CLOSING. THE BUSINESS DEVELOPMENT EXECUTIVE WILL LEAD MARKET ENTRY BY LEVERAGING EXISTING AND NEW CUSTOMER RELATIONSHIPS TO EXPAND UNITED STEELS’ BUSINESS PORTFOLIO. UNITED STEEL IS SEEKING A TEAM MEMBER TO REPRESENT THE ORGANIZATION WITH OUR CORE VALUES OF RISE TO THE CHALLENGE, WIN AS A TEAM, FIND WAYS TO HELP, AND HAVE FUN.\nDUTIES & RESPONSIBILITIES• INTRODUCING UNITED STEEL TO PROSPECTIVE NEW CUSTOMERS AND MAKING SURE DECISION MAKERS UNDERSTAND THE BENEFITS OF UNITED STEEL AND HOW IT COMPARES TO OTHER FABRICATORS/ERECTORS.• IDENTIFY AND PENETRATE TARGET MARKETS TO SOLICIT BUSINESS AND GAIN BID INVITES.• IDENTIFY NEW BUSINESS OPPORTUNITIES WITHIN DIFFERENT INDUSTRIES TO IMPROVE COMPETITIVENESS.• MAKE REGULAR CONTACT WITH PROSPECTIVE CUSTOMERS IN ORDER TO EFFECTIVELY CULTIVATE A BUSINESS RELATIONSHIP.• CONDUCT MARKET RESEARCH TO IDENTIFY SELLING POSSIBILITIES AND EVALUATE CUSTOMER NEEDS.• SALES ACCOUNTABILITY: REPORTS ON SALES RESULTS, MARKET CONDITIONS OR ACCOUNT METRICS.• ABILITY TO REVIEW CONSTRUCTION DOCUMENTS, STRUCTURAL STEEL PLANS, SPECIFICATIONS AND UNDERSTAND SCOPE OF WORK TO BID.• GENERAL UNDERSTANDING OF MATERIAL PRICING FOR VARIOUS STEEL SHAPES.• POSSESSES A GENERAL UNDERSTANDING OF STRUCTURAL STEEL ERECTION PHASES, TIME UNITS FOR VARIOUS ERECTION PHASES, REQUIREMENTS FOR CRANE SIZE AND LOCATION AND OTHER GENERAL EQUIPMENT REQUIREMENTS.• CONSULTS WITH CLIENTS, VENDORS, OR OTHER INDIVIDUALS TO DISCUSS AND FORMULATE ESTIMATES AND RESOLVE ISSUES.• INTERFACES WITH OTHERS WITHIN THE ORGANIZATION TO OBTAIN SUPPORT AND COMMITMENT TO THE COST ESTIMATES.• INFORMS THE IMMEDIATE SUPERVISOR OF ANY OBSERVED INACCURACIES OR OMISSIONS IN QUOTED ITEMS.• ATTENDS DEPARTMENTAL MEETINGS AND CUSTOMER SCOPE REVIEWS AS REQUIRED.• ENSURE THE HIGHEST QUALITY AND INNOVATIVE APPROACHES FOR RFP RESPONSES TO MAXIMIZE WIN RATES.• THIS JOB DESCRIPTION IS NOT INTENDED TO BE ALL-INCLUSIVE. EMPLOYEE MAY PERFORM OTHER DUTIES TO MEET THE ONGOING NEEDS OF THE ORGANIZATION. \nQUALIFICATIONS•BACHELOR’S DEGREE (BS/BA) IN BUSINESS ADMINISTRATION, INDUSTRIAL ENGINEERING, OR RELATED FIELD OR A COMBINATION OF RELEVANT WORK EXPERIENCE.•10 YEARS’ EXPERIENCE IN THE STEEL INDUSTRY OR SIMILAR INDUSTRY WITH A MINIMUM OF 3 – 5 YEARS IN A SALES/BUSINESS DEVELOPMENT ROLE MANAGING AND LEADING A TEAM.•INDUSTRY RELATIONS INCLUDING BUT NOT LIMITED TO STRUCTURAL STEEL, MISC. METALS, AND HEAVY COMMERCIAL (I.E. TRANSPORTATION INFRASTRUCTURE)•EXCELLENT INTERPERSONAL AND COMMUNICATION SKILLS AT ALL LEVELS IN THE ORGANIZATION, CUSTOMERS AND VENDORS; PROVEN ABILITY TO EFFECTIVELY INFLUENCE AND MOTIVATE OTHERS; MUST BE ABLE TO DEAL WITH AMBIGUITY AND VARIOUS CHANGING REQUIREMENTS.• ENGAGEMENT AND COLLABORATION WITH CROSS-FUNCTIONAL GROUPS, INCLUDING MANAGEMENT TO DEVELOP STRATEGIC SALES PROGRAMS.•DEMONSTRATED SUCCESSFUL PROJECT MANAGEMENT SKILLS AND THE ABILITY TO CONTRIBUTE TO STRATEGIC DECISIONS, WHILE DRIVING DETAILED IMPLEMENTATION PLANS.• DYNAMIC COMMUNICATION ABILITIES; PERSUASIVE AND ENERGETIC•STRONG SENSE OF URGENCY AND ABILITY TO WORK THROUGH BID PROCESS AND ADDRESS CUSTOMER NEEDS AND REQUEST AND BALANCING BUSINESS NEEDS.•STRONG ATTENTION TO DETAIL AND ABILITY TO MULTITASK.•STRONG SENSE OF URGENCY AND ABILITY TO WORK THROUGH BID PROCESS, ADDRESSING CUSTOMER NEEDS AND REQUESTS, AND BALANCING BUSINESS NEEDS.•PROFICIENT COMPUTER SKILLS IN MICROSOFT WORD, EXCEL, AND POWERPOINT.\nREQUIRED COMPETENCIESCOLLABORATION SKILLS; ETHICAL CONDUCT; THOROUGHNESS; BUSINESS ACUMEN; COMMUNICATION PROFICIENCY; DECISION MAKING; INITIATIVE; PROBLEM SOLVING/ANALYSIS; PLANNING AND ORGANIZING; TIME MANAGEMENT",
    "job_skill_set": [
      "sales",
      "business development",
      "project management",
      "customer relationship management",
      "communication",
      "interpersonal skills",
      "collaboration",
      "problem solving",
      "initiative",
      "time management",
      "decision making",
      "adaptability",
      "persuasiveness",
      "market research",
      "structural steel knowledge",
      "Microsoft Word",
      "Microsoft Excel",
      "Microsoft PowerPoint",
      "contract negotiation",
      "estimating",
      "attention to detail"
    ],
    "short_keywords": [
      "adaptability",
      "attention",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "contract",
      "customer",
      "decision",
      "detail",
      "development",
      "estimating",
      "excel",
      "executive",
      "initiative",
      "interpersonal",
      "knowledge",
      "making",
      "management",
      "market",
      "microsoft",
      "negotiation",
      "persuasiveness",
      "powerpoint",
      "problem",
      "project",
      "relationship",
      "research",
      "sales",
      "skills",
      "solving",
      "steel",
      "structural",
      "time",
      "to",
      "word"
    ]
  },
  {
    "job_id": "3902355636",
    "job_title": "Business Development - Refined Sugars/Liquid Sugar/Beverage ONLY",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "THE IDEAL CANDIDATE IS A MOTIVATED, ORGANIZED, AND CREATIVE INDIVIDUAL WHO WELCOMES THE CHALLENGES OF ACQUIRING AND DEVELOPING NEW BUSINESS THROUGH SALES EFFORTS. YOU WILL BUILD KEY CUSTOMER RELATIONSHIPS, IDENTIFY BUSINESS OPPORTUNITIES, AND CLOSE BUSINESS DEALS WHILE MAINTAINING AN EXTENSIVE KNOWLEDGE OF CURRENT MARKET CONDITIONS.  RESPONSIBILITIESCULTIVATE STRONG BUSINESS RELATIONSHIPS WITH KEY DECISION MAKERSPROACTIVELY IDENTIFY NEW OPPORTUNITIES AND DELIVER INNOVATIVE SOLUTIONS TO CUSTOMERSDEVELOP MARKET STRATEGIES BY RESEARCHING LISTS OF HIGH POTENTIAL PROSPECTS\nQUALIFICATIONS\nBACHELOR'S DEGREE OR EQUIVALENT EXPERIENCE IN BUSINESSPREVIOUS SALES EXPERIENCE INTO LIQUID SUGAR/SUGAR REFINING/SYRUP/BEVERAGETECHNICAL CHEMICAL/FOOD SCIENCE/BIOLOGICAL EXPERIENCEEXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLS",
    "job_skill_set": [
      "sales",
      "business development",
      "relationship building",
      "creativity",
      "organization",
      "communication",
      "problem solving",
      "market research",
      "liquid sugar knowledge",
      "sugar refining knowledge",
      "food science knowledge",
      "chemical knowledge"
    ],
    "short_keywords": [
      "building",
      "business",
      "businessdevelopment",
      "chemical",
      "communication",
      "creativity",
      "development",
      "food",
      "knowledge",
      "liquid",
      "market",
      "only",
      "organization",
      "problem",
      "refined",
      "refining",
      "relationship",
      "research",
      "sales",
      "science",
      "solving",
      "sugar",
      "sugarbeverage",
      "sugarsliquid"
    ]
  },
  {
    "job_id": "3901936301",
    "job_title": "Vice President of Business Development",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ABOUT SIFTWELL ANALYTICS \nSIFTWELL ANALYTICS IS A FAST-GROWING, MISSION-CENTRIC COMPANY THAT USES DATA, ADVANCED ANALYTICS, AND MANAGED CARE EXPERTISE TO ENABLE PARTNER HEALTHCARE ORGANIZATIONS TO IMPROVE MEMBER HEALTH OUTCOMES AND REDUCE COSTS FOR COMPLEX POPULATIONS. AT SIFTWELL, WE ARE COMMITTED TO PROVIDING A MUTUALLY RESPECTFUL WORK ENVIRONMENT. WE BELIEVE DIVERSITY AND INCLUSION AMONG OUR TEAMMATES IS CRITICAL TO OUR SUCCESS. WE SEEK TO RECRUIT, DEVELOP, AND RETAIN THE MOST TALENTED PROFESSIONALS, AND WE WORK TO CREATE A CULTURE IN WHICH ALL INDIVIDUALS CAN DEVELOP, THRIVE, AND HAVE FUN.  BUSINESS NEED  SIFTWELL’S GROWTH AND EXPANSIONS EFFORTS IN 2024 AND BEYOND ARE HIGHLY DEPENDENT ON THE SUCCESS OF THE BUSINESS DEVELOPMENT TEAM – SALES, MARKETING, CLIENT SUCCESS AND PARTNERSHIPS. THE VP OF BUSINESS DEVELOPMENT IS A LEADERSHIP ROLE THAT IS ESPECIALLY VITAL TO ENSURE THAT THE PIPELINE CONTINUES TO GROW, DEVELOP, AND MATURE IN SIFTWELL’S TARGET MARKET – COMMUNITY HEALTH PLANS.  THIS POSITION IS INTENDED TO EXPAND CAPACITY FOR SALES AND COLLABORATE WITH MARKETING, CUSTOMER SUCCESS, PRODUCT DEVELOPMENT AND SENIOR MANAGEMENT TO ENSURE REVENUE ATTAINMENT GOALS THROUGH DIRECT SALES AND REVENUE-GENERATING PARTNERSHIPS. MORE BROADLY, THE INDIVIDUAL WILL WORK DIRECTLY WITH THE SVP OF GROWTH AND COMPANY LEADERSHIP TO ENSURE COMMERCIAL SUCCESS, INSULATE AGAINST COMPETITION, AND ACHIEVE CORPORATE OBJECTIVES AS IT RELATES TO NEW PRODUCTS, PRODUCT LINE EXTENSIONS, AND PARTNERSHIPS. THIS INDIVIDUAL IS A DIRECT LINE BETWEEN THE MARKET AND THE SIFTWELL TEAM, AND THEREFORE WILL PLAY AN IMPORTANT ROLE IN PRODUCT AND COMPANY EVOLUTION.  IF YOU ARE A HIGHLY MOTIVATED AND PROACTIVE BD PROFESSIONAL HUNGRY TO JOIN A MISSION-ORIENTED COMPANY AT THE CUTTING EDGE, READ ON!   THE SPECIFIC NEEDS THAT THIS POSITION FULFILLS: \nDEVELOPING AND ADVANCING PIPELINE OPPORTUNITIES: THIS INDIVIDUAL WILL COLLABORATE AND BE CO-RESPONSIBLE WITH THE SVP OF GROWTH ON OVERALL PIPELINE DEVELOPMENT. THE TARGET MARKET OF COMMUNITY HEALTH PLANS IS WELL-DEFINED. INITIAL OPPORTUNITIES HAVE BEEN CAPTURED IN THE PIPELINE MANAGEMENT SYSTEM THAT REQUIRE NURTURING AND FOLLOW-UP TO ADVANCE TO SALES. \nBUILDING RELATIONSHIPS IN THE TARGET MARKET: THE SALES STRATEGY REQUIRES BUILDING UPON TRUSTED RELATIONSHIPS WITH COMMUNITY HEALTH PLAN LEADERS. THIS ROLE IS INTENDED TO AUGMENT AND SUPPORT THESE RELATIONSHIPS AT ALL LEVELS OF THE TARGET CUSTOMER ORGANIZATION. \nSUPPORTING ALL ASPECTS OF THE MARKETING STRATEGY: THE MARKETING TEAM IS MEASURED ON PIPELINE DEVELOPMENT, ADDING TO THE TOP OF THE SALES FUNNEL. THE VP OF BUSINESS DEVELOPMENT WILL WORK CLOSELY WITH MARKETING TO DEFINE, REFINE AND SUPPORT PROGRAMS THAT RESULT IN QUALITY LEADS.  EXECUTIVE RELATIONSHIP FOLLOW UP: THE FOUNDERS AND ADVISORS OF SIFTWELL ARE FORMER LEADERS OF MANAGED CARE ORGANIZATIONS AND COMMUNITY HEALTH PLANS. THE BUSINESS DEVELOPMENT ROLE IS REQUIRED TO SUPPORT, EXTEND, AND ENRICH EXISTING RELATIONSHIPS. \nSUPPORT FOR SALES OPERATIONS: THERE IS A NEED IN THE ORGANIZATION TO IMPLEMENT A STRUCTURE AND SYSTEM THAT ADVANCES THE PIPELINE. THIS ROLE IS INTENDED TO SUPPORT THAT EFFORT AND HELP TO INSTITUTIONALIZE A SYSTEM AND APPROACH THAT RESULTS IN A CLEAR VIEW OF SALES, REVENUE, AND PROFIT. \nPARTNERSHIP DEVELOPMENT: AS THE BUSINESS EXPANDS IN THE TARGET MARKET, PARTNERSHIPS ARE REQUIRED TO ENSURE THAT THE INSIGHTS AND ACTION RECOMMENDATIONS FROM THE SIFTWELL OFFERING RESULT IN “REAL WORLD” OUTCOMES. THIS ROLE SUPPORTS PARTNERSHIP DEVELOPMENT AND THE VENDOR MANAGEMENT REQUIREMENTS OF THE CLIENT.  OVERALL STRATEGIC DEVELOPMENT: THIS INDIVIDUAL IS A LIAISON BETWEEN THE COMPANY AND THE MARKET. THE IDEAL CANDIDATE HAS BOTH AN EXECUTION “HAT” AND A STRATEGIC “HAT,” USING MARKET INSIGHTS AND DYNAMICS TO (TOGETHER WITH THE SVP OF GROWTH) INFORM SIFTWELL’S GROWTH, MARKETING, AND PRODUCT STRATEGY.  CLIENT UPSELL/EXPANSION: THIS INDIVIDUAL WILL WORK WITH THE SVP GROWTH AND THE CLIENT SUCCESS TEAM TO ENSURE SMOOTH EXPANSION OF CLIENT RELATIONSHIPS, AT THE DISCRETION OF THE CLIENT SUCCESS AND SIFTWELL LEADERSHIP TEAM. \nPOSITION DESCRIPTION \nTHIS ROLE IS FIRST AND FOREMOST A SALES POSITION, WITH ADDITIONAL RESPONSIBILITIES AS OUTLINED ABOVE. THE ROLE IS REMOTE AND REPORTING TO THE SVP OF GROWTH. THE RIGHT CANDIDATE IS CAPABLE AND EXPERIENCED IN THE FOLLOWING: BUSINESS DEVELOPMENT (SALES) FOCUSED ON COMMUNITY HEALTH PLANS REQUIRING PRECISE INSIGHTS AND DIRECTED ACTIONS TO IMPROVE MEMBER HEALTH OUTCOMES AND REDUCE COST AND RISK EXPOSURES. DIRECT RELATIONSHIP DEVELOPMENT AND MANAGEMENT OF TARGET MARKET BUSINESS LEADERS AND INFLUENCERS. FOR SIFTWELL THESE CURRENTLY INCLUDE: POPULATION HEALTH, QUALITY, RISK ADJUSTMENT, MARKETING, AND OTHER CLINICAL OPERATIONS FUNCTIONS. ADVANCEMENT OF NEW AND EXISTING PIPELINE OPPORTUNITIES. CONDUCTION OF MARKET RESEARCH TO ENSURE PURSUING RELEVANT MARKETS FOR SIFTWELL AND RESONANCE WITH SIFTWELL’S PRODUCT IN THE MARKET. COLLABORATION WITH MARKETING TO INCREASE LEAD QUANTITY AND QUALITY. PROVEN ABILITY TO CLOSE BUSINESS WITHIN THE DEFINED CONTRACTING PERIOD. DEMONSTRATED EXPERIENCE PARTNERING WITH CLIENT SUCCESS TEAMS FOR SMOOTH IMPLEMENTATION, AND TO RETAIN AND EXPAND CURRENT CONTRACTS. PIPELINE MANAGEMENT AND ACCURATE REPORTING. OPEN INTELLECTUAL CURIOSITY AND EMPATHY TO DEEPLY UNDERSTAND THE CHALLENGES AND DYNAMICS IN THE MANAGED CARE INDUSTRY AND THEIR LOCAL NUANCES. FAMILIARITY WITH CHALLENGER AND CONSULTATIVE SALES PRINCIPLES.  THIS ROLE IS SIGNIFICANTLY EXTERNAL-FACING AND AS A RESULT WE ESTIMATE 30-50% TRAVEL DEPENDING ON THE TIME OF YEAR.  POSITION REQUIREMENTS/ATTRIBUTES 5+ YEARS OF EXPERIENCE SELLING A SAASS OR SERVICE IN THE HEALTHCARE PAYER MARKETS. COMMUNITY HEALTH PLAN AND/OR MANAGED MEDICAID IS A PLUS. PROVEN ABILITY TO MEET SALES TARGETS OVER A MULTI-YEAR PERIOD. EXPERIENCE WITH CRM PLATFORMS SUCH AS HUBSPOT. NATIVE CURIOSITY, POISE, AND EMOTIONAL INTELLIGENCE. HIGHLY PROACTIVE AND COLLABORATIVE; STRONG TEAM PLAYER WITH A BIAS TO ACTION RATHER THAN A BIAS TO DELEGATION EAGER TO BE A “BIG FISH IN A SMALL POND” AND MAKE A SUBSTANTIAL IMPACT ON THE ORGANIZATION AND ON OUR MARKET ABILITY TO PIVOT BASED ON MARKET CONDITIONS. ABILITY TO WORK WITH THE LEGAL TEAM TO SECURE CONTRACTS IN A TIMELY FASHION. ABILITY TO COMMUNICATE WITH CLIENT SUCCESS AND PRODUCT TEAMS TO ENSURE SMOOTH INTERNAL COLLABORATION IN SERVING CURRENT, PROSPECTIVE, AND NEW CLIENTS.  KEY METRICS SALES RELATIVE TO TARGETS REVENUE REALIZATION CONTRACT GROSS PROFIT  COMPENSATION & BENEFITS COMPETITIVE BASE SALARY PARTICIPATION IN SIFTWELL’S COMMISSION PLAN PARTICIPATION IN SIFTWELL’S EMPLOYEE STOCK OPTION PLAN HEALTH INSURANCE REIMBURSEMENT 401K MATCH COMPANY-PROVIDED EQUIPMENT FOR SIFTWELL-RELATED WORK UNLIMITED TIME OFF \n ",
    "job_skill_set": [
      "business development",
      "sales",
      "CRM platforms",
      "client success",
      "communication",
      "collaboration",
      "emotional intelligence",
      "proactivity",
      "relationship building",
      "strategic thinking",
      "teamwork",
      "intellectual curiosity",
      "adaptability",
      "pipeline management",
      "market research",
      "partnership development",
      "data analytics",
      "healthcare knowledge",
      "contract negotiation"
    ],
    "short_keywords": [
      "adaptability",
      "analytics",
      "building",
      "business",
      "businessdevelopment",
      "client",
      "collaboration",
      "communication",
      "contract",
      "crm",
      "curiosity",
      "data",
      "development",
      "emotional",
      "healthcare",
      "intellectual",
      "intelligence",
      "knowledge",
      "management",
      "market",
      "negotiation",
      "of",
      "partnership",
      "pipeline",
      "platforms",
      "president",
      "proactivity",
      "relationship",
      "research",
      "sales",
      "strategic",
      "success",
      "teamwork",
      "thinking",
      "vice"
    ]
  },
  {
    "job_id": "3905332488",
    "job_title": "Business Development Associate",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ABOUT LIBERATED WAY:\nWE SUPPORT LEADERS IN AUTHENTICALLY PARTNERING WITH THEIR SCHOOL COMMUNITIES TO DREAM, AUTHOR, AND CREATE STUDENT-CENTERED VISIONS FOR LEARNING. WE BRING THAT VISION TO LIFE BY HELPING SCHOOL COMMUNITIES UNDERSTAND AND IMPLEMENT THE PRACTICAL STRATEGIES NEEDED FOR WHOLE-CHILD SUCCESS. OUR WORK IS COMMUNITY-DRIVEN, STUDENT-CENTERED, AND SUSTAINABLE. VISIT OUR WEBSITE - HTTPS://WWW.LIBERATEDWAY.ORG/ - TO LEARN MORE.\nESSENTIAL JOB FUNCTIONS:SHAPING AND EXECUTING GEOGRAPHY-SPECIFIC SALES STRATEGIES, INCLUDING GAINING PREFERRED VENDOR APPROVAL IN TARGETED STATESPREPARING FOR AND FACILITATING OPPORTUNITY EXPLORATION CONVERSATIONS WITH PROSPECTIVE CLIENTSCREATING, REFINING, AND MANAGING INTERNAL BUSINESS DEVELOPMENT STRUCTURES, PROCESSES, AND TOOLSRESEARCHING, IDENTIFYING, AND RESPONDING TO RELEVANT PHILANTHROPIC, FEDERAL, AND/OR STATE GRANT OPPORTUNITIES; SUPPORTING RELATED FUNDING EFFORTS.DEVELOPING PROPOSALS AND RFP RESPONSESSUPPORTING LIBERATED WAY CLIENT WORK AS NEEDED, INCLUDING BUT NOT LIMITED TO PROJECT MANAGEMENT, CONTENT DEVELOPMENT, AND FACILITATION OF CLIENT WORKING SESSIONSSUPPORTING TEAM INITIATIVES INCLUDING BUT NOT LIMITED TO CONTENT CODIFICATION, PACKAGING NEW OFFERINGS, AND TEAM PROFESSIONAL DEVELOPMENT WRITE COHERENT, ORGANIZED, AND COMPELLING PROPOSALSAPPLY KNOWLEDGE OF FUNDRAISING METHODS AND PLANS TO REACH REVENUE GOALS COLLABORATE WITH TEAM MEMBERS IN THE ORGANIZATION TO ASSIST WITH OTHER FUNDRAISING PROJECTS AND DEVELOP RELATIONSHIPS WITH KEY STAKEHOLDERS\n\nCOMPENSATION DETAILS: 62000-70000 YEARLY SALARY",
    "job_skill_set": [
      "sales strategies",
      "business development",
      "stakeholder engagement",
      "communication",
      "collaboration",
      "organizational skills",
      "problem solving",
      "facilitation",
      "teamwork",
      "strategic thinking",
      "relationship building",
      "proposal development",
      "grant writing",
      "project management",
      "fundraising methods",
      "content development"
    ],
    "short_keywords": [
      "associate",
      "building",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "content",
      "development",
      "engagement",
      "facilitation",
      "fundraising",
      "grant",
      "management",
      "methods",
      "organizational",
      "problem",
      "project",
      "proposal",
      "relationship",
      "sales",
      "skills",
      "solving",
      "stakeholder",
      "strategic",
      "strategies",
      "teamwork",
      "thinking",
      "writing"
    ]
  },
  {
    "job_id": "3904973104",
    "job_title": "Vice President of Business Development and Sales Organization - Marketing Agency",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "LAMARK MEDIA (“LAMARK”) IS AN INTEGRATED DIGITAL MARKETING FIRM DRIVEN BY A SIMPLE PHILOSOPHY: CREATE EXTRAORDINARY MARKETING CAMPAIGNS THAT YIELD POSITIVE, MEASURABLE RESULTS FOR THEIR CLIENTS. LAMARK’S METHODOLOGY IS TO CREATE A CUSTOM OMNICHANNEL STRATEGY THAT LEVERAGES DIGITAL MARKETING ASSETS LIKE A PORTFOLIO WHICH CAN BE MEASURED, OPTIMIZED, AND SCALED FOR LONG-TERM SUCCESS.OUR MISSION IS TO CREATE MORE VALUE FOR OTHERS. OUR CORE VALUES INSPIRE US TO OVER-DELIVER ON EXPECTATIONS AND TO CREATE MORE SUCCESS FOR THE PARTNERS WE SERVE. JOIN OUR TEAM OF SMART, PASSIONATE, COLLABORATIVE, RESULTS-DRIVEN DO-ERS. WE WORK HARD EVERY DAY TO DELIVER REMARKABLE EXPERIENCES TO OUR CLIENTS, AND ULTIMATELY, THEIR CUSTOMERS. ESSENTIAL DUTIES INCLUDE THE FOLLOWING:· GENERATE AND SUPPORT NEW RELATIONSHIPS (POTENTIAL CLIENTS) THAT COME THROUGH LAMARK’S INBOUND FUNNEL, AS WELL AS CURRENT CLIENTS AND INCREMENTAL REFERRALS.SUPPORT OUTBOUND BUSINESS DEVELOPMENT INITIATIVES OF THE COMPANY AND HELP PROMOTE LAMARK’S BRAND IN THE MARKETPLACE.LEAD DISCOVERY ON NEW BUSINESS CALLS/MEETINGS AND ANALYZE THE EFFECTIVENESS OF DIGITAL CAMPAIGNS.PERFORM DIAGNOSIS AND CONSTRUCT SOLUTIONS TO BUSINESS PROBLEMS OR OPPORTUNITIES (AS COMMUNICATED BY THE CLIENT) AND DEMONSTRATE A DEEP UNDERSTANDING OF HOW DIGITAL MARKETING CAN DRIVE OUTCOMES - BOTH EXTERNALLY WITH PROSPECTS AND INTERNALLY WITH THE TEAM WHO ARE BUILDING PROPOSALS.OVERSEE AND ORCHESTRATE THE PROPOSAL (AND/OR RFP) PROCESS FOR PROSPECTIVE CLIENTS BETWEEN THE CLIENT AND OUR INTERNAL TEAMS PERFORMING THE WORK TO MEET TIMELINES AND QUALITY STANDARDS CONDUCIVE TO CLOSING NEW BUSINESS WITH EFFICIENCY AND EXCELLENCE.CONDUCTS RESEARCH TO IDENTIFY INTERNAL AND EXTERNAL OPPORTUNITIES TO EXPAND AND OPTIMIZE REVENUE-PRODUCING ACTIVITIES.ESTABLISHES TARGETS, POLICIES, AND INTERNAL PROCESSES TO ACHIEVE EFFICIENCIES IN REVENUE GENERATION AND CAPTURE.DIRECT AND WORK WITH THE MARKETING MANAGEMENT TEAM TO FORM BUSINESS PLANS AND STRATEGIES TO ACCOMPLISH CORPORATE OBJECTIVES.DEVELOP AND EXECUTE MULTI-CHANNEL PLANS TO DRIVE NEW CUSTOMER ACQUISITION, DETERMINING THE OPTIMAL CHANNEL MIX, CREATIVE MESSAGE, AND BUDGET ALLOCATION.OVERSEE MARKET RESEARCH, PRODUCT PLANNING, AND ADVERTISING INSIGHTS TO IDENTIFY CORE CATEGORIES TO PROMOTE LAMARK, SERVICES TO CROSS-SELL AND UPSELL CURRENT CLIENTS, AS WELL AS TAKE PRODUCT OR INDUSTRY-FOCUSED MATERIALS TO MARKET TO SPUR MORE ACTIVITY.ELEVATE THE BRAND IN THE ENHANCEMENT OF THE VALUE PROPOSITION, CONTENT STRATEGY, AND OVERALL COMPANY BRAND EXPERIENCE.REQUIREMENTS:A BACHELOR’S DEGREE IN BUSINESS, MARKETING, COMMUNICATIONS, OR A RELATED FIELD FROM AN ACCREDITED COLLEGE OR FOUR-YEAR UNIVERSITY IS REQUIRED. MASTER’S DEGREE BENEFICIAL.MINIMUM OF TEN (10) YEARS OF MARKETING EXPERIENCE, WITH AT LEAST FIVE (5) YEARS OF STRATEGIC LEADERSHIP EXPERIENCE.COMPREHENSIVE EXPERIENCE AND INSIGHTS INTO DIGITAL MARKETING BY THE CHANNEL, INCLUDING SEARCH ENGINE MARKETING (PAID AND ORGANIC), SOCIAL MEDIA MARKETING (PAID AND ORGANIC), LIFECYCLE MARKETING (EMAIL/SMS), PROGRAMMATIC ADVERTISING, CONNECTED TV, CREATIVE, WEBSITE DEVELOPMENT, AND OTHER CORE AND/OR EMERGING DIGITAL CHANNELS.DEEP KNOWLEDGE OF THE MIDDLE-MARKET ENVIRONMENT, INCLUDING THE WANTS/NEEDS OF MID-MARKET COMPANIES AND WHAT KPIS THEY ARE INTERESTED IN.EXCELLENT ANALYTICAL SKILLS: ABLE TO MAKE DATA-DRIVEN DECISIONS AND ESTABLISH EFFECTIVE METRICS TO APPROACH MARKETING STRATEGY.SETTING AND ACHIEVING KEY PERFORMANCE INDICATORS (KPIS) ALIGNED WITH THE OVERALL BUSINESS OBJECTIVES FOR THE MARKET, INCLUDING LONG-TERM STRATEGIC ACTIVITIES AND SHORT-TERM LEAD GENERATIONADVANCED KNOWLEDGE OF LEADING A MARKETING TEAM THROUGH ESTABLISHING A CLEAR DIRECTION DEVELOPING AND EMPOWERING A TEAM AND AUDITING PERFORMANCE TO ENSURE CONSISTENT EXECUTION.EXCELLENT WRITTEN, PUBLIC SPEAKING, AND PRESENTATION SKILLS WITH DEMONSTRATED EXPERIENCE WITH EXECUTIVE AUDIENCES.EXPERIENCE IN PUBLIC RELATIONS, LEAD GENERATION, DIGITAL, VIDEO, SOCIAL MEDIA, EVENTS, COMMUNICATIONS, AND BRANDING.EXCELLENT ORGANIZATIONAL SKILLS.STRONG VERBAL AND WRITTEN COMMUNICATION, NEGOTIATING, AND PRESENTATION SKILLS.ABLE TO TRAVEL LOCALLY OR NATIONALLY.\nPERKS & BENEFITS· INCREDIBLE COMPANY CULTURE - WE ARE PASSIONATE ABOUT THE IMPACT WE MAKE EVERY DAY, WE BALANCE FREEDOM WITH RESPONSIBILITY, AND WE AIM FOR A CONSULTATIVE, TRANSPARENT, AND COMMUNICATIVE APPROACH IN BOTH OUR INTERNAL AND CLIENT RELATIONSHIPS· DIVERSE AND FORWARD-THINKING ENVIRONMENT· GREAT CAREER GROWTH OPPORTUNITY—YOU’LL HAVE DIRECT ACCESS TO AGENCY LEADERSHIP· COMPANY-ASSISTED MEDICAL INSURANCE PROGRAMS, LIFE INSURANCE, OPTIONAL VISION AND DENTAL INSURANCE PROGRAMS, AND SHORT-TERM AND LONG-TERM DISABILITY OFFERED· 401(K) WITH EMPLOYER MATCHING ",
    "job_skill_set": [
      "strategic leadership",
      "data analysis",
      "market research",
      "brand enhancement",
      "lead generation",
      "presentation skills",
      "organizational skills",
      "communication",
      "negotiation",
      "team leadership",
      "collaboration",
      "problem solving",
      "adaptability",
      "creativity",
      "time management",
      "digital marketing",
      "search engine marketing",
      "social media marketing",
      "lifecycle marketing",
      "programmatic advertising",
      "website development",
      "KPI setting",
      "proposal management",
      "budget allocation",
      "public relations"
    ],
    "short_keywords": [
      "adaptability",
      "advertising",
      "agency",
      "allocation",
      "analysis",
      "and",
      "brand",
      "budget",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "creativity",
      "data",
      "development",
      "digital",
      "engine",
      "enhancement",
      "generation",
      "kpi",
      "lead",
      "leadership",
      "lifecycle",
      "management",
      "market",
      "marketing",
      "media",
      "negotiation",
      "of",
      "organization",
      "organizational",
      "presentation",
      "president",
      "problem",
      "programmatic",
      "proposal",
      "public",
      "relations",
      "research",
      "sales",
      "search",
      "setting",
      "skills",
      "social",
      "solving",
      "strategic",
      "team",
      "time",
      "vice",
      "website"
    ]
  },
  {
    "job_id": "3903852274",
    "job_title": "Business Development Manager (Seattle or Portland)",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ELEMENT HAS AN OPPORTUNITY FOR A BUSINESS DEVELOPMENT MANAGER RESPONSIBLE FOR NAMED ACCOUNTS WITHIN A SPECIFIC GEOGRAPHIC AREA. THE BUSINESS DEVELOPMENT MANAGER (BDM) IS LOCATED IN SEATTLE. THE BDM WILL MANAGE AND SELL INTO AN ESTABLISHED BOOK OF BUSINESS AS WELL AS DEVELOP NEW BUSINESS AND ACCOUNTS IN A DEFINED GEOGRAPHICAL AREA. IN THIS ROLE YOU WILL SELL THE FULL BREADTH OF ELEMENT SERVICES WITHIN YOUR ACCOUNTS IN ORDER TO MEET ASSIGNED BUDGETS. ELEMENT IS A WORLD RENOWN AEROSPACE TESTING COMPANY WITH CLIENTS SUCH AS BOEING, SPACEX AND BLUE ORIGIN.  AT ELEMENT OUR SHARED PURPOSE OF ‘MAKING TOMORROW SAFER THAN TODAY’ IS WHAT BRINGS US TOGETHER. WE ARE ENERGIZED BY OUR AMBITION TO MAKE THE WORLD A BETTER PLACE AND CREATE A SAFER FUTURE FOR PEOPLE. THIS IS WHAT SETS US (AND YOU, IF YOU JOIN US…) APART FROM THE CROWD.  RESPONSIBILITIES:ESTABLISH AND PROACTIVELY MAINTAIN A STRONG PROFESSIONAL RELATIONSHIP WITH KEY DECISION MAKERS AND INFLUENCERS WITHIN ASSIGNED ACCOUNTSDRIVE PROFITABLE SALES EXPANSION WITH A FOCUS ON ACQUIRING NEW AND RE-ENGAGING WITH DORMANT ACCOUNTS, WHILE GROWING EXISTING CLIENTSGATHER AND ANALYZE MARKET AND INDUSTRY INTELLIGENCE, METRICS, AND TRENDS TO DETERMINE CUSTOMER NEEDSREPRESENT COMPANY AT INDUSTRY ASSOCIATION MEETINGS TO PROMOTE COMPANY WITH SERVICES OFFEREDPREPARE REPORTS AND PRESENTATIONS SHOWING SALES VOLUME BY SECTOR, REGION, LOCATION, POTENTIAL SALES, AND AREAS OF PROPOSED CLIENT BASE EXPANSIONACTIVELY UTILIZE CRM TO RECORD ACTIVITIES, ENSURING CONTACT DETAILS ARE ACCURATE, DUPLICATES ARE REMOVED, NEW INFORMATION IS ADDED, AND ACCURATE CALL/VISIT LOGS ARE ENTERED\n\nQUALIFICATIONS:THIS IS A FAST-PACED ENVIRONMENT, AND WE NEED SOMEONE WHO IS PROACTIVE, SELF-MOTIVATED AND A TEAM PLAYER. THE PERSON FOR THIS ROLE WILL BE A SPECIALIST IN THEIR FIELD, RESPECTED BY ALL WHO THEY WORK WITH, KEEN TO LEARN AND ENTHUSIASTIC IN THE FACE OF CHALLENGE. YOU WILL NEED :5 YEARS OF TECHNICAL EXPERIENCE WITH SALES RESPONSIBILITIESPROFICIENCY IN MICROSOFT APPLICATIONS (DYNAMICS AX AND CRM, WORD, EXCEL)WELL-DEVELOPED ORAL AND WRITTEN COMMUNICATION SKILLS TO MEET A VARIETY OF COMMUNICATION NEEDSABILITY TO INTERFACE WITH CLIENTS, WIN NEW WORK AND DETERMINE THEIR REQUIREMENTS; HELPS DEVELOPS PROPOSALS INCLUDING COST ESTIMATES, WORK PLAN AND TERMS AND CONDITIONSABILITY TO TRAVEL UP TO 50% OF THE TIME; SOME OVERNIGHT TRAVEL MAY BE REQUIRED\nSALARY: $80K-$100K + SALES COMP\nNOTE: THIS POSITION REQUIRES ACCESS TO EXPORT-CONTROLLED COMMODITIES, TECHNICAL DATA, TECHNOLOGY, SOFTWARE, AND SERVICES. U.S. CITIZENSHIP, U.S. LEGAL PERMANENT RESIDENT STATUS, PROTECTED PERSON STATUS UNDER 8 U.S.C. § 1324B(A)(3), OR U.S. GOVERNMENT EXPORT AUTHORIZATION IS REQUIRED. ANY OFFER OF EMPLOYMENT IS CONTINGENT UPON THE EMPLOYER OBTAINING THE NECESSARY EXPORT AUTHORIZATION, INCLUDING, IF REQUIRED, AN EXPORT LICENSE FROM THE U.S. DEPARTMENT OF COMMERCE’S BUREAU OF INDUSTRY AND SECURITY, THE U.S. DEPARTMENT OF STATE’S DIRECTORATE OF DEFENSE TRADE CONTROLS, OR OTHER APPLICABLE GOVERNMENT AGENCY.",
    "job_skill_set": [
      "sales",
      "communication",
      "proactive",
      "self-motivated",
      "team player",
      "relationship building",
      "enthusiasm",
      "adaptability",
      "CRM",
      "Microsoft Dynamics AX",
      "Microsoft Word",
      "Microsoft Excel",
      "market analysis",
      "proposal development",
      "technical experience"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "ax",
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "crm",
      "development",
      "dynamics",
      "enthusiasm",
      "excel",
      "experience",
      "manager",
      "market",
      "microsoft",
      "or",
      "player",
      "portland",
      "proactive",
      "proposal",
      "relationship",
      "sales",
      "seattle",
      "selfmotivated",
      "team",
      "technical",
      "word"
    ]
  },
  {
    "job_id": "3888943273",
    "job_title": "Business Development Representative / Phila., PA Area",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "BUSINESS DEVELOPMENT REPRESENTATIVE / PHILA., PA AREA | SEABROOK | TRENTON, NEW JERSEY\n\nABOUT THE JOB:\n\nTHE BUSINESS DEVELOPMENT REPRESENTATIVE IS RESPONSIBLE FOR GROWING THE FACILITY’S LINES OF SERVICE AND LEVELS OF CARE AS DEFINED BY MANAGEMENT BY DEVELOPING AND RETAINING REFERRALS FROM PROFESSIONAL REFERRAL SOURCES ACROSS VARIOUS ACCOUNT TYPES. REPRESENTS THE FACILITY TO THE PUBLIC, AS WELL AS HOSTING THE PUBLIC WHEN VISITING THE FACILITY. EMPLOYS CREATIVE APPROACHES WITH WELL-ESTABLISHED METHODS FOR GROWING REPUTATION AMONG PROFESSIONAL REFERRALS.\n\nROLES AND RESPONSIBILITIES:\n\nESSENTIAL FUNCTIONS:\n\n DEVELOPS AND IMPLEMENTS BUSINESS DEVELOPMENT PROGRAMS IN CONSULTATION WITH THE DIRECTOR OF BUSINESS DEVELOPMENT (DBD). MAINTAINS A SCHEDULE OF PRIMARY SOURCES INCLUDING BUSINESS, INDUSTRY, EAPS, MANAGED CARE OF CLIENTS, PHYSICIANS/LICENSED PRACTITIONERS, AND ALLIED HEALTH PROFESSIONALS. DOCUMENTS EVERY CONTACT IN THE APPROPRIATE CUSTOMER RELATIONSHIP MANAGEMENT (CRM) SYSTEM. MAINTAINS CURRENT ACCOUNT INFORMATION AND BUSINESS DEVELOPMENT REFERRAL/ADMISSION RECORDS AND STATISTICS, INCLUDING THE PREPARATION OF BUSINESS DEVELOPMENT REPORTS AND MATERIALS. DEVELOPS AND MAINTAINS NEW ACCOUNT RELATIONSHIPS AND MARKETS. TARGETS AND CREATES NEW STRATEGIES FOR INCREASING BUSINESS IN HIGHLY COMPETITIVE MARKETS. INCREASES THE NUMBER OF REFERRAL SOURCES WITHIN A FACILITY SUCH AS WITH PHYSICIAN, SOCIAL WORKERS AND DISCHARGE PLANNERS. DEVELOPS STRONG RELATIONSHIPS WITH KEY REFERRAL SOURCES. DEVELOPS AND MAINTAINS KEY BUSINESS DEVELOPMENT ACCOUNTS AND RESPONDS TO ALL BUSINESS DEVELOPMENT OPPORTUNITIES. MAINTAINS AND LENDS CUSTOMER SUPPORT TO DESIGNATED NUMBER OF TARGETED REFERRAL SOURCE CONTACTS PER WEEK, AS SET FORTH IN A QUARTERLY MARKETING PLAN. DEVELOPS AND CONDUCTS COMMUNITY WORKSHOPS AND SEMINARS AND FACILITY TOURS TO EDUCATES CLIENTS, FAMILIES, COMMUNITY AND OTHER REFERRAL SOURCES ON PROGRAMS, SERVICES AND AMENITIES PROVIDED BY FACILITY AND PROVIDES AN OPPORTUNITY TO IDENTIFY POTENTIAL REFERRAL SOURCES. REPRESENTS THE FACILITY AT CIVIC AND PROFESSIONAL FUNCTIONS AND COMMUNICATES MISSION IN ALL OUTREACH INTERACTIONS. ACTS A LIAISON BETWEEN THE FACILITY, REFERRAL SOURCES AND THE GENERAL PUBLIC TO FURTHER THE GOALS AND POSITIVE, PROFESSIONAL IMAGE OF THE FACILITY. MANAGES LEADS FROM REFERRAL SOURCES AND ENSURES EFFICIENT ADMISSIONS PROCESS FOR CLIENTS. MAINTAINS COLLABORATIVE WORKING RELATIONSHIP WITH ADMISSIONS DEPARTMENT COLLABORATES CLOSELY WITH FACILITY DISCHARGE PLANNERS, SOCIAL WORKERS, CASE MANAGERS, PHYSICIANS AND MANAGEMENT, AS WELL AS PROVIDE EDUCATION STAFF TO GENERATE REFERRAL SOURCES. MAINTAINS CURRENT AWARENESS OF CHANGES IN THE INDUSTRY THROUGH SELF-EDUCATION, PEER EDUCATION AND PROFESSIONAL AND COMMUNITY INVOLVEMENT FOR THE BETTERMENT OF THIS POSITION AND THE FACILITY. ATTENDS SCHEDULED DEPARTMENT MEETINGS TO PROVIDE TIMELY REPORTS ON MONTH-END REVIEWS, CLIENT SERVICING SCHEDULES, CUSTOMER SALES FORMS AND OTHER REPORTING REQUIREMENTS. GENERATES FACE TO FACE MEETINGS AND ADMISSIONS ACTIVITY PER GOAL AND DOCUMENTS IN CRM IN TIMELY MANNER.\n\n\nADDITIONAL RESPONSIBILITIES:\n\n COMPLIES WITH ORGANIZATIONAL POLICIES, PROCEDURES, PERFORMANCE IMPROVEMENT INITIATIVES AND MAINTAINS REGULATORY AND INDUSTRY STANDARDS. MAINTAINS REGULAR AND RELIABLE ATTENDANCE. ACCEPTS RESPONSIBILITY FOR PROFESSIONAL GROWTH AND DEVELOPMENT OF SELF AND ATTENDS ALL MANDATORY FACILITY IN-SERVICES AND STAFF DEVELOPMENT ACTIVITIES AS SCHEDULED. MAINTAINS PROFESSIONALISM AND CONFIDENTIALITY OF FACILITY EMPLOYEES AND PATIENTS. PERFORMS OTHER DUTIES AS ASSIGNED.\n\n\nEDUCATION/EXPERIENCE/SKILL REQUIREMENTS:\n\n HIGH SCHOOL DIPLOMA OR EQUIVALENT REQUIRED. ASSOCIATE’S OR BACHELOR’S DEGREE IN BUSINESS, BEHAVIORAL HEALTH, MARKETING, OR RELATED FIELD PREFERRED. AT LEAST TWO YEARS’ RELATED EXPERIENCE IN HEALTHCARE BUSINESS DEVELOPMENT AND MARKETING ROLE REQUIRED, PREFERABLY IN BEHAVIORAL HEALTH OR SUBSTANCE USE. GOOD UNDERSTANDING OF THE LOCAL MARKET AND REFERRAL BASE. ORGANIZED AND DEMONSTRATE THE ABILITY TO MULTITASK AND HAVE WELL-DEVELOPED AND EFFECTIVE RELATIONAL SKILLS. MUST BE ABLE AND WILLING TO WORK FLEXIBLE HOURS, INCLUDING EVENINGS, EARLY MORNINGS, AND WEEKENDS.\n\n\nLICENSES/DESIGNATIONS/CERTIFICATIONS:\n\nMUST HAVE AND MAINTAIN A VALID DRIVER'S LICENSE AND CLEAN DRIVING RECORD, MAINTAIN AUTOMOBILE INSURANCE COVERAGE AND HAVE ACCESS TO AN AUTOMOBILE, WHERE FACILITY REQUIRES.\n\nWHY SEABROOK?SEABROOK OFFERS A COMPREHENSIVE BENEFIT PLAN AND A COMPETITIVE SALARY COMMENSURATE WITH EXPERIENCE AND QUALIFICATIONS. QUALIFIED CANDIDATES SHOULD APPLY BY SUBMITTING A RESUME. SEABROOK IS AN EOE.\n\nVETERANS AND MILITARY SPOUSES ARE HIGHLY ENCOURAGED TO APPLY. SUMMIT BHC IS DEDICATED TO SERVING VETERANS WITH SPECIALIZED PROGRAMMING AT OUR TREATMENT CENTERS ACROSS THE COUNTRY. WE RECOGNIZE AND VALUE THE UNIQUE STRENGTHS OF THE MILITARY COMMUNITY IN SUPPORTING OUR MISSION TO SERVE THOSE WHO HAVE SERVED.",
    "job_skill_set": [
      "business development",
      "customer relationship management (CRM)",
      "healthcare knowledge",
      "community outreach",
      "account management",
      "communication",
      "relationship building",
      "organizational skills",
      "multitasking",
      "professionalism",
      "problem solving",
      "self-motivation",
      "team collaboration",
      "adaptability",
      "confidentiality",
      "marketing",
      "data analysis",
      "report preparation",
      "flexible hours",
      "automobile operation"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "analysis",
      "area",
      "automobile",
      "building",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "community",
      "confidentiality",
      "crm",
      "customer",
      "data",
      "development",
      "flexible",
      "healthcare",
      "hours",
      "knowledge",
      "management",
      "marketing",
      "multitasking",
      "operation",
      "organizational",
      "outreach",
      "pa",
      "phila",
      "preparation",
      "problem",
      "professionalism",
      "relationship",
      "report",
      "representative",
      "selfmotivation",
      "skills",
      "solving",
      "team"
    ]
  },
  {
    "job_id": "3905336446",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "IF YOU SHOP ONLINE (AND WHO DOESN’T THESE DAYS?), THEN CHANCES ARE YOU’VE ALREADY INTERACTED WITH YOTPO. WE’RE A LEADING ECOMMERCE RETENTION MARKETING PLATFORM, ON A MISSION TO HELP BRANDS OF ALL SIZES TURN ONE-TIME SHOPPERS INTO CUSTOMERS FOR LIFE. LOYALTY PROGRAMS, SMS AND EMAIL MARKETING, SUBSCRIPTIONS, AND REVIEWS ARE OUR BREAD AND BUTTER, BUT WE HAVE MORE SOLUTIONS UP OUR SLEEVE, TOO.\n\nWE HAVE TEAMS ACROSS THE WORLD, INCLUDING THE US, CANADA, UK, ISRAEL, BULGARIA, AND AUSTRALIA — AND WE’RE STILL GROWING. OUR PRIMARY GOAL IS TO DELIVER THE BEST TECHNOLOGY IN THE INDUSTRY.\n\nYOU CAN HEAR ALL ABOUT IT IN OUR LATEST BRAND VIDEO.\n\nSOUNDS EXCITING? THEN READ ON, BECAUSE WE’RE IN PURSUIT OF THE BEST AND THE BRIGHTEST MINDS TO HELP US ACHIEVE OUR VISION.\n\nAS A YOTPO BUSINESS DEVELOPMENT REPRESENTATIVE (BDR), YOUR ROLE WILL HAVE A SIGNIFICANT IMPACT ON THE GROWTH OF YOTPO AS AN ORGANIZATION. SIMULTANEOUSLY, IT WILL HAVE AN IMMEDIATE IMPACT ON THE ADVANCEMENT OF YOUR CAREER. WE ARE SCALING AT A RAPID PACE AND WE ARE LOOKING FOR CANDIDATES WHO EMBRACE A CHALLENGE, ARE EAGER TO LEARN, ADAPTABLE, AND HAVE THE PASSION TO BE SUCCESSFUL. WE WILL MAKE IT OUR JOB TO HELP YOU LEARN THE SKILLS YOU NEED NOT ONLY FOR THIS ROLE BUT ALSO FOR YOUR FUTURE.\n\nYOU WILL:\n\nBE A HUNTER, FIND IDEAL ACCOUNTS AND PROSPECTS FOR YOTPO’S PRODUCTS IDENTIFY TRIGGERS AND PROBLEMS BRANDS MAY BE HAVING TO REACH OUT WITH PURPOSEARTICULATE THE YOTPO BUSINESS NARRATIVE TO DECISION-MAKERS TO ASSESS BUYING INTERESTBUILD POSITIVE CONNECTIONS AS OFTEN THE FIRST IMPRESSION OF COMMUNICATION BETWEEN YOTPO AND PROSPECTSSET OUTBOUND MEETINGS FOR ACCOUNT EXECUTIVES TO CLOSE BUSINESSMEET MONTHLY AND QUARTERLY QUALIFIED MEETING AND REVENUE OBJECTIVESCOMPLETE ACCURATE TRACKING OF COMMUNICATION IN SALESFORCEREPORT DIRECTLY TO THE MANAGER OF SALES DEVELOPMENT, AMERICAS BE HYBRID IN EITHER OUR TO OR NYC OFFICE\n\nABOUT YOU:\n\nYOU HAVE A MINIMUM OF 6 MONTHS IN A PREVIOUS OUTBOUND ROLE IN A SOFTWARE B2B SETTINGYOU’RE FAMILIAR WITH SALESFORCE, LINKEDIN SALES NAVIGATOR, G-SUITE YOU HAVE A HIGH LEVEL OF ENERGY, DRIVE, INITIATIVE, GRIT, COMMITMENT AND PROFESSIONALISMYOU HAVE EXCELLENT COMMUNICATION, INTERPERSONAL, ORGANIZATIONAL, AND PHONE SKILLSYOU ARE ORGANIZED AND EFFECTIVELY MANAGE YOUR TIME, PRIORITIZE TASKS, AND WORK WITHIN DEADLINESYOU ARE INNATELY CURIOUS, COACHABLE, AND GREAT AT ACTIVE LISTENING YOU LEVERAGE A STRATEGIC SALES APPROACH YOU ARE EAGER TO PURSUE A CAREER IN SALESYOU HAVE (AT LEAST SOME!) ENTHUSIASM FOR THE ECOMMERCE SPACE \n\nNICE TO HAVE:\n\nEXPERIENCE WITH SALESLOFT, SIMILARWEB, CHILI PIPER, 6SENSE YOU’VE PREVIOUSLY REACHED OUT TO MARKETING FUNCTIONS\n\nIF YOU DON’T MEET 100% OF THE QUALIFICATIONS OUTLINED ABOVE - THAT’S OKAY, NOBODY’S PERFECT! WE BELIEVE IN HIRING PEOPLE, NOT JUST SKILLS. WE ENCOURAGE YOU TO APPLY IF YOU THINK THIS IS A ROLE THAT WOULD MAKE YOU EXCITED TO COME TO WORK EVERY DAY.\n\nBASE SALARY: $58,500 - 60,000\n\nIN ADDITION TO BASE SALARY, THIS ROLE INCLUDES A VARIABLE COMPENSATION COMPONENT. BASE SALARY RANGES ARE DETERMINED BY MULTIPLE FACTORS UNIQUE TO EACH CANDIDATE, INCLUDING SKILLS AND LOCAL MARKET BENCHMARKS.\n\nABOUT YOTPO US:\n\n100% COVERAGE OF EMPLOYEE MEDICAL PREMIUMS; 90% COVERAGE FOR DEPENDENT/FAMILY PREMIUMS.100% COVERAGE OF EMPLOYEE DENTAL + VISION PREMIUMS.COMPREHENSIVE LIFE AND DISABILITY INSURANCE.FLEXIBLE TIME OFF (FTO) POLICY, SICK TIME, AND PAID HOLIDAYS.EQUITY IN OPTIONS.COMPANY SPONSORED 401K MATCHING.PRE-TAX COMMUTER AND HEALTHCARE BENEFITS.COMPREHENSIVE PAID LEAVE FOR NEW PARENTS AND DEPENDENT CARE FSA.INDIVIDUALIZED CAREER DEVELOPMENT, REWARDS AND RECOGNITION.WELLNESS AND PHILANTHROPIC PROGRAMMING AND EVENTS.WE ARE WORKING IN A HYBRID CAPACITY, SPENDING 3 DAYS PER WEEK IN OUR NYC OFFICE.LEARN MORE ABOUT OUR RECRUITING PROCESS.MEET THE TEAM: ALISON GRESHAM, ADAM LONG, JEFF COOPER, KEVIN MCCARRON \n\nYOTPO’S EMPLOYEE-CENTRIC CULTURE HAS CONSISTENTLY EARNED US COVETED SPOTS ON BUILT IN’S BEST PLACES TO WORK LISTS IN BOTH NYC AND AUSTIN AND MOGUL’S COMPANIES WITH MOST INCLUSIVE BENEFITS OVER THE YEARS. DIRECTLY INSPIRED BY EMPLOYEE FEEDBACK, WE CREATE OPPORTUNITIES TO BRING OUR TEAMS TOGETHER. YOTPO PROGRAMMING INCLUDES TEAM EVENTS, EDUCATIONAL FIRESIDE CHATS, END OF YEAR CELEBRATIONS, AFFINITY GROUPS AND PARTNERSHIPS.\n\nYOTPO IS FOR EVERYONE, AND WE’RE COMMITTED TO ANTI-RACIST WORK. WE WELCOME AND EMPLOY PEOPLE REGARDLESS OF RACE, COLOR, GENDER IDENTITY, RELIGION, GENETIC INFORMATION, PARENTAL OR PREGNANCY STATUS, NATIONAL ORIGIN, SEXUAL ORIENTATION, AGE, CITIZENSHIP, MARITAL STATUS, DISABILITY, OR VETERAN STATUS. WE ARE PROUD TO BE AN EQUAL OPPORTUNITY EMPLOYER, A PLACE WHERE YOUR VOICE IS HEARD AND YOUR PERSPECTIVE IS ENCOURAGED. COME JOIN US AND HELP US BUILD A GLOBAL COMPANY WHERE WE'RE ALL PROUD TO BELONG.\n\n",
    "job_skill_set": [
      "Communication",
      "Interpersonal Skills",
      "Organizational Skills",
      "Time Management",
      "Adaptability",
      "Initiative",
      "Commitment",
      "Professionalism",
      "Teamwork",
      "Strategic Sales Approach",
      "Salesforce",
      "LinkedIn Sales Navigator",
      "G-Suite",
      "Salesloft",
      "SimilarWeb",
      "Chili Piper",
      "6sense",
      "Active Listening",
      "Curiosity",
      "Grit",
      "Enthusiasm for Ecommerce"
    ],
    "short_keywords": [
      "6sense",
      "active",
      "adaptability",
      "approach",
      "business",
      "businessdevelopment",
      "chili",
      "commitment",
      "communication",
      "curiosity",
      "development",
      "ecommerce",
      "enthusiasm",
      "for",
      "grit",
      "gsuite",
      "initiative",
      "interpersonal",
      "linkedin",
      "listening",
      "management",
      "navigator",
      "organizational",
      "piper",
      "professionalism",
      "representative",
      "sales",
      "salesforce",
      "salesloft",
      "similarweb",
      "skills",
      "strategic",
      "teamwork",
      "time"
    ]
  },
  {
    "job_id": "3902841514",
    "job_title": "Business Development Manager - Private Equity",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "WE ARE THE LEADING PROVIDER OF PROFESSIONAL SERVICES TO THE MIDDLE MARKET GLOBALLY, OUR PURPOSE IS TO INSTILL CONFIDENCE IN A WORLD OF CHANGE, EMPOWERING OUR CLIENTS AND PEOPLE TO REALIZE THEIR FULL POTENTIAL. OUR EXCEPTIONAL PEOPLE ARE THE KEY TO OUR UNRIVALED, INCLUSIVE CULTURE AND TALENT EXPERIENCE AND OUR ABILITY TO BE COMPELLING TO OUR CLIENTS. YOU’LL FIND AN ENVIRONMENT THAT INSPIRES AND EMPOWERS YOU TO THRIVE BOTH PERSONALLY AND PROFESSIONALLY. THERE’S NO ONE LIKE YOU AND THAT’S WHY THERE’S NOWHERE LIKE RSM.\n\nBUSINESS DEVELOPMENT MANAGER – PRIVATE EQUITY \n\nLOCATION: SAN FRANCISCO BAY AREA\n\nJOB SUMMARY:\n\nTHIS INDIVIDUAL WILL SERVE AS A STRATEGIC CONTRIBUTOR AND TACTICAL INITIATOR FOR THE FIRM’S PRIVATE EQUITY BUSINESS DEVELOPMENT GROUP. THIS INDIVIDUAL WILL COORDINATE WITH NUMEROUS FIRM RESOURCES TO DEVELOP AND EXECUTE A MARKET GROWTH STRATEGY AND APPROACH FOR EACH PRIVATE EQUITY FIRM ASSIGNED TO THEM AND IN SUPPORT OF OTHERS WITHIN THE FIRM. THIS ROLE WILL FULLY UNDERSTAND ALL ASPECTS OF THE FIRMS' PRIVATE EQUITY STRATEGY AND LEVERAGE TOOLS, SUPPORT AND BEST PRACTICES TO EXPAND THE FIRM'S RELATIONSHIPS AND WALLET SHARE WITHIN THEIR PRIVATE EQUITY ASSIGNMENTS.\n\nJOB DUTIES:\n\nCONDUCT RESEARCH OF ASSIGNED PRIVATE EQUITY GROUPS AND PROVIDE ANALYSIS, SYNTHESIS AND DELIVERY OF DATA TO PROVIDE HIGHER VALUE INFORMATION IN SUPPORT OF THE PRIVATE EQUITY BUSINESS DEVELOPMENT TEAM, DIRECTORS AND PARTNERSRESPOND TO REQUESTS FROM PE BUSINESS DEVELOPERS AND PARTNERS FOR INFORMATION ON PRIVATE EQUITY GROUPS IN SUPPORT OF PURSUITSSUPPORT RESEARCH, ANALYSIS AND PLANNING FOR OVERALL PE PRACTICECOLLABORATE AND SUPPORT ASSIGNED CURRENT PE BUSINESS DEVELOPMENT DIRECTORS AND PE BUSINESS DEVELOPMENT TEAM LEADER ON TEAM ON KEY ACCOUNTS AND INITIATIVESINTERACT WITH PROFESSIONAL STAFF TO COLLABORATIVELY ADDRESS THE PE MARKETPLACE IN A TEAM ORIENTATED COORDINATED FASHIONIN COORDINATION WITH THE PE BUSINESS DEVELOPMENT DIRECTORS, BUILD AND MAINTAIN STRONG SALES PIPELINES AND FORECASTS ASSOCIATED TO SUBSTANTIATED OPPORTUNITIESPREPARE AND FACILITATE PRESENTATIONS, PROPOSALSCLOSE SALES, AND FINALIZE AGREEMENTS WITH CLIENTSIN COORDINATION WITH THE PE BUSINESS DEVELOPMENT DIRECTORS, IDENTIFY AND LEAD A COORDINATED, CROSS FUNCTIONAL TEAM TO PURSUE ALL ASPECTS OF THE PE RELATIONSHIP AS OR IN COLLABORATION WITH THE PE CLIENT SERVICE COORDINATORIDENTIFY AND LEVERAGE KEY INDUSTRY AND TECHNICAL RESOURCES TO DEPLOY ON NEW OPPORTUNITIESDRIVE OVERALL EXPANSION AND PENETRATION OF ASSIGNED PE CLIENTS AND TARGETS WHILE RETAINING CURRENT ENGAGEMENTSUNDERSTAND EACH PE FIRM'S STRATEGIC PLANS AND BUSINESS STRATEGY (INDUSTRY, INVESTMENT MANDATE, EXIT STRATEGY ETC.) \n\nBASIC QUALIFICATIONS:\n\nBACHELOR'S DEGREE PREFERRED, OR EQUIVALENT EXPERIENCEMINIMUM OF 3-5+ YEARS OF RESEARCH EXPERIENCE OR DEMONSTRATED SUCCESS IN SELLING PROFESSIONAL SERVICESPRIOR SUCCESS CONSULTATIVE SELLING FOR A CONSULTING OR ACCOUNTING FIRM STRONGLY PREFERREDPRIOR PRIVATE EQUITY KNOWLEDGE AND/OR EXPERIENCE PREFERREDDEMONSTRATED NETWORK OF COI'S (CENTERS OF INFLUENCE) TO INCLUDE BANKING, LEGAL AND OTHER PROFESSIONAL SERVICES RELATIONSHIPS THAT COULD BE LEVERAGED TO IDENTIFY OPPORTUNITIES WITHIN PRIVATE EQUITY FIRMSDEMONSTRATED STRATEGIC THOUGHT PROCESS, EXPERIENCE AND DEPLOYMENT CAPABILITIESOUTSTANDING RELATIONSHIP MANAGEMENT SKILLS AND PERSONAL NETWORKING SKILLSDEMONSTRATED STRONG VERBAL COMMUNICATION SKILLSDEMONSTRATED ABILITY TO CLEARLY COMMUNICATE IN WRITINGSTRONG PRESENTATION SKILLS. CANDIDATE MUST DEMONSTRATE ABILITY TO ORGANIZE AND LEAD A MEETING WITH C-LEVEL EXECUTIVESSTRONG ORGANIZATIONAL SKILLS AND ATTENTIVENESS TO DETAIL. CANDIDATE MUST BE ABLE TO PRIORITIZE AND MULTI-TASK IN AN OUTCOME-ORIENTED ENVIRONMENTPROJECT MANAGEMENT. CANDIDATE MUST DEMONSTRATE ABILITY TO MANAGE TIME, MULTI-TASK AND MEET DEADLINES, AS WELL AS POSSESS STRONG CREATIVE PROBLEM SOLVING AND CONFLICT RESOLUTION SKILLSTEAMWORK. CANDIDATE MUST DEMONSTRATE EXPERIENCE IN WORKING AS A PRODUCTIVE MEMBER OF A TEAMTANGIBLE AND DEMONSTRATED EXPERIENCE IN FORMAL SALES PROCESS DEPLOYMENT AND USEEXPERIENCE LEVERAGING A CRM TOOL FOR REPORT GENERATION AND SALES TRACKINGTRAVEL IS REQUIRED (LOCAL AND OVERNIGHT WHEN APPROPRIATE).\n\nPREFERRED QUALIFICATIONS:\n\nMBAACTIVE NETWORK OF PRIVATE EQUITY CONTACTSDEMONSTRATED COMMUNITY INVOLVEMENT AND ACTIVITY WITH INDUSTRY ASSOCIATIONS, CIVIC AND/OR NON-PROFIT GROUPS.EXHIBIT EXCEPTIONALLY STRONG COMMUNICATION, PRESENTATION, ANALYTICAL AND ORGANIZATIONAL SKILLS.EXPERIENCE WORKING FOR BIG FOUR OR OTHER NATIONAL FIRMS A SIGNIFICANT PLUS.\n\nAT RSM, WE OFFER A COMPETITIVE BENEFITS AND COMPENSATION PACKAGE FOR ALL OUR PEOPLE. WE SUPPORT AND INSPIRE YOU TO PRIORITIZE YOUR WELLBEING BY DELIVERING PERSONALIZED, HOLISTIC PROGRAMMING FOR YOUR PHYSICAL, EMOTIONAL, FINANCIAL AND COMMUNITY WELLBEING. RSM HAS A GENEROUS TIME OFF POLICY WITH AT LEAST 14 PAID HOLIDAYS, WELLBEING DAYS AND ASSOCIATE AND ABOVE ACCESS TO SELF-MANAGED TIME OFF. WE OFFER FLEXIBILITY IN YOUR SCHEDULE, EMPOWERING YOU TO BALANCE LIFE’S DEMANDS, WHILE ALSO MAINTAINING YOUR ABILITY TO SERVE CLIENTS. LEARN MORE ABOUT OUR TOTAL REWARDS AT HTTPS://RSMUS.COM/CAREERS/WORKING-AT-RSM/BENEFITS.\n\nRSM IS PROUD TO BE AN AFFIRMATIVE ACTION AND EQUAL EMPLOYMENT OPPORTUNITY EMPLOYER.  WE ARE PROUD TO PROVIDE OUR EMPLOYEES WITH TOOLS TO ASSIST THEM IN BEING SUCCESSFUL IN ACHIEVING BOTH PERSONAL AND PROFESSIONAL GOALS. WE WELCOME AND SUPPORT ALL OUR EMPLOYEES TO THRIVE IN AN ENVIRONMENT FREE OF DISCRIMINATION AND HARASSMENT. AS AN AFFIRMATIVE ACTION AND EQUAL OPPORTUNITY EMPLOYER ALL APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT AS RSM DOES NOT TOLERATE DISCRIMINATION AND/OR HARASSMENT BASED ON RACE; COLOR; CREED; SINCERELY HELD RELIGIOUS BELIEFS, PRACTICES OR OBSERVANCES; SEX (INCLUDING PREGNANCY OR DISABILITIES RELATED TO NURSING); GENDER (INCLUDING GENDER IDENTITY AND/OR GENDER EXPRESSION); SEXUAL ORIENTATION; HIV STATUS; NATIONAL ORIGIN; ANCESTRY; FAMILIAL OR MARITAL STATUS; AGE; PHYSICAL OR MENTAL DISABILITY; CITIZENSHIP; POLITICAL AFFILIATION; MEDICAL CONDITION (INCLUDING FAMILY AND MEDICAL LEAVE); DOMESTIC VIOLENCE VICTIM STATUS; PAST, CURRENT OR PROSPECTIVE SERVICE IN THE US UNIFORMED SERVICE; PRE-DISPOSING GENETIC CHARACTERISTICS OR ANY OTHER CHARACTERISTIC PROTECTED UNDER APPLICABLE FEDERAL, STATE OR LOCAL LAW.\n\nACCOMMODATION FOR APPLICANTS WITH DISABILITIES IS AVAILABLE UPON REQUEST IN CONNECTION WITH THE RECRUITMENT PROCESS AND/OR EMPLOYMENT/PARTNERSHIP. RSM IS COMMITTED TO PROVIDING EQUAL OPPORTUNITY AND REASONABLE ACCOMMODATION FOR PEOPLE WITH DISABILITIES. IF YOU REQUIRE A REASONABLE ACCOMMODATION TO COMPLETE AN APPLICATION, INTERVIEW, OR OTHERWISE PARTICIPATE IN THE RECRUITING PROCESS, PLEASE CALL US AT 800-274-3978 OR SEND US AN EMAIL AT CAREERS@RSMUS.COM.\n\nRSM DOES NOT INTEND TO HIRE ENTRY LEVEL CANDIDATES WHO WILL REQUIRE SPONSORSHIP NOW OR IN THE FUTURE (I.E. F-1 VISA HOLDERS). IF YOU ARE A RECENT U.S. COLLEGE / UNIVERSITY GRADUATE POSSESSING 1-2 YEARS OF PROGRESSIVE AND RELEVANT WORK EXPERIENCE IN A SAME OR SIMILAR ROLE TO THE ONE FOR WHICH YOU ARE APPLYING, EXCLUDING INTERNSHIPS, YOU MAY BE ELIGIBLE FOR HIRE AS AN EXPERIENCED ASSOCIATE.\n\nSTARTING AT: $150,000.00",
    "job_skill_set": [
      "consultative selling",
      "sales process deployment",
      "CRM tool usage",
      "project management",
      "data analysis",
      "market research",
      "relationship management",
      "networking",
      "communication",
      "teamwork",
      "organizational skills",
      "problem solving",
      "strategic thinking",
      "attention to detail",
      "time management",
      "multi-tasking",
      "leadership",
      "collaboration",
      "private equity knowledge",
      "presentation skills"
    ],
    "short_keywords": [
      "analysis",
      "attention",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "consultative",
      "crm",
      "data",
      "deployment",
      "detail",
      "development",
      "equity",
      "knowledge",
      "leadership",
      "management",
      "manager",
      "market",
      "multitasking",
      "networking",
      "organizational",
      "presentation",
      "private",
      "problem",
      "process",
      "project",
      "relationship",
      "research",
      "sales",
      "selling",
      "skills",
      "solving",
      "strategic",
      "teamwork",
      "thinking",
      "time",
      "to",
      "tool",
      "usage"
    ]
  },
  {
    "job_id": "3902862412",
    "job_title": "Inside Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "COMPANY DESCRIPTIONALPHAEON CREDIT IS A PATIENT FINANCING PROGRAM OFFERED THROUGH COMENITY CAPITAL BANK. IT PROVIDES STRONG APPROVAL RATES, SUPERIOR CREDIT LIMITS, AND A WIDE ARRAY OF PAYMENT PLANS TO FIT ANY PATIENT'S BUDGET.\nROLE DESCRIPTIONTHIS IS A FULL-TIME REMOTE ROLE FOR AN INSIDE BUSINESS DEVELOPMENT MANAGER. THE INSIDE BUSINESS DEVELOPMENT MANAGER WILL BE RESPONSIBLE FOR DEVELOPING AND MAINTAINING RELATIONSHIPS WITH PROVIDERS AND MEETING SALES TARGETS. THE ROLE WILL INVOLVE COLLABORATING WITH THE SALES AND MARKETING TEAMS, CONDUCTING MARKET RESEARCH (VOICE OF THE PROVIDER), AND DOCUMENTING CALLS IN SALESFORCE.\nQUALIFICATIONSSTRONG SALES AND BUSINESS DEVELOPMENT SKILLSEXCELLENT COMMUNICATION AND INTERPERSONAL SKILLS - BI-LINGUAL IN SPANISH IS A PLUSPROVEN TRACK RECORD OF MEETING OR EXCEEDING SALES TARGETSABILITY TO BUILD AND MAINTAIN RELATIONSHIPS WITH CLIENTSEXPERIENCE IN THE FINANCIAL SERVICES OR HEALTHCARE INDUSTRY IS A PLUS",
    "job_skill_set": [
      "sales",
      "business development",
      "Salesforce",
      "financial services",
      "communication",
      "interpersonal skills",
      "relationship building",
      "market research",
      "healthcare industry",
      "bilingual (Spanish)"
    ],
    "short_keywords": [
      "bilingual",
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "development",
      "financial",
      "healthcare",
      "industry",
      "inside",
      "interpersonal",
      "manager",
      "market",
      "relationship",
      "research",
      "sales",
      "salesforce",
      "services",
      "skills",
      "spanish"
    ]
  },
  {
    "job_id": "3902903839",
    "job_title": "Sr. Inside Business Development Manager (Hybrid)",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "COMPANY DESCRIPTION\n\nDO YOU WANT TO WORK IN AN INTERNATIONAL ENVIRONMENT WHERE YOU WILL MAKE GLOBAL IMPACT? IF THIS SOUNDS LIKE YOU, #1 GREAT PLACE TO WORK MULTINATIONAL ABBVIE MIGHT HAVE YOUR DESIRED JOB\n\nWE OFFER THAT. \n\nABBVIE’S MISSION IS TO DISCOVER AND DELIVER INNOVATIVE MEDICINES THAT SOLVE SERIOUS HEALTH ISSUES TODAY AND ADDRESS THE MEDICAL CHALLENGES OF TOMORROW. WE STRIVE TO HAVE A REMARKABLE IMPACT ON PEOPLE’S LIVES ACROSS SEVERAL KEY THERAPEUTIC AREAS: IMMUNOLOGY, ONCOLOGY, NEUROSCIENCE, EYE CARE, VIROLOGY, WOMEN’S HEALTH AND GASTROENTEROLOGY, IN ADDITION TO PRODUCTS AND SERVICES ACROSS ITS ALLERGAN AESTHETICS PORTFOLIO.\n\nIF YOU ARE INTERESTED IN BEING PART OF ABBVIE LOGISTICS SUPPLY CHAIN TEAM IN ZWOLLE BUT HAVE NOT FOUND A SPECIFIC ROLE FITTING FOR YOU, LEAVE YOUR APPLICATION HERE AND YOU WILL BE INCLUDED IN OUR DATABASES.\n\nJOB DESCRIPTION\n\nJOB TITLE: SR. INSIDE BUSINESS DEVELOPMENT MANAGER\n\nLOCATION: AUSTIN, TX **(HYBRID SCHEDULE)**\n\nPAY: BASE + SALES INCENTIVE PLANS\n\nTYPE: FULL TIME, DIRECT HIRE\n\nTEAM: INSIDE SALES, ALLERGAN AESTHETICS\n\nBENEFITS: PAID HOLIDAYS, PTO, MEDICAL/DENTAL/VISION, MATCHING 401K & MUCH MORE!\n\nABOUT: THE ALLERGAN MEDICAL INSIDE SALES REPRESENTATIVE IS A REVENUE GENERATING POSITION WITH RESPONSIBILITY FOR QUARTERLY SALES QUOTA ATTAINMENT FOR THE FACIAL AESTHETICS PORTFOLIO OF PRODUCTS AND FOR MANAGING AND ENHANCING PORTFOLIO GROWTH THROUGH BUSINESS DEVELOPMENT ACTIVITIES USING PRIMARILY PHONE COMMUNICATION. THE INSIDE SALES REPRESENTATIVE MUST BE ABLE TO PROACTIVELY MULTITASK, SELF-MANAGE AND OPERATE IN A FAST-PACED ENVIRONMENT THAT ENDORSES CONSTANT CHANGE. RESPONSIBILITIES ALSO INCLUDE WORKING INDEPENDENTLY AND MANAGING SALES ACTIVITY IN AN ASSIGNED GEOGRAPHY AND POSSESSING PROFESSIONALISM AND THE ABILITY TO EFFECTIVELY COLLABORATE WITH CUSTOMERS, THE SALES FORCE, AND UPPER MANAGEMENT COUNTERPARTS. THIS POSITION WILL BE RESPONSIBLE FOR ALL VACANT AND LEAVE OF ABSENCE TERRITORIES WITHIN AN ASSIGNED REGION AS WELL AS MAINTAIN A LIST OF TARGETED ACCOUNTS. DETAILED TARGET ACCOUNT LIST TO BE PROVIDED SEPARATELY. QUOTAS TO BE PROVIDED SEPARATELY. DUTIES ALSO INCLUDE EDUCATING, TRAINING, AND DEVELOPING NEW AND EXISTING ACCOUNTS.\n\nTHE EMPLOYEE MUST CONDUCT THEIR WORK ACTIVITIES IN COMPLIANCE WITH ALL ALLERGAN INTERNAL REQUIREMENTS AND WITH ALL APPLICABLE REGULATORY REQUIREMENTS. ALLERGAN INTERNAL REQUIREMENTS INCLUDE COMPLIANCE WITH ETHICS, ENVIRONMENTAL HEALTH AND SAFETY, FINANCIAL, HUMAN RESOURCES, AND GENERAL BUSINESS POLICIES, REQUIREMENTS, AND OBJECTIVES.\n\nKEY DUTIES AND RESPONSIBILITIES:\n\n CONSISTENTLY ACHIEVES SALES QUOTA ACROSS PORTFOLIO. PROFICIENT IN SALES EXECUTION COMPONENT OF MARKETING PLANS. INDEPENDENTLY CREATES CALL AND BUSINESS DEVELOPMENT PLANS ACROSS THE PRODUCT PORTFOLIO. DEMONSTRATES ADAPTABILITY AND CREATIVITY WITH MULTIPLE INITIATIVES. SALES PROCESSES MUST BE FOCUSED ON BUSINESS GROWTH AND RELATIONSHIP BUILDING. MANAGES ATTAINMENT OF ASSIGNED SALES QUOTA AND CUSTOMER SATISFACTION THROUGH CONSISTENT COMMUNICATION WITH THE REGIONAL MANAGER AND INSIDE SALES AREA MANAGER, MANAGING OWN SAMPLE ALLOCATION, PLACING ORDERS, PROVIDING MARKETING MATERIALS, AND ASSISTING ACCOUNTS WITH MARKETING STRATEGIES. ALSO LEADS EXECUTION ON ALL CAMPAIGNS/PROMOTIONS, NEW PRODUCT LAUNCHES, TRAINING OF ACCOUNTS ON ALLERGAN PROGRAMS AND OTHER SALES RELATED INITIATIVES. DEVELOP PRODUCT KNOWLEDGE AND UTILIZE TO BEST SERVE CUSTOMER’S CURRENT BUSINESS NEEDS, AS WELL AS TO PROSPECT NEW PRODUCTS, PROGRAM, AND TRAINING OPPORTUNITIES WITH CURRENT ACCOUNTS AND TO IDENTIFY AND QUALIFY NEW BUSINESS. EDUCATE THE CUSTOMER REGARDING INDICATIONS, CONTRAINDICATIONS, AND SAFETY OF THE PRODUCTS, AND HOW THEY FULFILL THE NEEDS OF THE CUSTOMER. OBTAIN INFORMATION NEEDED TO ACCURATELY UNDERSTAND PROBLEMS AND NEEDS USE THIS INFORMATION TO DETERMINE SOLUTIONS AND FORMULATE NEW AND INNOVATIVE IDEAS PROACTIVELY SOLVE CUSTOMER PROBLEMS IN A MANNER THAT EXCEEDS CUSTOMER EXPECTATIONS. PROVIDE TECHNICAL TRAINING TO THE CUSTOMER ON APPLICATION AND USE OF THE COMPANY’S PRODUCTS. MANAGES COMPLEX ORDERS FROM QUOTATION TO FINAL PAYMENT AND RESOLVES PRODUCT ISSUES INCLUDING PROMOTIONS AND RETURNS. COLLABORATION WITH REGIONAL MANAGER, RESPECTIVE FIELD REPS AND INSIDE SALES AREA MANAGER - ACTS AS REFERRAL SPECIALIST FOR MORE DETAILED AND/OR COMPLEX CUSTOMER NEEDS. WORK CROSS FUNCTIONALLY WITH FIELD SALES IN ORDER TO DRIVE SALES OBJECTIVES CULTIVATES CLIENT RELATIONSHIPS DEVELOPS AND COLLABORATES ON ALL ACCOUNT ACTIVITY AND GROWTH. TRAVEL COULD RANGE FROM 20-30% BASED ON TERRITORY NEEDS. LEAVE OF ABSENCE AND VACANT TERRITORY COVERAGE INCLUDES COLLABORATION WITH THE RESPECTIVE SALES REPRESENTATIVE, REGION MANAGER AND INSIDE SALES AREA MANAGER TO DEVELOP AND NEGOTIATE A COVERAGE PLAN. THIS CAN INCLUDE CONSISTENT COMMUNICATION- MANAGING OWN SAMPLE ALLOCATION, PLACING ORDERS, PROVIDING MARKETING MATERIALS, AND ASSISTING ACCOUNTS WITH MARKETING AND BUSINESS DEVELOPMENT STRATEGIES. ALSO INCLUDES EXECUTION ON ALL CAMPAIGNS/PROMOTIONS, NEW PRODUCT LAUNCHES AND OTHER SALES RELATED INITIATIVES. PROVIDES CUSTOMER WITH ACCOUNT INFORMATION, DETAILED INSTRUCTIONS ON ORDER PLACEMENT AND PRODUCT SHIPMENT PROCESSES, PRODUCT PRICING, AND PERTINENT CONTACT INFORMATION. ATTEND SALES TRAINING AND SALES MEETINGS AS REQUIRED. COMPLETE ADMINISTRATIVE RESPONSIBILITIES SUCH AS: MONTHLY SALES REPORT, QUARTERLY BUSINESS PLAN, PRESENTATIONS, EXPENSE REPORTS.\n\nQUALIFICATIONS\n\nEDUCATION\n\nBACHELOR’S DEGREE OR HIGHER REQUIRED\n\nREQUIREMENTS\n\n TWO OR MORE YEARS OF RELEVANT SALES EXPERIENCE IS REQUIRED MUST POSSESS A BACHELOR’S DEGREE A TRACK RECORD OF EARNING STRONG COMMISSIONS, THE ABILITY TO WORK INDEPENDENTLY, BE HIGHLY ORGANIZED AND EXHIBIT SUPERIOR COMMUNICATION SKILLS REQUIRED. ABILITY TO WORK A HYBRID SCHEDULE IN THE AUSTIN, TX OFFICE\n\nPREFERRED SKILLS\n\n EXPERIENCE IN THE HEALTHCARE INDUSTRY INVOLVING INTERACTION WITH PHYSICIANS, PATIENTS, ETC. EXPERIENCE IN EDUCATING OR INFLUENCING TARGETED CUSTOMERS. TWO YEARS OF WORKING IN MEDICAL SALES/INSIDE SALES PREFERRED.\n\nQUALIFICATIONS\n\n TO PERFORM THIS JOB SUCCESSFULLY, AN INDIVIDUAL MUST BE ABLE TO PERFORM EACH ESSENTIAL DUTY SATISFACTORILY. THE REQUIREMENTS LISTED BELOW ARE REPRESENTATIVE OF THE KNOWLEDGE, SKILLS AND/OR ABILITIES REQUIRED. KNOWLEDGE OF INSIDE SALES SELLING SKILLS AND BUSINESS ENVIRONMENT KNOWLEDGE OF CLINICAL, SURGICAL TECHNIQUES AND PROCEDURES, AND MEDICAL TERMINOLOGY. KNOWLEDGE OF MEDICAL DEVICE/PHARMACEUTICAL/AESTHETIC MARKET OR A RELATED FIELD. SKILL IN DEMONSTRATING A PROFESSIONAL PHONE AND IN PERSON ETIQUETTE. SKILL IN MANAGING TIME EFFECTIVELY. ABILITY TO PROVIDE SERVICE TO ACCOUNTS IN VARIOUS TIME ZONES ACROSS THE US. ABILITY TO PRESENT TO A GROUP IN A WEB EX OR VIRTUAL SETTING. ABILITY TO COMMUNICATE EFFECTIVELY, ORALLY AND IN WRITING, WITH EMPLOYEES OF VARIOUS DISCIPLINES WITHIN VARIOUS DEPARTMENTS AND ALL OTHER INTERNAL AND EXTERNAL CONTACTS. ABILITY TO WORK INDEPENDENTLY AND PLAN EXTENSIVELY TO MEET GOALS. ABILITY TO TRACK SALES PERFORMANCE. ABILITY TO MAINTAIN ACCURACY, CONSISTENCY, AND QUALITY IN A FAST-PACED, MULTI-TASK ENVIRONMENT. ABILITY TO COORDINATE AND SYNCHRONIZE MULTIPLE PROJECTS WHILE MAINTAINING A HIGH DEGREE OF CUSTOMER SERVICE. ABILITY TO USE MICROSOFT OFFICE, OUTLOOK, MSWORD, EXCEL, POWERPOINT, AND SOME DATABASE SOFTWARE. MOTIVATED BY INDIVIDUAL AND TEAM ACHIEVEMENT.\n\nADDITIONAL INFORMATION\n\nALL YOUR INFORMATION WILL BE KEPT CONFIDENTIAL ACCORDING TO EEO GUIDELINES.\n\nABBVIE IS COMMITTED TO OPERATING WITH INTEGRITY, DRIVING INNOVATION, TRANSFORMING LIVES, SERVING OUR COMMUNITY AND EMBRACING DIVERSITY AND INCLUSION. IT IS ABBVIE’S POLICY TO EMPLOY QUALIFIED PERSONS OF THE GREATEST ABILITY WITHOUT DISCRIMINATION AGAINST ANY EMPLOYEE OR APPLICANT FOR EMPLOYMENT BECAUSE OF RACE, COLOR, RELIGION, NATIONAL ORIGIN, AGE, SEX (INCLUDING PREGNANCY), PHYSICAL OR MENTAL DISABILITY, MEDICAL CONDITION, GENETIC INFORMATION, GENDER IDENTITY OR EXPRESSION, SEXUAL ORIENTATION, MARITAL STATUS, STATUS AS A PROTECTED VETERAN, OR ANY OTHER LEGALLY PROTECTED GROUP STATUS.",
    "job_skill_set": [
      "sales experience",
      "business development",
      "medical terminology",
      "inside sales",
      "Microsoft Office",
      "product knowledge",
      "time management",
      "customer service",
      "communication",
      "teamwork",
      "adaptability",
      "problem solving",
      "self-management",
      "organization",
      "collaboration",
      "motivation",
      "CRM software",
      "presentation skills"
    ],
    "short_keywords": [
      "adaptability",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "crm",
      "customer",
      "development",
      "experience",
      "hybrid",
      "inside",
      "knowledge",
      "management",
      "manager",
      "medical",
      "microsoft",
      "motivation",
      "office",
      "organization",
      "presentation",
      "problem",
      "product",
      "sales",
      "selfmanagement",
      "service",
      "skills",
      "software",
      "solving",
      "sr",
      "teamwork",
      "terminology",
      "time"
    ]
  },
  {
    "job_id": "3901800114",
    "job_title": "Vice President, Business Development - B2B Sales",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "CREATING A DIGITALLY DRIVEN TOMORROW\n\nTELEPERFORMANCE IS WHERE INSPIRATION MEETS INNOVATION AND WHERE WE EMPOWER INDIVIDUALS TO REDEFINE THE FUTURE. FOR OVER 45 YEARS, WE HAVE REVOLUTIONIZED BUSINESS OPERATIONS, LEADING THE WAY IN INTELLIGENT, DIGITAL-FIRST SOLUTIONS THAT SIMPLIFY PROCESSES AND SUPERCHARGE RESULTS.\n\nIN 2023, WE ACHIEVED AN OUTSTANDING REVENUE MILESTONE OF MORE THAN €10 BILLION, AND WITH THE RECENT ACQUISITION OF MAJOREL, OUR GLOBAL TEAM HAS EXPANDED TO 500,000 EMPLOYEES ACROSS FIVE CONTINENTS WHILE SERVING MORE THAN 170 COUNTRIES, PROFICIENTLY SERVING OVER 300 LANGUAGES AND DIALECTS.\n\nTELEPERFORMANCE ISN'T MERELY A WORKPLACE; IT IS GLOBALLY CERTIFIED AS A GREAT PLACE TO WORK IN 72 COUNTRIES WITH A CLIENT PORTFOLIO THAT SPANS DYNAMIC SECTORS SUCH AS AD SALES, CLOUD SALES, B2B SALES, COLLECTIONS, BANKING, INSURANCE, TRAVEL, HEALTHCARE, AND TRUST & SAFETY. OUR COMPANY’S CULTURE IS AN ENVIRONMENT THAT THRIVES ON DIVERSITY, EQUITY, AND INCLUSION. WHERE INNOVATIVE IDEAS TRANSCEND BOUNDARIES, AND EVERY VOICE IS HEARD AND VALUED.\n\nWELCOME TO A PLACE WHERE YOUR TALENT IS THE MISSING PIECE THAT COMPLETES OUR VISION FOR A BRIGHTER, DIGITALLY DRIVEN TOMORROW.\n\nWHY JOIN TELEPERFORMANCE\n\nSTRENGTHENED LEADERSHIP POSITION, WITH OVER €10 BILLION IN ANNUAL REVENUE.GLOBAL SCALE WITH LOCAL REACH: DOMINANCE IN EUROPE, MAJOR IN THE U.S., LATAM, PHILIPPINES, AND SIGNIFICANT IN APAC.A DIVERSIFIED CLIENT PORTFOLIO WITH ROBUST MOMENTUM IN SOCIAL MEDIA, CONTENT MODERATION, FINANCIAL SERVICES, AND HEALTHCARE MARKETS.CONTINUED INNOVATION IN ARTIFICIAL INTELLIGENCE (AI) AND THE CAPABILITY TO ATTRACT THE BEST TALENT DROVE ENHANCED OUTSOURCING SOLUTIONS ACROSS THE GROUP.\n\nTELEPERFORMANCE | WHERE ARE WE GOING\n\nTELEPERFORMANCE HAS FIVE COMPETITIVE ADVANTAGES THAT ENABLE IT TO IMPLEMENT ITS DEVELOPMENT STRATEGY SUCCESSFULLY:\n\nTHE PEOPLE STRATEGY, WHICH IS FOUNDED ON TWO KEY PILLARS OF HUMAN CAPITAL MANAGEMENT: FOCUS AND DISCIPLINE.THE OMNICHANNEL OFFER COMPRISING SOLUTIONS AND TECHNOLOGY THAT ENABLE CONTROL OF THE ENTIRE CHAIN OF INTERACTIONS AND COMMUNICATION BETWEEN THE CLIENT AND ITS CUSTOMER.A CULTURE OF CUSTOMER SATISFACTION WHERE PROACTIVITY AND CUSTOMER COMMUNICATION ARE KEY.THE HANDLING OF 265 LANGUAGES VIA AN INTEGRATED OFFSHORE/NEARSHORE NETWORK ENABLES IT TO MEET THE GLOBAL NEEDS OF MANY CLIENTS.EXPERTISE AND EXPERIENCE IN A WIDE RANGE OF CLIENT SECTORS.\n\nTHE GOAL OF THE STRATEGY IS TO ADD VALUE THROUGH SUSTAINABLE AND PROFITABLE DEVELOPMENT OF THE GROUP’S OPERATIONS, ORGANIC GROWTH, AND TARGETED ACQUISITIONS.\n\nTHE OPPORTUNITY | VP OF BUSINESS DEVELOPMENT – B2C SALES\n\nTHIS IS A GREENFIELD OPPORTUNITY FOR AN EXPERIENCED SALES EXECUTIVE TO HELP ENGAGE NEW CLIENTS AND PROSPECT WITHIN EXISTING BUSINESS FOR TPUS WITH A FOCUS ON SELLING SALES OUTSOURCING SERVICES. AT PRESENT, APPROXIMATELY $350M IN REVENUE IS GENERATED FROM AD SALES, DIGITAL SALES/LEAD GENERATION, B2B SALES AND B2C SALES. AS TELEPERFORMANCE LOOKS FORWARD, AN OPPORTUNITY EXISTS TO GENERATE NEW BUSINESS AND DRIVE REVENUE GROWTH IN OUR SALES LINE OF BUSINESS (LOB).\n\nROLE\n\nAS A VICE PRESIDENT OF BUSINESS DEVELOPMENT FOR THIS STRATEGIC VERTICAL, YOU WILL PLAY A PIVOTAL ROLE FOR OUR ORGANIZATION IN IDENTIFYING AND EVALUATING NEW PARTNERSHIPS WHILE ALSO BUILDING STRONG RELATIONSHIPS TO ACHIEVE YOUR INDIVIDUAL SALES TARGETS. THE FOCUS FOR SALES OUTSOURCING SERVICES FOR B2C SPAN THESE SOLUTIONS:\n\nE-COMMERCE CUSTOMER SUPPORT MANAGEMENT – IMPROVE ACQUISITION, MAINTENANCE, SALES, COLLECTIONS, RETURNS, REFUNDS, AND QUERY, CAMPAIGN, DELIVERY AND RECALL MANAGEMENT.SALES AND MARKETING SERVICES – IMPROVE RESULTS WITH PRICING MANAGEMENT, PROMOTION PLANNING AND MANAGEMENT, CUSTOMER PROFITABILITY, ANALYTICS AND SPEND ANALYSIS.PROCESS TRANSFORMATION – IMPROVE PROCESSES ACROSS CUSTOMER AND SELLER LIFECYCLE WITH LEAN, SIX SIGMA, RPA INTERVENTION AND SPECIALIZED TOOLS.\n\nOUR EXPECTATION IS THAT THIS TEAM WILL EXPERIENCE DOUBLE DIGIT GROWTH AS YOU HELP EXPAND OUR MARKET PRESENCE AND DRIVE REVENUE GROWTH ACROSS THE CLOUD SALES LOB. ALL OF THIS WILL BE ACCOMPLISHED BY WORKING CLOSELY WITH THE EVP, BD OVER DIGITAL SALES WHILE ALSO PARTNERING WITH ACCOUNT CEOS, SENIOR EXECUTIVES AND OTHER KEY STAKEHOLDERS TO IDENTIFY NEW BUSINESS OPPORTUNITIES AND POTENTIAL CLIENTS.\n\nAS A VP OF BUSINESS DEVELOPMENT – B2C SALES, YOUR ROLE WILL INCLUDE…\n\n ENGAGING YOUR ESTABLISHED NETWORK: THE PRIMARY GOAL IS TO CONTINUE NURTURING AND GROWING RELATIONSHIPS WITH KEY CLIENTS. UNDERSTANDING THEIR BUSINESS NEEDS, AND POSITIONING SALES OUTSOURCING SERVICES ACCORDINGLY. CLIENT ACQUISITION: ACTIVELY SEEKING AND ACQUIRING NEW CLIENTS FOR SALES SERVICES, ACROSS INDUSTRY VERTICALS. SERVICE AND PRODUCT KNOWLEDGE: PRIOR KNOWLEDGE OF SIMILAR SERVICES WILL ALLOW FOR MUCH MORE EFFECTIVE POSITIONING IN THE MARKETPLACE OF TELEPERFORMANCE FEATURES, BENEFITS, AND COMPETITIVE ADVANTAGES. SALES STRATEGIES: DEVELOPING AND IMPLEMENTING EFFECTIVE SALES STRATEGIES TO ACHIEVE MARKET REVENUES AND MAXIMIZE MARKET PENETRATION TO INCLUDE CULTIVATING PARTNERSHIPS WITH SALES PROVIDERS AND TECHNOLOGY VENDORS TO ENHANCE THE ORGANIZATION’S CLOUD PORTFOLIO. CLIENT PRESENTATIONS: SAVVY PRESENTATION SKILLS ARE USED TO DEMONSTRATE OUR CLOUD-BASED SOLUTIONS TO CLIENTS, ADDRESSING THEIR SPECIFIC REQUIREMENTS AND SHOWING THE VALUE PROPOSITION. INDUSTRY NETWORKING: ACTIVELY PARTICIPATING IN INDUSTRY EVENTS, CONFERENCES, AND NETWORKING OPPORTUNITIES TO BUILD RELATIONSHIPS, STAY INFORMED ABOUT INDUSTRY DEVELOPMENTS, AND GENERATE LEADS. CONTRACT NEGOTIATION: LEADING NEGOTIATIONS FOR CONTRACTS AND AGREEMENTS WITH CLIENTS, ENSURING TERMS ARE FAVORABLE FOR BOTH PARTIES. COLLABORATION WITH CROSS-FUNCTIONAL TEAMS: WORKING CLOSELY WITH INTERNAL TEAMS, INCLUDING MARKETING, PRODUCT DEVELOPMENT, AND CUSTOMER SUPPORT, TO ENSURE ALIGNMENT AND EFFECTIVE COMMUNICATION. MARKET ANALYSIS: IDENTIFYING MARKET TRENDS, COMPETITOR ACTIVITIES, AND EMERGING OPPORTUNITIES TO ENHANCE BUSINESS DEVELOPMENT STRATEGIES AND ENGAGE POTENTIAL CLIENTS. SALES REPORTING: PROVIDING REGULAR REPORTS ON SALES PERFORMANCE, MARKET TRENDS, AND CLIENT FEEDBACK TO INFORM STRATEGIC DECISION-MAKING USING THE TP CRM SYSTEM – SALES FORCE. COMPLIANCE: ENSURING THAT ALL SALES ACTIVITIES ADHERE TO INDUSTRY REGULATIONS, COMPLIANCE STANDARDS, AND COMPANY POLICIES. CUSTOMER SATISFACTION: MONITOR CLIENT SATISFACTION, ADDRESS CONCERNS PROMPTLY, AND MAINTAIN A HIGH LEVEL OF CUSTOMER SERVICE TO FOSTER LONG-TERM RELATIONSHIPS. FORECASTING: DEVELOPING ACCURATE SALES FORECASTS AND PROJECTIONS BASED ON MARKET TRENDS, CLIENT FEEDBACK, AND OTHER RELEVANT FACTORS. CONTINUOUS LEARNING: KEEPING ABREAST OF CHANGES AND TRENDS IN CLOUD-BASED SOLUTION SELLING, INCLUDING NEW TECHNOLOGIES, REGULATIONS, AND MARKET DYNAMICS, TO ADAPT SALES STRATEGIES ACCORDINGLY. ACHIEVING REVENUE TARGETS: MEETING OR EXCEEDING SALES QUOTAS AND REVENUE TARGETS SET BY THE ORGANIZATION.\n\nKEY FIRST-YEAR OBJECTIVES\n\nDEVELOP A BUSINESS DEVELOPMENT STRATEGY TO ENGAGE IDENTIFIED TARGET LIST - BASED ON ASSIGNED ACCOUNTS AND UTILIZING YOUR DIGITAL ROLODEX.GENERATE PIPELINE AND START PROCESS OF BEING ABLE TO QUALIFY AT LEAST 1 OPPORTUNITY PER MONTH, 12 OPPORTUNITIES PER YEAR, WITH THE FORMULA TO CLOSE 3-4 DEALS PER YEAR.BUILD CONFIDENCE AND TRUST WITH ACCOUNTS THROUGH CLOSE PARTNERSHIPS AND BY REPEATEDLY DELIVERING “AS PROMISED.”OPTIMIZE INTERNAL RELATIONSHIPS WITH SALES SUPPORT AND CLIENT SERVICES.\n\nWHAT WILL YOU NEED TO SUCCEED?\n\nPASSION TO SELL!BACHELOR’S DEGREE OR ABOVE, FOCUS ON BUSINESS, MARKETING OR RELATED FIELD PREFERRED.8+ YEARS OF SUCCESSFUL ENTERPRISE SALES EXPERIENCE SPECIFIC TO B2C SALES.8+ YEARS OF EXPERIENCE IN A CUSTOMER ACQUISITION CLIENT-FACING ROLE WITH EXPERIENCE IN ACCOUNT GROWTH AND CREATING STRATEGIES THAT EXCEED OUR CLIENT’S BUSINESS GOALS.EXPERIENCE IN THE BPO ENVIRONMENT SELLING SALES SERVICES/SOLUTIONS.POSSESS SUCCESSFUL EXPERIENCE SELLING INTO AND PRESENTING TO THE HIGHEST-LEVEL DECISION-MAKERS (C-LEVEL EXECUTIVES).STRATEGIC CRITICAL THINKER WHO ALSO HAS EXCELLENT ATTENTION TO DETAIL.EXPERIENCE IN PRICING, CONTRACT NEGOTIATIONS, AND PROACTIVE, THOUGHTFUL PROPOSALS.HAVING BUSINESS DEVELOPMENT, SALES, AND ORIGINATION EXPERIENCE ACROSS MULTIPLE GEOGRAPHIES AND MULTIPLE INDUSTRY VERTICALS.A ROBUST NETWORK OF CONTACTS THAT CAN BE LEVERAGED TO OPEN DOORS AND MAKE INTRODUCTIONS.GOOD UNDERSTANDING OF CX-RELATED DIGITAL TECHNOLOGIES, DIGITAL TRANSFORMATION KNOWLEDGE IS A PLUS.STRONG NEGOTIATION AND BUSINESS MANAGEMENT SKILLS.ANALYTICAL THINKING, PROACTIVE ATTITUDE, STRONG WRITTEN AND ORAL COMMUNICATION SKILLS.EXCELLENT INTERPERSONAL SKILLS AND TEAMWORK MINDSET.STRONG AFFINITY FOR DETAILS WITH THE ABILITY TO BE PRODUCTIVE AND ACCOUNTABLE, AS WELL AS WORK UNDER TIGHT DEADLINES WHEN NEEDED.QUOTA CARRYING, INDIVIDUAL CONTRIBUTOR ROLE.\n\nIMPORTANT | POLICY ON UNSOLICITED THIRD-PARTY CANDIDATE SUBMISSIONS\n\nTELEPERFORMANCE DOES NOT ACCEPT CANDIDATE SUBMISSIONS FROM UNSOLICITED THIRD PARTIES, SUCH AS RECRUITERS OR HEADHUNTERS. SUCH APPLICATIONS WILL NOT BE CONSIDERED; SUCH SUBMISSIONS SHALL NOT ESTABLISH A CONTRACTUAL ASSOCIATION.\n\nIS THERE A FINE PRINT?\n\nNO FINE PRINT, THOUGH WE WILL GRAB THIS SPACE TO REMIND YOU THAT TELEPERFORMANCE IS HOME TO A GLOBAL FAMILY WITH PEOPLE FROM VARIOUS BACKGROUNDS AND LIFESTYLES. WE WILL ALWAYS EMBRACE DIVERSITY AND NEVER DISCRIMINATE AGAINST EMPLOYEES OR APPLICANTS BASED ON GENDER IDENTITY OR EXPRESSION, SEXUAL ORIENTATION, RACE, RELIGION, AGE, NATIONAL ORIGIN, CITIZENSHIP, DISABILITY, PREGNANCY STATUS, VETERAN STATUS, OR OTHER DIFFERENCES.",
    "job_skill_set": [
      "B2B Sales",
      "Sales Strategy Development",
      "Contract Negotiation",
      "Customer Acquisition",
      "Market Analysis",
      "Client Presentations",
      "Communication Skills",
      "Interpersonal Skills",
      "Teamwork",
      "Analytical Thinking",
      "Attention to Detail",
      "Proactive Attitude",
      "Networking",
      "Customer Satisfaction Focus",
      "Strategic Thinking",
      "Passion for Sales",
      "Sales Reporting",
      "Digital Transformation Knowledge",
      "CRM Systems (Salesforce)",
      "E-commerce Customer Support Management",
      "Process Transformation (Lean, Six Sigma, RPA)",
      "Pricing Management",
      "Analytics and Spend Analysis",
      "Cloud Sales"
    ],
    "short_keywords": [
      "acquisition",
      "analysis",
      "analytical",
      "analytics",
      "and",
      "attention",
      "attitude",
      "b2b",
      "business",
      "businessdevelopment",
      "client",
      "cloud",
      "communication",
      "contract",
      "crm",
      "customer",
      "detail",
      "development",
      "digital",
      "ecommerce",
      "focus",
      "for",
      "interpersonal",
      "knowledge",
      "lean",
      "management",
      "market",
      "negotiation",
      "networking",
      "passion",
      "presentations",
      "president",
      "pricing",
      "proactive",
      "process",
      "reporting",
      "rpa",
      "sales",
      "salesforce",
      "satisfaction",
      "sigma",
      "six",
      "skills",
      "spend",
      "strategic",
      "strategy",
      "support",
      "systems",
      "teamwork",
      "thinking",
      "to",
      "transformation",
      "vice"
    ]
  },
  {
    "job_id": "3886450064",
    "job_title": "Business Development Intern",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "JOB TITLE: SUMMER INTERNSHIP - BUSINESS DEVELOPMENT INTERN\nSUMMARY:\nAS A BUSINESS DEVELOPMENT INTERN, YOU WILL BE CRUCIAL IN SUPPORTING OUR COMPANY'S GROWTH INITIATIVES AND EXPANDING OUR MARKET REACH. YOU WILL WORK CLOSELY WITH THE MARKETING TEAM TO IDENTIFY NEW BUSINESS OPPORTUNITIES, CONDUCT MARKET RESEARCH, AND ASSIST IN DEVELOPING STRATEGIES TO DRIVE REVENUE GROWTH. THIS INTERNSHIP OFFERS VALUABLE HANDS-ON EXPERIENCE IN THE DYNAMIC FIELD OF BUSINESS DEVELOPMENT WITHIN A FAST-PACED AND INNOVATIVE ENVIRONMENT FOR A BOUTIQUE MARKETING AGENCY.\nRESPONSIBILITIES:\nMARKET RESEARCH: CONDUCT THOROUGH RESEARCH ON INDUSTRY TRENDS, MARKET SEGMENTS, COMPETITORS, AND POTENTIAL CLIENTS TO IDENTIFY NEW BUSINESS OPPORTUNITIES.LEAD GENERATION: ASSIST IN GENERATING LEADS THROUGH VARIOUS CHANNELS SUCH AS COLD CALLING, EMAIL CAMPAIGNS, AND NETWORKING EVENTS.PROPOSAL DEVELOPMENT: SUPPORT THE BUSINESS DEVELOPMENT TEAM IN PREPARING PROPOSALS, PRESENTATIONS, AND PITCHES FOR POTENTIAL CLIENTS.CLIENT RELATIONSHIP MANAGEMENT: AID IN MAINTAINING AND NURTURING RELATIONSHIPS WITH EXISTING CLIENTS TO ENSURE SATISFACTION AND IDENTIFY UPSELLING OPPORTUNITIES.DATA ANALYSIS: ANALYZE SALES AND MARKET DATA TO PROVIDE INSIGHTS AND RECOMMENDATIONS FOR OPTIMIZING BUSINESS DEVELOPMENT STRATEGIES.STRATEGY DEVELOPMENT: COLLABORATE WITH THE TEAM TO DEVELOP AND IMPLEMENT STRATEGIC INITIATIVES AIMED AT EXPANDING THE COMPANY'S MARKET PRESENCE AND DRIVING REVENUE GROWTH.ADMINISTRATIVE SUPPORT: PROVIDE GENERAL ADMINISTRATIVE SUPPORT TO THE BUSINESS DEVELOPMENT TEAM, INCLUDING SCHEDULING MEETINGS, ORGANIZING DOCUMENTS, AND MAINTAINING DATABASES.\nQUALIFICATIONS:\nCURRENTLY ENROLLED IN A BACHELOR'S OR MASTER'S DEGREE PROGRAM IN BUSINESS ADMINISTRATION, MARKETING, FINANCE, ECONOMICS, OR A RELATED FIELD.STRONG ANALYTICAL SKILLS WITH THE ABILITY TO INTERPRET DATA AND DRAW MEANINGFUL INSIGHTS.EXCELLENT COMMUNICATION AND INTERPERSONAL SKILLS, BOTH VERBAL AND WRITTEN.PROACTIVE AND SELF-MOTIVATED WITH A STRONG DESIRE TO LEARN AND CONTRIBUTE TO THE TEAM.PROFICIENCY IN MICROSOFT OFFICE SUITE AND FAMILIARITY WITH CRM SOFTWARE IS A PLUS.PREVIOUS EXPERIENCE IN SALES, MARKETING, OR BUSINESS DEVELOPMENT IS PREFERRED BUT NOT REQUIRED.ABILITY TO WORK INDEPENDENTLY AS WELL AS COLLABORATIVELY IN A TEAM ENVIRONMENT.\nSUCCESS IN THE POSITION:\nSUCCESS IN THIS POSITION WILL BE DEMONSTRATED BY YOUR ABILITY TO EFFECTIVELY CONTRIBUTE TO THE BUSINESS DEVELOPMENT INITIATIVES, IDENTIFY NEW OPPORTUNITIES FOR GROWTH, AND SUPPORT THE TEAM IN ACHIEVING ITS GOALS. YOU WILL EXCEL BY DEMONSTRATING STRONG ANALYTICAL SKILLS, PROACTIVE PROBLEM-SOLVING ABILITIES, AND A COMMITMENT TO DELIVERING HIGH-QUALITY WORK. ADDITIONALLY, YOUR ABILITY TO COMMUNICATE EFFECTIVELY, BOTH INTERNALLY AND EXTERNALLY, AND YOUR EAGERNESS TO LEARN AND ADAPT TO NEW CHALLENGES WILL BE KEY INDICATORS OF SUCCESS.\nA STRONG COMPONENT OF THIS ROLE INVOLVES BOOKING NEW MEETINGS AND PROSPECTING. YOUR SUCCESS IN THIS ASPECT WILL BE MEASURED BY YOUR ABILITY TO EFFICIENTLY GENERATE LEADS, SCHEDULE AND ORGANIZE MEETINGS WITH POTENTIAL CLIENTS, AND CONTRIBUTE TO THE OVERALL PIPELINE DEVELOPMENT EFFORTS. CONSISTENTLY SECURING VALUABLE MEETINGS AND EFFECTIVELY NURTURING PROSPECTS WILL BE PIVOTAL IN DRIVING THE COMPANY'S BUSINESS DEVELOPMENT GOALS FORWARD.\nHOW THIS ROLE FITS INTO THE ORGANIZATION:\nAS A BUSINESS DEVELOPMENT INTERN, YOU WILL BE AN INTEGRAL PART OF OUR MARKETING TEAM, WHICH PLAYS A VITAL ROLE IN DRIVING THE COMPANY'S GROWTH AND EXPANDING OUR MARKET PRESENCE. YOUR CONTRIBUTIONS WILL DIRECTLY IMPACT OUR ABILITY TO IDENTIFY AND CAPITALIZE ON NEW BUSINESS OPPORTUNITIES, STRENGTHEN RELATIONSHIPS WITH EXISTING CLIENTS, AND ULTIMATELY CONTRIBUTE TO THE ACHIEVEMENT OF OUR STRATEGIC OBJECTIVES. THIS INTERNSHIP WILL PROVIDE YOU WITH VALUABLE HANDS-ON EXPERIENCE AND EXPOSURE TO VARIOUS ASPECTS OF BUSINESS DEVELOPMENT, SETTING THE FOUNDATION FOR A SUCCESSFUL CAREER IN THIS FIELD.\nABOUT LEE CREATIVE, LLC:\nLEE CREATIVE CAME TO FRUITION IN APRIL OF 2020 BY JORDAN HENDERSON, SPURRED BY THE ONSET OF THE GLOBAL COVID-19 PANDEMIC. RECOGNIZING HER KNACK FOR DESIGN, BRANDING, AND SOCIAL MEDIA, JORDAN SAW AN OPPORTUNITY TO TURN HER PASSION INTO A BUSINESS THAT COULD ASSIST OTHERS IN BOOSTING ENGAGEMENT, GENERATING LEADS, AND ENHANCING BRAND AWARENESS FOR THEIR VENTURES. WITH A BACKGROUND IN DESIGN DATING BACK TO 2015, JORDAN HAS COLLABORATED WITH NUMEROUS BRANDS AND ENTREPRENEURS, HONING HER SKILLS IN THE CREATIVE FIELD, ACROSS THE UNITED STATES.\nIN MARCH OF 2023, JORDAN TOOK THE LEAP TO PURSUE LEE CREATIVE FULL-TIME, MARKING A SIGNIFICANT MILESTONE IN HER CAREER JOURNEY, AFTER GIVING TWO FULL YEARS TO CORPORATE AMERICA. THIS WAS MADE POSSIBLE BY GRADUATING FROM MISSISSIPPI STATE UNIVERSITY WITH A DEGREE IN DIGITAL MARKETING AND ENTREPRENEURSHIP AND ALWAYS DREAMT OF BEING A SMALL BUSINESS OWNER. JORDAN BRINGS A BLEND OF ACADEMIC KNOWLEDGE AND PRACTICAL EXPERIENCE TO HER ENDEAVORS WITH HER CLIENTELE. CURRENTLY BASED IN DENVER, CO, SHE CONTINUES TO STEER LEE CREATIVE TOWARDS SUCCESS, EMBRACING THE CHALLENGES AND OPPORTUNITIES THAT COME HER WAY, AND SERVING SMALL BUSINESSES IN ANY INDUSTRY ON THE PATH TO DIGITAL SUCCESS.",
    "job_skill_set": [
      "market research",
      "lead generation",
      "data analysis",
      "proposal development",
      "CRM software",
      "communication",
      "analytical skills",
      "problem solving",
      "teamwork",
      "proactive",
      "self-motivated",
      "Microsoft Office Suite"
    ],
    "short_keywords": [
      "analysis",
      "analytical",
      "business",
      "businessdevelopment",
      "communication",
      "crm",
      "data",
      "development",
      "generation",
      "intern",
      "lead",
      "market",
      "microsoft",
      "office",
      "proactive",
      "problem",
      "proposal",
      "research",
      "selfmotivated",
      "skills",
      "software",
      "solving",
      "suite",
      "teamwork"
    ]
  },
  {
    "job_id": "3905338207",
    "job_title": "Manager, Partner Strategy and Business Development",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "YOUR WORK DAYS ARE BRIGHTER HERE.\n\nAT WORKDAY, IT ALL BEGAN WITH A CONVERSATION OVER BREAKFAST. WHEN OUR FOUNDERS MET AT A SUNNY CALIFORNIA DINER, THEY CAME UP WITH AN IDEA TO REVOLUTIONIZE THE ENTERPRISE SOFTWARE MARKET. AND WHEN WE BEGAN TO RISE, ONE THING THAT REALLY SET US APART WAS OUR CULTURE. A CULTURE WHICH WAS DRIVEN BY OUR VALUE OF PUTTING OUR PEOPLE FIRST. AND EVER SINCE, THE HAPPINESS, DEVELOPMENT, AND CONTRIBUTION OF EVERY WORKMATE IS CENTRAL TO WHO WE ARE. OUR WORKMATES BELIEVE A HEALTHY EMPLOYEE-CENTRIC, COLLABORATIVE CULTURE IS THE ESSENTIAL MIX OF INGREDIENTS FOR SUCCESS IN BUSINESS. THAT’S WHY WE LOOK AFTER OUR PEOPLE, COMMUNITIES AND THE PLANET WHILE STILL BEING PROFITABLE. FEEL ENCOURAGED TO SHINE, HOWEVER THAT MANIFESTS: YOU DON’T NEED TO HIDE WHO YOU ARE. YOU CAN FEEL THE ENERGY AND THE PASSION, IT'S WHAT MAKES US UNIQUE. INSPIRED TO MAKE A BRIGHTER WORK DAY FOR ALL AND TRANSFORM WITH US TO THE NEXT STAGE OF OUR GROWTH JOURNEY? BRING YOUR BRIGHTEST VERSION OF YOU AND HAVE A BRIGHTER WORK DAY HERE.\n\nABOUT THE TEAM\n\nIT'S FUN TO WORK IN A COMPANY WHERE PEOPLE TRULY BELIEVE IN WHAT THEY'RE DOING. IN THE WORKDAY GLOBAL PARTNER ORGANIZATION, WE BELIEVE THAT PARTNERS ARE ESSENTIAL TO DELIVERING OUTSTANDING CUSTOMER EXPERIENCES AND EXTRAORDINARY BUSINESS RESULTS. WE ARE PASSIONATE ABOUT WHAT OUR PARTNERS DO FOR OUR CUSTOMERS, WE WORK HARD, WE'RE SERIOUS ABOUT WHAT WE DO, AND WE HAVE FUN DOING IT.\n\nABOUT THE ROLE\n\nTHE PARTNER STRATEGY AND BUSINESS DEVELOPMENT TEAM IN THE GLOBAL PARTNER ORGANIZATION, LEADS STRATEGY, PLANNING AND BUSINESS DEVELOPMENT FOR THE PARTNER BUSINESS AT WORKDAY. WE DEFINE AND EXECUTE OUR STRATEGY WITH LEADERS ACROSS THE BUSINESS; LEAD STRATEGIC PARTNER RELATIONSHIPS; AND DELIVER SIZABLE, NET-NEW REVENUE GROWTH WITH PARTNERS.\n\nTHE PARTNER STRATEGY AND BUSINESS DEVELOPMENT MANAGER WILL MANAGE A TEAM OF STRATEGY AND BD LEADERS WHO EACH OWN ONE OR MORE STRATEGIC PARTNER RELATIONSHIPS AND/OR PARTNER INITIATIVES IN THE COMPANY. THEY ARE RESPONSIBLE FOR SHAPING STRATEGY, IDENTIFYING OPPORTUNITIES FOR GROWTH FOR BOTH WORKDAY AND PARTNER(S), BUILDING NEW CAPABILITIES, AND DELIVERING BUSINESS AND REVENUE OUTCOMES. A SUCCESSFUL LEADER WILL HAVE EXECUTIVE PRESENCE AND COMMUNICATION SKILLS. THEY WILL BE A STRONG FACILITATOR, COORDINATING ACROSS SALES, PRODUCT, CX, MARKETING AND PARTNER ORGANIZATIONS. THEY WILL OPERATE WITH PARTNER OBSESSION AND HIGH JUDGMENT. LASTLY, THEY WILL EXHIBIT OWNERSHIP AND TAKE ACCOUNTABILITY FOR EXCEEDING EXPECTATIONS AND TARGETS.\n\nWE ARE A SCRAPPY TEAM, PASSIONATE ABOUT OUR WORK WITH PARTNERS, AND EXCITED BY THE IMPACT WE HAVE. WE ARE LOOKING FOR A LEADER AND WORKMATE WHO SHARES OUR VALUES AND IS WILLING TO HAVE FUN ALONG THE WAY.\n\nABOUT YOU\n\nBASIC QUALIFICATIONS:\n\n4+ YEARS LEADING STRATEGY OR BUSINESS DEVELOPMENT TEAMS2+ YEARS OF EXPERIENCE WORKING FOR A MANAGEMENT CONSULTING FIRM, INVESTMENT BANKING OR EXPERIENCE IN A STRATEGY ROLE FOR A GLOBAL SAAS COMPANY.4+ YEARS OF EXPERIENCE WORKING IN A PARTNER STRATEGY AND BUSINESS DEVELOPMENT ROLE.\n\nPREFERRED QUALIFICATIONS:\n\nEXPERIENCE IN A STRATEGY, BUSINESS DEVELOPMENTMBA, WITH FOCUS ON STRATEGY OR FINANCEGRADUATE OR UNDERGRADUATE DEGREE, OR EQUIVALENT IN COMPUTER SCIENCE / ENGINEERING, ECONOMICS, OR FINANCEEXPERIENCE IN BOTH COMMERCIAL AND PUBLIC SECTOREXPERIENCE IN US, EMEA AND APJ MARKETSCONSISTENT RECORD OF EXCEEDING TARGETS AND CUSTOMER IMPACTABILITY TO FRAME, STRUCTURE AND EXECUTE LARGE AND COMPLEX PARTNER DEALS ABILITY TO ENGAGE WITH EXECUTIVES, FACILITATE BUSINESS DEVELOPMENT, IDENTIFY LARGE-SCALE GREENFIELD OPPORTUNITIES, AND DELIVER BUSINESS AND REVENUE OUTCOMESABILITY TO INFLUENCE SENIOR LEADERS AND EXECUTIVESSTRONG WRITTEN AND ORAL PRESENTATION SKILLS\n\nWORKDAY PAY TRANSPARENCY STATEMENT\n\nTHE ANNUALIZED BASE SALARY RANGES FOR THE PRIMARY LOCATION AND ANY ADDITIONAL LOCATIONS ARE LISTED BELOW. WORKDAY PAY RANGES VARY BASED ON WORK LOCATION. AS A PART OF THE TOTAL COMPENSATION PACKAGE, THIS ROLE MAY BE ELIGIBLE FOR THE WORKDAY BONUS PLAN OR A ROLE-SPECIFIC COMMISSION/BONUS, AS WELL AS ANNUAL REFRESH STOCK GRANTS. RECRUITERS CAN SHARE MORE DETAIL DURING THE HIRING PROCESS. EACH CANDIDATE’S COMPENSATION OFFER WILL BE BASED ON MULTIPLE FACTORS INCLUDING, BUT NOT LIMITED TO, GEOGRAPHY, EXPERIENCE, SKILLS, JOB DUTIES, AND BUSINESS NEED, AMONG OTHER THINGS. FOR MORE INFORMATION REGARDING WORKDAY’S COMPREHENSIVE BENEFITS, PLEASE CLICK HERE.\n\nPRIMARY LOCATION: USA.CA.PLEASANTON\n\nPRIMARY LOCATION BASE PAY RANGE: $174,600 USD - $261,900 USD\n\nADDITIONAL US LOCATION(S) BASE PAY RANGE: $156,000 USD - $261,900 USD\n\nOUR APPROACH TO FLEXIBLE WORK\n\nWITH FLEX WORK, WE’RE COMBINING THE BEST OF BOTH WORLDS: IN-PERSON TIME AND REMOTE. OUR APPROACH ENABLES OUR TEAMS TO DEEPEN CONNECTIONS, MAINTAIN A STRONG COMMUNITY, AND DO THEIR BEST WORK. WE KNOW THAT FLEXIBILITY CAN TAKE SHAPE IN MANY WAYS, SO RATHER THAN A NUMBER OF REQUIRED DAYS IN-OFFICE EACH WEEK, WE SIMPLY SPEND AT LEAST HALF (50%) OF OUR TIME EACH QUARTER IN THE OFFICE OR IN THE FIELD WITH OUR CUSTOMERS, PROSPECTS, AND PARTNERS (DEPENDING ON ROLE). THIS MEANS YOU'LL HAVE THE FREEDOM TO CREATE A FLEXIBLE SCHEDULE THAT CATERS TO YOUR BUSINESS, TEAM, AND PERSONAL NEEDS, WHILE BEING INTENTIONAL TO MAKE THE MOST OF TIME SPENT TOGETHER. THOSE IN OUR REMOTE \"HOME OFFICE\" ROLES ALSO HAVE THE OPPORTUNITY TO COME TOGETHER IN OUR OFFICES FOR IMPORTANT MOMENTS THAT MATTER.\n\nPURSUANT TO APPLICABLE FAIR CHANCE LAW, WORKDAY WILL CONSIDER FOR EMPLOYMENT QUALIFIED APPLICANTS WITH ARREST AND CONVICTION RECORDS.\n\nWORKDAY IS AN EQUAL OPPORTUNITY EMPLOYER INCLUDING INDIVIDUALS WITH DISABILITIES AND PROTECTED VETERANS.\n\nARE YOU BEING REFERRED TO ONE OF OUR ROLES? IF SO, ASK YOUR CONNECTION AT WORKDAY ABOUT OUR EMPLOYEE REFERRAL PROCESS!\n\n",
    "job_skill_set": [
      "business development",
      "strategy",
      "partner management",
      "executive communication",
      "data analysis",
      "project management",
      "financial analysis",
      "market analysis",
      "presentation skills",
      "leadership",
      "team collaboration",
      "problem solving",
      "influence",
      "accountability",
      "adaptability",
      "customer focus",
      "facilitation",
      "creativity",
      "negotiation",
      "SaaS"
    ],
    "short_keywords": [
      "accountability",
      "adaptability",
      "analysis",
      "and",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "creativity",
      "customer",
      "data",
      "development",
      "executive",
      "facilitation",
      "financial",
      "focus",
      "influence",
      "leadership",
      "management",
      "manager",
      "market",
      "negotiation",
      "partner",
      "presentation",
      "problem",
      "project",
      "saas",
      "skills",
      "solving",
      "strategy",
      "team"
    ]
  },
  {
    "job_id": "3904395156",
    "job_title": "Business Development Manager - Work Remotely",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "POSITION: SALES AND MARKETING PROFESSIONAL (REMOTE)ABOUT US: BECOME A PART OF A LEADING PLAYER IN THE LEADERSHIP DEVELOPMENT INDUSTRY, DEDICATED TO EMPOWERING INDIVIDUALS TO UNLOCK THEIR FULL POTENTIAL. OUR TEAM OFFERS COMPREHENSIVE TRAINING AND UNWAVERING SUPPORT TO HELP YOU THRIVE IN BUILDING A SUCCESSFUL BUSINESS WHILE MAKING A POSITIVE IMPACT ON OTHERS.\nKEY RESPONSIBILITIES:· ENGAGE IN MARKETING ACTIVITIES ACROSS VARIOUS ADVERTISING PLATFORMS, BACKED BY THOROUGH TRAINING MODULES.· PARTICIPATE IN INTERACTIVE TRAINING PROGRAMS TO SHARPEN YOUR SKILLS AND KNOWLEDGE IN SALES AND MARKETING.· COMMUNICATE EFFECTIVELY WITH CLIENTS VIA PHONE, ZOOM, OR EMAIL, UNDERSTANDING THEIR NEEDS AND OFFERING TAILORED SOLUTIONS.· TAKE PRIDE IN YOUR WORK, MAINTAINING A POSITIVE, ENERGETIC ATTITUDE WHILE STRIVING TO EXCEED EXPECTATIONS.· CULTIVATE POSITIVE AND PROFESSIONAL RELATIONSHIPS WITH LIKE-MINDED ENTREPRENEURS FOR MUTUAL GROWTH AND SUCCESS.\nQUALIFICATIONS:· STRONG COMMUNICATION SKILLS AND A GENUINE DESIRE TO EXCEL AND BUILD A THRIVING BUSINESS.· SELF-DIRECTED AND MOTIVATED WITH THE ABILITY TO TAKE INITIATIVE AND WORK INDEPENDENTLY.· EAGER TO LEARN AND GROW, COMMITTED TO PERSONAL AND PROFESSIONAL DEVELOPMENT.· COMFORTABLE WORKING REMOTELY AND ADEPT AT MANAGING YOUR OWN SCHEDULE EFFECTIVELY.· NO PREVIOUS EXPERIENCE NECESSARY IN SALES OR MARKETING; WE PROVIDE FULL TRAINING.\nWHY JOIN US?· ENJOY THE FLEXIBILITY TO SET YOUR OWN HOURS AND WORK FROM HOME OR ANYWHERE IN THE WORLD.· BENEFIT FROM COMPREHENSIVE TRAINING AND SUPPORT, INCLUDING ACCESS TO A PERSONAL BUSINESS MENTOR.· EXPAND YOUR HORIZONS GLOBALLY AND BUILD A SUCCESSFUL BUSINESS ON YOUR TERMS.· JOIN A VIBRANT COMMUNITY OF PURPOSE-DRIVEN INDIVIDUALS DEDICATED TO PERSONAL GROWTH AND SUCCESS.\nREADY TO TAKE THE LEAP? IF YOU'RE PREPARED TO TAKE CONTROL OF YOUR CAREER AND EMBRACE AN OPPORTUNITY THAT EXCITES AND CHALLENGES YOU, WE WANT TO HEAR FROM YOU! REACH OUT TODAY TO DISCOVER HOW YOU CAN JOIN OUR TEAM AND START MAKING A POSITIVE CHANGE IN YOUR LIFE.DON'T WAIT ANY LONGER—SEIZE THE OPPORTUNITY TO CREATE THE FUTURE YOU DESERVE. CONTACT US NOW TO TAKE THE FIRST STEP TOWARD A BRIGHTER TOMORROW! 🌟\n\nAT THIS TIME OUR COMPANY IS NOT OPERATING IN UAE, INDIA, INDONESIA, CHINA OR AFRICA\n\n\n\n",
    "job_skill_set": [
      "sales",
      "marketing",
      "communication",
      "training",
      "self-motivation",
      "initiative",
      "positive attitude",
      "relationship building",
      "adaptability",
      "personal development",
      "remote work"
    ],
    "short_keywords": [
      "adaptability",
      "attitude",
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "development",
      "initiative",
      "manager",
      "marketing",
      "personal",
      "positive",
      "relationship",
      "remote",
      "remotely",
      "sales",
      "selfmotivation",
      "training",
      "work"
    ]
  },
  {
    "job_id": "3887887820",
    "job_title": "Director of Business Development",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "SMITHGROUP IS AN AWARD-WINNING, INTEGRATED DESIGN FIRM THAT BLENDS RESEARCH, DATA AND TECHNOLOGY WITH INNOVATION AND A CREATIVE SPIRIT TO DELIVER RESILIENT, INCLUSIVE SPACES THAT SOLVE OUR CLIENTS' GREATEST CHALLENGES. OUR TEAMS CREATE EXCEPTIONAL DESIGN SOLUTIONS FOR HEALTHCARE, SCIENCE AND TECHNOLOGY, WORKPLACE, MIXED USE, HIGHER EDUCATION, CULTURAL, WATERFRONT, PARKS AND OPEN SPACES, AND URBAN ENVIRONMENTS. WE ARE LOOKING FOR PASSIONATE PROBLEM SOLVERS WHO WANT TO ELEVATE DESIGN, PUSH BOUNDARIES AND MOVE US CLOSER TO A CARBON-FREE FUTURE. CARE TO JOIN US?\n\nTHE DENVER OFFICE OF SMITHGROUP IS LOOKING FOR A DIRECTOR OF BUSINESS DEVELOPMENT TO JOIN OUR TEAM.\n\nWORKING WITH US, YOU WILL:\n\nLEAD THE DEVELOPMENT OF BUSINESS DEVELOPMENT STRATEGY BY WORKING ALONGSIDE KEY PARTNERS.MONITOR INDUSTRY TRENDS AND COLLECT MARKET INTELLIGENCE ON CLIENTS AND COMPETITORS BY MONITORING WEBSITES, COLLATERAL PRESENTATIONS, TRADE JOURNALS AND DISCUSSION LISTS.FACILITATE STRATEGIC PARTNER COLLABORATIONS INCLUDING PRE-POSITIONING SESSIONS AND STRATEGIC ALLIANCES WITH PARTNERS LIKE CONTRACTORS, DEVELOPERS, ORGANIZATIONS, OR OTHER KEY CONSULTANTS.PERFORM MARKET TRENDS ANALYSIS AND LEAD COORDINATION OF INTRODUCTORY MEETINGS WITH PROSPECTIVE CLIENTS.ATTEND INDUSTRY EVENTS FOR NETWORKING AND RELATIONSHIP BUILDING.PARTICIPATE IN COMMITTEES OR OTHER ACTIVE ROLES IN EXTERNAL INDUSTRY-RELATED ORGANIZATIONS.ACTIVELY RESEARCH PROJECT OPPORTUNITIES FOR ASSOCIATED STUDIOS THROUGH NETWORKING, PERSONAL RELATIONSHIPS, COLD CALLS, READING OF PUBLICATIONS, ATTENDING COMMUNITY EVENTS, AND PARTICIPATING IN INDUSTRY ORGANIZATIONS.BUILD AND IMPLEMENT CAPTURE PLANS FOR KEY TARGET CLIENTS.COLLABORATE WITH MANAGEMENT AND TECHNICAL STAFF TO IDENTIFY PROJECT OPPORTUNITIES, STRENGTHEN CURRENT BUSINESS TIES AND CLIENT RELATIONSHIPS, AND FORMULATE BUSINESS DEVELOPMENT STRATEGIES TO EXPAND SMITHGROUP MARKET SECTORS.CONDUCT AND ANALYZE DEBRIEF SURVEYS THROUGHOUT THE PURSUIT AND PROJECT PROCESS.UPDATE AND MAINTAIN LEAD TRACKING DATABASES WITH RELEVANT INFORMATION ON TARGETED CLIENTS, CONTACTS, AND OPPORTUNITIES.DEVELOP PROJECT PURSUIT STRATEGIES AND POSITION SMITHGROUP FOR PROJECTS BEFORE REQUESTS FOR PROPOSALS ARE ISSUED.ACTIVELY ENGAGE IN PROPOSAL STRATEGY DEVELOPMENT AND WRITE KEY PROPOSAL SECTIONS FOR TOP PURSUITS.LEAD AND DEVELOP LOCAL EVENTS INCLUDING CLIENT OUTREACH, RELATIONSHIP BUILDING AT EVENTS, AND POST-EVENT FOLLOW UP.BUILD AND IMPLEMENT A STRATEGY FOR CONFERENCE ENGAGEMENT, INDUSTRY/TRADE ORGANIZATIONS, AND MEMBERSHIPS/SPONSORSHIPS.\n\nAN IDEAL CANDIDATE HAS:\n\nBACHELOR’S DEGREE IN MARKETING, COMMUNICATIONS, JOURNALISM, PUBLIC RELATIONS OR RELATED FIELD, PREFERRED.MINIMUM OF 7 YEARS OF EXPERIENCE IN BUSINESS DEVELOPMENT, 3+ IN AEC INDUSTRY.PREFERRED MARKET EXPIERENCE IN HIGHER EDUCATION, HEATH AND SCIENCE & TECHNOLOGY. THE ABILITY TO THINK CREATIVELY AND STRATEGICALLY.STRONG VERBAL, WRITTEN, AND PRESENTATION SKILLS FOR EFFECTIVE PRESENTATIONS AND INTERACTIONS WITH INTERNAL/EXTERNAL CLIENTS.PROFICIENCY IN MICROSOFT OFFICE SUITE AND MICROSOFT TEAMS AS WELL AS EXPERIENCE USING DELTEK VISION.\n\nSMITHGROUP'S COMPETITIVE COMPENSATION AND BENEFIT PACKAGE IS DESIGNED TO MEET THE NEEDS OF A DIVERSE STAFF. THE ANTICIPATED SALARY RANGE FOR THIS POSITION IS $107,000 TO $134,000 ANNUALLY, AT THE TIME OF POSTING. WE MAY ULTIMATELY PAY MORE OR LESS THAN THE ANTICIPATED SALARY RANGE FOR THIS POSITION. ADDITIONALLY, AN EMPLOYEE IN THIS POSITION IS ELIGIBLE FOR A PERFORMANCE-BASED BONUS ON AN ANNUAL BASIS. OUR COMPREHENSIVE BENEFITS INCLUDE MEDICAL, DENTAL AND VISION COVERAGE, FLEXIBLE SPENDING ACCOUNT OPTIONS AND VOLUNTARY INSURANCES. WE PROVIDE AN OPPORTUNITY TO INVEST IN YOUR FUTURE THROUGH OUR 401(K) PROGRAM WITH EMPLOYER MATCHING AND A CONTINUING EDUCATION REIMBURSEMENT. WE OFFER 3 WEEKS OF PAID TIME OFF WITHIN THE FIRST YEAR OF EMPLOYMENT, WITH THE OPTION OF PURCHASING ADDITIONAL TIME OFF, 8 PAID FEDERAL HOLIDAYS, AND PARENTAL LEAVE BENEFITS. SMITHGROUP ALSO PROMOTES A HEALTHY WORK/LIFE BALANCE FOR OUR STAFF WHICH INCLUDES AN ALTERNATIVE WORK SCHEDULE THAT PROVIDES EMPLOYEES WITH AN ADDITIONAL 15 DAYS OFF PER YEAR (USUALLY FRIDAYS), AS WELL AS HYBRID WORK OPTIONS THAT GIVE OUR TEAM THE FLEXIBILITY TO WORK WITHIN OUR VIBRANT OFFICE CULTURE OR REMOTELY, AS NEEDED.\n\nIF YOU ARE NOT SURE THAT YOU MEET ALL OF THE SUGGESTED QUALIFICATIONS DESCRIBED ABOVE, PLEASE DON’T LEAVE THIS PAGE. YOUR TALENTS AND ATTRIBUTES COULD BE JUST WHAT WE’RE LOOKING FOR – AND WE STRONGLY ENCOURAGE YOU TO APPLY. IF YOU NEED ADDITIONAL ACCOMMODATIONS TO COMPLETE THE APPLICATION PROCESS, PLEASE CONTACT CAREERS@SMITHGROUP.COM.",
    "job_skill_set": [
      "business development",
      "relationship building",
      "communication",
      "problem solving",
      "networking",
      "leadership",
      "market analysis",
      "proposal writing",
      "Microsoft Office Suite",
      "Microsoft Teams",
      "Deltek Vision",
      "strategic planning",
      "creativity",
      "team collaboration",
      "presentation skills"
    ],
    "short_keywords": [
      "analysis",
      "building",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "creativity",
      "deltek",
      "development",
      "director",
      "leadership",
      "market",
      "microsoft",
      "networking",
      "of",
      "office",
      "planning",
      "presentation",
      "problem",
      "proposal",
      "relationship",
      "skills",
      "solving",
      "strategic",
      "suite",
      "team",
      "teams",
      "vision",
      "writing"
    ]
  },
  {
    "job_id": "3901685316",
    "job_title": "Business Development Manager - Litigation",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "BALLARD SPAHR HAS A GREAT OPPORTUNITY CURRENTLY AVAILABLE FOR A DYNAMIC AND SUCCESSFUL BUSINESS DEVELOPMENT PROFESSIONAL TO JOIN THE MARKETING TEAM AS A BUSINESS DEVELOPMENT MANAGER (BDM) SUPPORTING PRACTICE GROUPS IN OUR LITIGATION DEPARTMENT.\nTHE SUCCESSFUL CANDIDATE WILL BE AN IMPORTANT PART OF OUR BUSINESS DEVELOPMENT AND MARKETING TEAM AND WILL BE REQUIRED TO WORK CLOSELY WITH THE LITIGATION DEPARTMENT LEADERSHIP, PRACTICE GROUP LEADERS, INDUSTRY TEAM LEADERS, MARKETING DEPARTMENT LEADERSHIP, ATTORNEYS, AND OTHER MARKETING TEAM MEMBERS TO SUPPORT THE DEVELOPMENT OF NEW BUSINESS AND TO DEEPEN EXISTING CLIENT RELATIONSHIPS.\nTHE BDM IS RESPONSIBLE FOR DEVELOPING AND IMPLEMENTING BUSINESS DEVELOPMENT PLANS, AS WELL AS IDENTIFYING OPPORTUNITIES FOR CURRENT AND POTENTIAL CLIENTS. IN ADDITION, THE BDM WILL BE INTEGRAL IN BUILDING BRAND AWARENESS FOR THE FIRM, ALIGNING THOSE EFFORTS WITH BROADER FIRM AND DEPARTMENT GOALS. SUCCESSFUL TEAM MEMBERS MUST BE RESILIENT, FOCUSED, CREATIVE, AND DEMONSTRATE A COLLABORATIVE AND CONSULTATIVE WORKING STYLE.\nESSENTIAL FUNCTIONS:\nWORKING WITH DEPARTMENT CHAIRS, PRACTICE GROUP AND INDUSTRY TEAM LEADERS TO CREATE AND IMPLEMENT STRATEGIC BUSINESS DEVELOPMENT PLANS AND PROMOTING THE FIRM'S SERVICES WHILE UNDERSTANDING, ADDRESSING, AND ALIGNING OUR EFFORTS WITH TARGETS' AND CLIENTS' OBJECTIVESDEVELOPING AND MAINTAINING A ROLLING PIPELINE WHICH TRACKS TARGETS, OPPORTUNITIES, AND PROGRESS UPDATES TO HELP ATTORNEYS ACHIEVE GOALSPROVIDING BUSINESS DEVELOPMENT COACHING IN GROUP AND ONE-ON-ONE SETTINGS AND SUPPORTING LAWYERS IN THE DEVELOPMENT OF THEIR INDIVIDUAL ATTORNEY BUSINESS DEVELOPMENT PLANSMANAGING AND DRIVING FOLLOW UP ON ASSIGNED BUSINESS DEVELOPMENT INITIATIVES AND COORDINATING BUSINESS DEVELOPMENT EFFORTS ACROSS PRACTICES AND INDUSTRIESASSISTING WITH THE DEVELOPMENT AND MANAGEMENT OF PRACTICE GROUP AND INDUSTRY TEAM MARKETING BUDGETS, INCLUDING PROVIDING INSIGHT INTO THE RETURN ON INVESTMENT OF EXPENDITURESPROVIDING ONGOING MARKETING RESEARCH, COMPETITIVE INTELLIGENCE AND ANALYSIS; GATHERING INTELLIGENCE ON EMERGING MARKET AND INDUSTRY TRENDS TO PROVIDE ATTORNEYS WITH AN UNDERSTANDING OF THE COMPETITIVE LANDSCAPE AND TO POSITION THE FIRM FOR INCREASED EFFECTIVENESS IN WINNING NEW BUSINESSMANAGING THE COMPILATION, DEVELOPMENT AND MAINTENANCE OF RELEVANT DATABASE CONTACTS/MAILING LISTSWORKING WITH THE DIRECTOR OF COMMUNICATIONS AND THE PR TEAM TO IDENTIFY PRESS OPPORTUNITIESPROVIDING STRATEGIC GUIDANCE TO ATTORNEYS AND COLLABORATING WITH THE PROPOSAL TEAM ON RELEVANT CONTENT AND POSITIONING FOR PITCH MATERIALS, PROPOSALS, AND RFP RESPONSES, AND OCCASIONALLY LEAD PROPOSAL RESPONSESIN COLLABORATION WITH THE CLIENT EVENTS AND COMMUNICATIONS TEAMS, OVERSEEING THE STRATEGY AND DEVELOPMENT OF EVENTS, SPONSORSHIPS AND OTHER MARKETING/COMMUNICATIONS ACTIVITIESBUILDING RELATIONSHIPS WITH KEY INDUSTRY AND PRACTICE GROUP ORGANIZATIONS AS A MARKET-FACING RESOURCE AND AMBASSADOR FOR THE FIRMENSURING THE COMPILATION AND MAINTENANCE OF RELEVANT PRACTICE-RELATED CONTENT, MATERIALS, AND EXPERIENCE\nTHIS POSITION CAN BE LOCATED IN ATLANTA, BALTIMORE, MINNEAPOLIS, PHILADELPHIA, PHOENIX, SALT LAKE CITY, OR WASHINGTON, DC AND WILL BE A HYBRID WORK ARRANGEMENT WITH 3 DAYS IN THE OFFICE PER WEEK.\nTHE IDEAL CANDIDATE WILL DEMONSTRATE INDEPENDENT JUDGMENT, STRATEGIC AND DIPLOMATIC THINKING AND HAVE THE ABILITY TO LEAD BUSINESS DEVELOPMENT EFFORTS WHILE BUILDING CONSENSUS. THE ABILITY TO HANDLE MULTIPLE PROJECTS AND DEADLINES, COMBINED WITH A STRONG WORK ETHIC AND A TEAM PLAYER ATTITUDE ARE INDISPENSABLE.\nREQUIREMENTS INCLUDE A COLLEGE DEGREE WITH 5+ YEARS OF EXPERIENCE IN LEGAL MARKETING; EXCELLENT WRITING, EDITING, COMMUNICATION (ORAL AND WRITTEN), PROJECT MANAGEMENT, INTERPERSONAL, AND ANALYTICAL SKILLS; STRONG COMPUTER PROFICIENCY A MUST (INCLUDING KNOWLEDGE OF CRMS AND MARKETING DATABASES), SIGNIFICANT BUSINESS KNOWLEDGE AND EXPERIENCE; AND AN INTENSE CLIENT SERVICE ATTITUDE. SOME TRAVEL MAY BE REQUIRED. PRIOR LAW FIRM EXPERIENCE SUPPORTING LITIGATION PRACTICES REQUIRED.RESUME, COVER LETTER AND SALARY REQUIREMENTS ARE REQUIRED.\nBALLARD SPAHR IS COMMITTED TO INCREASING DIVERSITY IN THE LEGAL PROFESSION AND TO SUPPORTING THE COMMUNITIES WHERE WE LIVE AND WORK. PEOPLE FROM ALL BACKGROUNDS ARE VALUED AND INTEGRATED INTO EVERY PART OF THE FIRM. DIVERSE CANDIDATES INCLUDING WOMEN, PEOPLE OF COLOR AND MEMBERS OF THE LGBTQAI+ COMMUNITY, VETERANS AND INDIVIDUALS WITH DISABILITIES ARE ENCOURAGED TO APPLY.\nBALLARD SPAHR IS NOT ACCEPTING RESUMES FROM SEARCH FIRMS FOR THIS POSITION.\nBALLARD SPAHR OFFERS EXCELLENT COMPENSATION, A COMPREHENSIVE BENEFITS PACKAGE, AND A GENEROUS PAID TIME OFF PROGRAM. FOR IMMEDIATE CONSIDERATION, PLEASE VISIT BALLARD SPAHR CAREER OPPORTUNITIES AND APPLY ONLINE.\nBALLARD SPAHR IS AN EQUAL OPPORTUNITY EMPLOYER COMMITTED TO FOSTERING A CULTURALLY DIVERSE ENVIRONMENT. THE FIRM ENCOURAGES APPLICATIONS FROM A DIVERSE POOL OF CANDIDATES, AND ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, ETHNICITY, RELIGION, AGE, NATIONAL ORIGIN, HANDICAP OR DISABILITY, CITIZENSHIP, SEX, PREGNANCY, CHILDBIRTH OR RELATED MEDICAL CONDITION, SEXUAL ORIENTATION, GENDER IDENTITY AND EXPRESSION, TRANSGENDER STATUS, SEX STEREOTYPING, GENETIC INFORMATION, ANCESTRY, VETERAN STATUS OR ANY OTHER CATEGORY PROTECTED BY APPLICABLE LAW.\nDESIRED SKILLS AND EXPERIENCEINDEPENDENT JUDGMENT SKILLS; STRATEGIC AND DIPLOMATIC THINKING SKILLS; BUSINESS DEVELOPMENT SKILLS; PROJECT MANAGEMENT SKILLS; TIME MANAGEMENT SKILLS; INTERPERSONAL SKILLS.",
    "job_skill_set": [
      "business development",
      "legal marketing",
      "project management",
      "analytical skills",
      "competitive intelligence",
      "communication",
      "teamwork",
      "strategic thinking",
      "independent judgment",
      "interpersonal skills",
      "time management",
      "creativity",
      "resilience",
      "consultative working style",
      "CRM software",
      "marketing databases",
      "budget management",
      "event management"
    ],
    "short_keywords": [
      "analytical",
      "budget",
      "business",
      "businessdevelopment",
      "communication",
      "competitive",
      "consultative",
      "creativity",
      "crm",
      "databases",
      "development",
      "event",
      "independent",
      "intelligence",
      "interpersonal",
      "judgment",
      "legal",
      "litigation",
      "management",
      "manager",
      "marketing",
      "project",
      "resilience",
      "skills",
      "software",
      "strategic",
      "style",
      "teamwork",
      "thinking",
      "time",
      "working"
    ]
  },
  {
    "job_id": "3904432308",
    "job_title": "Business Development Manager (Industrial) - Toronto, Ontario - Canada",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "WE INSTALL INNOVATIONS WHERE THEY MATTER MOST. IN THE MINDS OF OUR CUSTOMERS AND PARTNERS.\n\nAS A DRIVER OF INNOVATION, VIEGA IS ONE OF THE MOST IMPORTANT TECHNOLOGY LEADERS IN THE INSTALLATION INDUSTRY. WE DEVELOP INTELLIGENT SYSTEMS AND INTEGRATED DIGITAL SOLUTIONS. QUALITY IS INCORPORATED INTO EVERYTHING WE DO. WE BELIEVE THAT THIS IS ABOUT MUCH MORE THAN SUPPLYING PIPELINES. WE TURN SPACES INTO LIVING ROOMS: MORE COMFORTABLE. MORE INTELLIGENT. MORE SECURE. MORE SUSTAINABLE.\n\nSUPPORT US AS\n\nBUSINESS DEVELOPMENT MANAGER (INDUSTRIAL) - TORONTO, ONTARIO - CANADA\n\nJOB-ID: 14110; LOCATION(S): FIELD \n\nTHIS PERSON WOULD BE BASED IN TORONTO, ONTARIO - CANADA. \n\nJOB DESCRIPTION SUMMARY\n\nTHE BUSINESS DEVELOPMENT MANAGER – INDUSTRIAL – IS AN INDUSTRIAL SECTOR POSITION AND WILL BE RESPONSIBLE TO DRIVE THE INDUSTRIAL SALES STRATEGY, DEVELOP AND EXECUTE STRATEGIC PLANS WITH CLEAR GOALS, OBJECTIVES, KPIS, AND CUSTOMER TARGETS FOR SUSTAINABLE PROFITABLE GROWTH OF INDUSTRIAL BUSINESS IN CANADA. THIS POSITION WILL GROW, LEAD, AND DRIVE THE ADOPTION OF PRESS TECHNOLOGY SOLUTIONS THROUGH A DEEP UNDERSTANDING OF THE INDUSTRIAL BUSINESS WITH AN EMPHASIS ON TECHNICAL SPECIFICATIONS, ENGINEERING REQUIREMENTS, AND FOCUSED EXECUTION OF SALES ATTACK PLANS. THIS POSITION REPORTS TO GENERAL MANAGER OF CANADA AND WILL WORK CLOSELY WITH REGIONAL MANAGERS AND FIELD SALES TEAM TO CREATE A COLLABORATIVE APPROACH TO BUILDING THE INDUSTRIAL BUSINESS IN CANADA.\n\nJOB DESCRIPTION DETAILS\n\nGROW, EXPAND, AND ACCELERATE SUSTAINABLE PROFITABLE GROWTH OF INDUSTRIAL SECTOR BUSINESS IN CANADA.PROACTIVELY IDENTIFY AND WIN INDUSTRIAL BUSINESS OPPORTUNITIES BY ESTABLISHING AND NURTURING RELATIONSHIP WITH KEY STAKEHOLDERS, PARTICULARLY FOCUSING ON ENGINEERING FIRM, EPCS, INDUSTRIAL PLANT OWNERS, INDUSTRIAL CONTRACTORS, GOVERNMENT AGENCIES TO ENSURE ALL PRODUCTS ARE IN EVERY APPLICABLE SECTION OF THEIR MASTER AND PROJECT SPECIFICATIONS.PROACTIVELY SEARCH AND CONNECT WITH NEW INDUSTRIAL PROJECTS AND EXISTING INDUSTRIAL PLANTS, DEFINE OPPORTUNITIES, VALUE PROPOSITIONS, AND DEVELOP TAILORED SEGMENT SPECIFIC APPROACH WITHIN INDUSTRIAL SECTOR. DEVELOP AND MAINTAIN DATA DRIVEN CUSTOMER SEGMENTATION WITH CLEARLY DEFINED ACCOUNT PLANNING IN CRM. EXECUTES SALES AND ACCOUNT STRATEGIES, IN ACCORDANCE WITH STRATEGIC GOALS AND IN CLOSE COLLABORATION WITH THE FIELD SALES TEAM.COLLABORATE WITH REGIONAL MANAGERS AND FIELD SALES TEAM TO CREATE INDUSTRIAL SALES ATTACK PLANS AND PROVIDE DIRECTION REGARDING REGARDING CUSTOMER TARGETS AND OPPORTUNITY MANAGEMENT TO DRIVE CONVERSIONS AND SHARE OF WALLET. COLLABORATE WITH NATIONAL DISTRIBUTION MANAGER TO ENSURE PERFECT DISTRIBUTION FOR SERVING INDUSTRIAL CUSTOMERS.PROVIDE REGULAR FEEDBACK AND INPUT TO THE REGIONAL LEADERSHIP TEAM ON SALES PERFORMANCE, PRODUCTIVITY, OPPORTUNITY MANAGEMENT, SALES FORECAST, LEAD MANAGEMENT AND OVERALL SALES EFFORTS ON GROWING INDUSTRIAL BUSINESS IN THE REGION. INCREASES DEMAND FOR COMPANY’S PRODUCTS BY SOLICITING NEW CUSTOMER CALLS; MAINTAINS A CYCLE OF REGULARLY SCHEDULED CALLS AND VISITS TO CUSTOMERS; VISITS PLANTS AND FACILITIES; GROWS CUSTOMER/CONTRACTOR DATABASE FOR THE INDUSTRIAL SECTOR.DELIVERS PROFESSIONAL TECHNICAL PRESENTATIONS, UTILIZING PRODUCT SAMPLES AND ON-SITE TRAININGS, TO VARIOUS INDIVIDUALS, INCLUDING BUT NOT LIMITED TO, FACILITY ENGINEERS, PLANT MANAGERS, CODE OFFICIALS, EDUCATORS, CONTRACTORS, ENGINEERING FIRMS, ETC. TO ADVANCE MARKET GROWTH AND PRODUCT DEVELOPMENT.\n\nCODE ENFORCEMENT\n\nCONTACTS LOCAL CODE OFFICIALS TO OBTAIN ACCEPTANCE OF EXISTING AND NEW PRODUCTS.WORKS WITH LOCAL INSPECTORS TO RESOLVE INSTALLATION QUESTIONS AND ISSUES.\n\nREPORTING\n\nMAINTAINS AND UPDATES CUSTOMER SEGMENTATION, AND ENGINEERING SPECIFICATION DATABASE. PROVIDES REPORTING AND UPDATES TO MANAGEMENT, BOTH ONGOING AND AS REQUESTED REGARDING FIELD ACTIVITY, SPEC INCLUSION, COMPETITORS, FORECASTS, INDUSTRY TRENDS AND NEW PRODUCTS, AS WELL AS BUSINESS METRICS.TRACKS TRAVEL AND INCIDENTAL EXPENSES; PREPARES EXPENSE REPORTS; ENSURES EXPENSES ARE WITHIN BUDGET PARAMETERS.\n\nOTHER\n\nATTENDS MEETINGS AND TRAINING AS REQUIRED OR ASSIGNED.PARTICIPATES IN LOCAL SOCIETIES, INCLUDING BUT NOT LIMITED TO ASPE, SIA, TAPPI, ISPE, IDFA, ETC. TO PROMOTE AN UNDERSTANDING OF PRODUCTS AND TECHNOLOGIES.PERFORMS OTHER DUTIES AS REQUIRED AND/OR ASSIGNED.\n\nSPECIAL JOB DIMENSIONS\n\nWILL BE REQUIRED TO TRAVEL UP TO 70% OF THE TIME\n\nREQUIRED QUALIFICATIONS\n\nEDUCATION, CERTIFICATION/LICENSE & WORK EXPERIENCE\n\n BACHELOR’S DEGREE IN ENGINEERING IS PREFERRED\n\nAND\n\n MINIMUM OF FIVE YEARS OF SALES AND BUSINESS DEVELOPMENT EXPERIENCE IN THE INDUSTRIAL MANUFACTURING SECTOR.\n\nEQUIVALENT COMBINATIONS OF EDUCATION AND EXPERIENCE MAY BE CONSIDERED\n\nKNOWLEDGE, SKILLS AND ABILITIES\n\n WORKING KNOWLEDGE OF CUSTOMERS, TRENDS, AND ASSOCIATIONS IN INDUSTRIAL SEGMENT KNOWLEDGE OF COMPUTER PROGRAMS SUCH AS MICROSOFT OUTLOOK, WORD AND EXCEL; SAP AND BUSINESS WAREHOUSE; SALESFORCE EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS SOLID ORGANIZATIONAL AND ANALYTICAL SKILLS SELF-MOTIVATED, SELF-STARTER WHO HAS THE ABILITY TO WORK WELL WITH OTHERS AS WELL AS WORK INDEPENDENTLY ADVANCED RELATIONSHIP BUILDING AND STRATEGIC SELLING SKILLS ABILITY TO IDENTIFY MARKET DYNAMICS AND QUICKLY DEFINE AND IMPLEMENT COMPETITIVE CAMPAIGNS SOLID PRESENTATION SKILLS WITH THE CAPABILITY OF EFFECTIVELY PRESENTING TO ALL LEVELS OF THE ORGANIZATION EMBRACE CHANGE AND NEW IDEAS ABILITY TO TRAIN, LEAD AND MOTIVATE A HIGH FUNCTIONING TEAM ABILITY TO PERFORM WITH SUPERIOR SERVICE, REFLECTING A POSITIVE COMPANY IMAGE WHILE SUSTAINING A POSITIVE ATTITUDE WITH THOSE YOU INTERACT WITH; ALWAYS GOING ABOVE AND BEYOND TO HELP OTHERS OUT, REGARDLESS OF THEIR POSITION OR DEPARTMENT. DESIRE TO ADHERE TO THE HIGHEST STANDARDS OF QUALITY WHILE CONTINUALLY PERFORMING AT THE HIGHEST POSSIBLE LEVEL. PASSION TO EMBRACE THE VIEGA VALUES AND EMBED THEM INTO DAILY WORK: ACHIEVE GOALSBE EMPOWEREDSHOW RESPECTASSUME RESPONSIBILITYBUILD TRUST\n\nYOUR CONTACT PERSON\n\nSANDY BRADY\n\nTHE FUTURE NEEDS PEOPLE LIKE YOU TO SHAPE IT.\n\nAPPLY TO VIEGA NOW.\n\n",
    "job_skill_set": [
      "Sales Strategy",
      "Business Development",
      "Microsoft Office Suite",
      "Presentation Skills",
      "Communication",
      "Relationship Building",
      "Team Leadership",
      "Self-Motivation",
      "Problem Solving",
      "Adaptability",
      "Organizational Skills",
      "Customer Service Orientation",
      "Strategic Thinking",
      "Positive Attitude",
      "Technical Specifications",
      "CRM Software",
      "SAP",
      "Salesforce",
      "Data Analysis",
      "Market Analysis"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "attitude",
      "building",
      "business",
      "businessdevelopment",
      "canada",
      "communication",
      "crm",
      "customer",
      "data",
      "development",
      "industrial",
      "leadership",
      "manager",
      "market",
      "microsoft",
      "office",
      "ontario",
      "organizational",
      "orientation",
      "positive",
      "presentation",
      "problem",
      "relationship",
      "sales",
      "salesforce",
      "sap",
      "selfmotivation",
      "service",
      "skills",
      "software",
      "solving",
      "specifications",
      "strategic",
      "strategy",
      "suite",
      "team",
      "technical",
      "thinking",
      "toronto"
    ]
  },
  {
    "job_id": "3905216454",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "COMPENSATION: TOP PERFORMERS WILL EARN BETWEEN $80,000-$100,000+ ANNUALLY (BASE+COMMISSION)EMPLOYMENT TYPE: FULL-TIMEEATON REALTY IS SEEKING A STRONG SALESPERSON WITH A REAL ESTATE BACKGROUND LOOKING TO JOIN A GREAT COMPANY.YOU WILL SPEND YOUR DAYS MEETING WITH AND PROSPECTING OWNERS OF RENTAL PROPERTIES TO HELP THEM UNDERSTAND THE POWER OF WORKING WITH A PROFESSIONAL PROPERTY MANAGER LIKE EATON REALTY.THE BUSINESS DEVELOPMENT MANAGER (BDM) AT EATON REALTY IS RESPONSIBLE FOR MAKING GREAT FIRST IMPRESSIONS WITH POTENTIAL CLIENTS. ALL NEW LEADS AND REFERRALS WILL BE INTRODUCED TO THE BDM SO THAT THEY CAN ENSURE THAT THEY ARE A GOOD FIT FOR THE COMPANY AND COMMUNICATE THE UNIQUE CAPABILITIES AND OUTCOMES THAT EATON REALTY DELIVERS. OVER TIME, THE BDM WILL BECOME THE FOUNDATION OF OUR MOST LEGENDARY CUSTOMER SUCCESS AND SERVICE STORIES. THE BDM IS BOTH A FILTER THAT SAVES THE COMPANY FROM TAKING ON MISFIT CLIENTS AND A MAGNET THAT WILL ATTRACT PERFECT-FIT CLIENTS FOR YEARS TO COME.EQUAL OPPORTUNITY EMPLOYER / DRUG-FREE WORKPLACE / BACKGROUND CHECKS REQUIREDTO APPLY:UPLOAD YOUR RESUME AND COMPLETE THE SURVEY HERE: HTTPS://GO.APPLY.CI/P/KA3SO0VTUSTSAFXI9TNSRESPONSIBILITIES:RESPOND TO INBOUND LEADS QUICKLY AND EFFECTIVELYEXECUTE OUTBOUND STRATEGY AND CONTINUOUSLY DEVELOP NEW RELATIONSHIPS WITH KEY PARTNERSMEET WITH, AND EDUCATE, QUALIFIED PROSPECTS ON OUR RESIDENTIAL MANAGEMENT SERVICESQUALIFY AND CONVERT PROSPECTS INTO CLIENTS FOR OUR SERVICECOMPLETE THE NECESSARY FORMS AND PAPERWORK TO ONBOARD NEW PROPERTIESMANAGE A ROBUST AND DYNAMIC PIPELINE WITHIN OUR CRM WITH CURRENT NOTES AND STATUSESLEARN OUR UNIQUE POLICIES AND PROCEDURES AND RELEVANT REAL ESTATE LAWSBUILD RELATIONSHIPS WITH PROSPECTS AND NURTURE THEM TO CREATE NEW PROPERTY MANAGEMENT OPPORTUNITIESTHE RIGHT CANDIDATE WILL POSSESS THE FOLLOWING COMPETENCIES:RESPONSIVEGREAT LISTENERCLEAR COMMUNICATOR (ON THE PHONE, OVER EMAIL, AND IN PERSON)CONSISTENT PERFORMANCEFAST LEARNERREAL ESTATE OR INVESTMENT EXPERIENCE IS PREFERREDA REAL ESTATE LICENSE IS REQUIRED. WE ARE WILLING TO REIMBURSE YOU FOR TUITION AND TESTING FEES.HERE ARE SOME BENEFITS OF JOINING EATON REALTY:YOU’LL BE SELLING THE BEST PRODUCT IN TOWN! WHILE THERE ARE MANY PROPERTY MANAGEMENT COMPANIES, WE HAVE INVESTED THE TIME TO DESIGN A UNIQUELY ATTRACTIVE PRODUCT THAT THE MARKET IS LOOKING FOR.THIS ROLE OFFERS A HIGH DEGREE OF AUTONOMY. THIS IS A RESULTS-DRIVEN POSITION THAT REQUIRES A SELF-DIRECTED AND COMMITTED PROFESSIONAL.YOU WILL BE OFFERED ABUNDANT TRAINING, COACHING, AND MENTORSHIP ON INDUSTRY BEST PRACTICES AND SALES SKILL DEVELOPMENT.REIMBURSEMENT FOR COMPLETED REAL ESTATE LICENSE CONTINUING EDUCATIONMONTHLY TEAM SOCIALS, QUARTERLY LUNCHEONS, AND AWARDS, PLUS OUR SUMMER PICNIC AND ANNUAL LAUNCH PARTY, ENSURE THERE’S ALWAYS FUN TO SHAREGENEROUS PAID VACATION AND PAID HOLIDAYS401(K) WITH COMPANY MATCHFAMILY ATMOSPHERE, FRIENDLY COWORKERS, AND A SUPPORTIVE STAFFOPTIONAL HEALTH BENEFITSOPPORTUNITIES FOR ADVANCEMENTQUALIFIED CANDIDATES WILL HAVE RELIABLE TRANSPORTATION AND A VALID DRIVER'S LICENSE TO ATTEND MEETINGS AND EVENTS.JOB TYPES: FULL-TIME, CONTRACTPAY: $80,000.00 - $100,000.00 PER YEARBENEFITS:401(K)PAID TIME OFFPROFESSIONAL DEVELOPMENT ASSISTANCESCHEDULE:CHOOSE YOUR OWN HOURSMONDAY TO FRIDAYWEEKENDS AS NEEDEDSUPPLEMENTAL PAY TYPES:COMMISSION PAYEXPERIENCE:BUSINESS DEVELOPMENT: 1 YEAR (PREFERRED)SALES: 1 YEAR (PREFERRED)ABILITY TO RELOCATE:LITHIA, FL 33547: RELOCATE BEFORE STARTING WORK (REQUIRED)WORK LOCATION: IN PERSON",
    "job_skill_set": [
      "real estate",
      "sales",
      "CRM management",
      "customer service",
      "business development",
      "real estate license",
      "relationship building",
      "market analysis",
      "communication",
      "responsiveness",
      "fast learning",
      "self-direction",
      "teamwork",
      "problem solving",
      "adaptability",
      "property management",
      "listening"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "crm",
      "customer",
      "development",
      "estate",
      "fast",
      "learning",
      "license",
      "listening",
      "management",
      "manager",
      "market",
      "problem",
      "property",
      "real",
      "relationship",
      "responsiveness",
      "sales",
      "selfdirection",
      "service",
      "solving",
      "teamwork"
    ]
  },
  {
    "job_id": "3901359055",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "JOB TITLE: BUSINESS DEVELOPMENT REPRESENTATIVE SALARY: $48K BASE SALARY AND OTE $120KSTART: ASAPLOCATION: DOWNTOWN MIAMI \nMUST BE IN OFFICE 5 DAYS PER WEEK \nRESPONSIBILITIES- EFFECTIVELY REPRESENT THE COMPANY THROUGH EFFICIENT AND PROFESSIONAL PARTNER INTERACTIONS THAT RESULT IN HEIGHTENED ENGAGEMENT, PRODUCTIVITY, AND PROFITABILITY.- WORK WITH EXISTING AND NEW PARTNERS TO HELP PROMOTE L PRODUCTS- ENGAGE PARTNERS ON BEST PRACTICES, HOW OUR PRODUCTS WORK, AND HOW WE CAN BEST SERVE THEM- WORK WITH INTERNAL STAKEHOLDERS TO COMPLETE LOAN APPLICATIONS- COMMUNICATE CLEARLY WITH PARTNERS, CLIENTS, AND THE UNDERWRITING TEAM TO FACILITATE A QUICK TURN TIME ON FUNDING TERM LOANS AND COMMERCIAL LINES OF CREDIT- REACH OUT TO PARTNERS AND GATHER NECESSARY DOCUMENTS TO COMPLETE LOAN APPLICATIONS- DELIVER CONSISTENT AND TIMELY RESPONSES- STRATEGIZE AND CONSULT WITH PARTNERS TO ENSURE BEST IN CLASS SERVICE LEVEL STANDARDS- UTILIZE SALESFORCE TO TRACK THE STATUS OF YOUR ACTIVITY AND LOAN PIPELINE- PROVIDE FEEDBACK ON EFFECTIVENESS OF NURTURING PARTNERS AND THEIR NEEDS\nTHE CANDIDATE PROFILE:- NO PRIOR SALES EXPERIENCE IS NECESSARY. INSTEAD, WE ARE LOOKING FOR HONEST, SELF-MOTIVATED, COMPETITIVE, HARD-WORKING, HIGH ENERGY, PRODUCTIVE, FUN-LOVING, TEAM PLAYERS. WE ARE HAPPY TO TEACH YOU THE BUSINESS IF YOU POSSESS THESE SKILLS. WE CAN TEACH THE SPECIFICS OF BUSINESS. WE CANNOT TEACH WORK ETHIC.- GOAL ORIENTATED, A TEAM PLAYER WHO THRIVES IN A COLLABORATIVE, FAST PACED WORK ENVIRONMENT- AN EFFICIENT RELATIONSHIP BUILDER WHO THRIVES ON ENGAGEMENT AND DRIVING RESULTS THROUGH PARTNERS AND OTHER SMALL BUSINESSES- STRONG ORGANIZATIONAL AND TIME MANAGEMENT SKILLS- IF YOU HAVE USED SALESFORCE IN THE PAST, GREAT! BUT IF YOU HAVEN’T, GET READY TO LEARN.",
    "job_skill_set": [
      "Salesforce",
      "Communication",
      "Teamwork",
      "Relationship building",
      "Goal-oriented",
      "Time management",
      "Self-motivation",
      "Problem solving",
      "Adaptability",
      "Loan applications",
      "Commercial lines of credit"
    ],
    "short_keywords": [
      "adaptability",
      "applications",
      "building",
      "business",
      "businessdevelopment",
      "commercial",
      "communication",
      "credit",
      "development",
      "goaloriented",
      "lines",
      "loan",
      "management",
      "of",
      "problem",
      "relationship",
      "representative",
      "salesforce",
      "selfmotivation",
      "solving",
      "teamwork",
      "time"
    ]
  },
  {
    "job_id": "3901379433",
    "job_title": "Exciting Opportunity Alert! Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ARE YOU A DYNAMIC GO-GETTER WITH A PASSION FOR CULTIVATING STRONG CLIENT RELATIONSHIPS AND DRIVING BUSINESS GROWTH? DIVERSE STAFFING, A LEADING LIGHT INDUSTRIAL STAFFING AGENCY, IS SEEKING A TALENTED BUSINESS DEVELOPMENT MANAGER TO JOIN OUR INDIANAPOLIS TEAM IN REVOLUTIONIZING THE STAFFING INDUSTRY! \nAS THE BUSINESS DEVELOPMENT MANAGER, YOU WILL SPEARHEAD OUR EXPANSION INITIATIVES, FORGE STRATEGIC PARTNERSHIPS, AND PROPEL OUR AGENCY TO NEW HEIGHTS OF SUCCESS. IF YOU THRIVE IN A FAST-PACED ENVIRONMENT, EXCEL AT IDENTIFYING MARKET OPPORTUNITIES, AND ARE READY TO MAKE A SIGNIFICANT IMPACT, THIS IS THE ROLE FOR YOU! \nJOIN US IN SHAPING THE FUTURE OF THE LIGHT INDUSTRIAL SECTOR AND TAKE YOUR CAREER TO THE NEXT LEVEL. APPLY NOW TO ONLINEAPPINTERNAL@DIVERSESTAFFING.COM AND BE PART OF A DRIVEN, SUPPORTIVE TEAM THAT VALUES YOUR SKILLS AND DEDICATION. LET'S BUILD A BRIGHTER FUTURE TOGETHER! \nWHAT YOU WILL BE DOING:DEVELOP AND IMPLEMENT STRATEGIC BUSINESS DEVELOPMENT PLANS TO DRIVE GROWTH AND EXPAND OUR CLIENT BASE.IDENTIFY, PURSUE, AND SECURE NEW BUSINESS OPPORTUNITIES WITHIN THE LIGHT INDUSTRIAL SECTOR.BUILD AND MAINTAIN STRONG RELATIONSHIPS WITH CLIENTS, UNDERSTANDING THEIR STAFFING NEEDS AND PROVIDING TAILORED SOLUTIONS.COLLABORATE WITH INTERNAL TEAMS TO ENSURE SMOOTH TRANSITIONS AND SUCCESSFUL PLACEMENTS.MONITOR MARKET TRENDS AND COMPETITOR ACTIVITIES TO STAY AHEAD IN THE INDUSTRY. \nWHAT WE NEED FROM YOU:PROVEN EXPERIENCE IN BUSINESS DEVELOPMENT WITHIN THE STAFFING OR LIGHT INDUSTRIAL SECTOR.STRONG NETWORK OF INDUSTRY CONTACTS AND THE ABILITY TO FORGE NEW RELATIONSHIPS.EXCELLENT COMMUNICATION AND NEGOTIATION SKILLS.RESULTS-ORIENTED MINDSET WITH A TRACK RECORD OF ACHIEVING SALES TARGETS.BACHELOR’S DEGREE IN BUSINESS ADMINISTRATION OR RELATED FIELD, PREFERRED. \nWHAT WE OFFER:COMPETITIVE SALARY UP TO $100,000 ANNUALLY, DEPENDING ON LEVEL OF EXPERIENCE.PERFORMANCE-BASED BONUSES AND INCENTIVES.OPPORTUNITIES FOR CAREER GROWTH AND PROFESSIONAL DEVELOPMENT.SUPPORTIVE AND COLLABORATIVE WORK ENVIRONMENT.CHANCE TO MAKE A REAL IMPACT IN THE LIGHT INDUSTRIAL STAFFING INDUSTRY.HOLIDAY PAY, PTO, AND VOLUNTEER TIME OFF. MEDICAL PLAN, DENTAL, OPTICAL, LIFE, LONG- AND SHORT-TERM DISABILITY, AND 401K.\nDIVERSE STAFFING IS AN EQUAL OPPORTUNITY EMPLOYER: ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, NATIONAL ORIGIN, SEXUAL ORIENTATION, GENDER IDENTITY, DISABILITY, PROTECTED VETERAN STATUS, OR OTHER PROTECTED STATUS. DIVERSE STAFFING IS COMMITTED TO PROVIDING JOBS FOR VETERANS TRANSITIONING INTO CIVILIAN LIFE.",
    "job_skill_set": [
      "business development",
      "strategic planning",
      "market analysis",
      "sales targets achievement",
      "client relationship management",
      "negotiation",
      "bachelor's degree in business administration",
      "communication",
      "team collaboration",
      "results-oriented mindset",
      "adaptability",
      "problem solving"
    ],
    "short_keywords": [
      "achievement",
      "adaptability",
      "administration",
      "alert",
      "analysis",
      "bachelors",
      "business",
      "businessdevelopment",
      "client",
      "collaboration",
      "communication",
      "degree",
      "development",
      "exciting",
      "in",
      "management",
      "manager",
      "market",
      "mindset",
      "negotiation",
      "opportunity",
      "planning",
      "problem",
      "relationship",
      "resultsoriented",
      "sales",
      "solving",
      "strategic",
      "targets",
      "team"
    ]
  },
  {
    "job_id": "3904363879",
    "job_title": "Business Development Manager - Power Generation",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "DESCRIPTION\n\nTHE INNIO ADVANTAGE:\n\nBY COMBINING A RICH LEGACY IN THE POWER AND GAS COMPRESSION SPACE WITH PIONEERING TECHNOLOGY, INNIO BRINGS OUR CUSTOMERS AFFORDABLE, RELIABLE AND SUSTAINABLE ENERGY SOLUTIONS FOR TODAY AND TOMORROW. WE ARE HELPING TO MEET TODAY’S ENERGY NEEDS WITH 64 GW OF INSTALLED CAPACITY AND 48,000 OF OUR POWERFUL JENBACHER AND WAUKESHA ENGINES, WHICH CAN BE FOUND IN MORE THAN 100 COUNTRIES. AND, BY HARNESSING OUR HISTORY OF ENERGY INDUSTRY FIRSTS ALONG WITH THE POWER OF DIGITAL INNOVATION, WE WILL CONTINUE TO DELIVER FOR THE FUTURE.\n\nAS AN EQUAL OPPORTUNITY EMPLOYER, INNIO OFFERS A COMPREHENSIVE ARRAY OF INTERNATIONAL CAREER OPPORTUNITIES AND UNDERSTANDS THAT DIVERSITY CREATES EXCELLENCE. KNOWN FOR LEADERSHIP DEVELOPMENT, WE AIM TO EMPOWER INDIVIDUALS TO REACH THEIR FULL POTENTIAL.\n\nPOWER GENERATION (SPECIFICALLY IN THE O&G SECTOR) IS A GROWING FOCUS FOR THE WAUKESHA BUSINESS AND OUR CUSTOMERS AS THE O&G SECTOR DECARBONIZES. THE O&G POWER GENERATION CHANNEL BUSINESS DEVELOPMENT MANAGER WILL BE RESPONSIBLE FOR HELPING GROW THE WAUKESHA POWER GENERATION BUSINESS GLOBALLY\n\nTHE ROLE WILL INCLUDE THREE KEY FUNCTIONS –\n\n BUSINESS DEVELOPMENT WHERE THE GOAL WILL BE SALES ENABLEMENT BY ID’ING, RECRUITING AND DEVELOPING GROWTH CHANNELS GLOBALLY, DEVELOPING COMMERCIAL BUSINESS MODELS RELEVANT TO THE POWER GENERATION SECTOR, COORDINATING WITH GLOBAL SALES TEAM ON EARLY STAGE DEMAND CREATION INITIATIVES TO ORIGINATE AND DEVELOP PROJECTS, ID’ING PRODUCT, COMMERCIAL GAPS AND DEVELOP GAP CLOSURE PLANS BY WORKING WITH SALES, MARKETING, PRODUCT LINE MANAGEMENT. CHANNEL MANAGEMENT WHERE THE GOAL WILL BE TO DEVELOP AND IMPLEMENT A ROBUST PROCESS TO CONTINUALLY MEASURE AND TRACK CHANNEL PARTNER PERFORMANCE TOWARDS GROWING THE POWER GENERATION BUSINESS, INCLUDING CHANNEL ORDER INTAKE PERFORMANCE. SALES, WITH A FOCUS ON PURSUING, DEVELOPING, AND CLOSING SPECIFIC NEW OPPORTUNITIES IN THE OIL FIELD POWER GENERATION SPACE.\n\nBUSINESS DEVELOPMENT \n\n IDENTIFY POTENTIAL NEW CHANNELS, RECRUIT, QUALIFY AND FACILITATE THROUGH THE APPOINTMENT PROCESS INCLUDING GAINING THE NECESSARY APPROVALS AND REGIONAL SUPPORT. DEVELOP NEW BUSINESS MODELS (INTERNAL AND VIA OUR CHANNELS), GO TO MARKET APPROACHES TO MEET POWER GENERATION USER NEEDS, INCLUDING BUT NOT LIMITED TO RENTAL OFFERINGS, SERVICES MSA’S ETC. SPOT TRENDS IN THE POWER GENERATION MARKETS TO IDENTIFY NEW GROWTH SEGMENTS AND APPLICATIONS WHERE THE WAUKESHA PRODUCT OFFERING WILL BE A GOOD FIT IDENTIFY THE COMPETITIVE LANDSCAPE, PRODUCT AND COMMERCIAL GAPS AND WORK WITH RELEVANT WAUKESHA FUNCTIONS TO DEVELOP AND EXECUTE A STRATEGIC RESPONSE/GAP CLOSURE PLANS DEVELOP AND EXECUTE VARIOUS DEMAND CREATION CAMPAIGNS ALONG WITH MARKETING/COMMS TEAMS ENGAGE WITH WIDER GLOBAL SALES TEAM AND THE CHANNEL PARTNERS TO HELP ORIGINATE AND DEVELOP PROJECTS AS PART OF OVERALL POWER GENERATION PIPELINE DEVELOPMENT INITIATIVE CULTIVATE LONG-TERM RELATIONSHIP WITH STRATEGIC PARTNERS TO SUPPORT BUSINESS GROWTH SUPPORT THE SALES TEAM ON DAY TO DAY PROJECT EXECUTION & DEAL CLOSURE ACTIVITIES\n\nCHANNEL MANAGEMENT \n\n SUPPORT SALES IN THE DEVELOPMENT OF CHANNELS AND KEY ACCOUNT PLANNING APPLY METHODOLOGY TO DRIVE AND MONITOR CHANNELS’ EFFECTIVENESS AND IMPROVEMENT INITIATIVES. FOCUS ON PROSPECTING CAPABILITY, COVERAGE WINDOW, WIN/HIT RATE, END USER SATISFACTION ETC. CREATE DEVELOPMENT OR RECOVERY PLANS FOR CHANNELS, TO IMPROVE PERFORMANCE AND EFFICIENCY SHARE STANDARDS, BEST PRACTICES AND CAPABILITIES ACROSS REGIONS IN THE INNIO NETWORK. IMPLEMENT AND EXECUTE WAUKESHA’S CHANNELS’ PROGRAMS. ACT AS AMBASSADOR TO ALL CHANNELS’ INTERMEDIARIES TO HELP EXTEND COVERAGE GLOBALLY CONNECT WITH OTHER WAUKESHA FUNCTIONS TO SOLVE (POTENTIAL) CONFLICTS BETWEEN DISTRIBUTORS, PACKAGERS AND SOLUTIONS PROVIDERS GLOBALLY MONITOR THE CHANNELS´ FINANCIAL PERFORMANCE, SCORECARDS AND ACCOUNTS RECEIVABLES MEASURE, OPTIMIZE ORDERS GROWTH, PENETRATION, TURNOVER OF CHANNELS GLOBALLY PROVIDE INPUT TO AND PRESENT TO COMPANY LEADERSHIP AT STRATEGIC BUSINESS REVIEWS\n\nSALES (SECONDARY FOCUS) \n\n PROSPECT FOR NEW SALES OPPORTUNITIES IN THE O&G SPACE, WITH A FOCUS ON UPSTREAM AND MIDSTREAM, WITH A SPECIFIC INTEREST ON NEW ACCOUNTS AND MARKET SPACES. TRACK OPPORTUNITIES IN SFDC AND ESTABLISH TEAM SALES EFFORTS (SALES MANAGERS, APPLICATION ENGINEERS, TECHNICAL SERVICES, ETC) TO ENSURE SUCCESS. PARTICIPATE IN SALES REVIEWS AND PACING CALLS\n\nINNIO OFFERS A GREAT WORK ENVIRONMENT, PROFESSIONAL DEVELOPMENT, CHALLENGING CAREERS, AND COMPETITIVE COMPENSATION. INNIO IS AN EQUAL OPPORTUNITY EMPLOYER. EMPLOYMENT DECISIONS ARE MADE WITHOUT REGARD TO RACE, COLOR, RELIGION, NATIONAL OR ETHNIC ORIGIN, GENDER (INCLUDING PREGNANCY), SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, AGE, DISABILITY, VETERAN STATUS OR ANY OTHER CHARACTERISTICS PROTECTED BY LAW.",
    "job_skill_set": [
      "business development",
      "sales enablement",
      "project management",
      "market analysis",
      "strategic planning",
      "financial performance monitoring",
      "customer relationship management",
      "data analysis",
      "communication",
      "teamwork",
      "problem solving",
      "leadership",
      "negotiation",
      "adaptability",
      "strategic thinking",
      "relationship building",
      "collaboration",
      "initiative",
      "channel management",
      "commercial business models",
      "demand creation campaigns",
      "oil and gas industry knowledge"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "and",
      "building",
      "business",
      "businessdevelopment",
      "campaigns",
      "channel",
      "collaboration",
      "commercial",
      "communication",
      "creation",
      "customer",
      "data",
      "demand",
      "development",
      "enablement",
      "financial",
      "gas",
      "generation",
      "industry",
      "initiative",
      "knowledge",
      "leadership",
      "management",
      "manager",
      "market",
      "models",
      "monitoring",
      "negotiation",
      "oil",
      "performance",
      "planning",
      "power",
      "problem",
      "project",
      "relationship",
      "sales",
      "solving",
      "strategic",
      "teamwork",
      "thinking"
    ]
  },
  {
    "job_id": "3898160234",
    "job_title": "Business Development Assistant",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "LOCATION: NYC (ON-SITE)PAY: $32-$38/HRDURATION: 6 MONTH CONTRACT + EXTENSIONS\nREQUIRED SKILLS:2+ YEARS OF SOME KIND OF PROFESSIONAL EXPERIENCEPROFICIENCY IN MS OFFICEEXPERIENCE WITH CRM MANAGEMENT SOFTWAREENTERING AND KEEPING TRACK OF DATAGREAT TIME MANAGEMENT AND COMMUNICATION SKILLSBACHELOR’S DEGREEPLUSSES: EXPERIENCE WORKING WITH EXPENSE PROGRAMS SUCH AS: CHROME RIVER, MICROSOFT SHAREPOINT, ADOBE PHOTOSHOP, ETC.EXPERIENCE WORKING WITH TRANSACTION/PRIVATE FUND PLATFORMS SUCH AS: PREGIN, PITCHBOOK, CAP IQ, ETC. EXPERIENCE WORKING AT A LAW FIRM  D2D: ASSIST WITH BASIC RESEARCH AND DATA COLLECTION FOR VARIOUS PROJECTS TO UNDERSTAND MARKET POSITION, DEVELOP STRATEGIC PLANS AND DRIVE MARKETING EFFORTS TO MAINTAIN AND GROW THE PRACTICE AND OUR INDUSTRY POSITION.MAINTAIN DATA IN THE FIRM’S CONTACT RELATIONSHIP MANAGEMENT (CRM) SYSTEM BY REVIEWING AND CREATING MAILING LISTS, RECORDING ACTIVITIES SUCH AS CLIENT MEETINGS, UPDATING CURRENT CONTACT INFORMATION AND OTHER MEANINGFUL BACK-END DATA ENTRY PROJECTS IN THE CRM AND SHAREPOINT DATABASES. HELP MAINTAIN AND UPDATE CONTENT IN OUR IFG EXPERIENCE DATABASE.PROVIDE ADMINISTRATIVE ASSISTANCE, INCLUDING BUDGETING AND EXPENSE REPORTING, AS NEEDED, TO THE INVESTMENT FUNDS BD TEAM.ASSIST IN THE PREPARATION AND MAINTENANCE OF BESPOKE MARKETING COLLATERAL AND CLIENT-FACING PRESENTATIONS/PITCH MATERIALS PRIMARILY TEAM SLIDES AND PLACEMATS, AND PARTICIPATE IN ACTIVITIES INCLUDING PROOFREADING, FORMATTING (CANDIDATE MUST HAVE EXCEPTIONAL POWERPOINT SKILLS), EDITING, PRINTING, BINDING AND DELIVERY.PROVIDE LOGISTICAL ASSISTANCE IN CONNECTION WITH THE ORIGINATION AND EXECUTION OF NEW BUSINESS PITCHES AND RELATED CLIENT DEVELOPMENT MEETINGS AND ACTIVITIES, INCLUDING SETTING UP ZOOM AND OTHER VIDEO/WEBINAR PLATFORMS AND BOOKING MEETING ROOMS.ASSIST THE CLIENT ENGAGEMENT TEAM WITH EVENT PLANNING, INCLUDING THE EXECUTION OF VIRTUAL AND IN-PERSON SEMINARS AND RECEPTIONS, INDUSTRY CONFERENCES AND CHARITABLE SPONSORSHIPS, SPEAKING ENGAGEMENTS, CLIENT ENTERTAINMENT AND OTHER EVENTS RELATED TO THE PROMOTION OF THE IFG. EXECUTE ON UPDATES TO THE IFG ATTORNEYS’ WEBSITE BIOS AND PROPOSALS/CLIENT PRESENTATIONS, INCLUDING THE FACILITATION OF AN ANNUAL WEB BIO AUDIT.ASSIST ON THE COMPILATION AND SUBMISSION OF MATERIALS AND REFERENCES FOR THE IFG IN CONNECTION WITH SURVEYS AND VARIOUS LEGAL INDUSTRY GUIDES, E.G., CHAMBERS, LEGAL 500, PEI, ETC. HANDLE OTHER REQUESTS OR PROJECTS ON AN AS-NEEDED BASIS.\nCOMPENSATION: $32/HR TO $38/HR. \nEXACT COMPENSATION MAY VARY BASED ON SEVERAL FACTORS, INCLUDING SKILLS, EXPERIENCE, AND EDUCATION.\nBENEFIT PACKAGES FOR THIS ROLE WILL START ON THE 31ST DAY OF EMPLOYMENT AND INCLUDE MEDICAL, DENTAL, AND VISION INSURANCE, AS WELL AS HSA, FSA, AND DCFSA ACCOUNT OPTIONS, AND 401K RETIREMENT ACCOUNT ACCESS WITH EMPLOYER MATCHING. EMPLOYEES IN THIS ROLE ARE ALSO ENTITLED TO PAID SICK LEAVE AND/OR OTHER PAID TIME OFF AS PROVIDED BY APPLICABLE LAW.",
    "job_skill_set": [
      "MS Office",
      "Data Entry",
      "Budgeting",
      "Expense Reporting",
      "PowerPoint",
      "Time Management",
      "Communication",
      "Teamwork",
      "Event Planning",
      "Logistical Assistance",
      "Proofreading",
      "Editing",
      "Client Engagement",
      "CRM Management Software",
      "Adobe Photoshop",
      "Chrome River",
      "Microsoft SharePoint",
      "Transaction/Private Fund Platforms",
      "Research"
    ],
    "short_keywords": [
      "adobe",
      "assistance",
      "assistant",
      "budgeting",
      "business",
      "businessdevelopment",
      "chrome",
      "client",
      "communication",
      "crm",
      "data",
      "development",
      "editing",
      "engagement",
      "entry",
      "event",
      "expense",
      "fund",
      "logistical",
      "management",
      "microsoft",
      "ms",
      "office",
      "photoshop",
      "planning",
      "platforms",
      "powerpoint",
      "proofreading",
      "reporting",
      "research",
      "river",
      "sharepoint",
      "software",
      "teamwork",
      "time",
      "transactionprivate"
    ]
  },
  {
    "job_id": "3901644228",
    "job_title": "Business Development Specialist",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "OVERVIEW\n\nROVISYS, AN INDUSTRY LEADER IN PROCESS & BUILDING AUTOMATION SOLUTIONS, IS LOOKING TO ADD TO OUR GROWING TEAM. ROVISYS IS A HOLISTIC AUTOMATION SERVICES PROVIDER, WHO PROVIDES TURNKEY AUTOMATION SYSTEMS FOR CUSTOMERS IN DOZENS OF INDUSTRIES. ROVISYS ENGINEERS ARE WELL-VERSED IN NUMEROUS CONTROL PLATFORMS AND SOFTWARE PACKAGES, AND PROVIDE END USERS AND CUSTOMERS CUSTOMIZED CUTTING-EDGE BUILDING AND FACILITY MANAGEMENT SOLUTIONS TO FIT THEIR REQUIREMENTS.\n\nROVISYS IS SEEKING A BUSINESS DEVELOPMENT SPECIALIST TO ASSIST IN OUR EXPANSION. AS A PART OF THE TEAM, THE IDEAL CANDIDATE WILL BE CAPABLE OF LOCATING AND DEFINING BUSINESS AND PARTNER RELATIONSHIPS, ANALYZING AND UTILIZING BUSINESS GO-TO MARKET STRATEGIES, EXAMINING RISKS OF BUSINESS OPPORTUNITIES, AND DEFINING CUSTOMER NEEDS AND GOALS TO INCREASE BUSINESS.\n\nRESPONSIBILITIES\n\nJOB RESPONSIBILITIES: \n\nUNDERSTANDS ROVISYS PROJECT EXECUTION METHODOLOGYSTAYS UP-TO-DATE WITH MODERN OPEN-INTEGRATION CONTROL PLATFORMSLOCATES OR PROPOSES POTENTIAL BUSINESS DEALS BY BUILDING RELATIONSHIPS WITH BUSINESS PARTNERSBUILDS BUSINESS POSITION BY LOCATING, DEVELOPING, AND DEFINING BUSINESS OPPORTUNITIESCONSISTENTLY RESEARCHES INDUSTRY AND RELATED EVENTS, PUBLICATIONS, AND ANNOUNCEMENTSDISCOVERS AND EXPLORES RELEVANT BUSINESS OPPORTUNITIES INDEPENDENTLYANALYZES POTENTIAL BUSINESS BY ANALYZING MARKET STRATEGIES, DEAL REQUIREMENTS, AND FINANCIALS.CAPABLE OF READING ENGINEERING DRAWINGS (CONTROLS, MECHANICAL, ELECTRICAL, ETC.), PREFERREDDEVELOPS NEGOTIATING STRATEGIES AND POSITIONS BY STUDYING INTEGRATION OF NEW VENTURE WITH COMPANY STRATEGIES AND OPERATIONSUNDERSTANDS NEEDS AND GOALS OF ANY PROJECT AND CUSTOMERCLOSES NEW BUSINESS DEALS BY COORDINATING REQUIREMENTS AND DELIVERING OPTIMIZED PROPOSALS AND SCOPES OF WORKENHANCES ORGANIZATION’S REPUTATION BY ACCEPTING OWNERSHIP OF SALES CYCLEEXPLORES OPPORTUNITIES TO ADD VALUE TO JOB ACCOMPLISHMENTSATTEND RELEVANT CONFERENCES, TRADE SHOWS, AND EVENTSIT IS EXPECTED THAT A NETWORK OF POTENTIAL CUSTOMERS AND PARTNERS WILL BE DEVELOPED BY THE CANDIDATE, INCLUDING, BUT NOT LIMITED TO:GENERAL CONTRACTORSCONTROLS A&E FIRMSMECHANICAL CONTRACTORSEND USERS/CUSTOMERS\n\n\nQUALIFICATIONS\n\n BUSINESS DEVELOPMENT MANAGER QUALIFICATIONS / SKILLS: ABILITY TO LEARN AND UNDERSTAND ROVISYS PROJECT DELIVERY STRATEGYABILITY TO IDENTIFY CUSTOMER NEEDS AND VET PROJECT OPPORTUNITIESENGINEERING OR AUTOMATION BACKGROUND PREFERREDABILITY TO BUILD A LOCAL NETWORK OF PARTNERS THAT CAN DRIVE REPEATABLE BUSINESSEXPERIENCE IN PLANNING AND IMPLEMENTING SALES STRATEGIES, AND CUSTOMER RELATIONSHIP MANAGEMENTEXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLSDEDICATION TO PROVIDING GREAT CUSTOMER SERVICEDESIRE TO PREPARE CONTROLS AND AUTOMATION PROJECT ESTIMATING\n\n\nEDUCATION AND EXPERIENCE REQUIREMENTS:\n\nBACHELOR’S DEGREE IN ANY ENGINEERING FIELD, PREFERRED5+ YEARS OF SALES & NETWORKING EXPERIENCE\n",
    "job_skill_set": [
      "business development",
      "financial analysis",
      "communication",
      "customer service",
      "relationship building",
      "problem solving",
      "adaptability",
      "teamwork",
      "dedication",
      "sales strategies",
      "customer relationship management",
      "engineering drawings",
      "automation",
      "market analysis",
      "negotiation",
      "project delivery strategy",
      "networking",
      "independence",
      "research",
      "ownership"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "automation",
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "customer",
      "dedication",
      "delivery",
      "development",
      "drawings",
      "engineering",
      "financial",
      "independence",
      "management",
      "market",
      "negotiation",
      "networking",
      "ownership",
      "problem",
      "project",
      "relationship",
      "research",
      "sales",
      "service",
      "solving",
      "specialist",
      "strategies",
      "strategy",
      "teamwork"
    ]
  }
]