[
  {
    "job_id": "3904722499",
    "job_title": "Information Technology Program Manager – I",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "ABOUT VANIR\n\nVANIR HAS BEEN EXCEEDING CLIENT EXPECTATIONS SINCE 1964. OUR PROGRESSIVE GROWTH AND QUALITY OF SERVICE HAS LED VANIR TO BECOME CONSISTENTLY RANKED AMONG THE TOP CONSTRUCTION MANAGEMENT FIRMS IN THE NATION BY ENGINEERING NEWS-RECORD . AS WE CONTINUE GROWING INTO NEW AREAS AND MARKETS, OUR FOCUS IS TO MAINTAIN A TEAM OF CREATIVE, AMBITIOUS, AND VISIONARY INDIVIDUALS.\n\nJOB DESCRIPTION\n\nTHE IT PROGRAM MANAGER I IS RESPONSIBLE FOR OVERSEEING ALL BUSINESS INTELLIGENCE DEVELOPMENT ACTIVITIES FOR ASSIGNED PROJECTS. IN ADDITION, THE CANDIDATE WILL DRIVE ALL ARCHITECTURAL STRATEGIES FOR BI EFFORTS AND ENSURE THESE STRATEGIES ARE BEING APPLIED TO SOLUTIONS BUILT. THE IT PROGRAM MANAGER I MAY BE REQUIRED TO ACT AS TECHNICAL LEAD ON BI-CENTRIC PROJECTS. ADDITIONALLY, IT WILL BE NECESSARY FOR THIS POSITION TO PARTICIPATE IN DEVELOPMENT AS WELL AS ARCHITECTURE AND DESIGN. HE/SHE IS EXPECTED TO HAVE DEEP KNOWLEDGE OF THE MICROSOFT BI STACK (SSIS, SQL SERVER, SSAS, SSRS, PERFORMANCEPOINT, EXCEL SERVICES, AND SHAREPOINT, POWERBI) AND MAY WORK WITH ONE OR A RANGE OF THESE TOOLS DEPENDING ON PROJECT DELIVERABLES AND TEAM RESOURCING. THE IT PROGRAM MANAGER I MUST HAVE EXPERT LEVEL SKILLS IN DATA WAREHOUSING AND BI ARCHITECTURE SUCH AS THE ETL PROCESS, DIMENSIONAL MODELING, OLAP, AND DASHBOARDS. CANDIDATES MUST BE INTERESTED IN WORKING IN A COLLABORATIVE ENVIRONMENT AND POSSESS GOOD CLIENT INTERFACING SKILLS, GOOD COMMUNICATION SKILLS AND ABLE TO WORK IN BOTH A TEAM ENVIRONMENT AS WELL AS INDIVIDUALLY. RESPONSIBILITIES RANGE FROM ARCHITECTING, DESIGNING AND PLANNING BUSINESS\n\nESSENTIAL DUTES & RESPONSIBILITIES\n\n TRANSLATES BUSINESS REQUIREMENTS INTO A FULL END-TO-END BUSINESS INTELLIGENCE SOLUTION.  ARCHITECTS ALL BI SOLUTIONS FOR ASSIGNED PROJECTS.  CREATES (ENSURES CREATION OF) ALL SOLUTION DOCUMENTATION.  ACHIEVES AND MAINTAINS RELEVANT TECHNICAL COMPETENCIES AND HELPS TO FOSTER AN ENVIRONMENT OF CONTINUED GROWTH AND LEARNING AMONG COLLEAGUES ON EXISTING AND EMERGING TECHNOLOGIES.  EFFECTIVELY PRIORITIZES RESPONSIBILITIES AND COMMUNICATES STATUS OF EFFORTS TO THE PROJECT TEAM.  OTHER DUTIES AS ASSIGNED.  POSSESS STRONG BUSINESS ACUMEN AND CONSISTENTLY DEMONSTRATES FORWARD THINKING.  IS ABLE TO EFFECTIVELY WORK WITH AMBIGUOUS OR INCOMPLETE INFORMATION.  MUST HAVE A WORKING KNOWLEDGE AND UNDERSTANDING OF ARCHITECTURAL FRAMEWORKS AND BEST PRACTICES.  MUST HAVE A STRONG WORKING KNOWLEDGE OF TECHNICAL INFRASTRUCTURE, PROTOCOLS AND NETWORKS.  MUST HAVE EXPERIENCE ON MULTIPLE HARDWARE AND SOFTWARE ENVIRONMENTS AND BE COMFORTABLE IN HETEROGENEOUS SYSTEMS.  MUST POSSESS A DEEP WORKING KNOWLEDGE OF MULTIPLE PLATFORMS, OPERATING SYSTEMS, DATABASES TECHNOLOGY.  EXCELLENT ORGANIZATIONAL, COMMUNICATION AND INTERPERSONAL SKILLS ARE REQUIRED.  MUST BE ABLE TO ROUTINELY WORK WITH LITTLE OR NO SUPERVISION.  MUST BE ABLE TO EFFECTIVELY AND EFFICIENTLY HANDLE MULTIPLE AND SHIFTING PRIORITIES.  MUST REMAIN CALM WHILE WORKING IN A HIGH-PRESSURE ENVIRONMENT WITH MANY SHORT DEADLINES. \n\nMINIMUM QUALIFICATIONS 5 YEARS OF EXPERIENCE IN MANAGEMENT OF MULTIPLE IT PROJECTS \n\n A BACHELOR'S DEGREE IN COMPUTER SCIENCE OR RELATED FIELD IS REQUIRED. A HIGH SCHOOL DIPLOMA, GED AND/OR EQUIVALENT COMBINATION OF EDUCATION AND WORK EXPERIENCE MAY BE SUBSTITUTED.  A MINIMUM OF 10 YEARS RELEVANT EXPERIENCE WITH RELATIONAL AND MULTIDIMENSIONAL DATABASE DESIGN, IMPLEMENTATION, STRONG T-SQL AND KNOWLEDGE OF MDX.  PROFICIENT IN POWER BI.  EXPERIENCE WITH REPORTING SYSTEMS AND DATA WAREHOUSE REQUIREMENTS GATHERING, ANALYSIS AND DESIGN OF ETL PROCESSES USING SQL SERVER INTEGRATION SERVICES (SSIS).  EXPERT KNOWLEDGE OF DATA WAREHOUSING AND BUSINESS INTELLIGENCE DESIGN PRINCIPLES.  STRONG KNOWLEDGE OF BI TOOLS, INCLUDING THE MICROSOFT BI STACK SSIS, SSAS, AND SSRS.  EXPERIENCE WITH DELIVERING OLAP DATA TO END USERS THROUGH EXCEL OR OTHER ANALYTICS PRODUCTS.  KNOWLEDGE TRIMBLE PMIS SYSTEMS  KNOWLEDGE OF UII SYSTEM \n\nOFFERED RATE OF COMPENSATION WILL BE BASED ON A VARIETY OF NON-DISCRIMINATORY FACTORS, INCLUDING EDUCATION, QUALIFICATIONS, EXPERIENCE, AND GEOGRAPHIC LOCATION. THE SALARY RANGE FOR THIS POSITION IS $115,500.00-.$149,500.00.\n\nBENEFITS\n\nVANIR OFFERS A COMPREHENSIVE, COMPETITIVE BENEFITS PACKAGE THAT INCLUDES 401(K) SAVINGS WITH EMPLOYER MATCHING CONTRIBUTIONS, MEDICAL, DENTAL, VISION, HEALTH SAVINGS ACCOUNT (HSA) WITH EMPLOYER CONTRIBUTIONS, LIFE, AD&D AND DISABILITY BENEFITS, FLEXIBLE SPENDING ACCOUNT (FSA), VOLUNTARY BENEFITS, TELADOC, PET INSURANCE, PAID TIME OFF, NATIONAL EMPLOYEE ASSISTANCE PROGRAM (EAP) AND EMPLOYEE REFERRAL PROGRAM.\n\nHOW TO APPLY\n\nIF YOU'RE INTERESTED IN WORKING FOR VANIR PLEASE VISIT OUR WEBSITE TO LEARN MORE AND TO APPLY ONLINE AT WWW.VANIR.COM .\n\nVEVRAA FEDERAL CONTRACTOR\n\nREQUEST PRIORITY PROTECTED VETERAN REFERRALS\n\nEOE MINORITIES/FEMALES/PROTECTED VETERANS/DISABLED\n\nCONTACT EMAIL CAREERS@VANIR.COM\n\nPERSONS WITH MEDICAL LIMITATIONS MAY, WITH REASONABLE ACCOMMODATIONS, BE CAPABLE OF PERFORMING THE DUTIES OF THIS POSITION. SUCH A DETERMINATION MUST BE MADE ON AN INDIVIDUAL BASIS CONSIDERING THE PERSON'S LIMITATIONS, THE REQUIREMENTS OF THE POSITION, AND THE COMPANY'S ABILITY TO MAKE REASONABLE ACCOMMODATIONS TO THE PERSON'S LIMITATIONS.\n\nWE PARTICIPATE IN E-VERIFY\n\nPURSUANT TO THE BAN THE BOX ACT/FAIR CHANCE INITIATIVE, WE WILL CONSIDER FOR EMPLOYMENT QUALIFIED APPLICANTS WITH ARREST AND CONVICTION RECORDS.\n\n",
    "job_skill_set": [
      "Communication",
      "Teamwork",
      "Client Interfacing",
      "Organizational Skills",
      "Problem Solving",
      "Adaptability",
      "Time Management",
      "Interpersonal Skills",
      "Collaboration",
      "Critical Thinking",
      "Independence",
      "Microsoft BI Stack",
      "Data Warehousing",
      "ETL Process",
      "SQL Server",
      "T-SQL",
      "Power BI",
      "SSIS",
      "SSAS",
      "SSRS",
      "OLAP",
      "Dimensional Modeling",
      "Dashboards",
      "Relational Database Design",
      "MDX",
      "Technical Infrastructure",
      "Architectural Frameworks",
      "Reporting Systems",
      "Heterogeneous Systems",
      "Database Technology",
      "Excel Services",
      "SharePoint",
      "PerformancePoint",
      "Trimble PMIS Systems",
      "UII System",
      "Leadership",
      "Stress Management",
      "Forward Thinking"
    ],
    "short_keywords": [
      "adaptability",
      "architectural",
      "bi",
      "client",
      "collaboration",
      "communication",
      "critical",
      "dashboards",
      "data",
      "database",
      "design",
      "dimensional",
      "etl",
      "excel",
      "forward",
      "frameworks",
      "heterogeneous",
      "i",
      "independence",
      "information",
      "informationtechnology",
      "infrastructure",
      "interfacing",
      "interpersonal",
      "leadership",
      "management",
      "manager",
      "mdx",
      "microsoft",
      "modeling",
      "olap",
      "organizational",
      "performancepoint",
      "pmis",
      "power",
      "problem",
      "process",
      "program",
      "relational",
      "reporting",
      "server",
      "services",
      "sharepoint",
      "skills",
      "solving",
      "sql",
      "ssas",
      "ssis",
      "ssrs",
      "stack",
      "stress",
      "system",
      "systems",
      "teamwork",
      "technical",
      "technology",
      "thinking",
      "time",
      "trimble",
      "tsql",
      "uii",
      "warehousing"
    ]
  },
  {
    "job_id": "3891285058",
    "job_title": "Information Technology Support Analyst",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOB TITLE: IT SUPPORT ANALYSTLOCATION: BETWEEN CARROLLTON, TX AND UPTOWN DALLAS (100% ONSITE)DURATION: 3-4 MONTH CONTRACT\nCOMPANY OVERVIEW: OUR CLIENT IS A LEADING SOFTWARE SOLUTIONS PROVIDER, SPECIALIZING IN DELIVERING CUTTING-EDGE CLOUD-BASED SOFTWARE-AS-A-SERVICE (SAAS) APPLICATIONS TO CLIENTS WORLDWIDE. WITH A COMMITMENT TO INNOVATION, THEIR SOLUTIONS EMPOWER BUSINESSES TO STREAMLINE OPERATIONS AND FOSTER GROWTH. AS THE COMPANY CONTINUES TO EXPAND ITS OFFERINGS AND GLOBAL FOOTPRINT, THEY ARE ACTIVELY SEEKING A SKILLED AND EXPERIENCED IT SUPPORT ANALYST TO JOIN THEIR DYNAMIC TEAM.\nRESPONSIBILITIES: AS AN IT SUPPORT ANALYST, YOU WILL PLAY A CRUCIAL ROLE IN ENSURING THE SEAMLESS FUNCTIONING OF OUR CLIENTS' TECHNOLOGY INFRASTRUCTURE. YOUR RESPONSIBILITIES WILL INCLUDE:PROACTIVE TECHNICAL SUPPORT: PROVIDE HIGH-LEVEL TECHNICAL SUPPORT TO C-LEVEL EXECUTIVES AND SENIOR MANAGEMENT, ADDRESSING ISSUES PROMPTLY AND EFFECTIVELY.SYSTEM MONITORING AND MAINTENANCE: UTILIZE TOOLS SUCH AS MICROSOFT INTUNE TO MONITOR AND MAINTAIN THE HEALTH OF IT SYSTEMS, PROACTIVELY IDENTIFYING AND RESOLVING POTENTIAL ISSUES BEFORE THEY IMPACT OPERATIONS.TROUBLESHOOTING AND ISSUE RESOLUTION: DIAGNOSE AND RESOLVE HARDWARE, SOFTWARE, AND NETWORK-RELATED ISSUES, ENSURING MINIMAL DOWNTIME FOR EXECUTIVES. LEVERAGE OFFICE 365 ADMINISTRATION FOR EFFICIENT PROBLEM RESOLUTION.COMMUNICATION AND COLLABORATION: WORK CLOSELY WITH OTHER IT TEAMS, UTILIZING JIRA AS THE PRIMARY TICKETING SYSTEM, TO ESCALATE AND RESOLVE COMPLEX TECHNICAL ISSUES. COMMUNICATE EFFECTIVELY WITH EXECUTIVES TO PROVIDE UPDATES AND RESOLUTIONS.SECURITY MANAGEMENT: IMPLEMENT AND MAINTAIN SECURITY PROTOCOLS, UTILIZING TOOLS LIKE MICROSOFT INTUNE, TO SAFEGUARD EXECUTIVE-LEVEL DATA AND CONFIDENTIAL INFORMATION.USER TRAINING AND GUIDANCE: PROVIDE TRAINING AND GUIDANCE TO EXECUTIVES ON TECHNOLOGY TOOLS AND BEST PRACTICES, ENSURING OPTIMAL UTILIZATION OF AVAILABLE RESOURCES.DOCUMENTATION: MAINTAIN ACCURATE DOCUMENTATION OF ISSUES, SOLUTIONS, AND CONFIGURATIONS AND OTHER DOCUMENTATION TOOLS TO FACILITATE FUTURE TROUBLESHOOTING AND KNOWLEDGE TRANSFER.\nQUALIFICATIONS:BACHELOR'S DEGREE IN INFORMATION TECHNOLOGY, COMPUTER SCIENCE, OR RELATED FIELD PREFERRED.PROVEN EXPERIENCE IN EXECUTIVE-LEVEL TECHNICAL SUPPORT AND HELP DESK OPERATIONS.EXCELLENT TROUBLESHOOTING AND PROBLEM-SOLVING SKILLS.EXCEPTIONAL COMMUNICATION AND INTERPERSONAL SKILLS.ABILITY TO WORK INDEPENDENTLY AND COLLABORATIVELY IN A FAST-PACED ENVIRONMENT.SECURITY CERTIFICATIONS (E.G., CISSP, COMPTIA SECURITY+) ARE A PLUS.",
    "job_skill_set": [
      "Office 365 Administration",
      "Troubleshooting",
      "Security Protocols",
      "Technical Support",
      "Cloud-Based Software",
      "Communication",
      "Collaboration",
      "Problem Solving",
      "Interpersonal Skills",
      "Independence",
      "Microsoft Intune",
      "JIRA",
      "Documentation Tools",
      "User Training"
    ],
    "short_keywords": [
      "365",
      "administration",
      "analyst",
      "cloudbased",
      "collaboration",
      "communication",
      "documentation",
      "independence",
      "information",
      "informationtechnology",
      "interpersonal",
      "intune",
      "jira",
      "microsoft",
      "office",
      "problem",
      "protocols",
      "security",
      "skills",
      "software",
      "solving",
      "support",
      "technical",
      "technology",
      "tools",
      "training",
      "troubleshooting",
      "user"
    ]
  },
  {
    "job_id": "3902869241",
    "job_title": "Information Technology System Administrator",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "LHH RECRUITMENT SOLUTIONS IS LOOKING FOR A IT SYSTEM ADMINISTRATOR FOR A NON PROFIT. \nTHIS IS A ON-SITE 5 DAYS A WEEK DIRECT HIRE/W2 POSITION IN LOS ANGELES COUNTY. \nRESPONSIBILITIES\nAS THE IT SYSTEM ADMINISTRATOR, YOU WILL PLAY A KEY ROLE IN OVERSEEING THE TECHNICAL INFRASTRUCTURE IMPLEMENTATION AND UPGRADES. INVOLVES MANAGING AND RESOLVING DAILY SYSTEM AND DESKTOP ISSUES FOR OUR RAPIDLY EXPANDING USER BASE OF 70 EMPLOYEES. YOU WILL ALSO BE RESPONSIBLE FOR THE OVERALL TECHNICAL INFRASTRUCTURE, COVERING DESKTOPS, NETWORKING, PRINTERS, PHONES, AND OTHER EQUIPMENT. ADDITIONAL RESPONSIBILITIES INCLUDE PROCURING AND DEPLOYING COMPUTING EQUIPMENT, ACTIVE DIRECTORY USER MANAGEMENT, MICROSOFT 365 LICENSE MANAGEMENT, AND IMPLEMENTING EFFICIENT ONBOARDING AND TERMINATION PROCESSES. YOUR ROLE EXTENDS TO INVENTORY MANAGEMENT OF HARDWARE AND SOFTWARE ASSETS, AS WELL AS OVERSEEING THE ENTERPRISE SECURITY FRAMEWORK AND DISASTER RECOVERY PLANNING.\nREQUIREMENTS: \nBACHELOR’S DEGREE OR EQUIVALENT TRAINING AND WORK EXPERIENCE3+SYSTEMS ADMINISTRATION OR IT SUPPORT OR NETWORKING EXPERIENCE3+ YEARS OF STRONG WINDOWS ADMINISTRATION3+ YEARS OF ACTIVE DIRECTORY MANAGEMENT3+ YEARS OF EXPERIENCE WITH HARDWARE SUPPORT3+ YEARS OF MANAGING MICROSOFT 365, WITH A FOCUS ON EXCHANGE, TEAMS, AND ONEDRIVE.3+ YEARS OF NETWORK ADMINISTRATION, COVERING BOTH ON-PREMISES. .NICE TO HAVE: MACOSX SUPPORT (DESIRED) AND LINUX (A PLUS).NICE TO HAVE: PREVIOUS EXPERIENCE IN NON PROFIT SECTOR WOULD BE GREAT!\nEXPECTED SALARY RANGE IS: 30 -36/HR STANDARD MEDICAL, DENTAL, AND VISION COVERAGE FOR EMPLOYEE",
    "job_skill_set": [
      "Windows Administration",
      "Active Directory Management",
      "Network Administration",
      "Hardware Support",
      "Disaster Recovery Planning",
      "Technical Infrastructure Management",
      "Problem Solving",
      "Communication",
      "Teamwork",
      "Adaptability",
      "Time Management",
      "Microsoft 365 Management",
      "Inventory Management",
      "Onboarding Processes",
      "Linux Support",
      "MacOS Support"
    ],
    "short_keywords": [
      "365",
      "active",
      "adaptability",
      "administration",
      "administrator",
      "communication",
      "directory",
      "disaster",
      "hardware",
      "information",
      "informationtechnology",
      "infrastructure",
      "inventory",
      "linux",
      "macos",
      "management",
      "microsoft",
      "network",
      "onboarding",
      "planning",
      "problem",
      "processes",
      "recovery",
      "solving",
      "support",
      "system",
      "teamwork",
      "technical",
      "technology",
      "time",
      "windows"
    ]
  },
  {
    "job_id": "3895200298",
    "job_title": "Information Technology Business Analyst",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "NO CORP-CORP; NO 3RD PARTY EMPLOYERS; NO CPT/OPT\nTECHNICAL BUSINESS ANALYST12+ MONTHS - $60-$65/HRLOCATION: CHARLOTTE, NC (HYBRID)\nDESCRIPTIONWE ARE SEEKING A SENIOR BUSINESS ANALYST (SBA) TO BE ENGAGED IN THE BUILDOUT AND IMPLEMENTATION OF A COMMERCIAL AND FINANCIAL SYSTEM. THIS ROLE WILL HAVE KEY RESPONSIBILITIES IN THE DATA INTEGRATION FROM THE LEGACY SYSTEMS TO THE NEW SYSTEMS. POST IMPLEMENTATION THIS ROLE WILL SUPPORT, MAINTAIN, AND ENHANCE THE APPLICATIONS WORKING WITH THE BUSINESS AND IT. THE SBA WOULD BE RESPONSIBLE FOR DAY-TO-DAY SUPPORT/ANSWERING QUESTIONS RELATED TO FINANCIAL APPLICATIONS ALONG WITH DOCUMENTING REQUIREMENTS, CONFIGURING, TESTING, AND DEPLOYING BUG FIXES OR ENHANCEMENTS.\nRESPONSIBILITIES INCLUDE: ENGAGED IN THE BUILDOUT AND IMPLEMENTATION OF THE FINANCIAL SYSTEMS. THIS ROLE WILL HAVE KEY RESPONSIBILITIES IN THE DATA INTEGRATION FROM THE LEGACY COMMERCIAL AND FINANCIAL SYSTEMS TO THE NEW SYSTEMS. WORK WITH AND SUPPORT/MAINTAIN AN ERP, FINANCIAL CONSOLIDATION AND REPORTING APPLICATIONS INCLUDING BUT NOT LIMITED TO APPLICATION CONFIGURATION, TROUBLESHOOTING OF COMPLEX INCIDENTS AND DEVELOPMENT OF NEW FEATURES. DEVELOP HANDS ON KNOWLEDGE OF THE ERP, FINANCIAL CONSOLIDATION, AND REPORTING APPLICATIONS TO INVESTIGATE ISSUES, IDENTIFY ROOT CAUSES, RECOMMEND, AND DRIVE RESOLUTIONS.ABLE TO DEMONSTRATE A STRONG FINANCE BACKGROUND AND PROFICIENCY IN THE DEVELOPMENT, INTEGRATION, AND SUPPORT OF CORE FINANCE SYSTEMS AND REPORTING SERVICES. PROVIDE DAILY SUPPORT TO STAKEHOLDERS ON NEW REQUESTS OR INCIDENTS RELATED TO THE FINANCIAL APPLICATIONS.PROACTIVELY COMMUNICATE AND COLLABORATE WITH BUSINESS SYSTEM OWNERS AND END USERS TO ANALYZE INFORMATION NEEDS AND FUNCTIONAL REQUIREMENTS.PERFORM AND REVIEW SYSTEM CONFIGURATIONS TO ENSURE THE CONFIGURATION OF THE FUNCTIONAL MODULES ALIGN WITH THE DESIGNED BUSINESS PROCESSES AND PERFORM UPDATES AS REQUIRED. ACT AS THE LIAISON BETWEEN FINANCE, OPERATIONAL BUSINESS UNITS, TECHNOLOGY TEAMS AND VENDORS.PROACTIVELY IDENTIFY AREAS FOR IMPROVEMENT REGARDING THE FINANCIAL APPLICATIONS AND EXISTING OR NEW BUSINESS PROCESSES.FACILITATE THE COLLECTION OF BUSINESS REQUIREMENTS, UNDERSTAND, ANALYZE AND TRANSLATE THEM INTO SYSTEM REQUIREMENTS, CONFIGURATIONS AND CUSTOMIZATIONS.\nCOMPETENCIESSTRONG KNOWLEDGE OF CORE ERP ENABLED BUSINESS CYCLES, SPECIFICALLY RELATED TO ACCOUNTING FUNCTIONPROVEN BACKGROUND IN THE DEVELOPMENT AND SUPPORT OF ETL’S AND REPORTING SERVICES ALONG WITH DEEP EXPERIENCE WORK WITH DATA AND FINANCIAL APPLICATION INTEGRATIONS.CAPABLE OF WORKING IN A FAST-PACED ENVIRONMENT WITH TIGHT DEADLINES; ABLE TO WORK EFFECTIVELY IN AMBIGUOUS OR CHANGING SITUATIONS; ABILITY TO MANAGE TIME EFFECTIVELY.STRONG ANALYTICAL SKILLS, INCLUDING A THOROUGH UNDERSTANDING OF HOW TO INTERPRET CUSTOMER BUSINESS NEEDS AND TRANSLATE THEM INTO APPLICATION AND OPERATIONAL REQUIREMENTS.ABILITY TO IDENTIFY PROBLEMS AND DEAL WITH SITUATIONS AND ISSUES PROACTIVELY.DEMONSTRATE A CRITICAL AND CREATIVE MINDSET WITH ALL NEW REQUESTS RECEIVED FROM STAKEHOLDERS. EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS AND THE ABILITY TO INTERACT PROFESSIONALLY AND AFFECTIVELY WITH EXECUTIVES, MANAGERS, AND SUBJECT MATTER EXPERTS.STRONG ATTENTION TO DETAIL WITH THE ABILITY TO WORK IN A CONSCIENTIOUS, CONSISTENT, AND THOROUGH MANNER.ADVANCED KNOWLEDGE OF MICROSOFT OFFICE SUITE, SPECIFICALLY EXCEL.FUNCTIONAL EXPERIENCE WITH IFS, SAP CONCUR, AND ONESTREAM WOULD BE CONSIDERED AN ASSET.\nQUALIFICATIONS5 YEARS OF PROFESSIONAL EXPERIENCE IN TRANSLATING TECH FOR NON-TECH STAKEHOLDERSCLOUD FUNCTIONALITYFINANCE, ACCOUNTING, OR RELATED DEGREE WOULD BE CONSIDERED A STRONG ASSET.COMPUTER SCIENCE EXPERIENCE WITH FORMAL TRAINING IN THE AREAS OF ERP SYSTEMS WOULD BE CONSIDERED AN ASSET.EXPERIENCE INTEGRATING FINANCIAL DATA INTO A REPORTING DATA MART AND DEVELOPING FINANCIAL REPORTING IS CONSIDERED AN ASSET.",
    "job_skill_set": [
      "Microsoft Excel",
      "Analytical Skills",
      "Communication",
      "Problem Solving",
      "Attention to Detail",
      "Collaboration",
      "Adaptability",
      "Critical Thinking",
      "Customer Focus",
      "ERP Systems",
      "Data Integration",
      "Financial Applications",
      "ETL Development",
      "Reporting Services",
      "Cloud Functionality",
      "IFS",
      "SAP Concur",
      "Onestream",
      "Time Management"
    ],
    "short_keywords": [
      "adaptability",
      "analyst",
      "analytical",
      "applications",
      "attention",
      "business",
      "cloud",
      "collaboration",
      "communication",
      "concur",
      "critical",
      "customer",
      "data",
      "detail",
      "development",
      "erp",
      "etl",
      "excel",
      "financial",
      "focus",
      "functionality",
      "ifs",
      "information",
      "informationtechnology",
      "integration",
      "management",
      "microsoft",
      "onestream",
      "problem",
      "reporting",
      "sap",
      "services",
      "skills",
      "solving",
      "systems",
      "technology",
      "thinking",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3899521894",
    "job_title": "Information Technology Help Desk",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "REQUISITION TITLE: IT HELP DESKDESCRIPTION: EXPERIENCE LEVEL: ENTRY LEVEL (1-2 YEARS EXPERIENCE PREFERRED)WORK SCHEDULE: MON-FRI 8AM-4PM\nTOP (3) REQUIRED SKILLSETS:• HARDWARE/SOFTWARE TROUBLESHOOTING SKILLS• CUSTOMER SERVICE• COMMUNICATION/TEAMWORKNICE TO HAVE SKILLSETS (OPTIONAL):• COMPUTER DEPLOYMENT EXPERIENCE (SCCM/AUTOPILOT)• MICROSOFT OFFICE TROUBLESHOOTING• ACTIVE DIRECTORY",
    "job_skill_set": [
      "hardware/software troubleshooting",
      "computer deployment (SCCM/Autopilot)",
      "Microsoft Office troubleshooting",
      "customer service",
      "communication",
      "teamwork",
      "Active Directory"
    ],
    "short_keywords": [
      "active",
      "communication",
      "computer",
      "customer",
      "deployment",
      "desk",
      "directory",
      "hardwaresoftware",
      "help",
      "information",
      "informationtechnology",
      "microsoft",
      "office",
      "sccmautopilot",
      "service",
      "teamwork",
      "technology",
      "troubleshooting"
    ]
  },
  {
    "job_id": "3901940098",
    "job_title": "Senior Information Technology Security Analyst",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOB PURPOSE\nMONITOR AND RESPOND TO SECURITY EVENTS FROM MANAGED SECURITY SYSTEMS. CHAMPION PROCESSES AND TECHNOLOGY AS A SUBJECT MATTER EXPERT IN VARIOUS AREAS OF INFORMATION SECURITY AND TO DEMONSTRATE THIS ABILITY AT A SENIOR LEVEL. THE POSITION WORKS CLOSELY WITH TEAMS IN OTHER INFORMATION TECHNOLOGY AND OPERATIONAL DISCIPLINES TO PROVIDE SUPERIOR PROTECTION TO RED ROOF ASSETS. \nDUTIES AND RESPONSIBILITIES\nTHE IT SECURITY ANALYST IS RESPONSIBLE FOR THE DAY-TO-DAY INFORMATION SECURITY OPERATIONS FOR RED ROOF. INFORMATION SECURITY ANALYST WILL RESPOND TO NETWORK SECURITY EVENTS. THE ROLE IS EXPECTED TO PERFORM EVENT CORRELATION, ATTACK LIFECYCLE ANALYSIS, DEVELOP REMEDIATION PLANS, IMPLEMENT PROACTIVE AND REACTIVE COUNTERMEASURES, AND CREATE INNOVATIVE SOLUTIONS TO SECURITY ISSUES THAT FACE THE ORGANIZATION. THE POSITION WILL COMPLETE TECHNICAL SECURITY DOCUMENTATION/CLIENT QUESTIONNAIRES AND IT AUDIT, AS WELL AS SUPPORTING THE VENDOR IT RISK ASSESSMENT PROGRAM, DESIGNING FLEXIBLE AND REALISTIC SOLUTIONS TO SECURITY EXPOSURES WHILE BALANCING THE RED ROOF ORGANIZATIONAL NEEDS. \n• LEVERAGE SECURITY DATA FROM INTERNAL SOURCES (IDS, ROUTERS, SIMS, FIREWALLS, HOSTS) AND EXTERNAL SOURCES (INDUSTRY PORTALS, THREAT INTEL FEEDS, ETC..) TO IDENTIFY HIGH PRIORITY ALERTS AND DEVELOP/IMPLEMENT PROACTIVE MITIGATIONS.• REVIEW SECURITY INCIDENTS; DETERMINE THEIR SEVERITY AND IMPACT.• FORENSIC ANALYSIS; ANALYSIS OF COMPROMISED MACHINES AND ANALYSIS OF NETWORK TRAFFIC AND LOG DATA.• IMPLEMENT AND MAINTAIN INFORMATION RESOURCES SECURITY; RECOMMEND ENHANCEMENTS TO SECURITY PROCESS, PROCEDURES, AND POLICIES.• PARTICIPATE IN SECURITY INCIDENT MANAGEMENT AND VULNERABILITY MANAGEMENT PROCESSES.• PARTICIPATE IN EVALUATING, RECOMMENDING, IMPLEMENTING, AND TROUBLESHOOTING SECURITY SOLUTIONS AND EVALUATING IT SECURITY OF INFRASTRUCTURE SYSTEMS.• PARTICIPATE AND FACILITATE AUDITS OF PROCESSES RELATED TO INFORMATION SECURITY. • WORKS AS PART OF A TEAM TO ENSURE THAT CORPORATE DATA AND TECHNOLOGY PLATFORM COMPONENTS ARE SAFEGUARDED FROM KNOWN THREATS.• COMMUNICATE EFFECTIVELY WITH CUSTOMERS, TEAMMATES, AND MANAGEMENT.• PROVIDE INPUT ON TUNING AND OPTIMIZATION OF SECURITY SYSTEMS.• DOCUMENT AND MAINTAIN BUILD DOCUMENTS, SECURITY PROCEDURES AND PROCESSES.• STAYING UP TO DATE WITH EMERGING SECURITY THREATS INCLUDING APPLICABLE REGULATORY SECURITY REQUIREMENTS.• OTHER RESPONSIBILITIES AND ADDITIONAL DUTIES AS ASSIGNED BY THE MANAGEMENT TEAM.\nQUALIFICATIONS\n• 1-3 YEAR OF INFORMATION SECURITY SERVICES OR SECURITY ANALYSIS, DEPLOYMENT, AND SUPPORT.• ASSOCIATE DEGREE IN COMPUTER SCIENCES, INFORMATION SECURITY, INFORMATION SYSTEMS, ENGINEERING, SCIENCES, OR RELATED FIELD.• GOOD KNOWLEDGE OF IT INCLUDING MULTIPLE OPERATING SYSTEMS AND SYSTEM ADMINISTRATION SKILLS (WINDOWS, LINUX)• BASIC KNOWLEDGE OF CLIENT-SERVER APPLICATIONS, MULTI-TIER WEB APPLICATIONS, RELATIONAL DATABASES, FIREWALLS, VPNS, AND ENTERPRISE ANTI-VIRUS PRODUCTS.• UNDERSTANDING OF SECURITY INCIDENT MANAGEMENT, MALWARE MANAGEMENT AND VULNERABILITY MANAGEMENT PROCESSES.• BASIC KNOWLEDGE OF PCI REQUIREMENTS AND OTHER SECURITY STANDARDS.• BASIC KNOWLEDGE USING MICROSOFT 365 AND AZURE SECURITY TOOLS, INCLUDING MICROSOFT DEFENDER SUITE DESIRED BUT NOT REQUIRED.• SECURITY MONITORING EXPERIENCE.• EXCELLENT ANALYTICAL ABILITIES, INCLUDING PROCESS ANALYSIS AND DEVELOPMENT, PROBLEM SOLVING AND ROOT CAUSE ANALYSIS. • ABILITY TO INTERPRET LOG DATA AND DRAW ANALYTICAL CONCLUSIONS.• ENTRY LEVEL EXPERIENCE WITH COMPUTER PROGRAMMING AND SCRIPTING LANGUAGES.• EXPERIENCE WITH OPEN-SOURCE SECURITY ANALYSIS TOOLS, WIRESHARK, SNORT, SIFT, ETC.• EXPERIENCE WITH WEB CONTENT FILTERING TECHNOLOGY – POLICY ENGINEERING AND TROUBLESHOOTING.• UNDERSTANDING OF NETWORKING PRINCIPLES INCLUDING TCP/IP, WANS, LANS, AND COMMONLY USED INTERNET PROTOCOLS SUCH AS SMTP, HTTPS, SFTP, LDAP, ETC.• STRONG ORGANIZATION, ATTENTION TO DETAIL, PROVEN TRACK RECORD IN MANAGING MULTIPLE INITIATIVES. • STRONG CONFIDENTIALITY ASSESSMENT AND ETHIC. • STRONG TEAM AND COMMUNICATION SKILLS; COLLABORATION, NEGOTIATION, WRITTEN AND IN-PERSON INTERACTION, PRESENTATION TO SMALL OR LARGE GROUP, PEOPLE MANAGEMENT AND CONFLICT RESOLUTION ABILITY. • ON CALL/AFTER-HOURS AVAILABILITY TO RESPOND TO SECURITY SITUATIONS AS REQUIRED BY MANAGEMENT.• TECHNOLOGY CERTIFICATIONS (OR WORKING TOWARD) DESIRED BUT NOT REQUIRED (CISSP OR CISA)• OTHER RESPONSIBILITIES AND ADDITIONAL DUTIES AS ASSIGNED BY THE MANAGEMENT TEAM. \nWORKING CONDITIONS\nTHIS JOB IS A HOME-BASED POSITION THAT MAY INCLUDE SOME ONSITE DUTIES AND/OR TRAVEL.",
    "job_skill_set": [
      "information security",
      "network security",
      "security incident management",
      "security monitoring",
      "operating systems",
      "firewalls",
      "VPNs",
      "Microsoft 365",
      "networking principles",
      "TCP/IP",
      "analytical abilities",
      "problem solving",
      "attention to detail",
      "communication",
      "teamwork",
      "confidentiality",
      "organization",
      "collaboration",
      "presentation skills",
      "conflict resolution",
      "forensic analysis",
      "vulnerability management",
      "client-server applications",
      "anti-virus products",
      "Azure security tools",
      "programming",
      "scripting languages",
      "open-source security analysis tools",
      "log data interpretation",
      "negotiation"
    ],
    "short_keywords": [
      "365",
      "abilities",
      "analysis",
      "analyst",
      "analytical",
      "antivirus",
      "applications",
      "attention",
      "azure",
      "clientserver",
      "collaboration",
      "communication",
      "confidentiality",
      "conflict",
      "data",
      "detail",
      "firewalls",
      "forensic",
      "incident",
      "information",
      "informationtechnology",
      "interpretation",
      "languages",
      "log",
      "management",
      "microsoft",
      "monitoring",
      "negotiation",
      "network",
      "networking",
      "opensource",
      "operating",
      "organization",
      "presentation",
      "principles",
      "problem",
      "products",
      "programming",
      "resolution",
      "scripting",
      "security",
      "senior",
      "skills",
      "solving",
      "systems",
      "tcpip",
      "teamwork",
      "technology",
      "to",
      "tools",
      "vpns",
      "vulnerability"
    ]
  },
  {
    "job_id": "3901666087",
    "job_title": "Director of Information Technology",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "R.M. PALMER COMPANY, LLC HAS BEEN CRAFTING SEASONAL CHOCOLATE NOVELTIES SINCE 1948. WHAT BEGAN AS ONE MAN’S DREAM HAS GROWN INTO A COLLECTION OF HOLIDAY NOVELTIES LOVED BY MILLIONS OF PEOPLE. TODAY, 850 DEDICATED EMPLOYEES DESIGN, PRODUCE, PACKAGE AND SHIP MORE THAN 500 UNIQUE PRODUCTS FROM PALMER’S HEADQUARTERS IN WYOMISSING, PA. – MAKING IT ONE OF AMERICA’S LARGEST AND MOST INNOVATIVE CONFECTIONERS.\nSUMMARY: AS THE DIRECTOR OF IT, YOU WILL MANAGE AND IMPLEMENT IT STRATEGIES THAT ENHANCE OUR COMPANY’S TECHNOLOGY INFRASTRUCTURE’S EFFICIENCY, CUSTOMER EXPERIENCE, AND OVERALL PERFORMANCE. THE DIRECTOR WILL LEAD THE TRANSFORMATION AND AUTOMATION OF CRITICAL SYSTEMS WHILE ALSO MANAGING INTERNAL CORPORATE NETWORKING, CORPORATE IT POLICIES, WORKING WITH USER AND DESKTOP ENVIRONMENTS, HARDWARE PROCUREMENT, AND HELPDESK/TIER 1 SUPPORT. THIS ROLE WILL SERVE AS THE PRIMARY ARCHITECT FOR OUR IT TEAM, ENSURING THE SMOOTH DEPLOYMENT OF NEW SYSTEMS AND ANTICIPATING POTENTIAL OBSTACLES.\nESSENTIAL FUNCTIONS/DUTIES:1. DEVELOP AND EXECUTE A COMPREHENSIVE IT STRATEGY ALIGNED WITH OUR BUSINESS GOALS, ENSURING TECHNOLOGY SOLUTIONS SUPPORT AND IMPROVE OVERALL OPERATIONS.2. STREAMLINE THE DEVELOPMENT OF A USER-FRIENDLY WEB AND MOBILE PLATFORM.3. IMPLEMENT AND MANAGE A SECURE CRM INSTANCE TO OPTIMIZE OPERATIONS IN SALES, MARKETING, AND OPERATIONS DEPARTMENTS.4. OVERSEE THE DESIGN, IMPLEMENTATION, AND MAINTENANCE OF THE COMPANY’S IT INFRASTRUCTURE, INCLUDING HARDWARE, SOFTWARE, NETWORKS, AND COMMUNICATION SYSTEMS.5. IMPLEMENT AND ENFORCE ROBUST DATA SECURITY MEASURES TO SAFEGUARD CUSTOMER INFORMATION AND COMPLY WITH INDUSTRY REGULATIONS AND STANDARDS.6. COLLABORATE WITH EXTERNAL VENDORS AND TECHNOLOGY PARTNERS TO EVALUATE, SELECT, AND MANAGE IT-RELATED SERVICES, NEGOTIATING CONTRACTS TO MAXIMIZE VALUE.7. PROVIDE TECHNICAL SUPPORT AND ISSUE RESOLUTION TO STAFF AND MANAGEMENT, ADDRESSING ANY TECHNOLOGY-RELATED CONCERNS PROMPTLY.8. CONDUCT TRAINING SESSIONS FOR STAFF ON UTILIZING IT TOOLS EFFECTIVELY AND RAISING AWARENESS OF SECURITY BEST PRACTICES.9. DEVELOP AND MANAGE THE IT BUDGET, ENSURING COST-EFFECTIVE SOLUTIONS AND OPTIMAL ALLOCATION OF RESOURCES.10. DEVELOP AND ENFORCE IT POLICIES, INSURING A SECURE AND PRODUCTIVE IT ENVIRONMENT WHILE MAINTAINING COMPLIANCE WITH COMPANY-WIDE IT STANDARDS.11. CONDUCT RECURRING LEADERSHIP CONVERSATIONS, DEVELOPING/COACHING TEAM MEMBERS INCLUDING BI-WEEKLY 1:1S WHILE GIVING TRANSFORMATIONAL PERFORMANCE FEEDBACK.12. BUILDING AND MAINTAINING A BUSINESS RECOVERY PLAN, ENSURING WE CAN BOUNCE BACK SWIFTLY FROM ANY IT HICCUPS.13. ARCHITECTING DATA BACKUP AND REDUNDANCY SYSTEMS TO ACHIEVE NEAR-PERFECT UPTIME.14. STAY UPDATED ON THE LATEST TECHNOLOGY TREND AND INNOVATIONS RELEVANT TO THE RESTAURANT INDUSTRY, PROPOSING AND IMPLEMENTING IMPROVEMENTS AS APPROPRIATE.15. EXPLORING OTHER JOB DUTIES AS DIRECTED.\nDIRECTLY SUPERVISES (TITLES):· PROGRAMMERS/ANALYSTSTHIS POSITION ALSO PROVIDES SUPERVISION AND LEADERSHIP TO ALL R.M. PALMER EMPLOYEES ON IT RELATED ISSUES.\nKNOWLEDGE/SKILLS:THE MAIN REQUIREMENTS FOR THE POSITION INCLUDE:· MINIMUM OF 5 YEARS OF EXPERIENCE IN IT MANAGEMENT.· EXPERIENCE WORKING IN A FAST-PACED, HIGH GROWTH ORGANIZATION.· EXPERIENCE DEVELOPING CONNECTIONS WITH APIS AND WRITING REPORTS IN SQL RELATIONAL DATABASES.· EXPERIENCE IN UNDERSTANDING BUSINESS METRICS INVOLVED IN DATABASE WORK.· EXPERIENCE IN CYBER SECURITY PROTECTION MEASURES.· STRONG SKILLS IN WORKING WITH TEAMS OR ACROSS DEPARTMENTS.· EXCELLENT COMMUNICATION, INTERPERSONAL, AND PROBLEM-SOLVING SKILLS.\nJOB TYPE: FULL-TIME\nSALARY: $110,000.00 - $130,000.00 PER YEAR\nBENEFITS:401(K)401(K) MATCHINGDENTAL INSURANCEEMPLOYEE ASSISTANCE PROGRAMEMPLOYEE DISCOUNTHEALTH INSURANCELIFE INSURANCEPAID TIME OFFVISION INSURANCEEXPERIENCE LEVEL:5 YEARSSCHEDULE:8 HOUR SHIFTMONDAY TO FRIDAYABILITY TO RELOCATE:READING, PA 19610: RELOCATE BEFORE STARTING WORK (REQUIRED)WORK LOCATION: IN PERSON",
    "job_skill_set": [
      "IT strategy development",
      "data security measures",
      "network management",
      "hardware procurement",
      "SQL",
      "data backup systems",
      "IT budget management",
      "web and mobile platform development",
      "leadership",
      "communication",
      "problem solving",
      "interpersonal skills",
      "teamwork",
      "adaptability",
      "CRM management",
      "API integration",
      "coaching"
    ],
    "short_keywords": [
      "adaptability",
      "and",
      "api",
      "backup",
      "budget",
      "coaching",
      "communication",
      "crm",
      "data",
      "development",
      "director",
      "hardware",
      "information",
      "informationtechnology",
      "integration",
      "interpersonal",
      "it",
      "leadership",
      "management",
      "measures",
      "mobile",
      "network",
      "of",
      "platform",
      "problem",
      "procurement",
      "security",
      "skills",
      "solving",
      "sql",
      "strategy",
      "systems",
      "teamwork",
      "technology",
      "web"
    ]
  },
  {
    "job_id": "3902814456",
    "job_title": "Information Technology System Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "TITILE: SYSTEM TECHNOLOGY MANAGERLOCATION: REMOTEDURATION: DIRECT HIRETOTAL COMP BETWEEN $140 TO $170 K W/BONUS (MAX BASE $145K) W/BONUSWORK REQUIREMENTS: US CITIZEN, GC HOLDERS OR AUTHORIZED TO WORK IN THE U.S.\nSELECTED CANDIDATES WILL RECEIVE OFFERS BASED ON FAIR AND EQUITABLE CRITERIA, TAKING INTO ACCOUNT THEIR JOB-RELATED SKILLS, EXPERIENCE, AND LOCATION.\nIMPORTANT INFO:PROSPECTIVE CANDIDATES MUST POSSESS AT LEAST TWO (2) OF THE LEADING SYSTEMS: ZAFIRE, INFORM GROUNDSTAR PLANNING, REALTIME, OR WORKFORCE PLUS.\nJOB SUMMARY:WE SEEK A HIGHLY SKILLED AND EXPERIENCED MANAGER OF GROUND SYSTEMS TECHNOLOGY TO JOIN OUR DYNAMIC PRODUCT TEAM TO SUPPORT THE PASSENGER SERVICE DIVISION. THIS REMOTE POSITION CATERS TO US RESIDENTS, WITH SOME TRAVEL REQUIRED. THE SUCCESSFUL CANDIDATE WILL PLAY A CRUCIAL ROLE IN OVERSEEING THE TECHNOLOGICAL ASPECTS OF OUR GROUND OPERATIONS, ENSURING EFFICIENCY, INNOVATION, AND SUPERIOR SERVICE DELIVERY IN OUR AIR CARGO BUSINESS. THIS POSITION OFFERS AN EXCEPTIONAL OPPORTUNITY TO MAKE A SIGNIFICANT IMPACT WITHIN A LARGE ORGANIZATION, DRIVING FORWARD OUR STRATEGIC OBJECTIVES AND ENHANCING OUR GLOBAL OPERATIONAL CAPABILITIES.\nRESPONSIBILITIES:LEADERSHIP AND STRATEGY: LEAD A TEAM OF PROFESSIONALS IN MANAGING AND OPTIMIZING OUR GROUND SYSTEMS TECHNOLOGY. DEVELOP AND IMPLEMENT STRATEGIC PLANS TO ENHANCE OPERATIONAL EFFICIENCY, REDUCE COSTS, AND IMPROVE CUSTOMER SATISFACTION.OVERSEE THE ADMINISTRATION, INTEGRATION, AND OPTIMIZATION OF SPECIFIC GROUND SYSTEMS TECHNOLOGIES, INCLUDING ZAFIRE, INFORM GROUNDSTAR PLANNING, REALTIME, AND WORKFORCE PLUS. ENSURE THESE SYSTEMS ARE LEVERAGED TO THEIR FULL POTENTIAL TO MEET OUR BUSINESS NEEDS.UTILIZE BI TOOLS TO ANALYZE DATA, GENERATE INSIGHTS, AND PRODUCE ACTIONABLE REPORTS TO SUPPORT DECISION-MAKING. DEVELOP AND MAINTAIN DASHBOARDS AND REPORTING TOOLS TO MONITOR PERFORMANCE METRICS AND IDENTIFY IMPROVEMENT OPPORTUNITIES.LEAD INITIATIVES TO INTEGRATE GROUND SYSTEMS TECHNOLOGY WITH OTHER CORPORATE SYSTEMS AND PROCESSES. IDENTIFY AND IMPLEMENT PROCESS IMPROVEMENTS AND TECHNOLOGICAL SOLUTIONS TO ENHANCE OPERATIONAL EFFECTIVENESS.EXHIBIT OUTSTANDING CUSTOMER ENGAGEMENT SKILLS, WORKING CLOSELY WITH THE BUSINESS ON REGIONAL AND GLOBAL LEVELS. ACT AS A KEY LIAISON BETWEEN THE TECHNOLOGY TEAM AND BUSINESS UNITS, ENSURING ALIGNMENT OF TECHNOLOGICAL SOLUTIONS WITH BUSINESS OBJECTIVES.MANAGE AND DELIVER TECHNOLOGY PROJECTS ON TIME AND WITHIN BUDGET. APPLY BEST PRACTICES IN PROJECT MANAGEMENT TO ENSURE SUCCESSFUL OUTCOMES.ENSURE COMPLIANCE WITH INDUSTRY REGULATIONS AND STANDARDS. STAY ABREAST OF THE PASSENGER SERVICE INDUSTRY'S TECHNOLOGICAL ADVANCEMENTS AND BEST PRACTICES TO DRIVE CONTINUOUS IMPROVEMENT.\nMINIMUM REQUIREMENTS:BACHELOR'S DEGREE IN INFORMATION TECHNOLOGY, COMPUTER SCIENCE, ENGINEERING, OR A RELATED FIELD. MASTER'S DEGREE PREFERRED.MINIMUM OF 5 YEARS OF EXPERIENCE IN THE AIRLINE PASSENGER SERVICE INDUSTRY, WITH A STRONG UNDERSTANDING OF GROUND OPERATIONS AND LOGISTICS.MUST HAVE: PROVEN EXPERIENCE WITH ZAFIRE, INFORM GROUNDSTAR PLANNING, REALTIME, AND WORKFORCE PLUS SYSTEMS.STRONG BACKGROUND IN BUSINESS INTELLIGENCE, DATA ANALYSIS, AND REPORTING.DEMONSTRATED ABILITY TO MANAGE AND INTEGRATE COMPLEX SYSTEMS AND PROCESSES.EXCEPTIONAL CUSTOMER ENGAGEMENT AND INTERPERSONAL SKILLS, WITH THE ABILITY TO WORK CLOSELY WITH REGIONAL AND GLOBAL BUSINESS UNITS.STRONG LEADERSHIP AND TEAM MANAGEMENT SKILLS, MUST HAVE MANAGED A TEAM WITH A PROVEN TRACK RECORD OF LEADING SUCCESSFUL PROJECTS.EXCELLENT ANALYTICAL, PROBLEM-SOLVING, AND DECISION-MAKING CAPABILITIES.FLUENT IN ENGLISH, WITH SUPERIOR WRITTEN AND VERBAL COMMUNICATION SKILLS. ADDITIONAL LANGUAGES ARE A PLUS.\nPHYSICAL REQUIREMENTS/WORKING CONDITIONS:REMAIN IN A STATIONARY POSITION 50% OF THE TIME.TRAVEL REQUIRED\n#LI-CG3#LI-REMOTE\nABOUT INSPYR SOLUTIONS\n\nTECHNOLOGY IS OUR FOCUS AND QUALITY IS OUR COMMITMENT. AS A NATIONAL EXPERT IN DELIVERING FLEXIBLE TECHNOLOGY AND TALENT SOLUTIONS, WE STRATEGICALLY ALIGN INDUSTRY AND TECHNICAL EXPERTISE WITH OUR CLIENTS’ BUSINESS OBJECTIVES AND CULTURAL NEEDS. OUR SOLUTIONS ARE TAILORED TO EACH CLIENT AND INCLUDE A WIDE VARIETY OF PROFESSIONAL SERVICES, PROJECT, AND TALENT SOLUTIONS. BY ALWAYS STRIVING FOR EXCELLENCE AND FOCUSING ON THE HUMAN ASPECT OF OUR BUSINESS, WE WORK SEAMLESSLY WITH OUR TALENT AND CLIENTS TO MATCH THE RIGHT SOLUTIONS TO THE RIGHT OPPORTUNITIES. LEARN MORE ABOUT US AT INSPYRSOLUTIONS.COM. INSPYR SOLUTIONS PROVIDES EQUAL EMPLOYMENT OPPORTUNITIES (EEO) TO ALL EMPLOYEES AND APPLICANTS FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, NATIONAL ORIGIN, AGE, DISABILITY, OR GENETICS. IN ADDITION TO FEDERAL LAW REQUIREMENTS, INSPYR SOLUTIONS COMPLIES WITH APPLICABLE STATE AND LOCAL LAWS GOVERNING NONDISCRIMINATION IN EMPLOYMENT IN EVERY LOCATION IN WHICH THE COMPANY HAS FACILITIES.",
    "job_skill_set": [
      "Customer Engagement",
      "Interpersonal Skills",
      "Problem Solving",
      "Communication",
      "Team Management",
      "ZAFIRE",
      "INFORM GROUNDSTAR PLANNING",
      "REALTIME",
      "WORKFORCE PLUS",
      "Business Intelligence",
      "Data Analysis",
      "Reporting",
      "Project Management",
      "System Integration",
      "Dashboard Development",
      "Leadership",
      "Analytical Skills",
      "Decision Making"
    ],
    "short_keywords": [
      "analysis",
      "analytical",
      "business",
      "communication",
      "customer",
      "dashboard",
      "data",
      "decision",
      "development",
      "engagement",
      "groundstar",
      "inform",
      "information",
      "informationtechnology",
      "integration",
      "intelligence",
      "interpersonal",
      "leadership",
      "making",
      "management",
      "manager",
      "planning",
      "plus",
      "problem",
      "project",
      "realtime",
      "reporting",
      "skills",
      "solving",
      "system",
      "team",
      "technology",
      "workforce",
      "zafire"
    ]
  },
  {
    "job_id": "3905376504",
    "job_title": "Information Technology Operations Intern - Summer 2024",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "STV IS CURRENTLY SEEKING AN INFORMATION TECHNOLOGY OPERATION INTERN TO JOIN OUR IT OPERATIONS TEAM IN DOUGLASSVILLE, PA. THIS INTERNSHIP WILL PROVIDE YOU THE OPPORTUNITY TO WORK CLOSELY WITH THE IT OPERATIONS TECHNICIANS, LEADERSHIP, OTHER IT DEPARTMENT DISCIPLINES, AND THE USER COMMUNITY.\n\nRESPONSIBILITIES\n\nPROVIDE FIRST-LEVEL TECHNICAL SUPPORT TO END-USERS FOR HARDWARE, SOFTWARE, AND NETWORK ISSUES.RESPOND TO INCIDENTS, REQUESTS, AND OTHER INQUIRIES PROMPTLY AND PROFESSIONALLY.ASSIST USERS WITH SYSTEM NAVIGATION, SOFTWARE INSTALLATIONS, PRINTERS, AV AND OTHER IT TASKS.CREATE AND UPDATE DOCUMENTATION FOR COMMON IT PROCEDURES AND TROUBLESHOOTING SOLUTIONS.COLLABORATE WITH IT TEAMS TO ADDRESS AND RESOLVE TECHNICAL ISSUES, ASSIST WITH IT PROJECTS AS AVAILABLE.ADHERE TO IT SECURITY POLICIES AND PROTOCOLS TO MAINTAIN DATA CONFIDENTIALITY AND INTEGRITY.\n\n\nPREFERRED QUALIFICATIONS\n\nPURSUING A DEGREE IN INFORMATION TECHNOLOGY OR A RELATED FIELD.FAMILIARITY WITH WINDOWS 10, OFFICE 365, MICROSOFT TEAMS, AND OTHER COMMONLY USED SOFTWARE.FAMILIARITY WITH DELL COMPUTERS INCLUDING LAPTOPS, DOCKS, PERIPHERALS AND DESKTOPS.FAMILIARITY WITH APPLE MOBILE DEVICES, INCLUDING IPADS AND IPHONES.PREVIOUS EXPERIENCE IN A CUSTOMER SERVICE OR TECHNICAL SUPPORT ROLE IS A PLUS, AND/OR AN IT SERVICE MANAGEMENT SYSTEM.\n\n\nCOMPENSATION RANGE\n\n$38,927.00 - $51,903.00\n\nDON’T MEET EVERY SINGLE REQUIREMENT? STUDIES HAVE SHOWN THAT WOMEN AND PEOPLE OF COLOR ARE LESS LIKELY TO APPLY TO JOBS UNLESS THEY MEET EVERY SINGLE QUALIFICATION. AT STV, WE ARE FULLY COMMITTED TO EXPANDING OUR CULTURE OF DIVERSITY AND INCLUSION, ONE THAT WILL REFLECT THE CLIENTS WE SERVE AND THE COMMUNITIES WE WORK IN, SO IF YOU’RE EXCITED ABOUT THIS ROLE BUT YOUR PAST EXPERIENCE DOESN’T ALIGN PERFECTLY WITH EVERY QUALIFICATION IN THE JOB DESCRIPTION WE ENCOURAGE YOU TO APPLY ANYWAYS. YOU MAY BE JUST THE RIGHT CANDIDATE FOR THIS OR OTHER ROLES.\n\nSTV OFFERS THE FOLLOWING BENEFITS\n\n HEALTH INSURANCE, INCLUDING AN OPTION WITH A HEALTH SAVINGS ACCOUNT DENTAL INSURANCE VISION INSURANCE FLEXIBLE SPENDING ACCOUNTS (HEALTHCARE, DEPENDENT CARE AND TRANSIT AND PARKING WHERE APPLICABLE) DISABILITY INSURANCE LIFE INSURANCE AND ACCIDENTAL DEATH & DISMEMBERMENT 401(K) PLAN RETIREMENT COUNSELING EMPLOYEE ASSISTANCE PROGRAM PAID TIME OFF (16 DAYS) PAID HOLIDAYS (8 DAYS) BACK-UP DEPENDENT CARE (UP TO 10 DAYS PER YEAR) PARENTAL LEAVE (UP TO 80 HOURS) CONTINUING EDUCATION PROGRAM PROFESSIONAL LICENSURE AND SOCIETY MEMBERSHIPS\n\n\nSTV IS COMMITTED TO PAYING ALL OF ITS EMPLOYEES IN A FAIR, EQUITABLE, AND TRANSPARENT MANNER. THE LISTED PAY RANGE IS STV’S GOOD-FAITH SALARY ESTIMATE FOR THIS POSITION. PLEASE NOTE THAT THE FINAL SALARY OFFERED FOR THIS POSITION MAY BE OUTSIDE OF THIS PUBLISHED RANGE BASED ON MANY FACTORS, INCLUDING BUT NOT LIMITED TO GEOGRAPHY, EDUCATION, EXPERIENCE, AND/OR CERTIFICATIONS.",
    "job_skill_set": [
      "technical support",
      "hardware troubleshooting",
      "software troubleshooting",
      "documentation",
      "IT security policies",
      "IT service management",
      "communication",
      "collaboration",
      "customer service",
      "problem solving",
      "professionalism",
      "adaptability",
      "network troubleshooting",
      "Windows 10",
      "Office 365",
      "Microsoft Teams",
      "Dell computers",
      "Apple mobile devices"
    ],
    "short_keywords": [
      "10",
      "2024",
      "365",
      "adaptability",
      "apple",
      "collaboration",
      "communication",
      "computers",
      "customer",
      "dell",
      "devices",
      "documentation",
      "hardware",
      "information",
      "informationtechnology",
      "intern",
      "it",
      "management",
      "microsoft",
      "mobile",
      "network",
      "office",
      "operations",
      "policies",
      "problem",
      "professionalism",
      "security",
      "service",
      "software",
      "solving",
      "summer",
      "support",
      "teams",
      "technical",
      "technology",
      "troubleshooting",
      "windows"
    ]
  },
  {
    "job_id": "3905238300",
    "job_title": "Information Technology Help Desk",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "COMPANY DESCRIPTION FIVE RIVERS ANALYTICS\n ROLE DESCRIPTION THIS IS A FULL-TIME HYBRID ROLE FOR AN INFORMATION TECHNOLOGY HELP DESK POSITION AT FIVE RIVERS ANALYTICS LOCATED IN GREATER BOSTON. THE ROLE INVOLVES PROVIDING TECHNICAL SUPPORT AND TROUBLESHOOTING ASSISTANCE TO END-USERS. THE HELP DESK TECHNICIAN WILL BE RESPONSIBLE FOR RESOLVING HARDWARE AND SOFTWARE ISSUES, RESETTING PASSWORDS, AND ASSISTING WITH NETWORK CONNECTIVITY. SOME WORK FROM HOME IS ACCEPTABLE.\n QUALIFICATIONS NETWORK ADMINISTRATION, INFORMATION TECHNOLOGY, AND NETWORK SECURITY SKILLSTROUBLESHOOTING SKILLSCUSTOMER SERVICE SKILLSEXCELLENT COMMUNICATION AND INTERPERSONAL SKILLSABILITY TO WORK INDEPENDENTLY AND IN A TEAMATTENTION TO DETAIL AND PROBLEM-SOLVING SKILLSASSOCIATE OR BACHELOR'S DEGREE IN INFORMATION TECHNOLOGY OR RELATED FIELDCERTIFICATIONS SUCH AS COMPTIA A+, NETWORK+ OR SECURITY+ ARE A PLUS",
    "job_skill_set": [
      "network administration",
      "information technology",
      "network security",
      "troubleshooting",
      "customer service",
      "CompTIA A+",
      "Network+",
      "Security+",
      "communication",
      "interpersonal skills",
      "teamwork",
      "independence",
      "attention to detail",
      "problem solving"
    ],
    "short_keywords": [
      "a",
      "administration",
      "attention",
      "communication",
      "comptia",
      "customer",
      "desk",
      "detail",
      "help",
      "independence",
      "information",
      "informationtechnology",
      "interpersonal",
      "network",
      "problem",
      "security",
      "service",
      "skills",
      "solving",
      "teamwork",
      "technology",
      "to",
      "troubleshooting"
    ]
  },
  {
    "job_id": "3905290997",
    "job_title": "Tier 1 JSOC Analyst/Information Technology Specialist 3 (Information Security), ref 5774-Tier 1",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "MINIMUM QUALIFICATIONS\n\nBACHELOR’S DEGREE* WITH AT LEAST 15 CREDIT HOURS IN CYBER SECURITY, INFORMATION ASSURANCE, OR INFORMATION TECHNOLOGY; AND TWO YEARS OF INFORMATION TECHNOLOGY EXPERIENCE, INCLUDING ONE YEAR OF INFORMATION SECURITY OR INFORMATION ASSURANCE EXPERIENCE**.\n\n SUBSTITUTION: BACHELOR’S DEGREE CANDIDATES WITHOUT AT LEAST 15 COURSE CREDITS IN CYBER SECURITY, INFORMATION ASSURANCE, OR INFORMATION TECHNOLOGY REQUIRE AN ADDITIONAL YEAR OF GENERAL INFORMATION TECHNOLOGY EXPERIENCE TO QUALIFY. APPROPRIATE INFORMATION SECURITY OR INFORMATION ASSURANCE EXPERIENCE MAY SUBSTITUTE FOR THE BACHELOR’S DEGREE ON A YEAR-FOR-YEAR BASIS; AN ASSOCIATE’S DEGREE REQUIRES AN ADDITIONAL TWO YEARS OF GENERAL INFORMATION TECHNOLOGY EXPERIENCE. EXPERIENCE SOLELY IN INFORMATION SECURITY OR INFORMATION ASSURANCE MAY SUBSTITUTE FOR THE GENERAL INFORMATION TECHNOLOGY EXPERIENCE.\n\nPREFERRED QUALIFICATIONS\n\n BACHELOR'S DEGREE WITH A CONCENTRATION OR MAJOR IN INFORMATION SECURITY, CYBER SECURITY, DIGITAL FORENSICS, INFORMATION ASSURANCE, OR A RELATED FIELD. CERTIFICATIONS IN ONE OR MORE OF THE FOLLOWING AREAS:CERTIFICATE IN COMPUTER NETWORK DEFENSE (E.G., GCIA, GCED, GDAT, GPPA, GCDA, GMON, GWEB, CND, ECIH, GCIH)CERTIFICATE IN CYBER THREAT INTELLIGENCE (E.G., CTIA, GCTI, CCIP, CSTIR) O CERTIFICATE IN DIGITAL FORENSICS (E.G., ACE, GCFA, GCFE, GREM, GNFA)CERTIFICATE IN PENETRATION TESTING (E.G., GPEN, CEH, GAWN, GWAPT, LPT) 2+ YEARS’ EXPERIENCE IN TECHNICAL WRITING. 2+ YEARS’ EXPERIENCE IN THE FOLLOWING AREAS:APPLYING AND IMPLEMENTING NETWORK AND/OR SYSTEM SECURITYINFORMATION SECURITY INCIDENT RESPONSELOG ANALYSIS (E.G., FIREWALL LOGS, DNS LOGS, PROXY LOGS, IPS/IDS LOGS)USING SIEM TECHNOLOGIES TO SUPPORT IN-DEPTH INVESTIGATIONS POSSESS A WORKING KNOWLEDGE IN THE FOLLOWING AREAS:COMPUTER NETWORKS, INTRUSION DETECTION SYSTEMS, ROUTERS, FIREWALLS, OPERATING SYSTEMS, NETWORK VULNERABILITY ASSESSMENTS, WEB APPLICATION VULNERABILITY ASSESSMENTS, COMPUTER PROGRAMMING AND SCRIPTINGNETWORK SECURITY SOLUTIONS (E.G., INTRUSION DETECTION/PREVENTION SYSTEMS, FIREWALLS) O SYSTEM ADMINISTRATIONVULNERABILITY MANAGEMENTCOMPUTER PROGRAMMING AND SCRIPTINGINFORMATION SECURITY (CIA TRIAD, INFORMATION CLASSIFICATION, RISK MANAGEMENT, INCIDENT RESPONSE, VULNERABILITY MANAGEMENT, SECURITY ARCHITECTURE & ENGINEERING) EXCELLENT SPEAKING AND WRITING SKILLS. ABLE TO CLEARLY ARTICULATE INFORMATION TECHNOLOGY AND INFORMATION SECURITY CONCEPTS TO A VARIED AUDIENCE TO FACILITATE WIDE UNDERSTANDING. DEMONSTRATED CRITICAL THINKING, PROBLEM SOLVING AND ANALYTICAL SKILLS.\n\nDUTIES DESCRIPTION\n\nTHE POSITION WILL REPORT TO THE NYS ITS DIRECTOR OF CYBER COMMAND IN SUPPORT OF THE JOINT SECURITY OPERATIONS CENTER (JSOC) ACTIVITIES. THE NEW YORK JSOC WILL SERVE AS A FIRST-OF-ITS-KIND HUB FOR DATA SHARING AND CYBER COORDINATION ACROSS NEW YORK STATE, NEW YORK CITY, THE FIVE MAJOR UPSTATE CITIES, LOCAL AND REGIONAL GOVERNMENTS, CRITICAL INFRASTRUCTURE AND FEDERAL PARTNERS. THE INCUMBENT WILL BE A MEMBER OF A TEAM THAT PERFORMS INTAKE AND INITIAL TRIAGE OF CYBER SECURITY EVENTS. THEY WILL RECEIVE COMPUTER SECURITY ALERTS FROM VARIOUS NYS INFRASTRUCTURES AND WILL WORK TO REVIEW, CLASSIFY, PRIORITIZE, AND ESCALATE THESE ALERTS TO THE APPROPRIATE STAKEHOLDERS.\n\nDUTIES INCLUDE, BUT ARE NOT LIMITED TO\n\n PARTICIPATE IN THE IDENTIFICATION, TRIAGE, AND ESCALATION OF SECURITY EVENTS. MONITOR MULTIPLE SOURCES (PHONE, EMAIL, AUTOMATED SYSTEMS, ETC.) FOR NEW SECURITY EVENTS. FOLLOW ALL ESTABLISHED PROCEDURES, WORKFLOWS, AND TASKS RELATED TO JSOC ACTIVITIES. ENSURE IDENTIFIED INCIDENTS ARE ESCALATED EFFICIENTLY. ENSURE THAT TICKETS ARE PROPERLY CREATED AND TRACKED IN THE TICKET MANAGEMENT SYSTEM, AND IN A TIMELY MANNER. ENSURE THAT TRUSTED THIRD PARTY NOTIFICATIONS ARE FORWARDED TO THE APPROPRIATE STAKEHOLDERS. PARTICIPATE IN THE DEVELOPMENT AND REVISION OF STANDARD OPERATING PROCEDURES AND WORKFLOWS. CREATE WRITTEN TECHNICAL REPORTS AND EXECUTIVE SUMMARIES RELATED TO CYBER SECURITY INCIDENTS AND EVENTS. MAINTAIN AN ADEQUATE LEVEL OF CURRENT KNOWLEDGE AND PROFICIENCY IN INFORMATION SECURITY THROUGH ANNUAL CONTINUING PROFESSIONAL EDUCATION (CPE) CREDITS DIRECTLY RELATED TO INFORMATION SECURITY. PERFORM THE FULL RANGE OF SUPERVISORY RESPONSIBILITIES AND ADDITIONAL DUTIES AS ASSIGNED.\n\nADDITIONAL COMMENTS\n\nADDITIONAL DETAILS ON WORK SHIFT WILL BE DISCUSSED AT TIME OF INTERVIEW.\n\nBACKGROUND CHECK AND FINGERPRINTING ARE REQUIRED.\n\nBENEFITS OF WORKING FOR NYS\n\nGENEROUS BENEFITS PACKAGE, WORTH 65% OF SALARY, INCLUDING:\n\n HOLIDAY & PAID TIME OFF THIRTEEN (13) PAID HOLIDAYS ANNUALLY UP TO THIRTEEN (13) DAYS OF PAID VACATION LEAVE ANNUALLY UP TO FIVE (5) DAYS OF PAID PERSONAL LEAVE ANNUALLY UP TO THIRTEEN (13) DAYS OF PAID SICK LEAVE ANNUALLY FOR PEF UP TO THREE (3) DAYS OF PROFESSIONAL LEAVE ANNUALLY TO PARTICIPATE IN PROFESSIONAL DEVELOPMENT\n\nHEALTH CARE BENEFITS\n\n ELIGIBLE EMPLOYEES AND DEPENDENTS CAN PICK FROM A VARIETY OF AFFORDABLE HEALTH INSURANCE PROGRAMS FAMILY DENTAL AND VISION BENEFITS AT NO ADDITIONAL COST\n\nADDITIONAL BENEFITS\n\n NEW YORK STATE EMPLOYEES’ RETIREMENT SYSTEM (ERS) MEMBERSHIP NYS DEFERRED COMPENSATION ACCESS TO NY 529 AND NY ABLE COLLEGE SAVINGS PROGRAMS, AS WELL AS U.S. SAVINGS BONDS PUBLIC SERVICE LOAN FORGIVENESS (PSLF) UP TO 50% TELECOMMUTING AND MANY MORE.\n\n",
    "job_skill_set": [
      "cyber security",
      "information technology",
      "computer programming",
      "system administration",
      "operating systems",
      "communication",
      "critical thinking",
      "problem solving",
      "analytical skills",
      "teamwork",
      "information assurance",
      "network security",
      "incident response",
      "log analysis",
      "SIEM technologies",
      "technical writing",
      "vulnerability management",
      "digital forensics",
      "penetration testing",
      "network vulnerability assessments",
      "web application vulnerability assessments",
      "intrusion detection systems",
      "firewalls",
      "routers",
      "risk management",
      "security architecture",
      "attention to detail",
      "time management",
      "adaptability"
    ],
    "short_keywords": [
      "1",
      "3",
      "5774tier",
      "adaptability",
      "administration",
      "analysis",
      "analystinformation",
      "analytical",
      "application",
      "architecture",
      "assessments",
      "assurance",
      "attention",
      "communication",
      "computer",
      "critical",
      "cyber",
      "detail",
      "detection",
      "digital",
      "firewalls",
      "forensics",
      "incident",
      "information",
      "informationtechnology",
      "intrusion",
      "jsoc",
      "log",
      "management",
      "network",
      "operating",
      "penetration",
      "problem",
      "programming",
      "ref",
      "response",
      "risk",
      "routers",
      "security",
      "siem",
      "skills",
      "solving",
      "specialist",
      "system",
      "systems",
      "teamwork",
      "technical",
      "technologies",
      "technology",
      "testing",
      "thinking",
      "tier",
      "time",
      "to",
      "vulnerability",
      "web",
      "writing"
    ]
  },
  {
    "job_id": "3902801404",
    "job_title": "Senior Information Technology Project Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "MY CLIENT, A TOP-TIER QUANTITATIVE ASSET MANAGER, IS SEEKING AN INDIVIDUAL SENIOR IT PROJECT MANAGER TO JOIN THEIR GROWING ORGANIZATION. THIS INDIVIDUAL WILL BE IN CHARGE OF MANAGING MID TO LARGE SIZE PROJECTS WITH A FOCUS ON IMPLEMENTING NEW SYSTEMS, NEW PLATFORMS, AND NEW TECHNOLOGIES INTERNALLY. THE IDEAL CANDIDATE WILL HAVE 5-10 YEARS OF EXPERIENCE SUPPORTING IT BUSINESS PROJECTS AND IT OPERATIONAL PROJECTS WITHIN A FINANCIAL ORGANIZATION. THIS IS A HYBRID MODEL IN BOSTON, MA.\nRESPONSIBILITIES:  SCOPING, PLANNING, AND EXECUTING IT PROJECTSCREATE AND MAINTAIN PROJECT PLANS, WHICH INCLUDE TASKS, DEPENDENCIES, MILESTONES, ETC. COLLABORATE WITH MULTIPLE IT AND BUSINESS TEAMS TO ACHIEVE PROJECT OBJECTIVES AND TIMELINESSERVE AS A SCRUM MASTER FOR INVESTMENT SYSTEMS TEAMS\nQUALIFICATIONS: 5-10 YEARS OF EXPERIENCE SUPPORTING IT BUSINESS PROJECTS AND IT OPERATIONAL PROJECTS FINANCIAL SERVICES INDUSTRY EXPERIENCE IS HIGHLY PREFERREDHANDS-ON PROJECT MANAGEMENT CAPABILITIES, E.G. WATERFALL, AGILE, ETC. IS PREFERRED  AGILE SCRUM MASTER CERTIFICATION. PMP CERTIFICATION AND/OR SAFE CERTIFICATION PREFERRED",
    "job_skill_set": [
      "IT systems implementation",
      "collaboration",
      "communication",
      "leadership",
      "problem solving",
      "adaptability",
      "project management",
      "Agile",
      "Scrum Master certification",
      "PMP certification",
      "SAFE certification",
      "financial services experience",
      "Waterfall methodology",
      "project planning",
      "task management",
      "dependency management",
      "milestone tracking",
      "time management"
    ],
    "short_keywords": [
      "adaptability",
      "agile",
      "certification",
      "collaboration",
      "communication",
      "dependency",
      "experience",
      "financial",
      "implementation",
      "information",
      "informationtechnology",
      "it",
      "leadership",
      "management",
      "manager",
      "master",
      "methodology",
      "milestone",
      "planning",
      "pmp",
      "problem",
      "project",
      "safe",
      "scrum",
      "senior",
      "services",
      "solving",
      "systems",
      "task",
      "technology",
      "time",
      "tracking",
      "waterfall"
    ]
  },
  {
    "job_id": "3905343965",
    "job_title": "Director Information Technology Services",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "COMPANY OVERVIEW: \nA LEADING LAW FIRM CLIENT OF OURS IS SEEKING AN EXPERIENCED HANDS-ON IT DIRECTOR IN THE LOS ANGELES METROPOLITAN AREA. \nJOB DESCRIPTION:\nAS IT DIRECTOR, YOU'LL OVERSEE ENGINEERING AND HELP DESK TEAMS, MANAGE THE IT BUDGET, RESOURCES, AND VENDOR RELATIONSHIPS. YOU'LL DESIGN, IMPLEMENT, AND SUPPORT NETWORK INFRASTRUCTURE, APPLICATIONS, AND RELATED TECHNOLOGIES.\nKEY RESPONSIBILITIES:LEAD ENGINEERING AND HELP DESK TEAMSMANAGE VENDOR RELATIONSHIPSMANAGE IT RESOURCES AND BUDGETDESIGN, IMPLEMENT, AND SUPPORT NETWORK INFRASTRUCTURE AND APPLICATIONSTROUBLESHOOT ISSUES AND UTILIZE CLOUD TECHNOLOGIESENSURE COMPLIANCE WITH SECURITY POLICIES\nQUALIFICATIONS:BACHELOR'S DEGREE IN RELEVANT FIELD (ENGINEERING, COMPUTER SCIENCES, BUSINESS ADMINISTRATION)10+ YEARS OF HANDS-ON IT SUPPORT EXPERIENCEPROFICIENCY IN CLOUD TECHNOLOGIES (AZURE, AWS, AND/OR GCP) AND NETWORK INFRASTRUCTUREHANDS-ON MANAGEMENT APPROACHABILITY TO WORK ONSITE INITIALLY WITH REMOTE WORK OPTION LATER. INITIAL 5-DAY ONSITE AND REMOTE WORK FLEXIBILITY AVAILABLE AFTER A 90-DAY PROBATION PERIOD.\nTO APPLY, SEND YOUR RESUME TO RECRUITERS@JBA.COM",
    "job_skill_set": [
      "IT management",
      "network infrastructure",
      "budget management",
      "troubleshooting",
      "security compliance",
      "engineering",
      "application support",
      "leadership",
      "communication",
      "problem solving",
      "approachability",
      "team management",
      "cloud technologies",
      "vendor management"
    ],
    "short_keywords": [
      "application",
      "approachability",
      "budget",
      "cloud",
      "communication",
      "compliance",
      "director",
      "engineering",
      "information",
      "informationtechnology",
      "infrastructure",
      "it",
      "leadership",
      "management",
      "network",
      "problem",
      "security",
      "services",
      "solving",
      "support",
      "team",
      "technologies",
      "technology",
      "troubleshooting",
      "vendor"
    ]
  },
  {
    "job_id": "3904922553",
    "job_title": "Information Technology Business Consultant",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "POSITION: IT BUSINESS CONSULTANTHYBRID- HENDERSONVILLE, TN 3 DAYS ONSITE/2 DAYS REMOTEWORK HOURS: 8AM – 5 PM MON TO FRI (3 DAYS PER WEEK ONSITE)LONG TERM CONTRACT PURPOSETHE ROLE OF AN IT BUSINESS CONSULTANT IS TO PRIMARILY SUPPORT THE OPPORTUNITY IDENTIFICATION PROCESS FOR ALL NEW IT REQUESTS VIA THE IT BUSINESS INTEGRATION & STRATEGY TEAM. THIS IS DONE BY DOCUMENTING NEW AND EXISTING BUSINESS PROCESSES AND OPPORTUNITY SPECIFIC BUSINESS NEEDS BY PARTNERING ACROSS ALL BUSINESS UNITS AND LEVELS OF THE ORGANIZATION. THEY ARE ADDITIONALLY RESPONSIBLE FOR MARKET RESEARCH, DESIGN-THINKING WORKSHOP FACILITATION, AND HELPING TRANSLATE BUSINESS NEEDS AND IDEAS INTO ACTIONABLE ITEMS FOR DELIVERY TEAMS.\n3+ YEARS OF EXPERIENCE IN BUSINESS ANALYSIS, MARKET RESEARCH, AND PROCESS FLOW DOCUMENTATION- MUST HAVESTRONG COMMUNICATION AND PRESENTATION SKILLS – MUST HAVEEXPERIENCE IN STRATEGIC PLANNING IN PRODUCT DEVELOPMENT, USER INSIGHTS, AND PRODUCT STRATEGY – MUST HAVEJIRA AND CONFLUENCE – NICE TO HAVEBACHELOR’S DEGREE – PREFERREDPREVIOUS EXPERIENCE IN RETAIL INDUSTRY – NICE TO HAVE",
    "job_skill_set": [
      "business analysis",
      "process flow documentation",
      "JIRA",
      "strategic planning",
      "product development",
      "product strategy",
      "communication",
      "presentation",
      "collaboration",
      "problem solving",
      "market research",
      "Confluence",
      "user insights",
      "design thinking"
    ],
    "short_keywords": [
      "analysis",
      "business",
      "collaboration",
      "communication",
      "confluence",
      "consultant",
      "design",
      "development",
      "documentation",
      "flow",
      "information",
      "informationtechnology",
      "insights",
      "jira",
      "market",
      "planning",
      "presentation",
      "problem",
      "process",
      "product",
      "research",
      "solving",
      "strategic",
      "strategy",
      "technology",
      "thinking",
      "user"
    ]
  },
  {
    "job_id": "3900955363",
    "job_title": "Information Technology Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "4 DAYS ONSITE / 1 DAY REMOTE - DISCRETIONARY BONUS PAID OUT IN MARCH OF EACH YEAR\nTHIS POSITION REQUIRES A STRATEGIC THINKER WITH STRONG LEADERSHIP CAPABILITIES, EXCELLENT TECHNICAL EXPERTISE, AND A PROVEN TRACK RECORD IN IMPLEMENTING AND MAINTAINING IT SYSTEMS.RESPONSIBILITIES:LEADERSHIP AND TEAM MANAGEMENT:PROVIDE LEADERSHIP AND DIRECTION TO THE IT TEAM, FOSTERING A COLLABORATIVE AND HIGH-PERFORMANCE CULTURE.MENTOR AND DEVELOP TEAM MEMBERS, ENCOURAGING PROFESSIONAL GROWTH AND SKILL ENHANCEMENT.STRATEGIC PLANNING:COLLABORATE WITH SENIOR LEADERSHIP TO DEVELOP AND IMPLEMENT IT STRATEGIES ALIGNED WITH ORGANIZATIONAL GOALS.STAY ABREAST OF INDUSTRY TRENDS AND TECHNOLOGICAL ADVANCEMENTS, PROVIDING RECOMMENDATIONS FOR INNOVATION.PROJECT MANAGEMENT:LEAD THE PLANNING, EXECUTION, AND DELIVERY OF IT PROJECTS WITHIN SCOPE, BUDGET, AND TIMELINE.COLLABORATE WITH CROSS-FUNCTIONAL TEAMS TO DEFINE PROJECT REQUIREMENTS AND OBJECTIVES.INFRASTRUCTURE MANAGEMENT:OVERSEE THE DESIGN, IMPLEMENTATION, AND MAINTENANCE OF IT INFRASTRUCTURE, ENSURING RELIABILITY AND SCALABILITY.SUPPORT DATACENTER OPERATIONS.OVERSEE DISASTER RECOVERY / BUSINESS CONTINUITY PROCESS AND TESTING.MANAGE RELATIONSHIPS WITH VENDORS AND SERVICE PROVIDERS TO OPTIMIZE SYSTEM PERFORMANCE.SECURITY AND COMPLIANCE:DEVELOP AND ENFORCE IT SECURITY POLICIES AND PROCEDURES TO SAFEGUARD ORGANIZATIONAL DATA.REVIEW CYBERSECURITY THREATS AND IMPLEMENT MEASURES TO ENHANCE SECURITY POSTURE.BUDGETING AND RESOURCE ALLOCATION:CONTRIBUTE TO THE DEVELOPMENT AND MANAGEMENT OF THE IT BUDGET.IDENTIFY COST-SAVING OPPORTUNITIES AND OPTIMIZE RESOURCE ALLOCATION FOR MAXIMUM EFFICIENCY.USER SUPPORT AND TRAINING:OVERSEE IT SUPPORT FUNCTIONS, ENSURING TIMELY RESOLUTION OF END-USER ISSUES.DEVELOP AND IMPLEMENT TRAINING PROGRAMS TO ENHANCE THE TECHNOLOGY SKILLS OF STAFF.COLLABORATION AND COMMUNICATION:COLLABORATE WITH DEPARTMENT HEADS TO UNDERSTAND TECHNOLOGY NEEDS AND ENSURE IT SOLUTIONS ALIGN WITH BUSINESS OBJECTIVES.COMMUNICATE EFFECTIVELY WITH STAKEHOLDERS, PROVIDING UPDATES ON IT PROJECTS AND INITIATIVES.QUALIFICATIONS:BACHELOR'S DEGREE IN INFORMATION TECHNOLOGY, OR A RELATED FIELD; MASTER'S DEGREE PREFERRED.PROVEN EXPERIENCE IN A LEADERSHIP ROLE WITHIN IT, WITH A STRONG UNDERSTANDING OF TECHNOLOGY TRENDS.SOLID PROJECT MANAGEMENT SKILLS AND EXPERIENCE OVERSEEING COMPLEX IT PROJECTS.DEMONSTRATED ABILITY TO DEVELOP AND IMPLEMENT IT STRATEGIES ALIGNED WITH BUSINESS OBJECTIVES.STRONG KNOWLEDGE OF IT INFRASTRUCTURE, SECURITY, AND COMPLIANCE.EXCELLENT COMMUNICATION, INTERPERSONAL, AND PROBLEM-SOLVING SKILLS.ABILITY TO COLLABORATE EFFECTIVELY WITH BUSINESS UNITSRELEVANT CERTIFICATIONS (E.G., PMP, ITIL, CISSP ) ARE A PLUS.TECHNOLOGIES:OFFICE 365 / AZURE / ACTIVE DIRECTORY / SHAREPOINTVMWARE / VEEAMFORTINET EDR / SIEMCISCO IOS / MERAKIMIMECASTSD-WAN / ZTNA / MPLS / SIP",
    "job_skill_set": [
      "project management",
      "cybersecurity",
      "Office 365",
      "leadership",
      "strategic thinking",
      "communication",
      "collaboration",
      "problem solving",
      "mentoring",
      "interpersonal skills",
      "team management",
      "user support",
      "training development",
      "IT management",
      "IT infrastructure",
      "budget management",
      "Azure",
      "Active Directory",
      "SharePoint",
      "VMware",
      "Veeam",
      "Fortinet EDR",
      "Cisco IOS",
      "MIMECAST",
      "SD-WAN",
      "ZTNA",
      "MPLS",
      "SIP",
      "PMP",
      "ITIL",
      "CISSP"
    ],
    "short_keywords": [
      "365",
      "active",
      "azure",
      "budget",
      "cisco",
      "cissp",
      "collaboration",
      "communication",
      "cybersecurity",
      "development",
      "directory",
      "edr",
      "fortinet",
      "information",
      "informationtechnology",
      "infrastructure",
      "interpersonal",
      "ios",
      "it",
      "itil",
      "leadership",
      "management",
      "manager",
      "mentoring",
      "mimecast",
      "mpls",
      "office",
      "pmp",
      "problem",
      "project",
      "sdwan",
      "sharepoint",
      "sip",
      "skills",
      "solving",
      "strategic",
      "support",
      "team",
      "technology",
      "thinking",
      "training",
      "user",
      "veeam",
      "vmware",
      "ztna"
    ]
  },
  {
    "job_id": "3904098244",
    "job_title": "Information Technology Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "YOUR ROLEARE YOU KNOWN FOR YOUR TECHNOLOGY SKILLS? IF SO, WE HAVE AN OPPORTUNITY THAT WOULD ALLOW YOU TO BE THE PRIMARY ON-SITE IT POINT OF CONTACT WITH INTERNAL/EXTERNAL CUSTOMERS, SALES, QUALITY AND OTHER TEAMS AS APPROPRIATE.  WHAT ARE YOU GOING TO DO?SERVE AS THE PRIMARY, ON-SITE IT POINT OF CONTACT WITH GROUPS, SUCH AS INTERNAL/EXTERNAL CUSTOMER, SALES, QUALITY, AND OTHER TEAMS AS APPROPRIATE. COVERAGE MAY INCLUDE 24X7 SUPPORT OF THE OPERATION.ASSIST WITH THE ANALYSIS, DEFINITION AND DOCUMENTATION OF DETAILED SPECIFICATIONS FOR NEW & EXISTING APPLICATIONS IN COMPLIANCE WITH CEVA IT ISO METHODOLOGIES.ASSIST WITH SYSTEM MAINTENANCE, CONFIGURATIONS, AND INSTALLATION OF VARIOUS HARDWARE TECHNOLOGIES & SOFTWARE PRODUCTS.OPERATE & MAINTAIN CEVA COMPUTER SYSTEMS, INCLUDING BUT NOT LIMITED TO PCS, PRINTERS, RF EQUIPMENT, DATA COLLECTION DEVICES, ETC.MAINTAIN IT TRAINING MATERIALS AND WORK INSTRUCTIONS.TRAIN APPROPRIATE TEAM(S), AS REQUIRED.MAINTAIN PRIORITIZED IT TASK LIST AND COORDINATE WITH CEVA CORPORATE OFFICE TO ENSURE TASK RESOLUTION OCCURS.EFFECTIVELY IDENTIFY AND ESCALATE IT ISSUES AS APPROPRIATE.SERVE AS SME (SUBJECT MATTER EXPERT) FOR CEVA APPLICATION(S).PRO-ACTIVELY & CONTINUOUSLY SEEK TO IMPROVE THE HIGHEST LEVEL OF SERVICE FROM THE APPLICATION(S).LOG ALL APPROPRIATE IT PROBLEMS IN THE CEVA HELP DESK SYSTEM FOR TRACKING AND ANALYTICAL PURPOSES.PERFORM OTHER DUTIES, WHICH MAY INCLUDE OPERATIONAL ASSIGNMENTS, AS REQUIRED.THE ABOVE LIST OF ACCOUNTABILITIES IS NOT EXCLUSIVE OR EXHAUSTIVE AND IS NOT INTENDED AS A LIST OF INDIVIDUAL TASKS. THE ROLE HOLDER WILL BE REQUIRED TO UNDERTAKE SUCH TASKS AS MAY REASONABLY BE EXPECTED COMMENSURATE WITH THE SCOPE AND GRADING OF THE ROLE. ROLE PROFILES SHOULD BE REGULARLY REVIEWED TO ENSURE THEY ARE AN ACCURATE REPRESENTATION OF THE ROLE. WHAT ARE WE LOOKING FOR?BACHELOR’S DEGREE PREFERRED.COMPUTER OPERATIONS EXPERIENCE IS A PLUS2+ YEARS EXPERIENCE WITH LOGISTICS APPLICATIONS (EX. TRANSPORTATION, WAREHOUSING, CROSS DOCK, SEQUENCING, ETC).KNOWLEDGE OF MS PROJECT, WORK, EXCEL, VISIO, ETC.DEMONSTRATE SUCCESSFUL PROBLEM SOLVING SKILLS.ABILITY TO SUCCESSFULLY MULTI-TASK AND ESTABLISH APPROPRIATE PRIORITIES.ABILITY TO EFFECTIVELY PARTICIPATE AS A TEAM PLAYEREXCELLENT FOLLOW-UP SKILLS. POSITIVE & PROFESSIONAL ATTITUDE IN STRESSFUL ENVIRONMENTS.SELF-MOTIVATED.INTERFACE EFFECTIVELY WITH CUSTOMERS OR OTHERS ASSOCIATED WITH THE PROJECT OR ASSIGNMENT.POSSESS EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS. AUTOMOTIVE EXPERIENCE IS A PLUS!  WHAT DO WE HAVE TO OFFER?WITH A GENUINE CULTURE OF RECOGNITION, WE WANT OUR EMPLOYEES TO GROW, DEVELOP AND BE PART OF OUR JOURNEY. WE OFFER A BENEFITS PACKAGE WITH A FOCUS ON YOUR WELLBEING. THIS INCLUDES COMPETITIVE PAID TIME OFF, 401(K), HEALTH INSURANCE AND AN EMPLOYEE BENEFITS PLATFORM THAT OFFERS DISCOUNTS ON GYM MEMBERSHIPS AND A DIVERSE RANGE OF RETAIL, TRAVEL, CAR AND HOSPITALITY BRANDS, INCLUDING IMPORTANT OFFERINGS LIKE PET INSURANCE. WE ARE A TEAM IN EVERY SENSE, AND WE SUPPORT EACH OTHER AND WORK COLLABORATIVELY TO ACHIEVE OUR GOALS TOGETHER. IT IS OUR GOAL THAT YOU WILL BE COMPENSATED FOR YOUR HARD WORK AND COMMITMENT, SO IF YOU’D LIKE TO WORK FOR ONE OF THE TOP LOGISTICS PROVIDERS IN THE WORLD THEN LET’S WORK TOGETHER TO HELP YOU FIND YOUR NEW ROLE. ABOUT TOMORROWWE VALUE YOUR PROFESSIONAL AND PERSONAL GROWTH. THAT’S WHY WE SHARE PLENTY OF CAREER OPPORTUNITIES FOR YOU TO THRIVE WITHIN CEVA. THIS ROLE CAN BE THE FIRST STEP ON YOUR CAREER PATH WITH US. YOU CAN STAY IN THE SAME JOB FAMILY, FIND A NEW FAMILY TO GROW IN (AN ALMOST LIMITLESS NUMBER OF OPTIONS) OR FIND YOUR OWN PATH. JOIN CEVA FOR A CHALLENGING AND REWARDING CAREER.",
    "job_skill_set": [
      "IT Support",
      "System Maintenance",
      "Hardware Installation",
      "Software Installation",
      "MS Project",
      "Help Desk Systems",
      "Problem Solving",
      "Multi-tasking",
      "Teamwork",
      "Communication",
      "Customer Interface",
      "Self-motivation",
      "Positive Attitude",
      "Logistics Applications",
      "MS Excel",
      "MS Word",
      "MS Visio",
      "Follow-up Skills"
    ],
    "short_keywords": [
      "applications",
      "attitude",
      "communication",
      "customer",
      "desk",
      "excel",
      "followup",
      "hardware",
      "help",
      "information",
      "informationtechnology",
      "installation",
      "interface",
      "it",
      "logistics",
      "maintenance",
      "ms",
      "multitasking",
      "positive",
      "problem",
      "project",
      "selfmotivation",
      "skills",
      "software",
      "solving",
      "specialist",
      "support",
      "system",
      "systems",
      "teamwork",
      "technology",
      "visio",
      "word"
    ]
  },
  {
    "job_id": "3900070536",
    "job_title": "Information Technology Administrator",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOB ROLE : IT ADMINISTRATORLOCATION : GREENFIELD, OHCONTRACT : W2\nJOB DESCRIPTION: \nLEAD THE INFORMATION TECHNOLOGY (IT) DEPARTMENT. THIS IS A SENIOR LEVEL IT SERVICES & SOLUTIONS ANALYST POSITION.PROVIDE SERVICES AND SUPPORT TO PLANT OPERATIONS MAXIMIZING AVAILABILITY, PERFORMANCE, AND EFFICIENCY. FOCUS ON COST-EFFECTIVE SOLUTIONS WITH A CONTINUOUS IMPROVEMENT MINDSET.\nASSISTS IN COORDINATING, DESIGNING, BUILDING, INTEGRATING, DEVELOPING, TESTING, AND DEPLOYING INFRASTRUCTURE AND/OR APPLICATION TECHNOLOGY SOLUTIONS. THIS JOB CAN ASSIST IN DELIVERING IT SERVICES FOR THE PHYSICAL NETWORK, SERVER APPLICATIONS, AND SOFTWARE, THROUGH A BROAD RANGE OF TASKS ASSOCIATED WITH EVENT MANAGEMENT, INCIDENT MANAGEMENT, REQUEST FULFILLMENT, ACCESS MANAGEMENT, PROBLEM MANAGEMENT, IT OPERATIONS CONTROLS, AND TECHNICAL MANAGEMENT.\nROLES & RESPONSIBILITIES:CONSULT WITH PLANT MANAGEMENT ON CONTINUOUS IMPROVEMENT IDEAS AND FULFILL REQUESTS.PROJECT MANAGEMENT OR KEY TEAM MEMBER OF PROJECTS TO DELIVER NEW INITIATIVES AND/OR SERVICE IMPROVEMENTS.DRIVE PROBLEM MANAGEMENT RESOLUTION AND PERMANENT CORRECTIVE ACTIONS.PROVIDES KEY PLANT IT CONTACT FOR INTERNAL AND EXTERNAL CUSTOMERS.ENSURES COMPANY IT ACTIVITIES ARE COMMUNICATED IN A TIMELY FASHION TO THE PLANT LEADERS.RESPONSIBLE FOR IT TASKS RELATED TO LAUNCHES AND COMMUNICATING UPDATES AT READINESS REVIEWS.THIS ROLE IS 100% ON SITE. ROLE MAY REQUIRE ''AFTER HOURS SUPPORT'' WHICH MAY BE ON SITE OR AT TIMES CAN BE REMOTE ACCESS.\nIT INFRASTRUCTURE & APPLICATIONS:RESPONSIBLE FOR THE DAILY OPERATIONS OF COMPUTER SYSTEMS INCLUDING BUT NOT LIMITED TO: LEVEL 1 INCIDENT MANAGEMENT; SUPPORT FOR HARDWARE, COMMUNICATIONS, NETWORKING, SOFTWARE AND SHOP-FLOOR SYSTEMS AT THE MANUFACTURING FACILITY; ESCALATE TO NEXT LEVEL SUPPORT TEAMS IF APPLICABLE; MONITOR EVENT MANAGEMENT AND ADMINISTRATION OF LOCAL IT INFRASTRUCTURE.MANAGE ACCESS TO IT SERVICES WHILE COMPLYING WITH SECURITY AND VULNERABILITY STANDARDS.ENSURE SYSTEM BACKUPS ARE CURRENT AND CAN BE RESTORED.SCHEDULE AND COORDINATE HARDWARE AND INFRASTRUCTURE INSTALLATION WITH CORPORATE AND 3RD PARTY SUPPLIERS.MAINTAIN DOCUMENTATION OF IT SERVICES, EQUIPMENT, AND PROCEDURES\nREQUIRED SKILLS EXPERIENCE & SKILLS:4 - 6 YEARS IT-RELATED EXPERIENCE (TO INCLUDE 2 YRS ADMIN/ LEADERSHIP EXPERIENCE.)STRONG COMMUNICATION, ANALYTICAL, PROJECT MANAGEMENT AND PROBLEM-SOLVING SKILLS.ABILITY TO DELEGATE AND TRACK MULTIPLE WORK STREAMS.DESIRE TO HAVE BROAD RESPONSIBILITIES AND WORK IN A FAST-PACED ENVIRONMENT.BASIC DATABASE KNOWLEDGE AND REPORT WRITING SKILLS.\nREQUIRED EDUCATION EDUCATION & TRAINING:MINIMUM OF AN ASSOCIATE OR TECHNICAL DEGREE IN IT-RELATED FIELD.TECHNICAL CERTIFICATIONS.CONTINUOUS IMPROVEMENT TRAINING.REQUIRED YEARS OF EXPERIENCE 4 - 6 YEARS IT-RELATED EXPERIENCE (TO INCLUDE 2 YRS ADMIN/ LEADERSHIP EXPERIENCE.)",
    "job_skill_set": [
      "IT infrastructure management",
      "incident management",
      "project management",
      "problem management",
      "networking",
      "hardware support",
      "software support",
      "database knowledge",
      "report writing",
      "technical certifications",
      "access management",
      "system backups",
      "documentation",
      "communication",
      "analytical skills",
      "problem-solving",
      "delegation",
      "time management",
      "adaptability",
      "team collaboration",
      "customer service",
      "continuous improvement mindset",
      "event management"
    ],
    "short_keywords": [
      "access",
      "adaptability",
      "administrator",
      "analytical",
      "backups",
      "certifications",
      "collaboration",
      "communication",
      "continuous",
      "customer",
      "database",
      "delegation",
      "documentation",
      "event",
      "hardware",
      "improvement",
      "incident",
      "information",
      "informationtechnology",
      "infrastructure",
      "it",
      "knowledge",
      "management",
      "mindset",
      "networking",
      "problem",
      "problemsolving",
      "project",
      "report",
      "service",
      "skills",
      "software",
      "support",
      "system",
      "team",
      "technical",
      "technology",
      "time",
      "writing"
    ]
  },
  {
    "job_id": "3901941110",
    "job_title": "Information Technology Product Manager (15+ experience in Pharma)",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "\nROLE DESCRIPTIONTHIS IS A CONTRACT REMOTE ROLE FOR AN INFORMATION TECHNOLOGY PRODUCT MANAGER. THE PRODUCT MANAGER WILL BE RESPONSIBLE FOR ANALYZING BUSINESS REQUIREMENTS, MANAGING PRODUCT DEVELOPMENT AND DELIVERY, AND OPTIMIZING BUSINESS PROCESSES. THEY WILL COLLABORATE WITH CROSS-FUNCTIONAL TEAMS, CONDUCT MARKET RESEARCH, AND DEFINE PRODUCT STRATEGIES AND ROADMAPS. THE PRODUCT MANAGER WILL ALSO MONITOR PRODUCT PERFORMANCE, GATHER CUSTOMER FEEDBACK, AND MAKE DATA-DRIVEN DECISIONS TO ENSURE PRODUCT SUCCESS.\nQUALIFICATIONSANALYTICAL SKILLS AND INFORMATION TECHNOLOGY EXPERTISEEXPERIENCE IN PRODUCT MANAGEMENT AND BUSINESS REQUIREMENTS GATHERINGSTRONG UNDERSTANDING OF BUSINESS PROCESS OPTIMIZATIONEXCELLENT PROBLEM-SOLVING AND DECISION-MAKING ABILITIESABILITY TO EFFECTIVELY COMMUNICATE AND COLLABORATE WITH CROSS-FUNCTIONAL TEAMSEXPERIENCE WITH AGILE AND/OR SCRUM METHODOLOGIESKNOWLEDGE OF INDUSTRY TRENDS AND MARKET ANALYSISBACHELOR'S DEGREE IN INFORMATION TECHNOLOGY, BUSINESS ADMINISTRATION, OR RELATED FIELD",
    "job_skill_set": [
      "information technology expertise",
      "analytical skills",
      "problem solving",
      "communication",
      "decision making",
      "product management",
      "business requirements gathering",
      "business process optimization",
      "agile methodologies",
      "scrum methodologies",
      "market analysis",
      "data-driven decision making",
      "collaboration"
    ],
    "short_keywords": [
      "15",
      "agile",
      "analysis",
      "analytical",
      "business",
      "collaboration",
      "communication",
      "datadriven",
      "decision",
      "experience",
      "expertise",
      "gathering",
      "in",
      "information",
      "informationtechnology",
      "making",
      "management",
      "manager",
      "market",
      "methodologies",
      "optimization",
      "pharma",
      "problem",
      "process",
      "product",
      "requirements",
      "scrum",
      "skills",
      "solving",
      "technology"
    ]
  },
  {
    "job_id": "3905329095",
    "job_title": "Strategic Sourcing Manager: Cyber Defense & Engineering + Information Technology - USDS",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "RESPONSIBILITIES\n\n ABOUT TIKTOK U.S. DATA SECURITY\nTIKTOK IS THE LEADING DESTINATION FOR SHORT-FORM MOBILE VIDEO. OUR MISSION IS TO INSPIRE CREATIVITY AND BRING JOY. U.S. DATA SECURITY (“USDS”) IS A SUBSIDIARY OF TIKTOK IN THE U.S. THIS NEW, SECURITY-FIRST DIVISION WAS CREATED TO BRING HEIGHTENED FOCUS AND GOVERNANCE TO OUR DATA PROTECTION POLICIES AND CONTENT ASSURANCE PROTOCOLS TO KEEP U.S. USERS SAFE. OUR FOCUS IS ON PROVIDING OVERSIGHT AND PROTECTION OF THE TIKTOK PLATFORM AND U.S. USER DATA, SO MILLIONS OF AMERICANS CAN CONTINUE TURNING TO TIKTOK TO LEARN SOMETHING NEW, EARN A LIVING, EXPRESS THEMSELVES CREATIVELY, OR BE ENTERTAINED. THE TEAMS WITHIN USDS THAT DELIVER ON THIS COMMITMENT DAILY SPAN ACROSS TRUST & SAFETY, SECURITY & PRIVACY, ENGINEERING, USER & PRODUCT OPS, CORPORATE FUNCTIONS AND MORE.\n\nWHY JOIN US\nCREATION IS THE CORE OF TIKTOK'S PURPOSE. OUR PLATFORM IS BUILT TO HELP IMAGINATIONS THRIVE. THIS IS DOUBLY TRUE OF THE TEAMS THAT MAKE TIKTOK POSSIBLE. \nTOGETHER, WE INSPIRE CREATIVITY AND BRING JOY - A MISSION WE ALL BELIEVE IN AND AIM TOWARDS ACHIEVING EVERY DAY. \nTO US, EVERY CHALLENGE, NO MATTER HOW DIFFICULT, IS AN OPPORTUNITY; TO LEARN, TO INNOVATE, AND TO GROW AS ONE TEAM. STATUS QUO? NEVER. COURAGE? ALWAYS. \nAT TIKTOK, WE CREATE TOGETHER AND GROW TOGETHER. THAT'S HOW WE DRIVE IMPACT - FOR OURSELVES, OUR COMPANY, AND THE COMMUNITIES WE SERVE. \nJOIN US.\n\nTEAM INTRO\nWE ARE A PROGRESSIVE PROCUREMENT ORGANIZATION PUSHING THE BOUNDARIES OF TRADITIONAL PROCUREMENT REPUTATION AND METHODOLOGIES. WE ARE LOOKING FOR INDIVIDUALS WHO CAN THINK OUTSIDE THE BOX TO ACHIEVE COMPANY OBJECTIVES REGARDING VALUE AND PARTNERSHIPS WITH OUR SUPPLIERS. OUR ORGANIZATION MOVES QUICKLY, AND YOU MUST TOO. AS A STRATEGIC SOURCING MANAGER WITHIN THE TIKTOK U.S. DATA SECURITY PROCUREMENT GROUP, YOU WILL BE RESPONSIBLE FOR ESTABLISHING AND EXECUTING SOURCING STRATEGIES AND PLANS FOR OUR CYBER DEFENSE & ENGINEERING + INFORMATION TECHNOLOGY DEPARTMENT.\n\nIN ORDER TO ENHANCE COLLABORATION AND CROSS-FUNCTIONAL PARTNERSHIPS, AMONG OTHER THINGS, AT THIS TIME, OUR ORGANIZATION FOLLOWS A HYBRID WORK SCHEDULE THAT REQUIRES EMPLOYEES TO WORK IN THE OFFICE 3 DAYS A WEEK, OR AS DIRECTED BY THEIR MANAGER/DEPARTMENT. WE REGULARLY REVIEW OUR HYBRID WORK MODEL, AND THE SPECIFIC REQUIREMENTS MAY CHANGE AT ANY TIME.\n\nRESPONSIBILITIES\n-MANAGE THE CYBER DEFENSE & ENGINEERING AND INFORMATION TECHNOLOGY SOURCING PORTFOLIO (E.G., CLOUD SOFTWARE, INFRASTRUCTURE, NETWORK SECURITY HARDWARE / SOFTWARE, ETC.)\n- YOU WILL FOCUS ON DRIVING ADOPTION AND EFFICIENT USE OF THE SOURCE-TO-PAY PROCESS THROUGH SYSTEM OPTIMIZATION AND PROACTIVE PARTNER OUTREACH ALONG WITH SOURCING MANAGEMENT, CONTRACT MANAGEMENT, AND NEGOTIATION SUPPORT WHERE APPLICABLE.\n- ESTABLISH AND MAINTAIN EFFECTIVE RELATIONSHIPS WITH BUSINESS UNITS AND INTERNAL SUPPORT ORGANIZATIONS ,AND EXTERNALLY WITH SUPPLIERS.\n- ESTABLISH SERVICE LEVEL AGREEMENTS WITH INTERNAL CUSTOMERS AND KEY PERFORMANCE INDICATORS FOR THE ORGANIZATION TO MEET ANNUAL OBJECTIVES AND LONG-TERM STRATEGIES.\n- DEFINE PROCESSES, DEVELOP PROCUREMENT POLICIES, AND CONTRIBUTE TO DIGITAL TRANSFORMATION INITIATIVES.\n- CONDUCT THOROUGH RESEARCH AND ANALYSIS TO IDENTIFY POTENTIAL CYBER DEFENSE & ENGINEERING AND INFORMATION TECHNOLOGY VENDORS THAT ALIGN WITH THE ORGANIZATION'S NEEDS AND STRATEGIC OBJECTIVES.\n- DEVELOP AND MANAGE REQUESTS FOR PROPOSALS, QUOTES, AND INFORMATION.\n- COLLABORATE WITH LEGAL AND PROCUREMENT TEAMS TO DEVELOP AND NEGOTIATE ALL DEPARTMENT VENDOR CONTRACTS, ENSURING OPTIMAL VALUE AND FAVORABLE TERMS, SERVICE LEVEL AGREEMENTS (SLAS), AND COST STRUCTURES THAT ALIGN WITH DEPARTMENT OBJECTIVES\n- PREPARE ALL EXECUTIVE SUMMARIES AND BUSINESS CASES FOR REVIEW AND MANAGEMENT APPROVAL.\n- WORK CLOSELY WITH FINANCE AND PROCUREMENT TEAMS TO ESTABLISH AND MANAGE DEPARTMENT SPEND BUDGETS EFFECTIVELY.\n- BENCHMARK SPEND, RFP DATA AND RETURN ON INVESTMENT.\n- OPTIMIZE VENDOR SPENDING FOR THE DEPARTMENT TO ACHIEVE COST SAVINGS WITHOUT COMPROMISING ON QUALITY. \n\nQUALIFICATIONS\n\n MINIMUM QUALIFICATIONS\n- EXCELLENT TIME MANAGEMENT AND NEGOTIATION SKILLS, A DEEP UNDERSTANDING OF STANDARD CYBER DEFENSE & ENGINEERING AND INFORMATION TECHNOLOGY TRENDS AND EMERGING TECHNOLOGIES, AND A PROVEN TRACK RECORD OF SUCCESSFUL VENDOR MANAGEMENT.\n- BACHELOR'S DEGREE IN BUSINESS, CYBER DEFENSE & ENGINEERING, INFORMATION TECHNOLOGY AND / OR A RELATED FIELD.\n- PROVEN EXPERIENCE AS A VENDOR MANAGER, CYBERSECURITY AND / OR IT PROCUREMENT MANAGER, STRATEGIC SOURCING MANAGER, OR A RELATED ROLE WITHIN THE INDUSTRY.\n- DEMONSTRATED ABILITY TO MANAGE MULTIPLE VENDORS AND COMPLEX CONTRACTS SIMULTANEOUSLY.\n- WILLING TO TRAVEL DOMESTICALLY 2-3 TIMES PER QUARTER AS STAKEHOLDERS ARE DISTRIBUTED ACROSS THE COUNTRY.\n\nPREFERRED QUALIFICATIONS\n- KNOWLEDGE OF CONTRACT MANAGEMENT PRINCIPLES AND BEST PRACTICES.\n- FAMILIARITY WITH RISK ASSESSMENT AND MITIGATION STRATEGIES IN VENDOR MANAGEMENT.\n- STRONG ORGANIZATIONAL AND TIME MANAGEMENT SKILLS.\n\n\nD&I STATEMENT\nTIKTOK IS COMMITTED TO CREATING AN INCLUSIVE SPACE WHERE EMPLOYEES ARE VALUED FOR THEIR SKILLS, EXPERIENCES, AND UNIQUE PERSPECTIVES. OUR PLATFORM CONNECTS PEOPLE FROM ACROSS THE GLOBE AND SO DOES OUR WORKPLACE. AT TIKTOK, OUR MISSION IS TO INSPIRE CREATIVITY AND BRING JOY. TO ACHIEVE THAT GOAL, WE ARE COMMITTED TO CELEBRATING OUR DIVERSE VOICES AND TO CREATING AN ENVIRONMENT THAT REFLECTS THE MANY COMMUNITIES WE REACH. WE ARE PASSIONATE ABOUT THIS AND HOPE YOU ARE TOO.\n\nACCOMMODATION STATEMENT\nTIKTOK IS COMMITTED TO PROVIDING REASONABLE ACCOMMODATIONS IN OUR RECRUITMENT PROCESSES FOR CANDIDATES WITH DISABILITIES, PREGNANCY, SINCERELY HELD RELIGIOUS BELIEFS OR OTHER REASONS PROTECTED BY APPLICABLE LAWS. IF YOU NEED ASSISTANCE OR A REASONABLE ACCOMMODATION, PLEASE REACH OUT TO US AT HTTPS://SHORTURL.AT/KTJP6\n\nDATA SECURITY STATEMENT\nTHIS ROLE REQUIRES THE ABILITY TO WORK WITH AND SUPPORT SYSTEMS DESIGNED TO PROTECT SENSITIVE DATA AND INFORMATION. AS SUCH, THIS ROLE WILL BE SUBJECT TO STRICT NATIONAL SECURITY-RELATED SCREENING. \n\nJOB INFORMATION:\n\n【FOR PAY TRANSPARENCY】COMPENSATION DESCRIPTION (ANNUALLY) THE BASE SALARY RANGE FOR THIS POSITION IN THE SELECTED CITY IS $96600 - $172400 ANNUALLY.COMPENSATION MAY VARY OUTSIDE OF THIS RANGE DEPENDING ON A NUMBER OF FACTORS, INCLUDING A CANDIDATE’S QUALIFICATIONS, SKILLS, COMPETENCIES AND EXPERIENCE, AND LOCATION. BASE PAY IS ONE PART OF THE TOTAL PACKAGE THAT IS PROVIDED TO COMPENSATE AND RECOGNIZE EMPLOYEES FOR THEIR WORK, AND THIS ROLE MAY BE ELIGIBLE FOR ADDITIONAL DISCRETIONARY BONUSES/INCENTIVES, AND RESTRICTED STOCK UNITS.OUR COMPANY BENEFITS ARE DESIGNED TO CONVEY COMPANY CULTURE AND VALUES, TO CREATE AN EFFICIENT AND INSPIRING WORK ENVIRONMENT, AND TO SUPPORT OUR EMPLOYEES TO GIVE THEIR BEST IN BOTH WORK AND LIFE. WE OFFER THE FOLLOWING BENEFITS TO ELIGIBLE EMPLOYEES: WE COVER 100% PREMIUM COVERAGE FOR EMPLOYEE MEDICAL INSURANCE, APPROXIMATELY 75% PREMIUM COVERAGE FOR DEPENDENTS AND OFFER A HEALTH SAVINGS ACCOUNT(HSA) WITH A COMPANY MATCH. AS WELL AS DENTAL, VISION, SHORT/LONG TERM DISABILITY, BASIC LIFE, VOLUNTARY LIFE AND AD&D INSURANCE PLANS. IN ADDITION TO FLEXIBLE SPENDING ACCOUNT(FSA) OPTIONS LIKE HEALTH CARE, LIMITED PURPOSE AND DEPENDENT CARE. OUR TIME OFF AND LEAVE PLANS ARE: 10 PAID HOLIDAYS PER YEAR PLUS 17 DAYS OF PAID PERSONAL TIME OFF (PPTO) (PRORATED UPON HIRE AND INCREASED BY TENURE) AND 10 PAID SICK DAYS PER YEAR AS WELL AS 12 WEEKS OF PAID PARENTAL LEAVE AND 8 WEEKS OF PAID SUPPLEMENTAL DISABILITY. WE ALSO PROVIDE GENEROUS BENEFITS LIKE MENTAL AND EMOTIONAL HEALTH BENEFITS THROUGH OUR EAP AND LYRA. A 401K COMPANY MATCH, GYM AND CELLPHONE SERVICE REIMBURSEMENTS. THE COMPANY RESERVES THE RIGHT TO MODIFY OR CHANGE THESE BENEFITS PROGRAMS AT ANY TIME, WITH OR WITHOUT NOTICE.",
    "job_skill_set": [
      "information technology",
      "vendor management",
      "contract management",
      "negotiation",
      "data analysis",
      "cloud software",
      "network security",
      "budget management",
      "digital transformation",
      "time management",
      "collaboration",
      "problem solving",
      "communication",
      "organizational skills",
      "adaptability",
      "strategic thinking",
      "cyber defense",
      "procurement policies",
      "RFP management",
      "creativity"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "budget",
      "cloud",
      "collaboration",
      "communication",
      "contract",
      "creativity",
      "cyber",
      "data",
      "defense",
      "digital",
      "engineering",
      "information",
      "informationtechnology",
      "management",
      "manager",
      "negotiation",
      "network",
      "organizational",
      "policies",
      "problem",
      "procurement",
      "rfp",
      "security",
      "skills",
      "software",
      "solving",
      "sourcing",
      "strategic",
      "technology",
      "thinking",
      "time",
      "transformation",
      "usds",
      "vendor"
    ]
  },
  {
    "job_id": "3901674413",
    "job_title": "Senior Information Technology Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "IN A FAST-PACED FACTORY ENVIRONMENT, THE IT SYSTEM ADMINISTRATOR PLAYS A VITAL ROLE IN MAINTAINING, OPTIMIZING, AND SECURING OUR INFORMATION TECHNOLOGY INFRASTRUCTURE. THIS MULTIFACETED ROLE REQUIRES EXPERTISE IN MICROSOFT ENVIRONMENTS, IBM ISERIES, VMWARE, NETWORK MANAGEMENT WITH HP SWITCHES AND CISCO FIREWALL, AND RESPONSIVE DESKTOP SUPPORT. ADDITIONALLY, YOU WILL WORK COLLABORATIVELY WITH DEVELOPERS TO ENSURE THE SEAMLESS OPERATION OF IT SYSTEMS SUPPORTING FACTORY OPERATIONS.\n\nESSENTIAL DUTIES AND RESPONSIBILITIES - INCLUDE THE FOLLOWING.\nADMINISTER AND MAINTAIN SERVERS IN MICROSOFT (WINDOWS SERVER) AND LINUX ENVIRONMENTS.MANAGE AND MAINTAIN IBM ISERIES SERVERS, INCLUDING SYSTEM UPGRADES AND PERFORMANCE OPTIMIZATION.CONFIGURE AND MANAGE VMWARE VIRTUALIZATION INFRASTRUCTURE, ENSURING EFFICIENT VM PROVISIONING AND RESOURCE ALLOCATION.IMPLEMENT AND MAINTAIN ACTIVE DIRECTORY, DNS, DHCP, GROUP POLICY, AND OTHER CORE SERVICES.PERFORM REGULAR SYSTEM BACKUPS, DATA INTEGRITY CHECKS, AND DISASTER RECOVERY PLANNING.MONITOR SYSTEM PERFORMANCE, RESPOND TO ALERTS, AND TROUBLESHOOT SERVER-RELATED ISSUES.ADMINISTER AND MAINTAIN NETWORK INFRASTRUCTURE, INCLUDING HP SWITCHES AND CISCO FIREWALL.CONFIGURE, OPTIMIZE, AND SECURE NETWORK DEVICES TO SUPPORT FACTORY OPERATIONS.MONITOR NETWORK TRAFFIC, IDENTIFY AND RESOLVE NETWORK-RELATED ISSUES PROACTIVELY.IMPLEMENT ROBUST NETWORK SECURITY MEASURES TO PROTECT AGAINST UNAUTHORIZED ACCESS AND THREATS.COLLABORATE WITH THIRD-PARTY VENDORS FOR NETWORK-RELATED SERVICES AND SOLUTIONS.PROVIDE RAPID-RESPONSE DESKTOP SUPPORT FOR HARDWARE AND SOFTWARE ISSUES IN A FACTORY SETTING.INSTALL, CONFIGURE, AND MAINTAIN DESKTOP COMPUTERS, LAPTOPS, RUGGEDIZED DEVICES, AND PERIPHERALS.TROUBLESHOOT AND RESOLVE DESKTOP-RELATED PROBLEMS, INCLUDING OPERATING SYSTEM AND APPLICATION ISSUES.COLLABORATE WITH DEVELOPERS TO ENSURE COMPATIBILITY AND SUPPORT FOR SPECIALIZED DEVELOPMENT ENVIRONMENTS.ENSURE CONTINUOUS AVAILABILITY OF CRITICAL FACTORY SYSTEMS AND MINIMIZE DOWNTIME.COLLABORATION WITH DEVELOPERS:WORK CLOSELY WITH SOFTWARE DEVELOPERS TO ENSURE SEAMLESS INTEGRATION OF FACTORY SYSTEMS AND DEVELOPMENT PROJECTS.PROVIDE SUPPORT FOR DEVELOPMENT ENVIRONMENTS, INCLUDING VERSION CONTROL SYSTEMS, BUILD TOOLS, AND TESTING ENVIRONMENTS.COLLABORATE ON INFRASTRUCTURE REQUIREMENTS FOR NEW SOFTWARE APPLICATIONS AND PROJECTS.ENSURE THE AVAILABILITY AND PERFORMANCE OF DEVELOPMENT AND TESTING SYSTEMS.TROUBLESHOOT ISSUES RELATED TO SOFTWARE DEVELOPMENT AND DEPLOYMENT.DOCUMENTATION AND TRAINING:MAINTAIN COMPREHENSIVE DOCUMENTATION OF IT SYSTEMS, CONFIGURATION, AND TROUBLESHOOTING PROCEDURE.CONDUCT TRAINING SESSIONS FOR FACTORY PERSONNEL AND DEVELOPERS TO ENHANCE IT AWARENESS AND ADHERENCE TO BEST PRACTICES.COLLABORATE WITH THE IT TEAM AND DEVELOPER TO DEVELOP AND UPDATE IT-RELATED DOCUMENTATION AND POLICIES.OTHER DUTIES MAY BE ASSIGNED.\nEDUCATION AND/OR EXPERIENCEBACHELOR DEGREE (BS) IN COMPUTER SCIENCE, INFORMATION TECHNOLOGY, OR A RELATED FIELD REQUIRED. 5-7 YEARS OF PROVEN EXPERIENCE IN IT SYSTEM ADMINISTRATION, DESKTOP SUPPORT, AND NETWORK MANAGEMENT REQUIRED. RELATED IT CERTIFICATIONS PREFERRED.\nPROFICIENCY IN MICROSOFT WINDOWS SERVER, IBM ISERIES, LINUX, VMWARE, MS OFFICE MANAGEMENT, MS EXCHANGE.STRONG KNOWLEDGE OF VLANS AND ROUTING.\nKNOWLEDGE OF KANBAN PRODUCTION FLOOR SYSTEMS PREFERRED.KNOWLEDGE OR EXPERIENCE WITH MICROSOFT GREAT PLAINS PREFERRED.\nLANGUAGE SKILLSSTRONG COMMUNICATION AND INTERPERSONAL SKILLS, ESPECIALLY IN A FACTORY ENVIRONMENT WITH DIVERSE STAKEHOLDER REQUIRED. ABILITY TO WRITE REPORTS, BUSINESS CORRESPONDENCE, AND PROCEDURE MANUALS. ABILITY TO EFFECTIVELY PRESENT INFORMATION AND RESPOND TO QUESTIONS FROM MANAGERS AND CONTRACTORS. FLUENT IN ENGLISH.\nMATHEMATICAL SKILLSABILITY TO APPLY ADVANCED MATHEMATICAL AND STATISTICAL CONCEPTS AND FORMULAS IN ALL UNITS OF MEASURE IS REQUIRED.\nREASONING ABILITYEXCELLENT PROBLEM-SOLVING SKILLS, ADAPTABILITY AND ABILITY TO WORK EFFECTIVELY UNDER PRESSURE. ABILITY TO SOLVE PROBLEMS AND DEAL WITH A VARIETY OF VARIABLES IN SITUATIONS WHERE ONLY LIMITED INFORMATION EXISTS. ABILITY TO INTERPRET A TECHNICAL SPECIFICATION FURNISHED IN WRITTEN, ORAL, DIAGRAM, OR SCHEDULE FORM.\nPHYSICAL DEMANDSTHE PHYSICAL DEMANDS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY A TEAM MEMBER TO SUCCESSFULLY PERFORM THE ESSENTIAL FUNCTIONS OF THIS JOB. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS.\nWHILE PERFORMING THE DUTIES OF THIS JOB, THE TEAM MEMBER IS REGULARLY REQUIRED TO:TALK OR HEAR.STAND, WALK, BEND, LIFT, TWIST AND USE HANDSOCCASIONALLY REQUIRED TO STOOP, KNEEL, CROUCH, CRAWL OR SMELL.MUST OCCASIONALLY LIFT AND/OR MOVE UP TO 50 POUNDS.",
    "job_skill_set": [
      "Network Management",
      "Communication",
      "Interpersonal Skills",
      "Problem Solving",
      "Adaptability",
      "Ability to Work Under Pressure",
      "Documentation",
      "Collaboration",
      "Microsoft Windows Server",
      "IBM iSeries",
      "Linux",
      "VMware",
      "HP Switches",
      "Cisco Firewall",
      "Active Directory",
      "DNS",
      "DHCP",
      "Group Policy",
      "Data Integrity Checks",
      "Disaster Recovery Planning",
      "Desktop Support",
      "Version Control Systems",
      "Kanban Production Floor Systems",
      "Microsoft Great Plains",
      "Training"
    ],
    "short_keywords": [
      "ability",
      "active",
      "adaptability",
      "checks",
      "cisco",
      "collaboration",
      "communication",
      "control",
      "data",
      "desktop",
      "dhcp",
      "directory",
      "disaster",
      "dns",
      "documentation",
      "firewall",
      "floor",
      "great",
      "group",
      "hp",
      "ibm",
      "information",
      "informationtechnology",
      "integrity",
      "interpersonal",
      "iseries",
      "kanban",
      "linux",
      "management",
      "microsoft",
      "network",
      "plains",
      "planning",
      "policy",
      "pressure",
      "problem",
      "production",
      "recovery",
      "senior",
      "server",
      "skills",
      "solving",
      "specialist",
      "support",
      "switches",
      "systems",
      "technology",
      "to",
      "training",
      "under",
      "version",
      "vmware",
      "windows",
      "work"
    ]
  },
  {
    "job_id": "3902876526",
    "job_title": "Information Technology Specialist II",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "POSITION NUMBER: 270-701-1414-XXX\nJOB CONTROL NUMBER: 427796\nTHE CALIFORNIA STUDENT AID COMMISSION (CSAC) IS SEEKING AN INFORMATION TECHNOLOGY (IT) SPECIALIST II. IN THIS ROLE, FUNCTIONS AS A SENIOR FULL STACK DEVELOPER, FOR CSAC’S APPLICATION SERVICES SECTION UNDER THE ITSD PRODUCTION BRANCH, BY PROVIDING LEADERSHIP AND EXPERTISE INDEPENDENTLY, WITH A TEAM, OR LEADING A TEAM. YOU WILL STRATEGIZE AND FORMULATE ARCHITECTURE SOLUTIONS AND POLICIES FOR CSAC. ACT AS AN EXPERT AND LEAD WORKING ON THE IT APPLICATION SUPPORT, LEADING APPLICATION DEVELOPMENT AND MAINTENANCE OF COMPLEX APPLICATIONS. ENSURING THEY OPERATE AND DELIVER THE EXPECTED FUNCTIONALITIES AND MEET THE REQUIREMENTS FOR CSAC’S BUSINESS.\nYOU ARE A FULL STACK DEVELOPER WITH WORKING EXPERIENCE USING ORACLE PL/SQL, ANGULAR UI, JAVA, AND SPRING BOOT. THE FOLLOWING BULLET POINTS DESCRIBE YOU:\nYOU HAVE EXTENSIVE EXPERIENCE WORKING ON ORACLE PL/SQL, SQL, DDL AND DML.YOU HAVE EXPERIENCE DEVELOPING SCALABLE, OPTIMIZED APPLICATIONS FOR ORACLE DATABASES.YOU HAVE DEVOPS EXPERIENCE WITH GITHUB, JENKINS, VISUAL STUDIO, AND TFS.YOU HAVE EXPERIENCE WITH OBJECT ORIENTED FRAMEWORKS AND WORKING WITH JAVA AND ANGULAR.YOU HAVE IDENTITY MANAGEMENT AND API MANAGER EXPERIENCE ON PRODUCTS LIKE WSO2.YOU HAVE EXPERIENCE WORKING IN AN AGILE ENVIRONMENT.YOU HAVE A GOOD UNDERSTANDING OF SOA, MICROSERVICE ARCHITECTURE AND API'S.YOU HAVE UNIT AND SYSTEM TESTING EXPERIENCE.YOU HAVE EXPERIENCE WITH THE SERVICE NOW TICKETING SYSTEM.YOU UNDERSTAND AND CAN CREATE DESIGN DOCUMENTS SUCH AS DATA MODELING AND UML DIAGRAMS.YOU HAVE STRONG ORGANIZATIONAL AND PLANNING SKILLS, INCLUDING THE ABILITY TO MULTI-TASK AND ADJUST TO CHANGING PRIORITIES, WORK UNDER PRESSURE, MEET DEADLINES, IN A FAST-PACED AND SMALL-TEAM ATMOSPHERE.\nWHAT YOU’LL DO:PERFORMS A VARIETY OF TASKS RELATED TO THE ANALYSIS, DESIGN, DEVELOPMENT, TESTING, IMPLEMENTATION, AND MAINTENANCE OF INFORMATION TECHNOLOGY SERVICES FOR CSAC.INTERACT WITH DIVERSE TECHNICAL AND NON-TECHNICAL GROUPS, SPANNING ALL ORGANIZATIONAL LEVELS.MANAGE MULTIPLE PROJECTS WITH COMPETING PRIORITIES SIMULTANEOUSLY.PLAN AND PRIORITIZE WORK ASSIGNMENTS TO MEET SCHEDULED RELEASES.\nFOR THE OFFICIAL JOB POSTING AND APPLICATION INSTRUCTIONS, PLEASE CLICK ON THE \"APPLY\" BUTTON.",
    "job_skill_set": [
      "Leadership",
      "Organizational Skills",
      "Planning Skills",
      "Multi-tasking",
      "Adaptability",
      "Communication",
      "Problem Solving",
      "Time Management",
      "Oracle PL/SQL",
      "Java",
      "Angular UI",
      "Spring Boot",
      "SQL",
      "DevOps",
      "GitHub",
      "Jenkins",
      "Visual Studio",
      "TFS",
      "API Management",
      "WSO2",
      "Agile",
      "SOA",
      "Microservices",
      "Unit Testing",
      "System Testing",
      "ServiceNow",
      "Data Modeling",
      "UML Diagrams"
    ],
    "short_keywords": [
      "adaptability",
      "agile",
      "angular",
      "api",
      "boot",
      "communication",
      "data",
      "devops",
      "diagrams",
      "github",
      "ii",
      "information",
      "informationtechnology",
      "java",
      "jenkins",
      "leadership",
      "management",
      "microservices",
      "modeling",
      "multitasking",
      "oracle",
      "organizational",
      "planning",
      "plsql",
      "problem",
      "servicenow",
      "skills",
      "soa",
      "solving",
      "specialist",
      "spring",
      "sql",
      "studio",
      "system",
      "technology",
      "testing",
      "tfs",
      "time",
      "ui",
      "uml",
      "unit",
      "visual",
      "wso2"
    ]
  },
  {
    "job_id": "3902861423",
    "job_title": "Information Technology Programmer",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "SUMMARY: THE REPORTING ANALYST/PROGRAMMER’S ROLE IS TO STRATEGICALLY DESIGN AND IMPLEMENT REPORTING SOFTWARE AND SYSTEMS, INCLUDING CODING REPORTS, INTEGRATION WITH DATABASES, GATHER AND MAINTAIN A WIDE ARRAY OF DATA-RELATED BUSINESS PROCESSES AND REPORTING. THIS INCLUDES SELECTING, BLUEPRINTING, GATHERING REQUIREMENTS, DESIGNING AND ROLLING OUT SOLUTIONS TO END USERS. THE ANALYST/PROGRAMMER IS ALSO RESPONSIBLE FOR ENSURING HIGH LEVELS OF AVAILABILITY THROUGH SUPPORT FUNCTIONS AND IN-DEPTH TESTING. PRIMARY RESPONSIBILITIES:CODE, TEST AND DOCUMENT ALL NEW OR MODIFIED BI AND REPORTING NEED, APPLICATIONS AND PROGRAMS.DEVELOP GRAPHS AND PORTAL INTERFACES.LEVERAGE SQL DATABASE TO DESIGN, DEVELOP, AND MAINTAIN SCALABLE REPORTS, DASHBOARDS, AND METRICSPOWER BI DEVELOPMENT AND ADMINISTRATIONCOLLECTING AND INTERPRETING DATAABILITY TO WRITE COMPREHENSIVE REPORTSDELIVER END-USER TRAINING AND TRAINING MATERIALS; PROVIDE TECHNICAL SUPPORT AS NEEDED.KEEP CURRENT WITH BUSINESS INTELLIGENCE DATA TRENDS AND TECHNOLOGICAL INNOVATIONSQUALIFICATIONS:BACHELOR’S DEGREE REQUIRED WITH A PREFERENCE FOR DEGREES IN COMPUTER SCIENCE, MANAGEMENT INFORMATION SYSTEMS, OR RELATED DISCIPLINE 3 YEARS OF PROGRAMMING/DEVELOPMENT EXPERIENCE PREFERRED.2 YEARS OF EXPERIENCE WITH CREATING AND MAINTAINING POWER BIEXTENSIVE EXPERIENCE DEVELOPING AND DEPLOYING REPORTS, DASHBOARDS, AND METRICS STRONG KNOWLEDGE OF SQL (INCLUDING ABILITY TO WRITE SELECT STATEMENTS AND GROUP BY STATEMENTS, CREATE STORED PROCEDURES) KNOWLEDGE OF DAX QUERIESABILITY TO PERFORM CRITICAL THINKING IN THE AREA OF DATA ANALYSIS WITH ADVANCED ANALYTICAL SKILLS ABILITY TO CONSOLIDATE DATA FINDINGS INTO A PRESENTABLE AND USER FRIENDLY REPORT TO THE BUSINESSEXPERIENCE DEVELOPING WITH C# AND VBA IS A PLUSEXCELLENT EXCEL AND RELATIONAL DATABASE SKILLS.COMMITMENT TO ENSURING DATA QUALITY AND ACCURACY AND ATTENTION TO DETAIL",
    "job_skill_set": [
      "SQL",
      "Data Analysis",
      "Excel",
      "Database Management",
      "Critical Thinking",
      "Attention to Detail",
      "Technical Support",
      "Training Skills",
      "Communication",
      "Problem Solving",
      "Power BI",
      "C#",
      "VBA",
      "DAX Queries",
      "Report Development",
      "Dashboard Development"
    ],
    "short_keywords": [
      "analysis",
      "attention",
      "bi",
      "c",
      "communication",
      "critical",
      "dashboard",
      "data",
      "database",
      "dax",
      "detail",
      "development",
      "excel",
      "information",
      "informationtechnology",
      "management",
      "power",
      "problem",
      "programmer",
      "queries",
      "report",
      "skills",
      "solving",
      "sql",
      "support",
      "technical",
      "technology",
      "thinking",
      "to",
      "training",
      "vba"
    ]
  },
  {
    "job_id": "3889760181",
    "job_title": "Information Technology Project Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "BRICKHOUSE RESOURCES IS CURRENTLY SEEKING A CERTIFIED PROJECT MANAGER FOR A ROLE IN THE BANKING INDUSTRY. **NO SUBVENDORS/THIRD PARTIES, NO C2C**\nJOB TITLE: IT PROJECT MANAGER (MUST BE PMP CERTIFIED)JOB LOCATION: ATLANTA, GA 30309 (MID-TOWN AREA)WORK SCHEDULE:  HYBRID, 2 DAYS IN OFFICE 3 DAYS REMOTE (LOCAL CANDIDATES ONLY)JOB TYPE: LONG-TERM CONTRACTREQUIREMENT: MUST BE PMP CERTIFIED AND CERTIFICATION MUST BE CURRENT AND ACTIVE\nBANKING CLIENT IS LOOKING FOR AN IT PROJECT MANAGER TO SUPPORT ENTERPRISE LEVEL IT AND BUSINESS PROJECTS. IN THIS ROLE YOU WILL BE ON A SMALL PMO TEAM WORKING CLOSELY WITH BUSINESS EXECUTIVES, STAKEHOLDERS, AND THE TECHNOLOGY TEAM.\nRESPONSIBILITIES WILL INCLUDE:CREATE PROJECT PLANS WITH MS PROJECTINITIATING AND LEADING MEETINGS AND SCHEDULING PRODUCTION EVENTSMANAGE RESOURCES, CREATING DOCUMENTATION AND PROJECT TRACKINGWORKING CROSS FUNCTIONALLY TO COORDINATE DIFFERENT PROJECT PHASESWORK CLOSELY WITH VENDORS AND INTERNAL TEAMS ON ISSUE RESOLUTION AND TASK COMPLETIONIMPLEMENTATION PLANNING, DOCUMENTATION, AND EXECUTION\nREQUIRED QUALIFICATIONS:5 TO 7+ YEARS EXPERIENCE AS A PROJECT MANAGER WORKING ON IT INITIATIVES, INCLUDING SOFTWARE DEVELOPMENT PROJECTSENTERPRISE LEVEL TECHNICAL PROJECT EXPERIENCE (AGILE SOFTWARE DEVELOPMENT PROJECT EXPERIENCE IS REQUIRED)MUST HAVE STRONG MS PROJECT AND EXCEL SKILLSEXPERIENCE WITH AGILE METHODOLOGIESPMP REQUIREDSTRONG PRESENTATION AND COMMUNICATION SKILLSABILITY TO BUILD RELATIONSHIPS CROSS FUNCTIONALLYABILITY TO WORK ON MULTITUDE OF PROJECTS AT ONE TIMESTRONG ORGANIZATION SKILLS AND ABILITY TO JUGGLE A VARIETY OF TASKSVERY DETAIL ORIENTED WITH EXCELLENT DOCUMENTATION SKILLS\nBENEFITS INCLUDE: COMPREHENSIVE HEALTHCARE (MEDICAL, DENTAL, VISION)POSITIVE WORK CULTURE FOCUSED ON WORK LIFE BALANCECONVENIENT MID-TOWN LOCATION WITH FREE PARKING OR MARTA ACCESS (2 DAYS IN-OFFICE REQUIRED, 3 DAYS REMOTE WORK)",
    "job_skill_set": [
      "Excel",
      "Project Documentation",
      "Communication",
      "Presentation Skills",
      "Relationship Building",
      "Organization Skills",
      "Detail Oriented",
      "Multitasking",
      "Leadership",
      "PMP Certification",
      "MS Project",
      "Agile Methodologies",
      "Project Tracking",
      "Software Development",
      "Enterprise Level Technical Project Experience"
    ],
    "short_keywords": [
      "agile",
      "building",
      "certification",
      "communication",
      "detail",
      "development",
      "documentation",
      "enterprise",
      "excel",
      "experience",
      "information",
      "informationtechnology",
      "leadership",
      "level",
      "manager",
      "methodologies",
      "ms",
      "multitasking",
      "organization",
      "oriented",
      "pmp",
      "presentation",
      "project",
      "relationship",
      "skills",
      "software",
      "technical",
      "technology",
      "tracking"
    ]
  },
  {
    "job_id": "3884436082",
    "job_title": "Senior Information Technology Auditor",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "HILLTOP HOLDINGS INC. (NYSE:HTH) IS A TEXAS-BASED DIVERSIFIED FINANCIAL HOLDING COMPANY SPECIALIZING IN BANKING, MORTGAGE ORIGINATION, AND FINANCIAL ADVISORY THROUGH ITS WHOLLY OWNED SUBSIDIARIES, PLAINSCAPITAL BANK, PRIMELENDING, AND HILLTOPSECURITIES. \nHILLTOP HOLDINGS IS DEDICATED TO INTEGRITY, COLLABORATION, ADAPTABILITY, RESPECT, AND EXCELLENCE. OUR PRINCIPLES ARE THE MOMENTUM THAT DRIVES OUR ACTIONS, GUIDES OUR DECISIONS, AND ENABLES US TO EARN THE CONFIDENCE OF THE CUSTOMERS AND COMMUNITIES WE SERVE. IF YOU WANT TO BE A PART OF A TEAM ON THE RISE, HILLTOP HOLDINGS MAY BE YOUR NEXT MOVE FORWARD.\nHILLTOP HOLDINGS IS CURRENTLY LOOKING TO HIRE A SENIOR IT AUDITOR.\nTHE SENIOR IT AUDITOR IS RESPONSIBLE FOR PLANNING, ORGANIZING, AND EXECUTING IT AUDIT ENGAGEMENTS OF IT INTERNAL CONTROLS, APPLICATION CONTROLS, TECHNOLOGY INFRASTRUCTURE, SARBANES-OXLEY (SOX) CONTROLS, AND IT PROCESSES THROUGHOUT HILLTOP HOLDINGS AND SUBSIDIARY COMPANIES. DEMONSTRATES AN ABILITY TO INTERACT WITH ALL LEVELS OF COMPANY PERSONNEL AND COORDINATES WITH THE IT DEPARTMENT STAFF AND MANAGEMENT, OPERATIONAL AND FINANCIAL INTERNAL AUDIT TEAMS, AND EXTERNAL AUDITORS WHERE REQUIRED.\nESSENTIAL FUNCTIONS PREPARES WELL DOCUMENTED WORK PAPERS AND REPORTS, AND EFFECTIVELY COMMUNICATES AUDIT FINDINGS AND RECOMMENDATIONS, TRACKS OPEN AUDIT ISSUES, AND CONTRIBUTES TO THE PLANNING AND ORGANIZATION OF AUDIT WORK.ASSESSES EFFECTIVENESS OF IT INTERNAL CONTROLS.WORKS COLLABORATIVELY WITH AUDIT MANAGEMENT AND STAFF TO EXECUTE THE ANNUAL AUDIT PLAN.ADVISES BUSINESS PARTNERS REGARDING INTERNAL CONTROLS AND PROCESS IMPROVEMENT OPPORTUNITIES.PROVIDES ASSISTANCE TO EXTERNAL AUDITORS WHERE REQUIRED.EXECUTES OTHER PROJECTS AND ACTIVITIES, AS ASSIGNED\nJOB REQUIREMENTSMUST BE ELIGIBLE TO WORK IN THE U.S. WITHOUT SPONSORSHIP NOW OR IN THE FUTURE.MUST BE ABLE TO COMMUTE TO REPUBLIC CENTER @ 325 N. ST. PAUL STREET, DALLAS, WITHOUT THE NEED FOR RELOCATION ASSISTANCE.A BACHELOR’S DEGREE IN MANAGEMENT INFORMATION SYSTEMS, BUSINESS ADMINISTRATION, ACCOUNTING, FINANCE, COMPUTER SCIENCE, OR RELATED FIELD REQUIRED.CERTIFICATIONS DESIRED (ANY ONE OR A COMBINATION): CISA, CISSP, CPA, CIA, GSNA OR OTHER PERTINENT CERTIFICATIONS. MUST BE WILLING TO MEET DEPARTMENT CERTIFICATION REQUIREMENTS AND MUST MAINTAIN CERTIFICATIONS.THREE OR MORE YEARS OF IT AUDIT EXPERIENCE INCLUDING IT APPLICATION AND INFRASTRUCTURE AUDITING IS REQUIRED.PUBLIC ACCOUNTING AND/OR FINANCIAL SERVICES INDUSTRY EXPERIENCE IS PREFERRED. BROKER/DEALER, INVESTMENT BANKING, MORTGAGE LENDING, RETAIL BANKING, AND/OR INSURANCE EXPERIENCE IS A PLUS.SOX DOCUMENTATION AND TESTING EXPERIENCE REQUIRED.DEMONSTRATED ABILITY TO LEAD AUDITS WITH LITTLE DIRECT MANAGEMENT INVOLVEMENT, PREPARE DETAILED AUDIT PROGRAMS, OR PERFORM IT RISK ASSESSMENTS. ABILITY TO EVALUATE THE DESIGN EFFECTIVENESS AND OPERATING EFFECTIVENESS OF IT INTERNAL CONTROLS THROUGH DETAILED TESTING.EXCELLENT WRITTEN, VERBAL, AND INTERPERSONAL COMMUNICATION SKILLS WITH THE ABILITY TO EFFECTIVELY COMMUNICATE COMPLEX CONCEPTS TO TECHNICAL AND NONTECHNICAL AUDIENCES ALIKE.EXCELLENT PC SKILLS, INCLUDING WORD PROCESSING AND SPREADSHEETS, WITH ADAPTABILITY TO SPECIALIZED PROGRAMS FOR RISK MANAGEMENT AND OTHERS IN USE BY HTH INTERNAL AUDIT, WHILE MAINTAINING SUPERB ATTENTION TO DETAILEXCELLENT ANALYTICAL, TIME MANAGEMENT, ORGANIZATIONAL AND PROBLEM-SOLVING SKILLSMUST BE ABLE TO TRAVEL LOCALLY UP TO 10%\nTHE ABOVE STATEMENTS ARE INTENDED TO DESCRIBE THE GENERAL NATURE AND LEVEL OF WORK BEING PERFORMED BY INDIVIDUALS IN, OR ASSIGNED TO, THE ABOVE POSITION AND ARE NOT INTENDED TO BE CONSTRUED AS AN EXHAUSTIVE LIST OF ALL RESPONSIBILITIES, DUTIES AND SKILLS REQUIRED, AND MAY BE CHANGED AT THE DISCRETION OF THE COMPANY.",
    "job_skill_set": [
      "Microsoft Office Suite",
      "Analytical Skills",
      "Attention to Detail",
      "Financial Services Knowledge",
      "Technology Infrastructure",
      "Communication Skills",
      "Collaboration",
      "Problem Solving",
      "Time Management",
      "Organizational Skills",
      "Interpersonal Skills",
      "Adaptability",
      "Leadership",
      "Written Communication",
      "Verbal Communication",
      "IT Audit",
      "SOX Documentation",
      "Risk Assessment",
      "CISA",
      "CISSP",
      "CPA",
      "CIA",
      "GSNA",
      "Application Controls",
      "Internal Controls"
    ],
    "short_keywords": [
      "adaptability",
      "analytical",
      "application",
      "assessment",
      "attention",
      "audit",
      "auditor",
      "cia",
      "cisa",
      "cissp",
      "collaboration",
      "communication",
      "controls",
      "cpa",
      "detail",
      "documentation",
      "financial",
      "gsna",
      "information",
      "informationtechnology",
      "infrastructure",
      "internal",
      "interpersonal",
      "it",
      "knowledge",
      "leadership",
      "management",
      "microsoft",
      "office",
      "organizational",
      "problem",
      "risk",
      "senior",
      "services",
      "skills",
      "solving",
      "sox",
      "suite",
      "technology",
      "time",
      "to",
      "verbal",
      "written"
    ]
  },
  {
    "job_id": "3901398951",
    "job_title": "Information Technology Technician",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "CKC LABORATORIES IS SEEKING A DYNAMIC AND CUSTOMER-FOCUSED IT TECHNICIAN TO JOIN OUR TEAM IN MARIPOSA, CA. AS AN IT TECHNICIAN, YOU WILL PLAY A CRUCIAL ROLE IN MANAGING TECHNICAL TASKS, PROVIDING EXCEPTIONAL CUSTOMER SERVICE, AND CONTRIBUTING TO A COLLABORATIVE WORK ENVIRONMENT. THIS POSITION OFFERS A UNIQUE OPPORTUNITY TO WORK ON DIVERSE TECHNICAL CHALLENGES AND INTERACT WITH BOTH CLIENTS AND CO-WORKERS. PLEASE NOTE: THIS IS AN \"IN OFFICE\" POSITION BASED IN MARIPOSA, CA. THIS IS NOT A REMOTE OR WORK FROM HOME POSITION.ESSENTIAL DUTIES AND RESPONSIBILITIES: PROVIDE PHONE SUPPORT AND HANDLE EMAIL TICKETS FOR VARIOUS TECHNICAL ISSUES, INCLUDING RESETTING PASSWORDS, CREATING ACCOUNTS IN THE SYSTEM, AND GRANTING CORRECT PERMISSIONS. INSTALL, CONFIGURE, AND MAINTAIN WINDOWS BASED WORKSTATIONS, HANDHELD DEVICES, AND SERVERS. UTILIZE STRONG TECHNICAL SKILLS TO TROUBLESHOOT AND RESOLVE CUSTOMER INQUIRIES EFFICIENTLY AND EFFECTIVELY. MAINTAIN ACCURATE RECORDS OF CUSTOMER INTERACTIONS AND TECHNICAL ISSUES USING THE COMPANY'S TICKETING SYSTEM. COLLABORATE WITH INTERNAL TEAMS TO ESCALATE COMPLEX TECHNICAL PROBLEMS AND ENSURE TIMELY RESOLUTION. PROVIDE EXCELLENT CUSTOMER SERVICE BY ADDRESSING INQUIRIES PROMPTLY AND PROFESSIONALLY. STAY UPDATED ON COMPANY PRODUCTS AND SERVICES TO PROVIDE ACCURATE INFORMATION DURING SUPPORT SESSIONS.KNOWLEDGE, SKILLS, AND/OR ABILITIES: PROVEN EXPERIENCE IN HARDWARE/SOFTWARE TECHNICAL SYSTEMS TROUBLESHOOTING AND SUPPORT. MINIMUM OF 2 YEARS OF EXPERIENCE IN WINDOWS OS MAINTENANCE, CONFIGURATION, AND SUPPORT. EXPERIENCE WITH WINDOWS SERVER ENVIRONMENT, ACTIVE DIRECTORY, VIRTUAL MACHINES (HYPER-V). EXPERIENCE IN CONFIGURING AND MAINTAINING FIREWALLS, ROUTERS, AND SWITCHES A PLUS. REMOTE IT SYSTEMS AND PERIPHERALS TROUBLESHOOTING, CONFIGURATION, AND MANAGEMENT. KNOWLEDGE AND EXPERIENCE WITH ONE OR MORE OF THE FOLLOWING: REMOTE MANAGEMENT AND MONITORING TOOLS, TICKETING SYSTEMS, BACKUP DEVICES, BACKUP POWER SUPPLIES, NETWORK PRINTERS. ABILITY TO WORK WELL WITH LITTLE SUPERVISION, BOTH INDIVIDUALLY AND IN A TEAM ENVIRONMENT. EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS. AVAILABILITY FOR TRAVEL TO BRANCH OFFICES. AVAILABILITY FOR ON-CALL AND AFTER-HOURS SUPPORT RESPONSIBILITIES DURING EMERGENCIES. CUSTOMER-ORIENTED WITH A FRIENDLY ATTITUDE. MUST HAVE A CALIFORNIA DRIVER'S LICENSE AND A CLEAN DRIVING RECORD.QUALIFICATIONS 2+ YEARS’ EXPERIENCE WITH WINDOWS OS MAINTENANCE, CONFIGURATION, AND SUPPORT. TECH/COMPUTER SAVVY WITH A PASSION FOR ALL THINGS TECHNOLOGY. ABILITY TO MULTI-TASK, ORGANIZE, AND PRIORITIZE WORK. ABILITY TO WORK INDEPENDENTLY AND AS PART OF A TEAM. EXCEPTIONAL CUSTOMER SERVICE SKILLS\n",
    "job_skill_set": [
      "Windows OS Maintenance",
      "Technical Troubleshooting",
      "Virtual Machines (Hyper-V)",
      "Remote Management Tools",
      "Customer Service",
      "Communication",
      "Teamwork",
      "Problem Solving",
      "Adaptability",
      "Independence",
      "Multi-tasking",
      "Active Directory",
      "Windows Server",
      "Firewall Configuration",
      "Router Configuration",
      "Switch Configuration",
      "Ticketing Systems",
      "Backup Devices",
      "Network Printers",
      "Time Management"
    ],
    "short_keywords": [
      "active",
      "adaptability",
      "backup",
      "communication",
      "configuration",
      "customer",
      "devices",
      "directory",
      "firewall",
      "hyperv",
      "independence",
      "information",
      "informationtechnology",
      "machines",
      "maintenance",
      "management",
      "multitasking",
      "network",
      "os",
      "printers",
      "problem",
      "remote",
      "router",
      "server",
      "service",
      "solving",
      "switch",
      "systems",
      "teamwork",
      "technical",
      "technician",
      "technology",
      "ticketing",
      "time",
      "tools",
      "troubleshooting",
      "virtual",
      "windows"
    ]
  },
  {
    "job_id": "3902841731",
    "job_title": "Sr Information Technology Risk Analyst - IT Services",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "OVERVIEW\n\nWHY GMF TECHNOLOGY?\n\nGM FINANCIAL IS SET TO CHANGE THE AUTO FINANCE INDUSTRY AND IS LEADING THE PATH OF EMBARKING ON TECH MODERNIZATION - WE HAVE A STARTUP MINDSET, AND PRESERVE OUR SMALL COMPANY CULTURE, IN A PUBLIC COMPANY ENVIRONMENT WITH FINANCIAL STABILITY AND INTENSE GROWTH OVER A DECADE-LONG HISTORY. WE ARE DATA JUNKIES AND TRUST IN DATA AND INSIGHTS TO ADVANCE OUR BUSINESS OBJECTIVES.\n\nWE TAKE OUR GOAL OF ZERO EMISSION, ZERO COLLISION, ZERO CONGESTION, AND ZERO FRICTION VERY SERIOUSLY. WE BELIEVE AS THE AUTO FINANCE MARKET LEADER WE ARE IN THE DRIVER'S SEAT TO LEAD US IN THE GM EV MISSION TO CHANGE THE WORLD.\n\nWE ARE BUILDING GLOBAL PLATFORMS, LATAM, EUROPE, CHINA - AND WE ARE LOOKING TO GROW OUR HIGH-PERFORMING TEAM. GMF IS COMPRISED OF OVER 10,000 TEAM MEMBERS GLOBALLY. JOIN OUR FINTECH CULTURE WITHIN A BLUE-CHIP COMPANY WHERE WE ARE CHANGING THE WAY WE USE TECHNOLOGY TO SUPPORT OUR CUSTOMERS AND BUSINESS.\n\nRESPONSIBILITIES\n\nABOUT THE ROLE:\n\nTHE IT RISK ANALYST IS RESPONSIBLE FOR PROACTIVELY AND INDEPENDENTLY RECOGNIZING, ASSESSING AND DOCUMENTING RISK ASSESSMENTS REPORT DATA FOR GMF. THIS TEAM MEMBER IS RESPONSIBLE FOR THE ASSESSMENT DOCUMENT GATHERING AND DEVELOPMENT, MONITORING, TRACKING AND DRIVE CONTINUOUS RISK IMPROVEMENTS ACROSS THE ENTERPRISE. THIS ROLE IS INTEGRAL IN IDENTIFYING, MITIGATING BOTH INHERENT AND RESIDUAL RISKS, PERFORMING RISK ASSESSMENTS OF APPLICATIONS, INFRASTRUCTURE, BUSINESS AND TECHNOLOGY AGAINST GMF'S DEFINED RISK MANAGEMENT FRAMEWORK. THE POSITION'S OVERALL RESPONSIBILITY IS EVALUATING BUSINESS AND IT RISK, COMMUNICATE FINDINGS, RECOMMENDATIONS AND MITIGATION PLANS IN A TIMELY AND PRECISE MANNER. THE IDEAL CANDIDATE SHOULD BE PASSIONATE ABOUT CONTINUING TO BUILD AN IT RISK MANAGEMENT AND ASSESSMENT PROGRAM, WILLING TO ADAPT TO A CHANGING ENVIRONMENT AND THE ABILITY TO ARTICULATE COMPLEX ISSUES TO MANAGEMENT. UNDERSTAND, COMMUNICATE, AND COMMIT TO THE ORGANIZATION'S VISION, GOALS AND STRATEGIES RELATING TO RISK, GOVERNANCE AND COMPLIANCE. THE SR IT RISK ANALYST WILL WORK TO IMPROVE THE OVERALL POSTURE OF INFORMATION TECHNOLOGY RISK AT GM FINANCIAL.\n\nJOB DUTIES\n\nSCHEDULE AND PERFORM IT RISK AND GAP ASSESSMENTS USING RISK METHODOLOGY; IDENTIFY AND DOCUMENT CONTROL DEFICIENCIES IN BUSINESS PROCESSES AND TECHNOLOGY SYSTEMSDEVELOP AND EXECUTE COMPLIANCE REVIEWS TO EVALUATE THE EFFECTIVENESS OF GENERAL CONTROLS AND OPERATING PROCESSES, INCLUDING DOCUMENTATION, PRESENTATIONS AND ACTION PLAN REMEDIATION ASSISTANCEWORK WITH BUSINESS TO UNDERSTAND THE POTENTIAL RISK FINDINGS IDENTIFIED THROUGH THE RISK ASSESSMENT PROCESSPROVIDE RISK REMEDIATION RECOMMENDATIONS THAT THE BUSINESS AND IT MAY IMPLEMENT TO MITIGATE THE IDENTIFIED CONTROL GAPSEVALUATE MANAGEMENT AND DOCUMENT OWNER RESPONSES TO ENSURE THAT REMEDIATION PLANS AND TASKS ADEQUATELY ADDRESS IDENTIFIED CONTROL GAPSDOCUMENT RISK ISSUES IN A DESIGNATED RISK REGISTERPARTICIPATE IN AND INFLUENCE INFORMATION RISK CONTINUOUS PROCESS IMPROVEMENTDEVELOP STRONG PARTNERSHIPS ACROSS OUR ORGANIZATIONSTRONG INTERACTION AND COLLABORATION WITH PROJECT MANAGEMENT AND TECHNICAL TEAMS TO CONVEY RISK MITIGATION REQUIREMENTSASSIST WITH REPEATABLE DATA COLLECTION PROCESSES TO DRIVE CONSISTENT MEASUREMENT AND REPORTING OF RISK METRICSLEVERAGE DATA TO IDENTIFY EMERGING RISKS, PROCESS IMPROVEMENTS, AND/OR AREAS REQUIRING INCREASED RISK FOCUSDEVELOP BUSINESS SPECIFIC KEY RISK AND KEY PERFORMANCE INDICATORS TO KEEP PULSE ON SIGNIFICANT RISKS WITHIN THE LINE OF BUSINESSPROVIDE SERVICES TO IT PERSONNEL IN THE DEVELOPMENT OF POLICY, STANDARD, AND PROCESSANALYZE AND INTERPRET AUDIT REQUEST TO PROVIDE CONSULTATION AND EXPERT ADVICE ON HOW TO FORMALLY RESPOND AND REMEDIATE ISSUESMAINTAIN GMF'S IT RISKS, CONTROLS, POLICIES, STANDARDS AND ACTION PLANS USING THE GOVERNANCE, RISK AND COMPLIANCE SYSTEMS (GRC)AS THE SR IT RISK ANALYST, YOU WILL PROVIDE LEADERSHIP AND SUBJECT MATTER EXPERTISE TO ENSURE RISK IS BEING IDENTIFIED AND REVIEWED WITHIN GMF AND COMPLIANT WITH COMPANY SECURITY POLICIES AND PRACTICESUTILIZE A RISK BASED APPROACH TO SET REQUIREMENTS FOR RECOMMENDED REMEDIATIONWORK WITH INTERNAL PROJECT MANAGERS AND SECURITY ARCHITECTS AND ENGINEERS IN DETERMINING IF NEW DESIGNS AND PROJECTS WILL EXPOSE DATA, RISK OR THREATSACTIVELY PARTICIPATE IN IT GOVERNANCE COMMITTEES ACROSS GMFPERFORM OTHER DUTIES AS ASSIGNEDCONFORM WITH ALL COMPANY POLICIES AND PROCEDURES\n\nQUALIFICATIONS\n\nWHAT MAKES YOU A DREAM CANDIDATE? \n\nKNOWLEDGE\n\nADVANCED WORKING KNOWLEDGE OF FINANCIAL INDUSTRY BEST PRACTICES AND CONCEPTS, AS IT RELATES TO IT AND THE FINANCIAL INDUSTRY SECTORPROFICIENT IN THE USE OF MICROSOFT OFFICE PRODUCTS (EXCEL, POWERPOINT, WORD, ACCESS, VISIO)KNOWLEDGEABLE IN INDUSTRY LAWS AND REGULATIONS GOVERNING GMF (EG SOX)KNOWLEDGE OF PRINCIPLES AND PROCEDURES INVOLVED IN HANDLING SENSITIVE DATAHIGH INTEGRITY AND BUSINESS ETHICSKNOWLEDGE OF ENTERPRISE GOVERNANCE, RISK AND COMPLIANCE SYSTEMS (EG, ARCHER)PROFICIENT KNOWLEDGE OF ENTERPRISE POLICIES AND STANDARDS\n\nSKILLS\n\nDETAIL ORIENTED, SELF-MOTIVATED, WORK WITH LITTLE SUPERVISION, TIMELY COMPLETIONS OF PROJECTS, ADAPTS TO CHANGING PRIORITIESSTRONG ABILITY TO INFLUENCE THROUGH DISCUSSIONS AND PRESENTATIONS TO ALL LEVELS OF STAKEHOLDERSCAN ARTICULATE BUSINESS REQUIREMENTS AND FUNCTIONAL RISK SPECIFICATIONS CLEARLY, AS WELL AS LISTEN TO AND CONSIDERS OTHERS’ IDEAS AND EXPERTISE FOR RISK RESOLUTIONEXHIBIT EFFECTIVE WRITTEN AND ORAL COMMUNICATION, TO CONVEY INFORMATION IN A CLEAR AND CONCISE MANNERWORK EFFICIENTLY AND EFFECTIVELY, WITH THE ABILITY TO WORK THROUGH STRESSFUL SITUATIONSABILITY TO ANALYZE RELEVANT AND COMPLEX DATA AND INFORMATION INTO RISK REQUIREMENTSSUPERIOR ORGANIZATIONAL AND TIME MANAGEMENT SKILLSABILITY TO WORK INDEPENDENTLY AND MAKE SOUND DECISIONS WHILE MEETING TIME SENSITIVE DEADLINES\n\nEXPERIENCE AND EDUCATION\n\n5-7 YEARS IN TECHNOLOGY, SPECIFICALLY FOCUSED IN IT RISK ASSESSMENTS, COMPLIANCE AND INTERNAL AUDIT, REVIEWING AND TESTING CONTROLS AS INTEGRAL COMPONENTS OF RISK AND COMPLIANCE IDENTIFICATION REQUIREDEXTENSIVE EXPERIENCE ANALYZING ENTERPRISE-WIDE RISK AND EXECUTING MITIGATION PLANS ACCORDINGLY REQUIREDEXPERIENCE WRITING USER DOCUMENTATION REQUIREDFINANCIAL SERVICES INDUSTRY EXPERIENCE PREFERREDBACHELOR’S DEGREE IN RELATED FIELD OR EQUIVALENT WORK OR MILITARY EXPERIENCE REQUIREDCRISC, CISA, CIPP CERTIFICATION PREFERRED\n\nWHAT WE OFFER: GENEROUS BENEFITS PACKAGE AVAILABLE ON DAY ONE TO INCLUDE: 401K MATCHING, BONDING LEAVE FOR NEW PARENTS (12 WEEKS, 100% PAID), TUITION ASSISTANCE, TRAINING, GM EMPLOYEE AUTO DISCOUNT, COMMUNITY SERVICE PAY AND NINE COMPANY HOLIDAYS.\n\nOUR CULTURE: OUR TEAM MEMBERS DEFINE AND SHAPE OUR CULTURE — AN ENVIRONMENT THAT WELCOMES INNOVATIVE IDEAS, FOSTERS INTEGRITY, AND CREATES A SENSE OF COMMUNITY AND BELONGING. HERE WE DO MORE THAN WORK — WE THRIVE.\n\nCOMPENSATION: COMPETITIVE PAY AND BONUS ELIGIBILITY.\n\nWORK LIFE BALANCE: FLEXIBLE HYBRID WORK ENVIRONMENT, 2 DAYS A WEEK IN THE OFFICE.\n\nSALARY\n\nTHE BASE SALARY RANGE FOR THIS ROLE IS: USD $88,000.00 TO $162,900.00. AT GM FINANCIAL, WE STRIVE FOR TRANSPARENCY IN ALL ASPECTS OF OUR BUSINESS, INCLUDING PAY EQUITY. THIS IS THE GM FINANCIAL PAY RANGE FOR THIS ROLE AND JOB LEVEL. THE EXACT SALARY AND COMPENSATION WILL VARY BASED ON FACTORS LIKE KNOWLEDGE, SKILLS, EXPERIENCE, AND EDUCATION. THIS ROLE IS ELIGIBLE TO PARTICIPATE IN A PERFORMANCE-BASED INCENTIVE PLAN. FULL TIME EMPLOYEES ARE ELIGIBLE TO PARTICIPATE IN HEALTH BENEFITS ON DAY ONE OF EMPLOYMENT.\n\n",
    "job_skill_set": [
      "user documentation writing",
      "communication",
      "problem solving",
      "attention to detail",
      "adaptability",
      "organizational skills",
      "time management",
      "collaboration",
      "IT risk assessments",
      "compliance",
      "internal audit",
      "risk management framework",
      "Microsoft Office (Excel, PowerPoint, Word, Access, Visio)",
      "enterprise governance, risk and compliance systems (e.g., Archer)",
      "data analysis",
      "risk remediation",
      "financial industry best practices",
      "sensitive data handling",
      "self-motivation",
      "influencing skills",
      "independent decision making"
    ],
    "short_keywords": [
      "access",
      "adaptability",
      "analysis",
      "analyst",
      "and",
      "archer",
      "assessments",
      "attention",
      "audit",
      "best",
      "collaboration",
      "communication",
      "compliance",
      "data",
      "decision",
      "detail",
      "documentation",
      "eg",
      "enterprise",
      "excel",
      "financial",
      "framework",
      "governance",
      "handling",
      "independent",
      "industry",
      "influencing",
      "information",
      "informationtechnology",
      "internal",
      "it",
      "making",
      "management",
      "microsoft",
      "office",
      "organizational",
      "powerpoint",
      "practices",
      "problem",
      "remediation",
      "risk",
      "selfmotivation",
      "sensitive",
      "services",
      "skills",
      "solving",
      "sr",
      "systems",
      "technology",
      "time",
      "to",
      "user",
      "visio",
      "word",
      "writing"
    ]
  },
  {
    "job_id": "3894266858",
    "job_title": "Information Technology Technician",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "TITLE - PRODUCT SUPPORT REPRESENTATIVE –SOFTWARE SUPPORT SERVICES\nLOCATION - MURRYSVILLE, PENNSYLVANIA\nCONTRACT - 06+ MONTHS WITH POSSIBLE EXTENSION\nREQUIRED SKILLS -A MINIMUM OF 3+ YEARS OF APPROPRIATE IT RELATED CUSTOMER SERVICE. EXPERIENCE WITH USE OF SOFTWARE INCLUDING MICROSOFT OFFICE, WORD, EXCEL AND SAP REQUIRED.MUST POSSESS A GOOD UNDERSTANDING OF COMPUTER FUNCTIONALITY AND EXPERIENCE WITH SOFTWARE/HARDWARE TROUBLESHOOTING. A DEMONSTRATED UNDERSTANDING OF COMPUTER NETWORKS AND DATABASE STRUCTURE IS ALSO REQUIRED TO PERFORM THE ROLE.KNOWLEDGE OF WINDOWS XP, VISTA, 7, AND 8 OPERATING SYSTEMS REQUIRED.KNOWLEDGE OF ANDROID AND IOS MOBILE OPERATING SYSTEMS HIGHLY DESIRED.KNOWLEDGE OF SQL SERVER PREFERRED.",
    "job_skill_set": [
      "Database Structure",
      "Android OS",
      "iOS",
      "SQL Server",
      "Customer Service",
      "Problem Solving",
      "Communication",
      "Microsoft Office",
      "Word",
      "Excel",
      "SAP",
      "Software Troubleshooting",
      "Hardware Troubleshooting",
      "Computer Networks",
      "Windows XP",
      "Windows Vista",
      "Windows 7",
      "Windows 8"
    ],
    "short_keywords": [
      "7",
      "8",
      "android",
      "communication",
      "computer",
      "customer",
      "database",
      "excel",
      "hardware",
      "information",
      "informationtechnology",
      "ios",
      "microsoft",
      "networks",
      "office",
      "os",
      "problem",
      "sap",
      "server",
      "service",
      "software",
      "solving",
      "sql",
      "structure",
      "technician",
      "technology",
      "troubleshooting",
      "vista",
      "windows",
      "word",
      "xp"
    ]
  },
  {
    "job_id": "3906252855",
    "job_title": "Information Technology Support Analyst III",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "THE IT SUPPORT ANALYST III WILL ASSIST WITH USER AND SYSTEM ACCESS WITHIN MWD'S INFRASTRUCTURE AND ASSIGN LEVELS OF PRIVILEGE TO SYSTEM ADMINISTRATORS. THIS POSITION WILL ALSO HELP WITH ONBOARDING, CREATING AND MANAGING SERVICE ACCOUNTS, THE VAULTING SERVER, CREATING GROUP POLICIES AND FOR ISSUING AND REVOKING INTERNAL CERTIFICATES, AND DEPROVISIONING USERS AS NECESSARY. THIS ANALYST WILL BE RESPONSIBLE FOR RUNNING THE QUARTERLY ACCESS AUDIT: PEOPLESOFT, EBS, WINS AND AD AUDITS.\n\nTHE IT SUPPORT ANALYST III MUST BE ABLE TO USE ACTIVE DIRECTORY, TANIUM, AND THE VAULTING SERVER.\n\nSCHEDULE: 9/80 MONDAY THROUGH FRIDAY WITH EVERY OTHER FRIDAY OFF\n\nTHIS JOB ANNOUNCEMENT HAS BEEN DESIGNED TO INDICATE THE GENERAL NATURE AND LEVEL OF WORK BEING PERFORMED BY EMPLOYEES IN THIS CLASSIFICATION / JOB.\n\nTO VIEW THE FULL JOB DESCRIPTION CLICK HERE:  IT SUPPORT ANALYST III \n\nEMPLOYMENT STANDARDS \n\nMINIMUM QUALIFICATIONS\n\nEDUCATION AND EXPERIENCE: BACHELOR’S DEGREE FROM AN ACCREDITED COLLEGE OR UNIVERSITY IN A RELATED FIELD AND FOUR YEARS OF RELEVANT EXPERIENCE.\n\nRELEVANT EXPERIENCE IS DEFINED AS: A COMBINATION OF EXPERIENCE IN AT LEAST 3 OR MORE OF THE FOLLOWING AREAS INCLUDING ACTIVE DIRECTORY (AD), VAULTING SERVER, PRIVILEGED ACCESS MANAGER (PAM), AZURE, AND SINGLE SIGN-ON.\n\nCERTIFICATIONS, LICENSES, AND REGISTRATION REQUIREMENTS\n\nEMPLOYEES IN THIS POSITION MAY BE REQUIRED TO OBTAIN AND MAINTAIN THE FOLLOWING CERTIFICATIONS, LICENSING AND REGISTRATIONS:\n\nLICENSES:\n\n VALID CALIFORNIA CLASS C DRIVER’S LICENSE OR EQUIVALENT (REQUIRED AT TIME OF APPLICATION) THAT ALLOWS YOU TO DRIVE DURING YOUR EMPLOYMENT.\n\nCERTIFICATES:\n\n VALID CERTIFIED INFORMATION SYSTEMS SECURITY PROFESSIONAL (CISSP) – FOR THE INFORMATION SECURITY SUPPORT ANALYST III\n\nCLOSING\n\nBENEFITS:\n\n COMPETITIVE COMPENSATION EXCELLENT MEDICAL, DENTAL, LIFE, VISION PLANS. DEFERRED COMPENSATION IN THE FORM OF A 401(K) PLAN (WITH MATCHING CONTRIBUTION) AND A 457 PLAN. RETIREMENT BENEFITS UNDER THE CALIFORNIA PUBLIC EMPLOYEES' RETIREMENT SYSTEM TUITION REIMBURSEMENT TRAINING AND ADVANCEMENT OPPORTUNITIES EXCELLENT WORKING ENVIRONMENT PUBLIC TRANSPORTATION REIMBURSEMENTS ON-SITE FITNESS CENTER HUB OF PUBLIC TRANSPORTATION: RAIL, SUBWAY, BUSES, AND TAXIS\n\nFOR MORE INFORMATION ON MWD BENEFITS, PLEASE USE THE FOLLOWING LINK:  BENEFITS REGULAR FT PT EMPLOYEES (REPRESENTED) \n\nABOUT MWD\n\nTHE METROPOLITAN WATER DISTRICT OF SOUTHERN CALIFORNIA IS A CONSORTIUM OF 26 CITIES AND WATER DISTRICTS THAT PROVIDES DRINKING WATER TO NEARLY 19 MILLION PEOPLE IN SOUTHERN CALIFORNIA. METROPOLITAN’S MISSION IS TO PROVIDE ITS SERVICE AREA WITH ADEQUATE AND RELIABLE SUPPLIES OF HIGH QUALITY WATER TO MEET CURRENT AND FUTURE NEEDS IN AN ENVIRONMENTALLY AND ECONOMICALLY RESPONSIBLE WAY. METROPOLITAN’S FACILITIES INCLUDE THE 242-MILE COLORADO RIVER AQUEDUCT, FIVE WATER TREATMENT PLANTS WITH A COMBINED CAPACITY OF 2.3 BILLION GALLONS PER DAY, NINE SURFACE WATER RESERVOIRS, 830 MILES OF PIPELINE, AND 15 HYDROELECTRIC POWER PLANTS.\n\nTHE METROPOLITAN WATER DISTRICT OF SOUTHERN CALIFORNIA IS COMMITTED TO PROVIDING REASONABLE ACCOMMODATIONS TO QUALIFIED INDIVIDUALS WITH DISABILITIES. QUALIFIED INDIVIDUALS WITH DISABILITIES, WHO NEED A REASONABLE ACCOMMODATION DURING THE APPLICATION OR SELECTION PROCESS, PLEASE CALL (213) 217-7738 OR EMAIL: JOBS@MWDH2O.COM.\n\nMWD IS A FEDERAL AND STATE EO EMPLOYER – VETERANS/DISABLED AND OTHER PROTECTED CATEGORIES.\n\nAPPLICATION FILING PERIOD: CLOSES AT 4:30 PM PT ON THE DATE STATED IN THE JOB ANNOUNCEMENT. HOWEVER IT MAY CLOSE PRIOR TO THE FILING END DATE IF SUFFICIENT APPLICATIONS HAVE BEEN RECEIVED. IF SUFFICIENT APPLICATIONS HAVE NOT BEEN RECEIVED, THEN THE FILING PERIOD END DATE MAY BE EXTENDED.\n\nSPONSORSHIP: APPLICANTS FOR EMPLOYMENT WITH THE METROPOLITAN WATER DISTRICT OF SOUTHERN CALIFORNIA MUST HAVE WORK AUTHORIZATION THAT DOES NOT NOW OR IN THE FUTURE REQUIRE SPONSORSHIP OF A VISA FOR EMPLOYMENT AUTHORIZATION IN THE UNITED STATES (I.E., H1-B OR OTHER EMPLOYMENT-BASED IMMIGRATION CASE).",
    "job_skill_set": [
      "User Support",
      "Problem Solving",
      "Communication",
      "Teamwork",
      "Attention to Detail",
      "Time Management",
      "Active Directory",
      "Vaulting Server",
      "Privileged Access Manager (PAM)",
      "Azure",
      "Single Sign-On",
      "Service Accounts Management",
      "Group Policies Creation",
      "Internal Certificates Management",
      "Quarterly Access Audit",
      "Tanium"
    ],
    "short_keywords": [
      "access",
      "accounts",
      "active",
      "analyst",
      "attention",
      "audit",
      "azure",
      "certificates",
      "communication",
      "creation",
      "detail",
      "directory",
      "group",
      "iii",
      "information",
      "informationtechnology",
      "internal",
      "management",
      "manager",
      "pam",
      "policies",
      "privileged",
      "problem",
      "quarterly",
      "server",
      "service",
      "signon",
      "single",
      "solving",
      "support",
      "tanium",
      "teamwork",
      "technology",
      "time",
      "to",
      "user",
      "vaulting"
    ]
  },
  {
    "job_id": "3906200108",
    "job_title": "Lead Information Technology Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "WE ARE PARTNERED WITH AN INTERNATIONAL LAW FIRM TO HIRE A HANDS-ON IT LEAD FOR THE FIRMS' LARGEST OFFICE IN CALIFORNIA. THE SUCCESSFUL LEAD IT SPECIALIST WILL HAVE STRONG TECHNICAL EXPERIENCE PROVIDING SUPPORT WITHIN A PROFESSIONAL SERVICES ENVIRONMENT, AND A TRACK RECORD OF PROVIDING LEADERSHIP AND MENTORSHIP TO MORE JUNIOR MEMBERS OF THE TEAM. \nWHAT SKILLS ARE WE LOOKING FOR?AT LEAST 5 YEARS OF TECHNICAL EXPERIENCE PROVIDING TECHNICAL SUPPORT FOR MICROSOFT WINDOWS OPERATING BASED DESKTOP AND LAPTOP SYSTEMSADVANCED PROFICIENCY IN MICROSOFT OPERATING SYSTEMS, INCLUDING INSTALLATION AND CONFIGURATION PROCESSESKNOWLEDGE OF DESKTOP IMAGING TOOLS AND UPDATING PROCESSES (SCCM)ADVANCED PROFICIENCY IN MICROSOFT OFFICE SUITEADVANCED PROFICIENCY IN REMOTE ACCESS ARCHITECTURES, APPLICATIONS AND TECHNOLOGIES (CITRIX, VPN)KNOWLEDGE OF PRACTICE/LITIGATION SUPPORT APPLICATIONSKNOWLEDGABLE IN WIRELESS PDA TECHNOLOGIES (IOS)ADVANCED PROFICIENCY IN NETWORKING TECHNOLOGIES, CABLING TOPOLOGIES AND RELATED APPLICATIONSADVANCED PROFICIENCY IN DOCUMENT MANAGEMENT SYSTEM (WORKSITE)\nWHAT WILL THE ROLE INVOLVE?SUPERVISION OF TEAM RESPONSIBLE FOR IT SUPPORT SERVICES WHILST REMAINING TECHNICAL HANDS ONSUPERVISE WORK SCHEDULES AND PRIORITIES, AND PARTICIPATE IN PERFORMANCE MANAGEMENTSUPERVISE THE LOCAL IMPLEMENTATION OF FIRM WIDE IT PROJECTS, INITIATIVES AND RELATED DEPLOYMENTS, AND SPECIAL PROJECTS AS ASSIGNED BY THE IT REGIONAL MANAGER OR DIRECTOR OF IT SERVICE\nTHIS ROLE WILL BE FULLY ONSITE AND WE HAVE A BASE SALARY OF $130,000 AVAILABLE IN ADDITION TO A COMPREHENSIVE BENEFITS PACKAGE.",
    "job_skill_set": [
      "Networking Technologies",
      "Leadership",
      "Team Supervision",
      "Performance Management",
      "Communication",
      "Microsoft Windows",
      "Microsoft Operating Systems",
      "Desktop Imaging Tools (SCCM)",
      "Microsoft Office Suite",
      "Remote Access Technologies (Citrix, VPN)",
      "Practice/Litigation Support Applications",
      "Wireless PDA Technologies (iOS)",
      "Cabling Topologies",
      "Document Management System (Worksite)",
      "Mentorship"
    ],
    "short_keywords": [
      "access",
      "applications",
      "cabling",
      "citrix",
      "communication",
      "desktop",
      "document",
      "imaging",
      "information",
      "informationtechnology",
      "ios",
      "lead",
      "leadership",
      "management",
      "mentorship",
      "microsoft",
      "networking",
      "office",
      "operating",
      "pda",
      "performance",
      "practicelitigation",
      "remote",
      "sccm",
      "specialist",
      "suite",
      "supervision",
      "support",
      "system",
      "systems",
      "team",
      "technologies",
      "technology",
      "tools",
      "topologies",
      "vpn",
      "windows",
      "wireless",
      "worksite"
    ]
  },
  {
    "job_id": "3901450978",
    "job_title": "Information Technology Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "REMOTE | ** MUST PICKUP YOUR EQUIPMENT IN COLUMBUS, OH **ON-GOING, CONTRACT ROLE\nWE'RE EXCITED TO ANNOUNCE THAT WE'RE HIRING AN IT SPECIALIST.\nREQUIRED:COBOL CODINGZ/OSPROGRAMMINGPROJECT MANAGEMENT** MUST PICKUP EQUIPMENT COLUMBUS, OH **\nIF YOU HAVE EXPERIENCE WORKING WITH MAINFRAME OPERATING SYSTEMS AND COBOL CODING, WE WOULD LOVE TO HEAR FROM YOU.\nTHE IDEAL CANDIDATE SHOULD HAVE KNOWLEDGE OF MAINFRAME OPERATING SYSTEMS SUCH AS Z/OS, OS/390, AND Z/VM, AS WELL AS PROGRAMMING AND PROJECT MANAGEMENT SKILLS.\nWE LOOK FORWARD TO HEARING FROM YOU!",
    "job_skill_set": [
      "Programming",
      "Project Management",
      "Communication",
      "Teamwork",
      "COBOL",
      "Z/OS",
      "OS/390",
      "Z/VM"
    ],
    "short_keywords": [
      "cobol",
      "communication",
      "information",
      "informationtechnology",
      "management",
      "os390",
      "programming",
      "project",
      "specialist",
      "teamwork",
      "technology",
      "zos",
      "zvm"
    ]
  },
  {
    "job_id": "3905345640",
    "job_title": "Adjunct Faculty, Information Technology, Software Design and Programming",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "THIS IS A GENERAL POSTING THAT WILL SERVE TO CREATE A POOL OF APPLICANTS FOR ADJUNCT FACULTY OPENINGS THROUGHOUT THE 2024-2025 ACADEMIC YEAR. SHOULD WE HAVE AN OPENING AND BE INTERESTED IN PURSUING YOUR APPLICATION, WE WILL CONTACT YOU WITH SPECIFIC INFORMATION.\n\nBECOME AN ADJUNCT FACULTY MEMBER AT A TOP 100 UNIVERSITY AND PLAY A PIVOTAL ROLE IN SHAPING THE EMERGING PRACTITIONERS IN YOUR FIELD! THE UNIVERSITY OF DENVER HAS THE DISTINCTION OF BEING THE OLDEST INDEPENDENT UNIVERSITY IN THE ROCKY MOUNTAIN REGION, GIVING IT A TRADITION OF 150 YEARS OF ACADEMIC EXCELLENCE. AS ONE OF TEN COLLEGES AT THE UNIVERSITY OF DENVER, UNIVERSITY COLLEGE IS THE COLLEGE OF CONTINUING AND PROFESSIONAL STUDIES AND HAS BEEN A LEADER IN ADULT EDUCATION SINCE 1938. OUR MISSION AS A PRIVATE INSTITUTION DEDICATED TO THE PUBLIC GOOD IS TO DELIVER ENDURING PROFESSIONAL GROWTH AND PERSONAL DEVELOPMENT BY PROVIDING ADULT LEARNERS ACCESS TO THE UNIVERSITY OF DENVER THROUGH ALTERNATIVE EDUCATIONAL PATHWAYS. WE SEEK ADJUNCT INSTRUCTORS WHO WILL COMMIT TO AND ADVANCE OUR MISSION AND COMMITMENT TO INCLUSIVE EXCELLENCE. UNIVERSITY COLLEGE OFFERS FULLY ACCREDITED AND AFFORDABLE EDUCATIONAL EXPERIENCES SPECIFICALLY DESIGNED FOR BUSY ADULTS. LEARN MORE ABOUT UNIVERSITY COLLEGE AT HTTPS://UNIVERSITYCOLLEGE.DU.EDU/ABOUT/.\n\nPOSITION SUMMARY\n\nWE ARE CURRENTLY SEEKING ADJUNCT FACULTY WITH EXTENSIVE INDUSTRY EXPERIENCE IN SOFTWARE DESIGN AND PROGRAMMING TO TEACH IN THE INFORMATION TECHNOLOGY PROGRAM, WHO CAN FACILITATE THE LEARNING EXPERIENCE OF ADULT LEARNERS IN CAREER-FOCUSED PROGRAMS. APPLICANTS SHOULD STRIVE TO EXEMPLIFY OUR VALUES: HONOR THE INDIVIDUAL, CHAMPION LEARNING, TRANSFORM LIVES, WORK TOGETHER, AND PURSUE EXCELLENCE. THE UNIVERSITY OF DENVER DEEPLY VALUES INCLUSIVE EXCELLENCE, RECOGNIZING THAT ITS SUCCESS IS DEPENDENT ON HOW WELL IT VALUES, ENGAGES, AND INCLUDES THE RICH DIVERSITY OF CONSTITUENTS (TO LEARN MORE ABOUT INCLUSIVE EXCELLENCE AT THE UNIVERSITY OF DENVER, PLEASE VISIT HTTP://WWW.DU.EDU/CME/RESOURCES/INCLUSIVE-EXCELLENCE.HTML). OUR ADJUNCT FACULTY ACTIVELY CONTRIBUTE TO INCLUSIVE EXCELLENCE GOALS THROUGH THEIR TEACHING EFFORTS AND PROFESSIONAL WORK. UNIVERSITY COLLEGE BUILDS AN EDUCATIONAL COMMUNITY THAT EMBODIES VALUES OF INCLUSIVITY AND DIVERSITY. WE EMBRACE A COMMITMENT TO INCLUSIVE EXCELLENCE BY FOSTERING A WELCOMING ENVIRONMENT FOR OUR DIVERSE STUDENTS, STAFF, AND FACULTY TO LEARN AND GROW. WE EMBED THE VALUES OF DIVERSITY AND INCLUSIVITY IN ALL OUR PROGRAMS: LIFELONG LEARNING OPPORTUNITIES AND VARIED CURRICULAR OFFERINGS.\n\nTHE ROLE OF ADJUNCT FACULTY IN THE INFORMATION TECHNOLOGY PROGRAM IS TO TEACH GRADUATE STUDENTS IN OUR SOFTWARE DESIGN AND PROGRAMMING CONCENTRATION. PLEASE VISIT HTTPS://UNIVERSITYCOLLEGE.DU.EDU/IT/SOFTWARE-DESIGN-AND-PROGRAMMING-MASTERS-CONCENTRATION/ FOR A COMPLETE LIST OF PROGRAM CONCENTRATION COURSES. \n\nOUR COURSES ARE OFFERED IN MULTIPLE FORMATS INCLUDING ONLINE AND HYBRID (50% ON CAMPUS/50% ONLINE). WE ARE ACCEPTING APPLICATIONS FOR APPLICANTS THAT CAN TEACH IN ANY/ALL FORMATS AT THIS TIME. UNIVERSITY COLLEGE USES THE LEARNING MANAGEMENT SYSTEM (LMS) CANVAS FOR ALL COURSES, REGARDLESS OF DELIVERY MODE. INSTRUCTORS WILL RECEIVE A DESIGNED COURSE CONTAINER AND WILL BE EXPECTED TO MANAGE AND ENGAGE IN THE COURSE WHILE INFUSING REAL-WORLD EXAMPLES INTO THE CURRICULUM AND OFFERING A DIVERSITY OF PERSPECTIVES AS PRESENTED THROUGH MATERIALS, RESOURCES, AUTHORS/READINGS, AND SPEAKERS IF APPLICABLE.\n\nESSENTIAL FUNCTIONS\n\nADJUNCT FACULTY AT UNIVERSITY COLLEGE ARE SUBJECT MATTER EXPERTS IN THEIR FIELD AND INTEGRATE PROFESSIONALLY RELEVANT, DIVERSE EXAMPLES INTO THEIR TEACHING AND DISCUSSIONS. THEY ADHERE TO UNIVERSITY COLLEGE FACULTY TEACHING EXPECTATIONS AND MEET THE FOLLOWING EXPECTATIONS:\n\nPREPARE COURSE CONTAINER FOR THE QUARTER\n\nPREPARE AND POST COURSE SYLLABUS USING THE UNIVERSITY COLLEGE SYLLABUS TEMPLATE BY DEADLINES.UPDATE POLICIES, ENSURE CONTENT IS ERROR-FREE, AND BECOME FAMILIAR WITH ED-TECH TOOLS EMBEDDED INTO THE COURSE.\n\n\nPROVIDE SUBJECT MATTER EXPERTISE\n\nMAKE CLEAR TO STUDENTS HOW CONTENT IS PROFESSIONALLY APPLICABLE.FOSTER AND MODEL CRITICAL THINKING THROUGH VIDEOS THAT DEMONSTRATE OR EXPLAIN, DISCUSSIONS, AND/OR LIVE SYNCHRONOUS SESSIONS.\n\n\nMAINTAIN REGULAR AND CONSISTENT INSTRUCTOR PRESENCE IN YOUR COURSE\n\nINTEGRATE INSTRUCTOR-GENERATED WEEKLY VIDEOS.EMPLOY UNIVERSITY COLLEGE-SUPPORTED ED-TECH TOOLS.CONSISTENTLY AND EQUITABLY SUPPORT AND COMMUNICATE WITH EACH STUDENT.EMPLOY HIGHLY ENGAGED DISCUSSION FACILITATION.IN ONLINE CLASSES, ENGAGE IN DISCUSSION BOARDS WITH SUBSTANTIVE COMMENTS NO FEWER THAN THREE DAYS PER WEEK.\n\n\nPROVIDE SPECIFIC, RELEVANT, AND TIMELY FEEDBACK\n\nPROVIDE FEEDBACK ON STUDENT WORK WITHIN SEVEN DAYS OF SUBMISSION.USE GRADING RUBRICS FOR ALL ASSIGNMENTS.PROVIDE SPECIFIC GRADING COMMENTS THAT FOSTER GROWTH, IMPROVEMENT, AND LEARNING.\n\n\nFOSTER AN ENGAGED AND INCLUSIVE LEARNING ENVIRONMENT\n\nFOSTER AN ENVIRONMENT IN WHICH STUDENTS FEEL COMFORTABLE SHARING THEIR IDEAS, THOUGHTS, AND QUESTIONS.FACILITATE ACTIVE DISCUSSIONS THAT EMBRACE A DIVERSITY OF PERSPECTIVES.ENSURE THAT YOU AND YOUR STUDENTS ENGAGE IN PROFESSIONAL AND APPROPRIATE COMMUNICATION.UTILIZE AND ENGAGE DIVERSE PERSPECTIVES IN TEACHING MATERIALS AND PRACTICES.\n\n\nMODEL AND UPHOLD ACADEMIC STANDARDS\n\nREPORT CONCERNS REGARDING THE DU HONOR CODE.USE PLAGIARISM-DETECTION TOOL EMBEDDED IN CANVAS.\n\n\nKNOWLEDGE, SKILLS, AND ABILITIES\n\nEXTENSIVE KNOWLEDGE OF SOFTWARE DESIGN AND DEVELOPMENT, INCLUDING ONE OR MORE OF THE FOLLOWING COURSES:WEB ENABLED INFORMATION SYSTEMS (ICT 4300)OBJECT-ORIENTED METHODS AND PROGRAMMING I (ICT 4305)DISTRIBUTED COMPUTING (ICT 4310)OBJECT-ORIENTED METHODS AND PROGRAMMING II (ICT 4315).NET PROGRAMMING WITH C# (ICT 4351)JAVA PROGRAMMING (ICT 4361)PYTHON PROGRAMMING (ICT 4370)IOS APPLICATION DEVELOPMENT (ICT 4390)ANDROID APPLICATION DEVELOPMENT (ICT 4395)ABILITY TO SELECT THE MOST RELEVANT INSTRUCTIONAL MULTIMEDIA AND/OR TECH TOOLS, AND WRITE EFFECTIVE COPY, TEXTS, AUDIO, AND VIDEO SCRIPTS.KNOWLEDGE OF AND EXPERIENCE WITH HIGHER EDUCATION IN GENERAL AND ADULT LEARNERS IN PARTICULAR.PROVEN EXCELLENT PROJECT MANAGEMENT SKILLS.INFORMATION ANALYSIS AND MANAGEMENT SKILLS.EXCELLENT ORAL AND WRITTEN COMMUNICATION SKILLS.STRONG ORGANIZATIONAL SKILLS.ABILITY TO WORK INDEPENDENTLY AND IN GROUPS.STRONG DESIRE TO LEARN.ABILITY TO ADAPT PRIORITIES AND FOCUS.COMMITMENT TO SHOWCASING A DIVERSE RANGE OF PERSPECTIVES, EXPERTS, AUTHORS, AND RESOURCES.\n\n\nREQUIRED QUALIFICATIONS\n\nMUST RESIDE IN THE U.S.MASTER’S DEGREE IN A FIELD OF PROGRAM YOU ARE APPLYING TO TEACH OR A MASTER’S DEGREE AND INDUSTRY EXPERIENCE.SUCCESSFUL TEACHING/FACILITATION/TRAINING EXPERIENCE WITH ADULTS OR COMPLETION OF AN EDUCATION/TRAINING PROGRAM ON ADULT LEARNING.WORK OR ACADEMIC EXPERIENCE CONGRUENT WITH THE CONTENT OF A COURSE OR COURSES OFFERED WITHIN THE INFORMATION TECHNOLOGY PROGRAM.\n\n\nPREFERRED QUALIFICATIONS\n\nTERMINAL DEGREE IN A RELATED FIELD OR A TERMINAL DEGREE AND INDUSTRY EXPERIENCE.RECOGNITION OF PROFESSIONAL ACCOMPLISHMENT IN AN AREA OF EXPERTISE RELATED TO COURSE(S) WITHIN THE INFORMATION TECHNOLOGY PROGRAM.PUBLICATION OR PROFESSIONAL PRESENTATIONS IN THE INFORMATION TECHNOLOGY FIELD.LICENSING AND/OR CERTIFICATION BY PROFESSIONAL ORGANIZATIONS.COMPLETION OF AN EDUCATION OR TRAINING PROGRAM ON ADULT LEARNING OR INTERNSHIP/MENTORSHIP THAT ADDRESSES ADULT LEARNING PRINCIPLES AND PRACTICES.ABLE TO TEACH ON-CAMPUS AT THE UNIVERSITY OF DENVER.\n\n\nWORK SCHEDULE\n\nUNIVERSITY COLLEGE ADJUNCT FACULTY SCHEDULES VARY FROM TERM TO TERM BASED ON QUARTERLY COURSE ASSIGNMENTS AND PROGRAM MEETINGS. IMPORTANT DATES FOR EACH QUARTER CAN BE FOUND ON OUR WEBSITE: HTTPS://UNIVERSITYCOLLEGE.DU.EDU/IMPORTANT-DATES/.\n\nCOURSE RATE\n\nSTIPEND IS DETERMINED BY ENROLLMENT.\n\n3 STUDENTS $2,732\n\n4-5 STUDENTS $3,023\n\n6-8 STUDENTS $3,600\n\n9-14 STUDENTS $4,316\n\n15-20 STUDENTS $4,772\n\n21+ STUDENTS $4,900\n\nAPPLICATION DEADLINE\n\nAPPLICATIONS ARE CURRENTLY BEING ACCEPTED AND REVIEWED FOR THE 2024-2025 ACADEMIC YEAR, WITH THE POTENTIAL TO START IN FALL 2024 (SEPTEMBER).\n\nSPECIAL INSTRUCTIONS\n\nCANDIDATES MUST APPLY ONLINE THROUGH JOBS.DU.EDU TO BE CONSIDERED. ONLY APPLICATIONS SUBMITTED ONLINE WILL BE ACCEPTED.\n\nDURING THE APPLICATION PROCESS, YOU WILL BE ASKED TO COMPLETE A QUALTRICS SURVEY AND INCLUDE THE FOLLOWING:\n\nCVCOVER LETTER OUTLINING YOUR INTEREST IN TEACHING AT UNIVERSITY COLLEGE AND QUALIFICATIONSNAMES AND CONTACT INFORMATION FOR THREE REFERENCESUNOFFICIAL OR OFFICIAL TRANSCRIPTS OF YOUR HIGHEST DEGREEDIVERSITY STATEMENT\n\n\nTHE UNIVERSITY OF DENVER IS AN EQUAL OPPORTUNITY EMPLOYER. THE UNIVERSITY OF DENVER PROHIBITS DISCRIMINATION ON THE BASIS OF RACE, COLOR, NATIONAL ORIGIN, ANCESTRY, AGE, RELIGION, CREED, DISABILITY, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, GENDER EXPRESSION, MARITAL STATUS, PREGNANCY, GENETIC INFORMATION, MILITARY ENLISTMENT, OR VETERAN STATUS, AND ANY OTHER CLASS OF INDIVIDUALS PROTECTED FROM DISCRIMINATION UNDER FEDERAL, STATE, OR LOCAL LAW, REGULATION, OR ORDINANCE IN ANY OF THE UNIVERSITY'S EDUCATIONAL PROGRAMS AND ACTIVITIES, AND IN THE EMPLOYMENT (INCLUDING APPLICATION FOR EMPLOYMENT) AND ADMISSIONS (INCLUDING APPLICATION FOR ADMISSION) CONTEXT, AS REQUIRED BY TITLE IX OF THE EDUCATION AMENDMENTS OF 1972; THE AMERICANS WITH DISABILITIES ACT; SECTION 504 OF THE REHABILITATION ACT OF 1973; TITLE VI AND VII OF THE CIVIL RIGHTS ACT OF 1964; THE AGE DISCRIMINATION ACT OF 1975; THE AGE DISCRIMINATION IN EMPLOYMENT ACT OF 1967; EQUAL PAY ACT; COLORADO EQUAL PAY FOR EQUAL WORK ACT; THE COLORADO PROTECTING OPPORTUNITIES AND WORKERS' RIGHTS (\"POWR\") ACT; AND ANY OTHER FEDERAL, STATE, AND LOCAL LAWS, REGULATIONS, OR ORDINANCES THAT PROHIBIT DISCRIMINATION, HARASSMENT, AND/OR RETALIATION. FOR MORE INFORMATION, PLEASE SEE THE UNIVERSITY OF DENVER'S NON-DISCRIMINATION STATEMENT.\n\nALL OFFERS OF EMPLOYMENT ARE BASED UPON SATISFACTORY COMPLETION OF A CRIMINAL HISTORY BACKGROUND CHECK.",
    "job_skill_set": [
      "software design",
      "programming",
      "project management",
      "information analysis",
      "communication",
      "critical thinking",
      "organizational skills",
      "teamwork",
      "adaptability",
      "commitment to diversity",
      "engagement",
      "feedback provision",
      "independent work",
      "java",
      "python",
      ".net programming",
      "object-oriented programming",
      "web enabled information systems",
      "ios application development",
      "android application development",
      "learning management system (LMS)",
      "ed-tech tools",
      "inclusive teaching"
    ],
    "short_keywords": [
      "adaptability",
      "adjunct",
      "analysis",
      "and",
      "android",
      "application",
      "commitment",
      "communication",
      "critical",
      "design",
      "development",
      "diversity",
      "edtech",
      "enabled",
      "engagement",
      "faculty",
      "feedback",
      "inclusive",
      "independent",
      "information",
      "informationtechnology",
      "ios",
      "java",
      "learning",
      "lms",
      "management",
      "net",
      "objectoriented",
      "organizational",
      "programming",
      "project",
      "provision",
      "python",
      "skills",
      "software",
      "system",
      "systems",
      "teaching",
      "teamwork",
      "technology",
      "thinking",
      "to",
      "tools",
      "web",
      "work"
    ]
  },
  {
    "job_id": "3895217783",
    "job_title": "Senior Information Technology Project Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "MY PHARMACEUTICAL CLIENT IS ACTIVELY SEEKING A SR. PROJECT MANAGER TO SUPPORT A MAJOR CLINICAL TRIALS EFFORT OUT OF THEIR WAUKEGAN OFFICE.\nTHIS POSITION WILL BE 2-3 DAYS ONSITE IN WAUKEGAN, IL \nSPECIFIC RESPONSIBILITIES:DRIVE PROJECT SUCCESS AND COMPLETION: UNDERSTAND AND DRIVE LEADERSHIP OF THE PROJECT TO SUCCESS. BUILD KEY RELATIONSHIPS WITH STAKEHOLDERS, MENTOR TEAM MEMBERS AND DEMONSTRATE LEADERSHIP AT ALL LEVELS.INITIATE AND PLAN PROJECT: WORKS WITH BUSINESS AND IT MANAGEMENT TO ESTABLISH AND GAIN CONSENSUS ON PROJECT GOALS, OBJECTIVES, FINANCIALS, AND DELIVERABLES.PROJECT CONTROL: ASSESS THE DEGREE TO WHICH CHANGES TO SCOPE, ISSUES AND RISKS WILL AFFECT THE PROJECT, WORKING WITH BUSINESS AND IT MANAGEMENT AND SPONSOR TO GAIN AGREEMENT FOR RESOLUTION. MEASURE PERFORMANCE TO ASSURE THE PROJECT IS PROGRESSING AS COMPARED TO ORIGINAL PLAN AND BUDGET.EXECUTING AND CLOSING PROJECT: DEVELOPS AND EXECUTES A WORK PLAN OBTAINING AUTHORIZED RESOURCES TO ENSURE ALL ACTIVITIES ARE PERFORMED. LEADS TEAM IN DELIVERING PROJECT SCOPE. GATHER LESSONS LEARNED AND OBTAIN FINAL PROJECT APPROVAL FROM SPONSOR AND STAKEHOLDERS.PROJECT COMMUNICATION: COMMUNICATE PROJECT PROGRESS BY PRODUCING PROJECT REPORTS TO PROVIDE TIMELY AND ACCURATE PROJECT STATUS AND DECISION SUPPORT INFORMATION TO PROJECT TEAMS, BUSINESS, AND IT MANAGEMENT. MAKES RECOMMENDATIONS BASED ON CURRENT PROJECT STATUS TO RESOLVE ISSUES AND MANAGE RISKS.RESOURCE AND TEAM MANAGEMENT: COORDINATE RESOURCES TO ENSURE PROJECT NEEDS ARE ADDRESSED AND EFFECTIVELY ASSIGN TASKS AND DELIVERABLES TO TEAM MEMBERS BASED UPON THEIR ABILITIES. MOTIVATES PROJECT TEAM TO DELIVER PROJECT OUTCOMES.QUALITY MANAGEMENT: RESPONSIBLE FOR COMPLIANCE WITH APPLICABLE CORPORATE AND FUNCTIONAL POLICIES AND PROCEDURES.DECISIONS: MAKE DECISIONS THAT IMPACT PROJECT LEVEL ACTIVITIES.DRIVE CONTINUOUS IMPROVEMENT OF PROJECT PROCESS AND GOVERNANCE: WILL CONTINUALLY EXAMINE PLANS/RISKS/ISSUES TO IDENTIFY GAPS IN PROJECT COMMUNICATION OR PROCESS, AND HOLDING PROJECT TEAM ACCOUNTABLE FOR IMPROVEMENT, TO DRIVE PROACTIVE SOLUTIONS AS THE PROJECT IS ONGOING. ESCALATE ISSUES THAT NEED PERMANENT PROCESS CHANGES.\nPREFERRED QUALIFICATIONS:EXPERIENCE WITH USING CLARITY PPM.FAMILIARITY WITH ORGANIZATION CHANGE MANAGEMENT EXPERIENCE/KNOWLEDGE.",
    "job_skill_set": [
      "problem solving",
      "project management",
      "stakeholder management",
      "risk assessment",
      "resource management",
      "budget management",
      "Clarity PPM",
      "clinical trials",
      "quality management",
      "process improvement",
      "leadership",
      "communication",
      "team motivation",
      "mentoring",
      "decision making",
      "relationship building",
      "adaptability"
    ],
    "short_keywords": [
      "adaptability",
      "assessment",
      "budget",
      "building",
      "clarity",
      "clinical",
      "communication",
      "decision",
      "improvement",
      "information",
      "informationtechnology",
      "leadership",
      "making",
      "management",
      "manager",
      "mentoring",
      "motivation",
      "ppm",
      "problem",
      "process",
      "project",
      "quality",
      "relationship",
      "resource",
      "risk",
      "senior",
      "solving",
      "stakeholder",
      "team",
      "technology",
      "trials"
    ]
  },
  {
    "job_id": "3884433263",
    "job_title": "Information Technology Analyst II",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "DESCRIPTION  SUMMARY:THE PLANT INFORMATION TECHNOLOGY IT SPECIALIST ASSISTS THE PLANT IN IT MATTERS, INCLUDING: UNDERSTANDING AND USE OF AURIA CORPORATE POLICIES FOR USERS OF COMPUTERS, NETWORKS, AND PROGRAMS.SET-UP AND SUPPORT OF OFFICE AND PLANT FLOOR PCS AND RELATED APPLICATION PROGRAMS.THE OPERATION, SET-UP, AND CONFIGURATION OF BAR CODE SCANNERS AND HAND-HELD DEVICES.CONFIGURING, DEPLOYING, AND SUPPORTING LABEL PRINTERSDOCUMENTATION OF SHOP FLOOR INFORMATION TECHNOLOGY APPLICATIONS AND INSTALLATIONS.SUPPORT OF OFFICE STAFF APPLICATIONS RELATED TO MICROSOFT OFFICE, E-MAIL, PROJECTION SYSTEMS, AND DATA ENTRY SYSTEMS.SUPPORT OF SHOP FLOOR APPLICATIONS RELATED TO MACHINE AND PROCESS CONTROL SOFTWAREPARTICIPATION IN AND SUPPORT OF MATERIALS PROJECTS RELATED TO ERP AND EDI COMPLIANCE.PARTICIPATION IN AND SUPPORT OF PRODUCTION-DRIVEN PROJECTS RELATED TO INCREASED USE OF TECHNOLOGY ON THE SHOP FLOOR.BACKUP CRITICAL SYSTEMS AND MAINTAIN SPARE EQUIPMENT.MANAGE YEARLY RENEWALS OF SUPPORT CONTRACTS FOR HARDWARE AND SOFTWARE.\n\n ESSENTIALDUTIESANDRESPONSIBILITIESINCLUDE THE FOLLOWING. OTHER DUTIES MAY BE ASSIGNED. HELPS CORPORATE IT TO SET UP, TRAIN, AND SUPPORT USERS ON DESKTOP OR LAPTOP SYSTEMS, INCLUDING INSTALLATION AND CONFIGURATION OF STANDARD APPLICATIONS VIA OUR DESKTOP MANAGEMENT SOFTWARE.\n\nUNDERSTANDS AND FOLLOWS AURIA AND INDUSTRY-ACCEPTED BEST PRACTICES FOR APPLICATION, INSTALLATION, SET-UP, TRAINING, AND ONGOING SUPPORT TO USERS OF PC-BASED HARDWARE, NETWORKING, AND SOFTWARE APPLICATIONS.\n\nUNDERSTANDS THE BASIC APPLICATION, INSTALLATION, AND SUPPORT OF WIRELESS BARCODING PROGRAMS, INCLUDING LINKS TO VARIOUS TO-BE-IMPLEMENTED SYSTEMS FOR CAPTURING AND USING BARCODED INFORMATION.\n\nWORKS CLOSELY WITH MATERIALS, MANUFACTURING, QUALITY, CONTINUAL IMPROVEMENT, SAFETY, HUMAN RESOURCES, MAINTENANCE, AND FINANCE TO LINK VARIOUS APPLICATIONS TO ALL FUNCTIONS AS NECESSARY.\n\nHELPS TO SET-UP, TRAIN, SUPPORT, AND CONTINUOUSLY IMPROVE THE UNDERSTANDING, USE, AND APPLICATION OF NEW SOFTWARE TO ENHANCE BOTH HOURLY AND SALARY PRODUCTIVITY.\n\nSETUP, MAINTAIN, AND TROUBLESHOOT SITE INFRASTRUCTURE, INCLUDING SERVERS, SWITCHES, AND ACCESS POINTS. SCHEDULE REGULAR BACKUPS AND VERIFY BACKUPS INTEGRITY QUARTERLY.\n\nTROUBLESHOOTS EXISTING PC-BASED APPLICATIONS AND PROVIDES NECESSARY FIXES AND RETRAINING, IF NECESSARY, TO GET AT ROOT CAUSES OF PROBLEMS. DOCUMENTS PC APPLICATIONS WITH USERS FOR FOLLOW-UP AND SUPPORT.\n\nENSURE SARBANES OXLEY (SOX) AND CSOX IT POLICIES, AS WELL AS OTHER IT AND COMPANY POLICIES, ARE FOLLOWED.\n\nKEEPS TRACK OF SOFTWARE LICENSES FOR APPLICATIONS SUCH AS THE MICROSOFT OFFICE SUITE, WINDOWS SERVER, SQL SERVER, AND OTHERS, AND PROCURES THE NECESSARY LICENSES AS NECESSARY TO ENSURE COMPLIANCE.\n\nMONITORS THE HELP DESK QUEUE AND TAKES OWNERSHIP OF TICKETS ASSIGNED PROMPTLY AND WORKS TO RESOLVE AS QUICKLY AS POSSIBLE WHILE PROVIDING SUPERIOR CUSTOMER SERVICE.\n\nSUPPORTS PLANT LAUNCHES AS IT RELATES TO THE ASSOCIATED TECHNOLOGY.\n\nTRACKS AND MANAGES IT ASSETS (HARDWARE & SOFTWARE) THROUGHOUT THEIR LIFE CYCLE, AND PLANS FOR AND EXECUTES UPGRADES AND REPLACEMENTS REGULARLY TO ENSURE SUPPORT IS AVAILABLE FROM THE MANUFACTURERS.\n\nPLANS AND IMPLEMENTS SECURITY MEASURES TO PROTECT SYSTEMS FROM CYBERATTACKS OR OTHER VULNERABILITIES.\n\nPREPARES THE IT BUDGET AND PROCURES HARDWARE, SOFTWARE, AND SUPPORT CONTRACTS.\n\nSUPPORTS GLOBAL IT PROJECTS AND INITIATIVES, INCLUDING COMMUNICATING EFFECTIVELY WITH CORPORATE IT.\n\n JOB REQUIREMENTS :\n\n QUALIFICATIONREQUIREMENTS:MUST BE ABLE TO PERFORM PC-BASED HARDWARE, SOFTWARE, AND NETWORKING DUTIES SATISFACTORILY. THE REQUIREMENTS LISTED BELOW ARE REPRESENTATIVE OF THE KNOWLEDGE, SKILL, AND ABILITY REQUIRED. EDUCATIONANDEXPERIENCE: TECHNICAL KNOWLEDGE OF INFORMATION TECHNOLOGY (IT) SUBJECTS, INCLUDING A BASIC UNDERSTANDING OF PERSONAL COMPUTER (PC) HARDWARE, MS OFFICE APPLICATIONS INCLUDING WORD, POWERPOINT, EXCEL, AND OUTLOOK. EXPERIENCE WITH LAN INFRASTRUCTURE, VMWARE ESXI, MICROSOFT SERVERS, PRINTERS, COPIERS, PHONE & VOICEMAIL SYSTEMS, AND SERVER BACKUP SOFTWARE ARE PREFERRED.ASSOCIATE DEGREE OR HIGHER IN AN IT FIELD IS ALSO PREFERRED.\n MANUFACTURING PROCESS SKILLS: WORK WITH THE SHOP FLOOR, SUPERVISION, AND ENGINEERING PERSONNEL ON PC-BASED INFORMATION TECHNOLOGY TO SUPPORT EXISTING OR NEW PROCESSES. UNDERSTAND BASIC MANUFACTURING PROCESS FLOW CONCEPTS FOR FIRST-IN AND FIRST-OUT (FIFO), QUALITY CONTROL OF PROCESSES, FORGE AND MACHINE OPERATIONS AND SHOP FLOOR COMMUNICATIONS, AND JUST IN TIME MANUFACTURING PROCESSES.COMMUNICATE EFFECTIVELY WITH ALL LEVELS OF THE MANUFACTURING ORGANIZATION, INCLUDING HOURLY USERS ON THE SHOP FLOOR, SUPERVISORS, AND MANAGEMENT. PHYSICAL DEMANDS:THE PHYSICAL DEMANDS OF THE POSITION ARE THOSE THAT MUST BE MET BY AN EMPLOYEE TO PERFORM THE FUNCTIONS OF THE PLANT IT SUPPORT JOB SUCCESSFULLY. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS.\n\nOCCASIONALLY WHILE PERFORMING THE DUTIES OF THIS JOB, THE EMPLOYEE IS REQUIRED TO: STAND, WALK, SIT, USE HANDS TO HANDLE, OR FEEL OBJECTS, TOOLS, OR CONTROLS.REACH WITH HANDS AND ARMS, STOOP, KNEEL, CROUCH, OR CRAWL AND TALK OR HEAR.OCCASIONALLY LIFT AND MOVE UP TO 50 POUNDS.SPECIFIC VISION ABILITIES REQUIRED BY THIS JOB INCLUDE CLOSE VISION, DISTANCE VISION, COLOR VISION, PERIPHERAL VISION, DEPTH PERCEPTION, AND THE ABILITY TO ADJUST FOCUS.",
    "job_skill_set": [
      "PC Hardware",
      "Software Support",
      "Networking",
      "Microsoft Office Suite",
      "LAN Infrastructure",
      "VMware ESXi",
      "Microsoft Servers",
      "Printer Configuration",
      "Backup Software",
      "Barcode Scanning Systems",
      "ERP Systems",
      "Security Measures",
      "IT Asset Management",
      "Help Desk Support",
      "Technical Documentation",
      "Communication",
      "Customer Service",
      "Team Collaboration",
      "Problem Solving",
      "Training and Support",
      "Attention to Detail",
      "Project Management",
      "Adaptability",
      "EDI Compliance"
    ],
    "short_keywords": [
      "adaptability",
      "analyst",
      "and",
      "asset",
      "attention",
      "backup",
      "barcode",
      "collaboration",
      "communication",
      "compliance",
      "configuration",
      "customer",
      "desk",
      "detail",
      "documentation",
      "edi",
      "erp",
      "esxi",
      "hardware",
      "help",
      "ii",
      "information",
      "informationtechnology",
      "infrastructure",
      "it",
      "lan",
      "management",
      "measures",
      "microsoft",
      "networking",
      "office",
      "pc",
      "printer",
      "problem",
      "project",
      "scanning",
      "security",
      "servers",
      "service",
      "software",
      "solving",
      "suite",
      "support",
      "systems",
      "team",
      "technical",
      "technology",
      "to",
      "training",
      "vmware"
    ]
  },
  {
    "job_id": "3895543420",
    "job_title": "2024 Summer Audit Information Technology Intern Detroit, MI",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "LOCATION(S):\n\nFARMINGTON HILLS, MI OR AUBURN HILLS, MI -- AUDIT IT\n\nTHE AUDIT INFORMATION TECHNOLOGY INTERN WILL LEARN TO ANALYZE AND EVALUATE THE ADEQUACY OF THE DESIGN AND OPERATIONAL EFFECTIVENESS OF INTERNAL CONTROLS.\n\nSTART DATE: JANUARY AND MAY 2024 HYBRID/REMOTE FLEXIBILITY\n\nPOSITION COMPETENCIES \n\nSUCCESSFUL CANDIDATES POSSESS STRONG ORAL, WRITTEN, AND INTERPERSONAL COMMUNICATION SKILLS AS WELL AS STRONG ORGANIZATION SKILLS WITH THE ABILITY TO PRIORITIZE TASKS.\n\nPOSITION RESPONSIBILITIES\n\nCANDIDATES IN THIS POSITION WILL LEARN TO:\n\nEXECUTE AND DOCUMENT AUDIT PROGRAM TESTS FOR FINANCIAL, OPERATIONAL, AND/OR INFORMATION TECHNOLOGY AUDITS AND EXPRESS AN OPINION ON THE ADEQUACY OF THE DESIGN AND OPERATIONAL EFFECTIVENESS OF INTERNAL CONTROLS.DEVELOP WORK PAPERS THAT SUPPORT TESTS PERFORMED AND CONCLUSIONS REACHED.ANALYZE ROOT CAUSE OF AUDIT ISSUES AND ASSIST IN THE DEVELOPMENT AND DOCUMENTATION OF PRACTICAL RECOMMENDATIONS.PRACTICE ACTIVE LISTENING.INTERACT EFFECTIVELY WITH CLIENT PERSONNEL AND COLLEAGUES (VERBAL AND WRITTEN COMMUNICATIONS).MAINTAIN APPROPRIATE, CONSTRUCTIVE, AND PROFESSIONAL RELATIONSHIPS WITH CLIENTS AND COLLEAGUES BY BUILDING APPROPRIATE RAPPORT AND USING DIPLOMACY AND TACT.ASSIST WITH COMPLETION OF THE ANNUAL AUDIT PLAN BY MANAGING AND COMPLETING WORK WITHIN BUDGETED TIMEFRAMES, DATES, AND SCHEDULES.\n\nTRAVEL - TRAVEL REQUIRED BETWEEN AUBURN HILLS, LIVONIA, AND DETROIT.\n\nPOSITION QUALIFICATIONS\n\nCOLLEGE LEVEL OF JUNIOR OR SENIOR STATUSINFORMATION TECHNOLOGY, OR BUSINESS MAJOROVERALL GPA OF 2.5 OR BETTERSIX MONTHS WORD-PROCESSING, SPREADSHEET, AND DATABASE SOFTWARE EXPERIENCESIX MONTHS PROJECT COORDINATION/PARTICIPATION EXPERIENCE\n\nCOMERICA BANK CENTER (CBC)\n\nM-F 8AM-5PM",
    "job_skill_set": [
      "database software",
      "audit program tests",
      "internal controls",
      "financial audits",
      "operational audits",
      "information technology audits",
      "word processing",
      "spreadsheet software",
      "project coordination",
      "oral communication",
      "written communication",
      "interpersonal communication",
      "organization skills",
      "prioritization",
      "active listening",
      "relationship building",
      "diplomacy",
      "tact"
    ],
    "short_keywords": [
      "2024",
      "active",
      "audit",
      "audits",
      "building",
      "communication",
      "controls",
      "coordination",
      "database",
      "detroit",
      "diplomacy",
      "financial",
      "information",
      "informationtechnology",
      "intern",
      "internal",
      "interpersonal",
      "listening",
      "mi",
      "operational",
      "oral",
      "organization",
      "prioritization",
      "processing",
      "program",
      "project",
      "relationship",
      "skills",
      "software",
      "spreadsheet",
      "summer",
      "tact",
      "technology",
      "tests",
      "word",
      "written"
    ]
  },
  {
    "job_id": "3891072477",
    "job_title": "Senior Information Technology Project Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "NEWSOUTH TECHNOLOGIES IS IN SEARCH FOR A IS SEEKING AN EXPERT SR. IT PROJECT MANAGER TO MANAGE THE PLANNING AND IMPLEMENTATION OF A STATEWIDE IT PROJECT FOR THE STATE OF NC. THIS ROLE IS BASED IN THE RALEIGH, NC REGION.\n***THIS IS A 6-12 MONTH CONTRACT POSITION, WITH THE POSSIBILITY OF A LONG-TERM EXTENSION.***\n***THE SALARY RANGE FOR THIS ROLE IS ABOUT $55HR-$60HR DEPENDING ON THE IDEAL CANDIDATE'S BACKGROUND AND EXPERIENCE.***\n***THIS ROLE IS BASED IN THE RALEIGH, NC REGION. THIS IS A HYBRID POSITION AND THE IDEAL CANDIDATE MUST COME ON-SITE TO THE WORK-SITE OFFICE AS NEEDED PER WEEK/MONTH.***\n***PLEASE APPLY ONLY IF YOU ARE LOCAL TO THE RALEIGH, NC REGION.***\nJOB DESCRIPTION\nTHE STATE OF NC REQUIRES THE SERVICES OF A SENIOR PROJECT MANAGER TO MANAGE THE PLANNING AND IMPLEMENTATION OF NC BREAST AND CERVICAL CANCER CONTROL PROGRAM AND NC WISEWOMAN PROGRAM CENTRALIZED DATA MANAGEMENT SYSTEM (BCWWMS). THIS LEAD PROJECT MANAGEMENT ROLE WILL WORK WITH MULTIPLE INTERNAL AND EXTERNAL STAKEHOLDERS AND SELECTED VENDOR(S) TO ANALYZE, PLAN, AND IMPLEMENT THE NEW SYSTEM. THIS POSITION WILL BE RESPONSIBLE FOR WORKING WITH SENIOR-LEVEL BUSINESS EXECUTIVES, IT PERSONNEL, BUSINESS PROGRAM RESOURCES AND VENDOR STAFF TO EXECUTE PROJECT REQUIREMENTS AND MANAGE STAKEHOLDER EXPECTATIONS. THIS POSITION WILL MANAGE THE DAY-TO-DAY ACTIVITIES FOR THE PROJECT AND COMPLETE ALL INPUT TO THE STATE PROJECT MANAGEMENT (TOUCHDOWN) SYSTEM AS NEEDED. THE PROJECT WILL BE UTILIZING THE AGILE METHODOLOGY.\nRESPONSIBILITIES INCLUDE BUT ARE NOT LIMITED TO:• WORKING WITH THE STATE OF NC PROGRAMS TO OBTAIN A THOROUGH KNOWLEDGE OF THE NEEDS OF A CENTRALIZED DATA SYSTEM AND THE CONCERNS OF CDC’S REQUESTS FOR SUCH A SYSTEM• DEVELOPING AND MAINTAINING DETAILED PROJECT SCHEDULE, BUDGET AND MONITORING EXPENDITURES• DEVELOPING AND MAINTAINING ALL REQUIRED PROJECT MANAGEMENT ARTIFACTS FOLLOWING STATE AND PMBOK GUIDELINES• MANAGING SCOPE, RESOURCES, TIMELINES, COSTS/BUDGET, QUALITY, COMMUNICATION, AND PROCUREMENTS TO MEET THE GOALS OF THE STATE• WORKING CLOSELY WITH THE TEAM CONDUCTING ALTERNATIVE ANALYSIS AND WRITING DOCUMENTATION (INCLUDING AN RFP IF REQUIRED).• WORKING WITH VENDORS TO MANAGE DELIVERABLES TO ENSURE THAT ALL THE MILESTONES ARE MET• ENSURING THAT PROJECT PLANS AND SCHEDULES ARE ESTABLISHED AND MAINTAINED, ENSURING THAT DELIVERABLES ARE COMPLETED TIMELY AND ACCURATELY• ESTABLISHING PROJECT GOVERNANCE, CONDUCTING FORMAL PRESENTATIONS, COORDINATING WITH ALL PROJECT STAKEHOLDERS AND ENSURE THAT APPROPRIATE PROJECT CONTROLS ARE INSTITUTED• SERVING AS AN IT PROJECT LIAISON TO THE BUSINESS CLIENT• WORKING WITH BUSINESS STAKEHOLDERS TO DEVELOP NECESSARY PROJECT MANAGEMENT, CHANGE MANAGEMENT, RISK MANAGEMENT, ROLLOUT, AND TRAINING PLANS• WORKING WITH THE TECHNICAL TEAM TO ENSURE TECHNICAL READINESS DURING IMPLEMENTATION• DEVELOPING AND MAINTAINING ALL REQUIRED STATE CIO PROJECT DOCUMENTATION\nREQUIRED SKILLS INCLUDE:THE SELECTED CANDIDATE MUST BE A RESULTS-ORIENTED INDIVIDUAL WITH A VERY STRONG WORK ETHIC AND MUST BE ABLE TO DEMONSTRATE EXCELLENT IT PROJECT MANAGEMENT, NEGOTIATION, COMMUNICATION, AND PROBLEM-SOLVING SKILLS.• CAPABLE OF LEADING EFFECTIVE PROJECT MEETINGS THAT ARE TAILORED TO THE AUDIENCE• ABILITY TO CREATE SIMPLE TO COMPLEX PROJECT PLANS, TIMELINES AND WORK BREAKDOWN STRUCTURES USING PROJECT MANAGEMENT TOOLS• MUST HAVE PROFICIENCY IN PROJECT MANAGEMENT, AGILE, SCRUM, AND KANBAN SOFTWARE TOOLS• MUST HAVE STRATEGIC PLANNING SKILLS WITH GOOD UNDERSTANDING OF ROADMAP DEVELOPMENT.• ABILITY TO WRITE AND PRESENT EFFECTIVE PROJECT MATERIALS, INCLUDING PRESENTATIONS AND STATUS REPORTS• ABILITY TO WORK EFFECTIVELY WITH ALL LEVELS OF STAFF, CLIENTS AND OTHER IT PERSONNEL• PROVEN EXPERIENCE WITH WORKING COLLABORATIVELY WITH BUSINESS/PROGRAM PARTNERS• ABILITY TO EFFECTIVELY IDENTIFY AND RESOLVE SYSTEM OR BUSINESS PROCESS/PROJECT ISSUES• ABILITY TO BUILD, INFLUENCE, LEAD AND MOTIVATE EFFECTIVE TEAMS TOWARDS END RESULTS• FLEXIBILITY, ADAPTABILITY, AND ABILITY TO WORK IN A HIGH-DEMAND DYNAMIC ENVIRONMENT• STRONG ANALYTICAL SKILLS• STRONG WRITTEN AND ORAL COMMUNICATION SKILLS, INCLUDING DEVELOPMENT OF PROJECT• MUST HAVE EXPERIENCE WRITING RFPS/TECHNICAL WRITING• UNDERSTANDING OF THE FUNDAMENTALS OF ITERATIVE AND INCREMENTAL DEVELOPMENT• ABILITY TO HELP MANAGE SCRUM TEAM BACKLOG AND/OR KANBAN FLOW, AND PRIORITIES USING AGILE BASED TOOLS (SERVICENOW, JIRA, VERSION ONE ETC.)• EXPERIENCE IN PLAYING THE SCRUM MASTER ROLE FOR A SOFTWARE DEVELOPMENT / MAINTENANCE TEAM THAT WAS DILIGENTLY APPLYING AGILE / KANBAN VALUES AND PRINCIPLES AND PRACTICES• PROFICIENT IN CONDUCTING ALL THE SCRUM CEREMONIES WITHIN A COLLOCATED AS WELL AS DISTRIBUTED TEAMS• EXPERIENCE IN FACILITATING RELEASE PLANNING\nMANAGEMENT PREFERS APPLICANTS WITH THE FOLLOWING:• CANDIDATE WITH PMP CERTIFICATION. SCRUM MASTER CERTIFICATION IS A PLUS.• EXPERIENCE MANAGING OR SUPERVISING LEGACY SYSTEM UPGRADE AND/OR REPLACEMENT PROJECTS• EXPERIENCE COLLABORATING WITH STATE AND LOCAL GOVERNMENT• HEALTHCARE RELATED EXPERIENCE IS REQUIRED• KNOWLEDGE OF PUBLIC HEALTH PROGRAMS IS PREFERRED• EXPERIENCE PLANNING AND MANAGING DATA CONVERSION ACTIVITIES• EXPERIENCE BUILDING ROLLOUT PLANS",
    "job_skill_set": [
      "IT Project Management",
      "Project Management Tools",
      "Strategic Planning",
      "Technical Writing",
      "Data Management",
      "Budget Management",
      "Risk Management",
      "Change Management",
      "Healthcare Experience",
      "Public Health Knowledge",
      "Legacy System Upgrade",
      "Release Planning",
      "Communication",
      "Problem Solving",
      "Negotiation",
      "Team Leadership",
      "Flexibility",
      "Analytical Skills",
      "Collaboration",
      "Presentation Skills",
      "Stakeholder Management",
      "Adaptability",
      "Work Ethic",
      "Meeting Facilitation",
      "Influencing Skills",
      "Motivation",
      "Client Management",
      "Time Management",
      "Agile Methodology",
      "Scrum",
      "Kanban",
      "RFP Writing",
      "Data Conversion"
    ],
    "short_keywords": [
      "adaptability",
      "agile",
      "analytical",
      "budget",
      "change",
      "client",
      "collaboration",
      "communication",
      "conversion",
      "data",
      "ethic",
      "experience",
      "facilitation",
      "flexibility",
      "health",
      "healthcare",
      "influencing",
      "information",
      "informationtechnology",
      "it",
      "kanban",
      "knowledge",
      "leadership",
      "legacy",
      "management",
      "manager",
      "meeting",
      "methodology",
      "motivation",
      "negotiation",
      "planning",
      "presentation",
      "problem",
      "project",
      "public",
      "release",
      "rfp",
      "risk",
      "scrum",
      "senior",
      "skills",
      "solving",
      "stakeholder",
      "strategic",
      "system",
      "team",
      "technical",
      "technology",
      "time",
      "tools",
      "upgrade",
      "work",
      "writing"
    ]
  },
  {
    "job_id": "3884938374",
    "job_title": "Senior Information Technology Auditor",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "WE ARE SEEKING AN EXPERIENCED REGULATORY/AUDIT RESPONSE ASSOCIATE WITH A MINIMUM OF 5 YEARS’ EXPERIENCE IN THE BANKING & FINANCE INDUSTRY TO WORK WITHIN INFORMATION TECHNOLOGY DEPARTMENT TO HELP MANAGE TECHNOLOGY-SPECIFIC REGULATORY AND AUDIT REQUESTS AND EFFORTS TO ADDRESS CONTROL GAPS.THIS ROLE WILL WORK CLOSELY WITH IT DEVELOPMENT AND INFRASTRUCTURE TEAMS TO PROVIDE RESPONSES TO REQUESTS FROM THE REGULATORY LIAISON TEAM, INTERNAL AUDIT DEPARTMENT AND EXTERNAL AUDITORS. THE ROLE REQUIRES THE INDIVIDUAL TO MANAGE EXPECTATIONS, PRIORITIZE RESPONSES, REVIEW DOCUMENTATION TO ENSURE ALIGNMENT WITH REQUESTS, AND COORDINATE THE DELIVERY OF A QUALITY/TIMELY RESPONSE.\nROLE CAN BE LOCATED IN WHITE PLAINS\nROLE OBJECTIVESEFFECTIVELY COMMUNICATE WITH TECHNOLOGY STAKEHOLDERS AND AUDIT SENIOR MANAGEMENT TO CLEARLY ARTICULATE AUDIT REQUEST RESPONSES AND CORRECTIVE MEASURES.FACILITATE CONTROL READINESS AND PROCESSES TO ENSURE THAT KEY RISKS POTENTIALLY IMPACTING CONTROLS AND AUDITS ARE ADDRESSED.ENGAGE WITH INTERNAL AUDIT DEPARTMENT, IT RISK AND CONTROL TEAM TO SUPPORT RESPONSES TO FIRM CLIENTS CONCERNING AUDIT, REGULATORY AND COMPLIANCE CONTENTS AND RESULT.SUPPORT INTERNAL REGULATORY AND FINANCIAL REPORTING CONTROL TESTING, IDENTIFICATION OF OBSERVATIONS, RELEVANT COMPENSATING CONTROLS, REMEDIATION, VALIDATION AND CLOSURE OF OBSERVATIONS WITHIN AGREED TARGET DATES.WORK WITH INTERNAL AND EXTERNAL STAKEHOLDERS TO UNDERSTAND AND DOCUMENT VARIOUS CURRENT-STATE CONTROL PROCESSES AND ENSURE QUALITY STANDARDS ARE ACHIEVED IN DEVELOPMENT/MAINTENANCE OF PROGRAM DOCUMENTATION.EXAMINE RESULTS OF INTERNAL / EXTERNAL AUDITS FOR POTENTIAL CROSS-IMPACTS ON OTHER PROGRAMSTRACK AND COMMUNICATE OVERALL PROGRESS OF VARIOUS PROGRAM, ENSURING COMPLETE AND TIMELY REPORTING ON PROGRAM STATUS TO SENIOR MANAGEMENT STAKEHOLDERS.QUALIFICATIONS AND SKILLS5+ YEARS OF EXPERIENCE PREFERABLY IN THE FINANCIAL INDUSTRY.GOOD KNOWLEDGE OF IT GOVERNANCE AND CONTROLS IS A MUST.EXPERIENCE WITH AUDITS IS A MUST, PREFERABLY AS AN INTERNAL OR EXTERNAL AUDITOR.BASIC TECHNICAL UNDERSTANDING OF APPLICATION DESIGN AND SDLC.GOOD KNOWLEDGE OF PROJECT MANAGEMENT, VENDOR MANAGEMENT, AND ABILITY TO IDENTIFY CRITICAL PATHS AND ISSUES.STRONG SKILLS WORKING WITH MS EXCEL, MS PROJECT, MS WORD, MS POWER POINT, MS TEAMS, & MS SHAREPOINT. JIRA AND POWERBI EXPERIENCE IS A PLUS.STRONG COMMUNICATION/PRESENTATION SKILLS (WRITTEN AND ORAL) IN CROSS-CULTURAL BUSINESS ENVIRONMENT.STRONG WORK ETHIC WITH FOCUS ON MEETING DEADLINES AND OBJECTIVES.MUST BE HIGHLY ENERGETIC, DETAIL-ORIENTATED, AND EXTREMELY PROACTIVE, AND BE ABLE TO PERFORM UNDER PRESSURE IN A CHALLENGING ENVIRONMENT.BACHELOR'S DEGREE.",
    "job_skill_set": [
      "IT governance",
      "audits",
      "application design",
      "SDLC",
      "project management",
      "vendor management",
      "MS Project",
      "communication",
      "presentation skills",
      "work ethic",
      "detail-oriented",
      "proactive",
      "ability to perform under pressure",
      "time management",
      "MS Excel",
      "MS Word",
      "MS PowerPoint",
      "MS Teams",
      "MS SharePoint",
      "JIRA",
      "Power BI"
    ],
    "short_keywords": [
      "ability",
      "application",
      "auditor",
      "audits",
      "bi",
      "communication",
      "design",
      "detailoriented",
      "ethic",
      "excel",
      "governance",
      "information",
      "informationtechnology",
      "it",
      "jira",
      "management",
      "ms",
      "perform",
      "power",
      "powerpoint",
      "presentation",
      "pressure",
      "proactive",
      "project",
      "sdlc",
      "senior",
      "sharepoint",
      "skills",
      "teams",
      "technology",
      "time",
      "to",
      "under",
      "vendor",
      "word",
      "work"
    ]
  },
  {
    "job_id": "3903819301",
    "job_title": "Information Technology Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "OVERVIEWT-SOLUTIONS IS THE COMPANY PEOPLE WANT TO WORK FOR AND WORK WITH WHEN SEEKING GLOBAL SERVICES AND INNOVATIVE SOLUTIONS. WE EMPLOY HIGHLY QUALIFIED AND UNIQUELY SKILLED PROFESSIONALS WHO ARE COMMITTED TO PROVIDING SERVICES WITH INTEGRITY. WE ARE THE PREFERRED PARTNER TO DELIVER EXCELLENCE AND TO ENRICH OUR CLIENTS, EMPLOYEES, AND COMMUNITIES.\nWHO WE ARET-SOLUTIONS IS A WOMAN-OWNED, VETERAN-OWNED BUSINESS HEADQUARTERED IN CHESAPEAKE, VIRGINIA THAT CREATES EXCEPTIONAL, RESPONSIVE SOLUTIONS TO COMPLEX CHALLENGES FOR OUR GLOBAL CLIENTS IN THE FIELD OF GOVERNMENT CONTRACTING. WE ARE AN INNOVATIVE, AGILE PROVIDER OF SPECIALIZED, TECHNICAL SOLUTIONS AND AN EXCEPTIONAL CACHE OF CAPABILITIES THAT ENABLE MISSION-CRITICAL OPERATIONS AND DECISION MAKING. WE PROVIDE THE EXPERTISE AND GUIDANCE NEEDED TO HELP CUSTOMERS SUCCEED IN TODAY’S ERA OF DEFENSE, SECURITY, MAINTENANCE ENGINEERING, LOGISTICS, AND BUSINESS TRANSFORMATION. OUR CORE COMPETENCIES ARE ALIGNED WITH THE CURRENT NEEDS OF OUR CUSTOMERS; AND THOSE COMPETENCIES ANTICIPATE AND FACILITATE WORK WITH OUR CUSTOMERS TO ADDRESS THEIR FUTURE NEEDS. WE ARE CONTINUALLY STRIVING TO ADAPT EMERGING AND PROVEN TECHNOLOGIES TO FURTHER ENHANCE THE ABILITIES OF OUR CUSTOMERS AND PARTNERS.\nESSENTIAL DUTIES AND RESPONSIBILITIESTHE IT SPECIALIST/WINDOWS WILL HAVE ADEQUATE EXPERIENCE AND TRAINING TO EFFECTIVELY PERFORM THE DUTIES LISTED BELOW:INSTALL HARDWARE, BUILD SOFTWARE, CONFIGURE, AND MAINTAIN WINDOWS SERVERS AND WORKSTATIONS.CREATE AND ADMINISTER USER ACCOUNTS, SECURITY GROUPS, AND GROUP POLICY.CONDUCT BACKUPS AND SYSTEM RECOVERIES.CONFIGURE AND MANAGE PATCHING SOLUTIONS AND LOG COLLECTION.PROVIDE TECHNICAL SUPPORT TO ONSITE USERS.MAINTAIN COMPLIANCE WITH DOD SECURITY TECHNICAL CONFIGURATION GUIDES (STIGS).INVESTIGATION TROUBLE CALLS, ISOLATE FAULTS, IDENTIFY AND IMPLEMENT CORRECTIVE ACTIONS TO RESTORE INFORMATION SYSTEMS OPERATIONS.\nTRAVELTHIS POSITION INCLUDES A LOW LEVEL OF TRAVEL.\nEDUCATION, KNOWLEDGE, EXPERIENCE, SKILLS AND ABILITIES REQUIREDBACHELOR'S DEGREE, PREFERABLY IN INFORMATION SYSTEMS, COMPUTER SCIENCE, OR RELATED DISCIPLINE.RELEVANT OPERATING SYSTEM TRAINING: MS WINDOWS 10, MS SERVER 2012/2016/2019.TWO OR MORE YEARS OF RELEVANT EXPERIENCE. RELEVANT EXPERIENCE TO INCLUDE MS WINDOWS 7/10, MS SERVER 2008/2012/2016, WSUS, SIEM PRODUCTS, VIRTUALIZATION SOFTWARE, MS SQL DATABASE, DISA STIGS, SHAVLIK, ASSURED COMPLIANCE ASSESSMENT SOLUTION/NESSUS, PKI, STORAGE AREA NETWORKS, BACKUP/RESTORE SOLUTIONS, AND DNS.\nCERTIFICATES, LICENSES, REGISTRATIONSREQUIRE ONE OF THE FOLLOWING DOD 8570.01-M IAT LEVEL II OR LEVEL III CERTIFICATIONS:CCNA SECURITYCYSA+GICSPGSECSECURITY+ CECNDSSCPCASP+ CECCNP SECURITYCISACISSP (OR ASSOCIATE)GCEDGCIHCCSP\nQUALIFICATIONSACTIVE DOD SECRET SECURITY CLEARANCE IS HIGHLY DESIRED, HOWEVER CANDIDATES WHO ARE ELIGIBLE TO OBTAIN AND MAINTAIN A DOD SECRET SECURITY CLEARANCE WILL BE CONSIDERED. IF THE SELECTED CANDIDATE DOES NOT HOLD AN ACTIVE CLEARANCE, HE/SHE WILL RECEIVE A CONTINGENT OFFER. A START DATE WILL BE ESTABLISHED ONCE AN INTERIM SECRET CLEARANCE IS GRANTED.U.S CITIZENSHIP REQUIRED.MUST POSSESS A VALID DRIVER’S LICENSE.MUST HAVE RELIABLE TRANSPORTATION TO AND FROM VARIOUS WORK LOCATIONS.\nPHYSICAL REQUIREMENTSSITTING FOR LONG PERIODS OF TIME, STANDING, WALKING, CROUCHING, AND KNEELING.REACHING, HANDLING, USING EQUIPMENT, KEYBOARDS, AND MOBILE DEVICES.LIFTING BOXES (FILES AND SUPPLIES) UP TO 20 LBS.\nT-SOLUTIONS IS PROUD TO BE AN AFFIRMATIVE ACTION/EQUAL OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, OR PROTECTED VETERAN STATUS AND WILL NOT BE DISCRIMINATED AGAINST ON THE BASIS OF DISABILITY.  T-SOLUTIONS IS PROUD TO BE A VETERAN-FRIENDLY EMPLOYER. T-SOLUTIONS DOES NOT DISCRIMINATE AGAINST A QUALIFIED APPLICANT BECAUSE OF THEIR STATUS AS A PROTECTED VETERAN, OR THEIR RELATIONSHIP OR ASSOCIATION WITH A PROTECTED VETERAN. THIS INCLUDES SPOUSES AND OTHER FAMILY MEMBERS.",
    "job_skill_set": [
      "Security Compliance (DOD STIGs)",
      "MS SQL Database",
      "Software Building",
      "Technical Support",
      "Problem Solving",
      "Communication",
      "Teamwork",
      "Adaptability",
      "Attention to Detail",
      "Integrity",
      "Windows Server",
      "Windows 10",
      "User Account Administration",
      "Backup and Recovery Solutions",
      "Patching Solutions",
      "Virtualization Software",
      "SIEM Products",
      "DNS Management",
      "PKI",
      "Storage Area Networks",
      "Nessus",
      "Shavlik",
      "Assured Compliance Assessment Solution",
      "WSUS",
      "Hardware Installation",
      "Customer Service"
    ],
    "short_keywords": [
      "10",
      "account",
      "adaptability",
      "administration",
      "and",
      "area",
      "assessment",
      "assured",
      "attention",
      "backup",
      "building",
      "communication",
      "compliance",
      "customer",
      "database",
      "detail",
      "dns",
      "dod",
      "hardware",
      "information",
      "informationtechnology",
      "installation",
      "integrity",
      "management",
      "ms",
      "nessus",
      "networks",
      "patching",
      "pki",
      "problem",
      "products",
      "recovery",
      "security",
      "server",
      "service",
      "shavlik",
      "siem",
      "software",
      "solution",
      "solutions",
      "solving",
      "specialist",
      "sql",
      "stigs",
      "storage",
      "support",
      "teamwork",
      "technical",
      "technology",
      "to",
      "user",
      "virtualization",
      "windows",
      "wsus"
    ]
  },
  {
    "job_id": "3895207569",
    "job_title": "Information Technology Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "THIS IS A FULLY ONSITE ROLE IN JESSUP, MD.\nOUR GROWING MODULAR CLIENT IS LOOKING TO BUILD OUT AN INTERNAL IT TEAM. THIS IS A GREAT OPPORTUNITY TO HIT THE GROUND RUNNING AND BRING YOUR EXPERTISE AND IDEAS TO A GREAT TEAM/ CULTURE. \nQUALIFICATIONS AND SKILLS:BACHELOR’S DEGREE IN COMPUTER SCIENCE, INFORMATION TECHNOLOGY, OR RELATED FIELD.PROVEN EXPERIENCE AS AN IT MANAGER OR SIMILAR ROLE, PREFERABLY IN A SMALL TO MEDIUM-SIZED BUSINESS ENVIRONMENT.FAMILIARITY WITH SOFTWARE LICENSING AGREEMENTS, PROCUREMENT PROCESSES, AND BUDGET MANAGEMENT.ABILITY TO WORK COLLABORATIVELY IN A DYNAMIC, FAST-PACED ENVIRONMENT, WHILE ALSO BEING ABLE TO WORK INDEPENDENTLY.STRONG KNOWLEDGE OF IT SYSTEMS, NETWORKS, AND VARIOUS TECHNOLOGIES.EXCELLENT PROBLEM-SOLVING AND PROJECT MANAGEMENT SKILLS.ABILITY TO EXPLAIN COMPLEX IT CONCEPTS IN SIMPLE TERMS.STRONG LEADERSHIP AND DECISION-MAKING SKILLS.EXCELLENT ORGANIZATIONAL AND TIME-MANAGEMENT SKILLS.GOOD INTERPERSONAL AND COMMUNICATION SKILLS.\nPOSITION SUMMARY:WE ARE SEEKING A DYNAMIC AND EXPERIENCED IT MANAGER TO OVERSEE OUR TECHNOLOGY OPERATIONS AND TO DEVELOP AND IMPLEMENT IT STRATEGIES THAT ALIGN WITH OUR BUSINESS OBJECTIVES. THE IT MANAGER WILL BE RESPONSIBLE FOR MANAGING OUR IT INFRASTRUCTURE, ENSURING SYSTEM SECURITY, PROVIDING TECHNICAL SUPPORT, AND LEADING IT PROJECTS TO IMPROVE OUR OVERALL EFFICIENCY AND EFFECTIVENESS. THIS ROLE IS PIVOTAL IN ENABLING OUR SMALL COMPANY TO OPERATE SMOOTHLY AND TO LEVERAGE TECHNOLOGY FOR SUSTAINABLE GROWTH.\nKEY RESPONSIBILITIES:LEADERSHIP AND STRATEGY:DEVELOP AND IMPLEMENT IT POLICIES AND STRATEGIES TO SUPPORT THE COMPANY'S GOALS.MANAGE IT BUDGETS, ENSURING COST-EFFECTIVENESS AND RETURN ON INVESTMENT.STAY ABREAST OF TECHNOLOGY TRENDS AND ADVANCEMENTS TO DRIVE INNOVATION WITHIN THE COMPANY.COMPUTER HARDWARE, INCLUDING LAPTOPS AND TABLETS, FOR EMPLOYEES WHILE ADHERING TO BUDGETARY GUIDELINES AND TECHNOLOGY STANDARDS.UP TO DATE ON THE LATEST PROCESS AND IT ADVANCEMENTS TO AUTOMATE AND MODERNIZE SYSTEMS.WITH MANAGEMENT TEAM TO DEVELOP AND KEEP UPDATED STANDARD OPERATING PROCEDURES FOR AREAS OF RESPONSIBILITIES.\nIT INFRASTRUCTURE AND SECURITY:OVERSEE THE MANAGEMENT AND MAINTENANCE OF THE COMPANY’S IT HARDWARE, SOFTWARE, AND NETWORKS.ENSURE DATA SECURITY, NETWORK ACCESS, AND BACKUP SYSTEMS ARE IN PLACE AND EFFECTIVE.MANAGE AND TROUBLESHOOT IT INFRASTRUCTURE ISSUES, ENSURING MINIMAL DOWNTIME.THE SOFTWARE INSTALLATION PROCESS ACROSS THE ORGANIZATION, ENSURING COMPATIBILITY, SECURITY, AND OPTIMAL PERFORMANCE OF APPLICATIONS.AND MAINTAIN SOFTWARE LICENSES, ENSURING COMPLIANCE WITH VENDOR AGREEMENTS AND OPTIMIZING SOFTWARE UTILIZATION.\nPROJECT MANAGEMENT:LEAD IT PROJECTS, INCLUDING SYSTEM UPDATES, MIGRATIONS, AND IMPLEMENTATIONS, ENSURING THEY ARE DELIVERED ON TIME AND WITHIN BUDGET.LEAD THE SOFTWARE INSTALLATION PROCESS ACROSS THE ORGANIZATION, ENSURING COMPATIBILITY, SECURITY, AND OPTIMAL PERFORMANCE OF APPLICATIONS.COORDINATE WITH EXTERNAL VENDORS AND SERVICE PROVIDERS AS NECESSARY.\nDOCUMENTATION AND COMPLIANCE:MAINTAIN ESSENTIAL IT DOCUMENTATION (E.G., SYSTEM CONFIGURATIONS, PROCEDURES, AND POLICIES).ENSURE IT PRACTICES COMPLY WITH RELEVANT LAWS AND REGULATIONS.",
    "job_skill_set": [
      "IT management",
      "network management",
      "software installation",
      "data security",
      "project management",
      "procurement processes",
      "IT infrastructure",
      "technical support",
      "system troubleshooting",
      "technology trends",
      "leadership",
      "communication",
      "problem solving",
      "organizational skills",
      "time management",
      "interpersonal skills",
      "collaboration",
      "decision making",
      "adaptability",
      "budget management",
      "software licensing"
    ],
    "short_keywords": [
      "adaptability",
      "budget",
      "collaboration",
      "communication",
      "data",
      "decision",
      "information",
      "informationtechnology",
      "infrastructure",
      "installation",
      "interpersonal",
      "it",
      "leadership",
      "licensing",
      "making",
      "management",
      "manager",
      "network",
      "organizational",
      "problem",
      "processes",
      "procurement",
      "project",
      "security",
      "skills",
      "software",
      "solving",
      "support",
      "system",
      "technical",
      "technology",
      "time",
      "trends",
      "troubleshooting"
    ]
  },
  {
    "job_id": "3888035176",
    "job_title": "Information Technology Specialist (CUSTSPT) with Security Clearance",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "DUTIES * DIAGNOSES AND RESOLVES PROBLEMS IN RESPONSE TO CUSTOMER REPORTED INCIDENTS. * ASSISTS FUNCTIONAL USERS IN RESOLVING TECHNICAL COMPUTER PROBLEMS AND MALFUNCTIONS. * DETERMINES THE EXACT NATURE OF THE PROBLEM BY COLLECTING INFORMATION FROM CALLERS TO BE USED IN THE TROUBLESHOOTING AND RESTORATION OF COMPUTER OR NETWORK/TELECOMMUNICATIONS SERVICES. * ENTERS INFORMATION COLLECTED INTO AN AUTOMATED TROUBLE TICKET SYSTEM. * DEVELOPS, COORDINATES, AND ASSISTS IN THE INSTALLATION, CONFIGURATION, UTILIZATION, AND OPERATION OF IT EQUIPMENT AS EITHER STAND-ALONE EQUIPMENT OR CONNECTED TO A NETWORK. * PROVIDES TECHNICAL SUPPORT TO USERS FOR COMPUTER SOFTWARE. * ANALYZES SOFTWARE SYSTEM FAILURES. * INSTALLS NEW SOFTWARE VERSIONS, AND UPDATES; ADAPTS, CONFIGURES, AND TESTS COMPUTER SOFTWARE, HARDWARE, AND/OR USER SYSTEMS FOR EFFECTIVE INTEGRATION OF SOFTWARE SYSTEMS, SUCH AS, WINDOWS OPERATING SYSTEMS. REQUIREMENTS CONDITIONS OF EMPLOYMENT * APPOINTMENT MAY BE SUBJECT TO A SUITABILITY OR FITNESS DETERMINATION, AS DETERMINED BY A COMPLETED BACKGROUND INVESTIGATION. * THREE YEAR TRIAL/PROBATIONARY PERIOD MAY BE REQUIRED. * THIS POSITION REQUIRES THE INCUMBENT BE ABLE TO OBTAIN AND MAINTAIN A DETERMINATION OF ELIGIBILITY FOR A SECRET SECURITY CLEARANCE OR ACCESS FOR THE DURATION OF EMPLOYMENT. * DUE TO THE NATURE OF THIS POSITION, EMPLOYEES ARE REQUIRED TO WORK BOTH PLANNED AND UNSCHEDULED OVERTIME. * THIS POSITION REQUIRES THE INCUMBENT TO OBTAIN AND MAINTAIN THE APPROPRIATE INFORMATION ASSURANCE CERTIFICATION IN ACCORDANCE WITH DOD 8570.01-M, INFORMATION ASSURANCE WORKFORCE IMPROVEMENT PROGRAM, WITHIN 6 MONTHS OF ENTRY ONTO DUTY. QUALIFICATIONS THIS POSITION IS IN THE PROFESSIONAL WORK CATEGORY AT THE FULL PERFORMANCE WORK LEVEL WITHIN THE CES OCCUPATIONAL STRUCTURE. WHO MAY APPLY: ONLY APPLICANTS WHO MEET ONE OF THE EMPLOYMENT AUTHORITY CATEGORIES BELOW ARE ELIGIBLE TO APPLY FOR THIS JOB. YOU WILL BE ASKED TO IDENTIFY WHICH CATEGORY OR CATEGORIES YOU MEET, AND TO PROVIDE DOCUMENTS WHICH PROVE YOU MEET THE CATEGORY OR CATEGORIES YOU SELECTED. SEE PROOF OF ELIGIBILITY FOR AN EXTENSIVE LIST OF DOCUMENT REQUIREMENTS FOR ALL EMPLOYMENT AUTHORITIES. * CURRENT ARMY CYBER EXCEPTED SERVICE (CES) EMPLOYEE\n\n CURRENT ARMY DEFENSE CIVILIAN INTELLIGENCE PERSONNEL SYSTEM (DCIPS) EMPLOYEE CURRENT CIVILIAN EMPLOYEES OF THE ORGANIZATION APPLYING TO CYBER EXCEPTED SERVICE (CES) POSITIONS CURRENT DEPARTMENT OF ARMY CIVILIAN EMPLOYEES CURRENT DOD CYBER EXCEPTED SERVICE (CES) EMPLOYEE (NON-ARMY) CURRENT PERMANENT DOD CIVILIAN EMPLOYEE (NON-ARMY) APPLYING TO CYBER EXCEPTED SERVICE POSITIONS\n\n* NON-DEPARTMENT OF DEFENSE (DOD) TRANSFER APPLYING TO CYBER EXCEPTED SERVICE POSITIONS ARMY CES POSITIONS APPLY VETERAN'S PREFERENCE TO PREFERENCE ELIGIBLE CANDIDATES, AS DEFINED BY SECTION 2108 OF TITLE 5 U.S.C., IN ACCORDANCE WITH THE PROCEDURES PROVIDED IN DOD INSTRUCTION 1400.25, VOLUME 3005, \"CES EMPLOYMENT AND PLACEMENT\". IF YOU ARE A VETERAN CLAIMING VETERANS' PREFERENCE, AS DEFINED BY SECTION 2108 OF TITLE 5 U.S.C., YOU MUST SUBMIT DOCUMENTS VERIFYING YOUR ELIGIBILITY WITH YOUR APPLICATION PACKAGE. IN ORDER TO QUALIFY, YOU MUST MEET THE EDUCATION AND/OR EXPERIENCE REQUIREMENTS DESCRIBED BELOW. EXPERIENCE REFERS TO PAID AND UNPAID EXPERIENCE, INCLUDING VOLUNTEER WORK DONE THROUGH NATIONAL SERVICE PROGRAMS (E.G., PEACE CORPS, AMERICORPS) AND OTHER ORGANIZATIONS (E.G., PROFESSIONAL; PHILANTHROPIC; RELIGIOUS; SPIRITUAL; COMMUNITY; STUDENT; SOCIAL). YOU WILL RECEIVE CREDIT FOR ALL QUALIFYING EXPERIENCE, INCLUDING VOLUNTEER EXPERIENCE. YOUR RESUME MUST CLEARLY DESCRIBE YOUR RELEVANT EXPERIENCE; IF QUALIFYING BASED ON EDUCATION, YOUR TRANSCRIPTS WILL BE REQUIRED AS PART OF YOUR APPLICATION. ADDITIONAL INFORMATION ABOUT TRANSCRIPTS IS IN THIS DOCUMENT . TO QUALIFY BASED ON YOUR EXPERIENCE, YOUR RESUME MUST DESCRIBE ONE YEAR OF SPECIALIZED EXPERIENCE THAT DEMONSTRATES THE POSSESSION OF KNOWLEDGE, SKILLS, ABILITIES, AND COMPETENCIES NECESSARY FOR IMMEDIATE SUCCESS IN THE POSITION. SUCH EXPERIENCE IS TYPICALLY IN OR DIRECTLY RELATED TO THE WORK OF THE POSITION TO BE FILLED. SPECIALIZED EXPERIENCE WOULD BE DEMONSTRATED BY HAVING EXPERIENCE RESOLVING CUSTOMER QUESTIONS OR PROBLEMS CONCERNING INFORMATION TECHNOLOGY (IT) AUTOMATION SYSTEMS, SOFTWARE AND/OR HARDWARE PROBLEMS, PASSWORD VIOLATIONS, AND TELECOMMUNICATION TROUBLES AND WORK ORDERS; DIAGNOSING AND RESOLVING PROBLEMS IN RESPONSE TO CUSTOMER REPORTED INCIDENTS; ASSISTING FUNCTIONAL USERS IN RESOLVING TECHNICAL COMPUTER PROBLEMS AND MALFUNCTIONS; DEVELOPING, COORDINATING, AND ASSISTING IN THE INSTALLATION, CONFIGURATION, UTILIZATION, AND OPERATION OF IT EQUIPMENT AS EITHER STAND-ALONE EQUIPMENT OR CONNECTED TO A NETWORK; PROVIDING TECHNICAL SUPPORT TO USERS FOR COMPUTER SOFTWARE. THE OPM QUALIFICATION STANDARD PROVIDES THE FOLLOWING DEFINITION: SPECIALIZED EXPERIENCE IS EXPERIENCE THAT HAS EQUIPPED THE APPLICANT WITH THE PARTICULAR COMPETENCIES/KNOWLEDGE, SKILLS, AND ABILITIES TO SUCCESSFULLY PERFORM THE DUTIES OF THE POSITION AND IS TYPICALLY IN OR RELATED TO THE WORK OF THE POSITION TO BE FILLED. SUCH EXPERIENCE IS TYPICALLY GAINED IN THE IT FIELD OR THROUGH THE PERFORMANCE OF WORK WHERE THE PRIMARY CONCERN IS IT]. MY SPECIALIZED EXPERIENCE INCLUDES, OR WAS SUPPLEMENTED BY, INFORMATION TECHNOLOGY RELATED EXPERIENCE (PAID OR UNPAID EXPERIENCE AND/OR COMPLETION OF SPECIFIC, INTENSIVE TRAINING, AS APPROPRIATE) WHICH DEMONSTRATES EACH OF THE FOUR COMPETENCIES, AS DEFINED: (1) ATTENTION TO DETAIL - IS THOROUGH WHEN PERFORMING WORK AND CONSCIENTIOUS ABOUT ATTENDING TO DETAIL. EXAMPLES OF IT-RELATED EXPERIENCE DEMONSTRATING THIS COMPETENCY INCLUDE: COMPLETING THOROUGH AND ACCURATE WORK INDEPENDENTLY, EVEN IN THE MOST DIFFICULT OR STRESSFUL SITUATIONS; OCCASIONALLY REVIEWING WORK COMPLETED BY OTHERS. (2) CUSTOMER SERVICE - WORKS WITH CLIENTS AND CUSTOMERS (THAT IS, ANY INDIVIDUALS WHO USE OR RECEIVE THE SERVICES OR PRODUCTS THAT YOUR WORK UNIT PRODUCES, INCLUDING THE GENERAL PUBLIC, INDIVIDUALS WHO WORK IN THE AGENCY, OTHER AGENCIES, OR ORGANIZATIONS OUTSIDE THE GOVERNMENT) TO ASSESS THEIR NEEDS, PROVIDE INFORMATION OR ASSISTANCE, RESOLVE THEIR PROBLEMS, OR SATISFY THEIR EXPECTATIONS; KNOWS ABOUT AVAILABLE PRODUCTS AND SERVICES; IS COMMITTED TO PROVIDING QUALITY PRODUCTS AND SERVICES. EXAMPLES OF IT-RELATED EXPERIENCE DEMONSTRATING THIS COMPETENCY INCLUDE: RESOLVING ROUTINE AND NON-ROUTINE PROBLEMS, QUESTIONS, OR COMPLAINTS; DEVELOPING AND MAINTAINING STRONG, MUTUALLY SUPPORTIVE WORKING RELATIONSHIPS WITH CUSTOMERS; CONDUCTING EVALUATION OF SUPPORT TO DETERMINE QUALITY OF SERVICES AND CUSTOMER SATISFACTION, AND RECOMMENDING PROCEDURAL CHANGES BASED ON CUSTOMER NEED OR CHANGES IN POLICY AND/OR REGULATION. (3) ORAL COMMUNICATION - EXPRESSES INFORMATION (FOR EXAMPLE, IDEAS OR FACTS) TO INDIVIDUALS OR GROUPS EFFECTIVELY, TAKING INTO ACCOUNT THE AUDIENCE AND NATURE OF THE INFORMATION (FOR EXAMPLE, TECHNICAL, SENSITIVE, CONTROVERSIAL); MAKES CLEAR AND CONVINCING ORAL PRESENTATIONS; LISTENS TO OTHERS, ATTENDS TO NONVERBAL CUES, AND RESPONDS APPROPRIATELY. EXAMPLES OF IT-RELATED EXPERIENCE DEMONSTRATING THIS COMPETENCY INCLUDE: CONVINCINGLY CONVEYING COMPLEX INFORMATION TO CUSTOMERS; PRESENTING THOUGHTS THAT ARE WELL-ORGANIZED AND DEMONSTRATING CONFIDENCE IN THE FACTS AND IDEAS; ADJUSTING STYLE WHEN WORKING WITH INDIVIDUALS WITH DIFFERENT LEVELS OF UNDERSTANDING; USING VARIOUS METHODS TO EXPLAIN AND CONVEY INFORMATION. (4) PROBLEM SOLVING - IDENTIFIES PROBLEMS; DETERMINES ACCURACY AND RELEVANCE OF INFORMATION; USES SOUND JUDGMENT TO GENERATE AND EVALUATE ALTERNATIVES, AND TO MAKE RECOMMENDATIONS. EXAMPLES OF IT-RELATED EXPERIENCE DEMONSTRATING THIS COMPETENCY INCLUDE: SOLVING COMPLEX OR SENSITIVE PROBLEMS BY DEVELOPING AND PROPOSING STRATEGIC ALTERNATIVES; IDENTIFYING POSSIBLE CONFLICTS AND SHARED BENEFITS; HELPING TEAM ANTICIPATE PROBLEMS AND IDENTIFYING AND EVALUATING POTENTIAL SOURCES OF INFORMATION; PROVIDING FEEDBACK AND COACHING TO OTHERS TO HELP SOLVE PROBLEMS; ENGAGING APPROPRIATE STAKEHOLDERS WHEN DEVELOPING SOLUTIONS IN ORDER TO UNDERSTAND AND INCORPORATE MULTIPLE PERSPECTIVES AND NEEDS; EVALUATING THE EFFECTIVENESS OF DECISIONS AND ADJUSTING FUTURE DECISIONS AS APPROPRIATE. EDUCATION FOREIGN EDUCATION: IF YOU ARE USING EDUCATION COMPLETED IN FOREIGN COLLEGES OR UNIVERSITIES TO MEET THE QUALIFICATION REQUIREMENTS, YOU MUST SHOW THE EDUCATION CREDENTIALS HAVE BEEN EVALUATED BY A PRIVATE ORGANIZATION THAT SPECIALIZES IN INTERPRETATION OF FOREIGN EDUCATION PROGRAMS AND SUCH EDUCATION HAS BEEN DEEMED EQUIVALENT TO THAT GAINED IN AN ACCREDITED U.S. EDUCATION PROGRAM; OR FULL CREDIT HAS BEEN GIVEN FOR THE COURSES AT A U.S. ACCREDITED COLLEGE OR UNIVERSITY. FOR FURTHER INFORMATION, VISIT: HTTPS://SITES.ED.GOV/INTERNATIONAL/RECOGNITION-OF-FOREIGN-QUALIFICATIONS . ADDITIONAL INFORMATION * IF YOU ARE A CURRENT FEDERAL CAREER/CAREER-CONDITIONAL EMPLOYEE, YOU WILL BE PLACED ON AN EXCEPTED APPOINTMENT. * MALE APPLICANTS BORN AFTER DECEMBER 31, 1959, MUST COMPLETE A PRE-EMPLOYMENT CERTIFICATION STATEMENT FOR SELECTIVE SERVICE REGISTRATION. * YOU WILL BE REQUIRED TO PROVIDE PROOF OF U.S. CITIZENSHIP. * DIRECT DEPOSIT OF PAY IS REQUIRED. * MUST BE ABLE TO OBTAIN AND MAINTAIN A SECRET SECURITY CLEARANCE. * INCUMBENT (OR SELECTEE) IS REQUIRED TO SATISFACTORILY COMPLETE THE APPROPRIATE TRAINING AND OBTAIN THE REQUIRED CERTIFICATION/RECERTIFICATION FOR THIS POSITION AS OUTLINED IN DODM 8140.03 CYBERSPACE WORKFORCE QUALIFICATION AND MANAGEMENT PROGRAM DATED 15 FEBRUARY 2023. * SELECTION IS SUBJECT TO RESTRICTIONS RESULTING FROM DEPARTMENT OF DEFENSE REFERRAL SYSTEM FOR DISPLACED EMPLOYEES. * IF YOU HAVE RETIRED FROM FEDERAL SERVICE AND YOU ARE INTERESTED IN EMPLOYMENT AS A REEMPLOYED ANNUITANT, SEE THE INFORMATION IN THE REEMPLOYED ANNUITANT INFORMATION SHEET. * THIS IS A (CP) 34 - INFORMATION TECHNOLOGY/CYBER MANAGEMENT CAREER FIELD POSITION. * SALARY INCLUDES APPLICABLE LOCALITY PAY OR LOCAL MARKET SUPPLEMENT. *",
    "job_skill_set": [
      "Windows operating systems",
      "customer service",
      "problem solving",
      "oral communication",
      "attention to detail",
      "troubleshooting",
      "technical support",
      "software installation",
      "network configuration",
      "automated ticketing systems",
      "information assurance certification",
      "hardware installation",
      "software updates",
      "telecommunications"
    ],
    "short_keywords": [
      "assurance",
      "attention",
      "automated",
      "certification",
      "clearance",
      "communication",
      "configuration",
      "customer",
      "custspt",
      "detail",
      "hardware",
      "information",
      "informationtechnology",
      "installation",
      "network",
      "operating",
      "oral",
      "problem",
      "security",
      "service",
      "software",
      "solving",
      "specialist",
      "support",
      "systems",
      "technical",
      "technology",
      "telecommunications",
      "ticketing",
      "to",
      "troubleshooting",
      "updates",
      "windows",
      "with"
    ]
  },
  {
    "job_id": "3902945526",
    "job_title": "Information Technology Specialist 2 (NY HELPs) - 5680",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "MINIMUM QUALIFICATIONS\n\nOPEN COMPETITIVE: A BACHELOR'S OR HIGHER-LEVEL DEGREE INCLUDING OR SUPPLEMENTED BY 15 SEMESTER CREDIT HOURS IN COMPUTER SCIENCE.\n\nOR\n\nA BACHELOR'S OR HIGHER-LEVEL DEGREE IN ANY FIELD AND ONE YEAR OF EXPERIENCE IN INFORMATION TECHNOLOGY; OR 60 SEMESTER CREDIT HOURS INCLUDING OR SUPPLEMENTED BY 15 SEMESTER CREDIT HOURS IN COMPUTER SCIENCE AND ONE YEAR OF PROFESSIONAL EXPERIENCE IN INFORMATION TECHNOLOGY.\n\nOR\n\nTWO YEARS OF PROFESSIONAL EXPERIENCE IN INFORMATION TECHNOLOGY.\n\nTRANSFER: OPEN TO NYS EMPLOYEES WITH ONE YEAR OF PERMANENT COMPETITIVE SERVICE AS AN INFORMATION TECHNOLOGY SPECIALIST 2 OR INFORMATION TECHNOLOGY SPECIALIST 2 PROGRAMMING, G-18; OR IN A TITLE G-16 OR ABOVE DEEMED ADMINISTRATIVE UNDER SECTION 52.6 OF THE CIVIL SERVICE LAW.\n\n55B/C APPOINTMENT: THIS POSITION IS ELIGIBLE FOR 55B/C DESIGNATION AND CANDIDATES ARE ENCOURAGED TO APPLY.\n\nNYS HELPS: THIS TITLE IS PART OF THE NEW YORK HIRING FOR EMERGENCY LIMITED PLACEMENT STATEWIDE PROGRAM (NY HELPS).\n\nDUTIES DESCRIPTION\n\nUNDER THE DIRECTION OF AN INFORMATION TECHNOLOGY SPECIALIST 3, SG-23, WITHIN THE CHIEF TECHNOLOGY OFFICE, SHARED PLATFORM SERVICES, COTS SOFTWARE SECTION, THE INFORMATION TECHNOLOGY SPECIALIST 2, SG-18, POSITION WILL BE RESPONSIBLE FOR SUPPORT OF SYSTEMS BASED ON COTS (COMMERCIAL OFF THE SHELF) SOLUTIONS.\n\nDUTIES INCLUDE, BUT ARE NOT LIMITED TO\n\n INSTALL, CONFIGURE, PATCH, AND UPGRADE SYSTEM APPLICATIONS; SUPPORT THE INSTALLATION OF NEW SYSTEMS AND MAINTENANCE OF EXISTING SYSTEMS WHILE WORKING CLOSELY WITH DATA CENTER HOSTING (WINDOWS AND LINUX), DATABASE ADMINISTRATION, NETWORK, AND CHIEF TECHNOLOGY OFFICE STAFF; INSTALL, CONFIGURE, AND SUPPORT SERVER-SIDE APPLICATIONS WORKING WITH MS SQL AND ORACLE DATABASES; MONITOR SYSTEM PERFORMANCE OF COMMERCIAL APPLICATIONS; TROUBLESHOOT APPLICATION, PERFORMANCE ISSUES, AND NETWORK (IP SUCH AS SMTP/TCP/SNMP/SSL); ASSIST WITH MICROSOFT SERVER OPERATING SYSTEM APPLICATION CONFIGURATION AND TUNING; INTERFACE WITH ACTIVE DIRECTORY WITH NEW APPLICATIONS, REQUESTING NEW ACCOUNTS, AND ASSIST WITH GROUP MEMBERSHIP / SECURITY; PROVIDE BUSINESS HOURS AND OFF HOURS TECHNICAL SUPPORT FOR CRITICAL COTS SYSTEMS.\n\nADDITIONAL COMMENTS\n\nSOME POSITIONS MAY REQUIRE FINGERPRINTING.\n\nSOME POSITIONS MAY REQUIRE UP TO 25% TRAVEL AND/OR LIFTING UP TO 50 LBS. SOME POSITIONS ARE PENDING CIVIL SERVICE APPROVAL. DETAILS OF POSITION(S) WILL BE DESCRIBED FURTHER IF YOU ARE SELECTED FOR AN INTERVIEW.\n\nPOSITIONS LOCATED IN NEW YORK CITY, WILL RECEIVE AN ADDITIONAL $3,400 DOWNSTATE ADJUSTMENT LOCATION PAY WITH REGULAR ANNUAL SALARY. POSITIONS LOCATED IN THE MID-HUDSON WILL RECEIVE AN ADDITIONAL $1,650 ADJUSTMENT LOCATION PAY.\n\nFOR THE DURATION OF THE NY HELPS PROGRAM, THIS TITLE MAYBE FILLED VIA A NON- COMPETITIVE APPOINTMENT, WHICH MEANS NO EXAMINATION IS REQUIRED BUT ALL CANDIDATES MUST MEET THE MINIMUM QUALIFICATIONS OF THE TITLE FOR WHICH THEY APPLY. AT THIS TIME, AGENCIES MAY RECRUIT AND HIRE EMPLOYEES BY MAKING TEMPORARY APPOINTMENTS. IN MAY 2024, IF A TEMPORARY NY HELPS EMPLOYEE IS SATISFACTORILY PERFORMING IN THE POSITION, THE APPOINTMENT WILL BE CHANGED FROM TEMPORARY PENDING CIVIL SERVICE COMMISSION ACTION TO PERMANENT NON-COMPETITIVE AND THE OFFICIAL PROBATIONARY PERIOD WILL BEGIN.\n\nAT A FUTURE DATE (WITHIN ONE YEAR OF PERMANENT APPOINTMENT), IT IS EXPECTED EMPLOYEES HIRED UNDER NY HELPS WILL HAVE THEIR NON-COMPETITIVE EMPLOYMENT STATUS CONVERTED TO COMPETITIVE STATUS, WITHOUT HAVING TO COMPETE IN AN EXAMINATION. EMPLOYEES WILL THEN BE AFFORDED WITH ALL OF THE SAME RIGHTS AND PRIVILEGES OF COMPETITIVE CLASS EMPLOYEES OF NEW YORK STATE. WHILE SERVING PERMANENTLY IN A NY HELPS TITLE, EMPLOYEES MAY TAKE PART IN ANY PROMOTION EXAMINATION FOR WHICH THEY ARE QUALIFIED.\n\nBENEFITS OF WORKING FOR NYS GENEROUS BENEFITS PACKAGE, WORTH 65% OF SALARY, INCLUDING:\n\nHOLIDAY & PAID TIME OFF\n\n THIRTEEN (13) PAID HOLIDAYS ANNUALLY UP TO THIRTEEN (13) DAYS OF PAID VACATION LEAVE ANNUALLY UP TO FIVE (5) DAYS OF PAID PERSONAL LEAVE ANNUALLY UP TO THIRTEEN (13) DAYS OF PAID SICK LEAVE ANNUALLY FOR PEF. UP TO THREE (3) DAYS OF PROFESSIONAL LEAVE ANNUALLY TO PARTICIPATE IN PROFESSIONAL DEVELOPMENT\n\nHEALTH CARE BENEFITS\n\n ELIGIBLE EMPLOYEES AND DEPENDENTS CAN PICK FROM A VARIETY OF AFFORDABLE HEALTH INSURANCE PROGRAMS FAMILY DENTAL AND VISION BENEFITS AT NO ADDITIONAL COST\n\nADDITIONAL BENEFITS\n\n NEW YORK STATE EMPLOYEES’ RETIREMENT SYSTEM (ERS) MEMBERSHIP NYS DEFERRED COMPENSATION ACCESS TO NY 529 AND NY ABLE COLLEGE SAVINGS PROGRAMS, AS WELL AS U.S. SAVINGS BONDS PUBLIC SERVICE LOAN FORGIVENESS (PSLF) AND MANY MORE.\n\n",
    "job_skill_set": [
      "Windows",
      "Active Directory",
      "Network troubleshooting",
      "Technical support",
      "Teamwork",
      "Communication",
      "Problem solving",
      "Adaptability",
      "Attention to detail",
      "COTS software",
      "Linux",
      "MS SQL",
      "Oracle",
      "System performance monitoring",
      "Application configuration"
    ],
    "short_keywords": [
      "2",
      "5680",
      "active",
      "adaptability",
      "application",
      "attention",
      "communication",
      "configuration",
      "cots",
      "detail",
      "directory",
      "helps",
      "information",
      "informationtechnology",
      "linux",
      "monitoring",
      "ms",
      "network",
      "ny",
      "oracle",
      "performance",
      "problem",
      "software",
      "solving",
      "specialist",
      "sql",
      "support",
      "system",
      "teamwork",
      "technical",
      "technology",
      "to",
      "troubleshooting",
      "windows"
    ]
  },
  {
    "job_id": "3888027049",
    "job_title": "Information Technology Help Desk Technician",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "COMPANY DESCRIPTION COMPLETE INTEGRATION SOLUTIONS IS A MANAGED SERVICES PROVIDER LOCATED IN LOUISVILLE, KY. WE SPECIALIZE IN INFRASTRUCTURE PLANNING & DESIGN, VIRTUALIZATION TECHNOLOGIES, AND MICROSOFT ONLINE SERVICES. OUR TEAM WORKS CLOSELY WITH CLIENTS TO DELIVER COMPREHENSIVE IT SOLUTIONS AND SUPPORT.\n ROLE DESCRIPTION THIS IS A FULL-TIME HYBRID ROLE FOR AN INFORMATION TECHNOLOGY HELP DESK TECHNICIAN. THE HELP DESK TECHNICIAN WILL BE RESPONSIBLE FOR PROVIDING TECHNICAL SUPPORT, TROUBLESHOOTING ISSUES RELATED TO DESKTOP COMPUTERS AND PRINTERS, AND PROVIDING HELP DESK SUPPORT TO END USERS. THE ROLE IS PRIMARILY LOCATED IN LOUISVILLE, KY, BUT OFFERS FLEXIBILITY FOR REMOTE WORK.\n QUALIFICATIONS TECHNICAL SUPPORT AND HELP DESK SUPPORT SKILLSEXPERIENCE TROUBLESHOOTING DESKTOP COMPUTERS AND PRINTERSEXCELLENT PROBLEM-SOLVING AND COMMUNICATION SKILLSCUSTOMER SERVICE-ORIENTED MINDSET\n RELEVANT CERTIFICATIONS AND EXPERIENCE IN IT SUPPORT ROLES WOULD BE BENEFICIAL.",
    "job_skill_set": [
      "desktop computers",
      "problem-solving",
      "communication",
      "customer service",
      "technical support",
      "troubleshooting",
      "printers",
      "IT support"
    ],
    "short_keywords": [
      "communication",
      "computers",
      "customer",
      "desk",
      "desktop",
      "help",
      "information",
      "informationtechnology",
      "it",
      "printers",
      "problemsolving",
      "service",
      "support",
      "technical",
      "technician",
      "technology",
      "troubleshooting"
    ]
  },
  {
    "job_id": "3905655083",
    "job_title": "Information Technology Generalist 1",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "THE POSITION\n\nARE YOU LOOKING FOR AN OPPORTUNITY TO UTILIZE YOUR EXPERIENCE AND KNOWLEDGE IN THE INFORMATION TECHNOLOGY (IT) FIELD? IF SO, LOOK NO FURTHER! THE HEALTH AND HUMAN SERVICES (HHS) IT DELIVERY CENTER PROVIDES END-TO-END IT SERVICES TO ALL STAFF IN THE DEPARTMENT OF HUMAN SERVICES (DHS), THE DEPARTMENT OF HEALTH (DOH), THE DEPARTMENT OF DRUG AND ALCOHOL PROGRAMS (DDAP), AND THE PENNSYLVANIA DEPARTMENT OF AGING (PDA). IF YOU ARE AN ENTHUSIASTIC AND HARD-WORKING INDIVIDUAL READY FOR A NEW CHALLENGE, WE WANT TO HEAR FROM YOU!\n\nDESCRIPTION OF WORK\n\nIN THIS POSITION YOU WILL DELIVER, ASSEMBLE, INSTALL, CONFIGURE AND TROUBLESHOOT COMPUTERS, EQUIPMENT, AND PERIPHERALS THROUGHOUT THE COMMONWEALTH.\n\nTHIS SERVICE COVERS A WIDE RANGE OF DEVICES SUCH AS DESKTOP CLIENTS, MOBILE DEVICES, AND TABLETS. IT ALSO INCLUDES VARIOUS OPERATING SYSTEMS, OFFICE PRODUCTIVITY APPLICATIONS, ENTERPRISE APPLICATIONS, THIRD-PARTY SOFTWARE, EMAIL ACCESS, INTERNET AND INTRANET CONNECTIVITY, NETWORK CONNECTIONS, REMOTE VPN CONNECTIONS, SMARTPHONES, MOBILE APPS, PRINTING DEVICES, NETWORK CABLING, AND PERIPHERAL DEVICES. ADDITIONALLY, INSTALLATION, SETUP, CONFIGURATION, SUPPORT, AND DOCUMENTATION FOR EACH COMPONENT CATEGORY ARE NECESSARY FOR THIS SERVICE.\n\nIN ADDITION TO RECEIVING CALLS, EMAILS, AND TICKETS FOR ASSISTANCE, YOU WILL ALSO BE RESPONSIBLE FOR ACCESSING USERS' COMPUTERS TO COLLECT DIAGNOSTICS AND RESOLVING HARDWARE AND SOFTWARE ISSUES. FURTHERMORE, YOU WILL ACT AS A BRIDGE BETWEEN THE IT DEPARTMENT AND END USERS DURING THE PROBLEM-SOLVING PROCESS.\n\nINTERESTED IN LEARNING MORE? ADDITIONAL DETAILS REGARDING THIS POSITION CAN BE FOUND IN THE POSITION DESCRIPTION .\n\nWORK SCHEDULE AND ADDITIONAL INFORMATION:\n\n FULL-TIME EMPLOYMENT.  WORK HOURS ARE 8:00 AM TO 4:30 PM, MONDAY - FRIDAY, WITH 60-MINUTE LUNCH.  TELEWORK: YOU MAY BE EXPECTED TO WORK FROM HOME (TELEWORK) FULL-TIME. YOU WILL BE REQUIRED TO REPORT TO THE HEADQUARTERS OFFICE ONCE A MONTH. YOU MUST HAVE A SECURELY CONFIGURED HIGH-SPEED INTERNET CONNECTION AND WORK FROM AN APPROVED LOCATION INSIDE PENNSYLVANIA. IF YOU ARE UNABLE TO TELEWORK, YOU WILL HAVE THE OPTION TO REPORT TO THE HEADQUARTERS OFFICE IN HARRISBURG.  PARKING IS LOCATED AT THE BUILDING AND IS FREE.  SALARY:IN SOME CASES, THE STARTING SALARY MAY BE NON-NEGOTIABLE.  YOU WILL RECEIVE FURTHER COMMUNICATION REGARDING THIS POSITION VIA EMAIL. CHECK YOUR EMAIL, INCLUDING SPAM/JUNK FOLDERS, FOR THESE NOTICES. \n\nREQUIRED EXPERIENCE, TRAINING & ELIGIBILITY\n\n QUALIFICATIONS \n\nMINIMUM EXPERIENCE AND TRAINING REQUIREMENTS:\n\n ONE YEAR AS AN INFORMATION TECHNOLOGY TRAINEE OR INFORMATION TECHNOLOGY TECHNICIAN; OR  THREE YEARS OF INFORMATION TECHNOLOGY EXPERIENCE IN APPLICATIONS DEVELOPMENT OR APPLICATIONS MAINTENANCE, NETWORKING OR DESKTOP SERVICES, WEB SITE DEVELOPMENT OR WEB SITE DESIGN, OR OTHER INFORMATION TECHNOLOGY SUPPORT/ADMINISTRATION SERVICES; OR  ONE YEAR OF INFORMATION TECHNOLOGY EXPERIENCE IN APPLICATIONS DEVELOPMENT OR APPLICATIONS MAINTENANCE, NETWORKING OR DESKTOP SERVICES, WEB SITE DEVELOPMENT OR WEB SITE DESIGN, OR OTHER INFORMATION TECHNOLOGY SUPPORT/ADMINISTRATION SERVICES, AND AN ASSOCIATE'S DEGREE IN ANY INFORMATION TECHNOLOGY FIELD; OR  AN EQUIVALENT COMBINATION OF EXPERIENCE AND TRAINING. \n\nOTHER REQUIREMENTS:\n\n YOU MUST MEET THE PA RESIDENCY REQUIREMENT . FOR MORE INFORMATION ON WAYS TO MEET PA RESIDENCY REQUIREMENTS, FOLLOW THE LINK AND CLICK ON RESIDENCY.  YOU MUST BE ABLE TO PERFORM ESSENTIAL JOB FUNCTIONS. \n\nHOW TO APPLY:\n\n RESUMES, COVER LETTERS, AND SIMILAR DOCUMENTS WILL NOT BE REVIEWED, AND THE INFORMATION CONTAINED THEREIN WILL NOT BE CONSIDERED FOR THE PURPOSES OF DETERMINING YOUR ELIGIBILITY FOR THE POSITION. INFORMATION TO SUPPORT YOUR ELIGIBILITY FOR THE POSITION MUST BE PROVIDED ON THE APPLICATION (I.E., RELEVANT, DETAILED EXPERIENCE/EDUCATION).  IF YOU ARE CLAIMING EDUCATION IN YOUR ANSWERS TO THE SUPPLEMENTAL APPLICATION QUESTIONS, YOU MUST ATTACH A COPY OF YOUR COLLEGE TRANSCRIPTS FOR YOUR CLAIM TO BE ACCEPTED TOWARD MEETING THE MINIMUM REQUIREMENTS. UNOFFICIAL TRANSCRIPTS ARE ACCEPTABLE.  YOUR APPLICATION MUST BE SUBMITTED BY THE POSTING CLOSING DATE . LATE APPLICATIONS AND OTHER REQUIRED MATERIALS WILL NOT BE ACCEPTED.  FAILURE TO COMPLY WITH THE ABOVE APPLICATION REQUIREMENTS MAY ELIMINATE YOU FROM CONSIDERATION FOR THIS POSITION. \n\nVETERANS: \n\n PENNSYLVANIA LAW (51 PA. C.S.7103) PROVIDES EMPLOYMENT PREFERENCE FOR QUALIFIED VETERANS FOR APPOINTMENT TO MANY STATE AND LOCAL GOVERNMENT JOBS. TO LEARN MORE ABOUT EMPLOYMENT PREFERENCES FOR VETERANS, GO TO WWW.EMPLOYMENT.PA.GOV/ADDITIONAL%20INFO/PAGES/DEFAULT.ASPX AND CLICK THE VETERANS’ PREFERENCE TAB OR CONTACT US AT RA-CS-VETPREFERENCE@PA.GOV . \n\n TELECOMMUNICATIONS RELAY SERVICE (TRS): \n\n 711 (HEARING AND SPEECH DISABILITIES OR OTHER INDIVIDUALS). \n\nIF YOU ARE CONTACTED FOR AN INTERVIEW AND NEED ACCOMMODATIONS DUE TO A DISABILITY, PLEASE DISCUSS YOUR REQUEST FOR ACCOMMODATIONS WITH THE INTERVIEWER IN ADVANCE OF YOUR INTERVIEW DATE.\n\nTHE COMMONWEALTH IS AN EQUAL EMPLOYMENT OPPORTUNITY EMPLOYER AND IS COMMITTED TO A DIVERSE WORKFORCE. THE COMMONWEALTH VALUES INCLUSION AS WE SEEK TO RECRUIT, DEVELOP, AND RETAIN THE MOST QUALIFIED PEOPLE TO SERVE THE CITIZENS OF PENNSYLVANIA. THE COMMONWEALTH DOES NOT DISCRIMINATE ON THE BASIS OF RACE, COLOR, RELIGIOUS CREED, ANCESTRY, UNION MEMBERSHIP, AGE, GENDER, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, NATIONAL ORIGIN, AIDS OR HIV STATUS, DISABILITY, OR ANY OTHER CATEGORIES PROTECTED BY APPLICABLE FEDERAL OR STATE LAW. ALL DIVERSE CANDIDATES ARE ENCOURAGED TO APPLY.\n\n\n\nEXAMINATION INFORMATION\n\nCOMPLETING THE APPLICATION, INCLUDING ALL SUPPLEMENTAL QUESTIONS, SERVES AS YOUR EXAM FOR THIS POSITION. NO ADDITIONAL EXAM IS REQUIRED AT A TEST CENTER (ALSO REFERRED TO AS A WRITTEN EXAM).YOUR SCORE IS BASED ON THE DETAILED INFORMATION YOU PROVIDE ON YOUR APPLICATION AND IN RESPONSE TO THE SUPPLEMENTAL QUESTIONS. YOUR SCORE IS VALID FOR THIS SPECIFIC POSTING ONLY.YOU MUST PROVIDE COMPLETE AND ACCURATE INFORMATION OR:YOUR SCORE MAY BE LOWER THAN DESERVED.YOU MAY BE DISQUALIFIED.YOU MAY ONLY APPLY/TEST ONCE FOR THIS POSTING.YOUR RESULTS WILL BE PROVIDED VIA EMAIL.",
    "job_skill_set": [
      "installation",
      "configuration",
      "troubleshooting",
      "networking",
      "operating systems",
      "office productivity applications",
      "enterprise applications",
      "internet connectivity",
      "mobile devices",
      "printing devices",
      "peripheral devices",
      "diagnostics",
      "communication",
      "problem solving",
      "customer service",
      "teamwork",
      "adaptability",
      "attention to detail",
      "time management",
      "computer assembly",
      "third-party software",
      "email access",
      "VPN connections",
      "network cabling"
    ],
    "short_keywords": [
      "1",
      "access",
      "adaptability",
      "applications",
      "assembly",
      "attention",
      "cabling",
      "communication",
      "computer",
      "configuration",
      "connections",
      "connectivity",
      "customer",
      "detail",
      "devices",
      "diagnostics",
      "email",
      "enterprise",
      "generalist",
      "information",
      "informationtechnology",
      "installation",
      "internet",
      "management",
      "mobile",
      "network",
      "networking",
      "office",
      "operating",
      "peripheral",
      "printing",
      "problem",
      "productivity",
      "service",
      "software",
      "solving",
      "systems",
      "teamwork",
      "technology",
      "thirdparty",
      "time",
      "to",
      "troubleshooting",
      "vpn"
    ]
  },
  {
    "job_id": "3889751989",
    "job_title": "Information Technology Security Analyst",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "CANDIDATES MUST BE WILLING TO WORK W2/1099 & MUST BE LOCAL TO MICHIGANHYBRID ROLE\nTHE IT SECURITY ANALYST IS RESPONSIBLE FOR COMPLETING AND MAINTAINING SYSTEM SECURITY PLANS (SSP) FOR NEW AND EXISTING SYSTEMS. THIS REQUIRES CLOSE COORDINATION WITH IT PROJECT TEAMS, BUSINESS AND ENTERPRISE SECURITY REPRESENTATIVES, AND PRODUCT OWNERS, TO ESTABLISH AND MAINTAIN PROCESSES AND CONTROLS FOR SECURITY VULNERABILITY REMEDIATION. RESPONSIBILITIES:SYSTEM SECURITY PLANS (SSP) FOR NEW APPLICATIONS IN ALIGNMENT WITH THE SECURE APPLICATION DEVELOPMENT LIFE CYCLE (SADLC) AND MICHIGAN SECURITY ACCREDITATION PROCESS (MISAP).SSPS FOR EXISTING APPLICATIONS REQUIRING AUTHORITY TO OPERATE (ATO) AND THOSE FACING SOFTWARE AND/OR HARDWARE ENHANCEMENTS.MONITOR PLANS OF ACTION AND MILESTONES (POA&M) AND CORRECTIVE ACTION PLANS (CAP) AS THEY RELATE TO THE SSPS IN COLLABORATION WITH THE MDOT ENTERPRISE INFORMATION MANAGEMENT (EIM) OFFICE.RESPECTIVE SSPS TO ENSURE NIST CONTROL REQUIREMENTS ARE MET.RECOMMENDATIONS ASSOCIATED WITH YOUR FINDINGS ON HOW TO IMPROVE THE CUSTOMER’S SECURITY POSTURE IN ACCORDANCE WITH SOM PSP & NIST CONTROLS.TEAM MEMBERS AND VENDORS WITH PROPER ARTIFACT COLLECTION TO SATISFY ASSESSMENT REQUIREMENTS. SKILLSETS REQUIRED:EXPERIENCE IN THE IT INDUSTRY ANALYZING AND APPLYING INFORMATION SECURITY PRINCIPLES AND PRACTICES REQUIRED: 1 YEARSREVIEWING IT SYSTEMS/APPLICATIONS PLUS BASIC KNOWLEDGE OF NETWORKING COMPONENTS AND VARIOUS OPERATING SYSTEMSREQUIRED: 1 YEARSANALYZING THE APPLICABLE NIST SPECIAL PUBLICATIONS 800-37 REVISION 1, 800-53 REVISION 3,4 OR 5, AND 800-53A REVISION 1.REQUIRED: 1 YEARSWITH OTHER SECURITY FRAMEWORKS (ISO, NIST, COBIT, HIPAA/HITECH, ETC.) AND REGULATORY REQUIREMENTS IS A PLUS NICE TO HAVE: 2 YEARSCISA, PMP AND/OR SECURITY+ CERTIFICATION NICE TO HAVEWORKING WITH SOFTWARE VENDORS TO IMPLEMENT SECURITY CONTROLS NICE TO HAVEWORKING INDEPENDENTLY AND IN A TEAM ENVIRONMENTWRITTEN AND VERBAL COMMUNICATION SKILLS INCLUDING THE ABILITY TO EXPLAIN TECHNICAL MATTERS TO A NON-TECHNICAL AUDIENCETO COLLABORATE ON MULTIPLE PROJECTS/EFFORTS AT A GIVEN TIMETO ADJUST QUICKLY TO MULTIPLE DEMANDS, SHIFTING PRIORITIES, AMBIGUITY, AND RAPID CHANGE\n\n\nBEST REGARDS,NISHA MIRIAM GEORGE,DRS IT SOLUTIONS, INC28175 HAGGERTY ROAD,NOVI, MI 48377(C) 248-440-7600 EXT -3(F) 248-859-4430\nHTTPS://WWW.LINKEDIN.COM/IN/NISHA-GEORGE-0A7B39206/NISHA@DRSITSOLUTIONS.COMWWW.DRSITSOLUTIONS.COM\nAN E-VERIFIED COMPANYCERTIFIED WOMEN BUSINESS ENTERPRISE (WBENC) CERTIFIED WOMEN OWNED SMALL BUSINESS (WOSB)",
    "job_skill_set": [
      "written communication",
      "verbal communication",
      "team collaboration",
      "independent work",
      "adaptability",
      "problem solving",
      "time management",
      "system security plans (SSP)",
      "NIST control requirements",
      "information security principles",
      "networking components",
      "operating systems",
      "NIST special publications",
      "security frameworks (ISO, NIST, COBIT, HIPAA/HITECH)",
      "CISA certification",
      "PMP certification",
      "Security+ certification",
      "security controls implementation"
    ],
    "short_keywords": [
      "adaptability",
      "analyst",
      "certification",
      "cisa",
      "cobit",
      "collaboration",
      "communication",
      "components",
      "control",
      "controls",
      "frameworks",
      "hipaahitech",
      "implementation",
      "independent",
      "information",
      "informationtechnology",
      "iso",
      "management",
      "networking",
      "nist",
      "operating",
      "plans",
      "pmp",
      "principles",
      "problem",
      "publications",
      "requirements",
      "security",
      "solving",
      "special",
      "ssp",
      "system",
      "systems",
      "team",
      "technology",
      "time",
      "verbal",
      "work",
      "written"
    ]
  },
  {
    "job_id": "3886898488",
    "job_title": "Information Technology Project Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOB TITLE: PROJECT MANAGERLOCATION: REMOTE @ TALLAHASSEE, FL(POSITION CAN BE REMOTE, BUT REQUIRES CANDIDATE TO BE ONSITE FOR MEETINGS AND PRESENTATIONS ON SELECT DAYS THROUGHOUT THE MONTH/YEAR AT DCF HEADQUARTERS IN TALLAHASSEE; NEGOTIABLE)DURATION: 2+ MONTHS CONTRACT. (POSITION CAN BE FULL TIME OR PART TIME BASED ON CANDIDATE’S CHOICE)\nPRIMARY JOB DUTIES AND TASKSTHE ACTIVITIES THIS CANDIDATE WILL BE TASKED WITH INCLUDE, BUT ARE NOT LIMITED TO THE FOLLOWING:PROJECT PLANNING AND SCHEDULING : CREATE DETAILED PROJECT PLANS THAT OUTLINE THE SCOPE, RESOURCES REQUIRED, TIMELINES, AND MILESTONES. USE PROJECT MANAGEMENT SOFTWARE TO KEEP TRACK OF PROGRESS AND ADJUST SCHEDULES AS NEEDED.RESOURCE MANAGEMENT : ALLOCATE TEAM MEMBERS AND TECHNOLOGY RESOURCES TO DIFFERENT TASKS AND PROJECTS BASED ON THEIR SKILLS, EXPERIENCE, AND PROJECT REQUIREMENTS. ENSURE OPTIMAL USE OF RESOURCES TO MEET PROJECT GOALS WITHIN BUDGET.BUDGET MANAGEMENT : DEVELOP AND MANAGE THE PROJECT BUDGET, INCLUDING ESTIMATING COSTS FOR SOFTWARE, HARDWARE, AND HUMAN RESOURCES. MONITOR SPENDING TO ENSURE THE PROJECT REMAINS WITHIN BUDGET AND MAKE ADJUSTMENTS AS NECESSARY.STAKEHOLDER COMMUNICATION : REGULARLY UPDATE STAKEHOLDERS, INCLUDING TEAM MEMBERS, LEADERSHIP, AND EXTERNAL PARTNERS, ON PROJECT PROGRESS, CHALLENGES, AND CHANGES. USE CLEAR AND CONCISE COMMUNICATION TO MANAGE EXPECTATIONS AND KEEP EVERYONE INFORMED.RISK MANAGEMENT : IDENTIFY POTENTIAL RISKS TO THE PROJECT TIMELINE, BUDGET, OR QUALITY. DEVELOP AND IMPLEMENT MITIGATION STRATEGIES TO MINIMIZE IMPACT AND PREPARE CONTINGENCY PLANS FOR CRITICAL RISKS.QUALITY ASSURANCE : OVERSEE THE QUALITY OF DELIVERABLES, ENSURING THEY MEET PROJECT SPECIFICATIONS AND STANDARDS. IMPLEMENT QUALITY ASSURANCE PRACTICES, SUCH AS CODE REVIEWS, TESTING PROTOCOLS, AND PERFORMANCE EVALUATIONS, TO MAINTAIN HIGH-QUALITY OUTPUTS.CHANGE MANAGEMENT : MANAGE CHANGES TO THE PROJECT SCOPE, SCHEDULE, AND RESOURCES EFFICIENTLY, ENSURING MINIMAL DISRUPTION. ASSESS THE IMPACT OF CHANGES, UPDATE PROJECT PLANS ACCORDINGLY, AND COMMUNICATE CHANGES TO ALL STAKEHOLDERS.VENDOR MANAGEMENT : NEGOTIATE WITH VENDORS AND SUPPLIERS FOR SOFTWARE, HARDWARE, AND SERVICES. MANAGE VENDOR RELATIONSHIPS TO ENSURE TIMELY DELIVERY OF PRODUCTS AND SERVICES WITHIN AGREED BUDGETS AND SPECIFICATIONS.TEAM LEADERSHIP AND DEVELOPMENT : LEAD THE PROJECT TEAM, PROVIDING GUIDANCE, MOTIVATION, AND SUPPORT. FOSTER A COLLABORATIVE ENVIRONMENT, RESOLVE CONFLICTS, AND FACILITATE PROFESSIONAL DEVELOPMENT OPPORTUNITIES FOR TEAM MEMBERS.PROJECT CLOSURE AND EVALUATION : UPON PROJECT COMPLETION, CONDUCT A PROJECT CLOSURE MEETING TO GATHER FEEDBACK, DOCUMENT LESSONS LEARNED, AND RELEASE PROJECT RESOURCES. EVALUATE PROJECT SUCCESS AGAINST INITIAL GOALS AND OBJECTIVES AND PREPARE A FINAL REPORT FOR STAKEHOLDERS.\nSPECIFIC KNOWLEDGE, SKILLS AND ABILITIES (KSAS):THE SUBMITTED CANDIDATE MUST BE ABLE TO APPLY COMMON KNOWLEDGE, SKILLS, AND ABILITIES IN THE FOLLOWING AREAS:MINIMUM REQUIRED KSAS:7+ YEARS OF EXPERIENCE IN PROJECT MANAGEMENT PRINCIPLES, UNDERSTANDING OF METHODOLOGIES LIKE AGILE, SCRUM, WATERFALL, AND LEAN. FAMILIARITY WITH PROJECT LIFE CYCLE, FROM PLANNING AND EXECUTION TO MONITORING, CONTROLLING, AND CLOSURE.7+ YEARS OF EXPERIENCE IN KNOWLEDGE OF HOW TO IDENTIFY, ASSESS, AND MITIGATE RISKS THAT COULD IMPACT PROJECT SUCCESS.7+ YEARS OF EXPERIENCE IN FAMILIARITY WITH QUALITY STANDARDS AND PROCESSES TO ENSURE PROJECT DELIVERABLES MEET EXPECTED QUALITY BENCHMARKS.5+ YEARS OF EXPERIENCE IN PROJECT MANAGEMENT SOFTWARE TOOLS LIKE MS PROJECT, ASANA, OR JIRA. 3+ YEARS OF EXPERIENCE IN BUDGETING, FINANCIAL FORECASTING, AND COST MANAGEMENT.\nGENERAL KNOWLEDGE, SKILLS AND ABILITIES (KSAS):THE SUBMITTED CANDIDATE(S) MUST BE ABLE TO APPLY COMMON KNOWLEDGE, SKILLS, AND ABILITIES IN THE FOLLOWING AREAS:COMMUNICATION: ABLE TO CLEARLY CONVEY INFORMATION, IN BOTH WRITTEN AND VERBAL FORMATS, TO INDIVIDUALS OR GROUPS IN A WIDE VARIETY OF SETTINGS (I.E.; PROJECT TEAM MEETINGS, MANAGEMENT PRESENTATIONS, ETC.). MUST HAVE THE ABILITY TO EFFECTIVELY LISTEN AND PROCESS INFORMATION PROVIDED BY OTHERS.CUSTOMER SERVICE: WORKS WELL WITH CLIENTS AND CUSTOMERS (I.E.; BUSINESS OFFICE, PUBLIC, OR OTHER AGENCIES). ABLE TO ASSESS THE NEEDS OF THE CUSTOMER, PROVIDE INFORMATION OR ASSISTANCE TO SATISFY EXPECTATIONS OR RESOLVE A PROBLEM.DECISION MAKING: MAKES SOUND, WELL-INFORMED, AND OBJECTIVE DECISIONS.FLEXIBILITY: IS OPEN TO CHANGE, NEW PROCESSES (OR PROCESS IMPROVEMENT), AND NEW INFORMATION. HAS THE ABILITY TO ADAPT IN RESPONSE TO NEW INFORMATION, CHANGING CONDITIONS, OR UNEXPECTED OBSTACLES. ABILITY TO RECEIVE AND GIVE CONSTRUCTIVE CRITICISM AND MAINTAIN EFFECTIVE WORK RELATIONSHIPS WITH OTHERS.INTERPERSONAL: SHOWS FRIENDLINESS, COURTESY, UNDERSTANDING, AND POLITENESS TO OTHERS.LEADERSHIP: MOTIVATES, ENCOURAGES, AND CHALLENGES OTHERS. IS ABLE TO ADAPT LEADERSHIP STYLES IN A VARIETY OF SITUATIONS.PROBLEM SOLVING: ABLE TO IDENTIFY, EVALUATE, AND USE SOUND JUDGEMENT TO GENERATE AND EVALUATE ALTERNATIVE ACTIONS, AND MAKE RECOMMENDATIONS AS ACCORDINGLY.TEAM BUILDING: ENCOURAGES, INSPIRES, AND GUIDES OTHERS TOWARD ACCOMPLISHING THE COMMON GOAL.\nEDUCATION: BACHELOR'S OR MASTER'S DEGREE IN COMPUTER SCIENCE, INFORMATION SYSTEMS, OR OTHERRELATED FIELD. OR EQUIVALENT WORK EXPERIENCE. (REQUIRED)CERTIFICATIONS: PROJECT MANAGEMENT PROFESSIONAL (PMP)",
    "job_skill_set": [
      "project management",
      "project management software",
      "budget management",
      "resource management",
      "stakeholder communication",
      "project planning",
      "communication",
      "customer service",
      "decision making",
      "interpersonal skills",
      "leadership",
      "problem solving",
      "team building",
      "agile",
      "scrum",
      "waterfall",
      "lean",
      "risk management",
      "quality assurance",
      "vendor management",
      "financial forecasting",
      "flexibility"
    ],
    "short_keywords": [
      "agile",
      "assurance",
      "budget",
      "building",
      "communication",
      "customer",
      "decision",
      "financial",
      "flexibility",
      "forecasting",
      "information",
      "informationtechnology",
      "interpersonal",
      "leadership",
      "lean",
      "making",
      "management",
      "manager",
      "planning",
      "problem",
      "project",
      "quality",
      "resource",
      "risk",
      "scrum",
      "service",
      "skills",
      "software",
      "solving",
      "stakeholder",
      "team",
      "technology",
      "vendor",
      "waterfall"
    ]
  },
  {
    "job_id": "3902939001",
    "job_title": "Information Technology Specialist 2 Programming (NY HELPs) - 5315",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "MINIMUM QUALIFICATIONS\n\nOPEN COMPETITIVE: A BACHELOR'S OR HIGHER-LEVEL DEGREE INCLUDING OR SUPPLEMENTED BY 15 SEMESTER CREDIT HOURS IN COMPUTER SCIENCE.\n\nOR\n\nA BACHELOR'S OR HIGHER-LEVEL DEGREE IN ANY FIELD AND ONE YEAR OF EXPERIENCE IN INFORMATION TECHNOLOGY; OR 60 SEMESTER CREDIT HOURS INCLUDING OR SUPPLEMENTED BY 15 SEMESTER CREDIT HOURS IN COMPUTER SCIENCE AND ONE YEAR OF PROFESSIONAL EXPERIENCE IN INFORMATION TECHNOLOGY.\n\nOR\n\nTWO YEARS OF PROFESSIONAL EXPERIENCE IN INFORMATION TECHNOLOGY.\n\nTRANSFER: OPEN TO NYS EMPLOYEES WITH ONE YEAR OF PERMANENT COMPETITIVE SERVICE AS AN INFORMATION TECHNOLOGY SPECIALIST 2 OR INFORMATION TECHNOLOGY SPECIALIST 2 PROGRAMMING, G-18; OR IN A TITLE G-16 OR ABOVE DEEMED ADMINISTRATIVE UNDER SECTION 52.6 OF THE CIVIL SERVICE LAW.\n\n55B/C APPOINTMENT: THIS POSITION IS ELIGIBLE FOR 55B/C DESIGNATION AND CANDIDATES ARE ENCOURAGED TO APPLY.\n\nNYS HELPS: THIS TITLE IS PART OF THE NEW YORK HIRING FOR EMERGENCY LIMITED PLACEMENT STATEWIDE PROGRAM (NY HELPS).\n\nDUTIES DESCRIPTION\n\nUNDER THE DIRECTION OF AN ITS-4 (25), WITHIN CHIEF TECHNOLOGY OFFICE, BUSINESS APPLICATION SERVICES, HEALTH AND HUMAN SERVICES, OTDA WELFARE MANAGEMENT SYSTEM (WMS) AUTOMATED ELIGIBILITY TEAM. THE INFORMATION TECHNOLOGY SPECIALIST 2 (PROG) (18) WILL BE PERFORMING APPLICATION DEVELOPMENT TASKS TO SUPPORT THE OPERATIONAL CHANGES REQUESTED BY THE OFFICE OF TEMPORARY AND DISABILITY ASSISTANCE (OTDA).\n\nSPECIFIC DUTIES INCLUDE, BUT ARE NOT LIMITED TO\n\n APPLICATION PROGRAMMING ON EXISTING APPLICATIONS WHICH INCLUDE UPSTATE AND NYC WMS IN THE UNISYS 2200 – MAINFRAME ENVIRONMENT ON APPLICATIONS WRITTEN IN COBOL WHICH INCLUDE BOTH INTERACTIVE SCREENS AND BATCH PROGRAMS. APPLICATION DEVELOPMENT AND PROGRAMING (CODE) AND IMPLEMENT NEW APPLICATIONS WHICH MAY INCLUDE JAVA AND (DOT)NET. PARTICIPATE IN PROJECTS TO UPGRADE EXISTING SYSTEMS TO CONFORM TO NEW TECHNOLOGY STANDARDS. ASSIST IN SYSTEMS ANALYSIS AND DESIGN ACTIVITIES INCLUDING INFORMATION GATHERING, DOCUMENTATION OF EXISTING SYSTEMS AND PROCESSES AND IDENTIFICATION OF ALTERNATIVE APPROACHES TO SOLVING THE BUSINESS PROBLEMS IDENTIFIED. PERFORM SOFTWARE TESTING AND SUPPORT USER TESTING. PROVIDE USER SUPPORT WHICH INCLUDES PRODUCTION PROBLEM RESOLUTION FOR EXISTING APPLICATIONS AND TECHNOLOGY\n\nADDITIONAL COMMENTS\n\nSOME POSITIONS MAY REQUIRE FINGERPRINTING.\n\nSOME POSITIONS MAY REQUIRE UP TO 25% TRAVEL AND/OR LIFTING UP TO 50 LBS. SOME POSITIONS ARE PENDING CIVIL SERVICE APPROVAL. DETAILS OF POSITION(S) WILL BE DESCRIBED FURTHER IF YOU ARE SELECTED FOR AN INTERVIEW.\n\nPOSITIONS LOCATED IN NEW YORK CITY, WILL RECEIVE AN ADDITIONAL $3,400 DOWNSTATE ADJUSTMENT LOCATION PAY WITH REGULAR ANNUAL SALARY. POSITIONS LOCATED IN THE MID-HUDSON WILL RECEIVE AN ADDITIONAL $1,650 ADJUSTMENT LOCATION PAY.\n\nFOR THE DURATION OF THE NY HELPS PROGRAM, THIS TITLE MAYBE FILLED VIA A NON- COMPETITIVE APPOINTMENT, WHICH MEANS NO EXAMINATION IS REQUIRED BUT ALL CANDIDATES MUST MEET THE MINIMUM QUALIFICATIONS OF THE TITLE FOR WHICH THEY APPLY. AT THIS TIME, AGENCIES MAY RECRUIT AND HIRE EMPLOYEES BY MAKING TEMPORARY APPOINTMENTS. IN MAY 2024, IF A TEMPORARY NY HELPS EMPLOYEE IS SATISFACTORILY PERFORMING IN THE POSITION, THE APPOINTMENT WILL BE CHANGED FROM TEMPORARY PENDING CIVIL SERVICE COMMISSION ACTION TO PERMANENT NON-COMPETITIVE AND THE OFFICIAL PROBATIONARY PERIOD WILL BEGIN.\n\nAT A FUTURE DATE (WITHIN ONE YEAR OF PERMANENT APPOINTMENT), IT IS EXPECTED EMPLOYEES HIRED UNDER NY HELPS WILL HAVE THEIR NON-COMPETITIVE EMPLOYMENT STATUS CONVERTED TO COMPETITIVE STATUS, WITHOUT HAVING TO COMPETE IN AN EXAMINATION. EMPLOYEES WILL THEN BE AFFORDED WITH ALL OF THE SAME RIGHTS AND PRIVILEGES OF COMPETITIVE CLASS EMPLOYEES OF NEW YORK STATE. WHILE SERVING PERMANENTLY IN A NY HELPS TITLE, EMPLOYEES MAY TAKE PART IN ANY PROMOTION EXAMINATION FOR WHICH THEY ARE QUALIFIED.\n\nWE ARE RECRUITING FOR POSITIONS WITHIN THIS ROLE.\n\nBENEFITS OF WORKING FOR NYS GENEROUS BENEFITS PACKAGE, WORTH 65% OF SALARY, INCLUDING:\n\nHOLIDAY & PAID TIME OFF\n\n THIRTEEN (13) PAID HOLIDAYS ANNUALLY UP TO THIRTEEN (13) DAYS OF PAID VACATION LEAVE ANNUALLY UP TO FIVE (5) DAYS OF PAID PERSONAL LEAVE ANNUALLY UP TO THIRTEEN (13) DAYS OF PAID SICK LEAVE ANNUALLY FOR PEF. UP TO THREE (3) DAYS OF PROFESSIONAL LEAVE ANNUALLY TO PARTICIPATE IN PROFESSIONAL DEVELOPMENT\n\nHEALTH CARE BENEFITS\n\n ELIGIBLE EMPLOYEES AND DEPENDENTS CAN PICK FROM A VARIETY OF AFFORDABLE HEALTH INSURANCE PROGRAMS FAMILY DENTAL AND VISION BENEFITS AT NO ADDITIONAL COST\n\nADDITIONAL BENEFITS\n\n NEW YORK STATE EMPLOYEES’ RETIREMENT SYSTEM (ERS) MEMBERSHIP NYS DEFERRED COMPENSATION ACCESS TO NY 529 AND NY ABLE COLLEGE SAVINGS PROGRAMS, AS WELL AS U.S. SAVINGS BONDS PUBLIC SERVICE LOAN FORGIVENESS (PSLF) AND MANY MORE.\n\n",
    "job_skill_set": [
      "Application Development",
      "Software Testing",
      "Systems Analysis",
      "Documentation",
      "Problem Resolution",
      "Communication",
      "Teamwork",
      "Problem Solving",
      "User Support",
      "Adaptability",
      "COBOL",
      "Java",
      ".NET",
      "Mainframe"
    ],
    "short_keywords": [
      "2",
      "5315",
      "adaptability",
      "analysis",
      "application",
      "cobol",
      "communication",
      "development",
      "documentation",
      "helps",
      "information",
      "informationtechnology",
      "java",
      "mainframe",
      "net",
      "ny",
      "problem",
      "programming",
      "resolution",
      "software",
      "solving",
      "specialist",
      "support",
      "systems",
      "teamwork",
      "technology",
      "testing",
      "user"
    ]
  },
  {
    "job_id": "3901343698",
    "job_title": "Information Technology Business Consultant",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOB TITLE: IT BUSINESS CONSULTANTDEPARTMENT: IT BUSINESS DEVELOPMENTREPORTS TO: DIRECTOR, IT BUSINESS DEVELOPMENTHYBRID (3 DAYS IN OFFICE) IN NASHVILLE, TN\nSUMMARYTHE ROLE OF AN IT BUSINESS CONSULTANT IS TO PRIMARILY SUPPORT THE OPPORTUNITY IDENTIFICATION PROCESS FOR ALL NEW IT REQUESTS VIA THE IT BUSINESS INTEGRATION & STRATEGY TEAM. THIS IS DONE BY DOCUMENTING NEW AND EXISTING BUSINESS PROCESSES AND OPPORTUNITY SPECIFIC BUSINESS NEEDS BY PARTNERING ACROSS ALL BUSINESS UNITS AND LEVELS OF THE ORGANIZATION. THEY ARE ADDITIONALLY RESPONSIBLE FOR MARKET RESEARCH, DESIGN-THINKING WORKSHOP FACILITATION, AND HELPING TRANSLATE BUSINESS NEEDS AND IDEAS INTO ACTIONABLE ITEMS FOR DELIVERY TEAMS.\nRESPONSIBILITIES ▪ PARTNER WITH EXECUTIVE LEVEL CLIENTS, HELPING STAKEHOLDERS ENVISION THEIR PRODUCTS, WHO THEY'RE FOR, AND THE IMPACT THEY'LL HAVE – CAPTURING THE BUSINESS DEMANDS AND NEED.▪ CRAFT DETAILED DOCUMENTATION INCLUSIVE OF HIGH LEVEL BUSINESS NEEDS, RESEARCH STUDIES, AND KEY INSIGHTS▪CREATION OF DETAILED PROCESS FLOWS SHOWCASING THE INNER WORKINGS OF CRITICAL BUSINESS PROCESSES ACROSS THE ORGANIZATION▪ PLAN AND FACILITATE CLIENT AND TEAM WORKSHOPS IN VARYING SIZES ON BROAD RANGING RETAIL SPECIFIC TOPICS▪ ENGAGE IN PRODUCT/MARKET RESEARCH AND CRAFTING RESEARCH DELIVERABLES WITH UNIQUE KEY INSIGHTS AND LEARNINGS FOR STAKEHOLDERS TO USE\nREQUIREMENTSYOU UNDERSTAND THE LIFECYCLE OF A PRODUCT - FROM IDEATION TO DELIVERY - AND HOW TECHNOLOGY PLAYS A ROLEYOU BRING SUBJECT MATTER EXPERTISE TO KEY DOMAIN AREAS AND CONTRIBUTE NEW WAYS OF THINKING AND INNOVATIONYOU ARE INSPIRING AND YOU CAN COMMAND A ROOM, BUT YOU’RE HUMBLE AND INCLUSIVEYOU ARE PASSIONATE ABOUT TECHNOLOGY AND THE RETAIL INDUSTRYYOU HAVE EXPERIENCE IN STRATEGIC PLANNING IN PRODUCT DEVELOPMENT, USER INSIGHTS, AND PRODUCT STRATEGY.YOU HAVE 3+ YEARS OF EXPERIENCE IN BUSINESS ANALYSIS, MARKET RESEARCH, AND PROCESS FLOW DOCUMENTATIONBACHELOR'S DEGREE PREFERRED",
    "job_skill_set": [
      "business analysis",
      "process flow documentation",
      "strategic planning",
      "product development",
      "documentation",
      "communication",
      "collaboration",
      "facilitation",
      "problem solving",
      "innovation",
      "leadership",
      "passion for technology",
      "market research",
      "design thinking",
      "user insights",
      "humility"
    ],
    "short_keywords": [
      "analysis",
      "business",
      "collaboration",
      "communication",
      "consultant",
      "design",
      "development",
      "documentation",
      "facilitation",
      "flow",
      "for",
      "humility",
      "information",
      "informationtechnology",
      "innovation",
      "insights",
      "leadership",
      "market",
      "passion",
      "planning",
      "problem",
      "process",
      "product",
      "research",
      "solving",
      "strategic",
      "technology",
      "thinking",
      "user"
    ]
  },
  {
    "job_id": "3902343406",
    "job_title": "Information Technology Project Coordinator",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "MUST BE LOCAL TO SANTA MONICA, CA TO GO IN OFFICE AS NEEDED.DESCRIPTION:LOOKING FOR A PROJECT COORDINATOR TO JOIN OUR SENIOR PROGRAM MANAGEMENT TEAM TO SUPPORT AND HELP US MAINTAIN CONTINUOUS PROGRAM DELIVERY IN A FAST PACED, DYNAMIC DIGITAL TECH ENVIRONMENT. THE IDEAL CANDIDATE WILL HAVE PROJECT MANAGEMENT AND BUSINESS OPERATIONS EXPERIENCE. THE PROJECT COORDINATOR WILL BE RESPONSIBLE FOR COORDINATING ACROSS A LARGE, DYNAMIC ORGANIZATION BETWEEN SEVERAL CROSS-MATRIX TEAMS ON PROJECT TASKS. THIS ROLE WILL BE SUPPORTING PROGRAM MANAGERS WITH WORK PLAN TRACKING AND FOLLOW UP, CROSS TEAM COLLABORATIONS TO PREPARE EXECUTIVE UPDATES, AND PROJECT COMMUNICATIONS WHILE SUPPORTING THE PROGRAM TEAMS TO DELIVER DEVELOPMENT OBJECTIVES ON-TIME. A SUCCESSFUL CANDIDATE IN THIS ROLE WILL HAVE EXCELLENT ORGANIZATIONAL, TIME MANAGEMENT AND COMMUNICATION SKILLS AND FAMILIARITY OF WORKING IN A TECHNICAL ORGANIZATION. RESPONSIBILITIES:• COORDINATE PROJECT MANAGEMENT ACTIVITIES, RESOURCES, AND INFORMATION• ENSURE THAT ALL ASPECTS OF A PROJECT ARE ORGANIZED AND IN ALIGNMENT WITH THE GLOBAL PROGRAM MANAGEMENT OFFICE GUIDELINES.• REPORT PROJECT STATUS, RISKS, AND OUTCOMES TO APPROPRIATE PROGRAM MANAGEMENT LEADERS AND ESCALATE ISSUES AS NEEDED.• COLLECT, TRACK AND SUPPORT CHANGE MANAGEMENT PROCESSES NEEDED (SCOPE CHANGES, BUDGET CHANGES, PROCESS CHANGES)• COLLABORATE WITH PROGRAM MANAGERS AND SCRUM LEADS TO BREAK PROGRAMS INTO DOABLE ACTIONS AND SET TIMEFRAMES.• HELP PROGRAM TEAMS CREATE AND TRACK PROJECT ADMINISTRATIVE DELIVERABLES SUCH AS UPDATING PROGRAM BUDGETS, MONTHLY PROGRAM REVIEW PRESENTATIONS, WEEKLY EXECUTIVE STATUS UPDATES, AND QUARTERLY PLANNING.• SCHEDULING PROGRAM MEETINGS WITH APPROPRIATE STAKEHOLDERS, DOCUMENTING NOTES• MAINTAIN AND UPDATING PROGRAM SHAREPOINT.• OVERSEE A SUBSET OF PROGRAM WORK.• HELP ENSURE THE TIMELY DELIVERY OF PROGRAMS AND PROJECTS ON TIME, WITHIN BUDGET, AND WITHIN SCOPE. BASIC QUALIFICATIONS:• 4 OR MORE YEARS’ EXPERIENCE IN PROJECT COORDINATION WITH PROVEN WORK EXPERIENCE AS A PROJECT COORDINATOR OR SIMILAR ROLE• STRONG ORGANIZATIONAL AND TIME MANAGEMENT SKILLS• EXPERIENCE WORKING WITH MULTI-DISCIPLINARY TEAMS WORKING WITH ALL LEVELS OF MANAGEMENT; EXCELLENT TEAMWORK AND COLLABORATION SKILLS• HANDS-ON EXPERIENCE WITH PROJECT DELIVERY TOOLS SUCH AS JIRA, CONFLUENCE• STRONG WORKING KNOWLEDGE OF MS OFFICE PRODUCTS, SHAREPOINT, SMARTSHEET,• STRONG WRITTEN, VERBAL AND PRESENTATION SKILLS• EXPERIENCE WITH AGILE PROJECT MANAGEMENT DELIVERY CYCLES",
    "job_skill_set": [
      "project management",
      "business operations",
      "MS Office",
      "organizational skills",
      "time management",
      "communication",
      "teamwork",
      "collaboration",
      "problem solving",
      "JIRA",
      "Confluence",
      "SharePoint",
      "Smartsheet",
      "agile project management"
    ],
    "short_keywords": [
      "agile",
      "business",
      "collaboration",
      "communication",
      "confluence",
      "coordinator",
      "information",
      "informationtechnology",
      "jira",
      "management",
      "ms",
      "office",
      "operations",
      "organizational",
      "problem",
      "project",
      "sharepoint",
      "skills",
      "smartsheet",
      "solving",
      "teamwork",
      "technology",
      "time"
    ]
  },
  {
    "job_id": "3902873026",
    "job_title": "Information Technology System Administrator",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "LHH RECRUITMENT SOLUTIONS IS LOOKING FOR A IT TECHNITIAN FOR A NON PROFIT.\nTHIS IS A ON-SITE 5 DAYS A WEEK DIRECT HIRE/W2 POSITION IN LOS ANGELES COUNTY. \nRESPONSIBILITIES\nAS THE IT TECHNICIAN, YOU WILL PLAY A KEY ROLE IN OVERSEEING THE TECHNICAL INFRASTRUCTURE IMPLEMENTATION AND UPGRADES. INVOLVES MANAGING AND RESOLVING DAILY SYSTEM AND DESKTOP ISSUES FOR OUR RAPIDLY EXPANDING USER BASE OF 70 EMPLOYEES. YOU WILL ALSO BE RESPONSIBLE FOR THE OVERALL TECHNICAL INFRASTRUCTURE, COVERING DESKTOPS, NETWORKING, PRINTERS, PHONES, AND OTHER EQUIPMENT. ADDITIONAL RESPONSIBILITIES INCLUDE PROCURING AND DEPLOYING COMPUTING EQUIPMENT, ACTIVE DIRECTORY USER MANAGEMENT, MICROSOFT 365 LICENSE MANAGEMENT, AND IMPLEMENTING EFFICIENT ONBOARDING AND TERMINATION PROCESSES. YOUR ROLE EXTENDS TO INVENTORY MANAGEMENT OF HARDWARE AND SOFTWARE ASSETS, AS WELL AS OVERSEEING THE ENTERPRISE SECURITY FRAMEWORK AND DISASTER RECOVERY PLANNING.\nREQUIREMENTS: \nBACHELOR’S DEGREE OR EQUIVALENT TRAINING AND WORK EXPERIENCE3+SYSTEMS ADMINISTRATION OR IT SUPPORT OR NETWORKING EXPERIENCE3+ YEARS OF STRONG WINDOWS ADMINISTRATION3+ YEARS OF ACTIVE DIRECTORY MANAGEMENT3+ YEARS OF EXPERIENCE WITH HARDWARE SUPPORT3+ YEARS OF MANAGING MICROSOFT 365, WITH A FOCUS ON EXCHANGE, TEAMS, AND ONEDRIVE.3+ YEARS OF NETWORK ADMINISTRATION, COVERING BOTH ON-PREMISES. .NICE TO HAVE: MACOSX SUPPORT (DESIRED) AND LINUX (A PLUS).NICE TO HAVE: PREVIOUS EXPERIENCE IN NON PROFIT SECTOR WOULD BE GREAT!\nEXPECTED SALARY RANGE IS: 30 -36/HRSTANDARD MEDICAL, DENTAL, AND VISION COVERAGE FOR EMPLOYEE",
    "job_skill_set": [
      "Windows Administration",
      "Active Directory Management",
      "Network Administration",
      "Hardware Support",
      "Technical Infrastructure Management",
      "Inventory Management",
      "Problem Solving",
      "Communication",
      "Teamwork",
      "Adaptability",
      "Time Management",
      "Microsoft 365 Management",
      "Disaster Recovery Planning",
      "Onboarding Processes",
      "Linux Support",
      "MacOS Support"
    ],
    "short_keywords": [
      "365",
      "active",
      "adaptability",
      "administration",
      "administrator",
      "communication",
      "directory",
      "disaster",
      "hardware",
      "information",
      "informationtechnology",
      "infrastructure",
      "inventory",
      "linux",
      "macos",
      "management",
      "microsoft",
      "network",
      "onboarding",
      "planning",
      "problem",
      "processes",
      "recovery",
      "solving",
      "support",
      "system",
      "teamwork",
      "technical",
      "technology",
      "time",
      "windows"
    ]
  },
  {
    "job_id": "3899521860",
    "job_title": "Information Technology Specialist-Weekend ",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "WORK ALONGSIDE THE BEST MINDS IN TECHNOLOGY. \nIF YOU ARE LOOKING FOR A PLACE WHERE TEAMWORK, CLIENT SERVICE, INTEGRITY, EXCELLENCE, CONTINUOUS LEARNING AND PROFESSIONALISM ARE CORE VALUES, THEN KRAFT KENNEDY MAY BE THE PLACE FOR YOU.KRAFT KENNEDY IS A MULTIDISCIPLINARY CONSULTING FIRM WITH EXPERTISE IN TECHNOLOGY AND MANAGEMENT CONSULTING, TECHNOLOGY STRATEGIES, APPLICATION SPECIALTIES, TECHNOLOGY INFRASTRUCTURE, MANAGED SERVICES AND PROACTIVE SUPPORT. COMBINING THIS KNOWLEDGE, OUR FOCUSED TEAMS ARE DEDICATED TO MEETING THE NEEDS OF OUR CLIENTS. WITH OVER 30 YEARS’ EXPERIENCE WE HAVE LEARNED THAT THE KEY TO SUCCESSFUL IT IS TO FOCUS AS MUCH ON THE BUSINESS NEEDS OF THE CLIENT AS ON TECHNOLOGY.\nTHE SUPPORT PRACTICE GROUP OF KRAFT KENNEDY IS SEEKING APPLICANTS FOR FULL-TIME REMOTE POSITIONS WITH EITHER OF THE FOLLOWING HOURS:\nWEEKEND THURSDAY THROUGH MONDAY, 8:30AM TO 5:30PM EASTERNORWEEKEND FRIDAY THROUGH TUESDAY, 8:30AM TO 5:30PM EASTERN\nOVERVIEWTHE SUPPORT PRACTICE GROUP (“SPG”) IS A LARGE AND GROWING GROUP OF DIVERSE TECHNICAL STAFF PROVIDING A BROAD RANGE OF TECHNOLOGY SUPPORT IN VARIOUS INDUSTRY VERTICALS AS PART OF KRAFT KENNEDY’S MANAGED SERVICES OFFERING.THIS POSITION REPORTS TO THE PRACTICE GROUP LEADER AND WILL WORK CLOSELY WITH CO-WORKERS, SENIOR TECHNICAL STAFF AND OTHER SUPPORT STAFF IN THIS COLLABORATIVE, HIGHLY ACTIVE, ENGAGING ENVIRONMENT. MAKE A DIFFERENCE FOR OUR CLIENTS AND GROW YOUR TECHNICAL SKILLS IN THE PROCESS. ROLES AND RESPONSIBILITIES· PROVIDE OVERSIGHT OF THE DAILY MOVEMENT OF TICKETS THROUGHOUT THE SUPPORT PRACTICE GROUP.· COORDINATE WORK ACROSS SPG SHIFTS.· PROVIDE ESCALATION SUPPORT FOR WEEKEND SPG TEAM MEMBERS AND COORDINATE ESCALATIONS WITH ASSIGNED TEAM MEMBERS.· MANAGE CUSTOMER CONCERNS IN A PROFESSIONAL AND TACTFUL MANNER.· ASSIST BOTH CLIENT END USERS AND IT STAFF WITH A BROAD RANGE OF COMPUTER APPLICATION PROBLEMS, SERVER ISSUES, VIRTUALIZATION, SAN, NETWORKING ISSUES, SECURITY ISSUES AND MORE.· INTERACT CLOSELY WITH THIRD-PARTY VENDORS AND OTHER TEAM MEMBERS HELPING MANAGE THE RESOLUTION OF COMPLEX CLIENT ISSUES.· INITIATE AND PERFORM ROOT CAUSE ANALYSIS (RCA) ON MORE COMPLEX CLIENT ISSUES FOR ONE-TIME RESOLUTION.\n\nEXPERIENCE AND QUALIFICATIONS· BACHELOR’S DEGREE IN IT OR RELATED FIELD OR A MINIMUM OF THREE (3) YEARS OF RELATED WORK EXPERIENCE IN LIEU OF A DEGREE.· MINIMUM THREE (3) YEARS OF MANAGED SERVICE PROVIDER EXPERIENCE.· EXPERIENCE IN A MANAGERIAL ROLE IN A CUSTOMER SERVICE SETTING.· EXPERIENCE DISPATCHING INFORMATION TECHNOLOGY RELATED TICKETS.· STRONG CUSTOMER SERVICE AND COMMUNICATION SKILLS.· VERY ORGANIZED AND DETAIL ORIENTED, WITH A HIGH DEGREE OF ACCURACY AND FOLLOW UP.· STRONG PROBLEM SOLVING AND TECHNICAL TROUBLESHOOTING SKILLS.· EXPERIENCE SUPPORTING MODERN HYBRID CLOUD ENVIRONMENTS.· MICROSOFT CERTIFICATIONS AND/OR RELATED TECHNICAL CERTIFICATIONS ARE STRONGLY PREFERRED.\nCOMPENSATIONTHE BASE PAY FOR THIS POSITION HAS A SALARY RANGE OF $70,000 TO $80,000. THE ACTUAL SALARY OFFER WILL TAKE IN TO ACCOUNT A WIDE RANGE OF FACTORS INCLUDING THE INDIVIDUAL’S QUALIFICATIONS, EXPERIENCE AS WELL AS LOCATION. IN ADDITION, CERTAIN POSITIONS ARE ELIGIBLE FOR BONUSES OR COMMISSIONS.\nWHY JOIN US?· FAMILY ORIENTED TEAM ENVIRONMENT WITH STRONG EMPHASIS ON WORK LIFE BALANCE· MEDICAL, DENTAL, HSA, LIFE AND LONG-TERM DISABILITY INSURANCE· 401K WITH COMPANY MATCH· PHONE REIMBURSEMENT· HOLIDAYS/VACATION/SICK DAYS\nPHYSICAL REQUIREMENTS:PROLONGED PERIODS OF SITTING AT A DESK AND WORKING ON A COMPUTER.\nKRAFT KENNEDY IS AN EQUAL OPPORTUNITY EMPLOYER AND ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, GENDER, GENDER IDENTITY, SEXUAL ORIENTATION, NATIONAL ORIGIN, ETHNICITY, AGE, DISABILITY, MARITAL STATUS, VETERAN STATUS OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW.",
    "job_skill_set": [
      "technical troubleshooting",
      "customer service",
      "computer applications",
      "teamwork",
      "communication",
      "problem solving",
      "organization",
      "professionalism",
      "integrity",
      "attention to detail",
      "client service",
      "collaboration",
      "adaptability",
      "managed services",
      "root cause analysis",
      "cloud environments",
      "Microsoft certifications",
      "ticket dispatching",
      "networking",
      "security issues",
      "virtualization",
      "server issues"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "applications",
      "attention",
      "cause",
      "certifications",
      "client",
      "cloud",
      "collaboration",
      "communication",
      "computer",
      "customer",
      "detail",
      "dispatching",
      "environments",
      "information",
      "informationtechnology",
      "integrity",
      "issues",
      "managed",
      "microsoft",
      "networking",
      "organization",
      "problem",
      "professionalism",
      "root",
      "security",
      "server",
      "service",
      "services",
      "solving",
      "specialistweekend",
      "teamwork",
      "technical",
      "technology",
      "ticket",
      "to",
      "troubleshooting",
      "virtualization"
    ]
  },
  {
    "job_id": "3903806888",
    "job_title": "Information Technology System Administrator",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "TEMP TO PERM OPPORTUNITY RESPONSIBILITIES:- ENSURE THAT SERVICES, SYSTEMS AND IT INFRASTRUCTURE INCLUDING HARDWARE, SOFTWARE, IT ENVIRONMENT CONTROLS ETC. WORK SECURELY AND RELIABLY.- MANAGE AND MAINTAIN THE ON-PREMISE VMS, SERVERS, STORAGES, ETC.TO ENSURE THE HIGH SECURITY AND PERFORMANCE.- ENSURE THAT THE SYSTEM CONFIGURATION AND PATCHING MEET THE BANK STANDARDS.- MANAGE THE OPERATION, ADMINISTRATION AND MAINTENANCE OF BACKUP SYSTEM TO ENSURE THAT THE FUNCTIONALITY AND EFFICIENCY OF DATA BACKUP AND RESTORATION ARE IN COMPLIANCE WITH REGULATORY REQUIREMENTS WHILE MEETING THE BRANCH'S NEEDS.- COLLABORATE WITH IS TEAM, ENSURE THAT THE VULNERABILITIES ARE WELL TRACKED AND REMEDIATED ON TIME.- LIAISE WITH DATA CENTER SERVICE PROVIDERS IN RELATION TO EQUIPMENT, INFORMATION SECURITY AND SERVICE PROVISIONS.- TEST AND EXECUTE THE DISASTER RECOVERY PLAN.- MANAGE THE IT ASSET VMS, SERVERS, STORAGES, ETC) THROUGHOUT THE LIFE CYCLE.- ENSURE TECHNICAL OPERATIONAL PROBLEMS ARE RESOLVED IN A TIMELY AND EFFECTIVE MANNER.- CONTACT VENDORS FOR EQUIPMENT AND SERVICE INSTALLATION, MAINTENANCE OR TROUBLESHOOTING.- PROVIDE HELPDESK SUPPORT FOR SYSTEM RELATED REQUESTS OR ISSUES.- ASSIST THE RISK MANAGERS WITH THE RESPONSIBILITY FOR IDENTIFYING, ACTING ON AND ESCALATING RISKS AND ARE HELD STRICTLY ACCOUNTABLE FOR THE FAILURE TO DISCHARGE THEIR RISK MANAGEMENT DUTIES.- BE RESPONSIBLE FOR DEMONSTRATING RISK AWARENESS BY FOLLOWING ALL POLICIES, PROCEDURES, AND INTERNAL CONTROL IN THEIR DAILY ROUTINE.",
    "job_skill_set": [
      "helpdesk support",
      "troubleshooting",
      "collaboration",
      "communication",
      "problem solving",
      "accountability",
      "attention to detail",
      "VM management",
      "server administration",
      "data backup and restoration",
      "disaster recovery planning",
      "information security",
      "system configuration",
      "patch management",
      "IT asset management",
      "risk management"
    ],
    "short_keywords": [
      "accountability",
      "administration",
      "administrator",
      "and",
      "asset",
      "attention",
      "backup",
      "collaboration",
      "communication",
      "configuration",
      "data",
      "detail",
      "disaster",
      "helpdesk",
      "information",
      "informationtechnology",
      "it",
      "management",
      "patch",
      "planning",
      "problem",
      "recovery",
      "restoration",
      "risk",
      "security",
      "server",
      "solving",
      "support",
      "system",
      "technology",
      "to",
      "troubleshooting",
      "vm"
    ]
  }
]