[
  {
    "job_id": "3902361570",
    "job_title": "VP Finance – Healthcare Services – Rapid Growth, 78810",
    "category": "FINANCE",
    "job_description": "VP FINANCE – HEALTHCARE SERVICES – RAPID GROWTH\nOUR CLIENT IS A RAPIDLY GROWING, HEALTH CARE SERVICES BUSINESS THAT IS SEEKING AN ACCOMPLISHED VICE PRESIDENT FINANCE FOR THEIR CORPORATE OFFICES IN WESTERN FLORIDA. THIS ROLE WILL FUNCTION AS THE LEAD FINANCE MEMBER OF THE EXECUTIVE TEAM AND WILL BE CENTRAL IN LEADING THE GROWTH OF THE BUSINESS. THE COMPANY IS SEEKING TO EXPAND ITS SERVICE OFFERING INTO NEW MARKETS AND TO POSITION ITSELF AS ONE OF THE LEADING COMPANIES IN ITS SPECIFIC NICHE AREA.\nQUALIFIED CANDIDATES MUST HAVE EXPERIENCE OPERATING AT THE SENIOR FINANCE LEVEL WITHIN A MULTI-LOCATION HEALTHCARE SERVICES ENVIRONMENT. IDEALLY, YOU WILL HAVE EXPERIENCE WORKING FOR A PUBLIC ACCOUNTING FIRM. YOU WILL BE EXPECTED TO ADOPT A HANDS-ON APPROACH AND SHOULD HAVE EXPERIENCE LEADING AND MANAGING SYSTEMS UPDATES AND/OR CONVERSIONS. YOU SHOULD HAVE EXPOSURE AND UNDERSTANDING TO THE REVENUE CYCLE MANAGEMENT WITHIN A HEALTHCARE SERVICES BUSINESS, AND HAVE BUILT THE FINANCE/ACCOUNTING INFRASTRUCTURE TO SUPPORT GROWTH.\nA COMPETITIVE COMPENSATION PACKAGE IS BEING OFFERED.",
    "job_skill_set": [
      "finance",
      "healthcare services",
      "leadership",
      "strategic thinking",
      "communication",
      "hands-on approach",
      "team collaboration",
      "revenue cycle management",
      "accounting",
      "systems updates",
      "multi-location management",
      "public accounting experience"
    ],
    "short_keywords": [
      "78810",
      "accounting",
      "approach",
      "collaboration",
      "communication",
      "cycle",
      "experience",
      "finance",
      "growth",
      "handson",
      "healthcare",
      "leadership",
      "management",
      "multilocation",
      "public",
      "rapid",
      "revenue",
      "services",
      "strategic",
      "systems",
      "team",
      "thinking",
      "updates",
      "vp"
    ]
  },
  {
    "job_id": "3902757207",
    "job_title": "Finance Director - Titanium Technologies",
    "category": "FINANCE",
    "job_description": "AS WE CREATE A COLORFUL, CAPABLE AND CLEANER WORLD THROUGH CHEMISTRY, WE INVITE YOU TO JOIN OUR TEAM TO HARNESS THE POWER OF CHEMISTRY TO SHAPE MARKETS, REDEFINE INDUSTRIES AND IMPROVE LIVES FOR BILLIONS OF PEOPLE AROUND THE WORLD.\n\nHELP SHAPE THE FUTURE OF CHEMISTRY AND THE WORLD\n\nFROM THE FRONTLINE TO THE BACK OFFICE, EVERY CHEMOURS EMPLOYEE IS PART OF SOMETHING BIGGER THAN THEMSELVES AS TOGETHER WE WORK TO CREATE A BETTER WORLD THROUGH THE POWER OF OUR CHEMISTRY.\n\nCHEMOURS IS A $6.3 BILLION COMPANY WITH A PORTFOLIO OF PRODUCTS AND PROCESSES THAT ENABLE TECHNOLOGIES AND PRODUCTS THAT PEOPLE USE EVERY DAY IN THEIR LIVES. FROM CELLULAR PHONES TO LOWER EMISSION VEHICLES, TO 5G COMMUNICATIONS AND CLEAN ENERGY FROM HYDROGEN, WE’RE COLLABORATING WITH CUSTOMERS TO MAKE THESE INNOVATIONS MORE CAPABLE. SIMPLY SAID, WE USE OUR CHEMISTRY TO CHANGE LIVES, SHAPE MARKETS, AND REDEFINE INDUSTRIES—ONE IMPROVEMENT AT A TIME.\n\nCHEMOURS IS SEEKING A FINANCE DIRECTOR TO JOIN OUR GROWING TITANIUM TECHNOLOGIES TEAM! THIS POSITION WILL REPORT DIRECTLY TO THE SENIOR DIRECTOR FINANCIAL PLANNING & ANALYSIS AT OUR WILMINGTON, DELAWARE LOCATION.\n\nTHE FINANCE DIRECTOR WILL ACT AS THE SEGMENT CFO FOR THE TITANIUM TECHNOLOGIES BUSINESS UNIT, OVERSEEING ALL FINANCIAL OPERATIONS FOR THE SEGMENT AND SERVING AS THE KEY BUSINESS PARTNER TO THE TITANIUM TECHNOLOGIES BUSINESS PRESIDENT. THE SUCCESSFUL CANDIDATE WILL BE RESPONSIBLE FOR LEADING THE FINANCE TEAM AND PARTNERING WITH CROSS FUNCTIONAL SENIOR MANAGEMENT TO DRIVE FINANCIAL PERFORMANCE AND SUPPORT BUSINESS STRATEGY. THE ROLE DEMANDS A DEEP UNDERSTANDING OF FINANCIAL AND BUSINESS PRINCIPLES, COMMODITY MARKET INSIGHTS, AND THE ABILITY TO STEER OUR BUSINESS TOWARDS FINANCIAL SUCCESS.\n\nTHE RESPONSIBILITIES OF THE POSITION INCLUDE, BUT ARE NOT LIMITED TO, THE FOLLOWING:\n\nLEAD AND SUPERVISE THE FINANCIAL PLANNING AND ANALYSIS FUNCTIONS, ENSURING ACCURATE REPORTING, BUDGETING, AND FORECASTING.DIRECT THE DEVELOPMENT OF FINANCIAL STRATEGIES IN LINE WITH THE TT AND CHEMOURS OBJECTIVES AND MARKET OPPORTUNITIES.OVERSEE THE PREPARATION OF ALL FINANCIAL REPORTING, INCLUDING MONTHLY, QUARTERLY, AND ANNUAL REPORTS.IMPLEMENT AND MAINTAIN ROBUST FINANCIAL CONTROLS AND GOVERNANCE FRAMEWORKS TO ENSURE THE INTEGRITY OF FINANCIAL DATA.GUIDE KEY INVESTMENT DECISIONS, MANAGE CAPITAL REQUESTS, AND STRATEGIZE ON CAPITAL ALLOCATION.EVALUATE AND OPTIMIZE FINANCIAL PERFORMANCE BY ANALYZING RESULTS, MONITORING VARIANCES, AND IDENTIFYING TRENDS.MENTOR AND DEVELOP A HIGH-CALIBER FINANCE TEAM, FOSTERING A CULTURE OF CONTINUOUS IMPROVEMENT AND EXCELLENCE.COLLABORATE WITH OTHER DEPARTMENTS TO DEVELOP COST-EFFECTIVE BUSINESS SOLUTIONS AND ENHANCE PROFITABILITY.SERVE AS A KEY MEMBER OF THE TT GLOBAL BUSINESS LEADERSHIP TEAM, CONTRIBUTING TO BROADER BUSINESS STRATEGY AND ORGANIZATIONAL DEVELOPMENT.MAINTAIN AWARENESS OF REGULATORY CHANGES, INDUSTRY DEVELOPMENTS, AND MACROECONOMIC TRENDS THAT MAY AFFECT THE BUSINESS.\n\n\nTHE FOLLOWING IS REQUIRED FOR THIS ROLE\n\nBACHELOR’S DEGREE IN FINANCE, ACCOUNTING, ENGINEERING, OR RELATED FIELD;MINIMUM OF 10+ YEARS OF RELEVANT EXPERIENCE IN FINANCIAL MANAGEMENT ROLES, WITH AT LEAST 5 YEARS IN A LEADERSHIP CAPACITY.EXPERTISE IN FINANCIAL ANALYSIS, FORECASTING, AND STRATEGIC FINANCIAL PLANNING.EXTENSIVE EXPERIENCE WITH FINANCIAL SYSTEMS, DATABASES, AND BUSINESS INTELLIGENCE TOOLS.STRONG LEADERSHIP SKILLS WITH A PROVEN ABILITY TO BUILD, GUIDE, AND INSPIRE A TEAM OF FINANCE PROFESSIONALS.EXCELLENT COMMUNICATION SKILLS, CAPABLE OF NEGOTIATING WITH AND INFLUENCING STAKEHOLDERS AT ALL LEVELS.STRATEGIC MINDSET WITH A FOCUS ON COLLABORATION, INNOVATION, AND DRIVING BUSINESS RESULTS.\n\n\nTHE FOLLOWING IS PREFERRED FOR THIS ROLE\n\nMBA, CPA, CMA, OR OTHER ADVANCED DEGREES OR FINANCIAL CERTIFICATIONS HIGHLY DESIRABLE.\n\n\nBENEFITS\n\nCOMPETITIVE COMPENSATION\n\nCOMPREHENSIVE BENEFITS PACKAGES\n\n401(K) MATCH\n\nEMPLOYEE STOCK PURCHASE PROGRAM\n\nTUITION REIMBURSEMENT\n\nCOMMUTER BENEFITS\n\nLEARNING AND DEVELOPMENT OPPORTUNITIES\n\nSTRONG INCLUSION AND DIVERSITY INITIATIVES\n\nCOMPANY-PAID VOLUNTEER DAYS\n\nWE’RE A DIFFERENT KIND OF CHEMISTRY COMPANY BECAUSE WE SEE OUR PEOPLE AS OUR BIGGEST ASSETS. INSTEAD OF FOCUSING JUST ON WHAT OUR EMPLOYEES DO EACH DAY, WE LOOK AT HOW THEY DO IT—BY TAKING A DIFFERENT APPROACH TO TALENT DEVELOPMENT, EMPLOYEE ENGAGEMENT, AND CULTURE. OUR GOAL IS TO EMPOWER EMPLOYEES TO BE THEIR BEST SELVES, AT CHEMOURS AND IN LIFE. AND WE’RE PROUD TO BE CERTIFIED™ BY GREAT PLACE TO WORK®.\n\nLEARN MORE ABOUT CHEMOURS AND OUR CULTURE BY VISITING CHEMOURS.COM/CAREERS.\n\nCHEMOURS IS AN EQUAL OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO AGE, RACE, RELIGION, COLOR, GENDER, DISABILITY, NATIONAL OR ETHNIC ORIGIN, ANCESTRY, MARITAL STATUS, FAMILY STATUS, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, OR VETERAN STATUS. JURISDICTIONS MAY HAVE ADDITIONAL GROUNDS FOR NON-DISCRIMINATION, AND WE COMPLY WITH ALL APPLICABLE LAWS.\n\nCHEMOURS IS AN E-VERIFY EMPLOYER\n\nCANDIDATES MUST BE ABLE TO PERFORM ALL DUTIES LISTED WITH OR WITHOUT ACCOMMODATION\n\nIMMIGRATION SPONSORSHIP (I.E., H1-B VISA, F-1 VISA (OPT), TN VISA OR ANY OTHER NON-IMMIGRANT STATUS) IS NOT CURRENTLY AVAILABLE FOR THIS POSITION\n\nIN OUR PURSUIT TO BE THE GREATEST PLACE TO WORK, WE KNOW THAT A CRITICAL ELEMENT TO ENHANCING OUR EMPLOYEE EXPERIENCE IS TO ASSURE WE’RE OPERATING WITH A SOLID FOUNDATION OF TRUST. AT CHEMOURS, THIS MEANS BEING TRANSPARENT ABOUT HOW WE PAY OUR EMPLOYEES FOR THE WORK THAT THEY DO.\n\nPAY RANGE (IN LOCAL CURRENCY)\n\n$169,344.00 - $264,600.00\n\nCHEMOURS LEVEL\n\n30\n\nANNUAL BONUS TARGET\n\n27%\n\nANNUAL STOCK AMOUNT\n\n65,000.00 USD\n\nTHE PAY RANGE AND INCENTIVES LISTED ABOVE IS A GENERAL GUIDELINE BASED ON THE PRIMARY LOCATION OF THIS JOB ONLY AND NOT A GUARANTEE OF TOTAL COMPENSATION. FACTORS CONSIDERED IN EXTENDING A COMPENSATION OFFER INCLUDE (BUT ARE NOT LIMITED TO) RESPONSIBILITIES OF THE JOB, EXPERIENCE, KNOWLEDGE, SKILLS, AND ABILITIES, AS WELL AS INTERNAL EQUITY, AND ALIGNMENT WITH MARKET DATA. THE INCENTIVE PAY IS DEPENDENT ON BUSINESS RESULTS AND INDIVIDUAL PERFORMANCE AND SUBJECT TO THE TERMS AND CONDITIONS OF THE SPECIFIC PLANS.\n\nAT CHEMOURS, YOU WILL FIND SUSTAINABILITY IN OUR VISION, OUR BUSINESS AND YOUR FUTURE. IF YOU WANT TO WORK ON THE LEADING EDGE OF YOUR FIELD AND HAVE A DESIRE TO MAKE A DIFFERENCE, JOIN CHEMOURS AND DISCOVER WHAT IT MEANS WHEN WE SAY \"WE ARE LIVING CHEMISTRY.\"",
    "job_skill_set": [
      "capital allocation",
      "leadership",
      "communication",
      "collaboration",
      "mentoring",
      "problem solving",
      "influencing stakeholders",
      "innovation",
      "financial analysis",
      "forecasting",
      "strategic financial planning",
      "financial reporting",
      "financial controls",
      "financial systems",
      "business intelligence tools",
      "budgeting",
      "commodity market insights",
      "strategic mindset",
      "continuous improvement"
    ],
    "short_keywords": [
      "allocation",
      "analysis",
      "budgeting",
      "business",
      "capital",
      "collaboration",
      "commodity",
      "communication",
      "continuous",
      "controls",
      "director",
      "finance",
      "financial",
      "forecasting",
      "improvement",
      "influencing",
      "innovation",
      "insights",
      "intelligence",
      "leadership",
      "market",
      "mentoring",
      "mindset",
      "planning",
      "problem",
      "reporting",
      "solving",
      "stakeholders",
      "strategic",
      "systems",
      "technologies",
      "titanium",
      "tools"
    ]
  },
  {
    "job_id": "3906224785",
    "job_title": "Finance Analyst",
    "category": "FINANCE",
    "job_description": "ABOUT THIS ROLE\n\nWELLS FARGO IS SEEKING A FINANCE ANALYST. TO JOIN THE FINANCE TEAM: THIS TEAM IS RESPONSIBLE FOR FINANCIAL AND ECONOMIC ANALYSIS, FORECASTING AND EVALUATING TRENDS IN SALES, FINANCE, AND OTHER AREAS OF THE BUSINESS.\n\nIN THIS ROLE, YOU WILL\n\nTHOROUGH FOUNDATIONAL OR GOOD WORKING KNOWLEDGE OF THE BUDGET / FORECAST / MONTH-END CLOSE PROCESSES.UNDERSTANDING OF KEY GENERALLY ACCEPTED ACCOUNTING PRINCIPLES (GAAP) INCLUDING ACCRUALS, DEFERRALS, CAPITALIZATION, ETPARTICIPATE IN FUNCTIONS RELATED TO FINANCIAL RESEARCH AND REPORTING.FORECAST ANALYSIS OF KEY METRICS, AS WELL AS OTHER FINANCIAL CONSULTING RELATED TO BUSINESS PERFORMANCE, OPERATING AND STRATEGIC REVIEWS.IDENTIFY OPPORTUNITIES FOR PROCESS IMPROVEMENTS WITHIN THE SCOPE OF RESPONSIBILITIES.RESEARCH MODERATE TO COMPLEX FINANCIAL DATA IN SUPPORT OF MANAGEMENT DECISION-MAKING FOR A BUSINESSCREATE AND COMMUNICATE VARIOUS ACTIVITIES SUCH AS PRODUCT PRICING, PRODUCT, AND PORTFOLIO PERFORMANCE.EXERCISE INDEPENDENT JUDGMENT TO GUIDE KEY METRICS FORECASTING, CLOSING DATA AND VALIDATION.PRESENT RECOMMENDATIONS FOR RESOLVING ALL ASPECTS OF DELIVERING KEY FORECASTING PROJECTIONS AS WELL AS FINANCIAL REPORTING TO SUPPORT MONTHLY AND QUARTERLY FORECASTING.DEVELOP EXPERTISE ON REPORTING THAT MEETS BRAND STANDARDS AND INTERNAL CONTROL STANDARDS.COLLABORATE AND CONSULT WITH PEERS, COLLEAGUES AND MANAGERS TO RESOLVE ISSUES AND ACHIEVE GOALS.\n\nREQUIRED QUALIFICATIONS, US:\n\n2+ YEARS OF FINANCE SERVICES EXPERIENCE, OR EQUIVALENT DEMONSTRATED THROUGH ONE OR A COMBINATION OF THE FOLLOWING: WORK EXPERIENCE, TRAINING, MILITARY EXPERIENCE, EDUCATION.\n\nDESIRED QUALIFICATIONS:\n\nGOOD WORKING KNOWLEDGE OF EXCEL (PIVOTS, V/HOOKUPS, SUMMITS, ETC.) AND POWERPOINT.GOOD COMMUNICATION SKILLSHAD AN INQUISITIVE MIND AND ASKS QUESTIONS (AS OPPOSED TO ACCEPTING AS FACT)STRONG ANALYTICAL SKILLS, ABLE TO CONNECT THE DOTS AND/OR SEE THE FOREST FROM THE TREES.HAVE A STRATEGIC MIND-SET, ALIGNING THE ROADMAP W/ THE FINANCIAL RESULTS AND FORECASTS.WILLING TO WORK LONG HOURS WHEN REQUIRED, PARTICULARLY DURING MONTH-END DELIVERABLES AND TO SUPPORT AD-HOC REQUESTS.NEED TO BE ABLE TO MANAGE MULTIPLE DELIVERABLES WITH THE ABILITY TO PIVOT W/ CHANGING PRIORITIZATION.\n\nPOSTING END DATE:\n\n25 APR 2024\n\nJOB POSTING MAY COME DOWN EARLY DUE TO VOLUME OF APPLICANTS.\n\nWE VALUE DIVERSITY\n\nAT WELLS FARGO, WE BELIEVE IN DIVERSITY, EQUITY AND INCLUSION IN THE WORKPLACE; ACCORDINGLY, WE WELCOME APPLICATIONS FOR EMPLOYMENT FROM ALL QUALIFIED CANDIDATES, REGARDLESS OF RACE, COLOR, GENDER, NATIONAL ORIGIN, RELIGION, AGE, SEXUAL ORIENTATION, GENDER IDENTITY, GENDER EXPRESSION, GENETIC INFORMATION, INDIVIDUALS WITH DISABILITIES, PREGNANCY, MARITAL STATUS, STATUS AS A PROTECTED VETERAN OR ANY OTHER STATUS PROTECTED BY APPLICABLE LAW.\n\nEMPLOYEES SUPPORT OUR FOCUS ON BUILDING STRONG CUSTOMER RELATIONSHIPS BALANCED WITH A STRONG RISK MITIGATING AND COMPLIANCE-DRIVEN CULTURE WHICH FIRMLY ESTABLISHES THOSE DISCIPLINES AS CRITICAL TO THE SUCCESS OF OUR CUSTOMERS AND COMPANY. THEY ARE ACCOUNTABLE FOR EXECUTION OF ALL APPLICABLE RISK PROGRAMS (CREDIT, MARKET, FINANCIAL CRIMES, OPERATIONAL, REGULATORY COMPLIANCE), WHICH INCLUDES EFFECTIVELY FOLLOWING AND ADHERING TO APPLICABLE WELLS FARGO POLICIES AND PROCEDURES, APPROPRIATELY FULFILLING RISK AND COMPLIANCE OBLIGATIONS, TIMELY AND EFFECTIVE ESCALATION AND REMEDIATION OF ISSUES, AND MAKING SOUND RISK DECISIONS. THERE IS EMPHASIS ON PROACTIVE MONITORING, GOVERNANCE, RISK IDENTIFICATION AND ESCALATION, AS WELL AS MAKING SOUND RISK DECISIONS COMMENSURATE WITH THE BUSINESS UNIT'S RISK APPETITE AND ALL RISK AND COMPLIANCE PROGRAM REQUIREMENTS.\n\nCANDIDATES APPLYING TO JOB OPENINGS POSTED IN US: ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, STATUS AS A PROTECTED VETERAN, OR ANY OTHER LEGALLY PROTECTED CHARACTERISTIC.\n\nCANDIDATES APPLYING TO JOB OPENINGS POSTED IN CANADA: APPLICATIONS FOR EMPLOYMENT ARE ENCOURAGED FROM ALL QUALIFIED CANDIDATES, INCLUDING WOMEN, PERSONS WITH DISABILITIES, ABORIGINAL PEOPLES AND VISIBLE MINORITIES. ACCOMMODATION FOR APPLICANTS WITH DISABILITIES IS AVAILABLE UPON REQUEST IN CONNECTION WITH THE RECRUITMENT PROCESS.\n\nAPPLICANTS WITH DISABILITIES\n\nTO REQUEST A MEDICAL ACCOMMODATION DURING THE APPLICATION OR INTERVIEW PROCESS, VISIT DISABILITY INCLUSION AT WELLS FARGO .\n\nDRUG AND ALCOHOL POLICY\n\nWELLS FARGO MAINTAINS A DRUG FREE WORKPLACE. PLEASE SEE OUR DRUG AND ALCOHOL POLICY TO LEARN MORE.\n\nREFERENCE NUMBER\n\nR-314736",
    "job_skill_set": [
      "financial analysis",
      "forecasting",
      "Excel",
      "financial reporting",
      "budgeting",
      "data analysis",
      "financial consulting",
      "process improvement",
      "communication",
      "analytical thinking",
      "strategic mindset",
      "problem solving",
      "time management",
      "collaboration",
      "adaptability",
      "GAAP",
      "PowerPoint",
      "inquisitive mindset"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "analyst",
      "analytical",
      "budgeting",
      "collaboration",
      "communication",
      "consulting",
      "data",
      "excel",
      "finance",
      "financial",
      "forecasting",
      "gaap",
      "improvement",
      "inquisitive",
      "management",
      "mindset",
      "powerpoint",
      "problem",
      "process",
      "reporting",
      "solving",
      "strategic",
      "thinking",
      "time"
    ]
  },
  {
    "job_id": "3903491691",
    "job_title": "Senior Portfolio Manager Equipment Finance",
    "category": "FINANCE",
    "job_description": "LOCATION: ON SITE, BIRMINGHAM AL\n\nSUMMARY\n\nASSIST MANAGEMENT OF CLIENT RELATIONSHIPS BY UNDERWRITING AND SERVICING A WIDE VARIETY OF COMMERCIAL LOANS AND LEASES TO BUILD LONG-TERM AND PROFITABLE EQUIPMENT FINANCE / RENEWABLE ENERGY FINANCE PORTFOLIO AND MAXIMIZING PORTFOLIO ASSET/REVENUE GROWTH, PROFITABILITY, AND ASSET QUALITY. THIS POSITION MANAGES COMPLEX ACCOUNTS OR HAS AN ASSIGNED LOB OF A COMPLEX NATURE.\n\nKEY RESPONSIBILITIES INCLUDE\n\nWORKS IN CONCERT WITH THE EQUIPMENT FINANCE / RENEWABLE ENERGY PMS/RMS ON CURRENT CLIENTS AND PROSPECTS TO COMPLETE THE INITIAL TRANSACTION EVALUATION, CLIENT DUE DILIGENCE MEETINGS, CREDIT UNDERWRITING / CREDIT APPROVAL PACKAGE PREPARATION, AND RECOMMENDATION FOR APPROVAL OF BOTH TRANSACTION STRUCTURE AND OVERALL EXPOSURE LEVEL. RESPONSIBLE FOR PORTFOLIO MANAGEMENT OF ASSIGNED PORTFOLIO OF EQUIPMENT FINANCE / RENEWABLE ENERGY LOANS OR LEASE RELATIONSHIPS. THIS INCLUDES ANNUAL REVIEWS AND PD RATING ASSIGNMENT AS WELL AS PERIODIC FINANCIAL REVIEW AND COVENANT COMPLIANCE REVIEWS AS REQUIRED BY THE FINANCING DOCUMENTS. IDENTIFIES EMERGING RISKS IN THE PORTFOLIO AND RAISES TO THE LOB LEADER. WILL BE TAUGHT AND EXPECTED TO DEVELOP A HIGH DEGREE OF KNOWLEDGE OF MULTIPLE INDUSTRIES INCLUDING, BUT NOT LIMITED TO, TRANSPORTATION (TRUCKING, MARINE, AIR, RAIL), MANUFACTURING, LEASING/RENTAL, FOOD PRODUCTION, MEDICAL, RENEWABLE ENERGY (WIND/SOLAR/BESS), POWER & UTILITIES, COMMUNICATIONS, CONSTRUCTION, AND RETAIL AMONG OTHERS. IN ADDITION, THIS POSITION WILL HELP EVALUATE NEW MARKETS AND INDUSTRIES FOR THE BUSINESS UNIT TO EXPLORE FOR GROWTH OPPORTUNITIES. EDUCATES CLIENTS AND TEAMMATES ABOUT FINANCIAL STRATEGIES RELEVANT TO BOTH EQUIPMENT FINANCE AS WELL AS GENERAL BANKING NEEDS (CHANGE TO TAX LAWS, ACCOUNTING RULES, MARKET TRENDS AND HOW THOSE MAY DICTATE FINANCIAL STRATEGY) BASED ON CUSTOMER PROFILE AND FINANCIAL PLAN AND MATCHING CUSTOMER NEEDS WITH APPROPRIATE PRODUCTS AND SERVICES. MONITORS CUSTOMER INFORMATION / PRODUCTS, AND MARKET TRENDS TO IDENTIFY NEW CUSTOMER NEEDS AND OPPORTUNITIES TO DELIVER FURTHER CUSTOMER VALUE. MAY ASSIST OPERATIONS MANAGER WITH THE DAILY ACTIVITIES OF THE DEPARTMENT AND SPECIALIZE IN WORKING WITH OUTSIDE COUNSEL TO PREPARE, REVIEW AND NEGOTIATE LEGAL DOCUMENTATION. \n\nQUALIFICATIONS INCLUDE\n\nEDUCATION REQUIRED: BACHELORS EXPERIENCE REQUIRED: 5-10 YEARS (EXPERIENCE PREFERRED: 10+ YEARS)ACCURATE TYPING, SPELLING AND GRAMMAR SKILLSPROFICIENT WITH APPLICABLE COMPUTER SOFTWARE AND EXCEL FINANCIAL MODELINGSTRONG WRITTEN AND ORAL COMMUNICATION SKILLSGOOD ORGANIZATIONAL AND CUSTOMER SERVICE SKILLSABILITY TO MANAGE MULTIPLE TASKS ACCURATELYATTENTION TO DETAILSTRONG WORK ETHIC, SENSE OF URGENCY AND ABILITY WORK OUTSIDE OF NORMAL BUSINESS HOURS WHEN NEEDED\n\nABOUT US\n\nFIRST HORIZON IS A LEADING REGIONAL FINANCIAL SERVICES COMPANY, DEDICATED TO HELPING OUR CLIENTS, COMMUNITIES AND ASSOCIATES UNLOCK THEIR FULL POTENTIAL WITH CAPITAL AND COUNSEL. WITH $81.7 BILLION IN ASSETS AS OF DECEMBER 31, 2023, WE SERVE CLIENTS THROUGH A TEAM OF APPROXIMATELY ~7,300 ASSOCIATES AND ~418 BANKING CENTERS THROUGHOUT THE SOUTHEASTERN UNITED STATES. HEADQUARTERED IN MEMPHIS, TN, THE BANKING SUBSIDIARY FIRST HORIZON BANK OPERATES IN 12 STATES ACROSS THE SOUTHERN U.S. FIRST HORIZON HAS BEEN RECOGNIZED AS ONE OF THE NATION’S BEST EMPLOYERS BY FORTUNE AND FORBES MAGAZINES AND A TOP 10 MOST REPUTABLE U.S. BANK.\n\nBENEFIT HIGHLIGHTS\n\n MEDICAL WITH WELLNESS INCENTIVES, DENTAL, AND VISION HSA WITH COMPANY MATCH MATERNITY AND PARENTAL LEAVE TUITION REIMBURSEMENT MENTOR PROGRAM 401(K) WITH 6% MATCH MORE -- FIRSTHORIZON.COM/FIRST-HORIZON-NATIONAL-CORPORATION/CAREERS/OUR-BENEFITS\n\nCORPORATE DIVERSITY COMMITMENT:\n\nWE REMAIN COMMITTED TO CREATING A MORE EQUITABLE SOCIETY, AND THAT STARTS WITH OUR ASSOCIATES, OUR CLIENTS, AND THE COMMUNITIES WE SERVE. WE DO THIS BY ELEVATING EQUITY, PROVIDING CAPITAL AND COUNSEL, AND COMMITTING TO EXCELLENCE IN EVERYTHING WE DO.\n\nFOLLOW US\n\nFACEBOOK\n\nX FORMERLY TWITTER\n\nLINKEDIN\n\nINSTAGRAM\n\nYOUTUBE",
    "job_skill_set": [
      "commercial loans",
      "credit underwriting",
      "communication",
      "organizational skills",
      "problem solving",
      "teamwork",
      "work ethic",
      "time management",
      "financial modeling",
      "portfolio management",
      "legal documentation",
      "Excel",
      "data analysis",
      "customer service",
      "attention to detail"
    ],
    "short_keywords": [
      "analysis",
      "attention",
      "commercial",
      "communication",
      "credit",
      "customer",
      "data",
      "detail",
      "documentation",
      "equipment",
      "ethic",
      "excel",
      "finance",
      "financial",
      "legal",
      "loans",
      "management",
      "manager",
      "modeling",
      "organizational",
      "portfolio",
      "problem",
      "senior",
      "service",
      "skills",
      "solving",
      "teamwork",
      "time",
      "to",
      "underwriting",
      "work"
    ]
  },
  {
    "job_id": "3903475677",
    "job_title": "Transactional Finance Specialist",
    "category": "FINANCE",
    "job_description": "AT BON SECOURS MERCY HEALTH, WE ARE DEDICATED TO CONTINUALLY IMPROVING HEALTH CARE QUALITY, SAFETY AND COST EFFECTIVENESS. OUR HOSPITALS, CARE SITES AND CLINICIANS ARE RECOGNIZED FOR CLINICAL AND OPERATIONAL EXCELLENCE.\n\nSUMMARY OF PRIMARY FUNCTION\n\nTRANSACTIONAL FINANCE SPECIALISTS REPORT UP TO THE TRANSACTIONAL ACCOUNTING MANAGER AND ARE RESPONSIBLE FOR MONITORING TRAVEL AND EXPENSE REPORTING TO SUPPORT THE ACCOUNTING DEPARTMENT, ALONG WITH NON-PATIENT AR/INVOICE BILLING & PAYMENT APPLICATION, WHICH ENSURE THE INTEGRITY AND ACCURACY OF REPORTING IN LINE WITH COMPANY POLICIES AND GUIDELINES.\n\nESSENTIAL FUNCTIONS\n\nSUPPORT TRANSACTIONAL ACCOUNTING MANAGER IN MONITORING TRAVEL AND EXPENSE REPORTING, AS WELL AS DEPARTMENT MAIL DISTRIBUTION ROTATION, AND NON-PATIENT ACCOUNTS RECEIVABLE-RELATED CUSTOMER INVOICING AND PAYMENT APPLICATION & REPORTING.\n\nABILITY TO ENGAGE PERSONNEL WHERE APPROPRIATE IN GATHERING, REPORTING AND EXPLAINING SUBSTANCE OF BUSINESS TRAVEL POLICIES.\n\nDEMONSTRATE PROFICIENCY IN USE OF CORE FINANCIAL SYSTEMS INCLUDING, BUT NOT LIMITED TO WORKDAY (EXPENSES, CUSTOMER ACCOUNTS, GL, ETC..) & CORPORATE TRAVEL CARD SYSTEM.\n\nMUST BE ABLE TO DEMONSTRATE KNOWLEDGE OF COMPANY POLICIES AND PROCEDURES, MOST NOTABLY THE TRAVEL POLICY.\n\nALL OTHER JOB-RELATED DUTIES AS ASSIGNED.\n\nTHIS DOCUMENT IS NOT AN EXHAUSTIVE LIST OF ALL RESPONSIBILITIES, SKILLS, DUTIES, REQUIREMENTS, OR WORKING CONDITIONS ASSOCIATED WITH THE JOB. EMPLOYEES MAY BE REQUIRED TO PERFORM OTHER JOB-RELATED DUTIES AS REQUIRED BY THEIR SUPERVISOR, SUBJECT TO REASONABLE ACCOMMODATION.\n\nEDUCATION QUALIFICATIONS\n\nREQUIRED MINIMUM EDUCATION:\n\nHIGH SCHOOL DIPLOMA OR GED\n\nPREFERRED EDUCATION:\n\nVOCATIONAL/ TECHNICAL DEGREE\n\nSPECIALTY/MAJOR:\n\nACCOUNTING\n\nMINIMUM QUALIFICATIONS\n\nMINIMUM YEARS AND TYPE OF EXPERIENCE:\n\n6 MONTHS RELEVANT EXPENSE MONITORING AND REPORTING EXPERIENCE, AS WELL AS AR/BILLING EXPERIENCE\n\nOTHER KNOWLEDGE, SKILLS AND ABILITIES REQUIRED:\n\nMUST HAVE BASIC KEYBOARDING SKILLS. EXPERIENCE WITH MICROSOFT OFFICE, ESPECIALLY EXCEL A PLUS. SOFTWARE EXPERIENCE IN WORKDAY. ABILITY TO UNDERSTAND TRAVEL AND EXPENSE POLICIES.\n\nMANY OF OUR OPPORTUNITIES REWARD* YOUR HARD WORK WITH:\n\nCOMPREHENSIVE, AFFORDABLE MEDICAL, DENTAL AND VISION PLANS\n\nPRESCRIPTION DRUG COVERAGE\n\nFLEXIBLE SPENDING ACCOUNTS\n\nLIFE INSURANCE W/AD&D\n\nEMPLOYER CONTRIBUTIONS TO RETIREMENT SAVINGS PLAN WHEN ELIGIBLE\n\nPAID TIME OFF\n\nEDUCATIONAL ASSISTANCE\n\nAND MUCH MORE\n\n\nBENEFITS OFFERINGS VARY ACCORDING TO EMPLOYMENT STATUS\n\n\nALL APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, NATIONAL ORIGIN, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, AGE, GENETIC INFORMATION, OR PROTECTED VETERAN STATUS, AND WILL NOT BE DISCRIMINATED AGAINST ON THE BASIS OF DISABILITY. IF YOU'D LIKE TO VIEW A COPY OF THE AFFIRMATIVE ACTION PLAN OR POLICY STATEMENT FOR MERCY HEALTH – YOUNGSTOWN, OHIO OR BON SECOURS – FRANKLIN, VIRGINIA; PETERSBURG, VIRGINIA; AND EMPORIA, VIRGINIA, WHICH ARE AFFIRMATIVE ACTION AND EQUAL OPPORTUNITY EMPLOYERS, PLEASE EMAIL RECRUITMENT@MERCY.COM. IF YOU ARE AN INDIVIDUAL WITH A DISABILITY AND WOULD LIKE TO REQUEST A REASONABLE ACCOMMODATION AS PART OF THE EMPLOYMENT SELECTION PROCESS, PLEASE CONTACT THE TALENT ACQUISITION TEAM AT RECRUITMENT@MERCY.COM",
    "job_skill_set": [
      "accounts receivable",
      "billing",
      "Microsoft Excel",
      "financial systems",
      "communication",
      "attention to detail",
      "problem solving",
      "teamwork",
      "adaptability",
      "expense monitoring",
      "reporting",
      "Workday",
      "keyboard skills"
    ],
    "short_keywords": [
      "accounts",
      "adaptability",
      "attention",
      "billing",
      "communication",
      "detail",
      "excel",
      "expense",
      "finance",
      "financial",
      "keyboard",
      "microsoft",
      "monitoring",
      "problem",
      "receivable",
      "reporting",
      "skills",
      "solving",
      "specialist",
      "systems",
      "teamwork",
      "to",
      "transactional",
      "workday"
    ]
  },
  {
    "job_id": "3887593436",
    "job_title": "Director of Finance, N.A.",
    "category": "FINANCE",
    "job_description": "WANT TO LEARN MORE ABOUT THIS ROLE AND JOBOT? CLICK OUR JOBOT LOGO AND FOLLOW OUR LINKEDIN PAGE!\n\nJOB DETAILS\n\nEXCELLENT BONUS - PENSION - STABILITY\n\nTHIS JOBOT JOB IS HOSTED BY JUSTIN RICE\n\nARE YOU A FIT? EASY APPLY NOW BY CLICKING THE \"EASY APPLY\" BUTTON AND SENDING US YOUR RESUME.\n\nSALARY $155,000 - $175,000 PER YEAR\n\nA BIT ABOUT US\n\nWE ARE WORKING WITH ONE OF OUR TOP CLIENTS IN INDIANA -- THEY'RE A WORLD RENOWNED MANUFACTURING ORGANIZATION WITH MULTIPLE LOCATIONS ACROSS NORTH AMERICA.\n\n\n\nWHY JOIN US?\n\n\nVACATION 15 DAYS\n\nHOLIDAYS IMMEDIATE ELIGIBILITY.\n\nCHRISTMAS SHUTDOWN FOR 2024 IS (DEC 24 – JAN 1ST, 2025)\n\nBENEFITS ELIGIBLE DAY OF HIRE FOR MEDICAL, DENTAL, VISION, LIFE INSURANCE, ETC. THE ONLY BENEFIT NOT ELIGIBLE FOR ON DAY OF HIRE IS 401K SAVINGS/PENSION. YOU ARE ELIGIBLE TO PARTICIPATE IN THESE ON THE FIRST DAY FOLLOWING 3 MONTHS.\n\n401K SAVINGS THROUGH EMPOWER. COMPANY MATCH IS .50CENTS ON THE DOLLAR UP TO THE FIRST 6%. YOU CAN CONTRIBUTE 0-50% OF GROSS WAGES.\n\nPENSION COMPANY PUTS 3% OF YOUR GROSS WAGES INTO A PENSION PLAN FOR YOU.\n\nCELL PHONE REIMBURSEMENT UP TO $85 PER MONTH\n\nCOMPANY CLOTHING ALLOTMENT.\n\nJOB DETAILS\n\nFULL TIME -- DIRECTOR OF FINANCE - OVERSEES ALL OPERATIONS FOR NORTH AMERICA\n\nBASE SALARY $140K - 170K PLUS A 20% BONUS (EXCELLENT PAYOUT HISTORY!)\n\nMUST HAVE EXPERIENCE IN MANUFACTURING\n\nSUMMARY\n\nDIRECTS THE FINANCIAL AFFAIRS OF THE CORPORATION AND PREPARES FINANCIAL ANALYSIS OF OPERATIONS, INCLUDING INTERIM AND FINAL FINANCIAL STATEMENTS WITH SUPPORTING SCHEDULES, FOR THE GUIDANCE OF MANAGEMENT. THE DIRECTOR IS RESPONSIBLE FOR THE COMPANY’S FINANCIAL PLANS AND POLICIES, RELATIONS WITH FINANCIAL INSTITUTIONS, ACCOUNTING PRACTICES, MAINTENANCE OF FISCAL RECORDS, AND PREPARATION OF FINANCIAL REPORTS. THE POSITION INVOLVES SUPERVISION OVER GENERAL ACCOUNTING, PROPERTY ACCOUNTING, COST ACCOUNTING AND BUDGET PREPARATION.\n\nESSENTIAL DUTIES & RESPONSIBILITIES\n\nDEVELOP, ANALYZE, AND INTERPRET ACCOUNTING INFORMATION IN ORDER TO APPRAISE OPERATING RESULTS IN TERMS OF PROFITABILITY AND PERFORMANCE AGAINST BUDGET.\n\nMAINTAINS THE COMPANY’S SYSTEM OF ACCOUNTS AND KEEPS RECORDS OF ALL COMPANY TRANSACTIONS AND ASSETS.\n\nFURNISHES INTERNAL REPORTS, REVISES, AND IMPROVES REPORTS AS NECESSARY.\n\nCOORDINATES AND DIRECTS THE PREPARATION OF THE BUDGET AND FINANCIAL FORECASTS, INSTITUTES AND MAINTAINS OTHER PLANNING AND CONTROL PROCEDURES (INCLUDING THE COST ACCOUNTING SYSTEM) AND ANALYZES AND REPORTS VARIANCES.\n\nESTABLISHES MAJOR ECONOMIC OBJECTIVES AND POLICIES AND PREPARES REPORTS IN THE AREAS OF INCOME, EXPENSES, AND EARNINGS BASED ON PAST, PRESENT, AND FUTURE OPERATIONS.\n\nRESPONSIBLE FOR TAX PLANNING AND COMPLIANCE WITH FEDERAL, STATE, AND LOCAL TAXES AND COMPLIANCE OF BENEFIT PLANS.\n\nEVALUATES AND RECOMMENDS INSURANCE COVERAGE FOR PROTECTION AGAINST PROPERTY LOSSES AND POTENTIAL LIABILITIES.\n\nQUALIFICATIONS\n\nEXPERIENCE IN ALL AREAS OF ACCOUNTING INCLUDING GENERAL, COST, ACCOUNTS RECEIVABLE, ACCOUNTS PAYABLE, PAYROLL AND TAX.\n\nIN DEPTH WORKING KNOWLEDGE OF FINANCIAL SYSTEMS AND PREVIOUS PROFIT AND LOSS RESPONSIBILITY\n\nABILITY TO CREATE TEAM ENVIRONMENT\n\nMUST BE ABLE TO FUNCTION IN AN INDEPENDENT ENVIRONMENT\n\nPOSSESS EXCELLENT LEADERSHIP ABILITY\n\nEDUCATION &/OR EXPERIENCE\n\nBACHELOR’S DEGREE IN ACCOUNTING OR FINANCE\n\nCPA, CMA, OR MBA PREFERRED\n\nAT LEAST 5 YEARS’ EXPERIENCE IN MANAGEMENT AND/OR SUPERVISION IN A MANUFACTURING ENVIRONMENT\n\nINTERESTED IN HEARING MORE? EASY APPLY NOW BY CLICKING THE \"EASY APPLY\" BUTTON.\n\nWANT TO LEARN MORE ABOUT THIS ROLE AND JOBOT?\n\nCLICK OUR JOBOT LOGO AND FOLLOW OUR LINKEDIN PAGE!\n\n",
    "job_skill_set": [
      "accounting practices",
      "budget preparation",
      "financial reporting",
      "profit and loss responsibility",
      "leadership",
      "teamwork",
      "independence",
      "communication",
      "analytical thinking",
      "problem solving",
      "financial analysis",
      "cost accounting",
      "tax planning",
      "financial forecasting",
      "financial systems",
      "CPA",
      "CMA",
      "MBA"
    ],
    "short_keywords": [
      "accounting",
      "analysis",
      "analytical",
      "and",
      "budget",
      "cma",
      "communication",
      "cost",
      "cpa",
      "director",
      "finance",
      "financial",
      "forecasting",
      "independence",
      "leadership",
      "loss",
      "mba",
      "na",
      "of",
      "planning",
      "practices",
      "preparation",
      "problem",
      "profit",
      "reporting",
      "responsibility",
      "solving",
      "systems",
      "tax",
      "teamwork",
      "thinking"
    ]
  },
  {
    "job_id": "3901397002",
    "job_title": "Workday Finance Technical Lead",
    "category": "FINANCE",
    "job_description": "POSITION: WORKDAY FINANCE TECHNICAL, INTEGRATIONS AND REPORTING LEADLOCATION: HYBRID - PROVIDENCE, RI [3 DAYS ONSITE, 2 REMOTE]CONTRACT TERM: 2 MONTHS FROM PROJECTED START DATE - POSSIBLE EXTENSION  REPORTING RESPONSIBILITIES:• SERVE AS THE WORKDAY FINANCE REPORTING DOMAIN AUTHORITY PROVIDING BEST PRACTICES AND STANDARDS.• ANALYTICS DEVELOPMENT: DEVELOP, DESIGN, DELIVER, AND MAINTAIN SIMPLE TO COMPLEX WORKDAY REPORTS AND DASHBOARDS, INCLUDING CALCULATED FIELDS, WORKDAY SLIDES, WORKSHEETS, REPORT GROUPS, DISCOVERY BOARDS, MATRIX AND COMPOSITE REPORTS, CUSTOM OBJECTS, AND REPORT DRILLING.• UTILIZES WORKDAY REPORT WRITER, REPORT DESIGNER AND PRISM, AS WELL AS OTHER ORGANIZATIONAL TOOLS AND AVAILABLE TECHNOLOGIES WITH A FOCUS ON DESIGN AND PERFORMANCE.• DEVELOP COMPLEX CALCULATED FIELDS, MAINTAINING THE STANDARDS AND INTEGRITY OF THE DATA.• CREATE AND MAINTAIN STANDARDIZED REAL-TIME DASHBOARDS DISPLAYING KEY METRICS AND INSIGHTS FOR BUSINESS LEADERS IN A VISUALLY APPEALING MANNER, UTILIZING THE FULL ANALYTICS SUITE.• WORK WITH BUSINESS PARTNERS AND COE'S TO DOCUMENT REPORT REQUIREMENTS, DESIGN, DEVELOP AND DELIVER REPORTS.• DEVELOPS AND DELIVERS TRAINING TO SUPPORT SELF-SERVICE REPORTING, DATA LITERACY, SCHEDULING, AND BEST PRACTICES.• ORGANIZES AND MONITORS PERSONA-BASED REPORT PACKAGES AND INVENTORY TO MAXIMIZE SELF-SERVICE REPORTING FUNCTIONALITY AND MINIMIZE AD-HOC REPORT REQUESTS.• COMMUNICATE COMPLEX INFORMATION SO THAT IT IS EASY TO UNDERSTAND AND INFLUENCES BUSINESS OWNERS TO TAKE ACTION BASED ON THE USEFUL INFORMATION PROVIDED TO ENABLE DATA-DRIVEN DECISION-MAKING.• LEAD THE PREPARATION AND DELIVERY OF COMPLEX FINANCE REPORTS; MANAGE PROJECT DELIVERABLES, MILESTONES, AND SPECIFIED PROJECT TASKS.• REVIEW THE EFFECTIVENESS OF REPORTING SOLUTIONS, IMPROVE CURRENT REPORTS, OR OPERATIONALIZE NEW REPORTS/METHODS AS NEEDED.• PARTNER WITH THE FINANCE SYSTEMS TEAM ON LEVERAGING WORKDAY AND EXECUTING IMPLEMENTATION PLAN FOR BI-ANNUAL UPGRADES TO THE REPORTING, ANALYTICS, AND PLANNING AREAS.• PERFORM UAT AND OBTAIN SIGN-OFF FOR PRODUCTION DEPLOYMENTS.• LEAD PRISM STRATEGY AND DEVELOPMENT OF METRICS, REPORTING AND DASHBOARDS BASED ON BUSINESS STRATEGY AND INSIGHTS; ESTABLISH CHECKPOINTS ON RESULTS AND IMPACTS.• DEVELOP A DEEP UNDERSTANDING OF DATA STRUCTURES AND DATA SOURCES WITHIN WORKDAY AND PRISM TO EXTRACT RELEVANT INFORMATION FOR REPORTING PURPOSES.• DATA GOVERNANCE: ESTABLISH AND MAINTAIN DATA GOVERNANCE PROCESSES AND STANDARDS TO ENSURE DATA ACCURACY, CONSISTENCY, QUALITY, AND SECURITY WITHIN THE WORKDAY FINANCE PLATFORM. UNDERSTAND AND ENSURE SECURITY AND DATA PRIVACY STANDARDS ARE FOLLOWED.• MAINTAINS ALL PEOPLE RESOURCES REPORTING INVENTORY TO ENSURE CONSISTENT NAMING, DESCRIPTIONS, TAGGING, FORMATTING, FILTERS, AND SHARE PERMISSIONS.• FACILITATE THE CAPTURE, DEVELOPMENT, AND ANALYSIS OF ORGANIZATIONAL AND TALENT DATA FOR STRATEGIC INSIGHTS FROM EXTERNAL SOURCES INTO WORKDAY.• PARTNER WITH BUSINESS OWNERS TO EXAMINE INTERNAL AND EXTERNAL EMPLOYEE DATA TRENDS AND PROVIDE RECOMMENDATIONS.• STRONG KNOWLEDGE OF FINANCE PROCESS, POLICIES, AND DATA STRUCTURES, WITH AN ABILITY TO TRANSLATE BUSINESS REQUIREMENTS INTO EFFECTIVE REPORTING SOLUTIONS.• ABILITY TO COLLECT, COORDINATE, ANALYZE AND DISSEMINATE SIGNIFICANT AMOUNTS OF INFORMATION WITH ATTENTION TO DETAIL AND ACCURACY AND WITH HIGHLY CONFIDENTIAL DATA.• UNDERSTAND COMPLEXITIES AND NUANCES WITH REPORTING ON DIFFERENT ORGANIZATION HIERARCHIES.• PRIOR EXPERIENCE WITH DATA GOVERNANCE, AUDITING, DEVELOPING STANDARDS, AND DOCUMENTATION. TECHNICAL/ADMINISTRATIVE RESPONSIBILITIESADVANCED SECURITY ADMINISTRATION:• PROVIDES SECURITY ADMINISTRATION SUPPORT FOR ALL BUSINESS AREAS INCLUDING RESEARCHING & RESOLVING ISSUES WITH ROLE-BASED ASSIGNMENTS, DOMAINS AND CREATING CUSTOM SECURITY GROUPS TO ENABLE BUSINESS PROCESS AND REPORTING ACCESS TO CROSS-FUNCTIONAL USERS.• LEADS DESIGN, CREATION, CONFIGURATION, WORKFLOW, TESTING, TRAINING, AUDITING, IMPLEMENTATION, AND ADMINISTRATION OF WORKDAY BASIC AND ADVANCED SECURITY.• RECOMMENDS BEST SECURITY PRACTICES AND SOLUTIONS TO SUPPORT END TO END BUSINESS PROCESSES AND REPORTING REQUIREMENTS.• MAINTAINS DATA INTEGRITY AND SECURITY OF THE WORKDAY SYSTEM BY RUNNING PERIODIC AUDIT REPORTS, ANALYZING SYSTEM USAGE METRICS AND MAINTAINS ROLE AND USER-BASED SECURITY GROUPS, REVIEWING AND REVISING WORKDAY SYSTEM SECURITY POLICIES AND SECURITY GROUPS IN ORDER TO DELIVER THE ACCESS REQUIRED FOR THE POSITION’S RESPONSIBILITIES WHILE PROTECTING PII AND ACCESS TO INFORMATION NOT RELEVANT TO THEIR POSITION.• WORKS WITH MANAGEMENT, HUMAN RESOURCES, AND WORKDAY PRODUCT ANALYSTS UPON CREATION OF NEW POSITION, TRANSFER OF WORKERS, AND CHANGE OF JOB FAMILY TO ENSURE CORRECT ACCESS WHEN POSITION OVERLAPS REQUIRE EXTENDED ACCESS FROM PREVIOUS POSITION.TECHNICAL SUPPORT & CONTINUOUS IMPROVEMENT RELEASES:• PARTICIPATES IN MEETINGS WITH BUSINESS AND/OR PROJECT TEAMS WHEN APPROPRIATE TO DISCUSS PROJECTS, PROGRESS, AND ISSUES TO BE RESOLVED.• COLLABORATES WITH PRODUCT ANALYSTS AND BUSINESS UNITS TO STREAMLINE PROCESSES AND PROMOTE USER ADOPTION USING WORKDAY.• PARTNERS WITH PRODUCT ANALYSTS AND BUSINESS UNITS WHEN NEEDED TO ASSIST IN DESIGN, DEVELOPMENT, TESTING, DEPLOYMENT, AND MAINTENANCE USING WORKDAY DELIVERED TOOLS.• ASSISTS TEAM MEMBERS AND SYSTEM USERS WITH ISSUES BY INVESTIGATING PROBLEMS AND RESOLVING OR PROVIDING DETAILED RECOMMENDATIONS ON RESOLUTIONS.• GATHERS, BUILDS, TESTS, AND DOCUMENTS TECHNICAL REQUIREMENTS FOR ENHANCEMENTS AND PROJECTS.• RESPONSIBLE FOR OBJECT TRANSPORTATION OF CONFIGURATION PACKAGES FROM CUSTOMER CENTRAL. REQUIREMENTS:• 5+ YEARS’ EXPERIENCE WITH THE WORKDAY APPLICATION TO INCLUDE ADVANCED REPORTING PROFICIENCY.• 5+ YEARS OF EXPERIENCE IN WORKDAY INTEGRATIONS WORKING ON LARGE WORKDAY INITIATIVES.• 5+ YEARS OF EXPERIENCE WITH WORKDAY STUDIO (MINIMUM OF 10 STUDIO INTEGRATIONS), WORKDAY REPORT WRITER, CALCULATED FIELDS WORKDAY EXTEND, CCB, BIRT, EIBS, CORE CONNECTORS, INTEGRATION SYSTEM USER (ISU), INTEGRATION SYSTEM SECURITY GROUP (ISSG)• 5+ YEARS OF HANDS-ON EXPERIENCE CONFIGURING, DEVELOPING AND TESTING ON THE WORKDAY PLATFORM (PROFICIENT WITH INTEGRATIONS, INTEGRATION SECURITY, WORKDAY STUDIO, CLOUD CONNECT, EIBS, BIRT, CALCULATED FIELDS, REPORT WRITER, XML, XSLT, SOAP AND REST APIS)• 5+ YEARS FINANCE DATA ANALYSIS EXPERIENCE, INCLUDING THE ABILITY TO UNDERSTAND BUSINESS REQUIREMENTS, USER NEEDS AND TRANSLATE THEM INTO OPERATIONAL REQUIREMENTS.• 2+ YEARS’ EXPERIENCE WITH WORKDAY PRISM ANALYTICS.• DEEP WORKDAY REPORTING EXPERTISE USING BIRT, DASHBOARDS, EMBEDDED ANALYTICS, EIBS, CORE CONNECTORS, STUDIO INTEGRATIONS AND COMPOSITE REPORTING.• 3+ YEARS OF EXPERIENCE WITH WORKDAY SECURITY IN RELATION TO REPORTING.• 3+ YEARS OF EXPERIENCE WITHIN AGILE SCRUM METHODOLOGY.• EXPERIENCE WITH JSON, SOAP & REST STYLE WEB SERVICES• SOLID UNDERSTANDING OF WORKDAY'S BUSINESS OBJECT MODEL AND RELATIONSHIPS• UNDERSTANDING OF WORKDAY FUNCTIONAL MODULES SO THAT YOU CAN CREATE TECHNOLOGY CONNECTIONS (INCLUDING BUT NOT LIMITED TO: FINANCE, HCM, TALENT MANAGEMENT, BENEFITS, TIME TRACKING, ABSENCE, PAYROLL)• STRONG ANALYTICAL SKILLS, PROVEN EXPERIENCE UNDERSTANDING AND EFFECTIVELY IMPLEMENTING WORKDAY INTEGRATIONS ACROSS ALL WORKDAY MODULES.• 3+ YEARS OF EXPERIENCE WITHIN AGILE SCRUM METHODOLOGY• EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS, OUTSTANDING ORGANIZATIONAL SKILLS AND ATTENTION TO DETAIL• STRONG EXPERTISE IN PROJECT MANAGEMENT, BUSINESS ANALYSIS, GATHERING AND DOCUMENTING REQUIREMENTS.• STRONG ATTENTION TO DETAIL, PROBLEM SOLVING, TROUBLESHOOTING AND ANALYTICAL SKILLS.• ABILITY TO WORK EFFECTIVELY IN A FAST-PACED ENVIRONMENT AND HANDLE BOTH PLANNED AND UNPLANNED RESPONSIBILITIES.• ABILITY TO PRIORITIZE WORKLOAD AND EXECUTE TASKS INDEPENDENTLY, PROVIDING TIMELY FOLLOW-UP AND RESOLUTION.• ABILITY TO WORK INDEPENDENTLY AND IN A TEAM-ORIENTED, COLLABORATIVE ENVIRONMENT.• MINIMUM OF 1-3 YEARS' EXPERIENCE IN A SIMILAR POSITION SUPPORTING WORKDAY INTEGRATIONS OR WORKDAY SECURITY OR WORKDAY EXTEND AND POSSESSING A TECHNICAL DEVELOPMENT BACKGROUND.• ADVANCED SKILLS IN WORKDAY STUDIO, API(S), XML AND XSLT AND INTERACTION WITH SOAP AND REST BASED WEB SERVICES, EIB, CORE CONNECTORS, REPORTING, USE OF RAAS, INTEGRATION SECURITY, CALCULATED FIELDS AND MICROSOFT OFFICE SUITE.• ADVANCED SKILLS IN APPLYING ROLE-BASED AND USER-BASED SECURITY AND DOMAINS.• ADVANCED BUSINESS AND WORKDAY SYSTEMS ANALYSIS SKILLS.• INTERMEDIATE SKILLS IN AGILE DELIVERY MANAGEMENT• PROVIDE THE HIGHEST LEVEL OF CUSTOMER SUPPORT VIA INTERNAL TICKETING SYSTEM.• DEMONSTRATED ABILITY TO INFLUENCE AND WORK EFFECTIVELY AND COLLABORATIVELY WITH VARIOUS BUSINESS PARTNERSHIPS, AND TO PROMOTE EFFECTIVE COLLABORATION BETWEEN TEAMS.• DISCIPLINE TO WORK WITH HIGHLY CONFIDENTIAL INFORMATION AND ABILITY TO CRITICALLY ANALYZE DATA INPUT/OUTPUT FOR ACCURACY AND EFFECTIVENESS.\n",
    "job_skill_set": [
      "Reporting",
      "Microsoft Office Suite",
      "Project Management",
      "Business Analysis",
      "Data Analysis",
      "Communication",
      "Problem Solving",
      "Attention to Detail",
      "Time Management",
      "Adaptability",
      "Critical Thinking",
      "Workday",
      "Integrations",
      "Data Governance",
      "Analytics Development",
      "Calculated Fields",
      "Workday Studio",
      "BIRT",
      "EIBS",
      "API",
      "XML",
      "XSLT",
      "SOAP",
      "REST",
      "Prism Analytics",
      "Security Administration",
      "Agile Scrum",
      "Dashboards",
      "User Acceptance Testing (UAT)",
      "Technical Support",
      "Data Structures",
      "Cloud Connect",
      "Role-Based Security",
      "User-Based Security",
      "Collaboration",
      "Organizational Skills",
      "Influencing Skills",
      "Customer Support",
      "Teamwork",
      "Training and Development"
    ],
    "short_keywords": [
      "acceptance",
      "adaptability",
      "administration",
      "agile",
      "analysis",
      "analytics",
      "and",
      "api",
      "attention",
      "birt",
      "business",
      "calculated",
      "cloud",
      "collaboration",
      "communication",
      "connect",
      "critical",
      "customer",
      "dashboards",
      "data",
      "detail",
      "development",
      "eibs",
      "fields",
      "finance",
      "governance",
      "influencing",
      "integrations",
      "lead",
      "management",
      "microsoft",
      "office",
      "organizational",
      "prism",
      "problem",
      "project",
      "reporting",
      "rest",
      "rolebased",
      "scrum",
      "security",
      "skills",
      "soap",
      "solving",
      "structures",
      "studio",
      "suite",
      "support",
      "teamwork",
      "technical",
      "testing",
      "thinking",
      "time",
      "to",
      "training",
      "uat",
      "user",
      "userbased",
      "workday",
      "xml",
      "xslt"
    ]
  },
  {
    "job_id": "3902954343",
    "job_title": "Document Review Specialist- Finance ",
    "category": "FINANCE",
    "job_description": "JOB TITLE: DOCUMENT REVIEW SPECIALISTDURATION: 09- MONTHS CONTRACT (GOOD POSSIBLE EXTENSIONS)LOCATION: ONSITE ROLE- NEW YORK, NY 10036PAY RATE: $55.00/HR ON W2 (WITHOUT ANY BENEFITS)\nJOB DESCRIPTION:• TRADING AGREEMENT NEGOTIATOR, RESPONSIBLE FOR HANDLING ALL ESCALATIONS AND COMPLEX NEGOTIATIONS OF EQUITY SWAP MASTER CONFIRMATIONS, OTC EQUITY OPTIONS MASTER CONFIRMATIONS, AND CONVERTIBLE BOND MCAS. THE INDIVIDUAL SHOULD BE A SUBJECT MATTER EXPERT IN EQUITY SWAPS AND IDEALLY HAVE KNOWLEDGE OF OTC EQUITY OPTIONS, THIS SHOULD INCLUDE AN UNDERSTANDING OF THE ISDA EQUITY DEFINITIONS. IN ADDITION TO BEING THE TEAM’S SME ON MASTER CONFIRMATIONS, THE INDIVIDUAL WILL HAVE THE OPPORTUNITY TO HANDLE ALL RELATIONSHIP-LEVEL TRADING AGREEMENTS, INCLUDING, BUT NOT LIMITED TO EQUITY DERIVATIVES, PRIME BROKERAGE, SECURITIES LENDING, CONFIDENTIALITY AGREEMENTS, FUTURES AGREEMENTS, LISTED OPTIONS AGREEMENTS, OTC CLEARING AGREEMENTS, ISDA MASTER AGREEMENT AND CSA AS WELL AS EQUITY MASTER CONFIRMATION AGREEMENTS.• THE TEAM CONSISTS OF 8 ATTORNEYS AND SITS WITHIN IED’S GLOBAL RISK MANAGEMENT TEAM. AS THE GROUP SITS WITHIN RISK MANAGEMENT, IT IS TASKED WITH ANALYZING AND MAKING RISK-BASED DECISIONS ON CLIENT NEGOTIATION REQUESTS. THE TEAM IS RESPONSIBLE FOR NEGOTIATING, DRAFTING, AND EXECUTING ALL NECESSARY AGREEMENTS WITH CLIENTS AND THEIR COUNSEL IN ADVANCE OF TRADING.\nJOB RESPONSIBILITIES• SUBJECT MATTER EXPERT IN EQUITY SWAP DOCUMENTATION FOR THE IED DOCUMENTATION TEAM• NEGOTIATE A FULL SUITE OF TRADING AGREEMENTS INCLUDING, BUT NOT LIMITED TO, ISDA MASTER AGREEMENTS AND CREDIT SUPPORT ANNEXES, STOCK LOANS, PRIME BROKERAGE AGREEMENTS, LISTED DERIVATIVE TRADING AGREEMENTS, OTC CLEARING AGREEMENTS, TRI-PARTY CONTROL AGREEMENTS, MASTER CONFIRM AGREEMENTS, CONFIDENTIALITY AGREEMENTS, ELECTRONIC TRADING AGREEMENTS, AND OTHER TRADING-RELATED AGREEMENTS.• LIAISE WITH IED SALES AND TRADING DESKS, AS WELL AS MEMBERS OF THE FIRM’S LEGAL, RISK, CREDIT, AND ONBOARDING TEAMS.• THE CLIENT BASE INCLUDES HEDGE FUNDS, MUTUAL FUNDS, PENSIONS, INSURANCE COMPANIES, BANKS, CORPORATIONS AND MONEY MANAGERS.ACT AS THE PRIMARY POINT OF CONTACT WITH CLIENTS AND THEIR COUNSEL FOR ALL NEGOTIATIONS. INTERACT WITH CLIENTS IN CONNECTION WITH NEW INDUSTRY RULES AND REGULATIONS.\nQUALIFICATIONS - EXTERNAL• STRONG VERBAL AND WRITTEN COMMUNICATION SKILLS; ATTENTION TO DETAIL; ABILITY TO MEET TIMING DEADLINES ON MULTIPLE PROJECTS• CONTRACT DRAFTING EXPERIENCE• ABILITY AND INITIATIVE TO PROACTIVELY COMMUNICATE WITH SENIOR BUSINESS UNIT MEMBERS• COMFORTABLE WORKING IN AN OPEN TRADING FLOOR ENVIRONMENT• 1+ YEARS’ EXPERIENCE NEGOTIATING MASTER CONFIRMATIONS AND/OR LONG-FORM CONFIRMATIONS. • A PLUS IF EXPERIENCE NEGOTIATING TRADING AGREEMENTS AT A BROKER/DEALER, BUY-SIDE FIRM, AND/OR LAW FIRM WITH AN EMPHASIS ON EQUITY SWAPS AND THE MASTER CONFIRMATIONS ASSOCIATED WITH THOSE TRANSACTIONS.• JD PREFERRED",
    "job_skill_set": [
      "negotiation",
      "communication",
      "teamwork",
      "time management",
      "initiative",
      "client interaction",
      "problem solving",
      "equity swaps",
      "contract drafting",
      "ISDA Master Agreement",
      "OTC equity options",
      "risk management",
      "trading agreements",
      "attention to detail",
      "financial regulations",
      "legal documentation"
    ],
    "short_keywords": [
      "agreement",
      "agreements",
      "attention",
      "client",
      "communication",
      "contract",
      "detail",
      "document",
      "documentation",
      "drafting",
      "equity",
      "finance",
      "financial",
      "initiative",
      "interaction",
      "isda",
      "legal",
      "management",
      "master",
      "negotiation",
      "options",
      "otc",
      "problem",
      "regulations",
      "review",
      "risk",
      "solving",
      "specialist",
      "swaps",
      "teamwork",
      "time",
      "to",
      "trading"
    ]
  },
  {
    "job_id": "3889128152",
    "job_title": "Associate Director, Finance and Controlling",
    "category": "FINANCE",
    "job_description": "UNITED STATES, PORTSMOUTH (NEW HAMPSHIRE)\n\nTODAY, LONZA IS A GLOBAL LEADER IN LIFE SCIENCES OPERATING ACROSS THREE CONTINENTS. WHILE WE WORK IN SCIENCE, THERE’S NO MAGIC FORMULA TO HOW WE DO IT. OUR GREATEST SCIENTIFIC SOLUTION IS TALENTED PEOPLE WORKING TOGETHER, DEVISING IDEAS THAT HELP BUSINESSES TO HELP PEOPLE. IN EXCHANGE, WE LET OUR PEOPLE OWN THEIR CAREERS. THEIR IDEAS, BIG AND SMALL, GENUINELY IMPROVE THE WORLD. AND THAT’S THE KIND OF WORK WE WANT TO BE PART OF.\n\nLONZA PORTSMOUTH IS SEEKING A CONTROLLING EXPERT WHO WILL PROVIDE FINANCIAL AND ANALYTICAL SUPPORT AT THE MANUFACTURING AND SITE LEVEL. THE ROLE IS RESPONSIBLE FOR REGULAR ANALYSIS AND FUNCTIONAL SUPPORT. EXERCISES JUDGMENT WITHIN GENERALLY DEFINED PRACTICES AND POLICIES IN SELECTING METHODS, TECHNIQUES, AND EVALUATION CRITERIA FOR OBTAINING RESULTS.\n\nKEY RESPONSIBILITIES\n\nSUPPORTS THE HEAD OF FINANCE IN VARIOUS FINANCIAL TASK (ANALYSIS AND STRATEGY)TAKES A LEADING ROLE IN LOCAL AND REGIONAL MANAGEMENT TEAMS TO SET, IMPLEMENT AND DELIVER ON LOCAL BUSINESS OBJECTIVESSHARES LOCAL OR REGIONAL RESPONSIBILITY FOR FINANCIAL AND MANAGEMENT ACCOUNTING IN ACCORDANCE WITH IFRS, THE LONZA FINANCE ACCOUNTING MANUAL (FAM) AND OTHER REQUIRED ACCOUNTING PRINCIPLESWORKS WITH BUSINESS TEAMS TO SET AND TRACK RELEVANT KPI'S FOR COST CONTROLLING.TAKES A LEADING ROLE IN OVERSEEING MONTH END CLOSE AND REPORTING PROCESSESCOORDINATES WITH SITE/BUSINESS AND SERVICE CENTER TEAMS TO PREPARE SITE ANNUAL TARGET/BSR, OUTLOOKS AND FORECASTS, BUSINESS MODELING, MONTHLY CLOSING REPORTING, VARIANCE AND ANALYSIS REPORTING, PRODUCT COSTING, CONTRIBUTION REPORTING BASED ON BUSINESS REQUIREMENTSLOCAL/REGIONAL BUSINESS PARTNER - ANALYSIS AND DECISION SUPPORT IN THE AREA OF PRICING, FINANCIAL ANALYSIS FOR CONTRACT NEGOTIATIONS, SUPPLY CONTRACTS, MODELLING, PROJECT EVALUATIONS, COSTING, PERFORMANCE MEASURES, TRAINING, STRATEGIC PLANNING, BUSINESS GOAL DEVELOPMENTCOORDINATES LOCAL CAPITAL EXPENDITURE EVALUATIONS AND SUBMISSIONS\n\nKEY REQUIREMENTS\n\nBACHELORS DEGREE IN FINANCE OR RELATED FIELD7+ YEARS OF EXPERIENCE WITHIN FINANCE AND CONTROLLINGEXPERIENCED IN FINANCIAL BUSINESS MODELING AND HIGHLY ANALYTICALDEMONSTRATED EXPERIENCE IN WORKING WITH DIVERSE TEAMS SPREAD ACROSS GEOGRAPHIESEXCELLENT PROFESSIONAL ORAL AND WRITTEN COMMUNICATION SKILLSHIGH LEVEL OF ORGANIZATIONABILITY TO RE-PRIORITIZE ACTIVITIES AS REQUIRED BY CHANGES TO DAILY ACTIVITIESABILITY TO WORK IN A FAST PACED ENVIRONMENT AND REACT TO ANY CHANGES IN DAILY SCHEDULED ACTIVITIESABLE TO WORK WITHIN A TEAM, AS WELL AS DRIVE TEAM ACTIVITIESPROBLEM SOLVING SKILLSABILITY TO WORK INDEPENDENTLY TO COMPLETE ALL REQUIRED ACTIVITIESHIGH LEVEL OF ATTENTION TO DETAIL AT ALL TIMES\n\nEVERY DAY, LONZA’S PRODUCTS AND SERVICES HAVE A POSITIVE IMPACT ON MILLIONS OF PEOPLE. FOR US, THIS IS NOT ONLY A GREAT PRIVILEGE, BUT ALSO A GREAT RESPONSIBILITY. HOW WE ACHIEVE OUR BUSINESS RESULTS IS JUST AS IMPORTANT AS THE ACHIEVEMENTS THEMSELVES. AT LONZA, WE RESPECT AND PROTECT OUR PEOPLE AND OUR ENVIRONMENT. ANY SUCCESS WE ACHIEVE IS NO SUCCESS AT ALL IF NOT ACHIEVED ETHICALLY.\n\nPEOPLE COME TO LONZA FOR THE CHALLENGE AND CREATIVITY OF SOLVING COMPLEX PROBLEMS AND DEVELOPING NEW IDEAS IN LIFE SCIENCES. IN RETURN, WE OFFER THE SATISFACTION THAT COMES WITH IMPROVING LIVES ALL AROUND THE WORLD. THE SATISFACTION THAT COMES WITH MAKING A MEANINGFUL DIFFERENCE.\n\nLONZA IS AN EQUAL OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, RELIGION, COLOR, NATIONAL ORIGIN, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, AGE, STATUS AS A QUALIFIED INDIVIDUAL WITH DISABILITY, PROTECTED VETERAN STATUS, OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW.\n\nREFERENCE: R59828\n\nAPPLY",
    "job_skill_set": [
      "financial analysis",
      "financial modeling",
      "IFRS",
      "management accounting",
      "cost controlling",
      "variance analysis",
      "business modeling",
      "KPI tracking",
      "capital expenditure evaluation",
      "communication",
      "teamwork",
      "problem solving",
      "organizational skills",
      "adaptability",
      "attention to detail",
      "independence"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "analysis",
      "and",
      "associate",
      "attention",
      "business",
      "capital",
      "communication",
      "controlling",
      "cost",
      "detail",
      "director",
      "evaluation",
      "expenditure",
      "finance",
      "financial",
      "ifrs",
      "independence",
      "kpi",
      "management",
      "modeling",
      "organizational",
      "problem",
      "skills",
      "solving",
      "teamwork",
      "to",
      "tracking",
      "variance"
    ]
  },
  {
    "job_id": "3895564523",
    "job_title": "Sr. Manager, IT Business Partner, Finance(Hybrid)",
    "category": "FINANCE",
    "job_description": "WHY JOIN STRYKER?\n\nWE ARE PROUD TO BE NAMED ONE OF THE WORLD’S BEST WORKPLACES AND A BEST WORKPLACE FOR DIVERSITY BY FORTUNE MAGAZINE! LEARN MORE ABOUT OUR AWARD-WINNING ORGANIZATION BY VISITING STRYKER.COM\n\nAS THE SR. MANAGER, IT BUSINESS PARTNER, FINANCE YOU WILL LEAD THE DEVELOPMENT AND MANAGEMENT OF BUSINESS PARTNERSHIPS WITH THE FINANCIAL PLANNING & ANALYSIS AS WELL AS THE INDIRECT PROCUREMENT TEAMS AND THEIR LEADERSHIP. YOU WILL FORMULATE IT STRATEGY AND ARCHITECTURE IN ALIGNMENT WITH BUSINESS STRATEGY AND OBJECTIVES.\n\n**THIS IS A HYBRID ROLE REQUIRING 2-3 DAYS PER WEEK IN OFFICE. **\n\nWHO WE WANT\n\nEFFECTIVE COMMUNICATORS. PEOPLE WHO COLLECT AND INTERPRET INFORMATION ACCURATELY AND CAN CONCISELY COMMUNICATE RESULTS AND RECOMMENDATIONS TO STAKEHOLDERS, SENIOR MANAGEMENT, AND THEIR TEAMS.\n\nNETWORK BUILDERS. MANAGERS WHO BUILD CONNECTIONS WITH OTHER TEAMS AND DIVISIONS AND COORDINATE CROSS-FUNCTIONAL COLLABORATION.\n\nINSIGHTFUL ADVISORS. MANAGERS WHO LEAD STRATEGY DEVELOPMENT AND PROVIDE GUIDANCE AND CONSULTATION TO INTERNAL AND EXTERNAL TEAMS.\n\nWHAT YOU WILL DO\n\nBUILD STRONG COLLABORATIVE RELATIONSHIPS WITH BUSINESS LEADERSHIP AND TEAMS IN CORPORATE FINANCIAL PLANNING & ANALYSIS AND INDIRECT PROCUREMENT ORGANIZATIONS.MANAGE THE IT BUDGET AND GUIDE THE BUSINESS IN EFFECTIVELY INVESTING IN INFORMATION TECHNOLOGY TO MEET STRATEGIC OBJECTIVES, LEADING AND GUIDING THE BUSINESS ON ALIGNING IT STRATEGY WITH BUSINESS STRATEGY.PROVIDE KNOWLEDGE AND EXPERTISE TO DEPARTMENT HEADS AND PROCESS OWNERS IN IDENTIFYING OPPORTUNITIES FOR TECHNOLOGY AND PRIORITIZING INITIATIVES.MANAGE ALIGNMENT OF PROJECT DELIVERABLES WITH BUSINESS REQUIREMENTS THROUGHOUT THE PROJECT AND DELIVERY LIFE CYCLE.LEAD A TEAM OF IT PROFESSIONALS, BOTH DIRECT AND MATRIX, TO ENSURE IT STANDARDS ARE MAINTAINED, WORKING WITH IT TEAMS TO ENSURE IT SERVICES PROVIDED ARE CONSISTENT WITH BUSINESS EXPECTATIONS.WORK CLOSELY WITH BUSINESS ANALYSTS, PROJECT MANAGERS, MANUFACTURING ARCHITECTS AND/OR OTHER IT RESOURCES IN PROVIDING IT SERVICES AND INITIATIVES TO THE BUSINESS.PARTNER WITH IS TEAMS TO ENSURE COMPLIANCE WITH REGULATIONS, POLICIES, STANDARDS, PROCEDURES, AND ASSOCIATED DOCUMENTATION INCLUDING BUT NOT LIMITED TO COMPUTER SYSTEMS VALIDATION, GLOBAL CHANGE CONTROL, SOX, AND PMO STANDARDS.COMMUNICATE ON PROJECTS BY ENSURING REGULAR STATUS UPDATES AND MANAGING COMMUNICATION WITHIN TEAM, IT ORGANIZATION AND BUSINESS LEADERSHIP AND STAKEHOLDERS.\n\nWHAT YOU NEED\n\nBACHELOR’S DEGREE REQUIRED.BACHELOR’S IN BUSINESS ADMINISTRATION OR COMPUTER INFORMATION SYSTEMS PREFERRED.10+ YEARS OF PROFESSIONAL WORK EXPERIENCE IN IT/IS AND/OR BUSINESS DISCIPLINE, INCLUDING PEOPLE LEADERSHIP EXPERIENCE.PROJECT MANAGEMENT EXPERIENCE, WORKING WITH INTERNAL AND EXTERNAL CROSS-DIVISIONAL TEAM MEMBERS, PREFERABLY WITH IS PROJECTS REQUIRED.5+ YEARS OF MEDICAL DEVICE AND/OR PHARMACEUTICAL INDUSTRY AND BASIC KNOWLEDGE OF ADJACENT AREAS IN TERMS OF PROCESSES, ORGANIZATION, PRODUCTS AND IS REQUIREMENTS PREFERRED.KNOWLEDGE OF, OR EXPERIENCE IN CORPORATE FINANCE FUNCTIONS PREFERRED.\n\nABOUT STRYKER\n\nOUR BENEFITS:\n\n12 PAID HOLIDAYS ANNUALLY HEALTH BENEFITS INCLUDE: MEDICAL AND PRESCRIPTION DRUG INSURANCE, DENTAL INSURANCE, VISION INSURANCE, CRITICAL ILLNESS INSURANCE, ACCIDENT INSURANCE, HOSPITAL INDEMNITY INSURANCE, PERSONALIZED HEALTHCARE SUPPORT, WELLBEING PROGRAM AND TOBACCO CESSATION PROGRAM.FINANCIAL BENEFITS INCLUDE HEALTH SAVINGS ACCOUNT (HSA), FLEXIBLE SPENDING ACCOUNTS (FSAS), 401(K) PLAN, EMPLOYEE STOCK PURCHASE PLAN (ESPP), BASIC LIFE AND AD&D INSURANCE, AND SHORT-TERM DISABILITY INSURANCE. \n\nFOR A MORE DETAILED OVERVIEW OF OUR BENEFITS OR TIME OFF, PLEASE FOLLOW THIS LINK TO LEARN MORE: US STRYKER EMPLOYEE BENEFITS\n\nABOUT STRYKER\n\nSTRYKER IS A GLOBAL LEADER IN MEDICAL TECHNOLOGIES AND, TOGETHER WITH ITS CUSTOMERS, IS DRIVEN TO MAKE HEALTHCARE BETTER. THE COMPANY OFFERS INNOVATIVE PRODUCTS AND SERVICES IN MEDSURG, NEUROTECHNOLOGY, ORTHOPAEDICS AND SPINE THAT HELP IMPROVE PATIENT AND HEALTHCARE OUTCOMES. ALONGSIDE ITS CUSTOMERS AROUND THE WORLD, STRYKER IMPACTS MORE THAN 130 MILLION PATIENTS ANNUALLY. MORE INFORMATION IS AVAILABLE AT STRYKER.COM.\n\nKNOW SOMEONE AT STRYKER?\n\nBE SURE TO HAVE THEM SUBMIT YOU AS A REFERRAL PRIOR TO APPLYING FOR THIS POSITION. LEARN MORE ABOUT OUR EMPLOYEE REFERRAL PROGRAM ON OUR REFERRAL PAGE\n\nSTRYKER IS DRIVEN TO WORK TOGETHER WITH OUR CUSTOMERS TO MAKE HEALTHCARE BETTER. EMPLOYEES AND NEW HIRES IN SALES AND FIELD ROLES THAT REQUIRE ACCESS TO CUSTOMER ACCOUNTS AS A FUNCTION OF THE JOB MAY BE REQUIRED, DEPENDING ON CUSTOMER REQUIREMENTS, TO OBTAIN VARIOUS VACCINATIONS AS AN ESSENTIAL FUNCTION OF THEIR ROLE.",
    "job_skill_set": [
      "project management",
      "financial analysis",
      "budget management",
      "compliance knowledge",
      "information technology",
      "business analysis",
      "communication",
      "leadership",
      "relationship building",
      "strategic thinking",
      "problem solving",
      "advisory skills",
      "teamwork",
      "IT strategy",
      "cross-functional collaboration",
      "medical device industry knowledge"
    ],
    "short_keywords": [
      "advisory",
      "analysis",
      "budget",
      "building",
      "business",
      "collaboration",
      "communication",
      "compliance",
      "crossfunctional",
      "device",
      "finance",
      "financehybrid",
      "financial",
      "industry",
      "information",
      "it",
      "knowledge",
      "leadership",
      "management",
      "manager",
      "medical",
      "partner",
      "problem",
      "project",
      "relationship",
      "skills",
      "solving",
      "sr",
      "strategic",
      "strategy",
      "teamwork",
      "technology",
      "thinking"
    ]
  },
  {
    "job_id": "3903846072",
    "job_title": "Vice President, Finance Change Management",
    "category": "FINANCE",
    "job_description": "SMBC GROUP IS A TOP-TIER GLOBAL FINANCIAL GROUP. HEADQUARTERED IN TOKYO AND WITH A 400-YEAR HISTORY, SMBC GROUP OFFERS A DIVERSE RANGE OF FINANCIAL SERVICES, INCLUDING BANKING, LEASING, SECURITIES, CREDIT CARDS, AND CONSUMER FINANCE. THE GROUP HAS MORE THAN 130 OFFICES AND 80,000 EMPLOYEES WORLDWIDE IN NEARLY 40 COUNTRIES. SUMITOMO MITSUI FINANCIAL GROUP, INC. (SMFG) IS THE HOLDING COMPANY OF SMBC GROUP, WHICH IS ONE OF THE THREE LARGEST BANKING GROUPS IN JAPAN. SMFG’S SHARES TRADE ON THE TOKYO, NAGOYA, AND NEW YORK (NYSE: SMFG) STOCK EXCHANGES.\n\nIN THE AMERICAS, SMBC GROUP HAS A PRESENCE IN THE US, CANADA, MEXICO, BRAZIL, CHILE, COLOMBIA, AND PERU. BACKED BY THE CAPITAL STRENGTH OF SMBC GROUP AND THE VALUE OF ITS RELATIONSHIPS IN ASIA, THE GROUP OFFERS A RANGE OF COMMERCIAL AND INVESTMENT BANKING SERVICES TO ITS CORPORATE, INSTITUTIONAL, AND MUNICIPAL CLIENTS. IT CONNECTS A DIVERSE CLIENT BASE TO LOCAL MARKETS AND THE ORGANIZATION’S EXTENSIVE GLOBAL NETWORK. THE GROUP’S OPERATING COMPANIES IN THE AMERICAS INCLUDE SUMITOMO MITSUI BANKING CORP. (SMBC), SMBC NIKKO SECURITIES AMERICA, INC., SMBC CAPITAL MARKETS, INC., SMBC RAIL SERVICES LLC, MANUFACTURERS BANK, JRI AMERICA, INC., SMBC LEASING AND FINANCE, INC., BANCO SUMITOMO MITSUI BRASILEIRO S.A., AND SUMITOMO MITSUI FINANCE AND LEASING CO., LTD.\n\nTHE ANTICIPATED SALARY RANGE FOR THIS ROLE IS BETWEEN $123,000.00 AND $175,000.00. THE SPECIFIC SALARY OFFERED TO AN APPLICANT WILL BE BASED ON THEIR INDIVIDUAL QUALIFICATIONS, EXPERIENCES, AND AN ANALYSIS OF THE CURRENT COMPENSATION PAID IN THEIR GEOGRAPHY AND THE MARKET FOR SIMILAR ROLES AT THE TIME OF HIRE. THE ROLE MAY ALSO BE ELIGIBLE FOR AN ANNUAL DISCRETIONARY INCENTIVE AWARD. IN ADDITION TO CASH COMPENSATION, SMBC OFFERS A COMPETITIVE PORTFOLIO OF BENEFITS TO ITS EMPLOYEES.\n\nROLE DESCRIPTION\n\nOVERVIEW\n\nTO SUPPORT SMBC AMERICAS' BUSINESS GROWTH STRATEGY, SMBC FINANCE IS EXECUTING A MAJOR INITIATIVE TO REVIEW AND ENHANCE CRITICAL FINANCE PROCESSES WITHIN ITS US OPERATIONS, INCLUDING FINANCIAL PLANNING, REPORTING, AND DATA MANAGEMENT. WORKING WITH CORE FINANCE TEAMS AND OTHER KEY COLLEAGUES (TECHNOLOGY, RISK, COMPLIANCE, ETC.), FINANCE CHANGE IS PRIMARILY RESPONSIBLE FOR ESTABLISHING AND MANAGING LARGE-SCALE PROGRAMS FOCUSED ON IMPLEMENTATION OF PROCESSES, METHODOLOGIES, AND SYSTEMS THAT MEET REGULATORY REQUIREMENTS AND INDUSTRY BEST PRACTICES. THE VICE PRESIDENT WILL BE RESPONSIBLE FOR DRIVING DEFINED PROJECTS/WORKSTREAMS AS THE PRIMARY RESPONSIBLE CONTACT AND WORKING CLOSELY WITH STAKEHOLDERS ACROSS SMBC AMERICAS.\n\nROLE OBJECTIVES: DELIVERY\n\nRESPONSIBILITIES\n\n EXECUTE PROJECT MANAGEMENT RESPONSIBILITIES AS THE PRIMARY CONTACT FOR KEY FINANCE INITIATIVES, PROVIDING EXECUTION SUPPORT, PROCESS MONITORING, AND STAKEHOLDER COMMUNICATION WHILE DRIVING RIGOR THROUGHOUT THE PROCESS. PROVIDE OVERSIGHT AND TRACK PROGRESS OF MANAGED PROJECTS USING DEFINED PROJECT MANAGEMENT ARTIFACTS, SUCH AS PROJECT PLANS, PROJECT CHARTERS, BUSINESS CASES, AND STATUS REPORTS. FOCUS ON IMPROVING GOVERNANCE, EFFICIENCY AND CONTROL THROUGH PROCESS OPTIMIZATION, AND PROACTIVELY IDENTIFYING AND REMEDIATING AREAS OF REGULATORY DEFICIENCIES. DESIGN SOLUTIONS TO ADDRESS PROJECT ISSUES AND IDENTIFY AREAS FOR OPTIMIZATION ACROSS THE SUPPORTED TEAMS. IDENTIFY OPPORTUNITIES FOR AUTOMATION, INCREASED TRANSPARENCY, AND ENHANCEMENT OF BUSINESS PROCESSES. PREPARE EXECUTIVE-READY PRESENTATIONS AND UPDATES, INCLUDING CONCISE AND CLEAR VISUAL ARTIFACTS TO SUPPORT MANAGEMENT UNDERSTANDING. LEAD AND MANAGE WORKING GROUPS RESPONSIBLE FOR EXECUTING ON TARGETED REMEDIATION AND ENHANCEMENT ACTIVITIES WITHIN FINANCE.\n\nQUALIFICATIONS\n\nQUALIFICATIONS AND SKILLS\n\n MINIMUM OF 5-7 YEARS EXPERIENCE IN CHANGE/PROJECT MANAGEMENT, FINANCIAL SERVICES OR RELATED EXPERIENCE STRONG CAPABILITY TO MANAGE COMPLEX PROJECTS INDEPENDENTLY, COORDINATING ACROSS MULTIPLE STAKEHOLDER GROUPS. SIGNIFICANT KNOWLEDGE OF CHANGE/PROGRAM MANAGEMENT, FINANCIAL OPERATIONS AND PLANNING, RISK AND CONTROLS MANAGEMENT, IT PROCESSES, AND DATA MANAGEMENT. EXCELLENT INTERPERSONAL SKILLS; ABILITY TO SUCCESSFULLY INFLUENCE AND BUILD EFFECTIVE PARTNERSHIPS WITH ALL LEVELS OF TEAM MEMBERS AND COLLEAGUES ABILITY TO WORK INDEPENDENTLY IN AMBIGUOUS ENVIRONMENTS THAT ARE NOT CLEARLY DEFINED. ABILITY TO BE FLEXIBLE AND FOLLOW TIGHT DEADLINES. PROACTIVE SELF-STARTER WITH ABILITY TO PRIORITIZE EFFORTS ACROSS MULTIPLE PROJECTS AND MANAGE COMPETING DEADLINES. EXCELLENT VERBAL AND WRITTEN COMMUNICATION AND PRESENTATION SKILLS COMMENSURATE WITH PRODUCTION AND PRESENTATION OF MANAGEMENT-READY MATERIALS. PROFICIENCY IN WORD, POWERPOINT, AND EXCEL APPLICATIONS.\n\nADDITIONAL REQUIREMENTS\n\nD&I COMMITMENT\n\nRESPONSIBLE FOR FOSTERING A CULTURE OF DIVERSITY AND INCLUSION, HOLDING LEADERS ACCOUNTABLE FOR CREATING AN INCLUSIVE ENVIRONMENT THROUGH AWARENESS AND PRACTICE OF EQUITY IN RECRUITING, DEVELOPING, AND PROMOTING DIVERSE TALENT.\n\nSMBC’S EMPLOYEES PARTICIPATE IN A HYBRID WORKFORCE MODEL THAT PROVIDES EMPLOYEES WITH AN OPPORTUNITY TO WORK FROM HOME, AS WELL AS, FROM AN SMBC OFFICE. SMBC REQUIRES THAT EMPLOYEES LIVE WITHIN A REASONABLE COMMUTING DISTANCE OF THEIR OFFICE LOCATION. PROSPECTIVE CANDIDATES WILL LEARN MORE ABOUT THEIR SPECIFIC HYBRID WORK SCHEDULE DURING THEIR INTERVIEW PROCESS.\n\nWE ARE AN EQUAL EMPLOYMENT OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, GENDER, NATIONAL ORIGIN, DISABILITY STATUS, PROTECTED VETERAN STATUS OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW. SMBC PROVIDES REASONABLE ACCOMMODATIONS FOR EMPLOYEES AND APPLICANTS WITH DISABILITIES CONSISTENT WITH APPLICABLE LAW. IF YOU NEED A REASONABLE ACCOMMODATION DURING THE APPLICATION PROCESS, PLEASE LET US KNOW AT ACCOMMODATIONS@SMBCGROUP.COM.",
    "job_skill_set": [
      "project management",
      "financial planning",
      "data management",
      "risk management",
      "process optimization",
      "automation",
      "Microsoft Excel",
      "Microsoft Word",
      "change management",
      "financial operations",
      "communication",
      "interpersonal skills",
      "influencing",
      "flexibility",
      "self-starter",
      "prioritization",
      "teamwork",
      "presentation skills",
      "problem solving",
      "Microsoft PowerPoint"
    ],
    "short_keywords": [
      "automation",
      "change",
      "communication",
      "data",
      "excel",
      "finance",
      "financial",
      "flexibility",
      "influencing",
      "interpersonal",
      "management",
      "microsoft",
      "operations",
      "optimization",
      "planning",
      "powerpoint",
      "presentation",
      "president",
      "prioritization",
      "problem",
      "process",
      "project",
      "risk",
      "selfstarter",
      "skills",
      "solving",
      "teamwork",
      "vice",
      "word"
    ]
  },
  {
    "job_id": "3902760602",
    "job_title": "Finance Assistant",
    "category": "FINANCE",
    "job_description": "DESCRIPTION\n\nCESA 6 IS LOOKING FOR A DETAIL ORIENTED, SELF MOTIVATED FINANCE ASSISTANT. THIS IS A LIMITED TERM, AS NEEDED, NON-BENEFITED POSITION.\n\nTHE FINANCE ASSISTANT REPORTS TO THE ACCOUNTING MANAGER AND IS PRIMARILY RESPONSIBLE FOR PROVIDING FINANCIAL INFORMATION BY APPLYING RECEIPTS TO OPEN INVOICES AND ENSURING INVOICES ARE SENT OUT TIMELY, VERIFYING AND RECONCILING THE AGED RECEIVABLES ACCORDING TO ESTABLISHED POLICIES AND PROCEDURES IN AN EFFICIENT, TIMELY AND ACCURATE MANNER.\n\nESSENTIAL FUNCTIONS\n\nFILE, MAINTAIN, AND DISTRIBUTE ACCOUNTS RECEIVABLE ACCOUNTING DOCUMENTS, RECORDS AND REPORTS. MAINTAIN FILES AND DOCUMENTATION THOROUGHLY AND ACCURATELY, IN ACCORDANCE WITH COMPANY POLICY AND ACCEPTED ACCOUNTING PRACTICES. UPDATE CASH LOG WITH ALL DEPOSITS MATCHING TO THE CHECKING ACCOUNT. APPLY RECEIPTS IN OUR ERP SYSTEM TO CORRECT CUSTOMERS ON A DAILY BASIS. CREATE AND SEND OUT INVOICES TO OUR CUSTOMERS ON A WEEKLY AND AS NEEDED BASISSUPPLY CUSTOMERS WITH INVOICE STATEMENTS ON A MONTHLY BASISASSIST WITH INVOICING OUT GRANTSMONITOR AND RESPOND TO ACCOUNTS RECEIVABLE EMAILOWN & RECONCILE ACCOUNTS RECEIVABLE RELATED GENERAL LEDGER ACCOUNTSPERFORM OTHER DUTIES AS ASSIGNED. \n\nOTHER FUNCTIONS\n\nASSIST WITH OTHER PROJECTS AS NEEDED \n\nREQUIREMENTS\n\nEXPERIENCE, EDUCATION AND LICENSURE:\n\n1+ YEARS OF ACCOUNTS RECEIVABLE EXPERIENCE. ADVANCED COURSES IN ACCOUNTING REQUIRED, ASSOCIATE’S DEGREE PREFERRED. THOROUGH KNOWLEDGE OF APPLICABLE ACCOUNTS RECEIVABLE/GENERAL LEDGER SYSTEMS AND PROCEDURES, FINANCIAL CHART OF ACCOUNTS AND CORPORATE PROCEDURES. \n\nREQUIRED SKILLS AND ABILITIES\n\nMODEL CORE VALUES OF THE AGENCY. EXHIBIT A HIGH DEGREE OF CONFIDENTIALITY OF SENSITIVE INFORMATION AND PROCESS AND HANDLE CONFIDENTIAL INFORMATION WITH DISCRETION. COMMUNICATE EFFECTIVELY AND TIMELY, VERBALLY AND IN WRITING, TO A DIVERSE AUDIENCE. EXCELLENT TIME-MANAGEMENT WITH ABILITY TO MANAGE SCHEDULES AND MEET DEADLINES. PROCESS-ORIENTED. ABILITY TO INTERPRET AND ADMINISTER POLICIES AND PROCEDURES CONSISTENTLY AND OBJECTIVELY. PLAN, ORGANIZE AND PRIORITIZE WORK. REMAIN FLEXIBLE IN ORDER TO ADAPT TO CHANGES IN THE WORK ENVIRONMENT. PROBLEM-PREVENTION AND PROBLEM-SOLVING SKILLS. ABILITY TO MANAGE MULTIPLE PROJECTS AT A TIME WHILE PAYING STRICT ATTENTION TO DETAIL AND ACCURACY. WORK EFFECTIVELY, PROFESSIONALLY AND TACTFULLY WITH INTERNAL AGENCY STAFF AND EXTERNAL CLIENTS. ABILITY TO SET AND MEET HIGH STANDARDS OF CUSTOMER SERVICE (INTERNAL AND EXTERNAL). EXCELLENT INTERPERSONAL SKILLS TO FACILITATE INTERACTION WITH THE WORKFORCE. ABILITY TO WORK INDEPENDENTLY AS WELL AS COLLABORATE WITH DIVERSE WORK TEAMS.. EXHIBIT A PROFESSIONAL, BUSINESSLIKE APPEARANCE AND DEMEANOR. ADVANCED COMPUTER SKILLS, INCLUDING E-MAIL, WORD PROCESSING AND SPREADSHEETS. PROFESSIONALLY REPRESENT THE AGENCY AND PUBLIC, PRIVATE AND PAROCHIAL SCHOOL DISTRICTS IN INTERACTIONS WITH STAFF, CUSTOMERS, VENDORS, AND COMMUNITY. FACILITATE AN OVERALL WORK ENVIRONMENT OF MUTUAL RESPECT AND COLLABORATION. POSSESS BASIC ACCOUNTING PRINCIPLES KNOWLEDGE, DOCUMENTATION SKILLS, RESEARCH AND RESOLUTION SKILLS, DATA ANALYSIS AND MULTI-TASKING SKILLS. ABILITY TO BE A SELF-STARTER AND TAKE INITIATIVE. KNOWLEDGE OF AND ABILITY TO FOLLOW STANDARD FILING PROCEDURES. ABILITY TO PERFORM MATHEMATICAL COMPUTATIONS SUCH AS PERCENTAGES, FRACTIONS, ADDITION, SUBTRACTION, MULTIPLICATION AND DIVISION QUICKLY AND ACCURATELY. \n\nWORK ENVIRONMENT\n\nWORK ENVIRONMENT / PHYSICAL DEMANDS:\n\nABILITY TO WORK IN A PROFESSIONAL AND FLEXIBLE OFFICE ENVIRONMENT, WITH OR WITHOUT VISUAL AND AUDIBLE DISTRACTIONS. \n\nPHYSICAL DEMANDS\n\nWHILE PERFORMING THE DUTIES OF THIS POSITION, THE EMPLOYEE IS OCCASIONALLY REQUIRED TO STAND, WALK, SIT, USE HANDS TO FINGER, HANDLE OR FEEL, AND REACH WITH HANDS AND ARMS. LONG HOURS FOR EXTENDED PERIODS OF TIME DURING HIGH-DEMAND PERIODS. THE EMPLOYEE MUST BE ABLE TO COMMUNICATE EFFECTIVELY. THE EMPLOYEE MAY OCCASIONALLY LIFT OR MOVE OFFICE PRODUCTS AND SUPPLIES, UP TO 20 POUNDS. \n\nVIEW CESA 6 VALUES HERE\n\nCONTACT\n\nTODD KELLY\n\nTKELLY@CESA6.ORG\n\n920-236-0871\n\nIN COMPLIANCE WITH THE AMERICANS WITH DISABILITIES ACT, CESA 6 WILL PROVIDE REASONABLE ACCOMMODATIONS TO QUALIFIED INDIVIDUALS WITH DISABILITIES AND ENCOURAGES BOTH PROSPECTIVE EMPLOYEES AND CURRENT EMPLOYEES TO DISCUSS POTENTIAL ACCOMMODATIONS WITH THE EMPLOYER.\n\nCESA 6 IS AN EQUAL OPPORTUNITY EMPLOYER AND IS COMMITTED TO PROVIDING A WORKPLACE FREE FROM DISCRIMINATION AND HARASSMENT. WE EXPECT EVERY MEMBER OF OUR TEAM DO THEIR PART TO MAINTAIN AN ENVIRONMENT WHERE EVERYONE HAS THE OPPORTUNITY TO FEEL INCLUDED, FEELS RESPECTED AND RECEIVES THE DIGNITY THEY DESERVE.\n\nDECISIONS RELATED TO HIRING, COMPENSATING, TRAINING, AND EVALUATING PERFORMANCE ARE MADE FAIRLY, AND WE PROVIDE EQUAL EMPLOYMENT OPPORTUNITIES TO ALL QUALIFIED CANDIDATES AND EMPLOYEES. WE TAKE RESPONSIBILITY FOR ALWAYS STRIVING TO CREATE AN INCLUSIVE ENVIRONMENT AS A GALLUP BEST PLACES TO WORK EMPLOYER THAT MAKES EVERY EMPLOYEE AND CANDIDATE FEEL WELCOME.\n\nSALARY DESCRIPTION\n\n$15 - $17 PER HOUR",
    "job_skill_set": [
      "general ledger",
      "financial reporting",
      "advanced computer skills",
      "mathematical computations",
      "documentation skills",
      "data analysis",
      "time management",
      "accounting principles",
      "communication",
      "problem solving",
      "attention to detail",
      "teamwork",
      "self-motivation",
      "organizational skills",
      "professionalism",
      "accounts receivable",
      "ERP systems",
      "flexibility",
      "customer service",
      "confidentiality"
    ],
    "short_keywords": [
      "accounting",
      "accounts",
      "advanced",
      "analysis",
      "assistant",
      "attention",
      "communication",
      "computations",
      "computer",
      "confidentiality",
      "customer",
      "data",
      "detail",
      "documentation",
      "erp",
      "finance",
      "financial",
      "flexibility",
      "general",
      "ledger",
      "management",
      "mathematical",
      "organizational",
      "principles",
      "problem",
      "professionalism",
      "receivable",
      "reporting",
      "selfmotivation",
      "service",
      "skills",
      "solving",
      "systems",
      "teamwork",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3905330622",
    "job_title": "Finance & Accounting Leader",
    "category": "FINANCE",
    "job_description": "DUTIES:\n\nMANAGES PROJECT ACCOUNTANTS AND BUSINESS ANALYSTS OVERSEEING ACCOUNTING, INVOICING AND ENCUMBRANCE PROCESSES AND POLICIESINTERFACES WITH DISTRICT FINANCE MANAGEMENT AND COORDINATES BOND FUND MANAGEMENT AND TRANSPARENCYFAMILIARITY WITH PROLIANCE PMIS AND DELTEK COSTPOINT OR SIMILAR SOFTWARE AND INTEGRATION PROCESSES, FAMILIARITY WITH GENERAL PROJECT MANAGEMENT/CONSTRUCTION MANAGEMENT SOFTWAREOVERSEES INVOICING AND ENCUMBRANCE REVIEW PROCESSESOVERSEES RECONCILIATION OF ACCOUNTSANALYZE, REVIEW AND APPROVE ACCOUNTING AND EXPENDITURE REPORTSCOORDINATES INFORMATION WITH DIRECTOR OF PROJECT CONTROLSLEADS FINANCE AND ACCOUNTING TEAMS IN DEVELOPING APPROACHES TO MINIMIZE RISKWORKS WITH CONSTRUCTION/DESIGN/ARCHITECTURE AND ENGINEERING PROFESSIONALS AND TEAMSREVIEWS MONTHLY JOURNAL ENTRY REPORTSREVIEWS MONTHLY, QUARTERLY, SEMI-ANNUAL AND ANNUAL FINANCIAL STATEMENTSOVERSEES THE BOND PROGRAM CASHFLOW PROJECTIONSREVIEWS BANK RECONCILIATIONS AND STATEMENTSREVIEWS AND APPROVES REPORTS ON CAPITALIZATION OF FIXED ASSETS, INTEREST CAPITALIZATION, AND DEPRECIATION OF BOND ASSETSRECONCILES ESCROW ACCOUNTSASSISTS THE DISTRICT WITH STAFFING PROJECTIONS OF FULL TIME EMPLOYEESFAMILIARITY WITH STATE'S FUSION (FACILITIES UTILIZATION SPACE INVENTORY OPTIONS NETWORK)",
    "job_skill_set": [
      "Accounting",
      "Project Management",
      "Financial Analysis",
      "Reconciliation",
      "Cashflow Projections",
      "Financial Statements Review",
      "Leadership",
      "Communication",
      "Teamwork",
      "Analytical Thinking",
      "Coordination",
      "Problem Solving",
      "Invoicing",
      "Costpoint",
      "Proliance PMIS",
      "Capitalization of Fixed Assets",
      "Escrow Accounts Reconciliation",
      "Bond Fund Management",
      "Construction Management Software",
      "Risk Management"
    ],
    "short_keywords": [
      "accounting",
      "accounts",
      "analysis",
      "analytical",
      "assets",
      "bond",
      "capitalization",
      "cashflow",
      "communication",
      "construction",
      "coordination",
      "costpoint",
      "escrow",
      "finance",
      "financial",
      "fixed",
      "fund",
      "invoicing",
      "leader",
      "leadership",
      "management",
      "of",
      "pmis",
      "problem",
      "project",
      "projections",
      "proliance",
      "reconciliation",
      "review",
      "risk",
      "software",
      "solving",
      "statements",
      "teamwork",
      "thinking"
    ]
  },
  {
    "job_id": "3894293332",
    "job_title": "Financial Services Senior Associate/Counsel – Aviation Finance",
    "category": "FINANCE",
    "job_description": "MOORE & VAN ALLEN, PLLC, A LARGE SOUTHEASTERN LAW FIRM WITH A NATIONAL PRACTICE, IS SEEKING AN EXPERIENCED ATTORNEY TO JOIN ITS GROWING COMMERCIAL AVIATION AND AVIATION FINANCE PRACTICE. IDEAL CANDIDATES WILL HAVE 4-6+ YEARS OF EXPERIENCE REPRESENTING LENDERS AND/OR LESSORS OF COMMERCIAL AIRCRAFT IN LEASING, PURCHASE AND SALE AND FINANCING TRANSACTIONS. EXPERIENCE LEADING BOTH DOMESTIC AND CROSS-BORDER TRANSACTIONS IS PREFERRED. EXCELLENT ACADEMIC PERFORMANCE AND STRONG INTERPERSONAL SKILLS ARE REQUIRED. COMPETITIVE COMPENSATION PACKAGE INCLUDES FULL BENEFITS.\nAT MOORE & VAN ALLEN, REPRESENTATION EXTENDS BEYOND TRADITIONAL LEGAL SERVICES. FOUNDED IN 1945, AND RANKED IN THE AM LAW 200 FOR 22 CONSECUTIVE YEARS. WE REPRESENT IDEAS, VALUES AND ASPIRATIONS. WE REPRESENT CAREFULLY LAID PLANS AND BOLD LONG-TERM GOALS. BY IMMERSING OURSELVES IN A DEEP UNDERSTANDING OF WHAT IS IMPORTANT AND MEANINGFUL TO OUR CLIENTS WE BRING CLEAR PERSPECTIVE TO ANY LEGAL CHALLENGE AND FIND SOLUTIONS IN UNEXPECTED PLACES.\nAN UNWAVERING FOCUS ON OUR CLIENTS HAS LED TO STEADY GROWTH AS ONE OF THE LARGEST LAW FIRMS IN THE SOUTHEAST. MORE THAN 330 ATTORNEYS IN OVER 60 AREAS OF FOCUS REPRESENT CLIENTS ACROSS THE COUNTRY AND AROUND THE GLOBE. BLUE-CHIP FORTUNE 500 ORGANIZATIONS, FINANCIAL SERVICES LEADERS, DOMESTIC AND GLOBAL MANUFACTURERS, RETAILERS, INDIVIDUALS, AND HEALTHCARE AND TECHNOLOGY COMPANIES BENEFIT FROM OUR STRATEGIC, INNOVATIVE APPROACH TO SIGNIFICANT BUSINESS TRANSACTIONS, COMPLICATED LEGAL ISSUES AND DIFFICULT DISPUTES.",
    "job_skill_set": [
      "financing transactions",
      "legal representation",
      "academic performance",
      "interpersonal skills",
      "client focus",
      "problem solving",
      "communication",
      "strategic thinking",
      "adaptability",
      "aviation finance",
      "commercial aircraft leasing",
      "purchase and sale transactions",
      "domestic transactions",
      "cross-border transactions"
    ],
    "short_keywords": [
      "academic",
      "adaptability",
      "aircraft",
      "and",
      "associatecounsel",
      "aviation",
      "client",
      "commercial",
      "communication",
      "crossborder",
      "domestic",
      "finance",
      "financial",
      "financing",
      "focus",
      "interpersonal",
      "leasing",
      "legal",
      "performance",
      "problem",
      "purchase",
      "representation",
      "sale",
      "senior",
      "services",
      "skills",
      "solving",
      "strategic",
      "thinking",
      "transactions"
    ]
  },
  {
    "job_id": "3887908536",
    "job_title": "Finance Manager",
    "category": "FINANCE",
    "job_description": "POSITION SUMMARY\n\nTHE MANAGER OF FINANCE WITHIN LEADING MULTINATIONAL ORGANIZATIONS IS RESPONSIBLE FOR PLANNING, DIRECTING, AND OVERSEEING ALL FINANCIAL OPERATIONS. THIS INCLUDES CONTRACT ADMINISTRATION, ACCOUNTS PAYABLE OPERATIONS, BUDGET FORECASTING, AND MANAGEMENT IN ACCORDANCE WITH ORGANIZATIONAL POLICIES. THE ROLE INVOLVES MANAGING FINANCIAL SPECIALISTS BY TRAINING, ASSIGNING TASKS, AND EVALUATING PERFORMANCE AND PRODUCTIVITY. ADDITIONALLY, THE MANAGER CONTRIBUTES TO FINANCIAL STRATEGY AND MANAGEMENT THROUGH ANALYZING MONTHLY VARIANCE REPORTS, CREATING BUDGET FORECASTS, LEADING DATASET PREPARATION, STATISTICAL MODELING, AND GENERATING INSIGHTS.\n\nKEY RESPONSIBILITIES\n\nOVERSEE CONTRACTS ADMINISTRATION AND ACCOUNTS PAYABLE OPERATIONS.MANAGE BUDGET FORECASTING AND ENSURE COMPLIANCE WITH ORGANIZATIONAL POLICIES.TRAIN AND MANAGE FINANCIAL SPECIALISTS, EVALUATE THEIR PERFORMANCE AND PRODUCTIVITY.ANALYZE MONTHLY VARIANCE REPORTS AND CREATE BUDGET FORECASTS.LEAD DATASET PREPARATION, STATISTICAL MODELING, AND INSIGHTS GENERATION.TAKE INITIATIVE AND PROACTIVELY ANTICIPATE ISSUES WITH CONTRACTS AND ACCOUNTING.DISPLAY A SENSE OF OWNERSHIP AND REPRESENT THE DEPARTMENT WITH INTEGRITY AND DIPLOMACY.BE SELF-MOTIVATED, PROACTIVE, QUICK-THINKING, FLEXIBLE, AND ABLE TO PIVOT WHEN NECESSARY.JUGGLE MULTIPLE AND DIVERSE RESPONSIBILITIES WITH A STRONG EMPHASIS ON ORGANIZATION AND CUSTOMER SERVICE.MAINTAIN AN UNWAVERING ATTENTION TO DETAIL AT ALL TIMES.WORK COLLABORATIVELY WITH STAFF OF ALL LEVELS AND ACROSS DISCIPLINES THROUGHOUT THE ORGANIZATION.\n\nQUALIFICATIONS\n\nBACHELOR'S DEGREE5+ YEARS OF EXPERIENCE IN LEADING MULTINATIONAL ORGANIZATIONS WITHIN A MANUFACTURING, WHOLESALE/DISTRIBUTION AND/OR SERVICE ENVIRONMENT.AVAILABILITY TO WORK SOME EVENINGS AND WEEKENDS.MASTER'S DEGREE OR CPA OR BUSINESS-RELATED FIELD (PREFERRED)LEAN SIX SIGMA CERTIFICATION (OPTIONAL)",
    "job_skill_set": [
      "financial operations",
      "contract administration",
      "data analysis",
      "financial strategy",
      "variance analysis",
      "leadership",
      "communication",
      "problem solving",
      "organization",
      "customer service",
      "proactivity",
      "attention to detail",
      "collaboration",
      "integrity",
      "budget forecasting",
      "accounts payable",
      "statistical modeling",
      "Lean Six Sigma",
      "CPA",
      "flexibility"
    ],
    "short_keywords": [
      "accounts",
      "administration",
      "analysis",
      "attention",
      "budget",
      "collaboration",
      "communication",
      "contract",
      "cpa",
      "customer",
      "data",
      "detail",
      "finance",
      "financial",
      "flexibility",
      "forecasting",
      "integrity",
      "leadership",
      "lean",
      "manager",
      "modeling",
      "operations",
      "organization",
      "payable",
      "proactivity",
      "problem",
      "service",
      "sigma",
      "six",
      "solving",
      "statistical",
      "strategy",
      "to",
      "variance"
    ]
  },
  {
    "job_id": "3895811492",
    "job_title": "Sr Director, Finance",
    "category": "FINANCE",
    "job_description": "RESPONSIBLE FOR DIRECTING THE OVERALL FINANCIAL POLICIES FOR THE COMPANY. OVERSEES ALL FINANCIAL FUNCTIONS INCLUDING ACCOUNTING, BUDGETING, CREDIT AND COLLECTIONS AND FINANCIAL REPORTING AND BUSINESS PLANNING. DESIGNS AND COORDINATES A WIDE VARIETY OF ACCOUNTING AND STATISTICAL DATA AND REPORTS.\n\nPRIMARY ACTIVITIES\n\nDIRECTS THE MAINTENANCE OF ACCOUNTING AND GENERAL LEDGER POLICIES AND PRACTICES. MANAGES ALL ACCOUNTING, BUDGETING, FINANCIAL ANALYSIS, CREDIT, COLLECTION AND FINANCIAL RECORD KEEPING FUNCTIONS AT ALL ORGANIZATION FACILITIES.ASSURES THAT ACCOUNTING RECORDS ARE PREPARED, MAINTAINED AND REPORTED IN ACCORDANCE WITH GENERALLY ACCEPTED ACCOUNTING PRINCIPLES AND THAT ALL LEDGERS RECONCILE. .OVERSEES PREPARATION OF ACCURATE AND TIMELY BUDGETS AND FORECASTS.CONDUCTS FINANCIAL ANALYSIS AT THE HIGHEST LEVEL TO INTERPRET TRENDS, VARIANCES FROM BUDGETS, VARIANCES FROM STANDARDS, AND PROVIDES ADVICE AND COUNSEL TO PLANTS CONSISTENT WITH ESTABLISHED FINANCIAL POLICY.DIRECTS MAINTENANCE OF FIXED ASSET RECORDS AND REPORTS INCLUDING DEPRECIATION ACCOUNTS. ESTABLISHES METHODS TO ASSURE PROPER CAPITALIZATION AND EXPENSING BY CLASS.APPROVES SCHEDULES, PROCEDURES, SYSTEMS AND METHODS TO ENSURE TIMELY, INFORMATIVE AND ACCURATE REPORTING OF ALL FINANCIAL DATA. PROCESS SUCH DATA AND REPORTS AS REQUIRED. APPROVES SCHEDULES, PROCEDURES, SYSTEMS AND METHODS TO ENSURE TIMELY, INFORMATIVE AND ACCURATE REPORTING OF ALL FINANCIAL DATA. PROCESS SUCH DATA AND REPORTS AS REQUIRED.DIRECT THE DEVELOPMENT OF THE ANNUAL BUSINESS PLAN AND MEASURE ACTUAL TO PLAN.\n\nPROVEN TO PERFORM.\n\nFROM THE EDGES OF SPACE TO THE BOTTOMS OF OCEAN, OUR MATERIALS ARE PROVEN TO PERFORM -- AND SO IS OUR TEAM. WE'RE HIRING HIGH PERFORMERS AS PROVEN AS OUR PRODUCTS. JOIN US.",
    "job_skill_set": [
      "financial analysis",
      "accounting principles",
      "budgeting",
      "financial reporting",
      "financial forecasting",
      "ledger reconciliation",
      "business planning",
      "leadership",
      "communication",
      "strategic thinking",
      "problem solving",
      "advisory skills",
      "team collaboration",
      "data processing",
      "statistical analysis",
      "capitalization methods"
    ],
    "short_keywords": [
      "accounting",
      "advisory",
      "analysis",
      "budgeting",
      "business",
      "capitalization",
      "collaboration",
      "communication",
      "data",
      "director",
      "finance",
      "financial",
      "forecasting",
      "leadership",
      "ledger",
      "methods",
      "planning",
      "principles",
      "problem",
      "processing",
      "reconciliation",
      "reporting",
      "skills",
      "solving",
      "sr",
      "statistical",
      "strategic",
      "team",
      "thinking"
    ]
  },
  {
    "job_id": "3891038573",
    "job_title": "Finance Project Coordinator II,",
    "category": "FINANCE",
    "job_description": "TO HELP SAVE OUR CUSTOMERS GREEN, WE NEED AN AMAZING TEAM WHO KNOWS ALL ABOUT IT. OUR NATIONAL FINANCE & ADMINISTRATION SERVICES DEPARTMENT OVERSEES THE MANAGEMENT OF THE CRITICAL RESOURCES AND INFRASTRUCTURE THAT OUR PEOPLE NEED TO GET THE JOB DONE AT EVERY LEVEL. THIS SERVICE DEPARTMENT IS DESIGNED TO MAKE SURE OUR RETAIL DIVISIONS AND EXECUTIVE LEADERSHIP RECEIVE THE SUPPORT THEY NEED TO RUN A SUCCESSFUL OPERATION. WITHIN FINANCE OUR TEAMS INCLUDE: ACCOUNTING, FINANCIAL PLANNING & ANALYSIS, FINANCIAL REPORTING, TAX AND TREASURY.\n\nIN THIS ROLE THE FINANCE PROJECT COORDINATOR II ROLE WILL BE RESPONSIBLE FOR NATIONAL FINANCE & ADMINISTRATION PROJECTS AND DRIVING RELATED TASKS. THE OBJECTIVE OF THE ROLE IS TO PROVIDE, IMPLEMENT, AND DELIVER SUPPORT TO COMPANY-WIDE STRATEGIC INITIATIVES. THIS INDIVIDUAL WILL ENSURE PROJECTS REMAIN ON TRACK AND FOLLOWS UP WITH KEY STAKEHOLDERS AS NECESSARY, INCLUDING DELIVERING AND FACILITATING TIMELINES AND PROJECT CONTENT IN A CONFIDENT AND PROFESSIONAL WAY. PROACTIVELY PRESENTS DECISION MAKING INFORMATION TO LEADERSHIP FOR DISCUSSION. THE IDEAL CANDIDATE WILL HAVE EXPERIENCE IN PROJECT MANAGEMENT, STRONG VERBAL AND WRITTEN COMMUNICATION SKILLS AND WORKS INDEPENDENTLY.\n\nPOSITION TYPE: FULL-TIME\n\nWORK LOCATION: NAPERVILLE, IL\n\nTHIS ROLE IS ELIGIBLE TO PARTICIPATE IN ALDI’S HYBRID WORK PROGRAM, WHICH ALLOWS REMOTE WORK UP TO 3 DAYS PER WEEK (I.E., WORK REMOTELY UP TO 3 DAYS PER WEEK; WORK IN-OFFICE AT LEAST 2 DAYS PER WEEK).\n\nDUTIES AND RESPONSIBILITIES\n\nMUST BE ABLE TO PERFORM DUTIES WITH OR WITHOUT REASONABLE ACCOMMODATION.\n\n INFORMS LEADER OF STATUS AND RESULTS OF ASSIGNED TASKS AND PROACTIVELY IDENTIFIES PROJECT ISSUES AND RECOMMENDS CORRECTIVE ACTION AS APPROPRIATE. HOLDS REGULAR COLLABORATION SESSIONS WITH BUSINESS STAKEHOLDERS TO PROVIDE UPDATES AS WELL AS DOCUMENTS ANY FEEDBACK FROM THE BUSINESS. UNDERSTANDS FINANCIAL IMPACTS ON COMPANY PERFORMANCE AND EFFECTIVELY COMMUNICATES THESE TO LEADERSHIP. RECOMMENDS PROCESS IMPROVEMENTS FOR AREA OF RESPONSIBILITY. LEADS PROJECTS ACCORDING TO THE POSITION’S OBJECTIVES UPON THE DIRECT AND PERSONNEL LEADER’S REQUEST. DEVELOPS AND EXECUTES PLANS FOR SMALL TO MEDIUM-SCALE PROJECTS. ASSISTS LEADERS IN IMPLEMENTATION AND ROLLOUT OF LARGE-SCALE PROJECTS. COORDINATES THE INVOLVEMENT OF MULTIPLE BUSINESS STAKEHOLDERS. ANALYZES WORKING PROCEDURES WITH THE OBJECTIVE TO IDENTIFY BEST PRACTICES AND IMPROVE EFFICIENCIES. DETERMINES AND CREATES THE REQUIRED PROJECT DELIVERABLES. ENSURES PROJECTS REMAIN ON TRACK AND FOLLOWS-UP WITH KEY STAKEHOLDERS AS NECESSARY. DELIVERS AND FACILITATES TIMELINES AND PROJECT CONTENT IN A CONFIDENT AND PROFESSIONAL WAY. USES FINANCIAL BACKGROUND TO CREATE APPROPRIATE DOCUMENTATION AND EFFECTIVELY COMMUNICATE STATUS AND POTENTIAL ORGANIZATIONAL CHANGES THAT MAY RESULT OUT OF A PROJECT’S SCOPE. ASSISTS IN THE PLANNING, PROCESSING, AND MONITORING OF FINANCIAL DOCUMENTS, ENSURING ACCURACY AND COMPLIANCE. COLLABORATES WITH TEAM MEMBERS AND COMMUNICATES RELEVANT INFORMATION TO LEADERSHIP. COMPLIES WITH ALDI PRIVACY AND SECURITY REQUIREMENTS AND POLICIES IF JOB RESPONSIBILITIES INCLUDE POSSIBLE ACCESS TO CONFIDENTIAL AND/OR SENSITIVE INFORMATION. OTHER DUTIES AS ASSIGNED.\n\nKNOWLEDGE/SKILLS/ABILITIES\n\nJOB-SPECIFIC COMPETENCIES: \n\n CONSISTENTLY DEMONSTRATES THE MINDSETS, ALDI ACTS COMPETENCIES AND PROFESSIONAL SKILLS (M.A.P.) AS OUTLINED FOR THE ROLE. GIVES ATTENTION TO DETAIL AND FOLLOWS INSTRUCTION. EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS. EFFECTIVE TIME MANAGEMENT; MAXIMIZES PRODUCTIVITY. PREPARES WRITTEN MATERIALS TO MEET PURPOSE AND AUDIENCE. DEVELOPS AND MAINTAINS POSITIVE RELATIONSHIPS WITH INTERNAL AND EXTERNAL PARTIES. PROFICIENT IN MICROSOFT OFFICE SUITE. ABILITY TO LEAD THROUGH INFLUENCE AND BUILD RELATIONSHIPS QUICKLY. FLEXIBILITY IN ADAPTING TO CHANGING PRIORITIES, ASSIGNMENTS, AND OTHER INTERRUPTIONS, WHICH MAY AFFECT PRE-ESTABLISHED TIMELINES. ABILITY TO RECOMMEND, INTERPRET AND APPLY COMPANY POLICIES AND PROCEDURES. KNOWLEDGE OF BUSINESS SYSTEM ENVIRONMENTS AND PROCESSING REQUIREMENTS. UNDERSTANDS THE STRATEGY, ORGANIZATIONAL AUTHORITY, INTERDEPENDENCE OF JOB DUTIES, PRODUCTS, SYSTEMS, AND SERVICES OF THE COMPANY. PROJECT MANAGEMENT SKILLS, INCLUDING THE ACHIEVEMENT OF DESIRED RESULTS WITHIN SCOPE, TIMELINE AND BUDGET. NEGOTIATION SKILLS.\n\nEDUCATION AND EXPERIENCE\n\n BACHELOR'S DEGREE IN BUSINESS/MANAGEMENT OR A RELATED FIELD REQUIRED. A MINIMUM OF 3 YEARS OF PROGRESSIVE EXPERIENCE IN BUSINESS/MANAGEMENT OR A RELATED FIELD REQUIRED. OR, A COMBINATION OF EDUCATION AND EXPERIENCE PROVIDING EQUIVALENT KNOWLEDGE.\n\nPHYSICAL REQUIREMENTS\n\n WORK MAY BE PERFORMED IN AN OFFICE, REMOTE OFFICE OR A COMBINATION OF BOTH WHERE A COMPUTER AND OFFICE EQUIPMENT MAY BE USED AS NEEDED TO PERFORM DUTIES. REGULARLY REQUIRED TO SIT, REACH, GRASP, STAND AND MOVE FROM ONE AREA TO ANOTHER. CONSTANTLY AND REPEATEDLY USE KEYBOARD/MOUSE. OCCASIONALLY REQUIRED TO PUSH, PULL, BEND, LIFT AND MOVE UP TO 25 LBS.\n\nTRAVEL\n\n MINIMAL TRAVEL REQUIRED AS NEEDED FOR JOB RELATED DUTIES SUCH AS TRAINING, PROJECT WORK AND ADMINISTRATIVE TASKS.\n\nALDI OFFERS COMPETITIVE WAGES AND BENEFITS, INCLUDING\n\n401(K) PLANCOMPANY 401(K) MATCHING CONTRIBUTIONSEMPLOYEE ASSISTANCE PROGRAM (EAP)PERKSPOT NATIONAL DISCOUNT PROGRAM\n\nIN ADDITION, ELIGIBLE EMPLOYEES ARE OFFERED\n\nMEDICAL, PRESCRIPTION, DENTAL & VISION INSURANCEGENEROUS VACATION TIME & 7 PAID HOLIDAYSUP TO 6 WEEKS PAID PARENTAL LEAVE AT 100% OF PAYUP TO 2 WEEKS PAID CAREGIVER LEAVE AT 100% OF PAYSHORT AND LONG-TERM DISABILITY INSURANCELIFE, DEPENDENT LIFE AND AD&D INSURANCEVOLUNTARY TERM LIFE INSURANCE\n\nCLICK HERE TO LEARN MORE ABOUT THE BENEFITS ALDI HAS TO OFFER\n\nALDI IS COMMITTED TO EQUAL OPPORTUNITY FOR ALL EMPLOYEES AND APPLICANTS. AS A PROUD EQUAL OPPORTUNITY EMPLOYER (EOE), WE DO NOT DISCRIMINATE BASED ON RACE, COLOR, NATIONAL ORIGIN, ANCESTRY, CITIZENSHIP STATUS, RELIGION, SEX, SEXUAL STEREOTYPING, SEXUAL ORIENTATION, GENDER, GENDER IDENTITY, GENDER EXPRESSION, AGE, MARITAL STATUS, MENTAL OR PHYSICAL DISABILITY, MEDICAL CONDITION, GENETIC INFORMATION, MILITARY OR VETERAN STATUS, PREGNANCY (WHICH INCLUDES PREGNANCY, CHILDBIRTH, AND MEDICAL CONDITIONS RELATED TO PREGNANCY, CHILDBIRTH, OR BREASTFEEDING), OR ANY OTHER PROTECTED CHARACTERISTIC. EMPLOYMENT MAY BE CONTINGENT UPON ALDI'S RECEIPT OF AN ACCEPTABLE AND JOB-RELATED DRUG TEST, MOTOR VEHICLE REPORT, AND/OR REFERENCE CHECK, AS APPLICABLE AND PERMISSIBLE BY LAW.",
    "job_skill_set": [
      "project management",
      "financial analysis",
      "Microsoft Office Suite",
      "process improvement",
      "documentation",
      "financial reporting",
      "data analysis",
      "communication",
      "time management",
      "collaboration",
      "problem solving",
      "flexibility",
      "relationship building",
      "negotiation",
      "attention to detail",
      "business systems knowledge"
    ],
    "short_keywords": [
      "analysis",
      "attention",
      "building",
      "business",
      "collaboration",
      "communication",
      "coordinator",
      "data",
      "detail",
      "documentation",
      "finance",
      "financial",
      "flexibility",
      "ii",
      "improvement",
      "knowledge",
      "management",
      "microsoft",
      "negotiation",
      "office",
      "problem",
      "process",
      "project",
      "relationship",
      "reporting",
      "solving",
      "suite",
      "systems",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3889113843",
    "job_title": "Early Careers: Accounting/Finance - Internship Summer 2024 -Philadelphia",
    "category": "FINANCE",
    "job_description": "JOB DESCRIPTION\n\nEMPLOYMENT-BASED NON-IMMIGRANT VISA SPONSORSHIP AND/OR ASSISTANCE IS NOT OFFERED FOR THIS SPECIFIC JOB OPPORTUNITY.\n\nTHE BUSINESS\n\nCREATE YOUR FUTURE. THE FINANCE FUNCTION SERVES BOTH INTERNAL AND EXTERNAL CUSTOMERS: COLLEAGUES WITHIN OUR COMPANY, CLIENT ORGANIZATIONS, SHAREHOLDERS, FINANCIAL INSTITUTIONS, VENDORS AND REGULATORY AGENCIES AROUND THE WORLD. WE FOCUS ON THE FOLLOWING:\n\nMANAGING SHAREHOLDER AND WALL STREET RELATIONSHIPS IN SUPPORT OF THE COMPANY’S STOCK. COORDINATING FORECASTING, BUDGETING, AND CONSOLIDATED FINANCIAL ANALYTICS; SUPPORTING BUSINESS LEADERS IN MEETING FINANCIAL OBJECTIVES.ENSURING EFFECTIVE GLOBAL GOVERNANCE OVER FINANCIAL MATTERS AND COMPLIANCE WITH VARIOUS REGULATORY BODIES AROUND THE WORLD, INCLUDING THE U.S. SECURITIES AND EXCHANGE COMMISSION’S FINANCIAL REPORTING REQUIREMENTS AND THE FINANCIAL CONTROL REQUIREMENTS OF THE SARBANES-OXLEY (SOX) ACT OF 2002. SUPPORTING THE REQUEST FOR PROPOSAL (RFP) PROCESS FOR THE BUSINESSES BY OVERSEEING CONTRACT LANGUAGE AND FINANCIAL THRESHOLDS FOR INVESTMENTS, PRICING, AND PROFITABILITY.SUPPORTING THE BUSINESSES’ DAILY TRANSACTION ACTIVITY, PARTICULARLY RELATED TO PAYROLL, TIME AND EXPENSE RECORDING, BILLING AND CASH COLLECTION, REVENUE RECOGNITION, AND ACCOUNTS PAYABLE.ENSURING TAX EFFICIENCY AND APPROPRIATE STATUTORY COMPLIANCE WITH GOVERNMENT AGENCIES. MANAGING BANKING AND INSURANCE RELATIONSHIPS TO ENSURE ADEQUATE LIQUIDITY AND RISK MANAGEMENT FOR THE CONTINUING SUPPORT AND GROWTH OF THE COMPANY.MANAGING ALL GLOBAL BUSINESS PROCESSES ON AN EFFECTIVE AND EFFICIENT BASIS WITH A MINDSET OF CONTINUOUS IMPROVEMENT.\n\nEXPLORE AN OPPORTUNITY. AS A FINANCE ASSOCIATE, YOU WILL BE PART OF A COLLABORATIVE TEAM IN ONE OF OUR FIVE DOMAINS OF FINANCE WHICH INCLUDE\n\nBUSINESS PARTNERSHIPSCONTROLLERSHIPCENTERS OF EXPERTISEGLOBAL PROCESS OWNERSFINANCE OPERATIONS NETWORK \n\nSKILLS\n\nLOVE YOUR WORK. WTW FINANCE OFFERS A RANGE OF CAREER PATHS TO SUIT INDIVIDUAL SKILLS AND INTERESTS. YOU WILL PROVIDE SUPPORT ON PROJECTS IN ONE OR MORE OF THE FOLLOWING TEAMS:\n\nCONTROLLERSHIP/ACCOUNTING - THIS ROLE WILL SUPPORT THE WTW CONTROLLERSHIP TEAM IN THE PLANNING, EXECUTION, AND MONITORING OF AUDIT RELATED TASKS RELATING TO 2024 SOX PROGRAM AND TRANSFORMATION INITIATIVES WITH SOX IMPACT. KEY RESPONSIBILITIES INCLUDE SOX CONTROLS IDENTIFICATION, PROCESS/CONTROLS WALKTHROUGHS, TESTING OF CONTROLS, DRAFTING OF TEST CONCLUSION SUMMARY, AND WORKING/LIAISING WITH EXTERNAL AND INTERNAL AUDITORS. IN ADDITION, THERE ARE AD HOC TASKS RELATING TO MONITORING OF FINANCE MANAGEMENT ACTION PLANS RESULTING FROM INTERNAL AUDIT FINDINGS.FINANCIAL PLANNING & ANALYSIS (FP&A) - THIS ROLE WILL SUPPORT THE WTW FP&A TEAM BY TAKING ON REPORTING AND ANALYTICAL PROJECTS TO ASSIST IN BUSINESS AND CORPORATE FUNCTION FINANCIAL MANAGEMENT. KEY RESPONSIBILITIES INCLUDE THE FOLLOWING: ANALYZING P&L TRENDS, PREPARING KEY BUSINESS METRICS REPORTS FOR USE BY MANAGEMENT AND FUNCTIONAL LEADS, AND COLLABORATING ON WAYS TO IMPROVE PROCESS/EFFICIENCY OF WORK PRODUCT.\n\nWE SUPPORT GRADUATES TO DEVELOP A BROAD RANGE OF TECHNICAL AND SOFT SKILLS. THIS BREADTH OF KNOWLEDGE ACROSS THE FINANCE FUNCTION WILL ALLOW YOU TO IDENTIFY WHICH TOPICS YOU FIND MOST INTERESTING AND EXPLORE THEM FURTHER. THERE ARE ALSO OPPORTUNITIES TO CONTRIBUTE TO EXTRA-CURRICULAR PROJECTS.\n\nAS PART OF A FORWARD-THINKING ORGANIZATION, YOU WILL WORK IN AN INCLUSIVE ENVIRONMENT THAT RECOGNIZES THE IMPORTANCE OF DIVERSITY OF THOUGHT IN ACHIEVING SUCCESS. OUR AIM IS TO ATTRACT TALENT WHO LOVE TO WORK COLLABORATIVELY; WHO VALUE DIFFERENCES; WHO ARE WILLING TO MOVE FAST EVEN IN UNCERTAINTY; AND WHO LEARN AND ADAPT AS THEY MOVE FORWARD.",
    "job_skill_set": [
      "financial analysis",
      "budgeting",
      "forecasting",
      "reporting",
      "financial modeling",
      "data analysis",
      "accounting principles",
      "collaboration",
      "adaptability",
      "problem solving",
      "communication",
      "attention to detail",
      "time management",
      "critical thinking",
      "teamwork",
      "SOX compliance",
      "auditing",
      "P&L analysis"
    ],
    "short_keywords": [
      "2024",
      "accounting",
      "accountingfinance",
      "adaptability",
      "analysis",
      "attention",
      "auditing",
      "budgeting",
      "careers",
      "collaboration",
      "communication",
      "compliance",
      "critical",
      "data",
      "detail",
      "early",
      "finance",
      "financial",
      "forecasting",
      "internship",
      "management",
      "modeling",
      "philadelphia",
      "pl",
      "principles",
      "problem",
      "reporting",
      "solving",
      "sox",
      "summer",
      "teamwork",
      "thinking",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3905293915",
    "job_title": "Finance Business Partner",
    "category": "FINANCE",
    "job_description": "ABOUT MORTENSON\n\nAS A TOP 25 BUILDER, DEVELOPER, AND EPC, OUR EXPERTISE SPANS MARKETS LIKE SPORTS, RENEWABLE ENERGY, DATA CENTERS, HEALTHCARE, AND MORE. WE ARE BUILDERS AT HEART, WORKING TO ENSURE THE BUILT ENVIRONMENT HAS A LASTING POSITIVE IMPACT.\n\nLET’S REDEFINE POSSIBLE®\n\nSUMMARY\n\nMORTENSON IS LOOKING TO ADD A FINANCE BUSINESS PARTNER TO SUPPORT OUR PHOENIX OPERATING GROUP. THIS INDIVIDUAL WILL BE RESPONSIBLE FOR LEADING THE DEVELOPMENT AND DELIVERY OF FINANCIAL SOLUTIONS TO OPERATING GROUP LEADERSHIP TEAMS, INCLUDING PLANNING, BUDGETING, FORECASTING AND DECISION SUPPORT. THIS ROLE PERFORMS PREDICTIVE SCENARIOS/WHAT-IF ANALYSES TO GENERATE INSIGHTS & RECOMMENDATIONS AND SERVES AS A KEY LIAISON AND BUSINESS PARTNER TO BOTH OPERATING GROUPS FROM THE FINANCE GROUP.\n\nRESPONSIBILITIES\n\nBRING FINANCE SUBJECT MATTER EXPERTISE AND UNDERSTANDING OF MARKET LANDSCAPE TO SUPPORT OPERATING GROUP LEADERSDEVELOP FINANCIAL BUSINESS MODELS TO INFLUENCE GROUP LEADERSHIP DECISION-MAKING AROUND CURRENT AND FUTURE OPPORTUNITIESPROACTIVELY EDUCATE, MONITOR, AND PROVIDE ACTIONABLE ANALYSIS OF KEY FINANCIAL PERFORMANCE INDICATORSPREPARE AND REVIEW WITH GROUP LEADERSHIP A MONTHLY FINANCIAL PACKAGE, WHICH HIGHLIGHTS KEY FINANCIAL RISKS, OPPORTUNITIES, AND COMPARISON OF FORECASTED AND ACTUAL PERFORMANCE TO PLAN. PLAY A KEY FINANCE ADVISORY ROLE DURING THE PURSUIT AND CONTRACTING PHASE OF PROSPECTIVE OPPORTUNITIESOTHER DUTIES AS ASSIGNED AND REQUESTED BY OPERATING GROUP LEADERSHIP, FINANCE LEADERSHIP, OR SENIOR LEADERSHIP TEAM.EFFECTIVELY WORK AND BUILD RELATIONSHIPS WITH THOSE OF DIVERSE BACKGROUNDS AND ORGANIZATIONAL LEVELS.\n\nQUALIFICATIONS\n\nBACHELOR’S DEGREE IN BUSINESS OR EQUIVALENT FIELDMBA OR OTHER ADVANCED DEGREE PREFERREDMINIMUM SEVEN YEARS PRIOR FINANCE EXPERIENCEEXPERIENCE WITH MICROSOFT EXCEL AND ERP APPLICATIONSCONSTRUCTION INDUSTRY EXPOSURE IS BENEFICIAL, NOT REQUIREDTRAVEL REQUIRED WITH THIS POSITIONSEEKING CANDIDATES WITH STRONG:FINANCIAL AND BUSINESS ACUMENDATA ANALYSIS AND STORYTELLING SKILLSADAPTIVE AND CRITICAL THINKING SKILLSEXECUTIVE PRESENCE ACROSS ALL FORMS OF COMMUNICATIONABILITY TO OPERATE WITH AUTONOMY\nMORTENSON RESERVES THE RIGHT TO HIRE ANY INDIVIDUAL WITHOUT LEGAL OR FINANCIAL OBLIGATION ON UNWANTED SOLICITATIONS. NO AGENCY EMAILS, CALLS, OR SOLICITATIONS ARE ACCEPTED WITHOUT A VALID AGREEMENT.\n\nMORTENSON IS AN EOE/AFFIRMATIVE ACTION/M/F/VETERAN/DISABLED EMPLOYER.\n\nVISA SPONSORSHIP IS NOT AVAILABLE FOR THIS POSITION.\n\n",
    "job_skill_set": [
      "financial analysis",
      "budgeting",
      "forecasting",
      "data analysis",
      "Microsoft Excel",
      "ERP applications",
      "financial modeling",
      "financial performance indicators",
      "communication",
      "relationship building",
      "critical thinking",
      "adaptability",
      "executive presence",
      "autonomy"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "applications",
      "autonomy",
      "budgeting",
      "building",
      "business",
      "communication",
      "critical",
      "data",
      "erp",
      "excel",
      "executive",
      "finance",
      "financial",
      "forecasting",
      "indicators",
      "microsoft",
      "modeling",
      "partner",
      "performance",
      "presence",
      "relationship",
      "thinking"
    ]
  },
  {
    "job_id": "3895806899",
    "job_title": "Coordinator, Finance",
    "category": "FINANCE",
    "job_description": "WE ARE UMG, THE UNIVERSAL MUSIC GROUP. WE ARE THE WORLD’S LEADING MUSIC COMPANY. IN EVERYTHING WE DO, WE ARE COMMITTED TO ARTISTRY, INNOVATION AND ENTREPRENEURSHIP. WE OWN AND OPERATE A BROAD ARRAY OF BUSINESSES ENGAGED IN RECORDED MUSIC, MUSIC PUBLISHING, MERCHANDISING, AND AUDIOVISUAL CONTENT IN MORE THAN 60 COUNTRIES. WE IDENTIFY AND DEVELOP RECORDING ARTISTS AND SONGWRITERS, AND WE PRODUCE, DISTRIBUTE AND PROMOTE THE MOST CRITICALLY ACCLAIMED AND COMMERCIALLY SUCCESSFUL MUSIC TO DELIGHT AND ENTERTAIN FANS AROUND THE WORLD.\n\nHOW WE LEAD\n\nCAPITOL CHRISTIAN MUSIC GROUP (CCMG) IS THE WORLD’S LEADING CHRISTIAN MUSIC COMPANY AND MARKET LEADER IN RECORDED MUSIC, DISTRIBUTION, AND MUSIC PUBLISHING. CCMG IS PART OF CAPITOL MUSIC GROUP WHICH IS WHOLLY OWNED BY UNIVERSAL MUSIC GROUP. CCMG IS CHARACTERIZED BY A STRONG COMMITMENT TO ARTISTS AND SONGWRITERS, ONE ANOTHER, OUR CUSTOMER, AND COMMUNITY SERVICE.\n\nWE ARE CURRENTLY SEEKING A FINANCE COORDINATOR IN THE CORPORATE SERVICES GROUP RESPONSIBLE FOR PURCHASING, PROCESS INVOICES FOR PAYMENT, ADMINISTRATIVE AND OTHER DUTIES. THE SUCCESSFUL CANDIDATE WILL HAVE EXPOSURE TO ACCOUNTING OPERATIONS AND A KEEN EYE FOR DETAIL, EXHIBITING AN ABILITY TO MANAGE MULTIPLE PROJECTS WITH COMPETING PRIORITIES, SELF-DRIVEN, AND COMMUNICATE TACTFULLY AND ASSERTIVELY.\n\nHOW YOU'LL CREATE\n\nDUTIES AS ASSISTANT TO THE SVP, FINANCEPROVIDE GENERAL ADMINISTRATIVE SUPPORT TO THE SVP, FINANCE AND DIRECT REPORTS TO THE SVP, FINANCE INCLUSIVE OF SCHEDULING MEETINGS, CREATING MEETING AGENDAS, AND OTHER ADMINISTRATIVE ACTIVITIESSCHEDULE, PLAN AND COORDINATE ALL TRAVEL ARRANGEMENTS FOR THE SVP, FINANCE AND OTHER DEPARTMENT HEADS AS NEEDED INCLUDING THE PREPARATION AND TRACKING OF EXPENSE REPORTSMAINTAIN AND APPROVE VACATION AND OTHER REQUESTED TIME OFF FOR DIRECT REPORTSHELP PLAN AND COORDINATE EVENTS AS NEEDED FOR THE DEPARTMENTS OF THE SVP, FINANCE AND CCMG AS A WHOLECREATE AN ENVIRONMENT OF TRUST AND RELIABILITY WITH STAFF MEMBERS AND OTHER OUTSIDE INDIVIDUALS SO THEY FEEL THEIR REQUESTS AND NEEDS ARE BEING ADDRESSED IN AN EFFICIENT MANNERMAINTAIN DISCRETION AND CONFIDENTIALITYFULL OWNERSHIP TO PROACTIVELY TRACK AND ENSURE TIMELY PAYMENT BY SUBMITTING INVOICES ON THE FOLLOWING ACTIVITIES: WEBSITE DOMAIN NAME REGISTRATIONS, IT MAINTENANCE CONTRACTS, COMMUNICATION BILLS, FACILITY VENDORS (E.G., PARKING, SHIPPING, 3RD PARTY VENDORS, ETC.), AND OTHER SIMILAR ASSIGNED VENDORSKEY LIAISON TO UMG AND SUBJECT MATTER EXPERT INTERNALLY FOR TRAVEL RELATED ACTIVITIES (BOTH ARTIST AND EMPLOYEE RELATED)ASSIST THE FINANCE DEPARTMENT TO LOCALLY ADMINISTRATE UMG’S CORPORATE CREDIT CARD PROGRAMPROACTIVELY MANAGE THE PREPARATION AND ADMINISTRATION OF THE CAPITAL EXPENDITURE BUDGETING AND PURCHASING PROCESSWORK CLOSELY WITH THE IT AND FACILITY TEAMS TO FACILITATE AND ENSURE NEW CAPITAL EXPENDITURE PURCHASES ARE TAGGED AND RECORDED IN THE FIXED ASSET INVENTORY LOGFACILITATE AND COORDINATE THE ONBOARDING PROCESS FOR NEW CCMG TEAM MEMBERS IN RESPECT TO FINANCE AND IT SYSTEM SETUPS AND EQUIPMENT. PERFORM SIMILAR DUTIES WHEN CCMG TEAM MEMBERS LEAVE.ENSURE ALL CREDIT CARD PURCHASES FOLLOW UMG POLICY AND PROCEDURES, ARE THOROUGHLY DOCUMENTED, AND THE MONTHLY STATEMENT IS FULLY RECONCILED AND PROCESSED FOR PAYMENT IN A TIMELY MANNERMONITOR BOTH THE UMG AND LOCAL PURCHASING STANDARDS TO ENSURE COMPLIANCE WITH ANY UMG GUIDELINESOTHER DUTIES AND RESPONSIBILITIES AS ASSIGNED\nBRING YOUR VIBE\n\nA BACHELOR’S DEGREE IN ACCOUNTING OR FINANCE1-2 YEARS OF RELEVANT EXPERIENCE PREFERRED OR RELEVANT INTERNSHIPS IN ACCOUNTING/FINANCEMETICULOUS ATTENTION TO DETAIL AND ABILITY TO PERFORM TASKS WITH ACCURACY AND EFFICIENCY IN MINDSTRONG ORGANIZATIONAL SKILLS WITH THE ABILITY TO ANTICIPATE THE NEEDS OF A BUSY EXECUTIVE AND COORDINATE RESOURCESABILITY TO WORK INDEPENDENTLY AND AS PART OF A TEAM IN A FAST-PACED ENVIRONMENTABILITY TO HANDLE MULTIPLE TASKS, PRIORITIZE EFFECTIVELY, AND TO CARRY OUT TASKS WITH LIMITED SUPERVISIONABILITY TO INTERACT PROFESSIONALLY WITH ALL LEVELS OF PERSONNEL, INCLUDING BUSINESS UNIT EXECUTIVESEXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS, TIME MANAGEMENT, PROBLEM-SOLVING, AND MATH SKILLSPROVEN ABILITY TO HANDLE CONFIDENTIAL INFORMATION WITH DISCRETIONSTRONG COMPUTER PROFICIENCY (OFFICE 365, EXCEL, WORD, POWERPOINT, ZOOM, ADOBE PDF/SIGN) WITH A WILLINGNESS AND ABILITY TO LEARN OTHER PROGRAMS\n\nPERKS PLAYLIST\n\nBE PART OF AN ENTREPRENEURIAL, GLOBAL ORGANIZATION THAT VALUES AUTHENTICITY, DRIVE, CREATIVITY, RELATIONSHIPS, AND A COMPETITIVE SPIRITCOMPREHENSIVE MEDICAL, DENTAL, VISION, AND FSA OPTIONS, AS WELL AS:100% COVERAGE FOR OUT-PATIENT MENTAL HEALTH SERVICESWELLBEING REIMBURSEMENTS FOR FITNESS CLASSES, SPA TREATMENTS, MEAL SERVICES, TRAVEL, AND SO MUCH MORE (UP TO $720/YEAR)A LIFETIME FERTILITY SUPPORT ALLOWANCE OF $30,000 TO PLAN PARTICIPANTSSTUDENT LOAN REPAYMENT ASSISTANCE AND TUITION REIMBURSEMENT100% IMMEDIATELY VESTED 401(K) MATCH ON THE FIRST 5% OF YOUR CONTRIBUTION ON ELIGIBLE COMPENSATION\n\nVARIETY OF WAYS TO PRIORITIZE MUCH-NEEDED TIME AWAY FROM WORK INCLUDING:FLEXIBLE PAID TIME OFF (PTO) FOR EXEMPT EMPLOYEES3-WEEKS PTO FOR NON-EXEMPT EMPLOYEES2-WEEKS PAID WINTER BREAK10 COMPANY HOLIDAYS (INCLUDING JUNETEENTH AND WELLBEING DAY)SUMMER FRIDAYS (BETWEEN MEMORIAL DAY AND LABOR DAY)GENEROUS PAID PARENTAL LEAVE FOR EVERY TYPE OF PARENT\nCHECK OUT OUR FULL OVERVIEW OF BENEFITS ON THE PERKS PLAYLIST PAGE OF THE CAREER SITE.\n\nDISCLAIMER: THIS JOB DESCRIPTION ONLY PROVIDES AN OVERVIEW OF JOB RESPONSIBILITIES THAT ARE SUBJECT TO CHANGE.\n\nUNIVERSAL MUSIC GROUP IS AN EQUAL OPPORTUNITY EMPLOYER\n\nWE ARE AN E-VERIFY EMPLOYER IN ALABAMA, ARIZONA, GEORGIA, MISSISSIPPI, NORTH CAROLINA, SOUTH CAROLINA, TENNESSEE, AND UTAH.\n\nFOR MORE INFORMATION, PLEASE CLICK ON THE FOLLOWING LINKS.\n\nE-VERIFY PARTICIPATION POSTER: ENGLISH / SPANISH\n\nE-VERIFY RIGHT TO WORK POSTER: ENGLISH | SPANISH\n\nJOB CATEGORY\n\nFINANCE & ACCOUNTING",
    "job_skill_set": [
      "accounting",
      "finance",
      "Excel",
      "budgeting",
      "invoicing",
      "data entry",
      "fixed asset inventory",
      "attention to detail",
      "organizational skills",
      "communication",
      "problem solving",
      "time management",
      "teamwork",
      "discretion",
      "independence",
      "professionalism",
      "Office 365",
      "Adobe PDF"
    ],
    "short_keywords": [
      "365",
      "accounting",
      "adobe",
      "asset",
      "attention",
      "budgeting",
      "communication",
      "coordinator",
      "data",
      "detail",
      "discretion",
      "entry",
      "excel",
      "finance",
      "fixed",
      "independence",
      "inventory",
      "invoicing",
      "management",
      "office",
      "organizational",
      "pdf",
      "problem",
      "professionalism",
      "skills",
      "solving",
      "teamwork",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3906093698",
    "job_title": "Director of Finance",
    "category": "FINANCE",
    "job_description": "OUR CLIENT IS SEEKING A DIRECTOR OF FINANCE FOR AN EXCELLENT ON-SITE POSITION WITH A FAST-GROWING HOTEL COMPANY BASED IN THE ORLANDO, FL AREA. THIS ROLE IS RESPONSIBLE FOR MANAGING ALL FINANCE AND ACCOUNTING OPERATIONS FOR THE PROPERTY INCLUDING:\nFORECASTING, BUDGETING, LABOR REPORTING, AND WEEKLY PERFORMANCE REPORTSCASH FLOW, CONTROLS, POLICY/PROCEDURE OPERATIONSOVERSEEING MONTH-END CLOSE AND REPORTING, AS WELL AS WORK FROM A/P, A/R, AND PAYROLL TEAMS.BUSINESS LEADERSHIP ENGAGEMENT AND ADVISEMENTMANAGE INTERNAL ERP SYSTEMSPOINT-OF-CONTACT FOR AUDITORS\nQUALIFICATIONS:BACHELOR’S DEGREE IN ACCOUNTING, FINANCE, OR RELATEDMINIMUM 3 YEARS OF EXPERIENCE MANAGING FINANCE/ACCOUNTING OPERATIONS, AND 7+ YEARS IN THE HOSPITALITY/HOTEL INDUSTRY IN PROGRESSIVE ROLESKNOWLEDGE OF HOTEL ACCOUNTING/FINANCE SYSTEMS, AND STRONG EXCEL SKILLSSTRONG COLLABORATION AND COMMUNICATION SKILLS (WRITTEN AND VERBAL), WITH THE ABILITY TO PARTNER WITH INTERNAL TEAMS AND EXECUTIVE STAKEHOLDERS.",
    "job_skill_set": [
      "forecasting",
      "budgeting",
      "business leadership",
      "collaboration",
      "communication",
      "labor reporting",
      "cash flow management",
      "financial controls",
      "policy and procedure operations",
      "month-end close",
      "accounts payable (A/P)",
      "accounts receivable (A/R)",
      "payroll management",
      "ERP systems management",
      "hotel accounting systems",
      "Excel",
      "advisement"
    ],
    "short_keywords": [
      "accounting",
      "accounts",
      "advisement",
      "and",
      "ap",
      "ar",
      "budgeting",
      "business",
      "cash",
      "close",
      "collaboration",
      "communication",
      "controls",
      "director",
      "erp",
      "excel",
      "finance",
      "financial",
      "flow",
      "forecasting",
      "hotel",
      "labor",
      "leadership",
      "management",
      "monthend",
      "of",
      "operations",
      "payable",
      "payroll",
      "policy",
      "procedure",
      "receivable",
      "reporting",
      "systems"
    ]
  },
  {
    "job_id": "3887573476",
    "job_title": "Finance Assistant (Interview ASAP)",
    "category": "FINANCE",
    "job_description": "TITLE \n\nFINANCE ASSISTANT\n\nINTERVIEWING ASAP!!**\n\n\n HOURS \n\nHIRING FOR FIRST SHIFT! MUST BE FLEXIBLE TO WORK MONDAY-FRIDAY, 8:00AM-5:00PM\n\nHYBRID ROLE- MUST BE LOCAL OR WILLING TO COMMUTE TO FLINT, MI**\n\n\n MUST HAVES \n\n2 OR MORE YEARS OF WORKING IN FAST PACED OFFICE ENVIRONMENTS AP/AR EXPERIENCE IS A PLUS! EXCEL EXPERIENCE IS NEEDEDSTRONG COMPUTER SKILLS AND WORKING KNOWLEDGE OF MICROSOFT OFFICEGREAT CUSTOMER SERVICE MINDSET AND ATTITUDE!WILLING TO LEARN AND GROW!PROVEN ABILITY TO MULTITASK\n\n\n ABOUT TEKSYSTEMS \n\nWE'RE PARTNERS IN TRANSFORMATION. WE HELP CLIENTS ACTIVATE IDEAS AND SOLUTIONS TO TAKE ADVANTAGE OF A NEW WORLD OF OPPORTUNITY. WE ARE A TEAM OF 80,000 STRONG, WORKING WITH OVER 6,000 CLIENTS, INCLUDING 80% OF THE FORTUNE 500, ACROSS NORTH AMERICA, EUROPE AND ASIA. AS AN INDUSTRY LEADER IN FULL-STACK TECHNOLOGY SERVICES, TALENT SERVICES, AND REAL-WORLD APPLICATION, WE WORK WITH PROGRESSIVE LEADERS TO DRIVE CHANGE. THAT'S THE POWER OF TRUE PARTNERSHIP. TEKSYSTEMS IS AN ALLEGIS GROUP COMPANY.\n\nTHE COMPANY IS AN EQUAL OPPORTUNITY EMPLOYER AND WILL CONSIDER ALL APPLICATIONS WITHOUT REGARDS TO RACE, SEX, AGE, COLOR, RELIGION, NATIONAL ORIGIN, VETERAN STATUS, DISABILITY, SEXUAL ORIENTATION, GENDER IDENTITY, GENETIC INFORMATION OR ANY CHARACTERISTIC PROTECTED BY LAW.",
    "job_skill_set": [
      "Excel",
      "Microsoft Office",
      "Accounts Payable",
      "Accounts Receivable",
      "Computer Skills",
      "Customer Service",
      "Multitasking",
      "Willingness to Learn",
      "Adaptability"
    ],
    "short_keywords": [
      "accounts",
      "adaptability",
      "asap",
      "assistant",
      "computer",
      "customer",
      "excel",
      "finance",
      "interview",
      "learn",
      "microsoft",
      "multitasking",
      "office",
      "payable",
      "receivable",
      "service",
      "skills",
      "to",
      "willingness"
    ]
  },
  {
    "job_id": "3904586302",
    "job_title": "Finance Project Manager",
    "category": "FINANCE",
    "job_description": "THE RESOURCE WOULD WORK INTENSIVELY WITH TRANSACTION POLICY GROUP ON THE INTERPRETATION OF THE NEW U.S. “BASEL 3 ENDGAME” REGULATION AND WRITING POLICIES. HE/SHE WOULD ALSO ENGAGE IN COMPARING THE U.S. REGULATION WITH THE CURRENT U.S. “BASEL 3” RULES AND WITH EUROPEAN EQUIVALENT REGULATION, CRR3 (CAPITAL REQUIREMENTS REGULATION 3).  THEREFORE THE RESOURCE SHOULD ALREADY HAVE IN-DEPTH KNOWLEDGE OF THE U.S. “BASEL 3 ENDGAME” RULES AND AT LEAST THE CURRENT U.S. “BASEL 3” RULES. IT IS SUFFICIENT TO KNOW THE CREDIT RISK PART.  SUCH RESOURCES WILL TYPICALLY HAVE WORKED IN THE POLICY DEPARTMENTS OF U.S. BANKS OR HAVE WORKED ON IMPLEMENTATION PROJECTS OF THE U.S. “BASEL 3” OR “BASEL 3 ENDGAME” REGULATION.  PROJECT MANAGEMENT EXPERIENCE (LIKE STATUS REPORTING, BUDGETING, MAINTAINING RISK/ISSUE/DEPENDENCIES LOGS) IS NOT REQUIRED.",
    "job_skill_set": [
      "Analytical Skills",
      "Attention to Detail",
      "Communication",
      "Collaboration",
      "Basel 3 Endgame Regulation",
      "Basel 3 Rules",
      "CRR3 (Capital Requirements Regulation 3)",
      "Credit Risk Knowledge",
      "Policy Writing"
    ],
    "short_keywords": [
      "3",
      "analytical",
      "attention",
      "basel",
      "capital",
      "collaboration",
      "communication",
      "credit",
      "crr3",
      "detail",
      "endgame",
      "finance",
      "knowledge",
      "manager",
      "policy",
      "project",
      "regulation",
      "requirements",
      "risk",
      "rules",
      "skills",
      "to",
      "writing"
    ]
  },
  {
    "job_id": "3651735073",
    "job_title": "Director of Finance",
    "category": "FINANCE",
    "job_description": "APPLY HERE\nHTTPS://WWW.INDEED.COM/JOB/DIRECTOR-FINANCE-9C0196508A30CB63\nJOB DESCRIPTIONJOB TITLE: DIRECTOR OF FINANCEREPORTS TO: CEO, SVDP-DETROITFLSA STATUS: EXEMPT\nSUMMARYTHE SOCIETY OF ST. VINCENT DE PAUL DETROIT EXISTS TO BUILD A MORE EQUITABLE AND COMPASSIONATE WORLD THROUGH MEANINGFUL PERSONAL RELATIONSHIPS, PROVIDING WHATEVER IS NEEDED TO HELP OUR NEIGHBORS GET BACK ON THEIR FEET AND ON A PATH TOWARDS SELF-SUSTAINABILITY. OUR PROGRAMS PROVIDE SUPPORT RANGING FROM UTILITY, HOUSING, AND FOOD ASSISTANCE, TO EDUCATION AND MENTORSHIP. WE ALSO OPERATE A NETWORK OF THRIFT STORES, TWO CAMPS AND A NUTRITIONAL CENTER. WE ARE PASSIONATE ABOUT DRIVING SYSTEMIC CHANGE AND HELPING OUR NEIGHBORS IN METRO-DETROIT BREAK OUT OF POVERTY.\nTHE DIRECTOR OF FINANCE IS THE PRIMARY INTERFACE WITH THE OUTSOURCED FINANCE FUNCTION AS WELL AS THE PRIMARY ADMINISTRATIVE CONTACT WITH THE EMPLOYEE-OUTSOURCING VENDOR AS WELL AS PROVIDING ONGOING LEADERSHIP AND SUPPORT IN THE AREAS OF RISK MANAGEMENT, EMPLOYEE BENEFITS AND COMPLIANCE.\nTHE DIRECTOR OF FINANCE REPORTS TO THE CHIEF EXECUTIVE OFFICER, PROVIDES LEADERSHIP AND SUPPORT TO THE BOARD OF DIRECTORS AND ITS COMMITTEES.IN ADDITION TO ENSURING THE FISCAL HEALTH OF THE ORGANIZATION, THE DIRECTOR OF FINANCE PROVIDES LEADERSHIP AND DIRECTION IN THE AREAS OF FINANCE & ACCOUNTING, PAYROLL, ACCOUNTS RECEIVABLE, ACCOUNTS PAYABLE, CENTRALIZED PURCHASING, INVESTMENT MANAGEMENT, HUMAN RESOURCES, AND RISK MANAGEMENT.\nTO BE SUCCESSFUL IN THIS ROLE, THE INDIVIDUAL MUST HAVE EXPERIENCE IN FINANCIAL MANAGEMENT OF MULTIPLE BUSINESS UNITS WITH REVENUES IN EXCESS OF $15 MILLION IN A NONPROFIT ENVIRONMENT.\nESSENTIAL DUTIES AND RESPONSIBILITIES:\nFINANCE:ACT AS PRIMARY SVDP-DETROIT INTERFACE WITH THE ORGANIZATION’S OUTSOURCED FINANCE AND ACCOUNTING VENDOR.ENSURE THE RELATIONSHIP WITH THE OUTSOURCED FINANCE AND ACCOUNTING VENDOR IS ADMINISTERED IN ACCORDANCE WITH ITS CONTRACT AND WITHIN THE PERFORMANCE GUARANTEES OF ITS KEY DELIVERABLES.PREVIEW THE OUTSOURCED FINANCE AND ACCOUNTING VENDOR'S REPORTS AND ACTIVITY FOR CONSISTENCY WITH THE CONTRACT STATEMENT OF WORK AND QUALITY STANDARDS.REVIEW CASH FLOW REPORTS AND ESTIMATES AND ADVISE ON NECESSARY ADJUSTMENTS.MONITOR SYSTEM OF INTERNAL CONTROLS, INCLUDING SEPARATION OF DUTIES AND REVIEW PROCESSES, TO PREVENT, DETECT AND CORRECT INCIDENTS OF FRAUD AND MATERIAL MISSTATEMENTS.PARTNER WITH SVDP-DETROIT AUDITORS AND THE OUTSOURCED FINANCE AND ACCOUNTING VENDOR IN COMPLETION OF ANNUAL FINANCIAL AUDIT AND 990 FILING.COORDINATE WITH DEPARTMENT HEADS AND THE OUTSOURCED FINANCE AND ACCOUNTING VENDOR IN DEVELOPING BUDGETS AND IN BUDGET ANALYSIS.ASSIST SENIOR MANAGEMENT IN DEVELOPING SHORT-MEDIUM-LONG RANGE FINANCIAL GOALS AND PROJECTIONS.ASSIST THE TREASURER IN CASH FLOW ANALYSIS, FINANCING STRATEGIES, AND ALL TREASURY MANAGEMENT ACTIVITIES. PROVIDE LEADERSHIP TO AUDIT AND FINANCE COMMITTEES.LEAD QUARTERLY MEETINGS WITH INVESTMENT COMMITTEE TO REVIEW INVESTMENT PERFORMANCE AND FUND MANAGERS. ASSESS AND UPDATE INVESTMENT POLICY STATEMENTS. ADVISE ON ASSET ALLOCATION AND RISK TOLERANCE.DEVELOP AND UTILIZE FORWARD-LOOKING, PREDICTIVE MODELS AND ACTIVITY BASED FINANCIAL ANALYSIS TO PROVIDE INSIGHT INTO THE ORGANIZATION’S OPERATIONS AND BUSINESS PLANS.DEVELOP FINANCIAL BUSINESS PLANS AND FORECASTS FOR ALL SPECIAL PROJECTS OR CAPITAL ACQUISITIONS.PARTICIPATE IN DEVELOPING NEW BUSINESS, SPECIFICALLY: ASSIST SENIOR MANAGEMENT IN IDENTIFYING NEW FUNDING OPPORTUNITIES, THE DRAFTING OF PROSPECTIVE PROGRAMMATIC BUDGETS, AND DETERMINING COST EFFECTIVENESS OF PROSPECTIVE SERVICE DELIVERY.RESPONSIBLE FOR COORDINATION AND MANAGEMENT OF ALL CAPITAL PROJECTS FOR SVDPD RELATIVE TO FINANCIAL ANALYSIS OF PROJECTS, TIMING, AND FUNDING REQUIREMENTS WITH THE DIRECTORS OF VARIOUS AREAS.RESPONSIBLE, IN CONJUNCTION WITH SENIOR MANAGEMENT, WITH ENSURING ADHERENCE TO THE CAPITAL BUDGET AND ASSOCIATED PROCESSES (BIDDING, CONTRACT MANAGEMENT, PAYMENT) FOR ALL CAPITAL PROJECTS.ENSURE THE COMPLIANCE OF CONTRACT MANAGEMENT PROCEDURES FOR THE ENTIRE ORGANIZATION, INCLUDING ADHERENCE TO EXISTING COMPANY POLICIES REGARDING MULTIPLE BID REQUIREMENTS FOR GOODS AND SERVICES.ASSESS THE COSTS AND BENEFITS OF ALL PROSPECTIVE CONTRACTS AND PROGRAMMATIC ACTIVITIES.PARTICIPATE IN THE DEVELOPMENT OF THE SVDP-DETROIT NEXT PHASE STRATEGIC PLAN.\nHUMAN RESOURCES/PAYROLL/BENEFITS:RESPONSIBLE FOR COORDINATION, ALONG WITH THE CEO, OF THE OUTSIDE PROFESSIONAL EMPLOYER ORGANIZATION (PEO) WITH OVERALL EMPLOYEE MATTERS INCLUDING; DETERMINING SELECTION OF BENEFITS PACKAGE, CHANGE TO AND UPDATING THE EMPLOYEE HANDBOOK, AND ANY REGULATORY AND LEGAL CONSIDERATIONS THAT MAY ARISE.ENSURE THE RELATIONSHIP WITH THE PEO IS ADMINISTERED IN ACCORDANCE WITH ITS CONTRACT AND WITHIN THE PERFORMANCE GUARANTEES OF ITS KEY DELIVERABLES.RESPONSIBLE FOR COORDINATING WITH DIRECTORS THAT THE BI-WEEKLY PAYROLL HOURS ARE CORRECT AND ENSURING THE SUBMISSION AND RUNNING OF THE PAYROLL OCCURS ACCURATELY AND TIMELY, AND THAT THE PAYROLL IS FUNDED PRIOR TO SUBMISSION.COORDINATE WITH THE PEO ON EMPLOYEE WELFARE PLANS OFFERINGS, COST ANALYSIS AND COMPETITIVENESS.COORDINATE WITH THE PEO ON THE WELFARE PLANS OPEN ENROLLMENT PROCESS AND VENDOR SELECTION.OVERSEE AND COORDINATE WITH THE SVDP-DETROIT PENSION PLAN ACTUARY AND ADVISORS ON ANNUAL COMPLIANCE, PARTICIPANT COMMUNICATIONS, BENEFIT DELIVERY, AND GOVERNMENT FILINGS.OVERSEE AND COORDINATE WITH THE SVDP-DETROIT 401(K) PLAN ADMINISTRATOR, RECORD KEEPER, ADVISORS, AND TRUST ON EMPLOYEE ELIGIBILITY COMMUNICATION, SUITABILITY OF INVESTMENT OPTIONS, ONGOING COMPLIANCE, AND GOVERNMENT FILINGS.\nRISK:IN CONJUNCTION WITH THE SVDP-DETROIT CEO IDENTIFY, EVALUATE AND MONITOR POTENTIAL NEGATIVE EVENTS TO THE ORGANIZATION IN AREAS OF RISK SUCH AS REPUTATIONAL, SAFETY, FINANCIAL, WEATHER EVENTS, POTENTIAL FIRES, CYBER RISKS, AND OTHER RISKS.DEVELOP PROGRAMS AND PLANS TO MINIMIZE RISK AND PRIORITIZE PROCESSES TO ADDRESS POTENTIAL ADVERSE EVENTS.OVERSEE CORPORATE INSURANCE COVERAGE AND WORK WITH SVDP STAFF AND VINCENTIANS TO MITIGATE RISK.\nINFORMATION TECHNOLOGY:RESPONSIBLE FOR IT SUPPORT SERVICES RELATED TO OVERALL SVDPD NEEDS, AND COORDINATION WITH OUTSOURCED SERVICE PROVIDER TO MANAGE DAILY AND MONTHLY SUPPORT NEEDS OF THE CENTRAL OFFICE STAFF.RESPONSIBLE FOR COORDINATING WITH THE DIRECTORS OF STORES/WAREHOUSE AND CAMPS FOR SUPPORT AND INTEGRATION OF THESE AREAS INTO THE OVERALL SVDPD SYSTEMS ENVIRONMENT.ESTABLISHING APPROPRIATE CONTROLS ON ACQUISITION OF HARDWARE AND SOFTWARE FOR ALL THE SVDPD ORGANIZATION TO ENSURE COMPLIANCE WITH OPERATING AND CAPITAL BUDGET PROCESSES AND GUIDELINES.\nEDUCATION AND/OR EXPERIENCEBACHELOR’S DEGREE IN ACCOUNTING, BUSINESS ADMINISTRATION OR FINANCE; MBA OR CPA DESIRED5 YEARS MINIMUM NONPROFIT EXPERIENCE AS A FINANCE MANAGER, CONTROLLER, DIRECTOR OF FINANCE, OR CFOSTRONG UNDERSTANDING OF, AND EXTENSIVE PROFESSIONAL EXPERIENCE, WITH:- ACCOUNTING/GAAP PRINCIPLES, PARTICULARLY FOR NONPROFITORGANIZATIONS- TAX REQUIREMENTS FOR NONPROFIT ORGANIZATIONS- BUDGETING AND FORECASTING- FINANCIAL STATEMENT PREPARATION AND REPORTING- CASH FLOW MANAGEMENT- ACCOUNT RECONCILIATIONS AND ACCOUNTS PAYABLE- BANKING SERVICES- INTERNAL CONTROLS- INVESTMENT OVERSIGHT- RISK MANAGEMENTEXPERIENCE IN PENSION AND BENEFIT PLANS ADMINISTRATIONMANAGEMENT-LEVEL RESPONSIBILITY FOR HUMAN RESOURCES, IT, FACILITIES MANAGEMENT, AND GENERAL ADMINISTRATIVE FUNCTIONSSIGNIFICANT EXPERIENCE WORKING WITH VARIOUS FINANCIAL PACKAGES AND MICROSOFT EXCELCOMPUTER EXPERIENCE WITH MICROSOFT OFFICE SUITE A MUST. RAISER’S EDGE SOFTWARE AND RETAIL POS SYSTEMS EXPERIENCE A PLUS\nKNOWLEDGE AND ABILITIESMUST BE SELF-MOTIVATED, RESULTS ORIENTED, AND ABLE TO SET PRIORITIES AND WORK ON NUMEROUS PROJECTS SIMULTANEOUSLY WITH STRONG ATTENTION TO DETAIL.EXCELLENT INTERPERSONAL, ORGANIZATIONAL, COMMUNICATION (BOTH VERBAL AND WRITTEN), ANALYTICAL AND NEGOTIATING SKILLS.STRONG ABILITY TO LEAD SVDPD TO THE BEST OUTCOMES FOR THE ENTIRE ORGANIZATION BY BUILDING CONSENSUS AMONG ALL LEVELS, INCLUDING INTERNAL STAFF, BOARD OF DIRECTORS AND BOARD-LEVEL COMMITTEES, DISTRICTS AND CONFERENCES.COMMUNICATE CLEARLY AND CONCISELY WITH SENIOR SVDPD MANAGEMENT, VENDORS AND EMPLOYEES.MAINTAINS A HIGH LEVEL OF CONFIDENTIALITY REGARDING SENSITIVE INFORMATIONHIGHEST LEVEL OF ETHICS AND INTEGRITYEXPERIENCE IN THE NONPROFIT SECTOR. FAMILIARITY WITH THE ARCHDIOCESE OF DETROIT CATHOLIC FAITH COMMUNITY DESIRABLE.\nBENEFITS OFFERED401(K)401(K) MATCHINGDENTAL INSURANCEHEALTH INSURANCELIFE INSURANCEPAID TIME OFFVISION INSURANCESTD\nJOB TYPE: FULL-TIME\nSCHEDULE:MONDAY TO FRIDAY\nWORK LOCATION: IN PERSON",
    "job_skill_set": [
      "financial management",
      "accounting",
      "GAAP principles",
      "budgeting",
      "forecasting",
      "financial statement preparation",
      "cash flow management",
      "accounts payable",
      "internal controls",
      "risk management",
      "Microsoft Excel",
      "Microsoft Office Suite",
      "leadership",
      "communication",
      "interpersonal skills",
      "organizational skills",
      "analytical skills",
      "negotiating skills",
      "attention to detail",
      "self-motivated",
      "results oriented",
      "confidentiality",
      "ethics and integrity",
      "investment oversight",
      "pension administration",
      "Raiser's Edge software",
      "POS systems",
      "consensus building"
    ],
    "short_keywords": [
      "accounting",
      "accounts",
      "administration",
      "analytical",
      "and",
      "attention",
      "budgeting",
      "building",
      "cash",
      "communication",
      "confidentiality",
      "consensus",
      "controls",
      "detail",
      "director",
      "edge",
      "ethics",
      "excel",
      "finance",
      "financial",
      "flow",
      "forecasting",
      "gaap",
      "integrity",
      "internal",
      "interpersonal",
      "investment",
      "leadership",
      "management",
      "microsoft",
      "negotiating",
      "of",
      "office",
      "organizational",
      "oriented",
      "oversight",
      "payable",
      "pension",
      "pos",
      "preparation",
      "principles",
      "raisers",
      "results",
      "risk",
      "selfmotivated",
      "skills",
      "software",
      "statement",
      "suite",
      "systems",
      "to"
    ]
  },
  {
    "job_id": "3906256266",
    "job_title": "Sr Commercial Finance Director, Diabetes Americas Region",
    "category": "FINANCE",
    "job_description": "CAREERS THAT CHANGE LIVES \n\nTHE TEAM IS WORKING HYBRID AND THE POSITION WILL BE ONSITE IN NORTHRIDGE CA 3 DAYS/WEEK.\n\n\nWE’RE A MISSION-DRIVEN LEADER IN MEDICAL TECHNOLOGY AND SOLUTIONS WITH A LEGACY OF INTEGRITY AND INNOVATION. OUR MISSION — TO ALLEVIATE PAIN, RESTORE HEALTH, AND EXTEND LIFE — UNITES A GLOBAL TEAM OF 90,000+ PASSIONATE PEOPLE. POWERED BY OUR DIVERSE KNOWLEDGE, INSATIABLE CURIOSITY, AND DESIRE TO HELP ALL THOSE WHO NEED IT, WE DELIVER INNOVATIVE TECHNOLOGIES THAT TRANSFORM THE LIVES OF TWO PEOPLE EVERY SECOND, EVERY HOUR, EVERY DAY. EXPECT MORE FROM US AS WE EMPOWER INSIGHT-DRIVEN CARE, EXPERIENCES THAT PUT PEOPLE FIRST, AND BETTER OUTCOMES FOR OUR WORLD.\n\nIN EVERYTHING WE DO, WE ARE ENGINEERING THE EXTRAORDINARY.\n\nTHE SENIOR FINANCE DIRECTOR IS RESPONSIBLE FOR PROVIDING FINANCIAL LEADERSHIP AND STRATEGIC INSIGHTS TO THE DIABETES AMERICAS REGION. REPORTING DIRECTLY TO THE DIABETES CHIEF FINANCIAL OFFICER, THE SENIOR FINANCE DIRECTOR WILL SERVE AS THE MAIN BUSINESS PARTNER FOR THE DIABETES COMMERCIAL LEADER FOR THE AMERICAS REGION. THIS ROLE MANAGES A HIGH-PERFORMING TEAM AND IS RESPONSIBLE FOR LEADING THE 5-YEAR REVENUE FORECASTS, BUILDING AND DELIVERING FINANCIAL PORTFOLIO MODELS, INFORMING STRATEGIC DECISIONS THROUGH FINANCIALS, ANALYTICS, AND MARKET INSIGHTS, AND PARTNERING WITH TOP LEADERSHIP ACROSS THE AMERICAS TO ADVANCE AND EXECUTE CRITICAL PRIORITIES.\n\nLEARN MORE ABOUT OUR WORK IN THE DIABETES SPACE - HTTPS://WWW.MEDTRONICDIABETES.COM/ABOUT-MEDTRONIC-INNOVATION/WHAT-SETS-US-APART\n\nWE LOOK FOR LEADERS WHO HAVE A CLEAR VISION OF WHERE WE ARE GOING AND HOW TO GET THERE, BOLD INCLUSIVE THINKERS WHO CREATE NEW IDEAS AND BRING OUR BEST SOLUTIONS FORWARD TO BENEFIT OUR PATIENTS, BUSINESS PARTNERS, AND CUSTOMERS.\n\nA DAY IN THE LIFE\n\nRESPONSIBILITIES MAY INCLUDE THE FOLLOWING AND OTHER DUTIES MAY BE ASSIGNED.\n\n LEAD REGION REVENUE FORECASTING - IN CLOSE PARTNERSHIP WITH THE AMERICAS COMMERCIAL LEADER, INFORM AND MANAGE COMPLEX FINANCIAL MODELS TO DELIVER LONG-RANGE FORECASTS WITH THE ABILITY TO DELIVER SCENARIO PLAN ‘WHAT IF’ ANALYSIS. PROVIDE BUSINESS INSIGHTS TO DRIVE GROWTH – A TRUSTED PARTNER TO THE COMMERCIAL LEADER WHO BOTH CHALLENGES AND SUPPORTS THE LEADER WITH SOUND FINANCIAL COUNSEL BY APPLYING STRATEGIC THINKING AND FINANCIAL ANALYTICS TO PROVIDE BUSINESS INSIGHTS, CHALLENGE BUSINESS ASSUMPTIONS, DRIVE FACT-BASED DECISION-MAKING, AND ENABLE GROWTH IN BOTH REVENUE AND OPERATING INCOME. INFORM PORTFOLIO FINANCIALS AND VALUATIONS – LOOK AFTER ALL ASPECTS OF COMMERCIAL DECISION-MAKING, FINANCIAL PERFORMANCE & REPORTING, FINANCIAL CONTROL, AND CONTRACTUAL NEGOTIATIONS. DELIVER USEFUL BUSINESS INSIGHTS THROUGH ADVANCED ANALYTICS AND DATA VISUALIZATION CAPABILITIES. FACILITATE APPROVAL REQUIREMENTS OF CUSTOMER DEALS, INCLUDING PRICING, TERMS AND CONDITIONS, AND ADHERENCE TO REVENUE RECOGNITION GUIDANCE. DEVELOP AND MANAGE OPERATIONAL FINANCIAL FORECASTS – LEAD THE AOP AND QUARTERLY FORECAST PROCESS FOR THE AMERICAS REGION, TYING FINANCIAL FUNDING TO BUSINESS STRATEGY AND RETURN, PERFORMING VARIANCE ANALYSIS, AND LEADING TRADE-OFF DECISIONS. DRIVE BUSINESS EXCELLENCE - CHAMPIONS INNOVATION AND DEVELOPS A FINANCIAL FRAMEWORK AND COLLABORATION MODEL THAT DRIVES TRANSFORMATION EFFORTS GLOBALLY BY CONCEPTUALIZING AND DEVELOPING NEW APPROACHES TO PROGRAMS, PRODUCTS, AND SERVICES. OPTIMIZE TEAM PERFORMANCE AND CROSS-FUNCTIONAL PARTNERSHIPS – ENABLES TEAM TO PURSUE POSSIBILITIES THAT WILL CREATE SUSTAINABLE VALUE AND QUALITY OUTCOMES. EMPOWERING THE TEAM WITH MEANINGFUL DECISION-MAKING AND OWNERSHIP. CREATES A CULTURE THAT EMPHASIZES ONGOING LEARNING AND DEVELOPMENT AND ENCOURAGES OTHERS TO SEEK AND LEARN FROM DIVERSE PERSPECTIVES. FOCUSES ON DRIVING CONTINUOUS IMPROVEMENT AND QUALITY OUTCOMES.\n\n\n MUST HAVE: MINIMUM REQUIREMENTS \n\n BACHELOR’S DEGREE WITH 15+ YEARS OF WORK EXPERIENCE IN FINANCE AND/OR ACCOUNTING (OR ADVANCED DEGREE WITH 13+ YEARS) PLUS 10+ YEARS OF MANAGERIAL EXPERIENCE\n\n\n NICE TO HAVE \n\n DEGREE IN ACCOUNTING/FINANCE CPA, CMA, AND/OR MBA GLOBAL EXPERIENCE WORKING IN INDUSTRY OUTSIDE OF UNITED STATES MEDICAL DEVICE, HEALTHCARE OR PHARMA INDUSTRY EXPERIENCE TRANSFORMATION EXPERIENCE\n\n\nABOUT MEDTRONIC\n\nTOGETHER, WE CAN CHANGE HEALTHCARE WORLDWIDE. AT MEDTRONIC, WE PUSH THE LIMITS OF WHAT TECHNOLOGY, THERAPIES AND SERVICES CAN DO TO HELP ALLEVIATE PAIN, RESTORE HEALTH AND EXTEND LIFE. WE CHALLENGE OURSELVES AND EACH OTHER TO MAKE TOMORROW BETTER THAN YESTERDAY. IT IS WHAT MAKES THIS AN EXCITING AND REWARDING PLACE TO BE.\n\nWE WANT TO ACCELERATE AND ADVANCE OUR ABILITY TO CREATE MEANINGFUL INNOVATIONS - BUT WE WILL ONLY SUCCEED WITH THE RIGHT PEOPLE ON OUR TEAM. LET’S WORK TOGETHER TO ADDRESS UNIVERSAL HEALTHCARE NEEDS AND IMPROVE PATIENTS’ LIVES. HELP US SHAPE THE FUTURE.\n\nPHYSICAL JOB REQUIREMENTS\n\nTHE PHYSICAL DEMANDS DESCRIBED WITHIN THE RESPONSIBILITIES SECTION OF THIS JOB DESCRIPTION ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY AN EMPLOYEE TO SUCCESSFULLY PERFORM THE ESSENTIAL FUNCTIONS OF THIS JOB. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS. FOR OFFICE ROLES: WHILE PERFORMING THE DUTIES OF THIS JOB, THE EMPLOYEE IS REGULARLY REQUIRED TO BE INDEPENDENTLY MOBILE. THE EMPLOYEE IS ALSO REQUIRED TO INTERACT WITH A COMPUTER AND COMMUNICATE WITH PEERS AND CO-WORKERS. CONTACT YOUR MANAGER OR LOCAL HR TO UNDERSTAND THE WORK CONDITIONS AND PHYSICAL REQUIREMENTS THAT MAY BE SPECIFIC TO EACH ROLE. (ADA-UNITED STATES OF AMERICA)\n\n A COMMITMENT TO OUR EMPLOYEES LIVES AT THE CORE OF OUR VALUES. WE RECOGNIZE THEIR CONTRIBUTIONS. THEY SHARE IN THE SUCCESS THEY HELP TO CREATE.  WE OFFER A WIDE RANGE OF BENEFITS, RESOURCES, AND COMPETITIVE COMPENSATION PLANS DESIGNED TO SUPPORT YOU AT EVERY CAREER AND LIFE STAGE. LEARN MORE ABOUT OUR BENEFITS   HERE   . \n\n THIS POSITION IS ELIGIBLE FOR A SHORT-TERM INCENTIVE PLAN.  LEARN MORE ABOUT MEDTRONIC INCENTIVE PLAN (MIP) ON PAGE 6   HERE   . \n\n THE PROVIDED BASE SALARY RANGE IS USED NATIONALLY (EXCEPT IN CERTAIN CA LOCATIONS).  THE RATE OFFERED IS COMPLIANT WITH FEDERAL/LOCAL REGULATIONS AND MAY VARY BY EXPERIENCE,  CERTIFICATION/EDUCATION, MARKET CONDITIONS, LOCATION, ETC. \n\n LTI ELIGIBLE:  THIS POSITION IS ELIGIBLE FOR AN ANNUAL LONG-TERM INCENTIVE PLAN. LEARN MORE ABOUT MEDTRONIC LONG-TERM INCENTIVE PLAN (LTIP  )   HERE   .",
    "job_skill_set": [
      "financial leadership",
      "strategic insights",
      "financial modeling",
      "analytics",
      "market insights",
      "financial performance reporting",
      "contractual negotiations",
      "data visualization",
      "variance analysis",
      "financial forecasting",
      "team management",
      "business excellence",
      "transformation experience",
      "MBA",
      "leadership",
      "communication",
      "collaboration",
      "problem solving",
      "strategic thinking",
      "decision-making",
      "continuous improvement",
      "innovation",
      "adaptability",
      "CPA",
      "CMA",
      "cultural awareness",
      "mentorship"
    ],
    "short_keywords": [
      "adaptability",
      "americas",
      "analysis",
      "analytics",
      "awareness",
      "business",
      "cma",
      "collaboration",
      "commercial",
      "communication",
      "continuous",
      "contractual",
      "cpa",
      "cultural",
      "data",
      "decisionmaking",
      "diabetes",
      "director",
      "excellence",
      "experience",
      "finance",
      "financial",
      "forecasting",
      "improvement",
      "innovation",
      "insights",
      "leadership",
      "management",
      "market",
      "mba",
      "mentorship",
      "modeling",
      "negotiations",
      "performance",
      "problem",
      "region",
      "reporting",
      "solving",
      "sr",
      "strategic",
      "team",
      "thinking",
      "transformation",
      "variance",
      "visualization"
    ]
  },
  {
    "job_id": "3888031588",
    "job_title": "Vice President Finance",
    "category": "FINANCE",
    "job_description": "VP OF FINANCE (HEAD OF FINANCE) - REMOTE\nSTAKEHOLDER OVERVIEW:LCG ADVISORS IS CONDUCTING AN EXCLUSIVE SEARCH FOR A PRIVATELY HELD CONSUMER PACKAGED GOODS (\"CPG\") FOOD AND BEVERAGE MANUFACTURING E-COMMERCE DIRECT-TO-CONSUMER (DTC) COMPANY. THE CANDIDATE MUST LIVE IN ONE OF THESE STATES FOR TAX PURPOSES NY, NH, GA, MA, FL, WV, NV, OR, TX, OH, CO, NH OR WA (WILL BE VERIFIED).\nCANDIDATE ASPIRATIONS:THIS OPPORTUNITY IS IDEAL FOR A SELF-MOTIVATED, CONFIDENT, DRIVEN, AND CAREER-MINDED FINANCE PROFESSIONAL WHO CAN KEEP PACE IN A FINANCE FUNCTION THAT IS IN TRANSITION AND WILL REQUIRE SEVERAL URGENT MATTERS TO BE ADDRESSED. THE TEAM NEEDS INDIVIDUALS FOCUSED ON CAREER GROWTH (VS. WORK-LIFE BALANCE) WHO UNDERSTAND THE MARKETABILITY AND CAREER VALUE OF BEING PART OF A TEAM THAT BUILT OUT A BEST-IN-CLASS FINANCE FUNCTION/TECH STACK AND IS WILLING TO PUT FORTH THE HARD WORK AND DEDICATION REQUIRED TO ACHIEVE THAT MISSION.\nTHE ROLE:THE VP OF FINANCE ROLE IS REMOTE, WILL BE THE HEAD OF FINANCE, AND REPORTS DIRECTLY TO THE CEO. THEY WILL INITIALLY OVERSEE ONE DIRECT REPORT, ACCOUNTING MANAGER, AND OVERSEE A TEAM OF THREE TO FOUR ACCOUNTANTS. THE CANDIDATE WILL OWN ALL ASPECTS OF FINANCE FUNCTION, INCLUDING MONTH END CLOSE, ANNUAL AUDIT, FINANCIAL PLANNING AND ANALYSIS, AND WILL BE AN INTEGRAL MEMBER TO THE STRATEGIC FINANCE INITIATIVES.\nTHE INITIAL KEY OBJECTIVES ARE TO HELP BUILD OUT FROM SCRATCH AND MAINTAIN THE FOLLOWING:REPORTING PACKAGE – ANALYZE MONTHLY FINANCIAL PERFORMANCE (ACTUALS TO BUDGET TO FORECAST) AND OFFER MD&A TO THE EXECUTIVE TEAM IN PPT FORMATMODEL & SEASONALITY MODEL – BUILDS REVENUE BY CUSTOMER SEGMENT BY MONTH FOR FORECASTING AND REPORTING NEEDSBUDGET – WORK COLLABORATIVELY WITH DEPARTMENT HEADS TO DESIGN AND IMPLEMENT A BEST-IN-CLASS ANNUAL BUDGET PROCESSFORECASTING - PERIODIC FORECASTING OF REVENUE, COSTS, AND HEADCOUNTSSTATEMENT MODEL – CONSTRUCTS ALL 3 STATEMENTS FROM THE TRIAL BALANCEAD HOC MODELS/REPORTS AS NEEDED (EX: BUILD A PROFITABILITY MODEL FOR A NEW PRODUCT LAUNCH)\nTHE IDEAL CANDIDATE:THE IDEAL CANDIDATE WILL BE A TECH-SAVVY FINANCE PROFESSIONAL WITH 10-15+ YEARS OF EXPERIENCE. THEY TAKE A LOGICAL, DATA-CENTRIC APPROACH TO PROBLEMS AND HAVE PROGRESSIVE FINANCIAL PLANNING AND ANALYSIS EXPERIENCE IN A FAST-PACED, MEDIUM-SIZED DTC FOOD AND BEVERAGE CONSUMER PACKAGED GOODS (\"CPG\") MANUFACTURING COMPANY. THEY ARE EXPERIENCED IN BUILDING 3-STATEMENT MODELS, REPORTING PACKAGES, BUDGETS, AND REVENUE MODELS FROM SCRATCH (VS. MAINTAINING THEM). THEY ALSO HAVE EXPERIENCE PARTNERING WITH BUSINESS AND MARKETING LEADERS TO DEFINE, MEASURE, AND IMPLEMENT D2C KPIS/UNIT ECONOMICS.(CAC, GM, RETURN ON AD SPEND (ROAS), PRODUCT AND CONTRIBUTION MARGINS, FINANCIAL STATEMENT MARGINS ETC.)). THEY WILL HELP DRIVE AUTOMATION AND EFFICIENCY VIA TECHNOLOGY AND HAVE EXPERIENCE USING (NETSUITE) AND BUSINESS INTELLIGENCE (\"BI\") POWER BI. EXPERIENCE WITH XERO, AND AVALARA ARE ALSO A PLUS.\nTHEY SHOULD ALSO HAVE BEST-IN-CLASS EXPERIENCE IN A RECOGNIZED FIRM (E.G., PUBLIC ACCOUNTING OR CONSULTING) OR RECOGNIZED COMPANY OR EXPERIENCE WORKING WITH INSTITUTIONAL INVESTORS (PE-BACKED COMPANIES).\nTHE CANDIDATE SHOULD POSSESS ABOVE-AVERAGE SKILLS IN EXCEL (SUMIFS, PIVOTS, XLOOKUP, INDEX MATCH, ETC..), AND BE EXPERIENCED IN WORKING WITH LARGE DATA SETS AND MULTIFACETED SPREADSHEETS.\nCORE DUTIES/RESPONSIBILITIES:· HEAD OF FINANCE - OVERSEE THE FINANCE FUNCTION· SERVE THE ORGANIZATION AS A SUBJECT MATTER EXPERT IN CONSUMER PACKAGED GOODS INDUSTRY· SERVE AS A BUSINESS PARTNER TO THE LEADERSHIP TEAM OF THE COMPANY BY OWNING THE FINANCIAL STRATEGY, PLANNING AND PROJECTION, INCLUDING THE FINANCIAL MODEL AND KPIS OF THE BUSINESS· LEAD THE MONTH-END CLOSE PROCESS AND FIRST GAAP AUDIT.· DESIGN, IMPLEMENT, AND MAINTAIN THE MONTHLY REPORTING PACKAGE, WHICH WILL INCLUDE KEY FINANCIAL AND OPERATING METRICS· DESIGN, IMPLEMENT, AND MAINTAIN THE 3 STATEMENT MODEL· DESIGN, IMPLEMENT, AND MAINTAIN THE REVENUE AND PRODUCT PROFITABILITY MODELS· DESIGN, IMPLEMENT, AND MAINTAIN THE ANNUAL ANNUAL BUDGET AND HOLD MONTHLY BUDGET VARIANCE MEETINGS WITH KEY STAKEHOLDERS.· WORK CLOSELY WITH LEADERSHIP AND MARKETING TO IDENTIFY, DESIGN, IMPLEMENT AND MAINTAIN PERIODIC (DAILY, WEEKLY, MONTHLY, ETC..) KPIS.· AUTOMATE AND OPTIMIZE THE FINANCIAL REPORTING PROCESSES BY LEVERAGING TECHNOLOGY.\nREQUIRED QUALIFICATIONS:· MINIMUM OF TWO YEARS EXPERIENCE IN A DTC FOOD AND BEVERAGE CONSUMER PACKAGED GOODS (\"CPG\") MANUFACTURING COMPANY.· MINIMUM OF TEN-FIFTEEN YEARS OF PROGRESSIVE FINANCIAL PLANNING AND ANALYSIS EXPERIENCE.· EXPERIENCE OWNING THE ENTIRE FINANCIALS STATEMENT PREPARATION PROCESS (INCOME STATEMENT AND BALANCE SHEET)· ABLE TO BUILD COMPLEX FINANCIAL MODELS· TWO YEARS OF EXPERIENCE WORKING WITH NETSUITE· TWO YEARS OF EXPERIENCE WORKING WITH POWER BI· TWO YEARS EXPERIENCE WITH CRMS· EXPERIENCE IMPLEMENTING AND MAINTAINING MONTHLY REPORTING PACKAGES.· EXPERIENCE SUPPORTING THE SALES AND MARKETING FUNCTION BY IDENTIFYING AND PRODUCING KEY KPIS (CAC) AND CALCULATING COMPENSATION PLANS. USING BUSINESS INTELLIGENCE (\"BI\") TOOLS, AND DISCIPLINED DATA SETS TO ACHIEVE THE FORMER.· EXPERIENCE IMPLEMENTING AND MAINTAINING MONTHLY REPORTING PACKAGES.· BEST-IN-CLASS EXPERIENCE IN A RECOGNIZED FIRM (E.G., PUBLIC ACCOUNTING OR CONSULTING) OR FORTUNE RECOGNIZED COMPANY.· POSSESS ABOVE-AVERAGE SKILLS IN EXCEL (SUMIFS, PIVOTS, XLOOKUP, INDEX MATCH, ETC..) AND EXPERIENCE WORKING WITH LARGE DATA SETS AND MULTIFACETED SPREADSHEETS.· EXCELLENT COMMUNICATION, WRITING, AND RELATIONSHIP-BUILDING SKILLS.\nOPTIONAL QUALIFICATIONS:· E-COMMERCE/SAAS EXPERIENCE· PYTHON/R OR OTHER PROGRAMMING LANGUAGE\nEDUCATIONAL REQUIREMENTS:· BACHELOR'S DEGREE IN ACCOUNTING, FINANCE OR EQUIVALENT· CFA, CPA OR ADVANCED DEGREE IS PREFERRED\nBENEFITS AND COMPENSATION:· $200- $250K· HEALTHCARE BENEFITS, DENTAL AND VISION, 401K",
    "job_skill_set": [
      "Excel",
      "communication",
      "relationship building",
      "problem solving",
      "self-motivation",
      "teamwork",
      "financial planning and analysis",
      "financial modeling",
      "budgeting",
      "reporting packages",
      "GAAP",
      "Power BI",
      "Netsuite",
      "data analysis",
      "DTC KPIs",
      "consumer packaged goods (CPG) experience",
      "automation",
      "CRM systems",
      "programming (Python/R)",
      "leadership",
      "adaptability",
      "strategic thinking"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "and",
      "automation",
      "bi",
      "budgeting",
      "building",
      "communication",
      "consumer",
      "cpg",
      "crm",
      "data",
      "dtc",
      "excel",
      "experience",
      "finance",
      "financial",
      "gaap",
      "goods",
      "kpis",
      "leadership",
      "modeling",
      "netsuite",
      "packaged",
      "packages",
      "planning",
      "power",
      "president",
      "problem",
      "programming",
      "pythonr",
      "relationship",
      "reporting",
      "selfmotivation",
      "solving",
      "strategic",
      "systems",
      "teamwork",
      "thinking",
      "vice"
    ]
  },
  {
    "job_id": "3903475810",
    "job_title": "Corporate Director of Finance",
    "category": "FINANCE",
    "job_description": "DRIFTWOOD HOSPITALITY MANAGEMENT’S COMPANY CULTURE EMPOWERS OUR ASSOCIATES TO TAKE INITIATIVE, BE PROACTIVE, AND CONTRIBUTE TO THE SUCCESS OF THEIR PROPERTY WITH WELL-DEFINED STRATEGIES AND OBJECTIVES. DRIFTWOOD HOSPITALITY MANAGEMENT IS RENOWNED FOR OUR FULLY INTEGRATED APPROACH TO HOSPITALITY SERVICES — ALL WITH OUTSTANDING CLIENT SERVICE. OUR TEAM IS MADE UP OF THE BEST TALENT IN THE HOSPITALITY INDUSTRY, DOWN TO EVERY EMPLOYEE, POSITION, AND HOTEL.\n\nJOB SUMMARY\n\nLEADS DRIFTWOOD HOSPITALITY MANAGEMENT PORTFOLIO OF HOTELS’ ACCOUNTING CONTROLLER, CORPORATE ACCOUNTING STAFF AND OUTSOURCING COMPANY TO ENSURE ACCURATE, TRANSPARENT, AND TIMELY FINANCIAL REPORTING, BUDGETING/FORECASTING, ASSET, AND LIABILITY RECONCILIATION.\n\nESSENTIAL JOB FUNCTIONS\n\nTHIS DESCRIPTION IS A SUMMARY OF PRIMARY RESPONSIBILITIES AND QUALIFICATIONS. THE JOB DESCRIPTION IS NOT INTENDED TO INCLUDE ALL DUTIES OR QUALIFICATIONS THAT MAY BE REQUIRED NOW OR IN THE FUTURE.\n\nESSENTIAL FUNCTIONS\n\n WORK COLLABORATIVELY WITH THE CORPORATE CONTROLLER, SENIOR MANAGER AND EXECUTIVES, AND OTHER OPERATIONAL LEADERS TO DETERMINE OPPORTUNITIES TO FINE TUNE PROCESSES THAT WILL DRIVE BOTH SHORT-TERM AND LONG-TERM IMPROVEMENTS TO THE ACCURACY AND TIMELINESS OF FINANCIAL REPORTING.  RESPONSIBLE FOR ENSURING ACCURATE AND TIMELY PREPARATION OF MONTHLY FINANCIAL REPORTING PACKAGES IN CONFORMITY WITH APPROPRIATE ACCOUNTING STANDARDS.  MONTHLY REVIEW OF HOTEL’S ACCOUNTS RECEIVABLE AND PREPARING APPROPRIATE BAD DEBT/ALLOWANCE ENTRIES.  WORK DIRECTLY WITH EXTERNAL AUDITORS AND TAX PREPARERS TO ENSURE TIMELY DELIVERY OF ANNUAL AUDITS AND TAX RETURNS.  PROVIDE DETAIL PERFORMANCE FEEDBACK ON A MONTHLY BASIS FOR HIS/HER DIRECT TEAM, AND ALL OTHER PERSONNEL RELATED TO THE MONTHLY FINANCIAL STATEMENT CLOSING PROCESS.  REVIEW, RECOMMEND AND DRIVE FINANCIAL REPORTING PROCESS IMPROVEMENTS.  ENSURE ALL DEADLINES ARE SCHEDULED AND MET ON A WEEKLY, MONTHLY AND YEARLY BASIS (E.G., PAYMENT OF SALES AND OCCUPANCY TAXES, PAYMENT OF PROPERTY TAXES, ETC.)  SUPPORT, TRAIN AND COACH CORPORATE ACCOUNTING TEAM AND HOTEL CONTROLLERS TO ENSURE ACCURATE AND TIMELY PREPARATION OF FINANCIAL STATEMENTS, ACCOUNTS RECONCILIATIONS, FORECAST AND BUDGETS.  WEEKLY MEETINGS WITH EXECUTIVE TEAM.  ASSIST WITH THE PREPARATION AND ANALYSIS OF CASH FLOW FORECASTS.  LEAD/PARTICIPATE IN ON-BOARDING AND TRAINING FOR NEW ACCOUNTING HIRES (AT CORPORATE AND IN FIELD).  DEVELOP, MONITOR AND REPORTING OF COMPLIANCE ON INTERNAL CONTROLS.  MAXIMIZE EFFORTS TOWARDS PRODUCTIVITY, IDENTIFY PROBLEM AREAS AND ASSIST IN FINDING AND IMPLEMENTING THEIR SOLUTIONS.  ANALYZE FINANCIAL DATA AND OPERATIONS IN ORDER TO ASSIST AND ADVISE MANAGEMENT IN MAINTAINING THE HOTELS’ FINANCIAL OBJECTIVES.  PERFORM OTHER DUTIES AS ASSIGNED BY EXECUTIVE TEAM. \n\nKNOWLEDGE, SKILLS & ABILITIES\n\n10 YEARS RECOMMENDED OF RELATED PROGRESSIVE EXPERIENCE IN HOTEL ACCOUNTING OR RELATED FIELD; 4-YEAR COLLEGE DEGREE WITH AN ACCOUNTING/ FINANCE CONCENTRATION AND A MINIMUM OF 6-YEARS OF RELATED PROGRESSIVE EXPERIENCE.\n\nSTRONG KNOWLEDGE AND ABILITY READING, ANALYZING, AND UNDERSTANDING FINANCIAL STATEMENTS, LOAN DOCUMENTS, LEASE AGREEMENTS AND CONTRACTS.\n\nPRIOR OVERSIGHT OF ACCOUNTING TEAMS.\n\nABILITY TO MANAGE INTERNAL TEAMMATES AT ALL LEVELS OF THE ORGANIZATION.\n\nPROACTIVE, INDEPENDENT, FORWARD-THINKING, TRUSTWORTHY, AND HANDS-ON FINANCE EXECUTIVE.\n\nA DYNAMIC TEAM PLAYER WHO IS A QUICK STUDY AND CAN THINK CREATIVELY AND EFFECTIVELY CHALLENGING EXISTING PRACTICES.\n\nSTRONG WRITTEN AND ORAL COMMUNICATION SKILLS.\n\nSTRONG ORGANIZATIONAL AND PROJECT MANAGEMENT SKILLS.\n\nPHYSICAL DEMANDS\n\nFREQUENT WALKING, STANDING, SITTING, HEARING, TALKING, SMILING. LIFTING, PUSHING AND PULLING OF OBJECTS WEIGHING UP TO FIFTY (50) POUNDS.\n\nBENEFITS\n\n401(K)DENTAL INSURANCEDISABILITY INSURANCEEMPLOYEE ASSISTANCE PROGRAMFLEXIBLE SPENDING ACCOUNTHEALTH INSURANCELIFE INSURANCEPAID TIME OFFVISION INSURANCEROOM DISCOUNTSEMPLOYEE FOOD AND BEVERAGE DISCOUNTS\n\nEEO: DRIFTWOOD HOSPITALITY MANAGEMENT IS COMMITTED TO A DIVERSE AND INCLUSIVE WORKPLACE. WE ARE AN EQUAL OPPORTUNITY EMPLOYER. QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, NATIONAL ORIGIN, AGE, DISABILITY, PREGNANCY, GENETIC INFORMATION, PROTECTED VETERAN STATUS, OR ANY OTHER LEGALLY PROTECTED STATUS.\n\nAPPLY NOW",
    "job_skill_set": [
      "financial reporting",
      "budgeting",
      "accounting standards",
      "accounts reconciliation",
      "financial analysis",
      "internal controls",
      "team management",
      "auditing",
      "financial statements analysis",
      "communication",
      "teamwork",
      "problem solving",
      "leadership",
      "organizational skills",
      "proactivity",
      "independence",
      "trustworthiness",
      "project management",
      "forecasting",
      "cash flow forecasting",
      "contract management",
      "creativity"
    ],
    "short_keywords": [
      "accounting",
      "accounts",
      "analysis",
      "auditing",
      "budgeting",
      "cash",
      "communication",
      "contract",
      "controls",
      "corporate",
      "creativity",
      "director",
      "finance",
      "financial",
      "flow",
      "forecasting",
      "independence",
      "internal",
      "leadership",
      "management",
      "of",
      "organizational",
      "proactivity",
      "problem",
      "project",
      "reconciliation",
      "reporting",
      "skills",
      "solving",
      "standards",
      "statements",
      "team",
      "teamwork",
      "trustworthiness"
    ]
  },
  {
    "job_id": "3903494665",
    "job_title": "Corporate Finance Associate",
    "category": "FINANCE",
    "job_description": "PEOPLE. RELATIONSHIPS. TECHNOLOGY.\nTHESE ARE THE THREE PILLARS THAT HAVE MADE OUR GROUP AMONG THE FASTEST-GROWING INDUSTRIAL REAL ESTATE PRIVATE EQUITY COMPANIES, AND ONE OF THE 50 LARGEST OWNERS IN THE U.S.\nPEOPLE: WE ARE CONSTANTLY SEEKING DRIVEN AND INTELLIGENT PEOPLE TO HELP FACILITATE OUR EXPONENTIAL GROWTH. THE PEOPLE IN OUR COMPANY FEATURE A SPECIFIC CULTURE AND DNA – WE MOVE FAST, ARE VERY AGILE, BUT ALSO VERY THOROUGH AND DATA DRIVEN. WORKING AT FAROPOINT WILL BE IN A DYNAMIC ENVIRONMENT THAT WOULD BE EXCITING AND HIGHLY BENEFICIAL FOR YOUR CAREER.\nRELATIONSHIPS: OUR EMPLOYEES, PARTNERS, INVESTORS, AND OTHER STAKEHOLDERS ARE ALWAYS TOP OF MIND. SINCE WE ARE CONSISTENTLY GROWING, THERE ARE ALWAYS NEW OPPORTUNITIES FOR CAREER ADVANCEMENT AND NEW RELATIONSHIPS TO FOSTER. THE SHOES THAT NEED FILLING JUST GET BIGGER AND BIGGER. ALL YOU NEED TO DO IS DEMONSTRATE INITIATIVE AND LEAD, AND WE WILL BE RIGHT THERE NEXT TO YOU TO SUPPORT AND HELP THINK THROUGH COMPLEX CHALLENGES. WITHIN A RELATIVELY SHORT PERIOD OF TIME, YOU WILL WITNESS THAT WE TRUST YOUR JUDGMENT TO MAKE BIG DECISIONS ON BEHALF OF FAROPOINT AND OUR BUSINESS PARTNERS, AS WELL AS TAKE CHARGE OF LARGE PROJECTS AND INITIATIVES. THAT IS THE KIND OF RELATIONSHIP WE HAVE WITH OUR EMPLOYEES. WE KNOW OUR EXPECTATIONS ARE HIGH, AND WE OFFER A COMPETITIVE COMPENSATION PACKAGE ACCORDINGLY.\nTECHNOLOGY: WE CONTINUOUSLY IMPLEMENT TECHNOLOGICAL SOLUTIONS TO INCREASE EFFICIENCY, TRANSPARENCY, AND ACCURACY ACROSS OUR BUSINESS UNITS. REAL ESTATE IS CONSIDERED A ‘CONSERVATIVE’ INDUSTRY WITH COMMON PRACTICES THAT DO NOT ALWAYS FIT 21ST CENTURY NEEDS. WORKING AT FAROPOINT WILL ALLOW YOU TO GAIN EXPOSURE TO NEW, CUTTING-EDGE TECHNOLOGY TOOLS THAT PROVIDE US THE ABILITY TO RUN FAST, STREAMLINE PROCESSES, AND ADD VALUE TO ALL STAKEHOLDERSTHE IDEAL CANDIDATE WILL BE RESPONSIBLE FOR ALL OPERATIONAL AND FINANCIAL ASPECTS OF PROPERTIES INCLUDING BUDGET CONTROL AND MAINTENANCE REQUESTS. YOU WILL ACT AS THE SENIOR MANAGER AND SUPERVISE ALL RELEVANT PERSONNEL.\nJOB SUMMARYWE ARE LOOKING FOR A ASSOCIATE TO SUPPORT ALL ASPECTS OF STRATEGIC DECISION-MAKING, FINANCIAL FORECASTING, PLANNING, AND ANALYTICS LED BY THE CORPORATE FINANCE TEAM.THE CORPORATE FINANCE TEAM TAKES A SIGNIFICANT ROLE IN ANALYZING FUND PERFORMANCE, PORTFOLIO ANALYTICS, DEBT SYNDICATION & STRUCTURING, FUND FORMATION, DEAL STRUCTURING, STRATEGIC PLANNING, DEVELOPING BUSINESS INSIGHTS, AND REPORTING TO THE C-SUITE, BOARD OF DIRECTORS, AND INVESTORS. YOU WILL BRING YOUR EXPERT ANALYTICAL ABILITY AND FINANCIAL MODELING SKILLS TO PROVIDE KEY INSIGHTS, RECOGNIZE KEY OPPORTUNITIES, AND DRIVE STRATEGIC INITIATIVES FORWARD.\nRESPONSIBILITIES:SUPPORT DECISION-MAKING BY BUILDING AND PRESENTING COMPLEX FINANCIAL MODELS ANALYZING FUND AND PORTFOLIO PERFORMANCEFINANCIAL ANALYSIS AND DELIVERY OF KPI’S AND VARIOUS MANAGEMENT REPORTSPRODUCE CRITICAL INTERNAL AND EXTERNAL DELIVERABLES (E.G., EARNINGS RELEASES, FUND INVESTOR RELATIONS REPORTS, ASSET-LEVEL PERFORMANCE METRICS, FUND MODELS) FOR PRESENTATION TO C-SUITEENSURE DATA INTEGRITY, ACCURACY, AND TIMELINESS IN ALL FINANCIAL REPORTING AND PRESENTATIONSCOLLABORATE WITH SENIOR MANAGEMENT ON SPECIAL HIGH-IMPACT STRATEGIC PROJECTS\nCANDIDATE PROFILE:UNDERGRADUATE DEGREE IN FINANCE/BUSINESS OR STEM FIELD3-5 YEARS OF PROFESSIONAL WORK EXPERIENCE REQUIRED - PRIVATE EQUITY EXPERIENCE IS A PLUSEXCEPTIONALLY HIGH LEVEL OF EXCEL SKILLS WITH A FOCUS ON FINANCIAL MODELING IS REQUIREDEXCEPTIONAL DATE VISUALIZATION VIA POWERPOINT IS REQUIREDSTRONG QUANTITATIVE, CRITICAL THINKING, AND ANALYTICAL PROBLEM-SOLVING SKILLS REQUIREDHIGH LEARNING AGILITY WITH AN ABILITY TO MANAGE MULTIPLE PRIORITIES WHILE WORKING IN A FAST-PACED AND DYNAMIC ENVIRONMENTDEMONSTRATES ATTENTION TO DETAIL AND A HIGH LEVEL OF ACCURACYSELF-STARTER WHO INDEPENDENTLY DRIVES PROJECTS TO COMPLETION BY SELF-SOURCING INFORMATION AND LEVERAGING ALL AVAILABLE RESOURCESKNOWLEDGE OF FINANCE CONCEPTS INCLUDING AN UNDERSTANDING OF FINANCIAL STATEMENTSPERSONAL AND PROFESSIONAL INTEGRITY OF THE HIGHEST ORDER REQUIRED\nOUR BENEFITSCOMPETITIVE BASE SALARYHEALTH INSURANCE OPTIONS INCLUDING MEDICAL, DENTAL, VISION, LIFE, SHORT-TERM DISABILITY AND LONG-TERM DISABILITY, WITH MAJORITY OF PREMIUMS COVERED BY FAROPOINT401(K) WITH EMPLOYER MATCH\nEQUAL OPPORTUNITY EMPLOYERFAROPOINT IS PROUD TO BE AN EQUAL OPPORTUNITY EMPLOYER. WE VALUE DIVERSITY, AND WE DO NOT DISCRIMINATE ON THE BASIS OF RACE, RELIGION, COLOR, NATIONAL ORIGIN, GENDER, SEXUAL ORIENTATION, AGE, MARITAL STATUS, VETERAN STATUS, PARENTAL STATUS, DISABILITY STATUS, OR ANY OTHER STATUS PROTECTED BY LOCAL LAW. WE BELIEVE THAT OUR WORK IS BETTER AND OUR COMPANY CULTURE IS IMPROVED WHEN WE ENCOURAGE, SUPPORT, AND RESPECT THE DIFFERENT SKILLS AND EXPERIENCES REPRESENTED WITHIN OUR WORKFORCE.",
    "job_skill_set": [
      "financial analysis",
      "financial reporting",
      "financial statement analysis",
      "budget control",
      "critical thinking",
      "analytical problem-solving",
      "attention to detail",
      "learning agility",
      "initiative",
      "relationship building",
      "self-starter",
      "project management",
      "communication",
      "team collaboration",
      "financial modeling",
      "data visualization",
      "Excel",
      "quantitative analysis",
      "KPI delivery",
      "PowerPoint"
    ],
    "short_keywords": [
      "agility",
      "analysis",
      "analytical",
      "associate",
      "attention",
      "budget",
      "building",
      "collaboration",
      "communication",
      "control",
      "corporate",
      "critical",
      "data",
      "delivery",
      "detail",
      "excel",
      "finance",
      "financial",
      "initiative",
      "kpi",
      "learning",
      "management",
      "modeling",
      "powerpoint",
      "problemsolving",
      "project",
      "quantitative",
      "relationship",
      "reporting",
      "selfstarter",
      "statement",
      "team",
      "thinking",
      "to",
      "visualization"
    ]
  },
  {
    "job_id": "3904947096",
    "job_title": "Finance and Accounting Intern",
    "category": "FINANCE",
    "job_description": "MARKEM-IMAJE IS A TRUSTED WORLD MANUFACTURER OF PRODUCT IDENTIFICATION AND TRACEABILITY SOLUTIONS, OFFERING A FULL LINE OF RELIABLE AND INNOVATIVE INKJET, THERMAL TRANSFER, LASER, PRINT AND APPLY LABEL SYSTEMS. MARKEM-IMAJE DELIVERS FULLY INTEGRATED SOLUTIONS THAT ENABLE PRODUCT QUALITY AND SAFETY, REGULATORY AND RETAILER COMPLIANCE, BETTER PRODUCT RECALLS AND IMPROVED MANUFACTURING PROCESSES.\n\nWE ARE SEEKING A HIGHLY MOTIVATED AND TALENTED INDIVIDUAL TO JOIN OUR NORTH AMERICA AND MEXICO FINANCE CENTER OF EXCELLENCE TEAM AS A PAID INTERN. THE FINANCE AND ACCOUNTING INTERN FILLS A VALUABLE ROLE, AND THE INTERNSHIP PROGRAM IS BETWEEN TWELVE TO EIGHTEEN WEEKS, 30-40 HOURS WEEKY DEPENDING ON THE STUDENT'S AVAILABILITY AND POSSIBLE SCHOOL-COURSE CREDIT REQUIREMENTS. THE POSITION REQUIRES BUSINESS MAJORS WITH ACCOUNTING AND/OR FINANCE KNOWLEDGE WHO ARE LOOKING TO DEVELOP THEIR ANALYTICAL SKILLS AND ARE WILLING TO SUPPORT THE TEAM ON VARIOUS ASSIGNMENTS, INCLUDING SUPPORTING PROCESS DOCUMENTATION. THE STUDENT IS INTERESTED IN DEVELOPING PROBLEM-SOLVING SKILLS, ORGANIZATIONAL SKILLS, AND ATTENTION TO DETAIL AND HAS A GOOD WORK ETHIC AND THE ABILITY TO WORK WITH OTHERS.\n\nTHIS POSITION WILL ROTATE BETWEEN TEAMS, SUPPORTING DIFFERENT FUNCTIONS TO GAIN EXPERIENCE IN ACCOUNTING AND FINANCE, INCLUDING BOOKING JOURNAL ENTRIES, ACCOUNT RECONCILIATIONS, ACCRUALS, FINANCIAL PLANNING AND ANALYSIS, GENERAL LEDGER, TAX, ACCOUNTS PAYABLE, AND COLLECTION EFFORTS. THE INTERNSHIP PROGRAM SERVES AS A PIPELINE FOR POTENTIAL FUTURE TALENT WITH MARKEM-IMAJE.\n\nPOTENTIAL PROJECTS AND ASSIGNMENTS:\n\nFINANCIAL PLANNING AND ANALYSIS IN TECHNICAL OPERATIONS PERFORMING COST ROLLS AND GATHERING DATATAX EXEMPTION AND ANNUAL REPORTS/PROPERTY TAX REVIEWENTRY-LEVEL COLLECTIONS PROJECTSSPEAK TO CUSTOMERS ABOUT PAYMENTS, REFUNDS AND STATEMENTSASSIST IN THE SUPPORT OF THE MONTH-END ACCOUNTING CLOSE PROCESSENSURE PROPER CODING OF EXPENSES TO CORRECT ACCOUNTS AND DEPARTMENTSREVIEW/CODE PURCHASE ORDERS FOR CORRECT ACCOUNT DISTRIBUTIONASSISTING WITH RESEARCH, FILING, DATA ENTRY, AND RECORDING AND MAINTAINING ACCURATE AND COMPLETE FINANCIAL RECORDSCOLLABORATE WITH IN-HOUSE SHARED SERVICE CENTER TO HELP RESOLVE ISSUES RELATED TO PROCESSING BANKING AND CONCUR TRANSACTIONS, ACCOUNTING, AR, AP FUNCTIONS, ETC. AND HELP ENSURE EFFICIENCY AND PROPER FUNCTIONING OF OTC, BILLING, COLLECTION AND AP FUNCTIONS PARTICIPATE IN PROCESS IMPROVEMENT PROJECTSMEET WITH TEAM MEMBERS AND LEADERS WHO WILL SHARE THEIR INSIGHTS, REFLECT ON THEIR EXPERIENCES, AND HAVE A GENUINE INTEREST IN YOUR SUCCESSOTHER DUTIES AS ASSIGNED \n\nJOB REQUIREMENTS:\n\nMUST EITHER BE A RECENT GRADUATE OR IN THE PROCESS OF COMPLETING A BACHELOR’S OR MASTER’S DEGREE IN A BUSINESS MAJOR, PREFERABLY ACCOUNTING OR FINANCESATISFACTORY COMPLETION OF INTRODUCTORY ACCOUNTING COURSES AND A BASIC UNDERSTANDING OF ACCOUNTING AND FINANCIAL PRINCIPLES OR SOME LEVEL OF KNOWLEDGE OF FINANCE, ACCOUNTING, BUDGETING, AND GENERALLY ACCEPTED ACCOUNTING PRINCIPLESDEMONSTRATE INTEREST IN DEVELOPING ANALYTICAL AND PROBLEM-SOLVING SKILLSCOMFORTABLE ANALYZING DATA AND PREPARING REPORTSREQUIRES UNDERSTANDING OF WRITTEN AND VERBAL COMMUNICATION AND INTERPERSONAL SKILLSHAVE ORGANIZATION AND TIME MANAGEMENT SKILLS WITH THE ABILITY TO WORK WITHOUT DISTRACTIONPOSSESS AN APPRECIATION FOR CUSTOMER SERVICE SKILLSMUST BE A TEAM PLAYER, MOTIVATED TO LEARN, AND STRONGLY DESIRE TO TAKE ON A NEW CHALLENGE.MUST HAVE AT LEAST BEGINNER-LEVEL EXPERIENCE IN MICROSOFT OFFICE, WITH SOME EXPERIENCE WITH EXCEL, POWERPOINT, AND WORDACCOUNTING MAJORS STRONGLY ENCOURAGED TO APPLYHYBRID WORK MODE – REQUIRED TO BE IN THE OFFICE AT LEAST 3-5 DAYS A WEEK.\n\nTHE RIGHT CANDIDATE IF YOU ARE ALIGNED TO OUR VALUES AND CULTURE: \n\nCOLLABORATIVE ENTREPRENEURIAL SPIRIT WINNING THROUGH CUSTOMERS HIGH ETHICAL STANDARDS, OPENNESS AND TRUST EXPECTATIONS FOR RESULTS RESPECT AND VALUE PEOPLE \n\nIF YOU ARE A PASSIONATE AND DRIVEN INDIVIDUAL LOOKING TO GAIN REAL-WORLD EXPERIENCE AND MAKE A MEANINGFUL IMPACT, WE ENCOURAGE YOU TO APPLY FOR THIS EXCITING OPPORTUNITY.\n\nALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT DISCRIMINATION ON THE BASIS OF RACE, COLOUR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, AGE AND GENETIC INFORMATION.\n\nWORK ARRANGEMENT : HYBRID\n\nSALARY RANGE : -\n\nWE CONSIDER SEVERAL JOB-RELATED, NON-DISCRIMINATORY FACTORS WHEN DETERMINING THE PAY RATE FOR A POSITION, INCLUDING, BUT NOT LIMITED TO, THE POSITION’S RESPONSIBILITIES, A CANDIDATE’S WORK EXPERIENCE, A CANDIDATE’S EDUCATION/TRAINING, THE POSITION’S LOCATION, AND THE KEY SKILLS NEEDED FOR THE POSITION. PAY IS ONE OF THE TOTAL REWARDS THAT WE PROVIDE TO COMPENSATE AND RECOGNIZE EMPLOYEES FOR THEIR WORK.\n\nALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT DISCRIMINATION ON THE BASIS OF RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, PROTECTED VETERAN STATUS, DISABILITY, AGE, GENETIC INFORMATION, OR ANY OTHER FACTORS PROHIBITED BY LAW.\n\nATTENTION APPLICANTS: IF YOU ARE AN INDIVIDUAL WITH A DISABILITY AND REQUIRE A REASONABLE ACCOMMODATION TO COMPLETE ANY PART OF THE APPLICATION PROCESS, PLEASE LET US KNOW. LIKEWISE, IF YOU ARE LIMITED IN THE ABILITY TO ACCESS OR USE THIS ONLINE APPLICATION PROCESS AND NEED AN ALTERNATIVE METHOD FOR APPLYING, WE WILL DETERMINE AN ALTERNATE WAY FOR YOU TO APPLY. PLEASE CONTACT KEENEHR@MARKEM-IMAJE.COM FOR ASSISTANCE WITH AN ACCOMMODATION. KINDLY SPECIFY JOB REQUISITION NUMBER / JOB TITLE AND LOCATION IN RESPONSE.\n\nJOB FUNCTION :",
    "job_skill_set": [
      "accounting",
      "finance",
      "data analysis",
      "financial planning",
      "Microsoft Excel",
      "account reconciliations",
      "general ledger",
      "accounts payable",
      "problem solving",
      "organizational skills",
      "attention to detail",
      "communication",
      "teamwork",
      "customer service",
      "time management",
      "motivation to learn",
      "Microsoft PowerPoint",
      "Microsoft Word",
      "journal entries",
      "accruals",
      "tax",
      "collections",
      "process documentation"
    ],
    "short_keywords": [
      "account",
      "accounting",
      "accounts",
      "accruals",
      "analysis",
      "and",
      "attention",
      "collections",
      "communication",
      "customer",
      "data",
      "detail",
      "documentation",
      "entries",
      "excel",
      "finance",
      "financial",
      "general",
      "intern",
      "journal",
      "learn",
      "ledger",
      "management",
      "microsoft",
      "motivation",
      "organizational",
      "payable",
      "planning",
      "powerpoint",
      "problem",
      "process",
      "reconciliations",
      "service",
      "skills",
      "solving",
      "tax",
      "teamwork",
      "time",
      "to",
      "word"
    ]
  },
  {
    "job_id": "3905311409",
    "job_title": "Finance Associate",
    "category": "FINANCE",
    "job_description": "FIRM DETAILS:• 50B AUM• INVESTMENTS IN CREDIT, DISTRESSED DEBT, DIRECT LENDING, STRUCTURED PRODUCTS• IN OFFICE HYBRID SCHEDULE• VERY COMPETITIVE BENEFITS• 401K + MATCH• GORGEOUS MIDTOWN NYC OFFICE• OTHER FRINGE BENEFITS, SNACKS IN OFFICE, GYM MEMBERSHIPS, ETC.\nRESPONSIBILITIES: • PROVIDE ANALYTICAL SUPPORT TO INFORM INVESTMENT DECISIONS, INCLUDING NEW ASSET ACQUISITIONS, FINANCINGS, SALES, ETC • ACT AS A THOUGHT PARTNER TO THE DEAL TEAM, LEVERAGING MODELING, DATA, AND ANALYTICS • COORDINATE WITH INTERNAL AND EXTERNAL STAKEHOLDERS AROUND ALL KEY ASSET MANAGEMENT ACTIONS • WORK ON ALL ASPECTS OF THE PORTFOLIO, INCLUDING NEW DEALS, ONGOING PORTFOLIO WORK, AND ULTIMATELY VALUE REALIZATION • FOCUS ON MODELING, DATA ANALYTICS, INDUSTRY RESEARCH, AND INTERNAL/EXTERNAL REPORTING, ALL WITH THE GOAL OF OPTIMIZING INVESTMENT OUTCOMES • DEVELOP ANALYTICAL TOOLS TO ASSIST IN STRATEGY SETTING, RETURNS OPTIMIZATION, AND CAPITAL FORMATION • ATTEND BOARD MEETINGS, INDUSTRY EVENTS, ETC",
    "job_skill_set": [
      "financial modeling",
      "reporting",
      "communication",
      "teamwork",
      "problem solving",
      "stakeholder management",
      "strategic thinking",
      "adaptability",
      "data analytics",
      "portfolio management",
      "industry research",
      "capital formation",
      "analytical tools development"
    ],
    "short_keywords": [
      "adaptability",
      "analytical",
      "analytics",
      "associate",
      "capital",
      "communication",
      "data",
      "development",
      "finance",
      "financial",
      "formation",
      "industry",
      "management",
      "modeling",
      "portfolio",
      "problem",
      "reporting",
      "research",
      "solving",
      "stakeholder",
      "strategic",
      "teamwork",
      "thinking",
      "tools"
    ]
  },
  {
    "job_id": "3891255152",
    "job_title": "Director of Finance",
    "category": "FINANCE",
    "job_description": "ABOUT DEUX: DEUX IS A VENTURE-BACKED, BETTER-FOR-YOU SNACKS BRAND THAT BELIEVES GOOD-FOR-YOU SHOULD TASTE GOOD. DEUX’S PORTFOLIO INCLUDES DONUTS, COOKIE DOUGH, AND DRIP CHOCOLATE HAZELNUT SPREAD. OUR PRODUCTS ARE ALL VEGAN, GLUTEN FREE, AND BETWEEN 25-40% LESS SUGAR AND LESS CARBS THAN TRADITIONAL GROCERY STORE BRANDS. DEUX HAS A STRONG DIRECT-TO-CONSUMER PRESENCE, GIVEN ITS EMPHASIS ON CONTENT & INFLUENCER MARKETING AND THEIR VIRAL “COLLAB” MODEL. YOU CAN ALSO FIND THE PRODUCTS IN WHOLE FOODS, SPROUTS, TARGET, AND AT FOODSERVICE ACCOUNTS LIKE SMOOTHIE KING. OUR TEAM IS INCREDIBLY FUN, HARDWORKING, AND LOVES TO WIN. \nJOB DESCRIPTION: THE DIRECTOR OF FINANCE WILL MANAGE AND LEAD KEY STRATEGIC PROJECTS THAT DELIVER PROCESS IMPROVEMENTS TO THE FINANCE ORGANIZATION AT DEUX, OFTEN CROSS-FUNCTIONAL WITH OPERATIONS AND SALES. THE DIRECTOR OF FINANCE WILL PARTICIPATE IN FINANCIAL PLANNING AND ANALYSIS (FP&A) , TRACK BUSINESS AND PERFORMANCE INSIGHTS AND MANAGE THE COMPANY’S FINANCIAL STATEMENTS . THIS ROLE REQUIRES A STRONG ANALYTICAL MINDSET, EXCEPTIONAL LEADERSHIP ABILITIES, AND A DEEP UNDERSTANDING OF ACCOUNTING PRINCIPLES AND CORPORATE FINANCE.\nJOB RESPONSIBILITIES:LEAD THE DEVELOPMENT AND EXECUTION OF THE COMPANY'S FINANCIAL PLANNING PROCESS, ENSURING ALIGNMENT WITH OVERALL BUSINESS OBJECTIVES WITH MINIMAL GUIDANCECREATE AND OVERSEE THE ANNUAL BUDGETING PROCESS, WORKING CLOSELY WITH DEPARTMENT HEADS AND CEO TO DEVELOP ACCURATE AND REALISTIC BUDGETSWORK IN BILL.COM TO RECEIVE AND PROCESS INVOICES, UPDATE QUICKBOOKS, AND COORDINATE WITH VENDORS. IMPROVE THE ACCOUNTING MONTHLY CLOSE PROCESS AND SCOPE TO REDUCE CYCLE TIME AND IMPROVE EFFICIENCY UTILIZING ERP SYSTEM DEARMONITOR AND ANALYZE BUDGET VARIANCES, IDENTIFYING TRENDS AND RECOMMENDING CORRECTIVE ACTIONS TO ACHIEVE FINANCIAL TARGETCONDUCT COMPREHENSIVE FINANCIAL ANALYSIS, INCLUDING PROFITABILITY ANALYSIS, COST ANALYSIS, AND FINANCIAL PERFORMANCE METRICSPREPARE AND PRESENT FINANCIAL REPORTS AND PRESENTATIONS TO SENIOR MANAGEMENT AND INVESTORSPARTNER WITH THE BUSINESS TO DEFINE, OWN, AND DRIVE RELEVANT AND TIMELY KPI REPORTINGPROVIDE FINANCIAL SUPPORT FOR STRATEGIC INITIATIVES, NEW PRODUCT DEVELOPMENT, AND POTENTIAL ACQUISITIONS OR PARTNERSHIPSIMPROVE PROCESSES AND USE OF SYSTEMS TO AUTOMATE WORKASSESS AND IMPROVE THE MATURING INVENTORY PROCESS, REDUCING WASTE AND CREATING A MORE FINANCIALLY EFFICIENT PROCESS\nJOB REQUIREMENTS:ADVANCED PROFICIENCY IN FINANCIAL SOFTWARE (INCLUDING QUICKBOOKS) AND TOOLS, SUCH AS ERP SYSTEMS (DEAR), BUDGETING AND FORECASTING SOFTWARE, AND DATA VISUALIZATION TOOLS A MUSTCPG EXPERIENCE OR SPECIFIC COMMERCIAL EXPERIENCE IN THE FOOD INDUSTRY PREFERREDPROJECT MANAGEMENT EXPERIENCE PREFERREDEXCELLENT PRESENTATION, COMMUNICATION, AND FACILITATION SKILLSPROVEN ABILITY TO INTERACT EFFECTIVELY WITH MULTIPLE LEVELS OF THE ORGANIZATIONBACHELOR’S DEGREE IN ACCOUNTING, FINANCE, ECONOMICS, OR ENGINEERINGMINIMUM 7 YEARS OF FINANCE EXPERIENCE",
    "job_skill_set": [
      "project management",
      "leadership",
      "analytical mindset",
      "communication",
      "presentation skills",
      "problem solving",
      "financial planning and analysis (FP&A)",
      "accounting principles",
      "corporate finance",
      "budgeting",
      "financial software",
      "QuickBooks",
      "ERP systems",
      "data visualization tools",
      "financial analysis",
      "profitability analysis",
      "cost analysis",
      "financial reporting",
      "KPI reporting",
      "inventory management",
      "collaboration",
      "facilitation skills",
      "interpersonal skills"
    ],
    "short_keywords": [
      "accounting",
      "analysis",
      "analytical",
      "and",
      "budgeting",
      "collaboration",
      "communication",
      "corporate",
      "cost",
      "data",
      "director",
      "erp",
      "facilitation",
      "finance",
      "financial",
      "fpa",
      "interpersonal",
      "inventory",
      "kpi",
      "leadership",
      "management",
      "mindset",
      "of",
      "planning",
      "presentation",
      "principles",
      "problem",
      "profitability",
      "project",
      "quickbooks",
      "reporting",
      "skills",
      "software",
      "solving",
      "systems",
      "tools",
      "visualization"
    ]
  },
  {
    "job_id": "3904364464",
    "job_title": "Director of Finance - 24314",
    "category": "FINANCE",
    "job_description": "DIRECTOR OF FINANCE\n\nA WELL-ESTABLISHED TRAVEL COMPANY LOCATED IN BOSTON IS SEEKING AN EXPERIENCED DIRECTOR OF FINANCE TO JOIN THEIR ACCOUNTING AND FINANCE TEAM. THIS POSITION WILL BE RESPONSIBLE FOR THE DELIVERY OF COMPREHENSIVE FINANCIAL REPORTS AND ANALYSIS, AS WELL AS ASSISTING OTHER DEPARTMENTS WITHIN THE COMPANY FROM A FINANCIAL PERSPECTIVE. THIS IS A HYBRID POSITION.\n\nRESPONSIBILITIES INCLUDE BUT ARE NOT LIMITED TO: \n\nPARTNER WITH BRAND MARKETING LEADERS TO DRIVE AND SUPPORT ACTIONS TO BEAT ANNUAL FINANCIAL PLAN LEVERAGE ANALYSIS OF DIRECT SALES METRICS TO IDENTIFY TOP OPPORTUNITIES AND RISKS, RECOMMEND AND QUANTIFY ACTIONS TO IMPROVE DIRECT SALES P&L ATTEND WEEKLY MARKETING AND REVENUE MANAGEMENT MEETINGS AND MONTHLY FINANCE MEETINGS; PROVIDE P&L AND KPI UPDATES WITH A FOCUS ON RESULTS VS FINANCIAL PLAN AND CURRENT ACTION PLAN DEVELOP AND PROVIDE WEEKLY/MONTHLY REPORTING FOR BRAND PERFORMANCE, INCLUDING EACH OF THE OTHER INCOME ITEMS. PROVIDE LEADERSHIP AND SUPPORT THE ONGOING DEVELOPMENT AND PERFORMANCE OF FINANCE TEAM \n\nQUALIFICATIONS:\n\n8-12+ YEARS OF PROGRESSIVE CORPORATE FP&A EXPERIENCE BACHELOR’S DEGREE IN FINANCE, BUSINESS, ECONOMICS OR ACCOUNTING, ADVANCED DEGREE PREFERRED STRONG INTERPERSONAL SKILLS WITH CAPACITY TO INTERACT ACROSS ALL LEVELS OF THE ORGANIZATION \n\nIF YOU’RE INTERESTED IN LEARNING MORE ABOUT THIS OPPORTUNITY, PLEASE SUBMIT YOUR RESUME DIRECTLY TO TIM FITZGERALD AT TFITZGERALD@DALEYAA.COM.",
    "job_skill_set": [
      "financial reporting",
      "financial analysis",
      "FP&A",
      "P&L management",
      "KPI reporting",
      "data analysis",
      "budgeting",
      "accounting principles",
      "advanced degree in finance",
      "interpersonal skills",
      "leadership",
      "communication",
      "collaboration",
      "problem solving",
      "strategic thinking"
    ],
    "short_keywords": [
      "24314",
      "accounting",
      "advanced",
      "analysis",
      "budgeting",
      "collaboration",
      "communication",
      "data",
      "degree",
      "director",
      "finance",
      "financial",
      "fpa",
      "in",
      "interpersonal",
      "kpi",
      "leadership",
      "management",
      "of",
      "pl",
      "principles",
      "problem",
      "reporting",
      "skills",
      "solving",
      "strategic",
      "thinking"
    ]
  },
  {
    "job_id": "3900950809",
    "job_title": "Finance Analyst II",
    "category": "FINANCE",
    "job_description": "YOU COULD BE THE ONE WHO CHANGES EVERYTHING FOR OUR 28 MILLION MEMBERS. CENTENE IS TRANSFORMING THE HEALTH OF OUR COMMUNITIES, ONE PERSON AT A TIME. AS A DIVERSIFIED, NATIONAL ORGANIZATION, YOU’LL HAVE ACCESS TO COMPETITIVE BENEFITS INCLUDING A FRESH PERSPECTIVE ON WORKPLACE FLEXIBILITY.\n\nAPPLICANTS FOR THIS ROLE WILL HAVE THE FLEXIBILITY TO WORK REMOTELY ANYWHERE IN THE CONTINENTAL UNITED STATES.\n\nPOSITION PURPOSE COMPILE AND ANALYZE FINANCIAL INFORMATION FOR THE COMPANY.\n\nDEVELOP INTEGRATED REVENUE/EXPENSE ANALYSES, PROJECTIONS, REPORTS, AND PRESENTATIONS.CREATE AND ANALYZE MONTHLY, QUARTERLY, AND ANNUAL REPORTS AND ENSURES FINANCIAL INFORMATION HAS BEEN RECORDED ACCURATELY.IDENTIFY TRENDS AND DEVELOPMENTS IN COMPETITIVE ENVIRONMENTS AND PRESENTS FINDINGS TO SENIOR MANAGEMENT.PERFORM FINANCIAL FORECASTING AND RECONCILIATION OF INTERNAL ACCOUNTS.\n\nEDUCATION/EXPERIENCE\n\nBACHELOR'S DEGREE OR EQUIVALENT EXPERIENCE.2+ YEARS OF FINANCIAL OR DATA ANALYSIS EXPERIENCE.\n\nPAY RANGE $54,000.00 - $97,100.00 PER YEAR\n\nCENTENE OFFERS A COMPREHENSIVE BENEFITS PACKAGE INCLUDING COMPETITIVE PAY, HEALTH INSURANCE, 401K AND STOCK PURCHASE PLANS, TUITION REIMBURSEMENT, PAID TIME OFF PLUS HOLIDAYS, AND A FLEXIBLE APPROACH TO WORK WITH REMOTE, HYBRID, FIELD OR OFFICE WORK SCHEDULES. ACTUAL PAY WILL BE ADJUSTED BASED ON AN INDIVIDUAL'S SKILLS, EXPERIENCE, EDUCATION, AND OTHER JOB-RELATED FACTORS PERMITTED BY LAW. TOTAL COMPENSATION MAY ALSO INCLUDE ADDITIONAL FORMS OF INCENTIVES.\n\nCENTENE IS AN EQUAL OPPORTUNITY EMPLOYER THAT IS COMMITTED TO DIVERSITY, AND VALUES THE WAYS IN WHICH WE ARE DIFFERENT. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, VETERAN STATUS, OR OTHER CHARACTERISTIC PROTECTED BY APPLICABLE LAW.",
    "job_skill_set": [
      "financial analysis",
      "data analysis",
      "reporting",
      "expense analysis",
      "reconciliation",
      "trend analysis",
      "communication",
      "presentation skills",
      "problem solving",
      "attention to detail",
      "flexibility",
      "teamwork",
      "financial forecasting",
      "revenue analysis"
    ],
    "short_keywords": [
      "analysis",
      "analyst",
      "attention",
      "communication",
      "data",
      "detail",
      "expense",
      "finance",
      "financial",
      "flexibility",
      "forecasting",
      "ii",
      "presentation",
      "problem",
      "reconciliation",
      "reporting",
      "revenue",
      "skills",
      "solving",
      "teamwork",
      "to",
      "trend"
    ]
  },
  {
    "job_id": "3902821348",
    "job_title": "Vice President of Finance / CFO",
    "category": "FINANCE",
    "job_description": "THIS AINT YOUR MOMMA'S SANDWICH SHOP! IKE'S LOVE AND SANDWICHES IS LOOKING FOR A VICE PRESIDENT OF FINANCE / CFO TO JOIN OUR TEAM IN BEAUTIFUL LONG BEACH, CA. \nTHIS EXECUTIVE LEVEL EXEMPT POSITION PERFORMS A WIDE VARIETY OF DUTIES INCLUDING OVERSEEING THE FINANCIAL ASPECTS OF THE BUSINESS; PROVIDING STRATEGIC GUIDANCE TO DRIVE PROFITABILITY AND DRIVE SUSTAINABLE GROWTH. THIS ROLE WILL BE PIVOTAL IN SHAPING THE FINANCIAL STRATEGY OF THE COMPANY, MANAGING BUDGETS, AND INCURRING REGULATORY COMPLIANCE IN A MULTI-STATE, MULTI-UNIT, QUICK SERVICE RESTAURANT CONCEPT. \nTHIS IS AN IN-OFFICE, FULL-TIME POSITION, REPORTING TO OUR CORPORATE OFFICE IN LONG BEACH, CA. THERE IS THE OPTION TO WORK REMOTELY DURING BUSINESS HOURS ON FRIDAYS. \nESSENTIAL FUNCTIONS \nTHE EXAMPLES OF FUNCTIONS LISTED IN THIS JOB DESCRIPTION ARE REPRESENTATIVE, BUT NOT NECESSARILY EXHAUSTIVE, OF ANY ONE POSITION IN THIS JOB CLASSIFICATION. MANAGEMENT MAY ASSIGN OTHER FUNCTIONS NOT LISTED HEREIN AT ITS SOLE DISCRETION. \nFINANCIAL PLANNING AND ANALYSISDEVELOP COMPREHENSIVE FINANCIAL PLANS, FORECASTS, AND BUDGETS ALIGNED WITH THE OBJECTIVES OF THE BUSINESS. REGULAR ANALYSIS OF FINANCIAL PERFORMANCE OF THE COMPANY TO IDENTIFY AREAS FOR IMPROVEMENT AND OPPORTUNITIES FOR OPTIMIZING COST, AS WELL AS IDENTIFYING MARKET TRENDS AND RISK IN THE QUICK SERVICE RESTAURANT INDUSTRY. \nFINANCIAL REPORTING AND COMPLIANCEPREPARATION OF ACCURATE FINANCIAL REPORTS INCLUDING INCOME STATEMENTS, BALANCE, SHEETS, AND CASH FLOW STATEMENTS IN COMPLIANCE WITH REGULATORY STANDARDS. CASH FLOW MANAGEMENTMANAGE CASH FLOW AND LIQUIDITY.MANAGE WORKING CAPITAL SUPPORTING THE NEEDS OF THE OPERATION AND INVESTMENT INITIATIVES. DEVELOP STRATEGIES TO MINIMIZE FINANCIAL RISK AND OPTIMIZE CASH RESERVES. \nFINANCIAL CONTROLS AND POLICIES MAINTAIN INTERNAL CONTROLS AND FINANCIAL POLICIES TO SAFEGUARD ASSETS, PREVENT FRAUD, AND MITIGATE FINANCIAL RISKS. ENSURE INTEGRITY IN FINANCIAL REPORTING FROM DIRECT REPORTS. ENSURE COMPLIANCE WITH REGULATORY REQUIREMENTS, INCLUDING CONSULTING WITH REGULATORY AUTHORITIES ON BEHALF OF THE COMPANY.\nINVESTOR RELATIONS AND CAPITAL ALLOCATION COLLABORATE WITH INVESTORS AND LENDERS TO STRATEGIZE AND FACILITATE GROWTH AND COMMUNICATE FINANCIAL PERFORMANCE. EVALUATE INVESTMENT OPPORTUNITIES INCLUDING LICENSING AND ACQUISITIONS.\nRISK MANAGEMENT ASSESS AND MITIGATE FINANCIAL RISKS IN THE QUICK SERVICE RESTAURANT INDUSTRY AND DEVELOP RISK MANAGEMENT STRATEGIES. \nLEADERSHIP AND DEVELOPMENT LEAD AND DEVELOP A COMBINATION INTERNAL AND EXTERNAL FINANCE TEAM INTO CONTINUAL IMPROVEMENT AND PROFESSIONAL DEVELOPMENT, FOSTERING A CULTURE OF ACCOUNTABILITY AND COLLABORATION.\nCOMPETENCIES \nRESULTS ORIENTED: MAINTAINS FOCUS ON OUTCOMES; IS PROACTIVE AND GOAL ORIENTED; CONCENTRATES ON MEETING OBJECTIVES, DELIVERING TO THE REQUIRED TIME, COST AND QUALITY; HOLDS PERFORMANCE AS MORE IMPORTANT THAN PROCESS; SETS SPECIFIC, MEASURABLE, AND RELEVANT GOALS AND TAKES EFFICIENT ACTION TO ACCOMPLISH SUCCESS.\nDECISION QUALITY: MAKES GOOD DECISIONS BASED UPON A MIXTURE OF ANALYSIS, EXPERIENCE, AND JUDGMENT; MOST SOLUTIONS, DECISIONS, AND SUGGESTIONS TURN OUT TO BE CORRECT AND ACCURATE WHEN JUDGED OVER TIME; SOUGHT OUT BY OTHERS FOR ADVICE AND SOLUTIONS. \nTEAMWORK: WORKS WITH A SPIRIT OF COLLABORATION; IS WILLING TO BE FLEXIBLE AND ADAPTABLE TO ENSURE SUCCESS; TREATS OTHERS WITH RESPECT, COLLABORATION, AND SUPPORT IN SUCH A WAY THAT WORK RELATIONSHIPS ARE IMPROVED AND MORALE IS INCREASED.\nEXPERIENCE AND QUALIFICATIONS\nCERTIFIED PUBLIC ACCOUNTANT. MASTER’S DEGREE OR HIGHER IN FINANCE, ACCOUNTING, OR RELATED FIELD. PROVEN EXPERIENCE IN FINANCIAL LEADERSHIP FOR A MULTI UNIT RESTAURANT OR RETAIL CONCEPT IS A MUST. EXCELLENT VERBAL, WRITTEN, AND VISUAL COMMUNICATION SKILLS, WITH THE ABILITY TO COLLABORATE ACROSS MULTIPLE DEPARTMENTS.DEMONSTRATED LEADERSHIP CAPABILITIES WITH A TRACK RECORD OF EFFECTIVELY MANAGING TEAMS, BOTH INTERNAL AND EXTERNAL, TO DRIVE RESULTS. ADVANCED ACCOUNTING, REGULATORY ISSUES AND COMPLIANCE, AND TAX PLANNING ANALYTICAL, PROBLEM SOLVING, AND ORGANIZATIONAL SKILLS. STRONG FINANCIAL ACUMEN AND ANALYTICAL SKILLS.\nTHIS IS AN EXECUTIVE POSITION WITH INTERNAL AND EXTERNAL DIRECT REPORTS. THE CFO WILL REPORT DIRECTLY TO THE CEO. \nESSENTIAL PHYSICAL CHARACTERISTICS \nTHE PHYSICAL CHARACTERISTICS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY AN EMPLOYEE TO SUCCESSFULLY PERFORM THE FUNCTIONS REQUIRED BY THIS JOB CLASSIFICATION. REASONABLE ACCOMMODATION MAY BE MADE TO ENABLE AN INDIVIDUAL WITH QUALIFIED DISABILITIES TO PERFORM THE FUNCTIONS OF THIS JOB CLASSIFICATION, ON A CASE-BY-CASE BASIS. \nWHILE PERFORMING THE DUTIES OF THIS JOB, THE EMPLOYEE MAY BE REQUIRED TO STAND, SIT, TALK, HEAR, REACH, STOP, AND USE HANDS AND FINGERS TO OPERATE A COMPUTER, TELEPHONE, AND KEYBOARD. WORK IS PERFORMED IN AN OFFICE ENVIRONMENT AND REQUIRES THE ABILITY TO OPERATE STANDARD OFFICE EQUIPMENT. \nLICENSES AND CERTIFICATIONS \nPRE-EMPLOYMENT: INCUMBENTS MUST SIGN THE COMPANY CONFIDENTIALITY, NON-DISCLOSURE, AND NON-SOLICITATION AGREEMENT PRIOR TO THEIR FIRST DAY ON THE JOB. \nLANGUAGE: FLUENT ENGLISH COMMUNICATION SKILLS ARE REQUIRED OF THIS POSITION. \nINTRODUCTORY PERIOD: INCUMBENTS APPOINTED TO THIS JOB CLASSIFICATION WILL SERVE AN INTRODUCTORY PERIOD OF THREE MONTHS. THE ENTIRETY OF THE EMPLOYMENT RELATIONSHIP, INCLUDING THE INTRODUCTORY PERIOD, IS “AT-WILL” MEANING THAT EITHER IKE’S LOVE AND SANDWICHES, INC. OR THE EMPLOYEE MAY END THE RELATIONSHIP WITH OR WITHOUT REASON OR NOTICE, NOT PROHIBITED BY LAW.\nBACKGROUND CHECK: AFTER A CONDITIONAL OFFER OF EMPLOYMENT IS MADE, A BACKGROUND CHECK WILL BE CONDUCTED AND ASSESSED ACCORDINGLY. \n\nTHIS JOB DESCRIPTION OUTLINES PRIMARY DUTIES AND RESPONSIBILITIES BUT IS NOT EXHAUSTIVE. OTHER DUTIES MAY BE ASSIGNED AS NEEDED. OUR COMPANY IS AN EQUAL OPPORTUNITY EMPLOYER, COMMITTED TO FOSTERING A DIVERSE AND INCLUSIVE WORK ENVIRONMENT. REASONABLE ACCOMMODATIONS MAY BE PROVIDED TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS OF THE ROLE. WE RESERVE THE RIGHT TO AMEND THIS JOB DESCRIPTION AT ANY TIME TO MEET BUSINESS NEEDS.\nTHE SALARY RANGE FOR THIS POSITION IS $200,000 - $250,000 PER YEAR.",
    "job_skill_set": [
      "financial analysis",
      "financial reporting",
      "regulatory compliance",
      "cash flow management",
      "budget management",
      "accounting",
      "tax planning",
      "financial controls",
      "financial acumen",
      "master's degree in finance or accounting",
      "leadership",
      "communication",
      "teamwork",
      "problem solving",
      "decision making",
      "results oriented",
      "collaboration",
      "organizational skills",
      "financial planning",
      "risk management",
      "investment evaluation",
      "CPA certification"
    ],
    "short_keywords": [
      "accounting",
      "acumen",
      "analysis",
      "budget",
      "cash",
      "certification",
      "cfo",
      "collaboration",
      "communication",
      "compliance",
      "controls",
      "cpa",
      "decision",
      "degree",
      "evaluation",
      "finance",
      "financial",
      "flow",
      "in",
      "investment",
      "leadership",
      "making",
      "management",
      "masters",
      "of",
      "or",
      "organizational",
      "oriented",
      "planning",
      "president",
      "problem",
      "regulatory",
      "reporting",
      "results",
      "risk",
      "skills",
      "solving",
      "tax",
      "teamwork",
      "vice"
    ]
  },
  {
    "job_id": "3889110089",
    "job_title": "Sr. Finance Manager",
    "category": "FINANCE",
    "job_description": "COMPANY DESCRIPTION\n\nVISA IS A WORLD LEADER IN PAYMENTS AND TECHNOLOGY, WITH OVER 259 BILLION PAYMENTS TRANSACTIONS FLOWING SAFELY BETWEEN CONSUMERS, MERCHANTS, FINANCIAL INSTITUTIONS, AND GOVERNMENT ENTITIES IN MORE THAN 200 COUNTRIES AND TERRITORIES EACH YEAR. OUR MISSION IS TO CONNECT THE WORLD THROUGH THE MOST INNOVATIVE, CONVENIENT, RELIABLE, AND SECURE PAYMENTS NETWORK, ENABLING INDIVIDUALS, BUSINESSES, AND ECONOMIES TO THRIVE WHILE DRIVEN BY A COMMON PURPOSE – TO UPLIFT EVERYONE, EVERYWHERE BY BEING THE BEST WAY TO PAY AND BE PAID.\n\nMAKE AN IMPACT WITH A PURPOSE-DRIVEN INDUSTRY LEADER. JOIN US TODAY AND EXPERIENCE LIFE AT VISA.\n\nJOB DESCRIPTION\n\nTHE SR. FINANCE MANAGER - RISK WILL BE A FINANCIAL BUSINESS PARTNER FOR THE RISK ORGANIZATION. THIS ROLE IS RESPONSIBLE FOR LEADING THE FINANCIAL PLANNING & ANALYSIS PROCESSES, PARTNERING WITH THE BUSINESS TO BUILD BUSINESS CASES AND PRIORITIZE INVESTMENTS, MANAGING EXPENSES, AND PROVIDING BROAD DECISION SUPPORT ANALYTICS TO ASSIST BUSINESS LEADERS IN RUNNING THEIR FUNCTIONS.\n\nTHIS ROLE WILL BE RESPONSIBLE FOR DRIVING A PROACTIVE, COLLABORATIVE PARTNERSHIP BETWEEN FINANCE AND RISK ORGANIZATIONS, DEEPLY EMBEDDING FINANCE INTO THE BUSINESS, UNDERSTANDING THE FUNCTION’S NEEDS, AND IDENTIFYING TRENDS AND OPPORTUNITIES TO ADVANCE VISA'S OVERALL BUSINESS AND FINANCIAL STRATEGY. THE SUCCESSFUL CANDIDATE WILL NEED TO HAVE THE ABILITY TO WORK WITH MATRIXED BUSINESS ORGANIZATIONS\n\nTHE ROLE WILL INVOLVE DELIVERING IMPORTANT INSIGHTS TO SENIOR FINANCE LEADERS AND EXECUTIVE MANAGEMENT AND REQUIRE STRONG INFLUENCING SKILLS. RISK IS A GLOBAL ORGANIZATION THAT IS ACTIVELY INVOLVED IN A NUMBER OF CORPORATE STRATEGIC INITIATIVES. THE IDEAL CANDIDATE WILL HAVE A DEEP BACKGROUND IN FINANCIAL AND GENERAL BUSINESS ANALYSIS, PREFERABLY WITH A PUBLIC COMPANY, AND DEMONSTRATED EXPERIENCE COLLABORATING ACROSS FUNCTIONS.\n\nESSENTIAL FUNCTIONS:\n\nSTRATEGIC PLANNING AND ANALYTICS:\n\nBECOME A TRUSTED BUSINESS PARTNER TO ALL BUSINESS UNITS AND EXECUTIVE MANAGEMENTCOLLABORATE WITH GLOBAL AND REGIONAL TEAMS FOR BUDGET/FORECAST, INCLUDING PRIORITY RECOMMENDATIONS ON RESOURCE ALLOCATION AS NEEDEDDEVELOP AND PRESENT STRATEGIC INSIGHTS ABOUT BUSINESS TRENDS AND KEY INDUSTRY RELATIONSHIPSDEVELOP REVENUE AND EXPENSE PLANS, BASED ON STRATEGIC BUSINESS REQUIREMENTS IN PARTNERSHIP WITH SENIOR LEADERSPARTNER WITH BUSINESS STAKEHOLDERS TO CREATE BUSINESS CASES AND ANALYZE PROPOSALS, STRUCTURE AND EXECUTE COMPLEX FINANCIAL MODELINGIDENTIFY AND IMPLEMENT CHANGES TO IMPROVE EFFICIENCY AND EFFECTIVENESS OF OPERATIONAL DECISION MAKING\n\nFINANCIAL MANAGEMENT:\n\nPREPARE ANNUAL BUSINESS PLAN AND ANALYSISPERFORM DIAGNOSTICS, BUDGETING, FORECASTING AND MANAGEMENT REPORTING FOR RISK ORGANIZATIONUNDERSTAND BUSINESS DRIVERS AND RECOMMEND MEASURES TO FURTHER IMPROVE RESULTSDESIGN, BUILD AND MAINTAIN VARIOUS AUTOMATED REPORTING MODELS LEVERAGING HYPERION AND OTHER VISA DEVELOPED REPORTING TOOLS (GEAR)TRACK INVESTMENT EXECUTION AND WORKFORCE PLANNING BY BUSINESS UNIT IN ORDER TO PERIODICALLY REPORT BUSINESS PLANS CHANGES\n\nTHIS IS A HYBRID POSITION. HYBRID EMPLOYEES CAN ALTERNATE TIME BETWEEN BOTH REMOTE AND OFFICE. EMPLOYEES IN HYBRID ROLES ARE EXPECTED TO WORK FROM THE OFFICE 2-3 SET DAYS A WEEK (DETERMINED BY LEADERSHIP/SITE), WITH A GENERAL GUIDEPOST OF BEING IN THE OFFICE 50% OR MORE OF THE TIME BASED ON BUSINESS NEEDS.\n\nQUALIFICATIONS\n\nBASIC QUALIFICATIONS\n\n 8 OR MORE YEARS OF RELEVANT WORK EXPERIENCE WITH A BACHELOR DEGREE OR AT LEAST 5 YEARS OF EXPERIENCE WITH AN ADVANCED DEGREE (E.G. MASTERS, MBA, JD, MD) OR 2 YEARS OF WORK EXPERIENCE WITH A PHD\n\nPREFERRED QUALIFICATIONS\n\n 9 OR MORE YEARS OF RELEVANT WORK EXPERIENCE WITH A BACHELOR DEGREE OR 7 OR MORE RELEVANT YEARS OF EXPERIENCE WITH AN ADVANCED DEGREE (E.G. MASTERS, MBA, JD, MD) OR 3 OR MORE YEARS OF EXPERIENCE WITH A PHD STRONG BUSINESS ACUMEN AND MULTI FUNCTIONAL BUSINESS EXPERIENCE A PLUS DEMONSTRATED PROGRAM LEADERSHIP CAPABILITIES TO DRIVE KEY FINANCIAL PROCESSES ANALYTICAL AND QUANTITATIVE SKILLS, ABILITY TO RESOLVE TOUGH BUSINESS PROBLEMS WITH WELL STRUCTURED ANALYSES SOLUTION ORIENTED AND GREAT PROBLEM SOLVER, ABILITY TO STRIKE BALANCE BETWEEN COMPLIANCE, GOVERNANCE REQUIREMENTS AND ACHIEVING BUSINESS OUTCOMES MUST BE DETAIL ORIENTED TO ENSURE ACCURACY AND QUALITY OF OUTPUT EXCELLENT COMMUNICATION AND INTERPERSONAL SKILLS, ABILITY TO COMMUNICATE EFFECTIVELY WITH DIVERSE AUDIENCES ABILITY TO WORK EFFECTIVELY WITH A DIVERSE TEAM AND PRODUCE TIME SENSITIVE DELIVERABLES ABILITY TO WORK IN A FAST PACED AND DYNAMIC ENVIRONMENT WITH CHANGING PRIORITIES\n\nADDITIONAL INFORMATION\n\nWORK HOURS: VARIES UPON THE NEEDS OF THE DEPARTMENT.\n\nTRAVEL REQUIREMENTS: THIS POSITION REQUIRES TRAVEL 5-10% OF THE TIME.\n\nMENTAL/PHYSICAL REQUIREMENTS: THIS POSITION WILL BE PERFORMED IN AN OFFICE SETTING. THE POSITION WILL REQUIRE THE INCUMBENT TO SIT AND STAND AT A DESK, COMMUNICATE IN PERSON AND BY TELEPHONE, FREQUENTLY OPERATE STANDARD OFFICE EQUIPMENT, SUCH AS TELEPHONES AND COMPUTERS.\n\nVISA IS AN EEO EMPLOYER. QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, NATIONAL ORIGIN, SEXUAL ORIENTATION, GENDER IDENTITY, DISABILITY OR PROTECTED VETERAN STATUS. VISA WILL ALSO CONSIDER FOR EMPLOYMENT QUALIFIED APPLICANTS WITH CRIMINAL HISTORIES IN A MANNER CONSISTENT WITH EEOC GUIDELINES AND APPLICABLE LOCAL LAW.\n\nVISA WILL CONSIDER FOR EMPLOYMENT QUALIFIED APPLICANTS WITH CRIMINAL HISTORIES IN A MANNER CONSISTENT WITH APPLICABLE LOCAL LAW, INCLUDING THE REQUIREMENTS OF ARTICLE 49 OF THE SAN FRANCISCO POLICE CODE.\n\nU.S. APPLICANTS ONLY: THE ESTIMATED SALARY RANGE FOR A NEW HIRE INTO THIS POSITION IS 113,100 TO 164,050 USD PER YEAR, WHICH MAY INCLUDE POTENTIAL SALES INCENTIVE PAYMENTS (IF APPLICABLE). SALARY MAY VARY DEPENDING ON JOB-RELATED FACTORS WHICH MAY INCLUDE KNOWLEDGE, SKILLS, EXPERIENCE, AND LOCATION. IN ADDITION, THIS POSITION MAY BE ELIGIBLE FOR BONUS AND EQUITY. VISA HAS A COMPREHENSIVE BENEFITS PACKAGE FOR WHICH THIS POSITION MAY BE ELIGIBLE THAT INCLUDES MEDICAL, DENTAL, VISION, 401 (K), FSA/HSA, LIFE INSURANCE, PAID TIME OFF, AND WELLNESS PROGRAM.",
    "job_skill_set": [
      "budgeting",
      "data analysis",
      "expense management",
      "communication",
      "problem solving",
      "detail-oriented",
      "time management",
      "adaptability",
      "interpersonal skills",
      "financial planning",
      "financial analysis",
      "forecasting",
      "financial modeling",
      "reporting tools (Hyperion, GEAR)",
      "business case development",
      "strategic planning",
      "collaboration",
      "influencing skills",
      "business acumen",
      "teamwork"
    ],
    "short_keywords": [
      "acumen",
      "adaptability",
      "analysis",
      "budgeting",
      "business",
      "case",
      "collaboration",
      "communication",
      "data",
      "detailoriented",
      "development",
      "expense",
      "finance",
      "financial",
      "forecasting",
      "gear",
      "hyperion",
      "influencing",
      "interpersonal",
      "management",
      "manager",
      "modeling",
      "planning",
      "problem",
      "reporting",
      "skills",
      "solving",
      "sr",
      "strategic",
      "teamwork",
      "time",
      "tools"
    ]
  },
  {
    "job_id": "3905335899",
    "job_title": "Public Finance Operations Administrator",
    "category": "FINANCE",
    "job_description": "SUMMARY\n\nTHE PUBLIC FINANCE OPERATIONS ADMINISTRATOR IS RESPONSIBLE PROVIDING OVERALL SUPPORT TO THE PUBLIC FINANCE DEPARTMENT RELATED TO THE ISSUANCE OF MUNICIPAL BONDS. THIS INCLUDES MANAGING A DATABASE OF CLIENT FILES, MAINTAINING THE INTEGRITY OF PUBLIC FINANCE RECORDS, INTERACTING WITH NATIONAL BOND ISSUE REPOSITORIES, ENSURING COMPLIANCE WITH LAWS AND REGULATIONS GOVERNING PUBLIC FINANCE AND MUNICIPAL SECURITIES, AS WELL AS OTHER ADMINISTRATIVE SUPPORT FUNCTIONS.\n\nESSENTIAL DUTIES AND RESPONSIBILITIES\n\n INTERACT CONSTANTLY WITH PUBLIC FINANCE BANKING STAFF TO GATHER INFORMATION AND DOCUMENTS TO ENTER INTO AND MANAGE A DATABASE OF ALL RECORDS AND DOCUMENTS NECESSARY FOR PUBLIC FINANCE TO COMPLY WITH FEDERAL RULES AND REGULATIONS.  WORK WITH OTHER PUBLIC FINANCE OPERATIONS STAFF TO MAINTAIN ALL ADMINISTRATIVE WORK ASSOCIATED WITH PUBLIC FINANCE MUNICIPAL BOND ISSUES, TO INCLUDE: CUSIPS, AWARD TIMES, OFFICIAL STATEMENTS, TRADE EXECUTION/CORRECTING TRADE PROBLEMS, SETTLEMENT TRANSACTIONS, UPDATING DEPARTMENTAL BOND ISSUE CALENDAR, MAINTAINING AND ENSURING ACCURATE CLIENT FILES, ETC.  PROVIDE TIMELY TRANSACTION INFORMATION TO THE MUNICIPAL SECURITIES RULEMAKING BOARD (MSRB/EMMA) AND DEPOSITORY TRUST COMPANY (DTC) UPON SUCCESSFUL DEAL AWARDS TO THE FIRM.  MONITOR INTERNAL SYSTEM FOR MUNICIPAL BOND ISSUES FROM CREATION TO COMPLETION FOR COMPLIANCE WITH POLICIES AND PROCEDURES.  ANTICIPATE NEEDS OF AND SUPPORT PUBLIC FINANCE INVESTMENT BANKERS TO SATISFY THEIR DEAL-RELATED REQUIREMENTS UNDER POLICIES AND PROCEDURES.  ANSWER QUESTIONS FROM PUBLIC FINANCE INVESTMENT BANKERS ABOUT STANDARD PRACTICE AND APPLICATION OF POLICIES AND PROCEDURES.  ENSURE ADHERENCE TO FEDERAL, STATE AND LOCAL REGULATIONS AND ORDINANCES\n\n\nQUALIFICATIONS\n\n THE ABILITY TO MULTI-TASK AND WORK UNDER PRESSURE IN AN ORGANIZED MANNER.  STRONG INTERPERSONAL SKILLS TO INTERACT WITH BANKING STAFF AT ALL LEVELS.  THE ABILITY TO WORK CLOSELY WITH THE PUBLIC FINANCE OPERATIONS TEAM, PRODUCING ACCURATE WORK IN A TIMELY MANNER MEETING DEADLINES AS ASSIGNED.  AN UNDERSTANDING OF PUBLIC FINANCE CONCEPTS FROM A FUNCTIONAL AND TECHNICAL PERSPECTIVE.  KNOWLEDGE OF SEC AND FINRA RULES/REGULATIONS, INDUSTRY PRACTICE AND HOW THEY APPLY TO FIRM POLICIES AND PROCEDURES IS HELPFUL. \n\n\nEDUCATION AND EXPERIENCE\n\n MINIMUM PREFERRED: BACHELOR’S DEGREE MINIMUM PREFERRED: 2+ YEARS IN FINANCIAL SERVICES WITH ADMINISTRATIVE AND DATA ENTRY EXPERIENCE\n\n\nLICENSES AND CREDENTIALS\n\n MINIMUM REQUIRED: NONE\n\n\nSYSTEMS AND TECHNOLOGY\n\n PROFICIENT IN MICROSOFT EXCEL, WORD, POWERPOINT, OUTLOOK\n\n\nABOUT STIFEL\n\nSTIFEL IS A MORE THAN 130 YEARS OLD AND STILL THINKING LIKE A START-UP. WE ARE A GLOBAL WEALTH MANAGEMENT AND INVESTMENT BANKING FIRM SERIOUS ABOUT INNOVATION AND FRESH IDEAS. BUILT ON A SIMPLE PREMISE OF SAFEGUARDING OUR CLIENTS’ MONEY AS IF IT WERE OUR OWN, COINED BY OUR NAMESAKE, HERMAN STIFEL, OUR SUCCESS IS INTIMATELY TIED TO OUR COMMITMENT TO HELPING FAMILIES, COMPANIES, AND MUNICIPALITIES FIND THEIR OWN SUCCESS.\n\nWHILE OUR HEADQUARTERS IS IN ST. LOUIS, WE HAVE OFFICES IN NEW YORK, SAN FRANCISCO, BALTIMORE, LONDON, FRANKFURT, TORONTO, AND MORE THAN 400 OTHER LOCATIONS. STIFEL IS HOME TO APPROXIMATELY 9,000 INDIVIDUALS WHO ARE CURRENTLY BUILDING THEIR CAREERS AS FINANCIAL ADVISORS, RESEARCH ANALYSTS, PROJECT MANAGERS, MARKETING SPECIALISTS, DEVELOPERS, BANKERS, OPERATIONS ASSOCIATES, AMONG HUNDREDS MORE. LET’S TALK ABOUT HOW YOU CAN FIND YOUR PLACE HERE AT STIFEL, WHERE SUCCESS MEETS SUCCESS.\n\nAT STIFEL WE OFFER AN ENTREPRENEURIAL ENVIRONMENT, COMPREHENSIVE BENEFITS PACKAGE TO INCLUDE HEALTH, DENTAL AND VISION CARE, 401K, WELLNESS INITIATIVES, LIFE INSURANCE, AND PAID TIME OFF.\n\nSTIFEL IS AN EQUAL OPPORTUNITY EMPLOYER.",
    "job_skill_set": [
      "public finance knowledge",
      "compliance knowledge",
      "Microsoft Excel",
      "multi-tasking",
      "interpersonal skills",
      "organizational skills",
      "time management",
      "team collaboration",
      "problem-solving",
      "database management",
      "data entry",
      "Microsoft Word",
      "Microsoft PowerPoint",
      "Microsoft Outlook",
      "municipal bonds knowledge",
      "SEC and FINRA regulations knowledge"
    ],
    "short_keywords": [
      "administrator",
      "and",
      "bonds",
      "collaboration",
      "compliance",
      "data",
      "database",
      "entry",
      "excel",
      "finance",
      "finra",
      "interpersonal",
      "knowledge",
      "management",
      "microsoft",
      "multitasking",
      "municipal",
      "operations",
      "organizational",
      "outlook",
      "powerpoint",
      "problemsolving",
      "public",
      "regulations",
      "sec",
      "skills",
      "team",
      "time",
      "word"
    ]
  },
  {
    "job_id": "3905294723",
    "job_title": "Senior Financial Analyst - MT Supply Chain Procurement Source Finance - CSS",
    "category": "FINANCE",
    "job_description": "DESCRIPTION:\n\nJOHNSON & JOHNSON'S MEDTECH SOURCE FINANCE ORGANIZATION IS RECRUITING FOR A SENIOR FINANCIAL ANALYST TO PROVIDE FP&A AND CONSOLIDATION EXPERTISE AND LEADERSHIP. THIS ROLE HAS A PREFERRED LOCATION IN IRVINE, CA BUT CONSIDERATION WILL BE GRANTED TO OTHER J&J SITES IN WEST CHESTER, PA; RARITAN, NJ. THE POSITION WILL REPORT TO THE MEDTECH SOURCE GLOBAL FINANCE MANAGER.\n\nAT JOHNSON & JOHNSON, WE BELIEVE HEALTH IS EVERYTHING. OUR STRENGTH IN HEALTHCARE INNOVATION EMPOWERS US TO BUILD A WORLD WHERE COMPLEX DISEASES ARE PREVENTED, TREATED, AND CURED, WHERE TREATMENTS ARE SMARTER AND LESS INVASIVE, AND SOLUTIONS ARE PERSONAL. THROUGH OUR EXPERTISE IN INNOVATIVE MEDICINE AND MEDTECH, WE ARE UNIQUELY POSITIONED TO INNOVATE ACROSS THE FULL SPECTRUM OF HEALTHCARE SOLUTIONS TODAY TO DELIVER THE BREAKTHROUGHS OF TOMORROW, AND PROFOUNDLY IMPACT HEALTH FOR HUMANITY. LEARN MORE AT HTTPS://WWW.JNJ.COM/.\n\nTHE MEDTECH SUPPLY CHAIN SOURCE TEAM IS AN ORGANIZATION WITH GLOBAL IMPACT, SUPPORTING MEDTECH THIRD PARTY MANUFACTURING AND PROCUREMENT ORGANIZATIONS TO DELIVER HIGH QUALITY, RELIABLE AND COST COMPETITIVE PRODUCTS. THIS PARTICULAR ROLE ON THE J&J MEDICAL DEVICES SOURCE FINANCE TEAM HANDLES ANNUAL SPEND OF >$1.2B ACROSS A SOPHISTICATED NETWORK OF MATERIALS & SUPPLIERS FOR OUR CARDIOVASCULAR SPECIALTY SOLUTIONS BUSINESSES (BWI, MENTOR, CERENOVOUS). WHILE THIS ROLE WILL PRIMARILY FOCUS ON SUPPORTING DIRECT PROCUREMENT FOR THESE FRANCHISES, IT ALSO PROVIDES THE OPPORTUNITY TO PLAY A MEANINGFUL ROLE IN DRIVING STANDARDIZATION OF ACTIVITIES AND IMPROVEMENT IN EXECUTION ACROSS JJMD AND SOURCE FINANCE ON A CROSS-SECTOR PERSPECTIVE WHILE DRIVING MEANINGFUL IMPACTS FOR OUR PARTNERS.\n\nRESPONSIBILITIES:\n\nPROVIDE STRONG FINANCIAL LEADERSHIP AND BUSINESS PARTNER SUPPORT TO CSS PROCUREMENT AND SUPPLY CHAIN TEAMS TO INFLUENCE BUSINESS DECISIONSPROVIDE STRATEGIC AND FINANCIAL SUPPORT ON CASES FOR KEY INITIATIVES, BUILD AND PRESENT FINANCIAL MODELS/SCENARIOS TO SENIOR MANAGEMENTFORECAST, TRACK, AND ANALYZE PPV, INCLUDING CIPS AND MARKET-DRIVEN DIRECT MATERIAL COST CHANGES, AS WELL AS SOURCE-DRIVEN PROJECT AND FUNCTIONAL SPENDWORK CONTINUOUSLY ACROSS THE SOURCE AND SUPPLY CHAIN FINANCE TEAMS TO REDUCE COMPLEXITY, DUPLICATION, STANDARDIZE AND HARMONIZE ACTIVITIES AND ACCOUNTING TREATMENTS, TO IMPROVE AND AUTOMATE PROCESSESPROACTIVE ENGAGEMENT IN THE END-TO-END GROSS PROFIT ORCHESTRATION AND SIGNIFI JOURNEYS WITHIN FINANCEENSURE COMPLIANCE WITH RESPECT TO PURCHASE PRICE VARIANCE (PPV), COST IMPROVEMENT PROJECTS (CIPS), CAPITAL CONSTRUCTION-IN-PROCESS (CIP), AND GENERAL ACCOUNTING AND BUSINESS POLICIES & PROCEDURESSUPPORT ANNUAL STANDARD COST DEVELOPMENT WITH BUSINESS PARTNERS; PROVIDE INPUT AND INFLUENCE INTO SOURCING AND COSTING OF MATERIALS FOR INNOVATIVE NEW PRODUCT LAUNCHES\n\nARE YOU READY TO HAVE AN IMPACT ON PEOPLES LIVES? IF SO APPLY NOW.\n\nQUALIFICATIONS:\n\nA MINIMUM OF A BACHELOR’S DEGREE IS REQUIRED, PREFERABLY WITH A MAJOR IN ACCOUNTING OR FINANCE. A CPA, CMA, OR MBA ARE ALSO PREFERRED.A MINIMUM OF THREE YEARS FINANCE OR RELATED BUSINESS EXPERIENCE IS REQUIRED.SUPPLY CHAIN EXPERIENCE PREFERRED.MUST POSSESS THE ABILITY TO PARTNER WITH PEOPLE AT ALL LEVELS OF THE ORGANIZATION AND HAVE STRONG COMMUNICATION, INTERPERSONAL AND INFLUENCING SKILLS. THE ABILITY TO MAINTAIN, IMPROVE AND BUILD EFFICIENT SOUND BUSINESS PROCESSES IS REQUIRED.THIS POSITION REQUIRES A HIGHLY MOTIVATED INDIVIDUAL WITH STRONG ANALYTICAL SKILLS, INTELLECTUAL CURIOSITY, AND PROVEN LEADERSHIP SKILLS. PROFICIENCY IN MICROSOFT OFFICE (INCLUDING EXCEL & POWERPOINT) IS REQUIREDEXPERIENCE IN SAP, TM 1 AND JDE IS PREFERRED. THE CANDIDATE MUST BE COMFORTABLE WITH AMBIGUITY AND HAVE EXPERIENCE BUILDING AND IMPLEMENTING FINANCIALLY VIABLE BUSINESS MODELS. THE CANDIDATES MUST HAVE GOOD COMMUNICATION AND NEGOTIATION SKILLS, BE ABLE TO WORK IN A TEAM ENVIRONMENT, AND BE PASSIONATE ABOUT MEETING STRETCH OBJECTIVES.THIS POSITION WILL BE LOCATED IN IRVINE, CA WEST CHESTER, PA; RARITAN, NJ, AND MAY REQUIRE UP TO 10% TRAVEL\n\nJOHNSON & JOHNSON IS AN AFFIRMATIVE ACTION AND EQUAL OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, AGE, NATIONAL ORIGIN, OR PROTECTED VETERAN STATUS AND WILL NOT BE DISCRIMINATED AGAINST ON THE BASIS OF DISABILITY.\n\nTHE BASE PAY RANGE FOR THIS POSITION IS $76,000 - $121,900 USD\n\nTHE COMPANY MAINTAINS HIGHLY COMPETITIVE, PERFORMANCE-BASED COMPENSATION PROGRAMS. UNDER CURRENT GUIDELINES, THIS POSITION IS ELIGIBLE FOR AN ANNUAL PERFORMANCE BONUS IN ACCORDANCE WITH THE TERMS OF THE APPLICABLE PLAN. THE ANNUAL PERFORMANCE BONUS IS A CASH BONUS INTENDED TO PROVIDE AN INCENTIVE TO ACHIEVE ANNUAL TARGETED RESULTS BY REWARDING FOR INDIVIDUAL AND THE CORPORATION’S PERFORMANCE OVER A CALENDAR/ PERFORMANCE YEAR. BONUSES ARE AWARDED AT THE COMPANY’S DISCRETION ON AN INDIVIDUAL BASIS.\n\nEMPLOYEES MAY BE ELIGIBLE TO PARTICIPATE IN COMPANY EMPLOYEE BENEFIT PROGRAMS SUCH AS HEALTH INSURANCE, SAVINGS PLAN, PENSION PLAN, DISABILITY PLAN, VACATION PAY, SICK TIME, HOLIDAY PAY, AND WORK, PERSONAL AND FAMILY TIME OFF IN ACCORDANCE WITH THE TERMS OF THE APPLICABLE PLANS. FOR ADDITIONAL GENERAL INFORMATION ON COMPANY BENEFITS, PLEASE GO TO: - HTTPS://WWW.CAREERS.JNJ.COM/EMPLOYEE-BENEFITS\n\n",
    "job_skill_set": [
      "Financial Analysis",
      "FP&A",
      "Financial Modeling",
      "Cost Analysis",
      "Accounting",
      "Business Process Improvement",
      "Communication",
      "Interpersonal Skills",
      "Influencing Skills",
      "Analytical Skills",
      "Leadership",
      "Teamwork",
      "Negotiation Skills",
      "Intellectual Curiosity",
      "Adaptability",
      "Consolidation",
      "SAP",
      "TM1",
      "JDE",
      "Microsoft Excel",
      "Microsoft PowerPoint"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "analysis",
      "analyst",
      "analytical",
      "business",
      "chain",
      "communication",
      "consolidation",
      "cost",
      "css",
      "curiosity",
      "excel",
      "finance",
      "financial",
      "fpa",
      "improvement",
      "influencing",
      "intellectual",
      "interpersonal",
      "jde",
      "leadership",
      "microsoft",
      "modeling",
      "mt",
      "negotiation",
      "powerpoint",
      "process",
      "procurement",
      "sap",
      "senior",
      "skills",
      "source",
      "supply",
      "teamwork",
      "tm1"
    ]
  },
  {
    "job_id": "3888961209",
    "job_title": "Senior Corporate Counsel - U.S. Bancorp Impact Finance",
    "category": "FINANCE",
    "job_description": "AT U.S. BANK, WE’RE ON A JOURNEY TO DO OUR BEST. HELPING THE CUSTOMERS AND BUSINESSES WE SERVE TO MAKE BETTER AND SMARTER FINANCIAL DECISIONS AND ENABLING THE COMMUNITIES WE SUPPORT TO GROW AND SUCCEED. WE BELIEVE IT TAKES ALL OF US TO BRING OUR SHARED AMBITION TO LIFE, AND EACH PERSON IS UNIQUE IN THEIR POTENTIAL. A CAREER WITH U.S. BANK GIVES YOU A WIDE, EVER-GROWING RANGE OF OPPORTUNITIES TO DISCOVER WHAT MAKES YOU THRIVE AT EVERY STAGE OF YOUR CAREER. TRY NEW THINGS, LEARN NEW SKILLS AND DISCOVER WHAT YOU EXCEL AT—ALL FROM DAY ONE.\n\nJOB DESCRIPTION\n\nSUCCESSFUL CANDIDATES FOR POSITIONS IN THE U.S. BANK LAW DIVISION CONSISTENTLY PROVIDE EXCELLENT ADVICE AND GUIDANCE TO CLIENTS AND COLLEAGUES ON A VARIETY OF LEGAL MATTERS. THEY BUILD TRUSTING RELATIONSHIPS THAT ALLOW THE BUSINESS TO MAKE WELL-INFORMED DECISIONS. SUCCESSFUL CANDIDATES FOR POSITIONS IN THE LAW DIVISION ALSO WORK TO ATTRACT, RETAIN, AND DEVELOP GREAT PEOPLE IN AN INCLUSIVE ENVIRONMENT WHERE EACH PERSON IS VALUED FOR THE DISTINCT SKILLS AND ATTRIBUTES THEY BRING TO THE GROUP. THEY CONTRIBUTE TO THE EXCELLENCE OF THE LAW DIVISION THROUGH MEANINGFUL COLLABORATION, PARTICIPATION IN THE COMMUNITY, AND INVESTMENT IN THE DEVELOPMENT OF THE DEPARTMENT.\n\nU.S. BANK IS SEEKING AN ATTORNEY TO ASSIST WITH MANAGING LEGAL RISK FOR U.S. BANCORP IMPACT FINANCE. THE ROLE WILL ASSIST THE CHIEF COUNSEL WITH LEGAL WORK ACROSS ALL BUSINESS LINES WITHIN IMPACT FINANCE, INCLUDING AFFORDABLE HOUSING, NEW MARKETS TAX CREDITS, HISTORIC TAX CREDITS, RENEWABLE ENERGY, COMMUNITY LENDING, AND SUSTAINABLE FINANCE. THERE IS OPPORTUNITY TO SPECIALIZE AND INTEGRATE WITH ONE OR MORE OF THE BUSINESS LINES AND DIRECTLY NEGOTIATE AND DRAFT AGREEMENTS RELATING TO COMMUNITY DEVELOPMENT AND TAX CREDIT INVESTMENTS. THE ROLE REQUIRES GOOD JUDGMENT, A COMMITMENT TO BUILDING STRONG RELATIONSHIPS, AND A STRONG WORK ETHIC.\n\nBASIC QUALIFICATIONS\n\n LICENSED BY AND IN GOOD STANDING WITH THE APPROPRIATE STATE BAR ASSOCIATION OR OTHER APPROPRIATE STATE ATTORNEY LICENSING AUTHORITY\n\n\nPREFERRED SKILLS/EXPERIENCE\n\n FIVE TO EIGHT YEARS OF RELEVANT EXPERIENCE EXPERIENCE DOCUMENTING AND NEGOTIATING COMMERCIAL TRANSACTIONS AND NEGOTIATIONS, INCLUDING COMMERCIAL LOAN AND TAX CREDIT DOCUMENTATION ABILITY TO COMMUNICATE EFFECTIVELY IN BOTH WRITTEN AND VERBAL FORM COMFORT AND SKILL WHEN SPEAKING IN PUBLIC PROBLEM SOLVER WITH A DEMONSTRATED COMMITMENT TO CLIENT SERVICE AND THE ABILITY TO WORK IN A TEAM ENVIRONMENT ABILITY OR POTENTIAL TO IMPLEMENT EQUITABLE PRACTICES INTO DAILY WORK WILLINGNESS TO LEARN NEW SKILLS AND INFORMATION, KEEPING INFORMED OF LEGISLATION AND RULEMAKING AFFECTING THE BUSINESS LINE COMMITMENT TO CONTINUOUS IMPROVEMENT IN SYSTEMS AND PROCESSES DEMONSTRATED EXPERIENCE WITH, OR POTENTIAL TO GAIN THOROUGH AND CURRENT KNOWLEDGE OF, STATE AND FEDERAL TAX CREDIT LAWS AND REGULATIONS AND COMMERCIAL LENDING LAWS EXPERIENCE DEVELOPING NEW PRODUCTS AND SERVICES IN A RISK-CONSCIOUS AND HIGHLY-REGULATED ENVIRONMENT DEVELOPMENT AND IMPLEMENTATION OF REGULATORY AND COMPLIANCE POLICIES COMMITMENT TO LEGAL ETHICS, AS DEMONSTRATED BY EXPERIENCE WITH ATTORNEY-CLIENT PRIVILEGE AND CONFLICTS OF INTEREST STRENGTH WORKING CROSS-FUNCTIONALLY AND COLLABORATING WITH OTHERS\n\n\nTHE ROLE OFFERS A HYBRID/FLEXIBLE SCHEDULE, WHICH MEANS THERE'S AN IN-OFFICE EXPECTATION OF 3 OR MORE DAYS PER WEEK AND THE FLEXIBILITY TO WORK OUTSIDE THE OFFICE LOCATION FOR THE OTHER DAYS. \n\nWE ARE PROUD THAT U.S. BANK HAS BEEN RECOGNIZED AS A WORLD’S MOST ETHICAL COMPANY® BY THE ETHISPHERE INSTITUTE AND HAS BEEN NAMED THE #1 MOST ADMIRED SUPERREGIONAL BANK BY FORTUNE MAGAZINE.\n\nSUCCESSFUL CANDIDATES FOR A POSITION IN THE U.S. BANK LAW DIVISION SUPPORT U.S. BANK’S CORE VALUES, WHICH GUIDE WHAT WE DO EVERY DAY:\n\n WE DO THE RIGHT THING. WE POWER POTENTIAL. WE STAY A STEP AHEAD. WE DRAW STRENGTH FROM DIVERSITY. WE PUT PEOPLE FIRST.\n\n\nIN THE U.S. BANK LAW DIVISION, WE HONOR THOSE VALUES THROUGH OUR MISSION: “WE GUIDE OUR CLIENTS TO REMARKABLE RESULTS WITH EXPERT LEGAL COUNSEL AND ETHICAL LEADERSHIP.” OUR COMMITMENT IS EVIDENT IN THE WORK WE DO, NOT ONLY FOR THE BANK, BUT FOR OUR COMMUNITIES. THE LAW DIVISION HAS RECEIVED SEVERAL AWARDS FOR ITS PRO BONO CONTRIBUTIONS, INCLUDING THE MINNESOTA CORPORATE PRO BONO COUNCIL’S “EXCELLENCE IN PRO BONO AWARD,” AND WE ENCOURAGE OUR LEGAL PROFESSIONALS TO CONTRIBUTE TIME AND EXPERTISE TO PRO BONO WORK AS PART OF THEIR ROLE.\n\nIN ADDITION, THE LAW DIVISION HAS BEEN RECOGNIZED FOR ITS LEADERSHIP AND ENGAGEMENT IN DIVERSITY, EQUITY, AND INCLUSION INITIATIVES.\n\nIF THERE’S ANYTHING WE CAN DO TO ACCOMMODATE A DISABILITY DURING ANY PORTION OF THE APPLICATION OR HIRING PROCESS, PLEASE REFER TO OUR DISABILITY ACCOMMODATIONS FOR APPLICANTS.\n\nBENEFITS:\n\nOUR APPROACH TO BENEFITS AND TOTAL REWARDS CONSIDERS OUR TEAM MEMBERS’ WHOLE SELVES AND WHAT MAY BE NEEDED TO THRIVE IN AND OUTSIDE WORK. THAT'S WHY OUR BENEFITS ARE DESIGNED TO HELP YOU AND YOUR FAMILY BOOST YOUR HEALTH, PROTECT YOUR FINANCIAL SECURITY AND GIVE YOU PEACE OF MIND. OUR BENEFITS INCLUDE THE FOLLOWING (SOME MAY VARY BASED ON ROLE, LOCATION OR HOURS):\n\nHEALTHCARE (MEDICAL, DENTAL, VISION)BASIC TERM AND OPTIONAL TERM LIFE INSURANCESHORT-TERM AND LONG-TERM DISABILITYPREGNANCY DISABILITY AND PARENTAL LEAVE401(K) AND EMPLOYER-FUNDED RETIREMENT PLANPAID VACATION (FROM TWO TO FIVE WEEKS DEPENDING ON SALARY GRADE AND TENURE)UP TO 11 PAID HOLIDAY OPPORTUNITIESADOPTION ASSISTANCESICK AND SAFE LEAVE ACCRUALS OF ONE HOUR FOR EVERY 30 WORKED, UP TO 80 HOURS PER CALENDAR YEAR UNLESS OTHERWISE PROVIDED BY LAW\n\n\nEEO IS THE LAW\n\nU.S. BANK IS AN EQUAL OPPORTUNITY EMPLOYER COMMITTED TO CREATING A DIVERSE WORKFORCE. WE CONSIDER ALL QUALIFIED APPLICANTS WITHOUT REGARD TO RACE, RELIGION, COLOR, SEX, NATIONAL ORIGIN, AGE, SEXUAL ORIENTATION, GENDER IDENTITY, DISABILITY OR VETERAN STATUS, AMONG OTHER FACTORS. APPLICANTS CAN LEARN MORE ABOUT THE COMPANY’S STATUS AS AN EQUAL OPPORTUNITY EMPLOYER BY VIEWING THE FEDERAL KNOW YOUR RIGHTS EEO POSTER.\n\nE-VERIFY\n\nU.S. BANK PARTICIPATES IN THE U.S. DEPARTMENT OF HOMELAND SECURITY E-VERIFY PROGRAM IN ALL FACILITIES LOCATED IN THE UNITED STATES AND CERTAIN U.S. TERRITORIES. THE E-VERIFY PROGRAM IS AN INTERNET-BASED EMPLOYMENT ELIGIBILITY VERIFICATION SYSTEM OPERATED BY THE U.S. CITIZENSHIP AND IMMIGRATION SERVICES. LEARN MORE ABOUT THE E-VERIFY PROGRAM.\n\nTHE SALARY RANGE REFLECTS FIGURES BASED ON THE PRIMARY LOCATION, WHICH IS LISTED FIRST. THE ACTUAL RANGE FOR THE ROLE MAY DIFFER BASED ON THE LOCATION OF THE ROLE. IN ADDITION TO SALARY, U.S. BANK OFFERS A COMPREHENSIVE BENEFITS PACKAGE, INCLUDING INCENTIVE AND RECOGNITION PROGRAMS, EQUITY STOCK PURCHASE 401(K) CONTRIBUTION AND PENSION (ALL BENEFITS ARE SUBJECT TO ELIGIBILITY REQUIREMENTS). PAY RANGE: $123,165.00 - $144,900.00 - $159,390.00\n\nJOB POSTINGS TYPICALLY REMAIN OPEN FOR APPROXIMATELY 20 DAYS OF THE POSTING DATE LISTED ABOVE, HOWEVER THE JOB POSTING MAY BE CLOSED EARLIER SHOULD IT BE DETERMINED THE POSITION IS NO LONGER REQUIRED DUE TO BUSINESS NEED. JOB POSTINGS IN AREAS WITH A HIGH VOLUME OF APPLICANTS, SUCH AS CUSTOMER SERVICE, CONTACT CENTER, AND FINANCIAL CRIMES INVESTIGATIONS, REMAIN OPEN FOR APPROXIMATELY 5 DAYS OF THE POSTING LISTED DATE.",
    "job_skill_set": [
      "regulatory compliance",
      "relationship building",
      "teamwork",
      "problem solving",
      "communication",
      "commitment to client service",
      "continuous improvement",
      "adaptability",
      "ethical leadership",
      "collaboration",
      "legal risk management",
      "commercial transactions",
      "tax credit documentation",
      "public speaking",
      "contract negotiation",
      "knowledge of tax credit laws",
      "knowledge of commercial lending laws",
      "pro bono work"
    ],
    "short_keywords": [
      "adaptability",
      "bancorp",
      "bono",
      "building",
      "client",
      "collaboration",
      "commercial",
      "commitment",
      "communication",
      "compliance",
      "continuous",
      "contract",
      "corporate",
      "counsel",
      "credit",
      "documentation",
      "ethical",
      "finance",
      "impact",
      "improvement",
      "knowledge",
      "laws",
      "leadership",
      "legal",
      "lending",
      "management",
      "negotiation",
      "of",
      "pro",
      "problem",
      "public",
      "regulatory",
      "relationship",
      "risk",
      "senior",
      "service",
      "solving",
      "speaking",
      "tax",
      "teamwork",
      "to",
      "transactions",
      "us",
      "work"
    ]
  },
  {
    "job_id": "3906258100",
    "job_title": "Senior Finance Analyst (US)",
    "category": "FINANCE",
    "job_description": "WORK LOCATION:\n\n1006 ASTORIA BOULEVARD\n\nHOURS\n\n40\n\nPAY DETAILS\n\n$68,640 - $112,320 USD\n\nTD IS COMMITTED TO PROVIDING FAIR AND EQUITABLE COMPENSATION OPPORTUNITIES TO ALL COLLEAGUES. THE INCLUDED SALARY RANGE FOR THIS ROLE TAKES INTO ACCOUNT MULTIPLE FACTORS THAT ARE CONSIDERED IN MAKING COMPENSATION DECISIONS. THE BASE PAY ACTUALLY OFFERED MAY VARY BASED UPON CANDIDATE'S SKILLS AND EXPERIENCE, JOB-RELATED KNOWLEDGE, LICENSURE AND CERTIFICATIONS, GEOGRAPHIC LOCATION, AND OTHER SPECIFIC BUSINESS AND ORGANIZATIONAL NEEDS. AS TD PUTS CAREER DEVELOPMENT AT THE FOREFRONT OF OUR COLLEAGUE EXPERIENCE, IT IS NOT TYPICAL FOR AN INDIVIDUAL TO BE HIRED AT OR NEAR THE TOP OF THE RANGE FOR THEIR ROLE.\n\nAS A CANDIDATE, YOU ARE ENCOURAGED TO ASK COMPENSATION RELATED QUESTIONS AND HAVE AN OPEN DIALOGUE WITH YOUR RECRUITER WHO CAN PROVIDE YOU MORE SPECIFIC DETAILS FOR THIS ROLE.\n\nLINE OF BUSINESS\n\nFINANCE\n\nJOB DESCRIPTION\n\nTHE SENIOR FINANCE ANALYST CONDUCTS A RANGE OF LOB RELATED FINANCIAL ANALYSIS AND/OR PROVIDES FINANCE SUPPORT AS IT RELATES TO A BUSINESS PARTNER FINANCE AREA SUPPORTED.\n\nSUBJECT MATTER EXPERT (SME) BUSINESS PARTNER KNOWLEDGE/PROFESSIONAL ROLE REQUIRING IN-DEPTH KNOWLEDGE/EXPERTISE IN OWN DOMAIN/FIELD OF SPECIALTY AND WORKING KNOWLEDGE OF BROADER RELATED AREASRESEARCHES AND INVESTIGATES A RANGE OF FINANCIAL ACCOUNTING/AUDIT OPERATIONAL AND/OR REPORTING ISSUESREQUIRES SPECIALIZED AND/OR ADVANCED TECHNICAL/FINANCE KNOWLEDGE FOR OWN AREAMAY NEED TO COORDINATE/INTEGRATE WORK WITH OTHER AREAS AS NEEDEDNATURE AND COMPLEXITY OF WORK SUPPORTS GENERALLY MEDIUM TO LONGER TERM FOCUSPERFORMS ADVANCED ANALYSIS OR SPECIALIZED WORK THAT REQUIRES GOOD UNDERSTANDING OF FINANCIAL ACCOUNTING OR RELATED OPERATIONAL POLICIES AND PROCEDURESINTEGRATES THE BROADER ORGANIZATIONAL CONTEXT INTO ADVICE AND SOLUTIONS WITHIN OWN AREAUNDERSTANDS THE INDUSTRY, COMPETITION AND THE FACTORS THAT DIFFERENTIATE THE ORGANIZATIONAPPLIES BEST PRACTICES TO IMPLEMENT PROCESS, PRODUCT OR SERVICE IMPROVEMENTSACTS AS A SUBJECT MATTER EXPERT WITHIN THEIR OWN AREA OF SPECIALTY OR A RESOURCE FOR OTHERSCONTRIBUTES TO SETTING STANDARDS WITHIN AREA OF EXPERTISESOLVES COMPLEX PROBLEMS REQUIRING ANALYSIS OF MULTIPLE VARIABLES, INCLUDING CONSULTATION WITH MULTIPLE STAKEHOLDERSIMPACTS A RANGE OF FUNCTIONAL PROGRAMS AND OPERATIONS ACROSS OWN AND RELATED TEAMSINTERPRETS GUIDELINES, STANDARDS, POLICIES AND RESULTS OF ANALYSIS TO INFORM DECISION MAKING AT SENIOR LEVELSBUILDS STAKEHOLDER ALIGNMENT IN LEADING PROJECTS AND ACTIVITIES; MAY PROVIDE PROCESS AND SUBJECT MATTER ADVICE AT SENIOR LEVELSWORKS INDEPENDENTLY AS THE SENIOR TECHNICAL LEAD AND GUIDES OTHERS WITHIN AREA OF EXPERTISE\n\nEDUCATION & EXPERIENCE\n\nUNDERGRADUATE DEGREE5+ YEARS OF RELEVANT EXPERIENCEACCOUNTING DESIGNATION PREFERRED\n\nCUSTOMER ACCOUNTABILITIES\n\nCONDUCTS REGULAR, ONGOING ANALYSIS, EVALUATION AND REVIEW OF BUSINESS PERFORMANCE AND INITIATIVES AGAINST ESTABLISHED REFERENCE POINTS (E.G., PLAN, PRIOR YEAR, BUSINESS CASES) AS DIRECTEDPROVIDES ADVICE AND GUIDANCE TO FINANCE MANAGEMENT AND/OR BUSINESS PARTNERS AND APPROPRIATE STAKEHOLDERS ON A RANGE OF FINANCE ACCOUNTING/REPORTING OR OPERATIONAL PROCESSESAPPLIES UNDERSTANDING OF RESPECTIVE BUSINESS STRATEGIES TO PRODUCE RELEVANT AND MEANINGFUL DATA ANALYSIS AND MATERIALS TO SUPPORT THE CREATION AND MATURATION OF BUSINESS GOALS AND OBJECTIVESDEVELOPS ANALYSIS AND PROPER DASHBOARDS TO ILLUSTRATE BUSINESS TRENDS AND IDENTIFIES AREAS OF BUSINESS OPPORTUNITIESCOORDINATES AND/OR CONSOLIDATES FINANCIAL INFORMATION NEEDS/REQUESTS AMONG VARIOUS PARTIES (E.G. BUSINESS FINANCE TEAMS, OTHER STAKEHOLDERS, EXTERNAL PARTIES/REGULATORS/AUDITORS AND/OR CENTRALIZED FINANCEACTS AS A KEY RESOURCE TO THE BUSINESS OR FUNCTIONAL UNIT BY PROVIDING RELEVANT AND MEANINGFUL FINANCIAL INFORMATION/DATA /GUIDANCE ON SPECIALIZED PROCEDURES AND/OR ISSUES (E.G. TAX, ACCOUNTING PRINCIPLES, RECONCILIATION/REPORTING/FINANCIAL CONTROLS/FINANCE PROCESSES ETC.) IDENTIFIES VARIANCES AND CONTRIBUTES TO THE ANALYSIS, DUE DILIGENCE AND EXECUTION AND/OR IMPLEMENTATION OF POTENTIAL INITIATIVES, ACQUISITIONS AND/OR BUSINESS RE-STRUCTURES WITHIN DEFINED AREA OF RESPONSIBILITY CONTRIBUTES AND WORKS WITH FINOPS OR SPECIALIZED FINANCE TEAMS TO PROVIDE INPUT AND FEEDBACK ON ENHANCING OPERATIONAL ACTIVITIES S (E.G. REPORT PRODUCTION, SYSTEM QUERIES, PROCESS MAPPING, SPECIALIZED TRACKING, ANALYSIS AND TRANSACTIONAL PROCEDURAL SUPPORT) WHERE APPROPRIATE \n\nSHAREHOLDER ACCOUNTABILITIES\n\nADHERES TO ENTERPRISE FRAMEWORKS OR METHODOLOGIES THAT RELATE TO ACTIVITIES FOR OUR BUSINESS AREAENSURES RESPECTIVE PROGRAMS/POLICIES/PRACTICES ARE WELL MANAGED, MEETS BUSINESS NEEDS, COMPLIES WITH INTERNAL AND EXTERNAL REQUIREMENTS, AND ALIGNS WITH BUSINESS PRIORITIESIDENTIFIES AND INVESTIGATES DATA/ANALYTICS RELATED ISSUESCONSISTENTLY EXERCISES DISCRETION IN MANAGING CORRESPONDENCE, INFORMATION AND ALL MATTERS OF CONFIDENTIALITY; ESCALATES ISSUES WHERE APPROPRIATEENSURES BUSINESS OPERATIONS ARE IN COMPLIANCE WITH APPLICABLE INTERNAL AND EXTERNAL REQUIREMENTS (E.G. FINANCIAL CONTROLS, SEGREGATION OF DUTIES, TRANSACTION APPROVALS AND PHYSICAL CONTROL OF ASSETS)PARTICIPATES IN CROSS-FUNCTIONAL/ENTERPRISE INITIATIVES HELPING TO IDENTIFY RISKCONDUCTS INTERNAL AND EXTERNAL RESEARCH PROJECTS; SUPPORTS THE DEVELOPMENT/DELIVERY OF PRESENTATIONS/COMMUNICATIONS TO MANAGEMENT OR BROADER AUDIENCECONDUCTS MEANINGFUL ANALYSIS AT THE FUNCTIONAL OR ENTERPRISE LEVEL USING RESULTS TO DRAW CONCLUSIONS, MAKES RECOMMENDATIONS, ASSESSES THE EFFECTIVENESS OF PROGRAMS/POLICIES/PRACTICESMONITORS SERVICE, PRODUCTIVITY AND ASSESSES EFFICIENCY LEVELS WITHIN OWN FUNCTION AND IMPLEMENTS CONTINUOUS PROCESS/PERFORMANCE IMPROVEMENTS WHERE OPPORTUNITIES EXISTSUPPORTS THE EXECUTION OF REMEDIATION PLANS TO ADDRESS PERFORMANCE/RISK/GOVERNANCE ISSUESACTIVELY MANAGES RELATIONSHIPS WITHIN AND ACROSS VARIOUS BUSINESS LINES, CORPORATE AND/OR CONTROL FUNCTIONS AND ENSURES ALIGNMENT WITH ENTERPRISE AND/OR REGULATORY REQUIREMENTSKEEPS ABREAST OF EMERGING ISSUES, TRENDS, AND EVOLVING REGULATORY REQUIREMENTSMAINTAINS A CULTURE OF RISK BASED MANAGEMENT AND CONTROL, SUPPORTED BY EFFECTIVE PROCESSES IN ALIGNMENT WITH RISK APPETITE\n\nEMPLOYEE/TEAM ACCOUNTABILITIES\n\nPARTICIPATES FULLY AS A MEMBER OF THE TEAM, SUPPORTS A POSITIVE WORK ENVIRONMENT THAT PROMOTES SERVICE TO THE BUSINESS, QUALITY, INNOVATION AND TEAMWORK AND ENSURES TIMELY COMMUNICATION OF ISSUES/POINTS OF INTERESTPROVIDES THOUGHT LEADERSHIP AND/OR INDUSTRY KNOWLEDGE FOR OWN AREA OF EXPERTISE AND PARTICIPATES IN KNOWLEDGE TRANSFER WITHIN THE TEAM AND BUSINESS UNITKEEPS CURRENT ON EMERGING TRENDS/DEVELOPMENTS AND GROWS KNOWLEDGE OF THE BUSINESS, RELATED TOOLS AND TECHNIQUESPARTICIPATES IN PERSONAL PERFORMANCE MANAGEMENT AND DEVELOPMENT ACTIVITIES, INCLUDING CROSS TRAINING WITHIN OWN TEAMKEEPS OTHERS INFORMED AND UP-TO-DATE ABOUT THE STATUS/PROGRESS OF PROJECTS AND/OR ALL RELEVANT OR USEFUL INFORMATION RELATED TO DAY-TO-DAY ACTIVITIESCONTRIBUTES TO TEAM DEVELOPMENT OF SKILLS AND CAPABILITIES THROUGH MENTORSHIP OF OTHERS, BY SHARING KNOWLEDGE AND EXPERIENCES AND LEVERAGING BEST PRACTICESLEADS, MOTIVATES AND DEVELOPS RELATIONSHIPS WITH INTERNAL AND EXTERNAL BUSINESS PARTNERS/STAKEHOLDERS TO DEVELOP PRODUCTIVE WORKING RELATIONSHIPSCONTRIBUTES TO A FAIR, POSITIVE AND EQUITABLE ENVIRONMENT THAT SUPPORTS A DIVERSE WORKFORCEACTS AS A BRAND AMBASSADOR FOR YOUR BUSINESS AREA/FUNCTION AND THE BANK, BOTH INTERNALLY AND/OR EXTERNALLY\n\nPHYSICAL REQUIREMENTS\n\nNEVER: 0%; OCCASIONAL: 1-33%; FREQUENT: 34-66%; CONTINUOUS: 67-100%\n\nDOMESTIC TRAVEL – OCCASIONALINTERNATIONAL TRAVEL – NEVERPERFORMING SEDENTARY WORK – CONTINUOUSPERFORMING MULTIPLE TASKS – CONTINUOUSOPERATING STANDARD OFFICE EQUIPMENT - CONTINUOUSRESPONDING QUICKLY TO SOUNDS – OCCASIONALSITTING – CONTINUOUSSTANDING – OCCASIONALWALKING – OCCASIONALMOVING SAFELY IN CONFINED SPACES – OCCASIONALLIFTING/CARRYING (UNDER 25 LBS.) – OCCASIONALLIFTING/CARRYING (OVER 25 LBS.) – NEVERSQUATTING – OCCASIONALBENDING – OCCASIONALKNEELING – NEVERCRAWLING – NEVERCLIMBING – NEVERREACHING OVERHEAD – NEVERREACHING FORWARD – OCCASIONALPUSHING – NEVERPULLING – NEVERTWISTING – NEVERCONCENTRATING FOR LONG PERIODS OF TIME – CONTINUOUSAPPLYING COMMON SENSE TO DEAL WITH PROBLEMS INVOLVING STANDARDIZED SITUATIONS – CONTINUOUSREADING, WRITING AND COMPREHENDING INSTRUCTIONS – CONTINUOUSADDING, SUBTRACTING, MULTIPLYING AND DIVIDING – CONTINUOUS\n\nTHE ABOVE STATEMENTS ARE INTENDED TO DESCRIBE THE GENERAL NATURE AND LEVEL OF WORK BEING PERFORMED BY PEOPLE ASSIGNED TO THIS JOB. THEY ARE NOT INTENDED TO BE AN EXHAUSTIVE LIST OF ALL RESPONSIBILITIES, DUTIES AND SKILLS REQUIRED. THE LISTED OR SPECIFIED RESPONSIBILITIES & DUTIES ARE CONSIDERED ESSENTIAL FUNCTIONS FOR ADA PURPOSES.\n\nWHO WE ARE\n\nTD IS ONE OF THE WORLD'S LEADING GLOBAL FINANCIAL INSTITUTIONS AND IS THE FIFTH LARGEST BANK IN NORTH AMERICA BY BRANCHES/STORES. EVERY DAY, WE DELIVER LEGENDARY CUSTOMER EXPERIENCES TO OVER 27 MILLION HOUSEHOLDS AND BUSINESSES IN CANADA, THE UNITED STATES AND AROUND THE WORLD. MORE THAN 95,000 TD COLLEAGUES BRING THEIR SKILLS, TALENT, AND CREATIVITY TO THE BANK, THOSE WE SERVE, AND THE ECONOMIES WE SUPPORT. WE ARE GUIDED BY OUR VISION TO BE THE BETTER BANK AND OUR PURPOSE TO ENRICH THE LIVES OF OUR CUSTOMERS, COMMUNITIES AND COLLEAGUES.\n\nTD IS DEEPLY COMMITTED TO BEING A LEADER IN CUSTOMER EXPERIENCE, THAT IS WHY WE BELIEVE THAT ALL COLLEAGUES, NO MATTER WHERE THEY WORK, ARE CUSTOMER FACING. AS WE BUILD OUR BUSINESS AND DELIVER ON OUR STRATEGY, WE ARE INNOVATING TO ENHANCE THE CUSTOMER EXPERIENCE AND BUILD CAPABILITIES TO SHAPE THE FUTURE OF BANKING. WHETHER YOU’VE GOT YEARS OF BANKING EXPERIENCE OR ARE JUST STARTING YOUR CAREER IN FINANCIAL SERVICES, WE CAN HELP YOU REALIZE YOUR POTENTIAL. THROUGH REGULAR LEADERSHIP AND DEVELOPMENT CONVERSATIONS TO MENTORSHIP AND TRAINING PROGRAMS, WE’RE HERE TO SUPPORT YOU TOWARDS YOUR GOALS. AS AN ORGANIZATION, WE KEEP GROWING – AND SO WILL YOU.\n\nOUR TOTAL REWARDS PACKAGE\n\nOUR TOTAL REWARDS PACKAGE REFLECTS THE INVESTMENTS WE MAKE IN OUR COLLEAGUES TO HELP THEM AND THEIR FAMILIES ACHIEVE THEIR FINANCIAL, PHYSICAL AND MENTAL WELL-BEING GOALS. TOTAL REWARDS AT TD INCLUDES BASE SALARY AND VARIABLE COMPENSATION/INCENTIVE AWARDS (E.G., ELIGIBILITY FOR CASH AND/OR EQUITY INCENTIVE AWARDS, GENERALLY THROUGH PARTICIPATION IN AN INCENTIVE PLAN) AND SEVERAL OTHER KEY PLANS SUCH AS HEALTH AND WELL-BEING BENEFITS, SAVINGS AND RETIREMENT PROGRAMS, PAID TIME OFF (INCLUDING VACATION PTO, FLEX PTO, AND HOLIDAY PTO), BANKING BENEFITS AND DISCOUNTS, CAREER DEVELOPMENT, AND REWARD AND RECOGNITION. LEARN MORE\n\nADDITIONAL INFORMATION\n\nWE’RE DELIGHTED THAT YOU’RE CONSIDERING BUILDING A CAREER WITH TD. THROUGH REGULAR DEVELOPMENT CONVERSATIONS, TRAINING PROGRAMS, AND A COMPETITIVE BENEFITS PLAN, WE’RE COMMITTED TO PROVIDING THE SUPPORT OUR COLLEAGUES NEED TO THRIVE BOTH AT WORK AND AT HOME.\n\nCOLLEAGUE DEVELOPMENT \n\nIF YOU’RE INTERESTED IN A SPECIFIC CAREER PATH OR ARE LOOKING TO BUILD CERTAIN SKILLS, WE WANT TO HELP YOU SUCCEED. YOU’LL HAVE REGULAR CAREER, DEVELOPMENT, AND PERFORMANCE CONVERSATIONS WITH YOUR MANAGER, AS WELL AS ACCESS TO AN ONLINE LEARNING PLATFORM AND A VARIETY OF MENTORING PROGRAMS TO HELP YOU UNLOCK FUTURE OPPORTUNITIES. WHETHER YOU HAVE A PASSION FOR HELPING CUSTOMERS AND WANT TO EXPAND YOUR EXPERIENCE, OR YOU WANT TO COACH AND INSPIRE YOUR COLLEAGUES, THERE ARE MANY DIFFERENT CAREER PATHS WITHIN OUR ORGANIZATION AT TD – AND WE’RE COMMITTED TO HELPING YOU IDENTIFY OPPORTUNITIES THAT SUPPORT YOUR GOALS.\n\nTRAINING & ONBOARDING\n\nWE WILL PROVIDE TRAINING AND ONBOARDING SESSIONS TO ENSURE THAT YOU’VE GOT EVERYTHING YOU NEED TO SUCCEED IN YOUR NEW ROLE.\n\nINTERVIEW PROCESS \n\nWE’LL REACH OUT TO CANDIDATES OF INTEREST TO SCHEDULE AN INTERVIEW. WE DO OUR BEST TO COMMUNICATE OUTCOMES TO ALL APPLICANTS BY EMAIL OR PHONE CALL.\n\nACCOMMODATION\n\nIF YOU ARE AN APPLICANT WITH A DISABILITY AND NEED ACCOMMODATIONS TO COMPLETE THE APPLICATION PROCESS, EMAIL THE TD BANK US WORKPLACE ACCOMMODATIONS PROGRAM AT USWAPTDO@TD.COM. INCLUDE YOUR FULL NAME, BEST WAY TO REACH YOU, AND THE ACCOMMODATION NEEDED TO ASSIST YOU WITH THE APPLICATION PROCESS.\n\nALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, OR STATUS AS A PROTECTED VETERAN.",
    "job_skill_set": [
      "financial accounting",
      "accounting principles",
      "process improvement",
      "project management",
      "communication",
      "problem solving",
      "teamwork",
      "leadership",
      "adaptability",
      "customer service",
      "interpersonal skills",
      "financial analysis",
      "reporting",
      "data analysis",
      "dashboards",
      "financial controls",
      "risk management",
      "stakeholder management",
      "regulatory compliance",
      "tax knowledge",
      "auditing",
      "business strategy",
      "critical thinking",
      "mentorship",
      "collaboration",
      "discretion",
      "time management"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "analysis",
      "analyst",
      "auditing",
      "business",
      "collaboration",
      "communication",
      "compliance",
      "controls",
      "critical",
      "customer",
      "dashboards",
      "data",
      "discretion",
      "finance",
      "financial",
      "improvement",
      "interpersonal",
      "knowledge",
      "leadership",
      "management",
      "mentorship",
      "principles",
      "problem",
      "process",
      "project",
      "regulatory",
      "reporting",
      "risk",
      "senior",
      "service",
      "skills",
      "solving",
      "stakeholder",
      "strategy",
      "tax",
      "teamwork",
      "thinking",
      "time",
      "us"
    ]
  },
  {
    "job_id": "3901349958",
    "job_title": "Finance Associate (Hybrid)",
    "category": "FINANCE",
    "job_description": "COMPANY DESCRIPTION\n\nEVERSANA INTOUCH™ IS A LEADING FULL-SERVICE, GLOBAL HEALTHCARE AGENCY SERVING THE LIFE SCIENCES AND PHARMACEUTICAL INDUSTRIES. WE PROVIDE NEXT-GENERATION CREATIVE AND MEDIA SERVICES, ENTERPRISE SOLUTIONS AND DATA ANALYTICS SERVICES FOR CLIENTS.\n\nWE COMBINE THE POWER OF WORLD-CLASS CREATIVE AND DIGITAL TEAMS WITH DEEP MARKET ACCESS, PAYER, AND HEALTHCARE COMMUNICATIONS EXPERTISE TO PROVIDE INNOVATIVE SOLUTIONS TO LIFE SCIENCE COMPANIES THAT WANT TO CONNECT WITH CONSUMERS, HEALTHCARE PROFESSIONALS, AND PAYERS.\n\nWE GET FIRED UP WHEN PEOPLE TALK ABOUT GETTING—AND STAYING—HEALTHY. THAT’S WHERE WE FIND OUR INSPIRATION: IN THE VERY HUMAN EXPERIENCES OF PATIENTS, DOCTORS, AND EVEN EACH OTHER. THEN, WE COLLABORATE ON WAYS TO MAKE CARING FOR ONE’S HEALTH MORE ACHIEVABLE, CONNECTING PATIENTS AND PHYSICIANS WITH THE INFORMATION AND TOOLS THEY NEED.\n\nAND AS A PART OF EVERSANA, A PIONEER IN NEXT-GENERATION COMMERCIAL SERVICES, WE CONNECT DOTS THAT OTHER AGENCIES CAN’T, HELPING DRIVE COMMERCIALIZATION SUCCESS.\n\nOUR EIGHT AFFILIATES WITHIN THE EVERSANA INTOUCH NETWORK INCLUDE EVERSANA INTOUCH SOLUTIONS, EVERSANA INTOUCH PROTO, EVERSANA INTOUCH SEVEN, EVERSANA INTOUCH OXYGEN, EVERSANA INTOUCH ENGAGE, EVERSANA INTOUCH TTC, EVERSANA INTOUCH MEDIA, AND EVERSANA INTOUCH INTERNATIONAL.\n\nACROSS OUR GROWING ORGANIZATION, WE EMBRACE DIVERSITY IN BACKGROUNDS AND EXPERIENCES. IMPROVING PATIENT LIVES AROUND THE WORLD IS A PRIORITY, AND WE NEED PEOPLE FROM ALL BACKGROUNDS AND SWATHS OF LIFE TO HELP BUILD THE FUTURE OF THE HEALTHCARE AND THE LIFE SCIENCES INDUSTRY. WE BELIEVE OUR PEOPLE MAKE ALL THE DIFFERENCE IN CULTIVATING AN INCLUSIVE CULTURE THAT EMBRACES OUR CULTURAL BELIEFS. WE ARE DELIBERATE AND SELF-REFLECTIVE ABOUT THE KIND OF TEAM AND CULTURE WE ARE BUILDING. WE LOOK FOR TEAM MEMBERS THAT ARE NOT ONLY STRONG IN THEIR OWN APTITUDES BUT ALSO WHO CARE DEEPLY ABOUT EVERSANA INTOUCH, OUR PEOPLE, CLIENTS AND MOST IMPORTANTLY, THE PATIENTS WE SERVE.\n\nJOB DESCRIPTION\n\nWHAT DOES A FINANCE ASSOCIATE DO?\n\nTHE FINANCE TEAM WORKS WITH OUR INTERNAL TEAMS AND CLIENTS TO HELP MANAGE ALL ASPECTS OF THE FINANCIAL PROCESS, FROM DEVELOPING PROJECT SCOPES TO RECONCILING THOSE SCOPES AT THE CLOSE OF THE PROJECT, AS WELL AS REPORTING ALL BILLING, REVENUE, AND SOW (STATEMENT OF WORK) ACTIVITY. THE TEAM IS RESPONSIBLE FOR TRACKING AND REPORTING STAFF UTILIZATION, LABOR, AND OUT-OF-POCKET COSTS, IN ADDITION TO ADDRESSING QUESTIONS REGARDING INVOICES, ESTIMATES AND GENERATING AD HOC REPORTS.\n\nWORK WITH AND SUPPORT THE EVERSANA INTOUCH FINANCE TEAM RESPONSIBLE FOR PROCESSING, TRACKING, CLIENT BILLING SYSTEMS AND REPORTS ENSURE THE INTEGRITY OF SYSTEM REPORTS, CLIENT INVOICES AND BACK UP WORK CLOSELY WITH AGENCY ACCOUNT SERVICES AND OPERATIONS TEAMS \n\nQUALIFICATIONS\n\nWHAT ARE WE LOOKING FOR?\n\nBACHELOR’S DEGREE (OR EQUIVALENT EDUCATION PLUS PROFESSIONAL EXPERIENCE) REQUIRED RELEVANT INTERNSHIP EXPERIENCE PREFERRED, AGENCY EXPERIENCE A PLUS ABILITY TO ENSURE THAT CLIENT BILLING, REPORTS AND ALL REQUESTS ARE COMPLETED IN A TIMELY MANNER DETAIL ORIENTED, ANALYTICAL, EXCEPTIONAL ORGANIZATIONAL SKILLS AND A CREATIVE PROBLEM SOLVER UNDERSTANDING OF THE CONFIDENTIAL NATURE OF OUR WORK PROFESSIONAL DEMEANOR, SERVICE-FOCUSED, CURIOUS, QUICK LEARNER, AND CAPACITY TO THRIVE IN A FAST-PACED ENVIRONMENT PROFICIENT IN ALL APPLICATIONS OF MICROSOFT OFFICE SUITE\n\nADDITIONAL INFORMATION\n\nOUR CULTURAL BELIEFS:\n\nPATIENT MINDED I ACT WITH THE PATIENT’S BEST INTEREST IN MIND.\n\nCLIENT DELIGHT I OWN EVERY CLIENT EXPERIENCE AND ITS IMPACT ON RESULTS.\n\nTAKE ACTION I AM EMPOWERED AND EMPOWER OTHERS TO ACT NOW.\n\nGROW TALENT I OWN MY DEVELOPMENT AND INVEST IN THE DEVELOPMENT OF OTHERS.\n\nWIN TOGETHER I PASSIONATELY CONNECT WITH ANYONE, ANYWHERE, ANYTIME TO ACHIEVE RESULTS.\n\nCOMMUNICATION MATTERS I SPEAK UP TO CREATE TRANSPARENT, THOUGHTFUL AND TIMELY DIALOGUE.\n\nEMBRACE DIVERSITY I CREATE AN ENVIRONMENT OF AWARENESS AND RESPECT.\n\nALWAYS INNOVATE I AM BOLD AND CREATIVE IN EVERYTHING I DO.\n\nFROM EVERSANA’S INCEPTION, DIVERSITY, EQUITY & INCLUSION HAVE ALWAYS BEEN KEY TO OUR SUCCESS. WE ARE AN EQUAL OPPORTUNITY EMPLOYER, AND OUR EMPLOYEES ARE PEOPLE WITH DIFFERENT STRENGTHS, EXPERIENCES, AND BACKGROUNDS WHO SHARE A PASSION FOR IMPROVING THE LIVES OF PATIENTS AND LEADING INNOVATION WITHIN THE HEALTHCARE INDUSTRY. DIVERSITY NOT ONLY INCLUDES RACE AND GENDER IDENTITY, BUT ALSO AGE, DISABILITY STATUS, VETERAN STATUS, SEXUAL ORIENTATION, RELIGION, AND MANY OTHER PARTS OF ONE’S IDENTITY. ALL OF OUR EMPLOYEES’ POINTS OF VIEW ARE KEY TO OUR SUCCESS, AND INCLUSION IS EVERYONE'S RESPONSIBILITY.\n\nFOLLOW US ON LINKEDIN | TWITTER",
    "job_skill_set": [
      "financial reporting",
      "client billing systems",
      "Microsoft Office Suite",
      "data analytics",
      "project management",
      "reconciliation",
      "ad hoc reporting",
      "detail-oriented",
      "analytical skills",
      "organizational skills",
      "problem solving",
      "communication",
      "adaptability",
      "service-focused",
      "curiosity"
    ],
    "short_keywords": [
      "ad",
      "adaptability",
      "analytical",
      "analytics",
      "associate",
      "billing",
      "client",
      "communication",
      "curiosity",
      "data",
      "detailoriented",
      "finance",
      "financial",
      "hoc",
      "hybrid",
      "management",
      "microsoft",
      "office",
      "organizational",
      "problem",
      "project",
      "reconciliation",
      "reporting",
      "servicefocused",
      "skills",
      "solving",
      "suite",
      "systems"
    ]
  },
  {
    "job_id": "3902364315",
    "job_title": "VP Finance – Healthcare Services – Rapid Growth – Private Equity, 78796",
    "category": "FINANCE",
    "job_description": "VP FINANCE – HEALTHCARE SERVICES – RAPID GROWTH – PRIVATE EQUITY  \nOUR CLIENT IS A RAPIDLY GROWING, PRIMARY CARE MEDICAL PRACTICE GROUP THAT IS SEEKING AN ACCOMPLISHED VICE PRESIDENT FINANCE. THE VP FINANCE WILL FUNCTION AS A STRATEGIC AND TACTICAL BUSINESS PARTNER TO THE CHIEF EXECUTIVE OFFICER AND IS THE LEAD FINANCE MEMBER OF THE EXECUTIVE TEAM. WITH THE BACKING OF A LEADING PRIVATE EQUITY SPONSOR, THE COMPANY IS SEEKING TO EXPAND ITS SERVICE OFFERING OVER THE NEXT SEVERAL YEARS AND TO POSITION ITSELF AS ONE OF THE LEADING COMPANIES IN ITS SPECIFIC NICHE MARKET WHILE PREPARING TO TAKE THE BUSINESS TO MARKET.\nQUALIFIED CANDIDATES MUST HAVE EXPERIENCE OPERATING AT THE SENIOR FINANCE LEVEL WITHIN A MULTI-LOCATION HEALTHCARE SERVICES ENVIRONMENT. YOU MUST HAVE EXPERIENCE WORKING ON COMMERCIAL INSURER PAYOUTS. IDEALLY YOU WILL HAVE A CLEAR LEVEL OF COMFORT BUILDING ROBUST FINANCIAL INFRASTRUCTURE WITHIN THE CONTEXT OF A HIGHLY LEVERED ENVIRONMENT WITH MINIMAL SUPPORTING RESOURCES. YOU WILL BE EXPECTED TO ADOPT A HANDS-ON APPROACH AND COMMUNICATE AT THE BOARD LEVEL. IDEALLY YOU WILL HAVE ACQUIRED EXPERIENCE WITH EITHER THE DUE DILIGENCE AND INTEGRATION OF ACQUISITION TRANSACTIONS AND/OR BUILDING THE FINANCE/ACCOUNTING INFRASTRUCTURE TO SUPPORT DE NOVO GROWTH. THE IDEAL CANDIDATE WILL BE A CPA AND WILL HAVE A STRONG UNDERSTANDING OF REVENUE CYCLE MANAGEMENT WITHIN A HEALTHCARE SERVICES BUSINESS. \nA COMPETITIVE COMPENSATION PACKAGE IS OFFERED AND THE INCENTIVE PACKAGE WILL INCLUDE A SIGNIFICANT EQUITY STAKE IN THE ENTERPRISE.",
    "job_skill_set": [
      "accounting",
      "multi-location operations",
      "strategic thinking",
      "tactical execution",
      "communication",
      "leadership",
      "hands-on approach",
      "team collaboration",
      "financial infrastructure",
      "healthcare services",
      "commercial insurer payouts",
      "due diligence",
      "revenue cycle management",
      "private equity",
      "de novo growth",
      "CPA"
    ],
    "short_keywords": [
      "78796",
      "accounting",
      "approach",
      "collaboration",
      "commercial",
      "communication",
      "cpa",
      "cycle",
      "de",
      "diligence",
      "due",
      "equity",
      "execution",
      "finance",
      "financial",
      "growth",
      "handson",
      "healthcare",
      "infrastructure",
      "insurer",
      "leadership",
      "management",
      "multilocation",
      "novo",
      "operations",
      "payouts",
      "private",
      "rapid",
      "revenue",
      "services",
      "strategic",
      "tactical",
      "team",
      "thinking",
      "vp"
    ]
  },
  {
    "job_id": "3903496525",
    "job_title": "Manager, Corporate Finance",
    "category": "FINANCE",
    "job_description": "FOUNDED IN 2019, TILLMAN NETWORKS PROVIDES A HOLISTIC SOLUTION TO NETWORK DEPLOYMENT AT THE NATIONAL LEVEL. TILLMAN NETWORKS OFFERS A COMPLETE PORTFOLIO OF SERVICES INCLUDING SITE DEVELOPMENT, DESIGN AND ENGINEERING, IMPLEMENTATION AND MAINTENANCE OF NETWORK INFRASTRUCTURE. TILLMAN NETWORKS STRIVES TO PROVIDE HIGH QUALITY, TURNKEY SOLUTIONS THAT PUT ITS CUSTOMERS FIRST.AT TILLMAN NETWORKS WE PUT OUR PEOPLE FIRST. AS A CULTURE-DRIVEN ORGANIZATION, THE CONTINUED PROGRESS OF AN ORGANIZATION LIKE OURS DEPENDS ON ITS PEOPLE. AS PART OF THE TILLMAN NETWORKS TEAM, YOU’LL COLLABORATE WITH PEOPLE OF ALL STYLES, SKILLS SETS AND BACKGROUNDS TO REALIZE OUR VISION WHILE FOSTERING A COMMUNITY WHERE EVERYONE FEELS INCLUDED AND EMPOWERED TO DO THEIR BEST WORK.\nROLE SUMMARYTILLMAN NETWORKS IS RAPIDLY GROWING AND LOOKING TO ADD A MANAGER, CORPORATE TO JOIN OUR FINANCE TEAM. REPORTING TO THE CFO, THE MANAGER, CORPORATE FINANCE IS RESPONSIBLE FOR BUILDING AND SUPPORTING SCALABLE REPORTING SYSTEMS AND DRIVING INSIGHT INTO THE HISTORICAL AND FORECASTED FINANCIAL PERFORMANCE FOR SENIOR MANAGEMENT. IN ADDITION, THE MANAGER, CORPORATE FINANCE WILL OVERSEE THE FUNCTIONS OF REPORTING METRICS, ANALYZING METHODOLOGIES, SUGGESTING OPERATION IMPROVEMENTS, AND BUILDING PROPOSALS EVALUATIONS IN A CROSS-FUNCTIONAL ENVIRONMENT. THIS IS AN INDIVIDUAL CONTRIBUTOR (IC) ROLE WITH THE PLAN TO DEVELOP AND LEAD A TEAM OF ANALYSTS IN THE FUTURE.\nTHE IDEAL CANDIDATE IS A TEAM PLAYER WHO WILL BE RESPONSIBLE FOR WORKING WITH THE COMPANY’S FINANCIAL AND OPERATIONAL DATA.\n**THIS ROLE IS A REMOTE/HYBRID ROLE IN THE NYC METROPOLITAN AREA. APPLICANTS MUST LIVE WITHIN TRAVEL DISTANCE OF OUR NEW YORK CORPORATE OFFICE** APPLICANTS LIVING OUTSIDE OF THE NYC METROPOLITAN AREA WILL NOT BE CONSIDERED FOR THE POSITION.\nWHAT YOU’LL DODEVELOP ROBUST SHORT-TERM AND LONG-TERM FORECASTS (P&L, BALANCE SHEET, CASH FLOW, AND CREDIT PROFILE) TO HELP SHAPE FUTURE EXPECTATIONS FOR THE COMPANYCREATE AUTOMATED EXCEL MODELSMANAGE THE SDP RECONCILIATION PROCESSMANAGE DATE INTEGRITY ACROSS ALL UTILIZED PLATFORMS. ENHANCE DATA SOURCING AND QUALITY: INTEGRITY, COMPLETENESS, AND ACCURACYENHANCE REPORT AND ANALYSIS PRODUCTION: TIMELINESS, COMPLETENESS, AND ACCURACYBUILD CROSS-FUNCTIONAL PARTNERSHIPS, INTERNALLY & EXTERNALLYMAINTAIN COMPETITIVE MARKET KNOWLEDGEPERFORM VARIOUS AD HOC ANALYTICS RELATED TO OPERATIONAL AND FINANCIAL PERFORMANCE· PERFORM OTHER DUTIES AS REQUIRED.\nPREFERRED QUALIFICATIONSGLOBAL MARKET KNOWLEDGE, GOOD BUSINESS UNDERSTANDING, PROBLEM-SOLVING SKILLS, AND BUSINESS INTUITION.PREVIOUS BANKING OR CONSULTING KNOWLEDGE AND/OR EXPERIENCE (PREFERABLE)ABILITY TO WORK IN A FAST-PACED, ENTREPRENEURIAL ENVIRONMENT WITH STRICT DEADLINES.\nWHAT WE OFFER\nAS A GROWING COMPANY, WE ARE COMMITTED TO ATTRACTING AND DEVELOPING THE BEST TALENT BY OFFERING A WORKPLACE WHERE RESULTS ARE RECOGNIZED AND REWARDED. WE OFFER A GREAT OPPORTUNITY FOR:\n· A COLLABORATIVE ENVIRONMENT· COMPETITIVE BENEFITS AND WELLNESS PACKAGE, INCLUDING MEDICAL, DENTAL AND VISION COVERAGE· 401K PLAN WITH COMPANY MATCH· COMPETITIVE VACATION POLICY· PAID PARENTAL LEAVE· EMPLOYEE RECOGNITION PROGRAM\nWE CONSIDER A WIDE RANGE OF FACTORS WHEN DETERMINING COMPENSATION, WHICH MAY CAUSE YOUR COMPENSATION TO VARY DEPENDING ON YOUR SKILLS, EXPERIENCE, AND QUALIFICATIONS. TILLMAN NETWORKS IS AN EQUAL OPPORTUNITY EMPLOYER. WE EVALUATE QUALIFIED APPLICANTS WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, VETERAN STATUS, AND OTHER LEGALLY PROTECTED CHARACTERISTICS.",
    "job_skill_set": [
      "financial forecasting",
      "data integrity management",
      "reporting metrics analysis",
      "ad hoc analytics",
      "market knowledge",
      "business analysis",
      "cross-functional collaboration",
      "banking knowledge",
      "problem solving",
      "team player",
      "communication",
      "adaptability",
      "time management",
      "leadership potential",
      "Excel modeling",
      "consulting experience",
      "entrepreneurial mindset"
    ],
    "short_keywords": [
      "ad",
      "adaptability",
      "analysis",
      "analytics",
      "banking",
      "business",
      "collaboration",
      "communication",
      "consulting",
      "corporate",
      "crossfunctional",
      "data",
      "entrepreneurial",
      "excel",
      "experience",
      "finance",
      "financial",
      "forecasting",
      "hoc",
      "integrity",
      "knowledge",
      "leadership",
      "management",
      "manager",
      "market",
      "metrics",
      "mindset",
      "modeling",
      "player",
      "potential",
      "problem",
      "reporting",
      "solving",
      "team",
      "time"
    ]
  },
  {
    "job_id": "3904572888",
    "job_title": "Finance Learning Advisor",
    "category": "FINANCE",
    "job_description": "WELCOME TO CONOCOPHILLIPS, WHERE INNOVATION AND EXCELLENCE CREATE A PLATFORM FOR OPPORTUNITY AND GROWTH. COME REALIZE YOUR FULL POTENTIAL HERE.\n\nWHO WE ARE\n\nWE ARE ONE OF THE WORLD'S LARGEST INDEPENDENT EXPLORATION AND PRODUCTION COMPANIES, BASED ON PROVED RESERVES AND PRODUCTION OF LIQUIDS AND NATURAL GAS. WITH OPERATIONS AND ACTIVITIES IN 13 COUNTRIES, WE EXPLORE FOR, DEVELOP, AND PRODUCE CRUDE OIL AND NATURAL GAS GLOBALLY. WE ARE CHALLENGED WITH AN IMPORTANT JOB TO SAFELY FIND AND DELIVER ENERGY TO THE WORLD. OUR EMPLOYEES ARE CRITICAL TO OUR SUCCESS, AND WITH THEM WE POWER CIVILIZATION.\n\nWE'RE GROUNDED BY OUR SPIRIT VALUES - SAFETY, PEOPLE, INTEGRITY, RESPONSIBILITY, INNOVATION, AND TEAMWORK. THESE VALUES POSITION US TO DELIVER STRONG PERFORMANCE IN A DYNAMIC BUSINESS - BUT NOT AT ALL COSTS. WE BELIEVE IT'S NOT JUST WHAT WE DO - IT'S HOW WE DO IT - THAT SETS US APART.\n\nWE STRIVE TO MAKE A SIGNIFICANT DIFFERENCE IN THE COMMUNITIES WHERE WE LIVE AND OPERATE. WE CREATE AN INCLUSIVE ENVIRONMENT THAT VALUES ALL VOICES AND OPINIONS. TOGETHER, THE DIFFERENT BACKGROUNDS, EXPERIENCES, IDEAS, AND PERSPECTIVES OF OUR EMPLOYEES DRIVE OUR SUCCESS.\n\nJOB SUMMARYDESCRIPTION\n\nTHE MISSION OF THE LEARNING & COMPETENCIES TEAM IS TO DEVELOP SKILLS WITHIN THE WORKFORCE THAT SUPPORT CAREER DEVELOPMENT AND HELP MEET CONOCOPHILLIPS' STRATEGIC OBJECTIVES. AS FINANCE LEARNING ADVISOR, YOU WILL FACILITATE THE DESIGN, DEVELOPMENT AND EXECUTION OF FINANCE LEARNING PROGRAMS, RANGING FROM FINANCE NEW HIRE ONBOARDING TO MENTORSHIP PROGRAMS, AND FINANCE EMPLOYEE AND LEADERSHIP DEVELOPMENT PROGRAMS.\n\nTHE FINANCE LEARNING ADVISOR ROLE IS AN EXCELLENT DEVELOPMENT OPPORTUNITY FOR AN ENERGETIC EMPLOYEE WITH PASSION FOR LEARNING AND SKILLS DEVELOPMENT. THE ROLE REQUIRES ENGAGEMENT AND NETWORKING WITH GLOBAL FINANCE LEADERS, TALENT MANAGEMENT TEAM MEMBERS, AND KEY STAKEHOLDERS TO DEVELOP HIGH-IMPACT LEARNING PROGRAMS. LEARNING ADVISORS ALSO HAVE A CHANCE TO EXPAND THEIR OWN FUNCTIONAL SKILLS AND STRENGTHEN STAKEHOLDER MANAGEMENT, INTEGRATION, AND INFLUENCING SKILLS THROUGH THEIR COLLABORATION WITH THE BUSINESS.\n\nIF SELECTED AS THE FINANCE LEARNING ADVISOR, YOU WILL TAKE A LEAD ROLE IN DEVELOPING FUNCTIONAL TRAINING STRATEGY AND DEVELOPMENT PROGRAMS IN PARTNERSHIP WITH FINANCE LEADERS AND KEY STAKEHOLDERS. YOU WILL HELP DEFINE SKILL GAPS AND THE LEARNING AND DEVELOPMENT REQUIRED TO CLOSE THESE GAPS IN SERVICE OF BUSINESS GOALS. THIS WILL TRANSLATE INTO LEARNING PLANS THAT DELIVER THE MOST IMPACTFUL AND ENGAGING LEARNING SOLUTIONS TO MEET FINANCE NEEDS.\n\nTHIS ROLE MAY BE BASED IN HOUSTON OR BARTLESVILLE.\n\nJOB DESCRIPTION\n\nYOUR RESPONSIBILITIES MAY INCLUDE:\n\nCULTIVATE A WORKFORCE CULTURE OF DEI, INNOVATION, AND CONTINUOUS LEARNING BY SUPPORTING THE DEVELOPMENT AND DELIVERY OF LEARNING AND DEVELOPMENT OFFERINGS FOR GLOBAL FINANCEPROVIDE NEW EMPLOYEES WITH AN INTRODUCTION TO THE INDUSTRY, COMPANY, CULTURE, AND FINANCE FUNCTION, ALLOWING THEM TO BUILD THEIR NETWORK EARLY AND TO INTERACT WITH FINANCE LEADERSHIPPROVIDE CURRENT AND FUTURE LEADERS WITH A HIGH-LEVEL OVERVIEW OF KEY COMPANY FOCUS AREAS AND CULTURE, REINFORCE LEADERSHIP COMPETENCIES, AND DEVELOP THE ABILITY TO DRIVE PERFORMANCE BY ENGAGING AND DEVELOPING THE WORKFORCEPROVIDE EXPERIENCED EMPLOYEES WITH AN OPPORTUNITY TO DEVELOP NEW SKILLS, FURTHER REFINE EXISTING SKILLS, AND DEMONSTRATE THE ABILITY TO DRIVE AN INNOVATIVE PROJECT TO COMPLETION,COORDINATE AND EXECUTE THE FINANCE MENTOR MATCH PROGRAM THROUGH COLLABORATION WITH THE FINANCE TMT AND FINANCE LEADERSHIPMANAGE CONTINUING PROFESSIONAL EDUCATION SPONSORSHIP AND INTERNAL TRAINING CERTIFICATIONENSURE ALL FINANCE LEARNING SOLUTIONS ARE ALIGNED WITH THE NEEDS AND REQUIREMENTS OF THE FUNCTION AND REVIEWED AND APPROVED BY FINANCE LEADERSHIPMAINTAIN A SKILLS CURRICULUM ALIGNED WITH THE FINANCE CAREER MAPS, COORDINATING PERIODIC UPDATES WITH FINANCE LEADERSHIPPROVIDE PERIODIC UPDATES ON LEARNING PROGRAMS TO SENIOR LEADERS IN FINANCE AND OTHER POTENTIALLY INTERESTED FUNCTIONAL GROUPS WITHIN CONOCOPHILLIPSPROVIDE RESEARCH AND INSIGHT REGARDING THE BEST LEARNING PRACTICES AND LEARNING SOLUTIONS TO IMPROVE PERFORMANCECREATE, ANALYZE, AND APPLY LEARNING MEASURES AND METRICS TO ASSESS: INSTRUCTOR AND COURSE PERFORMANCE, PERFORMANCE AND COST EFFECTIVENESS OF EXTERNAL TRAINING SUPPLIERS, PROVIDE LEARNING BUDGETS AND RESOURCING FORECASTS AND ENSURE EXECUTION OF ANNUAL LEARNING PLAN\n\n\nBASIC/REQUIRED\n\nMUST BE LEGALLY AUTHORIZED TO WORK IN THE UNITED STATES ON A FULL-TIME BASIS FOR ANYONE OTHER THAN CURRENT EMPLOYERBACHELOR'S DEGREE OR HIGHER IN FINANCE, HUMAN RESOURCES, OTHER RELATED FIELD, OR FOREIGN EQUIVALENT1 OR MORE YEARS OF EXPERIENCE SUPPORTING AND/OR DEVELOPING TRAINING CONTENT OR EMPLOYEE DEVELOPMENT PROGRAMSINTERMEDIATE PROFICIENCY WITH MS O365 APPLICATIONS: POWERPOINT, EXCEL, WORD, SHAREPOINT AND TEAMS\n\n\nPREFERRED\n\n3 OR MORE YEARS OF EXPERIENCE PARTNERING AND/OR CONSULTING WITH KEY BUSINESS LEADERS1 OR MORE YEARS OF EXPERIENCE IN MULTIPLE ROLES AND/OR BU LOCATIONSINTERMEDIATE KNOWLEDGE OF BUSINESS PROCESSES, POLICIES, PROCEDURES, AND CONTRACTSPRIOR EXPOSURE TO FINANCE OR FINANCIAL CONCEPTS IN THE WORKPLACEGOOD ORGANIZATIONAL AND TIME MANAGEMENT SKILLSSTRONG PRESENTATION SKILLSALIGNS EFFORTS AND PRIORITIES OF THE TEAM WITH THE STRATEGIC DIRECTION OF THE BROADER ORGANIZATIONABILITY TO COMMUNICATE OPTIMALLY IN AN INCLUSIVE MANNER WITH OTHERS REGARDLESS OF THEIR LEVEL, CULTURE OR ROLE IN THE ORGANIZATIONTAKES OWNERSHIP OF ACTIONS AND FOLLOWS THROUGH ON COMMITMENTSABILITY TO PROCESS MULTIPLE TASKS CONCURRENTLY, MEET DEADLINES AND SET PRIORITIES TO KEEP PACE WITH A CHANGING WORK ENVIRONMENTBUILDS POSITIVE RELATIONSHIPS ACROSS ORGANIZATIONS THAT DEVELOP A STRONG WORK ENVIRONMENTABILITY TO WORK OPTIMALLY WITH MULTIPLE DISCIPLINES IN A TEAM ENVIRONMENTPROVEN ABILITY TO FORM RELATIONSHIPS WITH AND TO INFLUENCE SENIOR LEADERSPROVEN ABILITY TO DRIVE AND DELIVER RESULTS WITHOUT DIRECT AUTHORITYENCOURAGES NEW WAYS OF LOOKING AT PROBLEMS, PROCESSES, AND SOLUTIONSPOSITIVE, CONSTRUCTIVE \"CAN-DO\" ATTITUDE WITH COMMITMENT TO ALL CONOCOPHILLIPS SPIRIT VALUESDELIVERS RESULTS THROUGH REALISTIC PLANNING TO ACCOMPLISH GOALSBUILDS POSITIVE RELATIONSHIPS BASED ON TRUST AND SEEKS COLLABORATION ACROSS ORGANIZATIONAL BOUNDARIES TO ACHIEVE GOALSLISTENS ACTIVELY AND INVITES INNOVATIVE IDEAS FOR SHARED UNDERSTANDING, THEN INFLUENCES AND ACTS TO DRIVE PERFORMANCE AND ACHIEVE RESULTS\n\n\nAPPLY BEFORE: APRIL 21, 2024\n\nSPONSORSHIP: CONOCOPHILLIPS' SPONSORSHIP FOR EMPLOYMENT AUTHORIZATION IN THE U.S. IS NOT AVAILABLE FOR THIS POSITION.\n\nEEO: IN THE US, CONOCOPHILLIPS IS AN EQUAL OPPORTUNITY/AFFIRMATIVE ACTION EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, NATIONAL ORIGIN, AGE, DISABILITY, VETERAN STATUS, GENDER IDENTITY OR EXPRESSION, GENETIC INFORMATION, OR ANY OTHER LEGALLY PROTECTED STATUS.",
    "job_skill_set": [
      "finance",
      "training content development",
      "employee development programs",
      "PowerPoint",
      "Excel",
      "Word",
      "business processes",
      "financial concepts",
      "learning solutions",
      "communication",
      "teamwork",
      "organizational skills",
      "time management",
      "presentation skills",
      "relationship building",
      "influencing skills",
      "problem solving",
      "ownership",
      "adaptability",
      "positive attitude",
      "collaboration",
      "active listening",
      "innovation",
      "MS O365",
      "SharePoint",
      "Teams",
      "learning metrics"
    ],
    "short_keywords": [
      "active",
      "adaptability",
      "advisor",
      "attitude",
      "building",
      "business",
      "collaboration",
      "communication",
      "concepts",
      "content",
      "development",
      "employee",
      "excel",
      "finance",
      "financial",
      "influencing",
      "innovation",
      "learning",
      "listening",
      "management",
      "metrics",
      "ms",
      "o365",
      "organizational",
      "ownership",
      "positive",
      "powerpoint",
      "presentation",
      "problem",
      "processes",
      "programs",
      "relationship",
      "sharepoint",
      "skills",
      "solutions",
      "solving",
      "teams",
      "teamwork",
      "time",
      "training",
      "word"
    ]
  },
  {
    "job_id": "3903846870",
    "job_title": "Finance Manager, WW Ops Finance - Trans Support",
    "category": "FINANCE",
    "job_description": "DESCRIPTION\n\nAMAZON'S \"LAST MILE\" DELIVERY SERVICE PARTNER (DSP) PROGRAM IS RESPONSIBLE FOR DELIVERING PACKAGES (AND SMILES) TO HOUSEHOLDS/BUSINESSES ACROSS THE PLANET. OUR FINANCE TEAM CLOSELY PARTNERS TO SUPPORT THIS RAPIDLY EXPANDING BUSINESS WHILE BUILDING A PORTFOLIO OF DELIVERY STATIONS, VANS, AND TECHNOLOGY TO DELIVER CUSTOMERS' PACKAGES ON TIME - OFTEN NEXT DAY, SOMETIMES FASTER. WE AUGMENT OUR TRADITIONAL \"DELIVER BY VAN\" WITH OTHER MODELS INCLUDING AMAZON FLEX (GIG ECONOMY DRIVERS), AMAZON LOCKERS, AND MORE - ALL DESIGNED TO DELIVER SMILES TO OUR CUSTOMERS. YOU WILL MAKE HISTORY AS YOU HELP BUILD ONE OF THE LARGEST CARRIERS ON THE PLANET.\n\nLAST MILE ON-THE-ROAD (OTR) FINANCE SEEKS A FINANCE MANAGER TO SUPPORT THE CONTROLLERSHIP PILLAR. LAST MILE OFFERS OPPORTUNITIES TO GROW YOUR CAREER AS YOU ENGAGE ON ONE OF THE MANY FACETS OF THIS WORLD-CLASS DELIVERY SERVICE. FROM HERE, YOU WILL HAVE THE OPPORTUNITY TO ROTATE TO OTHER FUNCTIONAL AREAS OR ROLES ACROSS AMAZON'S PORTFOLIO OF BUSINESSES.\n\nAS A FINANCE MANAGER ON THE LM OTR TEAM, YOU WILL BE PIVOTAL TO THE TEAM'S SUCCESS AS AN OWNER OF FINANCIAL AND OPERATIONAL REPORTING, DECISION SUPPORT, FINANCIAL MODELING, CONTROLLERSHIP, AND OPERATIONS COST REDUCTION IMPLEMENTATION. YOU WILL COLLABORATE WITH MULTIPLE STAKEHOLDERS TO PROVIDE TIMELY ANALYSIS, INSIGHTFUL GUIDANCE, AND FINANCIAL LEADERSHIP TO OUR LAST MILE DELIVERY ORGANIZATION AS WE GROW OUR DELIVERY BUSINESS RAPIDLY. THIS ROLE WILL PROVIDE EXTENSIVE CROSS-FUNCTIONAL PARTNERSHIP OPPORTUNITIES WITH FINANCE STAKEHOLDERS AS THEY LEAD WEEKLY/MONTHLY REPORTING AND CONTROLLERSHIP ACTIVITIES FOR LM OTR.\n\nA TYPICAL DAY IN THIS ROLE PROVIDES AN OPPORTUNITY TO INNOVATE BY BUILDING CREATIVE, SOCIALLY RESPONSIBLE LAST MILE LOGISTICS SOLUTIONS THROUGH LARGE-SCALE DATA DRIVEN DECISION MAKING. THE SUCCESSFUL CANDIDATE WILL DEMONSTRATE THE FOLLOWING ABILITIES: THEY INFLUENCE BUSINESS OWNERS, SUPPORT THOUGHTFUL DECISION-MAKING, AND ADAPT TO A RAPIDLY-EVOLVING ENVIRONMENT. THEY COLLABORATE WITH SENIOR LEADERS AND VARIOUS BUSINESS UNITS ACROSS AMAZON. YOU BRING EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS.\n\nKEY JOB RESPONSIBILITIES\n\n IDENTIFIES BASIC CONTROL RISKS, EVALUATES IMPACT, PROPOSES CHANGES, AND IMPLEMENTS IMPROVEMENTS TO REMEDIATE GAPS DELIVERS WEEKLY/MONTHLY FINANCIAL CLOSE. USES FINANCIAL SYSTEMS AND ADVANCED MSEXCEL FUNCTIONS TO WORK WITH LARGE DATA SETS. OUTPUTS PLANS, FORECASTS, BUDGETS, AND CONSOLIDATIONS. WORKS WITH A VARIETY OF DATA SOURCES. IDENTIFIES INCOMPLETE OR INACCURATE DATA, IDENTIFIES ROOT CAUSES OF DATA ISSUES, ESCALATES DISCREPANCIES, FIXES DATA WHERE POSSIBLE OR PARTNERS TO DELIVER A SOLUTION. USES ACTIVE LISTENING SKILLS INTUITIVELY TO COMMUNICATE DATA (BOTH WRITTEN AND VERBAL) IN A CLEAR, CONCISE, AND UNAMBIGUOUS MANNER. ADJUSTS STYLE FOR VARIOUS AUDIENCES TO ARTICULATE COMPLEX FINANCE ISSUES CLEARLY. IDENTIFIES AND IMPLEMENTS SOLUTIONS TO RESOLVE, IMPROVE, AUTOMATE, STANDARDIZE, OR SIMPLIFY FINANCE PROCESSES. MAKES THOUGHTFUL TIME MANAGEMENT DECISIONS INDEPENDENTLY. PRIORITIZES WORK, RESOLVES ISSUES, MEETS DEADLINES, AND SEEKS FEEDBACK FROM YOUR MANAGER. DISCERNS BETWEEN URGENT AND NON-URGENT ISSUES AND ACTS ACCORDINGLY TO SOLVE THEM. DRIVES OWN SELF-DEVELOPMENT IN THE FINANCE COMMUNITY: SEEKS OPPORTUNITIES TO EXPAND FINANCE EXPERTISE. PARTICIPATES IN EVENTS, INITIATIVES, AND PROJECTS, THEN SHARES GAINED KNOWLEDGE IN AND OUTSIDE OF YOUR TEAM. CONTRIBUTES TO WORK LIFE HARMONY BY BEING A POSITIVE, COLLABORATIVE, AND EFFECTIVE INFLUENCER TO NEW TEAM MEMBERS AS AN INDICATOR OF OPERATIONS EXCELLENCE.\n\nWE ARE OPEN TO HIRING CANDIDATES TO WORK OUT OF ONE OF THE FOLLOWING LOCATIONS:\n\nARLINGTON, VA, USA | BELLEVUE, WA, USA | DALLAS, TX, USA | NASHVILLE, TN, USA | NEW YORK CITY, NY, USA\n\nBASIC QUALIFICATIONS\n\n BA OR BS IN FINANCE, ACCOUNTING, BUSINESS, ECONOMICS, OR A HIGHLY ANALYTICAL FIELD (E.G., ENGINEERING, MATH, COMPUTER SCIENCE) 5+ YEARS OF FINANCE EXPERIENCE, OR MASTER’S DEGREE AND 3+ YEARS OF FINANCE EXPERIENCE\n\nPREFERRED QUALIFICATIONS\n\n MBA AND/OR PROFESSIONAL CERTIFICATION (CIMA, ACCA, ACA, OR CPA) ADVANCED EXCEL SKILLS ADVANCED USE OF SQL (DATA MINING AND BUSINESS INTELLIGENCE) ABILITY TO MANAGE TIGHT DEADLINES, PRIORITIZE WORKLOAD AND ACHIEVE EFFECTIVE RESULTS IN A FAST-PACED, DYNAMIC, EVER-GROWING AND OFTEN AMBIGUOUS ENVIRONMENT; EFFECTIVE MULTI-TASKING SKILLS ARE VITAL DEMONSTRATED EFFECTIVE COMMUNICATION AND PRESENTATION SKILLS WORKING WITH MULTIPLE PEER GROUPS AND SENIOR LEVELS OF MANAGEMENT\n\nAMAZON IS COMMITTED TO A DIVERSE AND INCLUSIVE WORKPLACE. AMAZON IS AN EQUAL OPPORTUNITY EMPLOYER AND DOES NOT DISCRIMINATE ON THE BASIS OF RACE, NATIONAL ORIGIN, GENDER, GENDER IDENTITY, SEXUAL ORIENTATION, PROTECTED VETERAN STATUS, DISABILITY, AGE, OR OTHER LEGALLY PROTECTED STATUS. FOR INDIVIDUALS WITH DISABILITIES WHO WOULD LIKE TO REQUEST AN ACCOMMODATION, PLEASE VISIT HTTPS://WWW.AMAZON.JOBS/EN/DISABILITY/US.\n\nOUR COMPENSATION REFLECTS THE COST OF LABOR ACROSS SEVERAL US GEOGRAPHIC MARKETS. THE BASE PAY FOR THIS POSITION RANGES FROM $81,100/YEAR IN OUR LOWEST GEOGRAPHIC MARKET UP TO $179,500/YEAR IN OUR HIGHEST GEOGRAPHIC MARKET. PAY IS BASED ON A NUMBER OF FACTORS INCLUDING MARKET LOCATION AND MAY VARY DEPENDING ON JOB-RELATED KNOWLEDGE, SKILLS, AND EXPERIENCE. AMAZON IS A TOTAL COMPENSATION COMPANY. DEPENDENT ON THE POSITION OFFERED, EQUITY, SIGN-ON PAYMENTS, AND OTHER FORMS OF COMPENSATION MAY BE PROVIDED AS PART OF A TOTAL COMPENSATION PACKAGE, IN ADDITION TO A FULL RANGE OF MEDICAL, FINANCIAL, AND/OR OTHER BENEFITS. FOR MORE INFORMATION, PLEASE VISIT HTTPS://WWW.ABOUTAMAZON.COM/WORKPLACE/EMPLOYEE-BENEFITS. THIS POSITION WILL REMAIN POSTED UNTIL FILLED. APPLICANTS SHOULD APPLY VIA OUR INTERNAL OR EXTERNAL CAREER SITE.\n\n\nCOMPANY - AMAZON.COM SERVICES LLC\n\nJOB ID: A2573860",
    "job_skill_set": [
      "financial reporting",
      "financial modeling",
      "data analysis",
      "advanced Excel",
      "budgeting",
      "forecasting",
      "financial systems",
      "business intelligence",
      "communication",
      "collaboration",
      "problem solving",
      "time management",
      "adaptability",
      "influencing",
      "self-development",
      "multi-tasking",
      "leadership",
      "SQL",
      "data mining"
    ],
    "short_keywords": [
      "adaptability",
      "advanced",
      "analysis",
      "budgeting",
      "business",
      "collaboration",
      "communication",
      "data",
      "excel",
      "finance",
      "financial",
      "forecasting",
      "influencing",
      "intelligence",
      "leadership",
      "management",
      "manager",
      "mining",
      "modeling",
      "multitasking",
      "ops",
      "problem",
      "reporting",
      "selfdevelopment",
      "solving",
      "sql",
      "support",
      "systems",
      "time",
      "trans",
      "ww"
    ]
  },
  {
    "job_id": "3891076400",
    "job_title": "Workday Finance Technical Lead",
    "category": "FINANCE",
    "job_description": "POSITION: WORKDAY FINANCE TECHNICAL, INTEGRATIONS AND REPORTING LEADLOCATION: HYBRID - PROVIDENCE, RIDURATION: 6 MONTHS PLUS\nREQUIREMENTS: 5+ YEARS’ EXPERIENCE WITH THE WORKDAY APPLICATION TO INCLUDE ADVANCED REPORTING PROFICIENCY.5+ YEARS OF EXPERIENCE IN WORKDAY INTEGRATIONS WORKING ON LARGE WORKDAY INITIATIVES.5+ YEARS OF EXPERIENCE WITH WORKDAY STUDIO (MINIMUM OF 10 STUDIO INTEGRATIONS), WORKDAY REPORT WRITER, CALCULATED FIELDS WORKDAY EXTEND, CCB, BIRT, EIBS, CORE CONNECTORS, INTEGRATION SYSTEM USER (ISU), INTEGRATION SYSTEM SECURITY GROUP (ISSG)5+ YEARS OF HANDS-ON EXPERIENCE CONFIGURING, DEVELOPING AND TESTING ON THE WORKDAY PLATFORM (PROFICIENT WITH INTEGRATIONS, INTEGRATION SECURITY, WORKDAY STUDIO, CLOUD CONNECT, EIBS, BIRT, CALCULATED FIELDS, REPORT WRITER, XML, XSLT, SOAP AND REST APIS)5+ YEARS FINANCE DATA ANALYSIS EXPERIENCE, INCLUDING THE ABILITY TO UNDERSTAND BUSINESS REQUIREMENTS, USER NEEDS AND TRANSLATE THEM INTO OPERATIONAL REQUIREMENTS.2+ YEARS’ EXPERIENCE WITH WORKDAY PRISM ANALYTICS.DEEP WORKDAY REPORTING EXPERTISE USING BIRT, DASHBOARDS, EMBEDDED ANALYTICS, EIBS, CORE CONNECTORS, STUDIO INTEGRATIONS AND COMPOSITE REPORTING.3+ YEARS OF EXPERIENCE WITH WORKDAY SECURITY IN RELATION TO REPORTING.3+ YEARS OF EXPERIENCE WITHIN AGILE SCRUM METHODOLOGY.EXPERIENCE WITH JSON, SOAP & REST STYLE WEB SERVICESSOLID UNDERSTANDING OF WORKDAY'S BUSINESS OBJECT MODEL AND RELATIONSHIPS.\nPREFERRED:BACHELOR'S DEGREE PREFERRED.WORKDAY CERTIFICATIONS A PLUS.WORKDAY ORCHESTRATION AND WORKDAY EXTEND SKILLS ARE STRONGLY PREFERRED.STRONG KNOWLEDGE OF SUPPORTING WORKDAY FINANCE AND ASSOCIATED BUSINESS OWNERS PREFERRED.",
    "job_skill_set": [
      "Reporting",
      "Finance Data Analysis",
      "Communication",
      "Problem Solving",
      "Teamwork",
      "Analytical Thinking",
      "Adaptability",
      "Workday",
      "Integrations",
      "Workday Studio",
      "Calculated Fields",
      "BIRT",
      "EIBS",
      "Core Connectors",
      "XML",
      "XSLT",
      "SOAP",
      "REST APIs",
      "Workday Prism Analytics",
      "Agile Scrum",
      "JSON",
      "Integration Security",
      "Cloud Connect",
      "Dashboards",
      "Composite Reporting",
      "Workday Security",
      "Business Object Model"
    ],
    "short_keywords": [
      "adaptability",
      "agile",
      "analysis",
      "analytical",
      "analytics",
      "apis",
      "birt",
      "business",
      "calculated",
      "cloud",
      "communication",
      "composite",
      "connect",
      "connectors",
      "core",
      "dashboards",
      "data",
      "eibs",
      "fields",
      "finance",
      "integration",
      "integrations",
      "json",
      "lead",
      "model",
      "object",
      "prism",
      "problem",
      "reporting",
      "rest",
      "scrum",
      "security",
      "soap",
      "solving",
      "studio",
      "teamwork",
      "technical",
      "thinking",
      "workday",
      "xml",
      "xslt"
    ]
  },
  {
    "job_id": "3887479396",
    "job_title": "Finance Business Partner Specialty Care for Intercontinental",
    "category": "FINANCE",
    "job_description": "COMPANY DESCRIPTION\n\nABBVIE'S MISSION IS TO DISCOVER AND DELIVER INNOVATIVE MEDICINES AND SOLUTIONS THAT SOLVE SERIOUS HEALTH ISSUES TODAY AND ADDRESS THE MEDICAL CHALLENGES OF TOMORROW. WE STRIVE TO HAVE A REMARKABLE IMPACT ON PEOPLE'S LIVES ACROSS SEVERAL KEY THERAPEUTIC AREAS – IMMUNOLOGY, ONCOLOGY, NEUROSCIENCE, AND EYE CARE – AND PRODUCTS AND SERVICES IN OUR ALLERGAN AESTHETICS PORTFOLIO. FOR MORE INFORMATION ABOUT ABBVIE, PLEASE VISIT US AT WWW.ABBVIE.COM. FOLLOW @ABBVIE ON TWITTER, FACEBOOK, INSTAGRAM, YOUTUBE AND LINKEDIN.\n\nJOB DESCRIPTION\n\nPURPOSE: \n\nTHE PRIMARY OBJECTIVE OF THIS POSITION IS TO PROVIDE FINANCIAL LEADERSHIP FOR THE INTERCONTINENTAL MANAGEMENT TEAM, OVERSEEING $2BN+ REVENUE IN SPECIALTY CARE (BOTOX THERAPEUTICS, EYE CARE, NEUROSCIENCE & SPECIALTY) BUSINESS UNITS. SPECIFICALLY, THIS POSITION IS RESPONSIBLE FOR ALL BRAND RELATED FINANCIAL REPORTING AND ANALYSIS TO PLAN, UPDATE, LBE AND LRP CYCLES, DECISION-MAKING SUPPORT AND RECOMMENDATIONS TO THE INTERCONTINENTAL AREA FINANCE DIRECTOR AND SPECIALTY CARE COMMERCIAL DIRECTOR, TAKING INTO CONSIDERATION BUSINESS DYNAMICS AND RESOURCING. IN ADDITION, THIS POSITION IS RESPONSIBLE FOR ENSURING THE BUSINESS SUPPORT OF CROSS PORTFOLIO INITIATIVES, PROFITABILITY ANALYSIS AND PROJECT MANAGEMENT.\n\nRESPONSIBILITIES: \n\nFINANCIAL BUSINESS PARTNER - LEAD THE PLANNING PROCESSES FOR SPECIALTY CARE AND SYNTHESIZE INTERCONTINENTAL PORTFOLIO STORY FOR IMCO AND CORPORATE REVIEWS, WHILE ENSURING ACCURATE AND TIMELY INTEGRATION OF SALES FORECAST, PRICING, AND INVESTMENT RESOURCING TO ALL BRANDS.\n\nENSURE FINANCIAL PLANNING DELIVERABLES ARE ACCURATE, CLEAR, AND CONCISE FOR EXECUTIVE LEVEL REVIEW AND APPROVALS.\n\nWORK CLOSELY WITH THE ASSOCIATE FINANCE DIRECTOR TO ENSURE ADEQUATE AND APPROPRIATE RESOURCING LEVELS. DRIVE DEDICATED R&D / SG&A FOR SPECIALTY CARE.\n\nPROVIDE FINANCIAL ANALYSIS, MONTHLY SALES REPORTS, REVIEWING AFFILIATES DEMAND FORECAST AND DELIVER INSIGHTS THAT LINK FINANCIAL REPORTS TO BUSINESS STRATEGY FOR THE INTERCON S&OP.\n\nWORK CLOSELY WITH IMCO BRAND FINANCE PARTNERS TO DEVELOP MODELS THAT ACCURATELY INCORPORATE MARKET DYNAMICS INCLUDING MARKET SHARE AND MARKET GROWTH. ASSURE CONSISTENCY ACROSS BRANDS IN FINANCIAL TEMPLATES, DELIVERABLES, AND KEY ANALYSIS.\n\nMANAGEMENT OF ALL REPORTING ACTIVITIES INCLUDING BUT NOT LIMITED TO: LBES, PLN, LRP, MONTHLY SALES, BUDGETING MONITORING.\n\nDECISION SUPPORT/SPECIAL PROJECTS -- PROVIDE ANALYSES FOR AD HOC OR OTHER BUSINESS PRESENTATIONS THAT LEND INSIGHT INTO KEY BUSINESS DRIVERS ENABLING OPERATING MANAGEMENT TO ADAPT MORE APPROPRIATE TACTICS/STRATEGY TO MEET THE LRP OBJECTIVES.\n\nMANAGEMENT OF CROSS PORTFOLIO INITIATIVES AND SUPPORT IMCO AND GLOBAL FUNCTIONS ON THEIR BRAND FINANCIAL REQUIREMENTS (INCLUDING COMMERCIAL MODELS, MARKETING ANALYTICS).\n\nSIGNIFICANT WORK ACTIVITIES -CONTINUOUS SITTING FOR PROLONGED PERIODS (MORE THAN 2 CONSECUTIVE HOURS IN AN 8 HOUR DAY)\n\nQUALIFICATIONS\n\nQUALIFICATIONS: \n\nBACHELOR’S DEGREE IN ACCOUNTING OR FINANCE.\n\nREQUIRES 7-10 YEARS PROGRESSIVE ACCOUNTING OR FINANCE EXPERIENCE.\n\nTHIS POSITION REQUIRES AN INDIVIDUAL WITH THE ABILITY AND DESIRE TO PROACTIVELY SEARCH OUT AND EVALUATE BUSINESS PROBLEMS AND OPPORTUNITIES.\n\nPRIOR EXPERIENCE COLLABORATING WITH COMMERCIAL TEAMS AND BUSINESS PARTNER MINDSET.\n\nABILITY TO SOLVE BUSINESS PROBLEMS THROUGH THE PROACTIVE IDENTIFICATION OF ISSUES AND SUBSEQUENT COLLECTION, ANALYSIS, AND INTERPRETATION OF RELATED DATA.\n\nEXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS / FULLY FLUENT IN ENGLISH.\n\nSTRONG INTERPERSONAL, AND TEAMWORK SKILLS.\n\nADDITIONAL INFORMATION\n\nABBVIE IS COMMITTED TO OPERATING WITH INTEGRITY, DRIVING INNOVATION, TRANSFORMING LIVES, SERVING OUR COMMUNITY AND EMBRACING DIVERSITY AND INCLUSION. IT IS ABBVIE’S POLICY TO EMPLOY QUALIFIED PERSONS OF THE GREATEST ABILITY WITHOUT DISCRIMINATION AGAINST ANY EMPLOYEE OR APPLICANT FOR EMPLOYMENT BECAUSE OF RACE, COLOR, RELIGION, NATIONAL ORIGIN, AGE, SEX (INCLUDING PREGNANCY), PHYSICAL OR MENTAL DISABILITY, MEDICAL CONDITION, GENETIC INFORMATION, GENDER IDENTITY OR EXPRESSION, SEXUAL ORIENTATION, MARITAL STATUS, STATUS AS A PROTECTED VETERAN, OR ANY OTHER LEGALLY PROTECTED GROUP STATUS.",
    "job_skill_set": [
      "financial analysis",
      "budgeting",
      "accounting",
      "data analysis",
      "teamwork",
      "problem solving",
      "interpersonal skills",
      "financial reporting",
      "financial modeling",
      "sales forecasting",
      "market analysis",
      "project management",
      "commercial models",
      "communication",
      "collaboration",
      "proactive mindset"
    ],
    "short_keywords": [
      "accounting",
      "analysis",
      "budgeting",
      "business",
      "care",
      "collaboration",
      "commercial",
      "communication",
      "data",
      "finance",
      "financial",
      "for",
      "forecasting",
      "intercontinental",
      "interpersonal",
      "management",
      "market",
      "mindset",
      "modeling",
      "models",
      "partner",
      "proactive",
      "problem",
      "project",
      "reporting",
      "sales",
      "skills",
      "solving",
      "specialty",
      "teamwork"
    ]
  },
  {
    "job_id": "3906095138",
    "job_title": "Director of Finance - The Langham, New York",
    "category": "FINANCE",
    "job_description": "\n\nTHE DIRECTOR OF FINANCE MANAGES AND DIRECTS THE FINANCIAL ACTIVITIES OF THE HOTEL, SAFEGUARDS THE ASSETS, AND PREPARES ALL FINANCIAL REPORTS IN ACCORDANCE WITH GENERALLY ACCEPTED ACCOUNTING PRINCIPLES (GAAP). SERVES AS A FINANCIAL ADVISOR TO HOTEL MANAGEMENT AND OWNERSHIP.\n\nRESPONSIBILITIES AND JOB DUTIES:\n\n LEAD, GUIDE AND ADVISE THE HOTEL TEAM ON FORECASTING, BUDGETING, AND FINANCE OPERATIONS/ISSUES.RECOMMEND ON CURRENT AND FUTURE OPERATIONS’ ANALYSIS AND INTERPRETATION.REVIEW FINANCE CONTRACTS.DEVELOP OPERATIONAL FINANCE TOOLS BY CARRIER AND PRODUCT.EXECUTE DESIGNATED IMPROVEMENT PROCESSES AND ENHANCED CASH FLOW INITIATIVES.UPDATE ON EMERGING TECHNOLOGY CHANGES AND INNOVATIONS THROUGH READING OF BUSINESS AND PROFESSIONAL PUBLICATIONS, NETWORKING AND INVOLVEMENT IN PROFESSIONAL ORGANIZATIONS.ANALYZES FINANCIAL DATA OF OPERATIONS IN ORDER TO EDUCATE AND ADVISE HOTEL STAFF AND MANAGEMENT ON THE VALUE AND BENEFITS OF INTERNAL CONTROLS AND MAINTAINING AN EFFICIENT OPERATION. ASSISTS AND COUNSELS ALL DEPARTMENT HEADS IN THE INTERPRETATION OF FINANCIAL DATA AND RECOMMENDS COURSES OF ACTION TO MAXIMIZE PROFITABILITY.MONITORS AND APPROVES ALL SALES, PURCHASES, SALARIES, AND EXPENSES OF THE HOTEL WITH MANAGING DIRECTOR.PREPARES, REVIEWS, AND PRESENTS THE MONTHLY REPORT OF OPERATIONS. PREPARES THE MONTHLY, THREE AND SIX MONTH PROJECTIONS AND BUDGETS THROUGHOUT THE YEAR AND ADVISES HOTEL MANAGEMENT, CORPORATE OFFICE, AND OWNERS OF ANY MAJOR VARIANCES AND THEIR IMPACT ON THE OPERATION.PREPARES FORECASTS AND BUDGETS AS REQUIRED (ANNUAL, REVISED ANNUAL, MONTHLY, AND/OR ON CORPORATE/OWNER’S REQUESTS). DEVELOPS AND MONITORS INTERNAL CONTROLS TO SAFEGUARD HOTEL ASSETS. MAINTAINS ADEQUATE INTERNAL CONTROL OVER REVENUES, EXPENSES, ASSETS AND LIABILITIES OF THE HOTEL AND ENSURE ACCOUNTS ARE MAINTAINED ACCORDING TO GAAP AND UNIFORM SYSTEM OF ACCOUNTS.HIRES, TRAINS, AND SUPERVISES FINANCE DEPARTMENT STAFF INCLUDING COACHING, COUNSELING, AND DISCIPLINE. DIRECT ACCOUNTING STAFF TO ENSURE ACCURATE ACCOUNTING AND TIMELY REPORTING OF FINANCIAL DATA TO DEPARTMENT HEADS, HOTEL MANAGEMENT, CORPORATE OFFICE, AND OWNERS IN ACCORDANCE WITH GAAP AND LANGHAM GUIDELINES. MONITOR PROFESSIONAL DEVELOPMENT OF HOTEL STAFF TO ENSURE MEETING OF TRAINING, PROFESSIONAL DEVELOPMENT AND PROPERTY NEEDS. TRAIN, MENTOR AND OFFER CAREER DEVELOPMENT OPPORTUNITIES THROUGH QUALITY MANAGEMENT ACTIVITIES.ENSURES THAT ALL LICENSES, PERMITS, AND INSURANCE POLICIES ARE CURRENT AND ARE IN COMPLIANCE WITH LOCAL, STATE, AND FEDERAL LAWS. MONITORS ALL CONTRACTS AND AGREEMENTS AND ADVISES HOTEL MANAGEMENT OF THE TERMS, CONDITIONS AND BENEFITS.ASSUMES CASH MANAGEMENT RESPONSIBILITIES, INCLUDING PREPARATION OF STATEMENT OF CASH FLOW AND, IF NECESSARY, STATEMENT OF CHANGES IN FINANCIAL POSITION. ESTABLISHES AND AUDITS ALL INTERNAL FINANCIAL CONTROLS, INCLUDING PURCHASING, CASH HANDLING AND DISBURSEMENTS, INVENTORIES, HOTEL EQUIPMENT, MASTER KEYS, AND PERSONNEL TIME RECORDS.PROVIDES FINANCIAL OVERSIGHT OF THE CAPITAL EXPENDITURE PROCESS. ENSURES CAPITAL PROJECTS ARE COMPLETED WITHIN ESTABLISHED CRITICAL PATH AND FINANCIAL PROJECTIONS. CONDUCTS POST COMPLETION AUDITS OF CAPITAL PROJECTIONS.ENSURES HOTEL IS IN COMPLIANCE WITH CORPORATE POLICIES AND GOVERNMENTAL RULES AND REGULATIONS.REPORTS IRREGULARITIES AND NON-COMPLIANT SITUATIONS TO GENERAL MANAGER/MANAGING DIRECTOR.ASSUMES LEADERSHIP ROLE IN THE EDUCATION OF SUPERVISORY STAFF IN FINANCIAL MANAGEMENT.ENSURES TIMELY COMPLETION OF ALL BALANCE SHEET ACCOUNT RECONCILIATIONS.ENSURES THAT THE BEST INTEREST OF THE HOTEL AND OWNERS ARE PROTECTED. SEEKS LEGAL ADVICE, IF DEEMED NECESSARY.ENSURES COMPLIANCE WITH FINANCIAL RECORD RETENTION POLICIES.ADMINISTERS THE COMPETITIVE BIDDING PROCESS.COOPERATES WITH INTERNAL/EXTERNAL AUDITS. IMPLEMENTS AGREED UPON RECOMMENDATIONS.ENSURES TIMELY CUSTOMER SATISFACTION (EXTERNAL AND INTERNAL) ON ACCOUNTING RELATED INQUIRIES AND REQUESTS.OVERSEES RESPONSIBILITIES OF COMPUTER NETWORKING OPERATIONS AND COMPUTER APPLICATIONS WITHIN THE HOTEL.ATTENDS OTHER DEPARTMENTAL MEETINGS TO KEEP APPRAISED OF OTHER OPERATIONS AND TO PROVIDE OUTSIDE INPUT TO ENHANCE THE DEPARTMENT’S OPERATION.PERFORMS OTHER DUTIES THAT MAY BE ASSIGNED BY THE MANAGING DIRECTOR OR CORPORATE FINANCE.  \n\nEDUCATION AND EXPERIENCE REQUIRED:\n\n FOUR-YEAR COLLEGE DEGREE REQUIRED AT LEAST 5 YEARS’ EXPERIENCE IN FINANCE FIELD REQUIRED; 2 YEARS AS DIRECTOR OF FINANCEHOSPITALITY EXPERIENCE REQUIRED KNOWLEDGE OF COMPUTERS AND TRAINING TECHNIQUES KNOWLEDGE OF DEPARTMENTAL AND HOTEL OPERATIONSKNOWLEDGE OF BUSINESS LAW, FEDERAL, STATE, AND LOCAL TAXES, AS WELL AS DEPARTMENT OF LABOR REGULATIONSKNOWLEDGE OF INSURANCE, EMPLOYEE BENEFITS, CLAIMS AND LIABILITYKNOWLEDGE OF UNIFORM SYSTEMS OF ACCOUNTING  \n\nSPECIAL SKILLS REQUIRED:\n\n ABILITY TO READ, WRITE, AND SPEAK THE ENGLISH LANGUAGE TO COMMUNICATE EFFECTIVELYABILITY TO EXERCISE JUDGMENT IN EVALUATING SITUATIONS AND IN MAKING SOUND DECISIONSABILITY TO ANALYZE AND INTERPRET FINANCIAL DATALEADERSHIP AND ORGANIZATIONAL SKILLS (TEAM ORIENTATION, FLEXIBLE, ADAPTABLE)ABILITY TO ANALYZE LARGE VOLUME OF COMPLEX FINANCIAL INFORMATION FROM MANY SOURCES AND CREATE REPORTS, FORECASTS PROJECTIONSBASIC UNDERSTANDING OF COMPLEX COMPUTERIZED FINANCIAL SYSTEMS AND ABILITY TO USE IT INCLUDING MANUAL DEXTERITY TO OPERATE ALL OFFICE MACHINESKNOWLEDGE OF VARIOUS COMPUTER PROGRAMS, SUCH AS WORD AND EXCEL. KNOWLEDGE OF SUNSYSTEMS, INFOR Q&A AND BIRCHSTREET PREFERRED.  \n\nPHYSICAL DEMANDS:\n\n ACTIVITIES INCLUDE TALKING, SEEING, FEELING, HEARING, TOUCHING, GRASPING, LIFTING.ABLE TO DO VARIOUS PHYSICAL MOVEMENTS THROUGHOUT THE WORK AREAS.SITTING TO A LARGE DEGREE UP TO 80 % OF WORK DAY CONSIDERABLE REPETITIVE MOTION OF HANDS AND WRISTS AS RELATES TO THE USE OF COMPUTER KEYBOARDS AND OTHER OFFICE MACHINES.EXERTS PHYSICAL EFFORT IN TRANSPORTING 10LBS TO 20LBS  \n\nLICENSES OR CERTIFICATES:\n\n CPA A PLUS \n\n\n\nRATE OF PAY: $183-203K\n\nEOE, INCLUDING DISABILITY VETS\n\n",
    "job_skill_set": [
      "financial analysis",
      "budgeting",
      "forecasting",
      "financial reporting",
      "financial software (e.g., SunSystems, Infor Q&A, BirchStreet)",
      "tax regulations",
      "computer skills (Word, Excel)",
      "leadership",
      "communication",
      "decision making",
      "organizational skills",
      "teamwork",
      "adaptability",
      "problem solving",
      "customer satisfaction focus",
      "GAAP",
      "internal controls",
      "cash management",
      "hospitality finance",
      "business law",
      "insurance knowledge",
      "employee benefits knowledge",
      "financial projections",
      "mentoring"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "benefits",
      "birchstreet",
      "budgeting",
      "business",
      "cash",
      "communication",
      "computer",
      "controls",
      "customer",
      "decision",
      "director",
      "eg",
      "employee",
      "excel",
      "finance",
      "financial",
      "focus",
      "forecasting",
      "gaap",
      "hospitality",
      "infor",
      "insurance",
      "internal",
      "knowledge",
      "langham",
      "law",
      "leadership",
      "making",
      "management",
      "mentoring",
      "new",
      "of",
      "organizational",
      "problem",
      "projections",
      "qa",
      "regulations",
      "reporting",
      "satisfaction",
      "skills",
      "software",
      "solving",
      "sunsystems",
      "tax",
      "teamwork",
      "the",
      "word",
      "york"
    ]
  },
  {
    "job_id": "3906246896",
    "job_title": "Lead Software Engineer - Finance (Hybrid)",
    "category": "FINANCE",
    "job_description": "JOB DESCRIPTION\n\nAS A VALUED COLLEAGUE ON OUR TEAM, YOU WILL ACT AS A TEAM LEAD IN THE DESIGNING, PRODUCING, TESTING, OR IMPLEMENTING SOFTWARE, TECHNOLOGY, OR PROCESSES, AS WELL AS LEAD PROCESSES FOR CREATING AND MAINTAINING IT ARCHITECTURE, LARGE SCALE DATA STORES, AND CLOUD-BASED SYSTEMS.\n\nTHE IMPACT YOU WILL MAKE\n\nRESPONSIBILITIES\n\nTHE LEAD SOFTWARE ENGINEER - FINANCE ROLE WILL OFFER YOU THE FLEXIBILITY TO MAKE EACH DAY YOUR OWN, WHILE WORKING ALONGSIDE PEOPLE WHO CARE SO THAT YOU CAN DELIVER ON THE FOLLOWING RESPONSIBILITIES:\n\nINDEPENDENTLY DETERMINE THE NEEDS OF THE CUSTOMER WHILE IDENTIFYING AND RESOLVING CONFLICTING OR COMPLEMENTARY NEEDS ACROSS CUSTOMER GROUPS.APPLYING ADVANCED SKILL, KNOWLEDGE AND EXPERIENCE, DESIGN AND DEVELOP SOFTWARE SOLUTIONS TO MEET CUSTOMER NEEDS.USE A PROCESS-DRIVEN APPROACH TO LEADING DESIGN SOLUTIONS.IMPLEMENT NEW SOFTWARE TECHNOLOGY AND COORDINATE SIMULTANEOUS IMPLEMENTATION TASKS ACROSS TEAMS.MAY MAINTAIN OR OVERSEE THE MAINTENANCE OF EXISTING SOFTWARE.\n\nQUALIFICATIONS\n\nTHE EXPERIENCE YOU BRING TO THE TEAM\n\nMINIMUM REQUIRED EXPERIENCES\n\n4+ YEARS WITH BIG DATA HADOOP CLUSTER (HDFS, YARN, HIVE, MAPREDUCE FRAMEWORKS), SPARK4+ YEARS OF RECENT EXPERIENCE WITH BUILDING AND DEPLOYING APPLICATIONS IN AWS (S3, HIVE, GLUE, AWS BATCH, DYNAMO DB, REDSHIFT, CLOUDWATCH, RDS, LAMBDA, SNS, SWS ETC.)4+ YEARS OF PYTHON, SQL, SPARKSQL, PYSPARKEXCELLENT PROBLEM SOLVING SKILLS AND STRONG VERBAL & WRITTEN COMMUNICATION SKILLSABILITY TO WORK INDEPENDENTLY AS WELL AS PART OF A TEAM\n\nDESIRED EXPERIENCES\n\nBACHELOR DEGREE OR EQUIVALENTKNOWLEDGE OF SPARK STREAMING TECHNOLOGIES FAMILIARITY WITH HADOOP / SPARK INFORMATION ARCHITECTURE, DATA MODELING, MACHINE LEARNING (ML)KNOWLEDGE OF FINANCIAL REPORTING ACCOUNTING SERVICES (FRAS)KNOWLEDGE OF ENTERPRISE DATA MANAGEMENT (EDMCS)EXPERIENCE WITH WORKIVA AND WORKIVA SOX\n\nSKILLS\n\nSKILLED IN CLOUD TECHNOLOGIES AND CLOUD COMPUTINGEXPERIENCE USING SOFTWARE AND COMPUTER SYSTEMS' ARCHITECTURAL PRINCIPLES TO INTEGRATE ENTERPRISE COMPUTER APPLICATIONS SUCH AS XMATTERS, AWS APPLICATION INTEGRATION, OR WEBSPHEREINFLUENCING INCLUDING NEGOTIATING, PERSUADING OTHERS, FACILITATING MEETINGS, AND RESOLVING CONFLICTCOMMUNICATION INCLUDING COMMUNICATING IN WRITING OR VERBALLY, COPYWRITING, PLANNING AND DISTRIBUTING COMMUNICATION, ETC.EXPERIENCE HELPING AN ORGANIZATION TO PLAN AND MANAGE CHANGE IN EFFORT TO MEET STRATEGIC OBJECTIVESWORKING WITH PEOPLE WITH DIFFERENT FUNCTIONAL EXPERTISE RESPECTFULLY AND COOPERATIVELY TO WORK TOWARD A COMMON GOALEXPERTISE IN SERVICE MANAGEMENT CONCEPTS FOR NETWORKS AND RELATED STANDARDS SUCH AS ITIL PRACTICES OR SDLCPROGRAMMING INCLUDING CODING, DEBUGGING, AND USING RELEVANT PROGRAMMING LANGUAGESRELATIONSHIP MANAGEMENT INCLUDING MANAGING AND ENGAGING STAKEHOLDERS, CUSTOMERS, AND VENDORS, BUILDING RELATIONSHIP NETWORKS, CONTRACTING, ETC.OPERATIONAL EXCELLENCE INCLUDING IMPROVING AND OVERSEEING OPERATIONS\n\nTOOLS\n\nJAVAPYTHONAWS\n\nADDITIONAL INFORMATION\n\nTHE FUTURE IS WHAT YOU MAKE IT TO BE. DISCOVER COMPELLING OPPORTUNITIES AT CAREERS.FANNIEMAE.COM.\n\nFANNIE MAE IS AN EQUAL OPPORTUNITY EMPLOYER, WHICH MEANS WE ARE COMMITTED TO FOSTERING A DIVERSE AND INCLUSIVE WORKPLACE. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, RELIGION, NATIONAL ORIGIN, GENDER, GENDER IDENTITY, SEXUAL ORIENTATION, PERSONAL APPEARANCE, PROTECTED VETERAN STATUS, DISABILITY, AGE, OR OTHER LEGALLY PROTECTED STATUS. FOR INDIVIDUALS WITH DISABILITIES WHO WOULD LIKE TO REQUEST AN ACCOMMODATION IN THE APPLICATION PROCESS, EMAIL US AT CAREERS_MAILBOX@FANNIEMAE.COM.\n\nTHE HIRING RANGE FOR THIS ROLE IS SET FORTH ON EACH OF OUR JOB POSTINGS LOCATED ON FANNIE MAE'S CAREER SITE. FINAL SALARIES WILL GENERALLY VARY WITHIN THAT RANGE BASED ON FACTORS THAT INCLUDE BUT ARE NOT LIMITED TO, SKILL SET, DEPTH OF EXPERIENCE, CERTIFICATIONS, AND OTHER RELEVANT QUALIFICATIONS. THIS POSITION IS ELIGIBLE TO PARTICIPATE IN A FANNIE MAE INCENTIVE PROGRAM (SUBJECT TO THE TERMS OF THE PROGRAM). AS PART OF OUR COMPREHENSIVE BENEFITS PACKAGE, FANNIE MAE OFFERS A BROAD RANGE OF HEALTH, LIFE, VOLUNTARY LIFESTYLE, AND OTHER BENEFITS AND PERKS THAT ENHANCE AN EMPLOYEE’S PHYSICAL, MENTAL, EMOTIONAL, AND FINANCIAL WELL-BEING. SEE MORE HERE.\n\nPANDOLOGIC. KEYWORDS: SENIOR SOFTWARE ENGINEER, LOCATION: RESTON, VA - 20190",
    "job_skill_set": [
      "Problem Solving",
      "Communication",
      "Teamwork",
      "Relationship Management",
      "Hadoop",
      "AWS",
      "Python",
      "SQL",
      "Spark",
      "Java",
      "Data Modeling",
      "Machine Learning",
      "Cloud Computing",
      "ITIL",
      "Service Management",
      "Influencing",
      "Operational Excellence",
      "Change Management"
    ],
    "short_keywords": [
      "aws",
      "change",
      "cloud",
      "communication",
      "computing",
      "data",
      "engineer",
      "excellence",
      "finance",
      "hadoop",
      "hybrid",
      "influencing",
      "itil",
      "java",
      "lead",
      "learning",
      "machine",
      "management",
      "modeling",
      "operational",
      "problem",
      "python",
      "relationship",
      "service",
      "software",
      "solving",
      "spark",
      "sql",
      "teamwork"
    ]
  },
  {
    "job_id": "3904511267",
    "job_title": "Commercial Lending and Finance Partner ",
    "category": "FINANCE",
    "job_description": "RECRUITING FOR A COMMERCIAL LENDING AND FINANCE PARTNER FOR A GROWING FIRM, PORTABLE BOOK OF BUSINESS PREFERRED BUT NOT REQUIRED. CAN WORK IN NY, FL, RI, NC OR BOSTON.",
    "job_skill_set": [
      "Finance",
      "Communication",
      "Negotiation",
      "Relationship Building",
      "Problem Solving",
      "Commercial Lending",
      "Business Development",
      "Portfolio Management"
    ],
    "short_keywords": [
      "and",
      "building",
      "business",
      "commercial",
      "communication",
      "development",
      "finance",
      "lending",
      "management",
      "negotiation",
      "partner",
      "portfolio",
      "problem",
      "relationship",
      "solving"
    ]
  },
  {
    "job_id": "3894617437",
    "job_title": "Finance Intern",
    "category": "FINANCE",
    "job_description": "JOB DETAILS\n\nLEVEL\n\nENTRY\n\nJOB LOCATION\n\nMLT HEADQUARTERS - MOUNTLAKE TERRACE, WA\n\nPOSITION TYPE\n\nINTERNSHIP\n\nEDUCATION LEVEL\n\nHIGH SCHOOL\n\nSALARY RANGE\n\n$20.00 - $20.00 HOURLY\n\nJOB SHIFT\n\nDAY\n\nJOB CATEGORY\n\nBANKING\n\nDESCRIPTION\n\n**THIS POSITION IS LOCATED OUT OF OUR MOUNTLAKE TERRACE HEADQUARTERS AND IS NOT  A REMOTE POSITION.**\n\nA GREAT PLACE TO WORK AND BANK\n\nJOIN OUR TEAM! 1ST SECURITY BANK TEAM MEMBERS DELIVER SERVICE THAT \"WOWS\" EACH OTHER AND OUR CUSTOMERS. WE VALUE RELATIONSHIPS, TEAMWORK, COMMUNITY, AND PROFESSIONAL GROWTH IN A SAFE, FRIENDLY, AND PROGRESSIVE WORKPLACE. WE CELEBRATE DIVERSITY AND SUPPORT EQUALITY FOR ALL. IF YOU SHARE THESE CORE VALUES AND ARE COMMITTED TO CAREER EXCELLENCE, LET US HELP YOU REACH YOUR DREAMS!\n\nIF YOU ARE THE TYPE OF INDIVIDUAL THAT WOULD ENJOY WORKING AT ONE OF THE PUGET SOUND'S BEST PLACES TO WORK FOR 8 YEARS IN A ROW AND FOCUSES ON PROVIDING AN EXCEPTIONAL CLIENT EXPERIENCE, THEN 1ST SECURITY BANK IS THE PLACE FOR YOU. 1ST SECURITY BANK WAS NAMED A BRONZE MEDAL WINNER IN ITS CLASS IN THE PUGET SOUND BUSINESS JOURNAL'S BEST WORKPLACES CONTEST IN ITS FIRST YEAR NOMINATED AND IS ALSO CONSISTENTLY RATED A 5 STAR BANK IN WASHINGTON STATE BY BAUER FINANCIAL, AN INDEPENDENT BANK RATING FIRM.\n\n 1SB SUMMER INTERNSHIP PROGRAM \n\n1STSECURITY BANK IS LOOKING FOR SMART, DRIVEN, AND KIND UNDERGRADUATE STUDENTS TO PARTICIPATE IN ITS SUMMER INTERNSHIP PROGRAM. THIS INTERNSHIP IS FOR STUDENTS WITH AN INTEREST IN PURSUING A CAREER IN FINANCE, BANKING, OR A RELATED INDUSTRY. THE STUDENTS WILL WORK IN SPECIFIC DEPARTMENTS WITHIN THE ACCOUNTING/FINANCE/OPERATIONS TEAMS AND HAVE AN OPPORTUNITY TO WORK WITH AND BE EXPOSED TO OTHER DEPARTMENTS OF THE BANK, PROVIDING A WELL-ROUNDED CAREER EXPERIENCE.\n\nPOSITION SUMMARY:\n\nTHIS POSITION WILL BE RESPONSIBLE FOR DEVELOPING AND IMPLEMENTING KEY METRICS AND MEASURING THOSE METRICS FOR BANK-WIDE INITIATIVES AT THE DIRECTION OF THE CHIEF FINANCIAL OFFICER (CFO). THE INDIVIDUAL MAY BE INVOLVED IN THE MONTHLY CREATION OF PROFIT AND LOSS STATEMENTS BY COST CENTER, OVERSIGHT AND MANAGEMENT OF DAILY LIQUIDITY/INTEREST RATE RISK POSITIONS, FORECASTING/TESTING/IMPLEMENTING NEW MODELS TO IMPROVE FORECASTING AND IMPROVING CURRENT PROCESSES/REPORTING. THE POSITION WILL SUPPORT THE ACCOUNTING/FINANCE/PROFITABILITY/OPERATIONS TEAMS IN THE CREATION OF FORECASTS, ANALYSES, AND MODELS BY FUNCTION AND/OR DEPARTMENT, INCLUDING HOME LENDING, CONSUMER LENDING, RETAIL BANKING, SERVICES AND OPERATIONS, AND COMMERCIAL LENDING. THIS POSITION WILL REQUIRE THE SKILLS TO PERFORM AN IN-DEPTH ANALYSIS OF SPECIFIC BUSINESS FUNCTIONS TO DETERMINE PROJECT NEEDS AND MAY INCLUDE BUILDING DATA ANALYTICS TO SUPPORT BUSINESS UNIT REQUESTS.\n\nESSENTIAL DUTIES AND RESPONSIBILITIES INCLUDE THE FOLLOWING:\n\n REGULAR DATA ENTRY, IMPORTING, REPORT BUILDING AND REPORT DISTRIBUTION  CREATING/EDITING/FORMATTING FINANCIAL REPORTS AND BUDGETS  CREATING REPORTS FOR BUSINESS UNITS BASED ON SPECIFIC DATA REQUESTS  ASSISTING THE CFO/FINANCE MANAGER WITH TASKS TO STREAMLINE BOARD REPORTING  ANALYZING ASSUMPTIONS TO DETERMINE HOW BANK MODEL FORECASTS ARE FUNCTIONING  CREATION OF KEY METRICS FOR TEAMS AT THE BANK REQUIRING INTERACTION WITH COST CENTER MANAGERS  RESPONSIBLE FOR WORKING WITH BUSINESS LINE MANAGERS TO DEVELOP TOOLS TO ASSIST TEAM MEMBERS WITH BUSINESS ANALYTICS  ASSISTING THE CFO WITH NEW PROJECTS AND FINANCIAL REPORTING  DEVELOPING METRICS FOR MANAGERS (INCLUDING MONTHLY REPORTING TOOLS) THAT ASSIST WITH THEIR MANAGEMENT OR PRODUCT  RECONCILING PROCESSES AND VALIDATING FINANCIAL REPORTS  ASSISTING IN CREATING STRUCTURES TO STREAMLINE AND IMPROVE AUDIT PROCESSES  OTHER DUTIES AS ASSIGNED \n\nQUALIFICATIONS\n\n EDUCATION AND/OR EXPERIENCE \n\n MUST BE ENROLLED IN COLLEGE WORKING TOWARD A 4-YEAR DEGREE  MINIMUM OF 1 YEAR OF COLLEGE COMPLETE OR PREVIOUS INTERNSHIP REQUIRED  WORKING TOWARD A BACHELOR’S DEGREE WITH PREFERENCE FOR BUSINESS, FINANCE, OR ACCOUNTING  STRONG EXCEL AND DATABASE SKILLS RELATED TO FINANCIAL MANAGEMENT SYSTEMS  ABILITY TO QUICKLY LEARN NEW BUSINESS PROCESSES AND IDENTIFY KEY METRICS  ABILITY TO QUICKLY SOLVE PROBLEMS AND CREATE SOLUTIONS BASED ON SET PARAMETERS  DETAIL ORIENTED WITH A FOCUS ON FINANCIAL PRESENTATION  EFFECTIVE COMMUNICATION AND INTERPERSONAL SKILLS  STRONG TIME MANAGEMENT SKILLS WITH AN EMPHASIS ON MEETING TIGHT DEADLINE REQUIREMENTS \n\nCOMPUTER SKILLS\n\nTO PERFORM THIS JOB SUCCESSFULLY, AN INDIVIDUAL SHOULD BE PROFICIENT IN MICROSOFT OFFICE PRODUCTS AND HAVE THE ABILITY TO LEARN OTHER PROGRAMS.\n\n PHYSICAL DEMANDS AND WORK ENVIRONMENT \n\nTHE PHYSICAL DEMANDS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY AN EMPLOYEE TO SUCCESSFULLY PERFORM THE ESSENTIAL FUNCTIONS OF THIS JOB. THE WORK ENVIRONMENT CHARACTERISTICS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE AN EMPLOYEE ENCOUNTERS WHILE PERFORMING THE ESSENTIAL FUNCTIONS OF THIS JOB. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS.\n\n THE EMPLOYEE WILL OPERATE IN A GENERAL OFFICE ENVIRONMENT, USING OFFICE EQUIPMENT SUCH AS A PHONE AND A COMPUTER. THE EMPLOYEE MUST BE ABLE TO BEND AND SQUAT OCCASIONALLY WHEN ACCESSING STORAGE.  THE NOISE LEVEL IN THE WORK ENVIRONMENT IS USUALLY QUIET TO MODERATE AS COMPARED TO A PRIVATE OFFICE WITH LIGHT FOOT TRAFFIC AND OFFICE EQUIPMENT. THE EMPLOYEE MUST BE WILLING AND ABLE TO INTERACT FREQUENTLY WITH THE GENERAL PUBLIC.  THE POSITION WILL BE LOCATED AT THE MOUNTLAKE TERRACE ADMINISTRATION OFFICE AND TRAVEL TIME TO AND FROM THIS LOCATION WILL BE REQUIRED.",
    "job_skill_set": [
      "Database Management",
      "Microsoft Office",
      "Budgeting",
      "Communication",
      "Interpersonal Skills",
      "Problem Solving",
      "Time Management",
      "Detail Oriented",
      "Teamwork",
      "Adaptability",
      "Excel",
      "Financial Reporting",
      "Data Analysis",
      "Financial Management Systems",
      "Report Building",
      "Data Entry"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "budgeting",
      "building",
      "communication",
      "data",
      "database",
      "detail",
      "entry",
      "excel",
      "finance",
      "financial",
      "intern",
      "interpersonal",
      "management",
      "microsoft",
      "office",
      "oriented",
      "problem",
      "report",
      "reporting",
      "skills",
      "solving",
      "systems",
      "teamwork",
      "time"
    ]
  }
]