[
  {
    "job_id": "3891073651",
    "job_title": "Director of Information Technology",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "POSITION SUMMARY:SERVE AS A MEMBER OF THE ACES TECHNOLOGY SERVICES (ATS) LEADERSHIP TEAM, COMPRISED OF IT OFFICES IN ALL ACADEMIC DEPARTMENTS AND ADMINISTRATIVE UNITS IN ACES. OVERSEE THE EFFICIENT AND EFFECTIVE COORDINATION AND MANAGEMENT OF COLLEGE-WIDE INFORMATION TECHNOLOGY SERVICES RELATED TO NETWORK OPERATIONS, DESKTOP SUPPORT, INSTRUCTIONAL SUPPORT, SERVER, AND DATABASE ADMINISTRATION, WEB APPLICATION AND DEVELOPMENT, AND IT RESOURCE AND BUDGET PLANNING FOR THE COLLEGE OF ACES. SERVE AS THE COLLEGE'S CHIEF INFORMATION OFFICER (CIO).\nMAJOR DUTIES AND RESPONSIBILITIES:STRATEGIC LEADERSHIP PROVIDE COLLEGE-WIDE STRATEGIC LEADERSHIP TO THE COLLEGE OF ACES FOR INFORMATION TECHNOLOGY SERVICES FOR RESEARCH, INSTRUCTIONAL, OUTREACH, AND ADMINISTRATIVE COMPUTING.WORK CLOSELY WITH THE DEAN, ASSOCIATE DEANS, ASSISTANT DEANS, DEPARTMENT HEADS AND DIRECTORS TO ALIGN IT SERVICES WITH THE MISSION AND STRATEGIC GOALS OF THE COLLEGE AND ITS UNITS. PROVIDE INPUT AND FEEDBACK TO ACES LEADERSHIP AND CONTRIBUTE TO STRATEGIC INITIATIVES.AS A MEMBER OF THE ACES TECHNOLOGY SERVICES (ATS) LEADERSHIP TEAM, EMPHASIZE THE IMPORTANCE OF MANAGING AND SUPPORTING SHARED RESOURCES, OPERATIONAL TRANSPARENCY, AND INNOVATION. ENCOURAGE COLLABORATION ACROSS DEPARTMENTAL BOUNDARIES TO PROVIDE EXCEPTIONAL SERVICES AND SUPPORT TO ACES FACULTY, STAFF, STUDENTS, RESEARCH PARTNERS, AND STATE-WIDE EXTENSION CUSTOMERS.IMPLEMENT A COORDINATED PROCESS IN RECRUITMENT, DEVELOPMENT, PROMOTION, RETENTION, AND ORGANIZATION OF IT PROFESSIONALS WITHIN ACES.CREATE COMMUNICATION, COLLABORATION AND COORDINATION PROCESSES THAT BUILD CONSENSUS, AND TRANSPARENCY TO EFFECTIVELY EXECUTE GOALS AND POLICIES THAT FURTHER THE VALUES OF ACES.DIRECT AND CONTINUOUSLY ADJUST ORGANIZATIONAL RESOURCE ALLOCATIONS TO ALIGN WITH STRATEGIC GOALS AND UNIT SERVICE REQUIREMENTS, INCLUDING BUT NOT LIMITED TO DEVELOPING, TRACKING, AND MANAGING THE ANNUAL OPERATING AND CAPITAL BUDGETS FOR ACES IT.IDENTIFY STRATEGIC INFORMATION TECHNOLOGY INITIATIVES. COMMUNICATE THE INITIATIVE AND PROVIDE DIRECTIONS TO IT PROFESSIONALS AND CONSTITUENTS TO ACCOMPLISH THE ESTABLISHED PROGRAMMATIC STRATEGIC INITIATIVES.WRITE REPORTS, FORMAL DOCUMENTS, RECOMMENDATIONS, AND STRATEGIC PLANS TARGETED AT THE COLLEGE AND CAMPUS LEADERSHIP, AS WELL AS BROADER CONSTITUENCY GROUPS AT ALL LEVELS OF CAMPUS.GATHER AND EVALUATE METRICS ON THE ORGANIZATION’S PERFORMANCE AND COMMUNICATE WITH STAFF AND STAKEHOLDERS.BUILD AND SUSTAIN COLLABORATIVE PARTNERSHIPS BETWEEN THE COLLEGE AND OTHER IT LEADERS AND CAMPUS. REPRESENT ACES ON INTERNAL AND EXTERNAL TECHNOLOGY GOVERNANCE COMMITTEES.OPERATIONS SUPERVISE AND MANAGE ATS TECHNICAL STAFF FOR ACES ADMINISTRATION IT SUPPORT PROMOTE THE USE OF CURRENT BEST PRACTICES FOR THE SUPPORT OF MISSION CRITICAL SERVICES.PROMOTE QUALITY IT SECURITY PRACTICES WITHIN THE COLLEGE.COORDINATE WITH UNITS ON THE EVALUATION, REQUISITION, PURCHASING, AND SUPPORT OF COLLEGE-WIDE IT SERVICES AND SOFTWARE LICENSESCOORDINATE WITH TECHNOLOGY SERVICES, ADMINISTRATIVE INFORMATION TECHNOLOGY SERVICES (AITS), ATS, AND OTHER IT ORGANIZATIONS ACROSS THE UNIVERSITY ON CURRENT AND POTENTIAL FUTURE SHARED SERVICE OFFERINGS.OVERSEE THE STRATEGIC PLAN FOR STRUCTURED PROGRAMMING FOR WEB DEVELOPMENT AND PROVIDE DIRECTION FOR ENHANCEMENTS TO THE COLLEGE OF ACES’ WEBSITE.PROVIDE ADMINISTRATIVE SUPPORT PROJECT MANAGEMENT, AND TECHNICAL EXPERTISE FOR WEB HOSTING AND AND/OR APPLICATION DEVELOPMENT FOR THE COLLEGE OF ACES ONLINE PRESENCE. MANAGE AND GUIDE WEB DEVELOPMENT PROJECTS IN CONCERT WITH THE OFFICE OF MARKETING COMMUNICATIONS NEEDS AND RECOMMENDATIONS TO SUPPORT THE COLLEGE OF ACES, DEPARTMENTS, AND ADMINISTRATIVE TEAMS. \nPOSITION REQUIREMENTS & QUALIFICATIONS:EDUCATION AND EXPERIENCEREQUIRED:BACHELOR'S DEGREEDEMONSTRATED TECHNICAL APTITUDE AND UNDERSTANDING OF IT BEST PRACTICESEIGHT YEARS OF EXPERIENCE WITH ONE OR MORE ASPECTS OF INFORMATION TECHNOLOGY INCLUDING AT LEAST 5 YEARS OF IT MANAGEMENT EXPERIENCE AND 2 YEARS DEVELOPING, COORDINATING, AND/OR IMPLEMENTING SHARED OR PARTNERED IT SERVICES.DEMONSTRATED SUCCESS DEVELOPING PARTNERSHIPS AND EFFECTIVE COLLABORATIONS WITH INDIVIDUALS AND UNITS THAT CROSS ORGANIZATIONAL AND/OR INSTITUTIONAL BOUNDARIES.DEMONSTRATED COMMITMENT TO AND EXPERIENCE PROVIDING CUSTOMER SERVICE.EXPERIENCE PARTICIPATING IN AND LEADING DIVERSE WORKGROUPS. EXPERIENCE HANDLING INCIDENT MANAGEMENT IN COMPLEX IT ENVIRONMENTS.EXPERIENCE DEVELOPING AND MANAGING BUDGETS.EXPERIENCE LEADING PROJECT MANAGEMENT ACTIVITIES.DEMONSTRATED LEADERSHIP IN BUILDING TEAMS AND IT SOLUTIONS.PREFERRED:MASTER'S DEGREE IN COMPUTER SCIENCE, INFORMATION TECHNOLOGY OR RELATED FIELDDEMONSTRATED EXPERIENCE MANAGING TECHNICAL PROFESSIONALS ENGAGED IN BOTH OPERATIONAL AND PROJECT-BASED ACTIVITIESDEMONSTRATED EXPERIENCE IN ONE OR MORE COMPONENTS OF WEB SERVICES; HOSTING, SERVER ADMINISTRATION, WEB ARCHITECTURE, WEB DEVELOPMENT, WEB CONTENT CREATION, ANALYTICS AND SEO, AND/OR WEB DESIGN.DEMONSTRATED EXPERIENCE IN LEADING LARGE, COMPLEX IT PROJECTS FROM IDEA TO IMPLEMENTATION, INCLUDING STAKEHOLDER MANAGEMENT AND COMMUNICATIONTRAINING, LICENSES, OR CERTIFICATIONSPREFERRED: FORMAL LEADERSHIP TRAINING TRAINING OR CERTIFICATIONS IN ITSM (IT SERVICE MANAGEMENT) SALARY AND APPOINTMENT DETAILS:THIS IS A FULL-TIME (100 FTE%, 12/12) ACADEMIC PROFESSIONAL APPOINTMENT. SALARY IS COMPETITIVE AND COMMENSURATE WITH QUALIFICATIONS AND EXPERIENCE, WHILE ALSO CONSIDERING INTERNAL EQUITY. THE SALARY RANGE FOR THIS POSITION STARTS AT $95,000. SPONSORSHIP FOR WORK AUTHORIZATION IS NOT AVAILABLE FOR THIS POSITION.\nAPPLICATON PROCEDURES:APPLY FOR THIS POSITION USING THE APPLY NOW BUTTON AT THE TOP OR BOTTOM OF THE POSTING ON HTTPS://JOBS.ILLINOIS.EDU AND UPLOAD YOUR COVER LETTER, RESUME, AND CONTACT INFORMATION FOR THREE REFERENCES. IF REQUIRED BY THE POSITION, TRANSCRIPTS OR OTHER DOCUMENTATION OF CREDENTIALS ARE TO BE PROVIDED NO LATER THAN THE FIRST DAY OF EMPLOYMENT.TO ENSURE FULL CONSIDERATION, APPLICATIONS SHOULD BE RECEIVED BY 6:00 PM (CST) ON APRIL 30, 2024. ALL REQUESTED INFORMATION MUST BE SUBMITTED VIA THE ONLINE SYSTEM FOR YOUR APPLICATION TO BE CONSIDERED. FOR FURTHER INFORMATION, PLEASE CONTACT JAMES HAZZARD, SEARCH CHAIR, VIA E-MAIL AT JHAZZARD@ILLINOIS.EDU . FOR QUESTIONS REGARDING THE APPLICATION PROCESS, PLEASE CONTACT 217-333-2137.THE UNIVERSITY OF ILLINOIS SYSTEM IS AN EQUAL OPPORTUNITY EMPLOYER, INCLUDING BUT NOT LIMITED TO DISABILITY AND/OR VETERAN STATUS, AND COMPLIES WITH ALL APPLICABLE STATE AND FEDERAL EMPLOYMENT MANDATES. PLEASE VISIT REQUIRED EMPLOYMENT NOTICES AND POSTERS TO VIEW OUR NON-DISCRIMINATION STATEMENT AND FIND ADDITIONAL INFORMATION ABOUT REQUIRED BACKGROUND CHECKS, SEXUAL HARASSMENT/MISCONDUCT DISCLOSURES, AND EMPLOYMENT ELIGIBILITY REVIEW THROUGH E-VERIFY.APPLICANTS WITH DISABILITIES ARE ENCOURAGED TO APPLY AND MAY REQUEST A REASONABLE ACCOMMODATION UNDER THE AMERICANS WITH DISABILITIES ACT (2008) TO COMPLETE THE APPLICATION AND/OR INTERVIEW PROCESS. REQUESTS MAY BE SUBMITTED THROUGH THE REASONABLE ACCOMMODATIONS PORTAL, OR BY CONTACTING THE ACCESSIBILITY & ACCOMMODATIONS DIVISION OF THE OFFICE FOR ACCESS AND EQUITY AT 217-333-0885, OR BY EMAILING ACCESSIBILITY@ILLINOIS.EDU.\n\n",
    "job_skill_set": [
      "web development",
      "server administration",
      "network operations",
      "IT security practices",
      "technical support",
      "web architecture",
      "problem solving",
      "innovation",
      "IT management",
      "budget management",
      "database administration",
      "project management",
      "data analytics",
      "customer service",
      "IT service management (ITSM)",
      "strategic leadership",
      "collaboration",
      "communication",
      "team building",
      "stakeholder management",
      "organizational skills",
      "transparency",
      "consensus building"
    ],
    "short_keywords": [
      "administration",
      "analytics",
      "architecture",
      "budget",
      "building",
      "collaboration",
      "communication",
      "consensus",
      "customer",
      "data",
      "database",
      "development",
      "director",
      "information",
      "informationtechnology",
      "innovation",
      "it",
      "itsm",
      "leadership",
      "management",
      "network",
      "of",
      "operations",
      "organizational",
      "practices",
      "problem",
      "project",
      "security",
      "server",
      "service",
      "skills",
      "solving",
      "stakeholder",
      "strategic",
      "support",
      "team",
      "technical",
      "technology",
      "transparency",
      "web"
    ]
  },
  {
    "job_id": "3901962110",
    "job_title": "A/P & Contract Analyst II - Information Technology",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "COMPANY SUMMARY\n\nDISH, AN ECHOSTAR COMPANY, HAS BEEN REIMAGINING THE FUTURE OF CONNECTIVITY FOR MORE THAN 40 YEARS. OUR BUSINESS REACH SPANS SATELLITE TELEVISION SERVICE, LIVE-STREAMING AND ON-DEMAND PROGRAMMING, SMART HOME INSTALLATION SERVICES, MOBILE PLANS AND PRODUCTS, AND NOW WE ARE BUILDING AMERICA’S FIRST SMART NETWORK™.\n\nTODAY, OUR BRANDS INCLUDE ECHOSTAR, HUGHES, DISH TV, SLING TV, BOOST INFINITE, BOOST MOBILE, DISH WIRELESS, ONTECH AND GENMOBILE.\n\nDEPARTMENT SUMMARY\n\nOUR TECHNOLOGY TEAMS CHALLENGE THE STATUS QUO AND REIMAGINE CAPABILITIES ACROSS INDUSTRIES. WHETHER THROUGH RESEARCH AND DEVELOPMENT, TECHNOLOGY INNOVATION OR SOLUTION ENGINEERING, OUR PEOPLE PLAY VITAL ROLES IN CONNECTING CONSUMERS WITH THE PRODUCTS AND PLATFORMS OF TOMORROW.\n\nJOB DUTIES AND RESPONSIBILITIES\n\nTHE ROLE OF THE INFORMATION TECHNOLOGY A/P & CONTRACT ANALYST II IS TO SUPPORT, AND FACILITATE CONTRACTS FOR TECHNOLOGY SPENDING ON SERVICES AND PRODUCTS ACROSS THE ORGANIZATION. THIS INCLUDES PROVIDING SUPPORT IN THE EXECUTION OF REQUESTS FOR REPORTING, TRANSACTION EXECUTION,GOODS AND SERVICES RECEIPTS AND TASKS AS ASSIGNED . THE ANALYST II WILL ALSO FACILITATE COMMUNICATION BETWEEN THE ENTERPRISE AND ITS PROVIDERS IN ORDER TO DELIVER PRODUCTS AND SERVICES ACCORDING TO PLAN AND WITHIN BUDGET.\n\nKEY RESPONSIBILITIES\n\nPROCESS PURCHASE ORDERS AND MAINTAIN THE PURCHASE ORDER SYSTEMACCOUNTS PAYABLE FUNCTIONS INCLUDE, PROCESS INVOICES, ENTER INVOICES INTO SYSTEM, PRINT CHECKS, PROCESS CHECKS FOR MAILING, FILE PAID INVOICES, RESEARCH PAID INVOICES FOR DEPARTMENTSSUPPORT SERVICE CONTRACTS FROM BEGINNING TO END, INCLUDING RECRUITMENT, PROCUREMENT, DEVELOPMENT, CONTRACT REVIEW, SERVICES, AND CONSULTANT CONTRACTSSUPPORT THE ORGANIZATION’S BUDGETING PROCESSESASSIST IN THE CREATION OF EXECUTIVE SUMMARIES/MEMOS WHICH PROVIDE LEADERSHIP KEY DETAILS OF IT CONTRACTSPERFORM CONTRACT RESEARCH AND PROVIDE NEEDED SUPPORT TO ASSIST OUR BUSINESS PARTNERS, VENDORS AND LEGAL TEAMS IN THE CONTRACT PROCESSASSIST WITH GOODS RECEIPT AND ACCOUNTING REPORTING AS NEEDEDLEARN AND TRANSACT EMPLOYEE ID CREATION PROCESS RELATED TO CONTRACT WORKERSRUN/ANALYZE CONTRACT REPORTS, IN SUPPORT OF STRATEGIC AND DAY TO DAY NEEDSSUPPORT IT DOCUMENT REPOSITORY TO ENSURE ALL AGREEMENTS ARE ENTERED TIMELY AND METADATA ASSOCIATED WITH THE AGREEMENTS IS DETAILED AND ACCURATEPROVIDE SUPPORT TO MEET DOCUMENTATION GATHERING DEADLINES DURING THE QUARTERLY CONTRACT RENEWAL PROCESSASSIST IN DOCUMENTING NEW AND EXISTING PROCESSES \n\nSKILLS, EXPERIENCE AND REQUIREMENTS\n\nEDUCATION AND EXPERIENCE:\n\nBACHELOR'S DEGREE IN THE FIELD OF BUSINESS, INFORMATION TECHNOLOGY OR OTHER RELATED FIELDMINIMUM 2 YEARS DIRECT WORK EXPERIENCE IN A CONTRACT MANAGEMENT OR SIMILAR POSITION\n\nSKILLS AND QUALIFICATIONS\n\nEXPERIENCE WITH ORACLE, MS EXCEL, AND GOOGLE WORKSPACE PREFERREDABILITY TO ELICIT COOPERATION FROM A WIDE VARIETY OF SOURCESSTRONG WRITTEN AND ORAL COMMUNICATION SKILLSSTRONG INTERPERSONAL SKILLS; PERSUASIVE, ENCOURAGING, AND DIPLOMATICADEPT AT CONDUCTING RESEARCH INTO PRODUCT- AND SERVICE-RELATED ISSUESMUST BE ABLE TO LEARN, UNDERSTAND, AND APPLY NEW TECHNOLOGIESCUSTOMER SERVICE SKILLS ARE AN ASSETABILITY TO EFFECTIVELY PRIORITIZE AND EXECUTE TASKS IN A HIGH-PRESSURE ENVIRONMENT IS CRUCIAL\n\nSALARY RANGES\n\nCOMPENSATION: $63,150.00/YEAR - $90,000.00/YEAR\n\nBENEFITS\n\nWE OFFER VERSATILE HEALTH PERKS, INCLUDING FLEXIBLE SPENDING ACCOUNTS, HSA, A 401(K) PLAN WITH COMPANY MATCH, ESPP, CAREER OPPORTUNITIES AND A FLEXIBLE TIME AWAY PLAN; ALL BENEFITS CAN BE VIEWED HERE: DISH BENEFITS.\n\nTHE BASE PAY RANGE SHOWN IS A GUIDELINE. INDIVIDUAL TOTAL COMPENSATION WILL VARY BASED ON FACTORS SUCH AS QUALIFICATIONS, SKILL LEVEL AND COMPETENCIES; COMPENSATION IS BASED ON THE ROLE'S LOCATION AND IS SUBJECT TO CHANGE BASED ON WORK LOCATION. CANDIDATES NEED TO SUCCESSFULLY COMPLETE A PRE-EMPLOYMENT SCREEN, WHICH MAY INCLUDE A DRUG TEST AND DMV CHECK.\n\nTHIS WILL BE POSTED FOR A MINIMUM OF 3 DAYS OR UNTIL THE POSITION IS FILLED.\n\n",
    "job_skill_set": [
      "MS Excel",
      "Budgeting",
      "Research Skills",
      "Data Analysis",
      "Communication",
      "Interpersonal Skills",
      "Prioritization",
      "Problem Solving",
      "Teamwork",
      "Adaptability",
      "Oracle",
      "Google Workspace",
      "Contract Management",
      "Purchase Order Processing",
      "Accounts Payable",
      "Documentation Management",
      "Customer Service"
    ],
    "short_keywords": [
      "accounts",
      "adaptability",
      "analysis",
      "analyst",
      "ap",
      "budgeting",
      "communication",
      "contract",
      "customer",
      "data",
      "documentation",
      "excel",
      "google",
      "ii",
      "information",
      "informationtechnology",
      "interpersonal",
      "management",
      "ms",
      "oracle",
      "order",
      "payable",
      "prioritization",
      "problem",
      "processing",
      "purchase",
      "research",
      "service",
      "skills",
      "solving",
      "teamwork",
      "technology",
      "workspace"
    ]
  },
  {
    "job_id": "3904060888",
    "job_title": "Information Technology Specialist (Policy and Planning) (Direct Hire)",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "DUTIES\n\nSUMMARY\n\nTHE COMPUTER SYSTEMS ENGINEER SERVES WITHIN THE TECHNOLOGY ADVANCEMENT AND SERVICES OFFICE (TASO) AT NASA'S INDEPENDENT VERIFICATION AND VALIDATION (IV&V) FACILITY. THE IV&V PROGRAM PROVIDES SOFTWARE AND SECURITY ASSURANCE TO NASA MISSIONS. TASO SUPPORTS THE IV&V PROGRAM BY PROVIDING CUSTOMIZED MISSION SUPPORT FOR ANALYSIS OF FLIGHT SOFTWARE PRODUCTS, EMULATORS AND SIMULATORS USED TO PERFORM INDEPENDENT TESTING, AND INFORMATION TECHNOLOGY INFRASTRUCTURE TAILORED TO THE MISSION ENVIRONMENT.\n\nREQUIREMENTS\n\nQUALIFICATIONS\n\nSPECIALIZED EXPERIENCE IS EXPERIENCE THAT HAS EQUIPPED YOU WITH THE PARTICULAR ABILITY, SKILL, AND KNOWLEDGE TO SUCCESSFULLY PERFORM THE DUTIES OF THIS POSITION AND IS TYPICALLY IN OR RELATED TO THIS LINE OF WORK. TO QUALIFY FOR GS-13, YOU MUST HAVE ONE YEAR OF DIRECTLY RELATED SPECIALIZED EXPERIENCE EQUIVALENT TO THE GS-12 LEVEL. IDENTIFYING GOALS AND OBJECTIVES RELATED TO AREAS SUCH AS MISSION SOFTWARE, COMPUTER SYSTEMS, AND/OR NETWORKS; PERFORMING ASSESSMENTS TO IDENTIFY RISKS, ISSUES, AND/OR CONCERNS; IMPLEMENTING SOLUTIONS RELATED TO ONE OR MORE OF THE FOLLOWING AREAS: NETWORK SERVICES, APPLICATION SOFTWARE, OPERATING SYSTEMS, SYSTEMS ADMINISTRATION, ENTERPRISE ARCHITECTURE. AND IF YOU ARE QUALIFYING BASED ON EXPERIENCE, YOU MUST ALSO HAVE IT-RELATED EXPERIENCE DEMONSTRATING EACH OF THE FOUR COMPETENCIES LISTED BELOW: ATTENTION TO DETAIL - IS THOROUGH WHEN PERFORMING WORK AND CONSCIENTIOUS ABOUT ATTENDING TO DETAIL. CUSTOMER SERVICE - WORKS WITH CLIENTS AND CUSTOMERS (THAT IS, ANY INDIVIDUALS WHO USE OR RECEIVE THE SERVICES OR PRODUCTS THAT YOUR WORK UNIT PRODUCES, INCLUDING THE GENERAL PUBLIC, INDIVIDUALS WHO WORK IN THE AGENCY, OTHER AGENCIES, OR ORGANIZATIONS OUTSIDE THE GOVERNMENT) TO ASSESS THEIR NEEDS, PROVIDE INFORMATION OR ASSISTANCE, RESOLVE THEIR PROBLEMS, OR SATISFY THEIR EXPECTATIONS; KNOWS ABOUT AVAILABLE PRODUCTS AND SERVICES; IS COMMITTED TO PROVIDING QUALITY PRODUCTS AND SERVICES. ORAL COMMUNICATION - EXPRESSES INFORMATION (FOR EXAMPLE, IDEAS OR FACTS) TO INDIVIDUALS OR GROUPS EFFECTIVELY, TAKING INTO ACCOUNT THE AUDIENCE AND NATURE OF THE INFORMATION (FOR EXAMPLE, TECHNICAL, SENSITIVE, CONTROVERSIAL); MAKES CLEAR AND CONVINCING ORAL PRESENTATIONS; LISTENS TO OTHERS, ATTENDS TO NONVERBAL CUES, AND RESPONDS APPROPRIATELY. PROBLEM SOLVING - IDENTIFIES PROBLEMS; DETERMINES ACCURACY AND RELEVANCE OF INFORMATION; USES SOUND JUDGMENT TO GENERATE AND EVALUATE ALTERNATIVES, AND TO MAKE RECOMMENDATIONS. \n\n\n\nYOUR RESUME MUST INCLUDE A CLEAR AND DETAILED NARRATIVE DESCRIPTION, IN YOUR OWN WORDS, OF HOW YOU MEET THE REQUIRED SPECIALIZED EXPERIENCE. EXPERIENCE STATEMENTS COPIED FROM A POSITION DESCRIPTION, VACANCY ANNOUNCEMENT OR OTHER REFERENCE MATERIAL CONSTITUTES PLAGIARISM AND MAY RESULT IN DISQUALIFICATION AND LOSING CONSIDERATION FOR THE JOB.\n\n NASA PROHIBITS THE USE OF ARTIFICIAL INTELLIGENCE (AI) OR AI-ASSISTED TOOL IN DRAFTING APPLICATION AND ASSESSMENT RESPONSES. PLEASE VISIT HTTPS://WWW.NASA.GOV/CAREERS/HOW-TO-APPLY/#ARTIFICIAL-INTELLIGENCE TO REVIEW NASA'S GUIDANCE ON THE USE OF AI TOOLS DURING THE APPLICATION PROCESS.\n\nEXPLORE THE EXTRAORDINARY CALLING ALL THE INNOVATORS, PIONEERS, VISIONARIES, AND ADVENTURERS! WE ARE A DIVERSE GROUP OF PROFESSIONALS UNITED BY A COMMON PURPOSE: TO DISCOVER AND EXPAND KNOWLEDGE FOR THE BENEFIT OF HUMANITY. WE'RE BUILDING ON OUR RICH LEGACY BY EMBARKING ON NEW AND EXCITING MISSIONS, BOTH ON EARTH AND BEYOND AND WE'RE LOOKING FOR FRESH IDEAS TO HELP US GET THERE. DO YOU HAVE A PASSION FOR EXPLORATION? DO YOU WANT YOUR WORK TO LEAVE AN ENDURING IMPACT? JOIN US IN A CAREER THAT CAN TAKE YOU FARTHER THAN YOU CAN IMAGINE. AT NASA, OUR WORK IS MORE THAN JUST A PROFESSION-IT'S A LIFELONG PURSUIT, A PASSION, AND A CHANCE TO CHANGE THE WORLD. NASA IS MORE THAN ASTRONAUTS. WE ARE SCIENTISTS, ENGINEERS, IT SPECIALISTS, HUMAN RESOURCES SPECIALISTS, ACCOUNTANTS, WRITERS, TECHNICIANS AND MANY OTHER KINDS OF PEOPLE WORKING TOGETHER TO BREAK BARRIERS TO ACHIEVE THE SEEMINGLY IMPOSSIBLE. EXPLORE THE EXTRAORDINARY, EVERY DAY; EXPLORE A CAREER AT NASA!",
    "job_skill_set": [
      "network services",
      "application software",
      "operating systems",
      "systems administration",
      "risk assessment",
      "software assurance",
      "security assurance",
      "attention to detail",
      "customer service",
      "oral communication",
      "problem solving",
      "enterprise architecture",
      "flight software analysis",
      "emulators and simulators"
    ],
    "short_keywords": [
      "administration",
      "analysis",
      "and",
      "application",
      "architecture",
      "assessment",
      "assurance",
      "attention",
      "communication",
      "customer",
      "detail",
      "direct",
      "emulators",
      "enterprise",
      "flight",
      "hire",
      "information",
      "informationtechnology",
      "network",
      "operating",
      "oral",
      "planning",
      "policy",
      "problem",
      "risk",
      "security",
      "service",
      "services",
      "simulators",
      "software",
      "solving",
      "specialist",
      "systems",
      "technology",
      "to"
    ]
  },
  {
    "job_id": "3904946187",
    "job_title": "Information Technology Support Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "RIVERSTRONG IS LOOKING FOR DRIVEN IT SUPPORT SPECIALISTS WHO POSSESS THE GRIT AND ENERGY TO HELP US GROW IN AN MSP START-UP ENVIRONMENT WEARING MANY HATS IN THE OREGON REGION. THE IDEAL CANDIDATE WILL BE EXPERIENCED IN AN IT SUPPORT CONSULTING OR MSP HELP DESK ENVIRONMENT. YOU WILL HELP CUSTOMERS WITH IT-RELATED END-USER SUPPORT SITUATIONS AND DRIVE THE ADOPTION OF NEW TECHNOLOGIES REMOTELY OR ON LOCATION.\n● COORDINATE AND PERFORM REMOTE OR CLIENT OFFICE FIXES AT THE DESKTOP/ACCOUNT LEVEL, INCLUDING TROUBLESHOOTING, INSTALLING/CONFIGURING SOFTWARE, ACCOUNT ACCESS, AND ALL OTHER TECH SERVICE REQUESTS● REMOTELY TROUBLESHOOT END-USER SERVICE DESK NEEDS FOR OUR CLIENT OFFICES, RETAIL STORES, WAREHOUSES, AND OTHER LOCATIONS● RESOLVE LEVEL 1 ISSUES WITH DESKTOPS, NETWORKS, AD, SERVERS, CLOUD SERVICES, SAAS, PERMISSIONS, ACCESS REQUESTS, CONNECTIVITY ISSUES, HARDWARE FAILURES, ETC.● MANAGE AND OWN THE MULTI-CHANNEL TICKET AND PHONE CONTACT CENTER QUEUES TO ENSURE A SUCCESSFUL RESOLUTION TO ALL ASSIGNED TICKETS● COMMUNICATE WITH ALL STAKEHOLDERS DURING THE TICKET LIFECYCLE AND ESCALATE AS NECESSARY● CREATE AND MAINTAIN A KNOWLEDGE BASE/DOCUMENTATION OF CLIENT PROCESSES, NETWORK DIAGRAMS, AND SUPPORT PROCESSES IN COLLABORATION WITH THE SENIOR SMES● PERFORM CLIENT ON-PREMISES TECHNOLOGY TROUBLESHOOTING, DECOMMISSIONS, IMPLEMENTATIONS, AND OTHER IT-RELATED HARDWARE OR SOFTWARE SUPPORT TASKS IF REQUIRED● KEEP CURRENT ON THE LATEST TECHNICAL CERTIFICATIONS, AND TECHNOLOGY INNOVATIONS, AND ASSIST IN DETERMINING THE BEST INVESTMENTS FOR THE BUSINESS AND OUR CLIENTS● CREATE A POSITIVE EXPERIENCE FOR OUR CUSTOMERS AND STAFF IN EVERY ENGAGEMENT, BUT MOST IMPORTANTLY, HAVE FUN WHILE DOING GREAT WORK. WHAT YOU’LL DO: THE PATH TO SUCCESS IN THIS ROLE WILL INCLUDE A PASSION FOR HELPING PEOPLE IN NEED, THE ABILITY TO MULTITASK, COLLABORATE, WORK WITH A TEAM, ATTENTION TO DETAIL, END-TO-END TICKET OWNERSHIP, AND TECHNICAL COMPETENCIES IN END-USER TECHNOLOGIES. YOU ALSO MUST HAVE IN-DEPTH CUSTOMER SERVICE EXPERIENCE, INCIDENT MANAGEMENT, CUSTOMER RESOLUTION SKILLS, AND A PLEASANT PERSONA OVER THE PHONE OR VIDEO. THIS ROLE WILL WORK CLOSELY WITH RIVERSTRONG LEADERS TO BUILD EXCELLENCE IN DELIVERING TECHNICAL SUPPORT AND CALL CENTER OPERATIONS. DEFINE THE BEST PRACTICE PROCESSES, RESEARCH, AND DEVELOP THE NEXT-GENERATION TOOLS TO ACHIEVE EFFICIENCY WHILE MAKING OUR LIVES EASIER.\n● 2+ YEARS OF PROVIDING PROACTIVE EXCEPTIONAL IT SUPPORT CUSTOMER SERVICE, EXCELLENT PHONE PRESENCE, ABILITY TO DEAL WITH ALL LEVELS OF USERS IN A PROFESSIONAL MANNER● BE FRIENDLY AND ABLE TO SMILE A LOT WHILE WORKING IN CHALLENGING SITUATIONS● COORDINATE AND PERFORM REMOTE FIXES AT THE DESKTOP/ACCOUNT LEVEL, INCLUDING TROUBLESHOOTING, INSTALLING/CONFIGURING SOFTWARE, ACCOUNT ACCESS, AND ALL OTHER TECH SERVICE REQUESTS● TROUBLESHOOT BASIC IT SERVICE DESK NEEDS FOR OUR CLIENT OFFICES, RETAIL STORES, WAREHOUSES, AND OTHER LOCATIONS● RESOLVE LEVEL 1 ISSUES WITH DESKTOPS, CUSTOM APPLICATIONS, NETWORKS, AD, SERVERS, CLOUD SERVICES, SAAS, PERMISSIONS, ACCESS REQUESTS, CONNECTIVITY ISSUES, HARDWARE FAILURES, ETC.● MANAGE AND OWN THE MULTI-CHANNEL TICKET QUEUE TO ENSURE A SUCCESSFUL RESOLUTION TO ALL ASSIGNED TICKETS● COMMUNICATE WITH ALL STAKEHOLDERS DURING THE TICKET LIFECYCLE AND ESCALATE AS NECESSARY● CREATE AND MAINTAIN A KNOWLEDGE BASE/DOCUMENTATION OF PROCESSES, NETWORK DIAGRAMS, AND SUPPORT PROCESSES IN COLLABORATION WITH THE LEVEL 2 & LEVEL 3 EXPERTS.● PROBLEM-SOLVE AND COMMUNICATE TECHNICAL INFORMATION TO NON-TECHNICAL END-USERS ACROSS VARIOUS INDUSTRIES● TEAM PLAYER WITH A STRONG WORK ETHIC OPERATING WITH A SENSE OF URGENCY AND UNDERSTANDING● SEEK WAYS TO CREATE EFFICIENCIES BY UTILIZING TECHNOLOGIES IN AUTOMATION TOOLS OR SCRIPTING OF SERVICES● NIGHTS AND WEEKEND SCHEDULES ARE REQUIRED● TRAVEL AS REQUIRED BY CLIENT PROJECTS OR UP TO 30%.● CREATE A WONDERFUL, POSITIVE, AND GREAT EXPERIENCE FOR ALL OUR CUSTOMERS IN EVERY ENGAGEMENTWHAT WE’RE LOOKING FOR: OUR IDEAL CANDIDATE KNOWS HOW TO TAKE CARE OF AN END-USER OR CUSTOMER FROM THE FIRST CALL TO THE CLOSE OF THE TICKET WHILE PROVIDING HELPFUL SERVICE WITH A SMILE TO PEOPLE NEEDING TECHNICAL SUPPORT. BUT MOSTLY, WE LIKE TO HAVE FUN WHILE DELIVERING EXCEPTIONAL SERVICES FOR OUR CLIENTS.\n● PASSION FOR PEOPLE, COLLABORATION, AUTHENTICITY, AND UNAFRAID TO LEARN FROM MISTAKES.● EXCEL IN THE FAIL-FAST AND CONTINUOUS IMPROVEMENT METHODOLOGIES ● EXPERIENCE WITH POINT OF SALE, GOOGLE WORKSPACE, O365, MAC/IOS, ANDROID, WINDOWS DESKTOP OS, TABLETS, TELEPHONE SYSTEMS, PRINTERS, SCANNERS, OR ANY TYPICAL END-USER TECHNOLOGIES● IT INDUSTRY-SPECIFIC CERTIFICATIONS A PLUS (MICROSOFT 365 FUNDAMENTALS, GOOGLE IT SUPPORT PROFESSIONAL, SALESFORCE ADMINISTRATOR, AMAZON AWS CLOUD PRACTITIONER, COMPTIA+, ETC.)● CRM (SALESFORCE) & TICKETING SYSTEMS (SERVICE CLOUD, SERVICENOW, CHERWELL, ZENDESK, ETC.) EXPERIENCE A PLUS. SALESFORCE ADMIN EXPERIENCE IS A HUGE PLUS● EXPERIENCE WITH ITIL, INCIDENT MANAGEMENT, TICKET RESOLUTION, AND PROBLEM MANAGEMENT● ABILITY TO UTILIZE MULTIPLE RESOURCES TO DETERMINE ROOT CAUSES AND RESOLUTIONS OF TECHNOLOGY PROBLEMS AND INCIDENTS● MUST BE AUTHORIZED TO WORK FOR ANY U.S. EMPLOYERWHAT WE CAN OFFER YOU: ● COMPETITIVE SALARY● TRAVEL REIMBURSEMENT● FULL-TIME WFH● FLEXIBLE PTO● PAID MAJOR HOLIDAYS● HEALTHCARE, DENTAL, AND VISION COVERAGE● 401K\nDON’T WAIT; START GROWING YOUR CAREER WITH RIVERSTRONG TODAY! AT RIVERSTRONG, WE RECOGNIZE THAT OUR PEOPLE ARE OUR STRONGEST ASSET. SINCE OUR FOUNDING, WE’VE SOUGHT TO HARNESS THE POWER OF PEOPLE AND TECHNOLOGY TO FUEL MEANINGFUL, POSITIVE CONNECTIONS BETWEEN BUSINESSES AND CONSUMERS. OUR THRIVING COMMUNITY OF CREATIVE THINKERS AND MAKERS SETS US APART BY CONTINUALLY FINDING NEW WAYS TO TURN INNOVATIVE TECHNOLOGY SOLUTIONS INTO REMARKABLE CUSTOMER EXPERIENCES.  OUR ULTIMATE GOAL IS TO BECOME A TRUSTED ADVISOR IN THE MSP IT INDUSTRY SPECIALIZING IN VARIOUS INDUSTRIES SUCH AS RETAIL, HARDWARE, DISTRIBUTION, FINANCIAL SERVICES, AND BEYOND. TO THAT END, WE’VE GATHERED SOME OF THE BEST AND BRIGHTEST IN TECH TO ENSURE THAT RIVERSTRONG’S COLLECTIVE STRATEGIC KNOWLEDGE, BUSINESS ACUMEN, INDUSTRY KNOWLEDGE, AND DEEP TECHNICAL EXPERTISE SET US APART FROM OUR COMPETITORS. WE ARE A START-UP WITH THE MINDSET TO DO IT BETTER. WITH SUPPORT AND INVESTMENT FROM GERENT, RIVERSTRONG IS WELL-POSITIONED TO GROW FAST. WE HAVE A PIVOTAL OPPORTUNITY TO EXPAND EXPONENTIALLY OVER THE NEXT FEW YEARS. WE NEED TALENTED PROFESSIONALS WHO CAN HELP US GROW — AND WANT TO GROW ALONGSIDE US. WHY WORK WITH RIVERSTRONG? ● RELATIONSHIPS ARE OUR GOLD STANDARD.WE PUT OUR PEOPLE FIRST BECAUSE WE KNOW HOW WE TREAT OUR EMPLOYEES IS HOW THEY’LL TREAT OUR CUSTOMERS. ● LEARNING NEVER STOPS.OUR TEAM HAS AN UNQUENCHABLE THIRST FOR KNOWLEDGE. WE EMBRACE CURIOSITY AND CONTINUOUS LEARNING, PUSHING OURSELVES TO IMPROVE OUR SKILLS AND STAY ABREAST OF INDUSTRY AND TECHNICAL INNOVATIONS. ● WORKING TO LIVE.WORK IS JUST ONE FACET OF A PERSON’S LIFE, AND WE INTEND TO KEEP IT THAT WAY. THAT’S WHY OUR ENTIRE TEAM WORKS REMOTELY—WE’VE FOUND THAT WORKING FROM HOME MEANS HAVING MORE TIME TO SPEND ON OUR PASSIONS AND WITH OUR FAMILIES. ● EMBRACING OUR DIFFERENCES.DIVERSITY IS ONE OF OUR GREATEST STRENGTHS. WE CAN GENERATE THE BEST IDEAS AND SOLUTIONS BY INCLUDING PEOPLE FROM ALL WALKS OF LIFE. ● WE SEE AND SEEK THE BEST IN PEOPLE.WE ASSUME THE BEST OF THOSE WE WORK WITH. WE’VE FOUND THAT ASSUMING POSITIVE INTENT FROM OUR CLIENTS AND COLLEAGUES LEADS TO A POSITIVE WORK ENVIRONMENT WHERE EVERYONE THRIVES. ● GREATER THAN THE SUM OF OUR PARTS.WE BELIEVE WE’RE AT OUR BEST WHEN WE WORK TOGETHER. WE’VE CREATED A CULTURE IN WHICH TEAM MEMBERS UNITE AND ELEVATE ONE ANOTHER TO PERFORM AT A HIGHER STANDARD THAN THEY COULD ALONE. ● CONSTANTLY STRIVING FOR EXCELLENCE.WHEN SOMETHING IS GOOD, WE WANT TO MAKE IT GREAT. IT’S IN OUR COMPANY DNA TO CHALLENGE THE STATUS QUO AND PUSH THE ENVELOPE. WE’RE NOT AFRAID TO ASK HARD QUESTIONS THAT IMPROVE OUR WORK.\n● DOING THE RIGHT THING.WE KEEP OUR MORAL COMPASS CLOSE AT HAND. WE STRIVE TO DO THE RIGHT THING IN EVERY SITUATION, WHETHER BIG OR SMALL. WE’RE ALWAYS LOOKING FOR TALENTED PROFESSIONALS WHO CAN HELP MAKE OUR COMPANY — AND TEAM — STRONGER AND MORE CAPABLE. ",
    "job_skill_set": [
      "IT support",
      "troubleshooting",
      "software installation/configuration",
      "network management",
      "cloud services",
      "SaaS",
      "hardware support",
      "ticketing systems",
      "CRM (Salesforce)",
      "ITIL",
      "incident management",
      "technical certifications",
      "Google Workspace",
      "O365",
      "Windows Desktop OS",
      "Mac/iOS",
      "Android",
      "point of sale systems",
      "documentation",
      "network diagrams",
      "automation tools",
      "customer service",
      "communication",
      "teamwork",
      "problem solving",
      "attention to detail",
      "multitasking",
      "collaboration",
      "positive attitude",
      "adaptability",
      "work ethic",
      "continuous learning",
      "time management"
    ],
    "short_keywords": [
      "adaptability",
      "android",
      "attention",
      "attitude",
      "automation",
      "certifications",
      "cloud",
      "collaboration",
      "communication",
      "continuous",
      "crm",
      "customer",
      "desktop",
      "detail",
      "diagrams",
      "documentation",
      "ethic",
      "google",
      "hardware",
      "incident",
      "information",
      "informationtechnology",
      "installationconfiguration",
      "it",
      "itil",
      "learning",
      "macios",
      "management",
      "multitasking",
      "network",
      "o365",
      "of",
      "os",
      "point",
      "positive",
      "problem",
      "saas",
      "sale",
      "salesforce",
      "service",
      "services",
      "software",
      "solving",
      "specialist",
      "support",
      "systems",
      "teamwork",
      "technical",
      "technology",
      "ticketing",
      "time",
      "to",
      "tools",
      "troubleshooting",
      "windows",
      "work",
      "workspace"
    ]
  },
  {
    "job_id": "3905214623",
    "job_title": "Information Technology Support Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "SUMMARY: WE ARE SEEKING A DYNAMIC SYSTEMS SUPPORT MANAGER TO LEAD OUR TEAM OF IT PROFESSIONALS IN DELIVERING TOP-NOTCH TECHNICAL ASSISTANCE, ENSURING MAXIMUM PRODUCTIVITY AND EFFICIENCY.RESPONSIBILITIES:LEAD, MENTOR, AND MANAGE A TEAM OF SYSTEMS SUPPORT PROFESSIONALS, FOSTERING A COLLABORATIVE AND MOTIVATED WORK ENVIRONMENT.OVERSEE THE MANAGEMENT OF THE SUPPORT TICKET QUEUE, ENSURING PROMPT ASSIGNMENT AND RESOLUTION IN ACCORDANCE WITH PREDEFINED SERVICE LEVEL AGREEMENTS.PROVIDE HANDS-ON TECHNICAL SUPPORT TO EMPLOYEES, ADDRESSING HARDWARE AND SOFTWARE ISSUES EFFICIENTLY, AND SERVING AS AN ESCALATION POINT FOR COMPLEX INCIDENTS.SUPERVISE INCIDENT AND PROBLEM MANAGEMENT PROCESSES, IDENTIFYING RECURRING ISSUES AND IMPLEMENTING PREVENTIVE MEASURES TO ENHANCE SYSTEM STABILITY.COLLABORATE WITH STAKEHOLDERS TO MANAGE AND MAINTAIN THE COMPANY'S IT INFRASTRUCTURE, INCLUDING SERVERS, NETWORKS, AND SOFTWARE APPLICATIONS.DEVELOP AND MAINTAIN COMPREHENSIVE DOCUMENTATION ON IT SYSTEMS, PROCESSES, AND PROCEDURES TO FACILITATE SELF-SERVICE AND EMPOWER EMPLOYEES.LIAISE WITH EXTERNAL VENDORS AND SERVICE PROVIDERS TO ENSURE TIMELY DELIVERY OF IT SERVICES, AND COLLABORATE WITH INTERNAL STAKEHOLDERS TO UNDERSTAND AND ADDRESS SYSTEM SUPPORT NEEDS.IMPLEMENT AND ENFORCE IT SECURITY POLICIES, PROCEDURES, AND BEST PRACTICES TO SAFEGUARD COMPANY DATA AND SYSTEMS.QUALIFICATIONS:PROVEN EXPERIENCE IN MANAGING A TEAM OF SYSTEMS SUPPORT PROFESSIONALS.MINIMUM OF 7 YEARS EXPERIENCE IN TECHNOLOGY SUPPORT WITH AT LEAST 3 YEARS IN A LEADERSHIP ROLE.STRONG TECHNICAL KNOWLEDGE AND HANDS-ON EXPERIENCE SUPPORTING IT INFRASTRUCTURE, HARDWARE, SOFTWARE, AND NETWORKS.FAMILIARITY WITH MICROSOFT-BASED IT SERVICE MANAGEMENT (ITSM) PRINCIPLES AND TICKETING SYSTEMS.PROFICIENCY IN CONFIGURING, MAINTAINING, AND TROUBLESHOOTING MICROSOFT OPERATING SYSTEMS AND APPLICATIONS.PROFICIENCY WITH MICROSOFT AZURE (PAAS AND IAAS RESOURCES) HIGHLY DESIRED.EXCELLENT PROBLEM-SOLVING SKILLS AND ABILITY TO PRIORITIZE TASKS IN A DYNAMIC ENVIRONMENT.EXCEPTIONAL COMMUNICATION AND INTERPERSONAL SKILLS.KNOWLEDGE OF IT SECURITY PRACTICES AND REGULATORY COMPLIANCE IS A PLUS.BACHELOR'S DEGREE IN COMPUTER SCIENCE, INFORMATION TECHNOLOGY, OR RELATED FIELD (OR EQUIVALENT WORK EXPERIENCE).PHYSICAL DEMANDS:FREQUENTLY STAND, WALK, AND SIT.ABILITY TO WORK VIRTUALLY AND IN AN OFFICE ENVIRONMENT.EXTENDED AND VARYING WORK SCHEDULES – AT LEAST 40 HOURS PER WEEK, SOME NIGHTS, WEEKENDS, AND HOLIDAYS REQUIRED.FREQUENTLY USE COMPUTER EQUIPMENT AND TELEPHONE.FAST-PACED, CHANGING, MULTI-TASKING ENVIRONMENT.",
    "job_skill_set": [
      "IT support",
      "team management",
      "technical support",
      "IT infrastructure",
      "Microsoft operating systems",
      "Microsoft Azure",
      "IT security practices",
      "regulatory compliance",
      "problem solving",
      "communication",
      "interpersonal skills",
      "collaboration",
      "leadership",
      "prioritization",
      "adaptability",
      "incident management",
      "problem management",
      "Microsoft ITSM",
      "ticketing systems"
    ],
    "short_keywords": [
      "adaptability",
      "azure",
      "collaboration",
      "communication",
      "compliance",
      "incident",
      "information",
      "informationtechnology",
      "infrastructure",
      "interpersonal",
      "it",
      "itsm",
      "leadership",
      "management",
      "manager",
      "microsoft",
      "operating",
      "practices",
      "prioritization",
      "problem",
      "regulatory",
      "security",
      "skills",
      "solving",
      "support",
      "systems",
      "team",
      "technical",
      "technology",
      "ticketing"
    ]
  },
  {
    "job_id": "3899534445",
    "job_title": "Assistant Director of Information Technology",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOB DESCRIPTION:THIS POSITION WILL LEAD THE TEAM THAT PROVIDES SYSTEM AND BUSINESS PROCESS SUPPORT FOR PAYROLL AND TIMEKEEPING. THIS POSITION SERVES AS THE TEAM LEAD OF THE FUNCTIONAL TEAM SUPPORTING THE SAP PAYROLL, API TIMEKEEPING AND CUSTOM-BUILT SAP TIMEKEEPING. THIS IS A TECHNICAL POSITION, NOT A FUNCTIONAL MANAGER. IT WILL REQUIRE A BLEND OF TECHNICAL SKILLS AND MANAGEMENT (BOTH PROJECT & PEOPLE) SKILLS.\nMUST HAVES: BACHELOR’S DEGREE REQUIREDMINIMUM OF 5 YEARS OF EXPERIENCE IN BUSINESS OPERATIONS OR FINANCIAL MANAGEMENT (PREFERABLY IN HIGHER EDUCATION OR HEALTHCARE)EXPERIENCE IN CONFIGURING AND IMPLEMENTING HR/PAYROLL MODULES IN SAP (R/3, WORKFLOW AND BUSINESS WAREHOUSE) AND PAYROLL CONTROL CENTER.KNOWLEDGE OF PAYROLL TAX REPORTING, MULTISTATE TAXATION AND BSI TAX SOFTWAREPREFER EXPERIENCE WITH THIRD PARTY TIMEKEEPING SYSTEMS SUCH AS API HEALTHCARE, KRONOS, ETC.EXPERIENCE MANAGING MULTIPLE PROJECTS/ASSIGNMENTS, ABILITY TO WORK WITH A BROAD RANGE OF ADMINISTRATIVE, TECHNICAL, AND FUNCTIONAL STAFF, AND A BROAD UNDERSTANDING OF UNIVERSITY AND HEALTH SYSTEM ADMINISTRATION AND OPERATIONS ARE REQUIRED. PLUSSES:EXPERIENCE IN HIGHER EDUCATION AND/OR HEALTHCARESAP CERTIFICATIONS\n\nJOB RESPONSIBILITIES:MANAGE THE TEAM WHICH SUPPORTS PAYROLL AND TIME FUNCTIONALITY INCLUDING RESOURCE ALLOCATION, PRIORITY SETTING, PERFORMANCE EVALUATIONS AND PLANNING FOR TEAM MEMBER PROFESSIONAL GROWTH.SERVE AS THE LEAD RESOURCE ON VARIOUS NEW PAYROLL AND TIME PROJECTS FOR THE UNIVERSITY AND HEALTH SYSTEM. DUTIES INCLUDE PROJECT MANAGEMENT, REQUIREMENTS ANALYSIS, DESIGN SPECIFICATION DEVELOPMENT, R/3 SYSTEM CONFIGURATION, AND IMPLEMENTATION. PROJECT MANAGEMENT DUTIES INCLUDE LEADING MEETINGS, DEVELOPING PROJECT PLANS, LEADING DESIGN AND BUSINESS PROCESS CHANGE EFFORTS, IDENTIFYING SECURITY REQUIREMENTS, DEVELOPING TEST PLANS, AND OVERALL TEAM COORDINATION.OVERSEE DAY TO DAY PRODUCTION SUPPORT FOR SAP PAYROLL INCLUDING TESTING UPGRADES, RESOLVING INTEGRATION ISSUES WITH THE FINANCIAL MODULE OF SAP, SUPPORTING KEY CONSTITUENCIES, AND RESOLVING SYSTEM PROBLEMS.OVERSEE DAY TO DAY PRODUCTION SUPPORT FOR API HEALTHCARE TIME AND ATTENDANCE SYSTEM INCLUDING TESTING UPGRADES, SUPPORTING KEY CONSTITUENCIES AND RESOLVING SYSTEM PROBLEMS.OVERSEE INTEGRATIONS WITH ADP FOR W-2’S, QUARTERLY AND YEAR END TAX REPORTING.COLLABORATE CLOSELY WITH THE HR/BENEFITS TEAM LEAD TO ENSURE SUCCESSFUL IMPLEMENTATION OF HR/BENEFITS INITIATIVES THAT IMPACT EMPLOYEE PAY.SERVE AS THE PAYROLL TEAM BUSINESS WAREHOUSE RESOURCE. DUTIES INCLUDE COORDINATION WITH THE BW LEAD RESOURCE FOR REQUIREMENTS ANALYSIS, DATA MODELING, TESTING, SECURITY, INTEGRATION WITH R/3 AND QUERY DEVELOPMENT AND PRESENTATION.",
    "job_skill_set": [
      "Team Leadership",
      "Communication",
      "Problem Solving",
      "Collaboration",
      "Resource Allocation",
      "Planning",
      "Adaptability",
      "Meeting Facilitation",
      "SAP Payroll",
      "API Timekeeping",
      "HR/Payroll Modules Configuration",
      "Project Management",
      "Business Process Analysis",
      "Payroll Tax Reporting",
      "Multistate Taxation",
      "BSI Tax Software",
      "Testing Upgrades",
      "Data Modeling",
      "Integration with ADP",
      "Query Development",
      "R/3 System Configuration",
      "Third Party Timekeeping Systems",
      "Performance Evaluation",
      "Professional Growth Development"
    ],
    "short_keywords": [
      "adaptability",
      "adp",
      "allocation",
      "analysis",
      "api",
      "assistant",
      "bsi",
      "business",
      "collaboration",
      "communication",
      "configuration",
      "data",
      "development",
      "director",
      "evaluation",
      "facilitation",
      "growth",
      "hrpayroll",
      "information",
      "informationtechnology",
      "integration",
      "leadership",
      "management",
      "meeting",
      "modeling",
      "modules",
      "multistate",
      "of",
      "party",
      "payroll",
      "performance",
      "planning",
      "problem",
      "process",
      "professional",
      "project",
      "query",
      "r3",
      "reporting",
      "resource",
      "sap",
      "software",
      "solving",
      "system",
      "systems",
      "tax",
      "taxation",
      "team",
      "technology",
      "testing",
      "third",
      "timekeeping",
      "upgrades",
      "with"
    ]
  },
  {
    "job_id": "3903883762",
    "job_title": "Information Technology Program Manager ",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOB TITLE: PROGRAM MANAGERLOCATION: TALLAHASSEE, FLORIDA (ONSITE)DURATION: 1+ YRRATE: W2 + CHPSTART DATE: MAY, 2024\n\nGENERAL EXPERIENCE EXPECTATIONS:\nTYPICALLY HAS 10 YEARS OF IT WORK EXPERIENCE, INCLUDING FIVE (5) OR MORE YEARS MANAGING PROJECTS AND EXPERIENCE WITH PROJECTS IN MULTIPLE TECHNOLOGIES AND BUSINESS FUNCTIONS. THE DEPARTMENT'S OIT IS SEEKING THE SERVICES OF AN EXPERIENCED PROGRAM MANAGEMENT DIRECTOR.\nTHE DEPARTMENT REQUIRES THE FOLLOWING EXPERIENCE, SKILLS, AND/OR KNOWLEDGE FOR THIS POSITION:\n• A BACHELOR’S OR MASTER’S DEGREE FROM AN ACCREDITED COLLEGE OR UNIVERSITY IN COMPUTER SCIENCE, INFORMATION SYSTEMS, OR OTHER RELATED FIELDS. RELEVANT EXPERIENCE MAY BE SUBSTITUTED FOR EDUCATION ON A YEAR-FOR-YEAR BASIS WHEN APPLICABLE;• A PROJECT MANAGEMENT PROFESSIONAL (PMP®) CERTIFICATION;• EIGHT (8) OR MORE YEARS SETTING UP AND MANAGING A PROJECT MANAGEMENT OFFICE;• FIVE (5) OR MORE YEARS MANAGING SUCCESSFUL, LARGE-SCALE PROJECTS THAT INCLUDE MULTIPLE DIVERSE TEAMS;• FIVE (5) OR MORE YEARS UTILIZING PROJECT SOFTWARE SUCH AS MICROSOFT PROJECT, PRIMAVERA, JIRA, ETC. TO TRACK AND MAINTAIN PROJECTS;• FIVE (5) OR MORE YEARS DEVELOPING AND MAINTAINING DETAILED PROJECT PLANS AND SCHEDULES BASED ON WORK BREAKDOWN STRUCTURES;• FIVE (5) OR MORE YEARS OF EXPERIENCE WITH PMO METHODOLOGIES AND DOCUMENTATION;• FIVE (5) OR MORE YEARS OF EXPERIENCE WITH MEETING FACILITATION AND DOCUMENTATION;• FIVE (5) OR MORE YEARS CREATING AND PRESENTING INTERNAL AND EXTERNAL STATUS REPORTS;• FIVE (5) OR MORE YEARS WITH RISK AND ISSUE MANAGEMENT• CERTIFICATION IN AGILE OR SCRUM-BASED PROJECT MANAGEMENT;• IT INFRASTRUCTURE LIBRARY (ITIL) SERVICE MANAGEMENT FOUNDATIONS CERTIFIED;• EXPERIENCE MANAGING PROJECTS WITH A LARGE, DISTRIBUTED USER BASE;• EXPERIENCE MANAGING WATERFALL PROJECTS;• EXPERIENCE WITH STATE GOVERNMENT PROJECTS;• EXPERIENCE MANAGING AND REPORTING PROJECTS IN COMPLIANCE WITH RULE 60GG-1, F.A.C.;• EXPERIENCE WORKING WITH TECHNICAL PROGRAMMING TEAMS;• ABILITY TO DEMONSTRATE A TAKE-CHARGE, CAN-DO ATTITUDE WITH THE INITIATIVE TO SOLVE COMPLEX PROBLEMS;• STRONG COMMUNICATION SKILLS TO EFFECTIVELY COMMUNICATE WITH DIVERSE STAKEHOLDERS;• SKILLS IN NEGOTIATION, MEDIATION, FACILITATION, AND TEAM BUILDING;• KNOWLEDGE OF IT STANDARDS IN A CRIMINAL JUSTICE ENVIRONMENT;• EXPERIENCE MANAGING VENDORS AND VENDOR PROJECTS;• KNOWLEDGE IN OTHER IT AREAS SUCH AS PROGRAMMING, DATA ANALYTICS, ETC.;• A TEAM PLAYER ATTITUDE WITH A HIGH-ENERGY LEVEL AND DILIGENT WORK ETHIC; AND• ABILITY TO MEET OR EXCEED DEADLINES, THRIVE IN A FAST-PACED ENVIRONMENT, AND TO ORGANIZE AND PRIORITIZE ACTIVITIES.",
    "job_skill_set": [
      "Programming",
      "Communication",
      "Problem Solving",
      "Team Building",
      "Initiative",
      "Team Player",
      "Project Management Professional (PMP) Certification",
      "Agile Certification",
      "ITIL Service Management Foundations Certification",
      "Microsoft Project",
      "Primavera",
      "JIRA",
      "Project Management Office (PMO) Methodologies",
      "Risk and Issue Management",
      "Waterfall Project Management",
      "Data Analytics",
      "Negotiation",
      "Facilitation",
      "Time Management",
      "Adaptability"
    ],
    "short_keywords": [
      "adaptability",
      "agile",
      "analytics",
      "and",
      "building",
      "certification",
      "communication",
      "data",
      "facilitation",
      "foundations",
      "information",
      "informationtechnology",
      "initiative",
      "issue",
      "itil",
      "jira",
      "management",
      "manager",
      "methodologies",
      "microsoft",
      "negotiation",
      "office",
      "player",
      "pmo",
      "pmp",
      "primavera",
      "problem",
      "professional",
      "program",
      "programming",
      "project",
      "risk",
      "service",
      "solving",
      "team",
      "technology",
      "time",
      "waterfall"
    ]
  },
  {
    "job_id": "3895210127",
    "job_title": "Senior Information Technology Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "FORTY-FIVE CONSULTING GROUP IS A BOUTIQUE EXECUTIVE SEARCH FIRM BASED IN HOUSTON, TEXAS. IT WAS FOUNDED ON THE PRINCIPLE OF GETTING BACK TO BASICS IN RECRUITING. OUR GOAL IS TO PRESENT OUR CLIENTS WITH QUALITY TALENT WHILE PROVIDING A POSITIVE EXPERIENCE FOR OUR CANDIDATES.\nPLEASE VISIT WWW.FORTYFIVEGROUP.COM FOR MORE CAREER OPPORTUNITIES.WE ARE ACTIVELY INTERVIEWING CANDIDATES FOR A SENIOR IT MANAGER OPPORTUNITY.\n\nABOUT THE ROLEWE ARE SEEKING AN EXPERIENCED SENIOR IT MANAGER TO JOIN OUR GLOBAL INFORMATION TECHNOLOGY TEAM. THIS IS A FULL-TIME, PERMANENT POSITION. THE IDEAL CANDIDATE WILL HAVE A STRONG FOUNDATION IN ALL ASPECTS OF INFORMATION TECHNOLOGY, PREVIOUS EXPERIENCE LEADING AND MANAGING IT PROJECTS, A STRONG CUSTOMER SERVICE FOCUS, AND A DESIRE TO ADVANCE THE TECHNOLOGY AND SECURITY POSITIONS WITHIN THE ORGANIZATION.\nKEY RESPONSIBILITIES:ACT AS A SITE LEADER, TAKING OWNERSHIP OF AND PROVIDING OVERSIGHT OF END-TO-END IT OPERATIONS FOR THE HOUSTON, TEXAS OFFICE AND REMOTELY FOR OUR OFFICE IN OSLO, NORWAY.ACT AS BOTH A PLAYER AND A COACH, LEADING THE HANDS-ON IMPLEMENTATION OF IT PROJECTS AND PROVIDING COACHING AND MENTORSHIP TO A DISTRIBUTED TEAM.COLLABORATE AND INDEPENDENTLY LEAD INFRASTRUCTURE, APPLICATION, AND BUSINESS SYSTEM PROJECTS, INTEGRATIONS, AND MIGRATIONS.ENSURE THE PROPER FUNCTIONING AND OPERATIONAL RELIABILITY OF NETWORKS, SERVERS, AND OTHER IT INFRASTRUCTURE.MONITOR SYSTEM PERFORMANCE, ENSURING THAT ALL SYSTEMS & NETWORKS ARE RUNNING AT PEAK PERFORMANCE WITH NO ISSUES.PROVIDE TECHNICAL SUPPORT AND ASSISTANCE TO END-USERS VIA MICROSOFT TEAMS, EMAIL, PHONE, OR IN PERSON.ADMINISTER IDENTITY AND ACCESS MANAGEMENT CONTROLS, INCLUDING USER ACCOUNTS AND PERMISSIONS FOR VARIOUS SHARED RESOURCES AND SYSTEMS.INSTALL, TROUBLESHOOT, AND RESOLVE HARDWARE AND SOFTWARE ISSUES ON WINDOWS AND LINUX OS, INCLUDING DESKTOPS, LAPTOPS, PRINTERS, AND PERIPHERALS.INSTALL, CONFIGURE, AND MAINTAIN COMPUTER SYSTEMS AND SOFTWARE APPLICATIONS, POLICIES, AND CONFIGURATIONS TO MAINTAIN A STANDARDIZED AND SECURE COMPUTING ENVIRONMENT.COLLABORATE WITH THE GROUP CYBER SECURITY TEAM TO ESTABLISH AND IMPLEMENT CYBER SECURITY PROCEDURES AND OPERATIONS, INCLUDING ANTIVIRUS SOFTWARE, OPERATING SYSTEM UPDATES, SOFTWARE UPDATES, AND NETWORK EQUIPMENT, TO ENSURE SECURITY AND OPTIMAL PERFORMANCE.ACT AS INCIDENT COMMANDER TO COORDINATE INCIDENT RESPONSE FOR TECHNICAL OPERATIONS AND SECURITY INCIDENTS.ASSIST IN THE IMPLEMENTATION AND CONFIGURATION OF COMPLEX HIGH-PERFORMANCE COMPUTING INFRASTRUCTURE.AUDIT AND REVIEW EXISTING IT INFRASTRUCTURE, IDENTIFY, AND PROVIDE PROPOSALS FOR AREAS OF IMPROVEMENT.DOCUMENT AND MAINTAIN ACCURATE RECORDS OF IT SUPPORT REQUESTS, SOLUTIONS PROVIDED, AND RELEVANT INFORMATION IN THE IT TICKETING AND CHANGE MANAGEMENT SYSTEMS.ASSIST WITH ONBOARDING AND OFFBOARDING TASKS RELATED TO STAFFING ACTIVITIES.PROVIDE EMPLOYEE TRAINING AND SUPPORT FOR SOFTWARE APPLICATIONS AND TOOLS.ASSIST IN THE MANAGEMENT AND MAINTENANCE OF IT INVENTORY, ASSETS, AND SOFTWARE LICENSES, AND ASSIST WITH BUDGET CREATION.INSTALL AND MAINTAIN AUDIO AND VISUAL EQUIPMENT IN SERVER AND CONFERENCE ROOMS.ABILITY TO TRAVEL INTERNATIONALLY OCCASIONALLY.\nKNOWLEDGE, SKILLS, AND EXPERIENCE: BACHELOR'S DEGREE OR DIPLOMA IN COMPUTER SCIENCE, INFORMATION TECHNOLOGY, INFORMATION MANAGEMENT, OR RELATED FIELD.MINIMUM OF 8 - 10 YEARS OF EXPERIENCE IN IT OPERATIONS MANAGEMENTEXPERIENCE IN LEADING IT PROJECTS WHILE REMAINING HANDS-ON.STRONG KNOWLEDGE OF MICROSOFT 365, AZURE AD (ENTRA), SHAREPOINT, TEAMS, AND DOMAIN ADMINISTRATIONEXPERIENCE WITH WINDOWS SERVER, WINDOWS 10/11, ACTIVE DIRECTORY ADMINISTRATION AND POWER SHELLLINUX PROFICIENCY, INCLUDING STRONG SCRIPTING AND NETWORKING EXPERIENCE (RHEL, UBUNTU)STRONG EXPERIENCE IN SUPPORTING CISCO MERAKI NETWORK EQUIPMENT.PROFICIENCY WITH VMWARE ESX, VSPHERE, AND OTHER VIRTUALIZED ENVIRONMENTSEXPERIENCE WITH HPC ENVIRONMENTS AND MPI CONFIGURATION (WINDOWS, LINUX)WORK ON DIAGNOSING AND DEBUGGING HPC HARDWARE AND SOFTWARE ISSUES.MANAGING CLOUD INFRASTRUCTURES SUCH AS AWS AND AZURE IS A PLUS.DEMONSTRATED EXPERIENCE WITH CLUSTER COMPUTE SCHEDULER SOFTWARE (E.G., SLURM, PBS, SPECTRUM LSF)EFFECTIVE TROUBLESHOOTING AND PROBLEM-SOLVING CAPABILITIESABILITY TO WRITE AND SPEAK CLEARLY TO TECHNICAL OR NON-TECHNICAL AUDIENCES.ABLE TO LIFT AND MOVE COMPUTER EQUIPMENT.ABLE TO MANAGE TIME EFFECTIVELY WITH MINIMAL SUPERVISION.WILLING TO OCCASIONALLY WORK OUTSIDE OF NORMAL BUSINESS HOURS.\nWHY?OUR TEAM IS MADE UP OF SOME OF THE MOST TALENTED TECHNOLOGY ARCHITECTS, SUBJECT MATTER EXPERTS, SOFTWARE ENGINEERS, ANALYSTS, AND INNOVATORS IN THE ENERGY INDUSTRY. WE’RE ALL SELF-DRIVEN AND ENJOY AN ENVIRONMENT WHERE EVERYONE’S OPINIONS MATTER EQUALLY.THE TEAMS ENJOY A VIBRANT AND DIVERSE CULTURE. OUR TEAM IS FROM MORE THAN 20 DIFFERENT COUNTRIES, SO WE EMBRACE AND ENCOURAGE OUR DIFFERENCES AND CHARACTERISTICS THAT MAKE EACH EMPLOYEE UNIQUE! WE THRIVE IN A COLLABORATIVE AND SUPPORTIVE ENVIRONMENT WHERE WE ENJOY CREATING GREAT SOLUTIONS, ALL WHILE HAVING FUN AND MAINTAINING A STRONG BALANCE OF PERSONAL TIME.\nBENEFITS: HYBRID WORK MODEL FOR ENHANCED FLEXIBILITY WITH THE OPTION TO WORK FROM HOME OR THE HOUSTON, TEXAS OFFICE.MEDICAL, DENTAL, AND VISION BENEFITS.401K PLAN WITH COMPANY MATCH.GENEROUS VACATION POLICY FOR WORK-LIFE HARMONY.COMPREHENSIVE COMPENSATION PACKAGE DESIGNED TO REWARD EXCELLENCE.\nLOCATIONTHIS ROLE IS BASED IN HOUSTON, TEXAS.",
    "job_skill_set": [
      "IT operations management",
      "project management",
      "Windows Server",
      "Windows 10/11",
      "Active Directory administration",
      "VMware ESX",
      "troubleshooting",
      "problem-solving",
      "technical support",
      "networking",
      "leadership",
      "customer service",
      "communication",
      "teamwork",
      "mentorship",
      "time management",
      "adaptability",
      "collaboration",
      "training",
      "Microsoft 365",
      "Azure AD (Entra)",
      "SharePoint",
      "PowerShell",
      "Linux proficiency",
      "Cisco Meraki",
      "vSphere",
      "HPC environments",
      "AWS",
      "Azure",
      "Cluster compute scheduler software",
      "identity and access management",
      "audio and visual equipment maintenance",
      "international travel readiness"
    ],
    "short_keywords": [
      "1011",
      "365",
      "access",
      "active",
      "ad",
      "adaptability",
      "administration",
      "and",
      "audio",
      "aws",
      "azure",
      "cisco",
      "cluster",
      "collaboration",
      "communication",
      "compute",
      "customer",
      "directory",
      "entra",
      "environments",
      "equipment",
      "esx",
      "hpc",
      "identity",
      "information",
      "informationtechnology",
      "international",
      "it",
      "leadership",
      "linux",
      "maintenance",
      "management",
      "manager",
      "mentorship",
      "meraki",
      "microsoft",
      "networking",
      "operations",
      "powershell",
      "problemsolving",
      "proficiency",
      "project",
      "readiness",
      "scheduler",
      "senior",
      "server",
      "service",
      "sharepoint",
      "software",
      "support",
      "teamwork",
      "technical",
      "technology",
      "time",
      "training",
      "travel",
      "troubleshooting",
      "visual",
      "vmware",
      "vsphere",
      "windows"
    ]
  },
  {
    "job_id": "3904922547",
    "job_title": "Information Technology Technical Services Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "THE JOB: AS THE IT TECHNICAL SERVICES MANAGER, YOU'LL LEAD A DYNAMIC TEAM IN PLANNING AND SUPPORTING OUR ORGANIZATION'S TECHNICAL OPERATIONS. WITH YOUR STRONG COMMUNICATION SKILLS, YOU'LL COLLABORATE WITH STAKEHOLDERS AND SUPERVISE THE IMPLEMENTATION OF SECURITY SOLUTIONS AND INFRASTRUCTURE PROJECTS. YOUR EXPERTISE IN NETWORKING, SECURITY, AND PROJECT MANAGEMENT WILL BE PIVOTAL AS YOU ENSURE THE RELIABILITY AND SECURITY OF OUR NETWORK AND DATA CENTER SYSTEMS. FROM TROUBLESHOOTING COMPLEX ISSUES TO STAYING UPDATED ON THE LATEST TECHNOLOGY TRENDS, YOU'LL PLAY A VITAL ROLE IN MAINTAINING OUR SYSTEMS' INTEGRITY AND PERFORMANCE.\nMINIMUM QUALIFICATIONS:BACHELOR’S DEGREE (MASTER’S PREFERRED), IN THE FIELD OF COMPUTER SCIENCE, INFORMATION SCIENCES OR A RELATED FIELD;-AND-TEN (10) OR MORE YEARS OF EXPERIENCE AS AN IT PROFESSIONAL -AND- FIVE (5) OR MORE YEARS OF EXPERIENCE WITH NETWORK OR SERVER ADMINISTRATION FOR A LARGE ORGANIZATION -AND- FIVE (5) OR MORE YEARS OF EXPERIENCE IN AN IT TECHNICAL ROLE.\nPREFERRED QUALIFICATIONS:ONE OR MORE OF THE FOLLOWING CERTIFICATIONS PREFERRED: CISCO CCNP CERTIFICATION, PALO ALTO NETWORKS FIREWALL CERTIFICATION, COMPTIA SECURITY+, COMPTIA SERVER+, COMPTIA NETWORK+ OR CERTIFIED INFORMATION SYSTEMS SECURITY PROFESSIONAL (CISSP).\nSTATEMENT OF TASKS:SUPERVISE THE IMPLEMENTATION AND MAINTENANCE OF SECURITY SOLUTIONS;ENSURE THAT PROPER SECURITY PRACTICES ARE FOLLOWED INCLUDING PATCHING OF SOFTWARE, UPDATES TO FIRMWARE AND REVIEW OF SYSTEM STATUS ON A DAILY BASIS;COORDINATE AND MANAGE THE DESIGN, DEPLOYMENT AND MAINTENANCE OF NETWORK AND DATA CENTER RELATED HARDWARE/SOFTWARE/APPLIANCES;CREATE AND MAINTAIN DOCUMENTATION AS IT RELATES TO CONFIGURATION, PROCESSES, SERVICE RECORDS AND SECURITY CONFIGURATION;PERFORM ON-SITE ANALYSIS, DIAGNOSIS AND RESOLUTION OF COMPLEX SYSTEM PROBLEMS FOR SYSTEM ISSUE AND RECOMMEND AND IMPLEMENT CORRECTIVE SOLUTIONS;DEVELOPMENT OF BUSINESS CONTINUITY AND DISASTER RECOVERY PLANS, AND MAINTAIN CURRENT KNOWLEDGE OF PLAN EXECUTABLES;RESPOND TO EMERGENCY OUTAGES IN ACCORDANCE WITH BUSINESS CONTINUITY AND DISASTER RECOVERY PLANS;MANAGE EQUIPMENT INCLUDING BUT NOT LIMITED TO: SOFTWARE SWITCHES, ROUTERS, WIRELESS, SERVERS, VOIP/SOFTWARE PHONES AND FIREWALLS;MONITOR THE PERFORMANCE OF NETWORK SYSTEMS AND TROUBLESHOOT AND RESOLVE PROBLEM AREAS AS NEEDED INCLUDING BUT NOT LIMITED TO JUST UPGRADES AND PATCHES;INTERACT AND NEGOTIATE WITH VENDORS AND CONTRACTORS TO SECURE PRODUCTS AND SERVICES;MANAGE AND SUPPORT OF SYSTEMS HARDWARE TO ENSURE PROPER PERFORMANCE AND RELIABILITY;PROVIDE TRAINING AND WRITTEN DOCUMENTATION FOR SUPPORT PERSONNEL (WHICH INCLUDE HELP DESK, COMPUTER TECHNICIANS AND TRAINERS, INTERNAL/EXTERNAL CUSTOMERS AND MANAGEMENT);MANAGE INFRASTRUCTURE PROJECTS SUCH AS STRUCTURED CABLING, NETWORK DESIGN AND VIRTUALIZED ENVIRONMENTS;MANAGE AND/OR PROVIDE GUIDANCE AND/OR DIRECTION OF SUBORDINATES.\nKEEP UP-TO-DATEFOLLOW GENESEE COUNTY HUMAN RESOURCES AND LABOR RELATIONS ON FACEBOOK AND LINKEDIN FOR THE LATEST OPPORTUNITIES TO BECOME PART OF TEAM GENESEE. DISCOVER HOW YOU CAN CONTRIBUTE TO OUR COMMON PURPOSE OF MAKING A POSITIVE IMPACT ON GENESEE COUNTY WHILE ENJOYING THE MANY ADVANTAGES OF A CAREER WITH US.FOR MORE INFORMATION ABOUT OUR BENEFITS PACKAGES AND THE DIVERSE RANGE OF DEPARTMENTS WE SERVE, VISIT WWW.GENESEECOUNTYMI.GOV\nGENESEE COUNTY IS PROUD TO BE A MVAA BRONZE LEVEL CERTIFIED VETERAN FRIENDLY EMPLOYER. JOIN US, AND LET'S BUILD A BRIGHTER FUTURE FOR GENESEE COUNTY.",
    "job_skill_set": [
      "networking",
      "security",
      "project management",
      "troubleshooting",
      "server administration",
      "documentation",
      "business continuity planning",
      "disaster recovery planning",
      "vendor negotiation",
      "infrastructure management",
      "communication",
      "team leadership",
      "collaboration",
      "problem solving",
      "training",
      "negotiation",
      "adaptability",
      "CISCO CCNP",
      "Palo Alto Networks Firewall",
      "CompTIA Security+",
      "CompTIA Server+",
      "CompTIA Network+",
      "CISSP"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "alto",
      "business",
      "ccnp",
      "cisco",
      "cissp",
      "collaboration",
      "communication",
      "comptia",
      "continuity",
      "disaster",
      "documentation",
      "firewall",
      "information",
      "informationtechnology",
      "infrastructure",
      "leadership",
      "management",
      "manager",
      "negotiation",
      "network",
      "networking",
      "networks",
      "palo",
      "planning",
      "problem",
      "project",
      "recovery",
      "security",
      "server",
      "services",
      "solving",
      "team",
      "technical",
      "technology",
      "training",
      "troubleshooting",
      "vendor"
    ]
  },
  {
    "job_id": "3898167038",
    "job_title": "Director of Information Technology",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "HERE AT J.W. SPEAKER, WE LIVE BY THE WORDS “DRIVING TECHNOLOGY, BUILDING BRIGHT FUTURES.” OUR TECHNOLOGY FOCUS HAS BEEN INSTRUMENTAL IN OUR SUCCESS FOR NEARLY 90 YEARS, AND HAS ALLOWED US TO EXPERIENCE SIGNIFICANT GROWTH FOR MORE THAN A DECADE! HOWEVER, WE COULDN’T KEEP OUR EYE ON TECHNOLOGY WITHOUT PEOPLE WHO ARE DRIVEN TO SEE MORE!OUR IDEAL CANDIDATE: THE DIRECTOR OF IT AT J.W. SPEAKER IS CRITICAL TO OUR ORGANIZATION, AS HE/SHE IS ONE OF OUR TECHNOLOGY DRIVERS. YOU WOULD BE SOMEONE WHO CAN CREATE (AND EFFECTIVELY COMMUNICATE) THE VISION FOR IT IN OUR ORGANIZATION, INTEGRATE ALL OUR SYSTEMS, AND DRIVE OUR TECHNOLOGY FORWARD, UTILIZING BEST PRACTICES AND THE APPROPRIATE GOVERNANCE. YOU WOULD ALSO BE A BIG-PICTURE, SYSTEMS THINKER. IDEALLY, YOU WOULD HAVE EXPERIENCE IN THE FOLLOWING:A MANUFACTURING ENVIRONMENT. IF NOT MANUFACTURING, EXPERIENCE WITH A COMPANY WHO UTILIZES AN ERP SYSTEM IS A MUST. IN OUR WILDEST DREAMS, YOU WOULD KNOW SYTELINE - OUR ERP SYSTEM.YOU WILL LOVE TO LEAD, AND WILL HAVE AT LEAST 5+ YEARS OF EXPERIENCE LEADING AN IT TEAM. WE HAVE A GREAT TEAM OF IT PROFESSIONALS FOR YOU COACH, MENTOR, AND DEVELOP. NOT ONLY THEM, BUT YOU ARE LEADING OUR ENTIRE ORGANIZATION WHEN IT COMES TO OUR TECHNOLOGY NEEDS!YOU NEED TO HAVE INTEGRITY, A STRONG BUSINESS ACUMEN, EXCELLENT CUSTOMER SERVICE, PROJECT MANAGEMENT, LISTENING SKILLS (HOW ELSE WILL YOU LEARN WHAT YOUR CUSTOMERS NEED/WANT?), AND A SENSE OF HUMOR TO BALANCE IT ALL OUT.A BACHELOR’S DEGREE IN INFORMATION TECHNOLOGY OR A RELATED FIELDMICROSOFT SQL SERVER EXPERIENCE IS A MUST. (SQL DBA/ADMIN EXPERIENCE)HOW YOU WILL MAKE A DIFFERENCE:YOU WILL INNOVATE:BY IMPLEMENTING THE DEVELOPMENT OF TECHNOLOGY STANDARDS AND GOVERNANCE PROCESSESBY DIRECTING THE EFFECTIVE INTEGRATION OF MULTIPLE NETWORKS, FACILITIES, AND COMMUNICATION CAPABILITIES DEPLOYING SYSTEMS THAT ARE FLEXIBLE, SCALABLE AND APPROPRIATELY SIZEDBY ESTABLISHING, COMMUNICATING, AND EXECUTING IT STRATEGIES IN SUPPORT OF THE JWS STRATEGY AND MAJOR CORPORATE INITIATIVES SERVING AS INTERNAL BUSINESS IT AND PROCESS CONSULTANT. THIS INCLUDES DRIVING EFFICIENCIES THRU AUTOMATION AND INTEGRATION INITIATIVES PROMOTING “SYSTEM THINKING” AND FOLLOWING THE USA APPROACH (UNDERSTAND, SIMPLIFY, THEN AUTOMATE)YOU WILL EXPLORE:BY DEVELOPING CONTROLS TO ENSURE SYSTEM SECURITY, RELIABILITY, REDUNDANCY, AND DATA INTEGRITY AND PRIVACYBY DEFINING AND DEVELOPING ERP MODULE OWNERS (EXPERTS WITHIN OUR CORE BUSINESS SYSTEM) TO INCREASE SYSTEM USAGE AND WASTE ELIMINATION TO MAKE WORK EASIERYOU WILL PERFORM:BY MANAGING RISKS THROUGH THE EFFECTIVE DESIGN, DELIVERY AND MANAGEMENT OF I&T CAPABILITIESBY ESTABLISHING PROCESSES AND CONTROLS TO ACHIEVE CUSTOMER SATISFACTION, EFFICIENCY, RELIABILITY, UTILIZATION, UNDERSTANDING AND UPGRADABILITYBY PROVIDING DIRECTION AND ALIGNMENT OF ZONE - ANALYZING WORKFLOW, ESTABLISHING PRIORITIES WITH DEADLINES, AND REINFORCING ADHERENCE TO STANDARDSBY BUILDING CAPABILITY AND CAPACITY OF IT TALENT THROUGH ACQUISITION, DEVELOPMENT AND PERFORMANCE MANAGEMENTBY SUPPORTING CUSTOMERS WITH MULTI-SITE, MULTI-SHIFT REQUIREMENTSBY MAINTAINING IT ROADMAP AND FACILITATING ANNUAL A3 AND ZONE GOALSBY PROVIDING STRATEGIC DIRECTION AND OVERSIGHT FOR THE DESIGN, DEVELOPMENT AND OPERATION OF IT SYSTEMS AND PROGRAMS THAT FULFILL THE NEEDS OF THE BUSINESS, INCLUDING ENTERPRISE ARCHITECTURE MANAGEMENT, APPLICATION MANAGEMENT, SECURITY, RISK MANAGEMENT, INFRASTRUCTURE, AND OPERATIONS SUPPORT MANAGEMENT\nEQUAL OPPORTUNITY EMPLOYER/PROTECTED VETERANS/INDIVIDUALS WITH DISABILITIES\n\nTHE CONTRACTOR WILL NOT DISCHARGE OR IN ANY OTHER MANNER DISCRIMINATE AGAINST EMPLOYEES OR APPLICANTS BECAUSE THEY HAVE INQUIRED ABOUT, DISCUSSED, OR DISCLOSED THEIR OWN PAY OR THE PAY OF ANOTHER EMPLOYEE OR APPLICANT. HOWEVER, EMPLOYEES WHO HAVE ACCESS TO THE COMPENSATION INFORMATION OF OTHER EMPLOYEES OR APPLICANTS AS A PART OF THEIR ESSENTIAL JOB FUNCTIONS CANNOT DISCLOSE THE PAY OF OTHER EMPLOYEES OR APPLICANTS TO INDIVIDUALS WHO DO NOT OTHERWISE HAVE ACCESS TO COMPENSATION INFORMATION, UNLESS THE DISCLOSURE IS (A) IN RESPONSE TO A FORMAL COMPLAINT OR CHARGE, (B) IN FURTHERANCE OF AN INVESTIGATION, PROCEEDING, HEARING, OR ACTION, INCLUDING AN INVESTIGATION CONDUCTED BY THE EMPLOYER, OR (C) CONSISTENT WITH THE CONTRACTOR’S LEGAL DUTY TO FURNISH INFORMATION. 41 CFR 60-1.35(C)",
    "job_skill_set": [
      "Microsoft SQL Server",
      "Infrastructure Management",
      "Application Management",
      "Communication",
      "Customer Service",
      "Integrity",
      "Problem Solving",
      "ERP Systems",
      "Project Management",
      "Systems Integration",
      "Data Security",
      "Automation",
      "Enterprise Architecture Management",
      "Risk Management",
      "Leadership",
      "Business Acumen",
      "Listening Skills",
      "Team Development",
      "Strategic Thinking",
      "Sense of Humor"
    ],
    "short_keywords": [
      "acumen",
      "application",
      "architecture",
      "automation",
      "business",
      "communication",
      "customer",
      "data",
      "development",
      "director",
      "enterprise",
      "erp",
      "humor",
      "information",
      "informationtechnology",
      "infrastructure",
      "integration",
      "integrity",
      "leadership",
      "listening",
      "management",
      "microsoft",
      "of",
      "problem",
      "project",
      "risk",
      "security",
      "sense",
      "server",
      "service",
      "skills",
      "solving",
      "sql",
      "strategic",
      "systems",
      "team",
      "technology",
      "thinking"
    ]
  },
  {
    "job_id": "3884913839",
    "job_title": "Technical Sales Representative",
    "category": "SALES",
    "job_description": "JOB DESCRIPTION\n\nARE YOU AN EXPERIENCED TECHNICAL SALES PROFESSIONAL IN THE PROCESS INDUSTRY LOOKING TO GROW YOUR CAREER? IF SO, EMERSON HAS AN EXCITING OPPORTUNITY FOR YOU! BASED IN CLEVELAND, OH, YOU WILL BE RESPONSIBLE FOR DRIVING INSTRUMENTATION SALES IN NORTHEAST OHIO. IN THIS POSITION, YOU WILL PARTNER WITH CUSTOMERS TO MAKE THE WORLD HEALTHIER, SAFER, AND SUSTAINABLE. IF YOU ARE LOOKING TO BEGIN YOUR CAREER WITH AN INDUSTRY LEADER, WE WOULD LOVE TO HEAR FROM YOU! THIS IS A REMOTE FIELD-BASED POSITION LOCATED WITHIN THE TERRITORY.\n\nIN THIS ROLE, YOUR RESPONSIBILITIES WILL BE:\n\nDEMONSTRATES UNDERSTANDING OF CUSTOMER PROCESSES AND HAS THE ABILITY TO FIND OPPORTUNITIES FOR PROCESS IMPROVEMENT.SUCCESSFULLY PROVIDE SALES SOLUTIONS INDEPENDENTLY AND COLLABORATIVELY ACROSS TEAMSDEVELOP A TERRITORY PLAN WITH SMART ACTIONS TO TARGET STRATEGIC OPPORTUNITIESUSES TERRITORY MARKET ANALYSIS AND CUSTOMER RELATIONSHIP MANAGEMENT (CRM) TO IDENTIFY BUSINESS OPPORTUNITIES.EFFECTIVELY SETS PRIORITIES AND MANAGES TIME EFFICIENTLYDEVELOP PRODUCT-BASED SOLUTIONS TO ADDRESS CUSTOMERS’ LATENT PAIN.\n\nWHO YOU ARE:\n\nYOU RELATE COMFORTABLY WITH PEOPLE ACROSS LEVELS, FUNCTIONS, CULTURES, AND GEOGRAPHIES; UNDERSTANDING INTERPERSONAL AND GROUP DYNAMICS AND ENGAGING IN AN EFFECTIVE MANNER. YOU ANALYZE MULTIPLE AND DIVERSE SOURCES OF INFORMATION AND READILY DISTINGUISH BETWEEN WHAT’S RELEVANT AND WHAT’S UNIMPORTANT TO EFFICIENTLY DEFINE SOPHISTICATED PROBLEMS ACCURATELY BEFORE MOVING TO SOLUTIONS. YOU MAINTAIN A POSITIVE DEMEANOR AND FORWARD-THINKING APPROACH DESPITE TROUBLING CIRCUMSTANCES OR SETBACKS. YOU NEGOTIATE STRATEGICALLY IN TOUGH SITUATIONS, BY RESPONDING EFFICIENTLY TO THE REACTIONS AND POSITIONS OF OTHERS, TO WIN CONCESSIONS WITHOUT DAMAGING RELATIONSHIPS.\n\nREQUIRED EDUCATION, EXPERIENCE, & SKILLS:\n\nBACHELOR’S DEGREE OR EQUIVALENT EXPERIENCE OR WILL CONSIDER A COMBINATION OF EDUCATION AND EXPERIENCE RELATED TO COMPANY PRODUCT OR INDUSTRYMINIMUM 3 YEARS OF RELATED TECHNICAL SALES EXPERIENCE VALID DRIVER’S LICENSEWILLINGNESS AND ABILITY TO TRAVEL WITHIN TERRITORY AS REQUIRED, INCLUDING MINIMAL OVERNIGHT STAYSLIMITED TRAVEL OUTSIDE OF THE TERRITORY FOR FACTORY TRAINING AND MEETINGSLEGAL AUTHORIZATION TO WORK IN THE UNITED STATES\n\nOUR OFFER TO YOU\n\nWE RECOGNIZE THE IMPORTANCE OF EMPLOYEE WELLBEING AND KNOW THAT TO DO YOUR BEST YOU MUST HAVE FLEXIBLE, COMPETITIVE BENEFITS PLANS TO MEET YOU AND YOUR FAMILY’S PHYSICAL, MENTAL, FINANCIAL, AND SOCIAL NEEDS. WE PROVIDE A VARIETY OF MEDICAL INSURANCE PLANS, WITH DENTAL AND VISION COVERAGE, EMPLOYEE ASSISTANCE PROGRAM, PROFIT-SHARING RETIREMENT, TUITION REIMBURSEMENT, EMPLOYEE RESOURCE GROUPS, RECOGNITION, AND MUCH MORE. OUR CULTURE PRIORITIZES WORK-LIFE BALANCE AND OFFERS FLEXIBLE TIME OFF PLANS, INCLUDING PAID PARENTAL LEAVE (MATERNAL AND PATERNAL), VACATION, AND HOLIDAY LEAVE.\n\nAT EMERSON, WE ARE COMMITTED TO FOSTERING A CULTURE WHERE EVERY EMPLOYEE IS VALUED AND RESPECTED FOR THEIR UNIQUE EXPERIENCES AND PERSPECTIVES. WE BELIEVE A DIVERSE AND INCLUSIVE WORK ENVIRONMENT CONTRIBUTES TO THE RICH EXCHANGE OF IDEAS AND DIVERSITY OF THOUGHTS, THAT INSPIRES INNOVATION AND BRINGS THE BEST SOLUTIONS TO OUR CUSTOMERS.\n\nTHIS PHILOSOPHY IS FUNDAMENTAL TO LIVING OUR COMPANY’S VALUES AND OUR RESPONSIBILITY TO LEAVE THE WORLD IN A BETTER PLACE. LEARN MORE ABOUT OUR CULTURE & VALUES AND ABOUT DIVERSITY, EQUITY & INCLUSION AT EMERSON.\n\nOUR TRAINING PROGRAMS AND INITIATIVES FOCUS ON END-TO-END DEVELOPMENT, FROM ONBOARDING THROUGH SENIOR LEADERSHIP. WE PROVIDE A WIDE RANGE OF DEVELOPMENT OPPORTUNITIES, INCLUDING FACE-TO-FACE AND VIRTUAL TRAINING, MENTORSHIP AND COACHING, PROJECT MANAGEMENT, AND ON-THE-JOB TRAINING.\n\nABOUT US\n\nWHY EMERSON\n\nOUR COMMITMENT TO OUR PEOPLE\n\nAT EMERSON, WE ARE MOTIVATED BY A SPIRIT OF COLLABORATION THAT HELPS OUR DIVERSE, MULTICULTURAL TEAMS ACROSS THE WORLD DRIVE INNOVATION THAT MAKES THE WORLD HEALTHIER, SAFER, SMARTER, AND MORE SUSTAINABLE. AND WE WANT YOU TO JOIN US IN OUR BOLD ASPIRATION.\n\nWE HAVE BUILT AN ENGAGED COMMUNITY OF INQUISITIVE, DEDICATED PEOPLE WHO THRIVE KNOWING THEY ARE WELCOMED, TRUSTED, CELEBRATED, AND EMPOWERED TO SOLVE THE WORLD’S MOST COMPLEX PROBLEMS — FOR OUR CUSTOMERS, OUR COMMUNITIES, AND THE PLANET. YOU’LL CONTRIBUTE TO THIS VITAL WORK WHILE FURTHER DEVELOPING YOUR SKILLS THROUGH OUR AWARD-WINNING EMPLOYEE DEVELOPMENT PROGRAMS. WE ARE A PROUD CORPORATE CITIZEN IN EVERY CITY WHERE WE OPERATE AND ARE COMMITTED TO OUR PEOPLE, OUR COMMUNITIES, AND THE WORLD AT LARGE. WE TAKE THIS RESPONSIBILITY SERIOUSLY AND STRIVE TO MAKE A POSITIVE IMPACT THROUGH EVERY ENDEAVOR.\n\nAT EMERSON, YOU’LL SEE FIRSTHAND THAT OUR PEOPLE ARE AT THE CENTER OF EVERYTHING WE DO. SO, LET’S GO. LET’S THINK DIFFERENTLY. LEARN, COLLABORATE, AND GROW. SEEK OPPORTUNITY. PUSH BOUNDARIES. BE EMPOWERED TO MAKE THINGS BETTER. SPEED UP TO BREAK THROUGH. LET’S GO, TOGETHER.\n\nWORK AUTHORIZATION\n\nEMERSON WILL ONLY EMPLOY THOSE WHO ARE LEGALLY AUTHORIZED TO WORK IN THE UNITED STATES. THIS IS NOT A POSITION FOR WHICH SPONSORSHIP WILL BE PROVIDED. INDIVIDUALS WITH TEMPORARY VISAS SUCH AS E, F-1(INCLUDING THOSE WITH OPT OR CPT) , H-1, H-2, L-1, B, J OR TN, OR WHO NEED SPONSORSHIP FOR WORK AUTHORIZATION NOW OR IN THE FUTURE, ARE NOT ELIGIBLE FOR HIRE.\n\nEQUAL OPPORTUNITY EMPLOYER\n\nEMERSON IS AN EQUAL OPPORTUNITY/AFFIRMATIVE ACTION EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO SEX, RACE, COLOR, RELIGION, NATIONAL ORIGIN, AGE, MARITAL STATUS, POLITICAL AFFILIATION, SEXUAL ORIENTATION, GENDER IDENTITY, GENETIC INFORMATION, DISABILITY OR PROTECTED VETERAN STATUS. WE ARE COMMITTED TO PROVIDING A WORKPLACE FREE OF ANY DISCRIMINATION OR HARASSMENT.\n\nACCESSIBILITY ASSISTANCE OR ACCOMMODATION\n\nIF YOU HAVE A DISABILITY AND ARE HAVING DIFFICULTY ACCESSING OR USING THIS WEBSITE TO APPLY FOR A POSITION, PLEASE CONTACT: IDISABILITY.ADMINISTRATOR@EMERSON.COM .\n\nABOUT EMERSON\n\nEMERSON IS A GLOBAL LEADER IN AUTOMATION TECHNOLOGY AND SOFTWARE. THROUGH OUR DEEP DOMAIN EXPERTISE AND LEGACY OF FLAWLESS EXECUTION, EMERSON HELPS CUSTOMERS IN CRITICAL INDUSTRIES LIKE LIFE SCIENCES, ENERGY, POWER AND RENEWABLES, CHEMICAL AND ADVANCED FACTORY AUTOMATION OPERATE MORE SUSTAINABLY WHILE IMPROVING PRODUCTIVITY, ENERGY SECURITY AND RELIABILITY.\n\nWITH GLOBAL OPERATIONS AND A COMPREHENSIVE PORTFOLIO OF SOFTWARE AND TECHNOLOGY, WE ARE HELPING COMPANIES IMPLEMENT DIGITAL TRANSFORMATION TO MEASURABLY IMPROVE THEIR OPERATIONS, CONSERVE VALUABLE RESOURCES AND ENHANCE THEIR SAFETY.\n\nWE OFFER EQUITABLE OPPORTUNITIES, CELEBRATE DIVERSITY, AND EMBRACE CHALLENGES WITH CONFIDENCE THAT, TOGETHER, WE CAN MAKE AN IMPACT ACROSS A BROAD SPECTRUM OF COUNTRIES AND INDUSTRIES. WHETHER YOU’RE AN ESTABLISHED PROFESSIONAL LOOKING FOR A CAREER CHANGE, AN UNDERGRADUATE STUDENT EXPLORING POSSIBILITIES, OR A RECENT GRADUATE WITH AN ADVANCED DEGREE, YOU’LL FIND YOUR CHANCE TO MAKE A DIFFERENCE WITH EMERSON. JOIN OUR TEAM – LET’S GO!\n\nNO CALLS OR AGENCIES PLEASE.",
    "job_skill_set": [
      "technical sales",
      "process improvement",
      "product-based solutions",
      "driver's license",
      "communication",
      "negotiation",
      "teamwork",
      "problem solving",
      "time management",
      "interpersonal skills",
      "adaptability",
      "CRM",
      "market analysis",
      "territory planning",
      "data analysis",
      "customer relationship management"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "communication",
      "crm",
      "customer",
      "data",
      "drivers",
      "improvement",
      "interpersonal",
      "license",
      "management",
      "market",
      "negotiation",
      "planning",
      "problem",
      "process",
      "productbased",
      "relationship",
      "representative",
      "sales",
      "skills",
      "solutions",
      "solving",
      "teamwork",
      "technical",
      "territory",
      "time"
    ]
  },
  {
    "job_id": "3905304697",
    "job_title": "Route Service Sales Representative (4-Day Workweek) - $24/Hour",
    "category": "SALES",
    "job_description": "REQUISITION NUMBER: 171531\n\nJOB DESCRIPTION\n\nCINTAS IS SEEKING A ROUTE SERVICE SALES REPRESENTATIVE (4-DAY WORKWEEK) - $24/HOUR TO MANAGE AND GROW CUSTOMER ACCOUNTS IN THE RENTAL DIVISION. ROUTE SERVICE SALES REPRESENTATIVES DRIVE A TRUCK ALONG AN ESTABLISHED ROUTE AND SERVICE AND SELL WITHIN AN EXISTING CUSTOMER BASE. IT IS A PHYSICAL, FAST-PACED, INDOOR/OUTDOOR POSITION IN WHICH THE ROUTE SERVICE SALES REPRESENTATIVE DELIVERS AND PICKS UP UNIFORMS, SHOP TOWELS, CHEMICAL CLEANING PRODUCTS AND OTHER RENTAL ITEMS. ROUTE SERVICE SALES REPRESENTATIVES ARE THE FACE OF CINTAS TO OUR CUSTOMERS AND MUST WORK TO BUILD RAPPORT WITH KEY DECISION MAKERS, ENSURE QUALITY STANDARDS AND PRO-ACTIVELY SOLVE CUSTOMER CONCERNS. JOB RESPONSIBILITIES ALSO INCLUDE GROWING OUR EXISTING CUSTOMER BASE BY UPSELLING AND CROSS-SELLING ADDITIONAL PRODUCTS AND SERVICES, NEGOTIATING SERVICE AGREEMENT RENEWALS AND CONTROLLING INVENTORY WHILE WORKING PROFESSIONALLY, SAFELY AND IN COMPLIANCE WITH DRIVING AND VEHICLE REGULATIONS. THE VAST MAJORITY OF ROUTE SERVICE SALES REPRESENTATIVES WORK 4 DAYS PER WEEK AND NO WEEKENDS.\n\nSKILLS/QUALIFICATIONS\n\nREQUIRED\n\nREQUIREMENTS\n\nQUALIFIED CANDIDATES MUST MEET ALL REQUIREMENTS OUTLINED BY THE DEPARTMENT OF TRANSPORTATION (DOT) FOR DRIVING A REGULATED VEHICLE WEIGHING MORE THAN 10,000 LBS. IN ORDER TO COMPLY WITH DOT REQUIREMENTS, QUALIFIED CANDIDATES MUST, PRIOR TO THEIR FIRST DAY OF EMPLOYMENT:\n\nHAVE AN ACTIVE DRIVER'S LICENSEBE AT LEAST 21 YEARS OF AGEOBTAIN A DOT MEDICAL CERTIFICATIONPROVIDE DOCUMENTATION REGARDING THEIR PREVIOUS EMPLOYMENT\n\nALL SUCCESSFUL CANDIDATES WILL ALSO POSSESS\n\nTHE ABILITY TO MEET THE PHYSICAL REQUIREMENTS OF THE POSITIONA HIGH SCHOOL DIPLOMA, GED OR MILITARY SERVICETHE ABILITY TO DEMONSTRATE A STRONG CUSTOMER SERVICE ORIENTATIONSELF-MOTIVATION AND THE DRIVE TO WORK IN AN ENVIRONMENT THAT RELIES ON TEAMWORK TO MEET GOALSA POSITIVE ATTITUDE, ALONG WITH AMBITION, ORGANIZATION AND SERVICE SPIRIT\n\nTHIS IS A REWARDING OPPORTUNITY! TO SUPPORT OUR AGGRESSIVE GROWTH PLANS, WE OFFER UNIQUE OPPORTUNITIES, INCLUDING ADVANCEMENT, ONGOING TRAINING, MENTORING AND THE OPPORTUNITY TO DEVELOP WORLD CLASS BUSINESS SKILLS.\n\nCINTAS OFFERS COMPREHENSIVE AND COMPETITIVE MEDICAL, DENTAL AND VISION BENEFITS, FEATURING EMPLOYEE HEALTH CARE PREMIUMS THAT ARE 30% LOWER THAN THE NATIONAL AVERAGE FOR OUR INDUSTRY. ONE OF OUR MEDICAL PLAN OPTIONS IS EVEN OFFERED AT ZERO COST TO OUR PARTNERS.\n\nADDITIONALLY, OUR EMPLOYEE-PARTNERS ENJOY\n\n COMPETITIVE PAY 401(K)/PROFIT SHARING/EMPLOYEE STOCK OWNERSHIP PROGRAM DISABILITY AND LIFE INSURANCE PACKAGES PAID TIME OFF AND HOLIDAYS CAREER ADVANCEMENT OPPORTUNITIES\n\nHEADQUARTERED IN CINCINNATI, CINTAS IS A PUBLICLY HELD COMPANY TRADED OVER THE NASDAQ GLOBAL SELECT MARKET UNDER THE SYMBOL CTAS AND IS A COMPONENT OF BOTH THE STANDARD & POOR’S 500 INDEX AND NASDAQ-100 INDEX.\n\nCINTAS CORPORATION HELPS MORE THAN 900,000 BUSINESSES OF ALL TYPES AND SIZES GET READY™ TO OPEN THEIR DOORS WITH CONFIDENCE EVERY DAY BY PROVIDING A WIDE RANGE OF PRODUCTS AND SERVICES THAT ENHANCE OUR CUSTOMERS’ IMAGE AND HELP KEEP THEIR FACILITIES AND EMPLOYEES CLEAN, SAFE AND LOOKING THEIR BEST. WITH PRODUCTS AND SERVICES INCLUDING UNIFORMS, MATS, MOPS, RESTROOM SUPPLIES, FIRST AID AND SAFETY PRODUCTS, FIRE EXTINGUISHERS AND TESTING, AND SAFETY AND COMPLIANCE TRAINING, CINTAS HELPS CUSTOMERS GET READY FOR THE WORKDAY®.\n\nTO SUPPORT OUR GROWTH ACROSS NORTH AMERICA, WE’RE SEEKING DRIVEN PROFESSIONALS WITH AMBITION TO MOVE UP WITHIN OUR COMPANY. OUR PROFESSIONAL CULTURE, OUR DEDICATION TO OUR EMPLOYEE-PARTNERS AND LIMITLESS CAREER OPPORTUNITIES—THESE ARE JUST A FEW BENEFITS WE’RE PROUD TO OFFER. OUR EMPLOYEE-PARTNERS KNOW EVERY JOB IS CRITICAL, AND THAT TEAMWORK DRIVES INNOVATION. LET’S TALK ABOUT HOW YOU’LL FIT INTO OUR TEAM AND HOW YOUR HARD WORK WILL BE RECOGNIZED THROUGH COMPETITIVE PAY, WORLD-CLASS BENEFITS AND ONGOING CAREER DEVELOPMENT. ARE YOU READY™ FOR LIMITLESS OPPORTUNITIES AT CINTAS?\n\nCINTAS CORPORATION IS AN EEO/AFFIRMATIVE ACTION EMPLOYER AND WILL MAKE ALL EMPLOYMENT-RELATED DECISIONS WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY OR PROTECTED VETERAN STATUS.\n\nJOB CATEGORY:  SSR\n\nORGANIZATION: RENTAL\n\nEMPLOYEE STATUS: REGULAR\n\nSCHEDULE: FULL TIME\n\nSHIFT: 1ST SHIFT",
    "job_skill_set": [
      "Sales Skills",
      "Customer Service Orientation",
      "Self-Motivation",
      "Teamwork",
      "Positive Attitude",
      "Organization",
      "Problem Solving",
      "Driver's License",
      "DOT Medical Certification",
      "Inventory Control",
      "Negotiation",
      "Physical Fitness"
    ],
    "short_keywords": [
      "24hour",
      "4day",
      "attitude",
      "certification",
      "control",
      "customer",
      "dot",
      "drivers",
      "fitness",
      "inventory",
      "license",
      "medical",
      "negotiation",
      "organization",
      "orientation",
      "physical",
      "positive",
      "problem",
      "representative",
      "route",
      "sales",
      "selfmotivation",
      "service",
      "skills",
      "solving",
      "teamwork",
      "workweek"
    ]
  },
  {
    "job_id": "3901601893",
    "job_title": "Inside Sales",
    "category": "SALES",
    "job_description": "  CAVCO, INC. IS A VETERAN OWNED DISTRIBUTOR OF INDUSTRIAL PIPE, VALVES, AND FITTINGS WITH CUSTOMERS ALL THROUGHOUT THE SOUTHEASTERN UNITED STATES. WE ARE CURRENTLY IN SEARCH FOR AN INSIDE SALES REPRESENTATIVE WHO SHARES IN OUR PASSION TO PROVIDING EXCELLENCE IN CUSTOMER SERVICE.  THE IDEAL CANDIDATE FOR THIS POSITION IS A COMPETITIVE SELF-STARTER THAT THRIVES IN A FAST-PACED ENVIRONMENT. THEY APPROACH WORK WITH CURIOSITY AND A CRITICAL THINKING MINDSET TO IDENTIFY OPPORTUNITIES AND RISKS. THEY ARE COMFORTABLE MAKING DOZENS OF CALLS PER DAY, ARE PROFICIENT AT RESPONDING TO CUSTOMER INQUIRIES PROMPTLY, THEY ARE ADEPT AT GENERATING INTEREST, PROFICIENT AT SOURCING THE APPROPRIATE MATERIAL AT THE MOST ECONOMIC COST, QUALIFYING NEW PROSPECTS, AND CLOSING SALES. \nBENEFITS:HEALTH, DENTAL, AND VISION INSURANCE.401(K) AND 401(K) MATCHING, AFTER QUALIFYING PERIOD.PAID TIME OFF \nRESPONSIBILITIES:SOURCE NEW SALES OPPORTUNITIES THROUGH INBOUND LEAD FOLLOW-UP AND OUTBOUND COLD CALLS AND EMAILS.MAINTAIN AND EXPAND DATABASE OF PROSPECTS WITHIN ASSIGNED TERRITORY.ANSWER CUSTOMERS' QUESTIONS ABOUT OUR PRODUCTS, PRICES, AVAILABILITY, AND PRODUCT USES.ABILITY TO MAKE PRODUCT RECOMMENDATIONS, AND PROVIDING INFORMATION TO SOLVE CUSTOMER PROBLEMS.PROSPECT CALL PREPARATION INCLUDING COMPANY BACKGROUND RESEARCH AND OTHER PERTINENT LEAD INFORMATION.RESPONSIBLE FOR BUILDING, DEVELOPING, AND RETAINING CUSTOMERS NECESSARY TO DRIVE A HIGH-PERFORMANCE SALES TEAM.ESTABLISH AND MANAGE CUSTOMER REQUIREMENTS, INCLUDING QUOTE FOLLOW-UPS AND PRO-EXPEDITE PURCHASE ORDERSIDENTIFY CUSTOMER'S BUYING TRENDS AND PROVIDE REPORTS TO MANAGEMENT.ENTER, UPDATE, AND MAINTAIN INFORMATION ON LEADS, PROSPECTS, AND OPPORTUNITIES.EXAMINE WAYS TO OFFER PRACTICAL, CREATIVE ALTERNATIVES THAT INCREASE CAVCO’S CHANCES OF SUCCESSFULLY CLOSING ORDERS AT HIGHER MARGINS.OCCASIONALLY PROVIDE ASSISTANCE IN DELIVERIES TO CLIENTS.\nQUALIFICATIONS:AT LEAST 1 - 3 YEARS OF SALES EXPERIENCE (PREFERRED BUT NOT REQUIRED)EXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLSABILITY TO MULTI-TASK, ORGANIZE, AND PRIORITIZE WORKSENSE OF URGENCY, HIGH ENERGY WITH HIGH ACCOUNTABILITYBE AVAILABLE AND RESPONSIVE IMMEDIATELY WHEN NEEDEDSTRONG COMPUTER SKILLS UTILIZING MICROSOFT OFFICE 365MUST BE A TEAM PLAYER WITH THE ABILITY TO WORK WITH CROSS-FUNCTIONAL TEAMS TO ACHIEVE COMMON GOAL.\n ONLY CANDIDATES WHOSE PROFILES MATCH REQUIREMENTS WILL BE CONTACTED DURING THIS SEARCH. CAVCO, INC. IS A DRUG FREE WORK ENVIRONMENT, A BACKGROUND AND DRIVER’S LICENSE CHECK WILL BE REQUIRED. ALL RESUMES ARE HELD IN CONFIDENCE. NO TELEPHONE CALLS, RECRUITERS OR AGENCIES.FOR INTERESTED CANDIDATES, PLEASE EMAIL YOUR RESUME TO RESUMES@CAVCOVALVE.COM. ",
    "job_skill_set": [
      "sales experience",
      "customer service",
      "communication",
      "critical thinking",
      "time management",
      "teamwork",
      "Microsoft Office 365",
      "data entry",
      "lead generation",
      "cold calling",
      "product knowledge",
      "reporting",
      "self-starter",
      "curiosity",
      "problem solving",
      "sense of urgency"
    ],
    "short_keywords": [
      "365",
      "calling",
      "cold",
      "communication",
      "critical",
      "curiosity",
      "customer",
      "data",
      "entry",
      "experience",
      "generation",
      "inside",
      "knowledge",
      "lead",
      "management",
      "microsoft",
      "of",
      "office",
      "problem",
      "product",
      "reporting",
      "sales",
      "selfstarter",
      "sense",
      "service",
      "solving",
      "teamwork",
      "thinking",
      "time",
      "urgency"
    ]
  },
  {
    "job_id": "3904368208",
    "job_title": "Sales Associate Sunglass Hut",
    "category": "SALES",
    "job_description": "REQUISITION ID:  843556\n\nSTORE #: 004119 SUNGLASS HUT\n\nPOSITION:CASUAL PART-TIME\n\nTOTAL REWARDS: BENEFITS/INCENTIVE INFORMATION \n\nSUNGLASS HUT IS A GLOBAL LEADER IN THE SALE OF PREMIUM SUNGLASSES WITH OVER 1600 RETAIL STORES ACROSS NORTH AMERICA. BY JOINING OUR TEAM YOU'LL GROW WITH THE BRIGHTEST IN RETAIL!\n\nWE OFFER COMPETITIVE BENEFITS, VALUABLE TRAINING, AND UNLIMITED GROWTH OPPORTUNITIES.\n\nWE BELIEVE IN THE FREEDOM OF SELF-EXPRESSION, INCLUSIVITY AND AUTHENTICITY, WHICH IS WHY WE BRING EXCLUSIVE STYLES OF HIGH-QUALITY FASHION AND PERFORMANCE SUNGLASSES TO ALL.\n\nGENERAL FUNCTION \n\nOUR SALES ASSOCIATES ARE VITAL TO THE SUCCESS OF SUNGLASS HUT. YOU WILL BRING AN AUTHENTIC, FUN AND ENERGIC EXPERIENCE TO ALL CUSTOMERS WHILE HELPING THEM FIND PREMIUM QUALITY EYEWEAR.\n\nMAJOR DUTIES AND RESPONSIBILITIES\n\nCONSISTENTLY DELIVER SALES PLAN AND COMPANY OBJECTIVES THROUGH CULTIVATING NEW AND EXISTING CUSTOMER RELATIONSHIPS BUILDING BRAND LOYALTY.CONFIDENTLY PROVIDES AN EXCEPTIONAL CUSTOMER EXPERIENCE THROUGH MAKING A CONNECTION, ATTENTION TO DETAIL AND OFFERING A PERSONALIZED AND UNIQUE SHOPPING EXPERIENCE RESULTING IN CUSTOMER SATISFACTION.ACTIVELY PARTICIPATES AND CONTRIBUTES TO A POSITIVE STORE ENVIRONMENT, FOSTERING STRONG, PROFESSIONAL RELATIONSHIPS WITH PEERS AND MANAGEMENT.TAKES PRIDE IN THE APPEARANCE OF STORE AND SHOWS INITIATIVE TO KEEP DISPLAYS AND INVENTORY CLEAN, ATTRACTIVE AND ORGANIZED. SECURES ALL COMPANY ASSETS UNDER ONE’S CONTROL.HELPS FOSTER AN INCLUSIVE CULTURE BY TREATING CUSTOMERS AND COLLEAGUES WITH RESPECT.\n\nBASIC QUALIFICATIONS\n\nHIGH SCHOOL DIPLOMA OR GEDEMBRACE NEW TECHNOLOGY AND CHANGE WITH HIGH LEVEL OF ACCURACYSELF-ACCOUNTABILITY FOR SALES RESULTS THROUGH USE OF SELLING SKILLS AND A DRIVE TO MEET GOALS..STRONG COMMUNICATION SKILLS (BOTH ORAL AND WRITTEN)SELF-MOTIVATOR WITH A DEMONSTRATED ABILITY TO MULTI-TASK; ABILITY TO RESPOND FLEXIBLY IN A QUICKLY CHANGING ENVIRONMENT\n\nSUNGLASS HUT IS A PART OF LUXOTTICA, N.A. LUXOTTICA IS A LEADER IN THE DESIGN, MANUFACTURE AND DISTRIBUTION OF FASHION, LUXURY AND SPORTS EYEWEAR.\n\nEMPLOYEE PAY IS DETERMINED BY MULTIPLE FACTORS, INCLUDING GEOGRAPHY, EXPERIENCE, QUALIFICATIONS, SKILLS AND LOCAL MINIMUM WAGE REQUIREMENTS. IN ADDITION, YOU MAY ALSO BE OFFERED A COMPETITIVE BONUS AND/OR COMMISSION PLAN, WHICH COMPLEMENTS A FIRST-CLASS TOTAL REWARDS PACKAGE. BENEFITS MAY INCLUDE HEALTH CARE, RETIREMENT SAVINGS, PAID TIME OFF/VACATION, AND VARIOUS EMPLOYEE DISCOUNTS.\n\nUPON REQUEST AND CONSISTENT WITH APPLICABLE LAWS, ESSILORLUXOTTICA WILL PROVIDE REASONABLE ACCOMMODATIONS TO INDIVIDUALS WITH DISABILITIES WHO NEED ASSISTANCE IN THE APPLICATION AND HIRING PROCESS.  TO REQUEST A REASONABLE ACCOMMODATION, PLEASE CALL THE LUXOTTICA ETHICS COMPLIANCE HOTLINE AT 1-888-887-3348 (BE SURE TO PROVIDE YOUR NAME AND CONTACT INFORMATION SO THAT WE MAY FOLLOW UP IN A TIMELY MANNER) OR EMAIL HRCOMPLIANCE@LUXOTTICARETAIL.COM.\n\n \n\nWE ARE AN EQUAL OPPORTUNITY EMPLOYER.  ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, GENDER, NATIONAL ORIGIN, SOCIAL ORIGIN, SOCIAL CONDITION, BEING PERCEIVED AS A VICTIM OF DOMESTIC VIOLENCE, SEXUAL AGGRESSION OR STALKING, RELIGION, AGE, DISABILITY, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, CITIZENSHIP, ANCESTRY, VETERAN OR MILITARY STATUS, MARITAL STATUS, PREGNANCY (INCLUDING UNLAWFUL DISCRIMINATION ON THE BASIS OF A LEGALLY PROTECTED PREGNANCY OR MATERNITY LEAVE), GENETIC INFORMATION OR ANY OTHER CHARACTERISTICS PROTECTED BY LAW. NATIVE AMERICANS IN THE US RECEIVE PREFERENCE IN ACCORDANCE WITH TRIBAL LAW.",
    "job_skill_set": [
      "sales",
      "customer service",
      "technology proficiency",
      "communication",
      "teamwork",
      "attention to detail",
      "relationship building",
      "inventory management",
      "visual merchandising",
      "self-motivation",
      "adaptability"
    ],
    "short_keywords": [
      "adaptability",
      "associate",
      "attention",
      "building",
      "communication",
      "customer",
      "detail",
      "hut",
      "inventory",
      "management",
      "merchandising",
      "proficiency",
      "relationship",
      "sales",
      "selfmotivation",
      "service",
      "sunglass",
      "teamwork",
      "technology",
      "to",
      "visual"
    ]
  },
  {
    "job_id": "3904578508",
    "job_title": "Route Sales Professional",
    "category": "SALES",
    "job_description": "REQ39180\n\nEMPLOYMENT TYPE: REGULAR\n\nLOCATION: CEDAR RAPIDS,IA\n\nHAVE YOU EVER ENJOYED ARNOLD®, BROWNBERRY® OR OROWEAT® BREAD? A THOMAS’® ENGLISH MUFFIN OR BAGEL? OR PERHAPS SNACKED ON A SARA LEE®, ENTENMANN’S® OR MARINELA® CAKE OR DONUT? IF THE ANSWER IS YES, THEN YOU KNOW BIMBO BAKERIES USA!\n\nMORE THAN 20,000 ASSOCIATES IN BAKERIES, SALES CENTERS, OFFICES AND ON SALES ROUTES WORK TO ENSURE OUR CONSUMERS HAVE THE FRESHEST PRODUCTS AT EVERY MEAL. IN ADDITION TO COMPETITIVE PAY AND BENEFITS, WE PROVIDE A SAFE AND INCLUSIVE WORK ENVIRONMENT THAT APPRECIATES DIVERSITY, PROMOTES DEVELOPMENT AND ALLOWS OUR ASSOCIATES TO BE THEIR AUTHENTIC SELVES.\n\nDESCRIPTION\n\nROUTE SALES PROFESSIONAL\n\nCOME JOIN THE LARGEST BAKING COMPANY IN THE WORLD AND OUR FAMILY OF 20,000 ASSOCIATES NATIONWIDE!\n\nTOP REASONS TO WORK AT BIMBO BAKERIES USA\n\n$310 BASE PLUS COMMISSION, AVERAGE ANNUAL SALARY $ 68,000 - $72,000 FULL BENEFITS OFFERED: MEDICAL, DENTAL, VISION, RETIREMENT PLAN \n\nWHAT YOU WILL BE DOING\n\nMERCHANDISING, STOCKING, AND PROPER ONGOING ROTATION OF PRODUCT ON STORE SHELVES AND DISPLAYS, ENSURING BEST QUALITY AND FRESHNESS OF PRODUCTS. DRIVE SALES THROUGH THE ACQUISITION OF NEW DISPLAY SPACE, INCREMENTAL DISPLAYS AND THROUGH USING SALES DATA TO ESTABLISH OTHER STORE-LEVEL PLANS. FOLLOW UP ON NEW ACCOUNT OPPORTUNITIES AND BUILD EFFECTIVE CUSTOMER RELATIONSHIPS WHILE ENSURING PROMOTIONS ARE EXECUTED. INTRODUCE NEW PRODUCTS AND SERVICES TO MAXIMIZE SALES AND SHELF SPACE WITHIN EXISTING ACCOUNTS AND WHEN SOLICITING NEW CUSTOMERS. CONDUCT DAILY ROUTE SETTLEMENT PROCEDURES TO ACCOUNT FOR ALL PRODUCTS, INVOICES, AND CASH WHILE MAINTAINING PROPER INVENTORY COUNTS. DRIVE COMPANY ROUTE TRUCK SAFELY. COMPLETE DOT (US DEPARTMENT OF TRANSPORTATION) DAILY LOG AND SUBMIT OTHER DOCUMENTATION, PAPERWORK, AND DEPOSITS ON TIME. \n\nPOSITION REQUIREMENTS\n\nPOSITION REQUIREMENTS:\n\nMUST BE AT LEAST 21 YEARS OF AGE OR OLDER. MUST HAVE A VALID DRIVER’S LICENSE WITH A SAFE DRIVING RECORD. MUST BE ABLE TO ACQUIRE AND MAINTAIN A DOT MEDICAL CARD. MUST BE ABLE TO CLIMB, PUSH/PULL, BEND, STOOP, AND KNEEL FOR EXTENDED PERIODS AS WELL AS PERFORM FREQUENT REACHING AND USE OF FINGERS. 1-3 YEARS OF RELATED EXPERIENCE IN DSD (DIRECT SALES DISTRIBUTION) IS PREFERRED. EQUAL OPPORTUNITY EMPLOYER/DISABLE/VETERANS [OR VETS]. \n\nTHE PHYSICAL AND MENTAL DEMANDS DESCRIBED IN EACH JOB POSTING ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY AN ASSOCIATE TO SUCCESSFULLY PERFORM THE ESSENTIAL FUNCTIONS OF EACH JOB. REASONABLE ACCOMMODATIONS MAY BE REQUESTED TO ENABLE QUALIFIED INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS OF EACH JOB.\n\nBIMBO BAKERIES USA IS AN EQUAL OPPORTUNITY EMPLOYER WITH A POLICY THAT PROVIDES EQUAL EMPLOYMENT OPPORTUNITY FOR APPLICANTS AND EMPLOYEES REGARDLESS OF RACE, COLOR, RELIGION, SEX (INCLUDING PREGNANCY, SEXUAL ORIENTATION, OR GENDER IDENTITY), NATIONAL ORIGIN, AGE, DISABILITY, GENETIC INFORMATION, MARITAL STATUS, VETERAN STATUS, ANY OTHER CLASSIFICATION PROTECTED BY LAW.",
    "job_skill_set": [
      "stocking",
      "sales data analysis",
      "customer relationship management",
      "inventory management",
      "physical stamina",
      "communication",
      "teamwork",
      "problem solving",
      "adaptability",
      "customer service",
      "time management",
      "merchandising",
      "valid driver's license",
      "DOT medical card",
      "route settlement procedures",
      "safety driving"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "card",
      "communication",
      "customer",
      "data",
      "dot",
      "drivers",
      "driving",
      "inventory",
      "license",
      "management",
      "medical",
      "merchandising",
      "physical",
      "problem",
      "procedures",
      "professional",
      "relationship",
      "route",
      "safety",
      "sales",
      "service",
      "settlement",
      "solving",
      "stamina",
      "stocking",
      "teamwork",
      "time",
      "valid"
    ]
  },
  {
    "job_id": "3898164225",
    "job_title": "Aftermarket Sales Rep",
    "category": "SALES",
    "job_description": "COMPANY: HAF EQUIPMENT\nABOUT HAF EQUIPMENT: HAF EQUIPMENT IS A DISTINGUISHED USA-BASED COMPANY THAT DESIGNS AND MANUFACTURES MATERIAL HANDLING EQUIPMENT AND SYSTEMS, WITH A STRONG FOCUS ON PARTNER SUCCESS AND EXCELLENCE ACROSS VARIOUS VERTICALS AND APPLICATIONS. FROM SERVING THE DIVERSE NEEDS OF THE FOOD INDUSTRY TO PHARMACEUTICALS, PLASTICS, AND MORE, WE ARE COMMITTED TO DELIVERING INNOVATIVE SOLUTIONS THAT EMPOWER OUR CLIENTS TO THRIVE IN THEIR RESPECTIVE INDUSTRIES.\nJOB RESPONSIBILITIES: AS AN AFTERMARKET SALES REPRESENTATIVE (ASR) AT HAF EQUIPMENT, YOU WILL PLAY A PIVOTAL ROLE IN DRIVING OUR BUSINESS TO NEW HEIGHTS. YOUR KEY RESPONSIBILITIES INCLUDE:\nTERRITORY MANAGEMENT: THOROUGHLY MAP OUT AND SEGMENT YOUR ASSIGNED TERRITORY ON A COUNTY-BY-COUNTY BASIS.\nCUSTOMER VISITS: TARGET A MINIMUM OF 45 VISITS PER WEEK TO POTENTIAL CUSTOMERS WITHIN YOUR DESIGNATED COUNTIES.\nSALES ACTIVITIES: ENGAGE IN BUSINESS-TO-BUSINESS SALES, PROMOTING HAF SERVICES, AUDITS, SPARE PARTS, AND H-SERIES EQUIPMENT.\nACCOUNT DEVELOPMENT: CULTIVATE EXISTING ACCOUNTS WHILE ACTIVELY SEEKING NEW BUSINESS OPPORTUNITIES.\nRELATIONSHIP BUILDING: ESTABLISH STRONG BUSINESS RELATIONSHIPS THROUGH COLD CALLS, PRESENTATIONS, AND DILIGENTLY FOLLOWING UP ON LEADS.\nSALES STRATEGIES: DEVELOP EFFECTIVE SALES STRATEGIES, PROPOSALS, AND FORECASTS TO ACHIEVE YOUR SALES TARGETS.\nPRODUCT DEMONSTRATIONS: CONDUCT PRODUCT DEMONSTRATIONS AND SALES PRESENTATIONS TO SHOWCASE THE VALUE OF OUR SOLUTIONS.\nQUOTATION PREPARATION: PREPARE ACCURATE AND COMPELLING QUOTATIONS FOR CUSTOMERS.\nCUSTOMER CONNECTIVITY: MAINTAIN CONTINUOUS COMMUNICATION WITH CUSTOMERS TO UNDERSTAND THEIR NEEDS AND OFFER TAILORED SOLUTIONS.\nTERRITORY MANAGEMENT PLAN: CREATE AND IMPLEMENT A TERRITORY MANAGEMENT PLAN TO OPTIMIZE CUSTOMER ENGAGEMENT AND ENHANCE CUSTOMER RETENTION THROUGH SATISFACTION MONITORING.\nSALESFORCE UTILIZATION: MAINTAIN PRECISE RECORDS OF SALES CALLS, CUSTOMER INFORMATION, AND SALES ACTIVITY USING SALESFORCE.\nREPORTING: DISCUSS SALES ACTIVITIES AND PROGRESS WITH THE MANAGEMENT TEAM.\nQUALIFICATIONS: TO EXCEL IN THIS ROLE, YOU SHOULD POSSESS:A HIGH SCHOOL DIPLOMA OR EQUIVALENCY. A BACHELOR'S DEGREE IN ENGINEERING, BUSINESS MANAGEMENT, MARKETING, ENTREPRENEURSHIP, PROFESSIONAL SELLING, OR A RELATED FIELD IS A PLUS.STRONG COMMUNICATION, INTERPERSONAL, ORGANIZATIONAL, AND COMPUTER SKILLS.A VALID DRIVER'S LICENSE AND A GOOD DRIVING RECORD.\nTYPICAL WEEKLY SCHEDULE: YOUR TYPICAL WORKWEEK AS AN ASR AT HAF EQUIPMENT WILL BE STRUCTURED AS FOLLOWS:MONDAY: IN-OFFICE DAY FOR PLANNING VISITS AND MAPPING OUT CUSTOMER VISITS.TUESDAY: TRAVEL TO A SPECIFIC COUNTY, MEET WITH AS MANY CUSTOMERS AS POSSIBLE, AND DILIGENTLY DOCUMENT EACH VISIT IN SALESFORCE.WEDNESDAY: CONTINUE VISITING CUSTOMERS IN ANOTHER DESIGNATED COUNTY, MAINTAINING METICULOUS RECORDS IN SALESFORCE.THURSDAY: FOLLOW THE SAME PATTERN IN YET ANOTHER COUNTY, MAXIMIZING CUSTOMER ENGAGEMENT AND RECORD-KEEPING.FRIDAY: IN-OFFICE DAY FOR WRAPPING UP DETAILS FROM THE WEEK'S VISITS AND INITIATING PLANS FOR THE FOLLOWING WEEK'S ACTIVITIES.\nJOIN OUR DYNAMIC TEAM AT HAF EQUIPMENT AND BECOME AN ESSENTIAL PART OF OUR CONTINUED SUCCESS IN PROVIDING CUTTING-EDGE ENGINEERING SOLUTIONS TO OUR VALUED CUSTOMERS.\nHAF EQUIPMENT IS AN EQUAL OPPORTUNITY EMPLOYER, AND WE ENCOURAGE CANDIDATES FROM ALL BACKGROUNDS TO APPLY.",
    "job_skill_set": [
      "Communication",
      "Interpersonal Skills",
      "Organizational Skills",
      "Problem Solving",
      "Time Management",
      "Customer Engagement",
      "Follow-up Skills",
      "Salesforce",
      "Sales Strategies",
      "Product Demonstrations",
      "Quotations Preparation",
      "Territory Management",
      "Business-to-Business Sales",
      "Customer Relationship Management",
      "Computer Skills"
    ],
    "short_keywords": [
      "aftermarket",
      "businesstobusiness",
      "communication",
      "computer",
      "customer",
      "demonstrations",
      "engagement",
      "followup",
      "interpersonal",
      "management",
      "organizational",
      "preparation",
      "problem",
      "product",
      "quotations",
      "relationship",
      "rep",
      "sales",
      "salesforce",
      "skills",
      "solving",
      "strategies",
      "territory",
      "time"
    ]
  },
  {
    "job_id": "3906077073",
    "job_title": "Counter Sales",
    "category": "SALES",
    "job_description": "JOB DESCRIPTIONCOUNTER SALESUNITED REFRIGERATION, INC.\nNATIONAL HVACR WHOLESALE DISTRIBUTOR IS LOOKING FOR A FULL-TIME COUNTER SALESPERSON TO HELP SUPPORT OUR CONTINUED GROWTH AND EXPANSION. WE OFFER COMPETITIVE SALARIES, FULL BENEFITS, MATCHING 401(K), PROFIT SHARING, AND CONTINUING EDUCATION REIMBURSEMENT.\n\nESSENTIAL JOB FUNCTIONSBASIC KNOWLEDGE OF HEATING, AIR CONDITIONING, AND REFRIGERATION - PREFERREDGREET CUSTOMERS AND ANSWER PHONES PROMPTLY AND COURTEOUSLYPROVIDE PROFESSIONAL AND KNOWLEDGEABLE ASSISTANCE TO CUSTOMERS THROUGH IDENTIFYING AND FULFILLING THEIR PRODUCT REQUESTS AND ANSWERING TECHNICAL QUESTIONSPROVIDE ACCURATE AND TIMELY EXECUTION OF CUSTOMER’S ORDERS, REQUESTS, AND OTHER SERVICESUSE COMPUTER SYSTEM TO RESEARCH PRODUCTS, CONDUCT INVOICING, CREDITS, RETURNS, RECLAIM, AND PRODUCT PROCUREMENT/REPLENISHMENT.LOAD AND UNLOAD COMPANY, CUSTOMER AND OUTSIDE CARRIER VEHICLES USING PROPER EQUIPMENTBREAK DOWN AND PUT AWAY STOCKREGULAR AND PUNCTUAL ATTENDANCEOVERTIME AND WEEKEND WORK MAY BE REQUIREDBE WILLING TO WORK, LEARN, AND HAVE FUN\n",
    "job_skill_set": [
      "Customer service",
      "Computer skills",
      "Communication",
      "Teamwork",
      "Problem solving",
      "Adaptability",
      "Time management",
      "Attention to detail",
      "HVAC knowledge",
      "Invoicing",
      "Product procurement",
      "Stock management"
    ],
    "short_keywords": [
      "adaptability",
      "attention",
      "communication",
      "computer",
      "counter",
      "customer",
      "detail",
      "hvac",
      "invoicing",
      "knowledge",
      "management",
      "problem",
      "procurement",
      "product",
      "sales",
      "service",
      "skills",
      "solving",
      "stock",
      "teamwork",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3901672668",
    "job_title": "Sales Development Representative - US",
    "category": "SALES",
    "job_description": "WRIKE IS THE MOST POWERFUL WORK MANAGEMENT PLATFORM. BUILT FOR TEAMS AND ORGANIZATIONS LOOKING TO COLLABORATE, CREATE, AND EXCEED EVERY DAY, WRIKE BRINGS EVERYONE AND ALL WORK INTO A SINGLE PLACE TO REMOVE COMPLEXITY, INCREASE PRODUCTIVITY, AND FREE PEOPLE UP TO FOCUS ON THEIR MOST PURPOSEFUL WORK.\n\nOUR VISION: A WORLD WHERE EVERYONE IS FREE TO FOCUS ON THEIR MOST PURPOSEFUL WORK, TOGETHER.\n\nREADY TO BECOME A WRIKER?\n\nOUR MISSION IS TO HELP PEOPLE DO THE BEST WORK OF THEIR LIVES. AS THE WRIKE SALES DEVELOPMENT REP, YOU WOULD BE THE FIRST POINT OF CONTACT FOR OUR POTENTIAL CUSTOMERS. YOU WILL ESTABLISH THE RELATIONSHIP AND IDENTIFY THEIR NEEDS TO DETERMINE THE OPPORTUNITIES THAT MEET THE QUALIFICATION CRITERIA FOR A SALE.\n\nMORE ABOUT YOUR TEAM\n\nTHE SKY'S THE LIMIT FOR PROFESSIONAL GROWTH AND IT DEPENDS ON BUILDING THE TEAM WITH ONLY THE BEST CANDIDATES FROM TOP TO BOTTOM. YOU WILL FIT PERFECTLY INTO OUR AMS SDR TEAM WORKING ALONG WITH A TEAM OF HIGHLY MOTIVATED COLLEAGUES. WE CONSIDER OUR SDRS TO BE OUR ACCOUNT EXECS IN WAITING. WE LOVE TO HIRE OUR SALES TEAM FROM WITHIN! IF YOU THINK YOU'VE GOT WHAT IT TAKES FOR FAST-PACED GROWTH, FLEXIBILITY TO ADAPT TO CHANGES, AND THE SMARTS TO BE THE BEST, THEN WE WANT YOU.\n\nHOW YOU’LL MAKE AN IMPACT\n\n\n BY SUPPORTING MARKETING EFFORTS BY FOLLOWING UP ON INBOUND LEADS AND INQUIRIES.  BY UNDERSTANDING OUR BUYER PERSONAS AND THE NEEDS/“PAINS” OF YOUR MARKET.  BY CONDUCTING RESEARCH ON THE PROSPECT AND THEIR ORGANIZATION AND LEVERAGING THOUGHTFUL PERSONALIZATION IN YOUR OUTREACH ACROSS EMAIL, PHONE, AND LINKEDIN.  BY PERSUADING PROSPECTS TO HAVE A CALL OR TAKE A MEETING WITH A WRIKE ACCOUNT EXECUTIVE.  BY QUALIFYING PROSPECTS TO HELP IMPROVE CONVERSION RATES FROM DISCOVERY CALL TO OPPORTUNITY.  BY ROUTING QUALIFIED OPPORTUNITIES TO THE APPROPRIATE ACCOUNT EXECUTIVES FOR FURTHER DEVELOPMENT AND CLOSURE.  BY USING TOOLS SUCH AS LINKEDIN SALES NAVIGATOR, GROOVE, AND SALESFORCE.  BY WORKING CLOSELY WITH OTHER SDRS, SENIOR SALES EXECUTIVES, AND MARKETING TO IMPROVE AND PERFECT OUR MESSAGING. \n\n\nYOU WILL ACHIEVE YOUR BEST IF YOU HAVE\n\n\n EAGERNESS TO LEARN AND EXCEL IN SALES. \n\n\nYOU WILL STAND OUT WITH\n\n\n BACHELOR’S DEGREE FROM AN ACCREDITED UNIVERSITY  1+ YEARS’ EXPERIENCE IN SALES DEVELOPMENT OR A SIMILAR ROLE IN A B2B BUSINESS  POSITIVE AND ENERGETIC PHONE SKILLS, EXCELLENT LISTENING SKILLS, STRONG WRITING SKILLS  ABILITY TO MULTITASK, PRIORITIZE, AND MANAGE TIME EFFECTIVELY.  DEMONSTRATED SUCCESS IN REACHING MONTHLY AND QUARTERLY TARGETS  EXPERIENCE WITH CRM AND OPPORTUNITY MANAGEMENT SYSTEMS, PREFERABLY SALESFORCE  STRONG WORK ETHIC AND A ‘CAN DO’ ATTITUDE \n\n\nPERKS OF WORKING AT WRIKE\n\n\n WHEN YOU JOIN OUR TEAM, YOU JOIN OVER 1,000 WRIKERS ALL ON A JOURNEY TO DO THE BEST WORK OF THEIR LIVES. THE 20,000+ BUSINESSES WORLDWIDE WHO CHOSE US AS THEIR COLLABORATIVE WORK MANAGEMENT PLATFORM KNOW WE LEAD BY EXAMPLE.  MEDICAL, DENTAL, AND EMPLOYER-PAID VISION INSURANCE  LIFE INSURANCE, EMPLOYER- PAID ST AND LT DISABILITY  401K, FSA/HSA BENEFITS, AND LEGAL PLAN  EMPLOYEE ASSISTANCE PROGRAM (EAP)  12 PAID HOLIDAYS, 20 DAYS OF PTO  16 HOURS OF VOLUNTEER PAID TIME OFF  PARENTAL LEAVE: 18 WEEKS FOR BIRTH MOTHERS, 4 WEEKS FOR NON-BIRTH PARENTS  GET CONNECTED WITH ONE OF OUR MANY WERC GROUPS! (WRIKE EMPLOYEE RESOURCE COMMUNITY) \n\n\nWHAT’S NEXT?\n\n\n INTERVIEW WITH THE RECRUITER  INTERVIEW WITH THE HIRING MANAGER + MOCK CALL  INTERVIEW WITH ANOTHER TEAM MANAGER \n\n\nYOUR RECRUITMENT BUDDY WILL BE JUAN MOLINO , SENIOR TA REPRESENTATIVE.\n\nTHE RANGE ABOVE REFLECTS THE PAY SCALE THAT WRIKE REASONABLY EXPECTS TO PAY FOR THE ROLE. THE PAY SCALE WILL ALSO DEPEND ON VARIOUS FACTORS, SUCH AS JOB DUTIES AND REQUIREMENTS, AND RELEVANT EXPERIENCE AND SKILLS. PAY SCALES ARE REVIEWED EACH YEAR.\n\nREMOTE - USA PAY RANGE\n\n$45,000 — $60,000 USD\n\nWHO IS WRIKE AND OUR CULTURE\n\nWE’RE A TEAM OF INNOVATORS AND CREATORS WHO SOLVE THE COMPLEX WORK PROBLEMS OF TODAY AND TOMORROW.\n\nHYBRID WORK MODE\n\nWRIKE PROMOTES A HYBRID WORK MODE FOR THOSE THAT LIVE NEAR AN OFFICE HUB, WE MEET IN THE OFFICE 2-3 TIMES A WEEK. THIS WORK MODE SUPPORTS OUR CULTURE OF COLLABORATION AND SOLVING PROBLEMS FAST TO DELIVER BUSINESS OUTCOMES AND WIN TOGETHER.\n\nOUR PERSONA \n\n💡 SMART: WE LOVE WHAT WE DO, AND WE’RE GREAT AT IT BECAUSE THIS IS OUR DOMAIN. OUR COMBINED KNOWLEDGE IN THIS SPACE IS UNMATCHED.\n\n💚 DEDICATED: WE GET UP EVERY DAY FOCUSED ON HELPING OUR CUSTOMERS WIN. WE’RE COMMITTED TO HELPING OUR TEAMMATES WIN, TOO!\n\n🤗 APPROACHABLE: WE'RE FRIENDLY, EASY TO GET ALONG WITH, CONSIDERATE, AND HELPFUL.\n\nOUR CULTURE AND VALUES \n\n📈 DELIVER BUSINESS OUTCOMES\n\n🥇 BE BETTER THAN THE COMPETITION\n\n🚀 MOVE FAST. THEN, MOVE FASTER\n\n🤝 KNOW OUR CUSTOMERS\n\n🏆 WE WIN TOGETHER\n\n💪 HAVE COURAGE\n\nCHECK OUT OUR LINKEDIN LIFE PAGE , INSTAGRAM , WRIKE ENGINEERING TEAM , MEDIUM , MEETUP.COM , YOUTUBE FOR A FEEL FOR WHAT LIFE IS LIKE AT WRIKE.\n\n",
    "job_skill_set": [
      "CRM Systems",
      "Communication",
      "Time Management",
      "Teamwork",
      "Problem Solving",
      "Work Ethic",
      "Eagerness to Learn",
      "Sales Development",
      "Salesforce",
      "LinkedIn Sales Navigator",
      "Email Outreach",
      "Research Skills",
      "Opportunity Management",
      "Listening Skills",
      "Adaptability"
    ],
    "short_keywords": [
      "adaptability",
      "communication",
      "crm",
      "development",
      "eagerness",
      "email",
      "ethic",
      "learn",
      "linkedin",
      "listening",
      "management",
      "navigator",
      "opportunity",
      "outreach",
      "problem",
      "representative",
      "research",
      "sales",
      "salesforce",
      "skills",
      "solving",
      "systems",
      "teamwork",
      "time",
      "to",
      "us",
      "work"
    ]
  },
  {
    "job_id": "3905692248",
    "job_title": "Sales Representative",
    "category": "SALES",
    "job_description": "COMPANY OVERVIEW\n\nSLEEP NUMBER TEAM MEMBERS ARE PART OF A PASSIONATE, PURPOSE-DRIVEN CULTURE THAT SUPPORTS IMPROVING THE HEALTH AND WELLBEING OF SOCIETY THROUGH HIGHER QUALITY SLEEP. WE ARE NOT JUST FOCUSED ON OUR CUSTOMERS, HOWEVER; BEING EMPLOYED BY SLEEP NUMBER MEANS YOUR PERSONAL WELLBEING IS IMPORTANT, TOO. AS WE CONTINUE TO GROW, WE ARE LOOKING FOR TEAM MEMBERS WHO WILL BRING THEIR UNIQUE PERSONALITIES, BACKGROUNDS, AND SKILLS TO WORK. WHETHER YOU ARE ENTERING, RETURNING, OR EXPERIENCED IN THE WORKFORCE, WE HAVE A PLACE FOR YOU.\n\nIN OUR 35+ YEARS IN THE INDUSTRY WE HAVE IMPROVED OVER 14 MILLION LIVES, AND WE ARE JUST GETTING STARTED. WITH 5,000+ TEAM MEMBERS NATIONWIDE SUPPORTING WORK DISCIPLINES FROM TECHNOLOGY TO MANUFACTURING, RETAIL STORES TO FIELD SERVICES TECHNICIANS, CORPORATE TEAMS TO CUSTOMER SERVICE, WE ARE A SLEEP INNOVATION LEADER BECAUSE OF OUR TEAM MEMBERS. NOW IS A GREAT TIME TO JOIN US AS WE INVEST FURTHER IN OUR PEOPLE AND SLEEP INNOVATION. #TEAMSLEEPNUMBER\n\nOVERVIEW\n\nTHIS IS AN EXCITING OPPORTUNITY TO GROW YOUR RETAIL SALES CAREER AND EXPERIENCE UNLIMITED EARNING POTENTIAL IN AN INNOVATIVE, TEAM-ORIENTED ENVIRONMENT. OUR PROPRIETARY PRODUCTS, EXCLUSIVE DISTRIBUTION, BEST-IN-CLASS SALES TRAINING AND RELATIONSHIP-BASED SALES PROCESS ENABLE YOU TO BUILD LIFELONG RELATIONSHIPS AND A REWARDING, LONG-TERM CAREER. OUR RETAIL SALES PROFESSIONALS CONVEY A PASSION FOR OUR PRODUCTS AND THEIR CUSTOMERS, HAVE AN ENTREPRENEURIAL SPIRIT, AND REPRESENT THE SLEEP NUMBER BRAND WITH THE HIGHEST INTEGRITY.\n\nRESPONSIBILITIES\n\nPROVIDE A WORLD-CLASS CUSTOMER EXPERIENCE. UTILIZE A PROVEN SALES PROCESS TO DISCOVER EACH CUSTOMER’S UNIQUE SLEEP NEEDS AND LEAD THEM THROUGH A SELECTION OF SLEEP NUMBER PRODUCTS THAT WILL DELIVER “THE BEST SLEEP OF THEIR LIFE.” BUILD RELATIONSHIPS WITH CUSTOMERS. PROACTIVELY AND EFFECTIVELY COMMUNICATE PRODUCT FEATURES AND BENEFITS, AS WELL AS PROMOTIONAL INFORMATION. PROVIDE TIMELY, RELEVANT FOLLOW-UP.DEMONSTRATE A TENACIOUS DRIVE FOR RESULTS. BE ACCOUNTABLE FOR BECOMING A TRUSTED, SUCCESSFUL “SLEEP EXPERT” AND CONSISTENTLY EXCEEDING SALES GOALS. \n\nQUALIFICATIONS/REQUIREMENTS\n\nEXCEPTIONAL PRESENTATION AND INTERPERSONAL SKILLS; ABILITY TO MAKE A CONNECTION WITH A DIVERSE ARRAY OF CUSTOMERS.PRIOR EXPERIENCE IN A CUSTOMER-FACING ROLE, PREFERABLY HIGH-END SALES.A COMMITMENT TO PROFESSIONAL APPEARANCE AND ATTITUDE; WILLINGNESS TO REPRESENT THE BRAND WITH INTEGRITY AT ALL TIMES.ADEPT AT USING TECHNOLOGY REQUIRED FOR STORE OPERATIONS (E.G., POS SYSTEMS) AND SALES PRESENTATIONS (E.G., INTERACTIVE DEMONSTRATIONS, IPAD, APPS); TECHNOLOGY ENGAGERS AND EARLY ADOPTERS PREFERRED.ABLE TO ADAPT AND GROW IN A CHANGING, FAST-PACED WORK ENVIRONMENT.GENUINE DESIRE TO GROW AND LEARN, AS WELL AS CONTRIBUTE POSITIVELY TO A TEAM-ORIENTED WORK ENVIRONMENT.MOTIVATED BY A PAY-FOR-PERFORMANCE COMPENSATION PLAN.ABILITY TO WORK A FLEXIBLE SCHEDULE; TYPICAL RETAIL HOURS TO INCLUDE EVENINGS AND WEEKENDS.MUST BE AUTHORIZED TO WORK IN THE U.S. AND ABLE TO DEMONSTRATE ENGLISH LANGUAGE PROFICIENCY. SECOND LANGUAGE SKILLS ENCOURAGED.MINIMUM H.S. DIPLOMA OR EQUIVALENT REQUIRED. ADDITIONAL EDUCATION AND TRAINING PREFERRED. \n\nCOMPENSATION AND BENEFITS\n\nGUARANTEED BASE PAY, PLUS COMMISSION AND BONUS PLAN\n\n#PIQ\n\nWELLBEING\n\nOUR COMPANY'S PURPOSE IS TO IMPROVE THE HEALTH AND WELLBEING OF SOCIETY.\n\nWELLBEING IS MORE THAN A CATCHPHRASE - IT'S A MOVEMENT THAT PERMEATES OUR COMPANY AND THROUGH OUR TEAM MEMBERS. WE ARE DEDICATED TO ENHANCING AND SUPPORTING THE WELLBEING OF OUR TEAM MEMBERS AND THEIR FAMILIES THROUGH BENEFITS, PROGRAMS, AND RESOURCES ACROSS OUR FIVE WELLBEING PILLARS OF EMOTIONAL, FINANCIAL, CAREER, COMMUNITY, AND PHYSICAL HEALTH, WITH SLEEP AT THE CENTER.\n\nBY JOINING OUR TEAM, IN ADDITION TO OFFERING COMPETITIVE PAY PROGRAMS, WE ARE PROUD TO OFFER ELIGIBLE TEAM MEMBERS AN EXTENSIVE BENEFITS PACKAGE INCLUDING, BUT NOT LIMITED TO MEDICAL AND PHARMACY BENEFITS, DENTAL, LIFE AND DISABILITY INSURANCE, A MATCHED 401(K) PLAN, PAID TIME OFF, AND MUCH MORE.\n\nEXAMPLES OF HOW WE INVEST IN YOUR WELLBEING\n\nSLEEP - OUR 360® SMART BED FOR TEAM MEMBERS, AND DISCOUNTS ON OUR INNOVATIONS AND SLEEP SOLUTIONS FOR YOURSELF AND FRIENDS AND FAMILY THROUGHOUT THE YEAR.PHYSICAL - WIDE RANGE OF WELLBEING RESOURCES AND SERVICES THROUGH OUR MEDICAL PLANS TO IMPROVE YOUR PHYSICAL HEALTH. EMOTIONAL - ACCESS TO MENTAL HEALTH RESOURCES, CAREGIVING SUPPORT, PAID TIME OFF AND PARENTAL LEAVE TO SUPPORT YOUR EMOTIONAL WELLBEING. WORK FOR YOUR DAY FLEXIBILITY, AVAILABLE FOR SELECT CORPORATE ROLES. FINANCIAL - COMPETITIVE BASE AND VARIABLE PAY PROGRAMS, ABILITY TO SAVE FOR THE FUTURE THROUGH A MATCHED 401(K) PLAN AND FINANCIAL SUPPORT TO RECOVER FROM AN ILLNESS OR INJURY.COMMUNITY - PAID TIME OFF FOR VOLUNTEERING AND CONNECTIONS TO OUR COMMUNITIES THROUGH OUR DIVERSITY, EQUITY & INCLUSION INITIATIVES, AND SUPPORT FOR CHARITABLE CAUSES.CAREER - OPPORTUNITIES FOR CAREER DEVELOPMENT AND CONTINUOUS LEARNING, INCLUDING A TUITION REIMBURSEMENT PROGRAM.\n\nSAFETY\n\nSAFETY IS A TOP PRIORITY FOR SLEEP NUMBER SUPPORTING CUSTOMERS AND TEAM MEMBERS WELLBEING. COVID-19 PRECAUTION(S) ARE IN PLACE CONSISTENT WITH CDC GUIDELINES, U.S. DEPARTMENT OF LABOR’S OCCUPATIONAL HEALTH & SAFETY ADMINISTRATION (OSHA), AND STATE/LOCAL LAWS.\n\nEEO STATEMENT\n\nSLEEP NUMBER IS AN EQUAL OPPORTUNITY EMPLOYER. WE ARE COMMITTED TO RECRUITING, HIRING AND PROMOTING QUALIFIED PEOPLE AND PROHIBIT DISCRIMINATION BASED ON RACE, COLOR, MARITAL STATUS, RELIGION, SEX (INCLUDING GENDER, GENDER IDENTITY, GENDER EXPRESSION, TRANSGENDER STATUS, PREGNANCY, CHILDBIRTH, AND MEDICAL CONDITIONS RELATED TO PREGNANCY OR CHILDBIRTH), SEXUAL ORIENTATION, AGE, NATIONAL ORIGIN OR ANCESTRY, CITIZENSHIP STATUS, PHYSICAL OR MENTAL DISABILITY, GENETIC INFORMATION (INCLUDING TESTING AND CHARACTERISTICS), VETERAN STATUS, UNIFORMED SERVICEMEMBER STATUS OR ANY OTHER STATUS PROTECTED BY FEDERAL, STATE, OR LOCAL LAW.\n\nAMERICANS WITH DISABILITIES ACT (ADA)\n\nIT IS SLEEP NUMBER’S POLICY TO PROVIDE REASONABLE ACCOMMODATIONS TO QUALIFIED INDIVIDUALS WITH DISABILITIES DURING THE APPLICATION PROCESS, CONSISTENT WITH APPLICABLE LAW. WE MAY REQUIRE SUPPORTING MEDICAL OR RELIGIOUS DOCUMENTATION WHERE APPLICABLE AND PERMISSIBLE BY LAW. IF YOU ARE A QUALIFIED INDIVIDUAL, YOU MAY REQUEST A REASONABLE ACCOMMODATION AT ANY TIME DURING THE SELECTION PROCESS, INCLUDING IF YOU ARE UNABLE OR OTHERWISE LIMITED IN YOUR ABILITY TO ACCESS OPEN ROLES HERE.\n\nPANDOLOGIC. KEYWORDS: SALES REPRESENTATIVE, LOCATION: EASTON, MD - 21601",
    "job_skill_set": [
      "sales",
      "customer service",
      "technology usage",
      "POS systems",
      "product knowledge",
      "communication",
      "interpersonal skills",
      "relationship building",
      "adaptability",
      "teamwork",
      "presentation skills",
      "integrity",
      "motivation",
      "sales presentations"
    ],
    "short_keywords": [
      "adaptability",
      "building",
      "communication",
      "customer",
      "integrity",
      "interpersonal",
      "knowledge",
      "motivation",
      "pos",
      "presentation",
      "presentations",
      "product",
      "relationship",
      "representative",
      "sales",
      "service",
      "skills",
      "systems",
      "teamwork",
      "technology",
      "usage"
    ]
  },
  {
    "job_id": "3889131144",
    "job_title": "Sales Director, Overland Park, KC",
    "category": "SALES",
    "job_description": "COMPANY:\n\nCOGENT COMMUNICATIONS IS A GLOBAL, TIER 1 FACILITIES-BASED ISP, CONSISTENTLY RANKED AS ONE OF THE TOP FIVE NETWORKS IN THE WORLD AND IS PUBLICLY TRADED ON THE NASDAQ STOCK MARKET UNDER THE TICKER SYMBOL CCOI. COGENT SPECIALIZES IN PROVIDING BUSINESSES WITH HIGH SPEED INTERNET ACCESS AND ETHERNET TRANSPORT SERVICES. COGENT'S FACILITIES-BASED, ALL-OPTICAL IP NETWORK BACKBONE PROVIDES IP SERVICES IN OVER 216 MARKETS GLOBALLY. SINCE ITS INCEPTION, COGENT HAS UNLEASHED THE BENEFITS OF IP TECHNOLOGY, BUILDING ONE OF THE LARGEST AND HIGHEST CAPACITY IP NETWORKS IN THE WORLD. THIS NETWORK ENABLES COGENT TO OFFER LARGE BANDWIDTH CONNECTIONS AT HIGHLY COMPETITIVE PRICES. COGENT ALSO OFFERS SUPERIOR CUSTOMER SUPPORT BY VIRTUE OF ITS END-TO-END CONTROL OF SERVICE DELIVERY AND NETWORK MONITORING. A FULL BENEFITS PACKAGE TAKES EFFECT WITHIN 30 DAYS OF EMPLOYMENT. MATCHING 401K AND STOCK OPTIONS ARE ALSO INCLUDED.\n\nRESPONSIBILITIES:\n\nTHIS POSITION IS RESPONSIBLE FOR LEADING A SALES TEAM OF SALES MANAGERS ALONG WITH THEIR REPS.THE SALES DIRECTOR WILL DEVELOP AND EXECUTE A SALES STRATEGY TO MEET THE ASSIGNED NEW REVENUE QUOTA.DIRECT CUSTOMER CONTACT WILL COMPRISE A MAJOR PORTION OF THIS ASSIGNMENT.THE INDIVIDUAL WILL BE RESPONSIBLE FOR LEADING, COACHING, AND TRAINING THE MANAGERS AND SALES REPS IN THE SALE OF COGENT PRODUCTS.\n\nQUALIFICATIONS:\n\nWE’RE LOOKING FOR CANDIDATES THAT WELCOME A CHALLENGE, ARE MOTIVATED, DRIVEN AND EXHIBIT GREAT WORK-ETHIC.IT’S NOT ABOUT THE NUMBER OF YEARS OF EXPERIENCE YOU HAVE; IT’S ABOUT WHAT YOU ACCOMPLISHED IN THOSE YEARS OF EXPERIENCE.CANDIDATES MUST HAVE A PROVEN TRACK RECORD OF SUCCESS SELLING TELECOM/TECHNOLOGY PRODUCTS.CANDIDATE MUST HAVE EXPERIENCE FINDING NEW BUSINESS.CANDIDATE MUST HAVE STRONG TEAM LEADERSHIP AND MANAGEMENT EXPERIENCE AND MUST HAVE EXPERIENCE MANAGING SALES MANAGERS.A COLLEGE DEGREE IS PREFERRED.PROFICIENCY WITH PC BASED APPLICATIONS SUCH AS WORD, EXCEL AND CRM SYSTEMS A PLUS.SOME TRAVEL WILL BE REQUIRED.\n\nWHAT WE HAVE TO OFFER:\n\nCOGENT IS A FINANCIALLY STABLE FAST-GROWING ORGANIZATION. WE ARE CASH FLOW POSITIVE AND HAVE ONE OF THE STRONGEST BALANCE SHEETS IN THE INDUSTRY. WE PROVIDE AN EXCITING OPPORTUNITY TO LEAD A SALES TEAM WITH UNLIMITED EARNING POTENTIAL, IN A FUN FAST-PACED ENVIRONMENT THAT PROVIDES UNLIMITED SUPPORT AND RECOGNIZES INDIVIDUAL AND TEAM ACHIEVEMENTS. YOU WILL BE A PART OF AN ORGANIZATION THAT IS EXPERIENCING TREMENDOUS GROWTH, PROVIDING OUR TEAM MEMBERS OPPORTUNITIES TO GROW WITHIN THE COMPANY AND COGENT HAS A REPUTATION FOR PROMOTING OUR TOP PERFORMING TEAM MEMBERS INTO LEADERSHIP ROLES.\n\nCOVID-19 POLICY:\n\nCOGENT HAS ADOPTED A MANDATORY VACCINATION AND BOOSTER POLICY WHICH REQUIRES ALL U.S. EMPLOYEES TO BE FULLY VACCINATED ( INCLUDING BOOSTER SHOTS WHEN ELIGIBLE) AGAINST COVID-19. PRIOR TO BEGINNING EMPLOYMENT, NEW EMPLOYEES MUST PROVIDE PROOF OF VACCINATION OR APPLY FOR AND RECEIVE AN ACCOMMODATION TO BE EXEMPT FROM THE POLICY.\n\nBY SUBMITTING AN APPLICATION OR RESUME FOR THIS POSITION, I UNDERSTAND THAT IS AN IN-OFFICE POSITION AND AGREE TO ABIDE COGENT’S MANDATORY VACCINATION POLICY.\n\nTO APPLY FOR THE OVERLAND PARK SALES DIRECTOR POSITION, PLEASE SUBMIT YOUR RESUME AND COVER LETTER TO CAREERS@COGENTCO.COM .\n\nCOGENT COMMUNICATIONS IS AN EQUAL OPPORTUNITY EMPLOYER.\n\n",
    "job_skill_set": [
      "sales strategy",
      "team leadership",
      "Microsoft Word",
      "business development",
      "motivation",
      "work ethic",
      "communication",
      "problem solving",
      "telecom products",
      "CRM systems",
      "Microsoft Excel",
      "coaching",
      "training"
    ],
    "short_keywords": [
      "business",
      "coaching",
      "communication",
      "crm",
      "development",
      "director",
      "ethic",
      "excel",
      "kc",
      "leadership",
      "microsoft",
      "motivation",
      "overland",
      "park",
      "problem",
      "products",
      "sales",
      "solving",
      "strategy",
      "systems",
      "team",
      "telecom",
      "training",
      "word",
      "work"
    ]
  },
  {
    "job_id": "3900946947",
    "job_title": "Sales Associate",
    "category": "SALES",
    "job_description": "OUR STORY\n\nMADEWELL IS A COMMUNITY-DRIVEN CLOTHING DESTINATION THAT CHAMPIONS CREATIVITY, INCLUSIVITY, AND SELF-EXPRESSION. WITH DENIM AT THE BRAND’S CORE, MADEWELL ALSO OFFERS ALL THE TENETS OF A GREAT WARDROBE, FROM EASY TEES AND TIMELESS OUTERWEAR TO CLASSIC FOOTWEAR AND LAST-FOREVER BAGS. BEYOND IMPECCABLY DESIGNED PRODUCTS, MADEWELL ALSO DISTINGUISHES ITSELF THROUGH A NUMBER OF MEANINGFUL SUSTAINABILITY INITIATIVES, A BEST-IN-CLASS CUSTOMER LOYALTY PROGRAM, AND COMMUNITY-DRIVEN INITIATIVES INCLUDING HOMETOWN HEROES AND LABELS WE LOVE. FOR MORE INFORMATION, VISIT MADEWELL.COM AND FOLLOW US @MADEWELL.\n\nJOB SUMMARY\n\nAS A SALES ASSOCIATE, YOU ACT AS A BRAND AMBASSADOR BRINGING YOUR OWN PERSONAL STYLE, PASSION FOR THE PRODUCT AND WELCOMING ENERGY TO THE SALES FLOOR EACH DAY. YOU’LL CREATE GENUINE CONNECTIONS, HELPING CUSTOMERS TO FIND THEIR OWN UNIQUE LOOK. YOU’LL COLLABORATE WITH YOUR TEAM MEMBERS AND MANAGERS TO DRIVE THE BUSINESS, JUMP IN ON TASKS THAT HELP CREATE A SEAMLESS CUSTOMER EXPERIENCE, AND BRING A COLLABORATIVE, KIND, AND INCLUSIVE ENERGY TO THE SALES FLOOR.\n\nJOB RESPONSIBILITIES\n\nDRIVE SALES BY EXCEEDING SELLING AND SERVICE EXPECTATIONS. COMPLETE TRAINING, USE PRODUCT KNOWLEDGE TOOLS, PARTICIPATE IN FIT SESSIONS AND PUT THOSE EXPERIENCES TO USE. ASSIST IN STORE TASKS—OUR CUSTOMERS SHOULD ALWAYS SEE US AT OUR BEST. SHARE FEEDBACK, INSIGHTS AND IDEAS WITH THE MANAGEMENT TEAM. ACT IN A MANNER THAT ALIGNS WITH OUR VALUES. \n\n(ABOUT YOU) YOU’LL BE GREAT IN THE ROLE IF YOU …\n\nMAKE THE BEST FIRST IMPRESSION—SMILE, WELCOME AND CONNECT WITH CUSTOMERS AUTHENTICALLY. LOVE THE BRAND AND HAVE A GREAT FASHION AESTHETIC. DO WHAT IT TAKES TO CREATE SEAMLESS, AMAZING EXPERIENCES CUSTOMERS CAN’T STOP TALKING ABOUT. BRING YOUR BEST TO EVERYTHING YOU DO AND ACHIEVE YOUR GOALS. ARE FLEXIBLE, AND READY TO HAVE FUN ALONG THE WAY. LEVERAGE TECHNOLOGY, WHILE ALSO KNOWING THAT DEVICES DON’T DOMINATE THE DIALOGUE. BUILD PRODUCTIVE RELATIONSHIPS WITH EVERYONE ON THE TEAM AND ALWAYS RESPECT EACH OTHER. ARE AT LEAST 18 YEARS OLD. ARE AVAILABLE WHEN WE ARE BUSY, INCLUDING: NIGHTS, WEEKENDS AND HOLIDAYS. CAN BEND, REACH, STRETCH AS WELL AS LIFT, CARRY AND MOVE AT LEAST 40 POUNDS | 18 KILOS. CAN REGULARLY MOVE AROUND ALL STORE AREAS AND BE ACCESSIBLE TO CUSTOMERS. \n\nBEFORE WE WRAP, A WORD ABOUT A FEW OF OUR WAY COOL PERKS…\n\nCOMPETITIVE BASE PAY AND BONUS PROGRAMSFLEXIBLE DAYS AND HOURSAMAZING MERCHANDISE DISCOUNTS24/7 FREE CONFIDENTIAL HELP WITH A VARIETY OF PERSONAL AND WORK CONCERNSPERSONAL AND PROFESSIONAL DEVELOPMENTGIVING BACK –VOLUNTEER PROGRAM, DISASTER RELIEF FUNDS, CHARITABLE MATCHING DONATIONS*MEDICAL, DENTAL, VISION, LIFE INSURANCE, PET INSURANCE, LEGAL PLAN, ID THEFT, COMMUTER BENEFIT*TIME AWAY – PAID TIME OFF, HOLIDAYS, PARENTAL LEAVE, DISABILITY LEAVE, BEREAVEMENT*401(K) PLAN WITH COMPANY MATCHING CONTRIBUTIONSNOTE: AVAILABILITY OF THESE BENEFITS AND PERKS MAY BE SUBJECT TO WORK LOCATION & EMPLOYMENT TYPE AND MAY HAVE CERTAIN ELIGIBILITY REQUIREMENTS. \n\nHOURLY RANGE: $15.57 - $20.50\n\nAT J.CREW GROUP (JCG) WE AIM TO PAY COMPETITIVELY FOR OUR COMPANY’S SIZE AND INDUSTRY. THE BASE SALARY OFFERED WILL TAKE INTO ACCOUNT INTERNAL EQUITY AND MAY VARY DEPENDING ON THE CANDIDATE’S GEOGRAPHIC REGION OF WORK PREMISES, JOB-RELATED KNOWLEDGE, SKILLS, AND EXPERIENCE AMONG OTHER FACTORS. THE BASE SALARY IS JUST ONE COMPONENT OF J.CREW GROUP’S COMPETITIVE TOTAL REWARDS STRATEGY THAT ALSO INCLUDES THE OPPORTUNITY FOR BONUS, COMPETITIVE BENEFITS AND PERKS.\n\nONE OF OUR CORE FOCUSES HERE AT JCG IS CREATING A COMMUNITY AND CULTURE THAT BUILDS BELONGING. WE ARE DEEPLY COMMITTED TO OUR DIVERSITY, EQUITY AND INCLUSION EFFORTS, AND WE WARMLY WELCOME JOB APPLICANTS OF ALL BACKGROUNDS.\n\nJCG IS PROUD TO AFFIRMATIVELY PROVIDE EQUAL OPPORTUNITY TO ALL ASSOCIATES AND QUALIFIED APPLICANTS WITHOUT REGARD TO RACE, COLOR, RELIGION, NATIONAL ORIGIN OR CITIZENSHIP, AGE, SEX, MARITAL STATUS, ANCESTRY, LEGALLY PROTECTED PHYSICAL OR MENTAL DISABILITY, VETERAN STATUS, GENDER IDENTITY, SEXUAL ORIENTATION OR ANY OTHER BASIS PROTECTED UNDER APPLICABLE LAW.",
    "job_skill_set": [
      "product knowledge",
      "sales techniques",
      "customer service",
      "technology usage",
      "merchandising",
      "communication",
      "teamwork",
      "flexibility",
      "creativity",
      "relationship building",
      "problem solving",
      "customer engagement"
    ],
    "short_keywords": [
      "associate",
      "building",
      "communication",
      "creativity",
      "customer",
      "engagement",
      "flexibility",
      "knowledge",
      "merchandising",
      "problem",
      "product",
      "relationship",
      "sales",
      "service",
      "solving",
      "teamwork",
      "techniques",
      "technology",
      "usage"
    ]
  },
  {
    "job_id": "3902350247",
    "job_title": "Sales Executive [28224]",
    "category": "SALES",
    "job_description": "THE COMPANY IS THE LEADING SYNOPTIC REPORTING AND DATA ANALYTICS COMPANY IN HEALTHCARE. PHYSICIANS USE OUR PRODUCTS EVERY DAY TO DOCUMENT PATHOLOGY DIAGNOSES AND SURGICAL PROCEDURES AND BUILD CLINICAL REPORTS. WE ARE SHAKING UP THE TRADITIONAL DOCUMENTATION PROCESS AND REWARDING PHYSICIANS WITH INTELLIGENT REMINDERS, CALCULATIONS, AND UNPRECEDENTED EASE OF USE - HELPING THEM PROVIDE BETTER CARE AND MAXIMIZE REIMBURSEMENT. OUR SOLUTIONS AGGREGATE RESULTS TO PRODUCE MEASURABLE QUALITY METRICS AND DELIVER DATA TO SYSTEMS THAT PUT IT TO USE.\nBA/BS DEGREE OR EQUIVALENT WORK EXPERIENCEWILLINGNESS TO SPEND TIME BUILDING RELATIONSHIPS VIA PHONE (2 HOURS/DAY)SALESFORCE/CRM EXPERIENCEHEALTHCARE TECHNOLOGY SALES EXPERIENCE A PLUSCAPACITY TO DEVELOP DEEP FAMILIARITY WITH COMPLEX SUBJECT MATTER IN HEALTHCARE.EXPERIENCE IN HEALTHCARE OR SIMILARLY CHALLENGING FIELD\nWHAT WE OFFER:COMPETITIVE SALARY WITH COMMISSION (ON GENERATED REVENUE, TALK TIME, CALL VOLUME)OPPORTUNITIES FOR PROFESSIONAL DEVELOPMENT AND CAREER GROWTHA DYNAMIC AND SUPPORTIVE WORK ENVIRONMENTHEALTH, DENTAL, AND VISION INSURANCERETIREMENT SAVINGS PLANGENEROUS VACATION AND LEAVE POLICY\nIF YOU HAVE THEM, WE'D LOVE TO SEE IN ADVANCE:WRITING SAMPLES (BLOG, DOCS, TERM PAPERS, NEW YORKER CARTOON CAPTIONS, WHATEVER YOU HAVE)LINKS TO SITES, APPS, BOOKS, OR OTHER PROJECTS YOU HAVE HELPED CREATEANALYTICAL PROJECTS, SUCH AS STATISTICS, DATA ANALYTICS, EXPERIMENTS, ETC.\nCREATIVE APPLICATIONS ARE WELCOMED.",
    "job_skill_set": [
      "Relationship Building",
      "Salesforce",
      "CRM",
      "Healthcare Technology Sales",
      "Data Analytics",
      "Statistics",
      "Analytical Projects",
      "Communication",
      "Problem Solving",
      "Adaptability",
      "Creativity"
    ],
    "short_keywords": [
      "28224",
      "adaptability",
      "analytical",
      "analytics",
      "building",
      "communication",
      "creativity",
      "crm",
      "data",
      "executive",
      "healthcare",
      "problem",
      "projects",
      "relationship",
      "sales",
      "salesforce",
      "solving",
      "statistics",
      "technology"
    ]
  },
  {
    "job_id": "3782812525",
    "job_title": "Salesperson",
    "category": "SALES",
    "job_description": "THE TERRA FORZA GOLF TEAM IS GROWING! TERRITORY IS TO BE DETERMINED. \nPOSITION SUMMARY\nRESPONSIBLE FOR THE SALE OF TERRA FORZA GOLF PRODUCTS AND SERVICES IN THE TERIITORY BY INTERACTING WITH ESTABLISHED CUSTOMERS AND DEVELOPING NEW PROSPECTS. MAINTAINS PERSONAL ONE-ON-ONE CONTACT AND ASSURES CUSTOMER AWARENESS BY PROVIDING EXPERTISE, KNOWLEDGE, NEW PRODUCT INFORMATION AND SUCH CONSISTENT WITH COMPANY OBJECTIVES AND QUALITY STANDARDS.\nESSENTIAL FUNCTIONS AND KEY RESPONSIBILITIES\nSUCCESSFULLY SELL AND PROMOTE THE COMPANY'S PRODUCTS AND SERVICES WHILE MAXIMIZING THE TERRITORY’S POTENTIAL.ACHIEVES BOTH SHORT AND LONG-TERM OBJECTIVES FOR INCREASED SALES VOLUME AND TERRITORY GROWTH.EDUCATE AND INFORM CUSTOMERS AND GOLF PUBLIC ABOUT COMPANY PRODUCTS TO ASSURE GROWTH, PRODUCT/SERVICE DEVELOPMENT, QUALITY CONTROL AND PROFITABILITY.RESPONSIBLE FOR SECURING AND RENEWING ORDERS & MERCHANDISING OUR PRODUCTS @ ACCOUNT BASE WITHIN ASSIGNED TERRITORY TO ENSURE BEST POSSIBLE SELL THROUGH.MAINTAIN OPEN COMMUNICATIONS BETWEEN COMPANY AND CUSTOMERS. ESTABLISH PROFESSIONAL CUSTOMER/VENDOR RELATIONSHIP WITH APPROPRIATE CUSTOMER PERSONNEL.ACTS WITHIN SCOPE OF CORPORATE OBJECTIVES AND POLICIES TO ACCOMPLISH ASSIGNED GOALS.CALL ON AND PROVIDE SERVICE TO STRATEGIC ACCOUNT DOORS WITHIN DEFINED TERRITORY (I.E. MERCHANDISING, PRODUCT/FITTING TRAINING, RELATIONSHIP BUILDING, VISIT REPORTS, ETC.)ENGAGE AND SUPPORT EXPERIENTIAL FITTING EVENTS AND APPOINTMENTS WITH LOCAL ON AND OFF COURSE RETAILERS (GREEN GRASS, STRATEGIC, AND KEY ACCOUNTS).PERFORMS OTHER RELATED DUTIES AND ASSIGNMENTS AS REQUIRED\nKNOWLEDGE AND SKILLS REQUIREMENTS\nSTRONG LEVEL OF WRITTEN AND VERBAL COMMUNICATION SKILLS. USE OF PROFESSIONAL LANGUAGE AND GOOD JUDGMENT WHEN INTERACTING WITH CUSTOMERS REGARDING COMPARISON OF VARIOUS PRODUCT BRANDS.HIGH LEVEL OF ORGANIZATION & TIME MANAGEMENT SKILLS.STRONG TECHNICAL SKILLS (GOLF EQUIPMENT, COMPUTERS, ETC.).ABILITY TO EFFECTIVELY PRESENT INFORMATION AND IDEAS TO VARYING LEVELS IN THE ORGANIZATION AND TO GROUPS OF ALL SIZES.\nEDUCATION, WORK EXPERIENCE, AND PROFESSIONAL CERTIFICATIONS\n3+ YEARS OF GOLF-RELATED OUTSIDE SALES EXPERIENCE REQUIRED.BACHELOR’S DEGREE IN MARKETING, BUSINESS ADMINISTRATION OR SIMILAR FIELD REQUIRED.EXPERIENCE WITH CLUB FITTING AND GOLF HARDGOODS IS PREFERRED.MUST HAVE PASSION FOR THE GAME OF GOLF AND PROFICIENT PLAYING ABILITY.\nWORK ENVIRONMENT / PHYSICAL REQUIREMENTS\nFLEXIBILITY IN DAYS AND HOURS AVAILABLE FOR SCHEDULED WORK; INCLUDING WEEKENDS.TRAVEL REQUIRED (CAR/PLANE). MUST HOLD VALID DRIVER’S LICENSE AND BE ABLE TO DRIVE TO VARIOUS LOCATIONS TO PERFORM SALES WORK.MUST BE ABLE TO LIVE IN THE DEFINED SALES TERRITORY WITH ABILITY TO TRAVEL WITHIN TERRITORY LINES.\n",
    "job_skill_set": [
      "sales",
      "customer relationship management",
      "time management",
      "technical skills",
      "presentation skills",
      "merchandising",
      "computer skills",
      "communication",
      "organization",
      "professionalism",
      "judgment",
      "relationship building",
      "golf equipment knowledge",
      "order securing and renewing",
      "golf-related outside sales experience",
      "club fitting",
      "passion for golf"
    ],
    "short_keywords": [
      "and",
      "building",
      "club",
      "communication",
      "computer",
      "customer",
      "equipment",
      "experience",
      "fitting",
      "for",
      "golf",
      "golfrelated",
      "judgment",
      "knowledge",
      "management",
      "merchandising",
      "order",
      "organization",
      "outside",
      "passion",
      "presentation",
      "professionalism",
      "relationship",
      "renewing",
      "sales",
      "salesperson",
      "securing",
      "skills",
      "technical",
      "time"
    ]
  },
  {
    "job_id": "3901461368",
    "job_title": "Art Gallery Sales & Marketing Associate",
    "category": "SALES",
    "job_description": "COMPANY DESCRIPTIONMORTON CONTEMPORARY ART GALLERY IS ONE OF PHILADELPHIA'S LEADING GALLERIES IN THE HEART OF PHILADELPHIA. OUR DIVERSE CONTEMPORARY ART COLLECTION RANGES FROM ORIGINAL WORKS ON CANVAS TO SCULPTURE, MIXED-MEDIA, AND PHOTOGRAPHY. WE SPECIALIZE IN REPRESENTING AND PROMOTING INNOVATIVE EMERGING AND ESTABLISHED ARTISTS FROM AROUND THE WORLD.\nROLE DESCRIPTIONTHIS IS A FULL-TIME ON-SITE ROLE AS AN ART GALLERY SALES & MARKETING ASSOCIATE, SUPPORTING THE OWNER AND DIRECTOR OF THE GALLERY. AS AN ART GALLERY SALES & MARKETING ASSOCIATE, YOU WILL BE RESPONSIBLE FOR SELLING ART SUCCESSFULLY ON THE GALLERY FLOOR, RECRUITING NEW CLIENTS THROUGH MARKETING, MANAGING EVENTS AND SPONSORSHIPS, MANAGING SOCIAL MEDIA ACCOUNTS AND WEBSITE, HANDLING SHIPPING AND OPERATIONS, AND MAINTAINING THE GALLERY'S CLEAN AND ORGANIZED APPEARANCE.\nDAYS: FRIDAY, SATURDAY, SUNDAY AND MONDAY 10AM TO 7PM PAY: HOURLY PLUS A GREAT COMMISSION. \nQUALIFICATIONSPRIOR EXPERIENCE IN SALES (IDEALY ART AND LUXURY)STRONG COMMUNICATION AND INTERPERSONAL SKILLSKNOWLEDGE AND PASSION FOR CONTEMPORARY ARTFAMILIARITY WITH ART SELLING TECHNIQUESABILITY TO WORK FLEXIBLE HOURS, INCLUDING WEEKENDS AND EVENINGSPROFICIENCY MAILCHIMP, CANVA, ADOBE CREATIVEEXPERIENCE WITH SOCIAL MEDIA PLATFORMS -- LINKEDIN, INSTAGRAM, FB, YOUTUBEABILITY TO MULTITASK AND PRIORITIZE TASKSDETAIL-ORIENTED AND EXTREMELY ORGANIZEDA VERY COMPETENT WRITER WITH EXPERIENCE WRITING ABOUT ART AND DESIGNSOPHISTICATED, CHARISMATIC, AND EXTREMELY SAVVY WITH PEOPLE AND SALES",
    "job_skill_set": [
      "sales",
      "marketing",
      "event management",
      "communication",
      "interpersonal skills",
      "organization",
      "multitasking",
      "detail-oriented",
      "charisma",
      "flexibility",
      "social media management",
      "Mailchimp",
      "Canva",
      "Adobe Creative Suite",
      "art selling techniques",
      "website management",
      "shipping and operations",
      "writing",
      "passion for contemporary art"
    ],
    "short_keywords": [
      "adobe",
      "and",
      "art",
      "associate",
      "canva",
      "charisma",
      "communication",
      "contemporary",
      "creative",
      "detailoriented",
      "event",
      "flexibility",
      "for",
      "gallery",
      "interpersonal",
      "mailchimp",
      "management",
      "marketing",
      "media",
      "multitasking",
      "operations",
      "organization",
      "passion",
      "sales",
      "selling",
      "shipping",
      "skills",
      "social",
      "suite",
      "techniques",
      "website",
      "writing"
    ]
  },
  {
    "job_id": "3906087173",
    "job_title": "Regional Sales Director",
    "category": "SALES",
    "job_description": "THE OBE REGION SALES DIRECTOR SUPPORTING THE NORTHEAST REGION LEADS KEY SALES FUNCTIONS TO ENSURE THAT THE CUSTOMER SUPPORT, PLANT LEADERSHIP, SALES AND ACCOUNT MANAGEMENT, AND SALES SUPPORT TEAMS ALL WORK TOGETHER EFFECTIVELY TO DRIVE SALES FORCE PRODUCTIVITY. THE OVERSIGHT FOR THIS POSITION SPANS ACROSS MULTIPLE MANUFACTURING PLANTS, PRODUCTS, AND ORGANIZATIONS TO ENSURE OBE IS LEVERAGING ALL ASSETS TO WIN AND ACHIEVE MARKET LEADERSHIP. THIS LEADERSHIP ROLE IS HIGHLY COLLABORATIVE WITH A FOCUS ON FOSTERING EFFICIENT COORDINATION. THEY DIRECT PLANNING ACTIVITIES WITH OTHER BUSINESS FUNCTIONS AND STAKEHOLDERS ACROSS THE REGION MANUFACTURING PLANTS AND SALES ORGANIZATIONS. THE REGION SALES DIRECTOR ALSO TAKES INITIATIVE IN BUILDING PEER SUPPORT AND STRONG INTERNAL BUSINESS RELATIONSHIPS WITH KEY LEADERSHIP TO ENHANCE SALES EFFORTS.THE REGION SALES DIRECTOR REPORTS DIRECTLY TO THE ASSIGNED OBE REGIONAL AG PRESIDENT, OBE AGS REGIONAL PRESIDENT, OR AN ASSIGNED REGIONAL VP. ALL OUTSIDE SALES TEAMS WILL DIRECT REPORT TO THIS ROLE. THE LOCAL PLANT SALES MANAGERS, INSIDE SALES MANAGERS, ESTIMATING MANAGERS WILL REPORT TO THE PLANT GENERAL MANAGER OR OPERATIONS MANAGER, WITH A DOTTED LINE TO THIS ROLE.  KEY RESPONSIBILITIES UNDERSTAND, EMULATE, AND DRIVE THE OBE VISION, STRATEGY AND COMMERCIAL EXCELLENCE FRAMEWORK WITHIN DAILY AND STRATEGIC BUSINESS ACTIVITIESCREATE STRONG RELATIONSHIPS WITH KEY STAKEHOLDERS AT BOTH SENIOR AND MID-MANAGEMENT LEVELS ACROSS MULTIPLE PLANTS AND ORGANIZATIONSWORK CLOSELY WITH COLLEAGUES ON CROSS-REGION AND BUSINESS OPPORTUNITIESUNDERSTAND THE COMPETITIVE LANDSCAPE AND MARKET TRENDSUNDERSTAND AND EFFECTIVELY COMMUNICATE THE COMPANY'S VALUE PROPOSITION OF THE OBE ENTITIESESTABLISH SALES OBJECTIVES BY FORECASTING AND DEVELOPING ANNUAL SALES QUOTAS FOR REGIONMAINTAIN SALES VOLUME, PRODUCT MIX AND SELLING PRICE BY KEEPING CURRENT WITH SUPPLY AND DEMAND, CHANGING TRENDS, ECONOMIC INDICATORS, AND COMPETITORSMAINTAIN SALES STAFF BY RECRUITING, SELECTING, AND ONBOARDING EMPLOYEESDEVELOP A HIGH-PERFORMING TEAM THROUGH EFFECTIVE GOAL-SETTING, EVALUATION, TRAINING, FEEDBACK, AND COACHINGWORK WITH THE SALES MANAGERS, SALES REPS, PLANT GMS, OPERATIONS AND OTHER CRITICAL FUNCTIONAL TEAMS TO IMPLEMENT TARGETED SALES STRATEGIESPARTNER WITH INTERNAL TEAMS ON BEHALF OF CLIENTS TO ENSURE THE HIGHEST LEVEL OF CUSTOMER SERVICEINTERFACE WITH TECHNICAL SUPPORT INTERNALLY TO RESOLVE ISSUES THAT DIRECTLY IMPACT PARTNERSWORK COLLABORATIVELY WITH THE SALES AND MARKETING TEAMS AND FOSTER A CULTURE OF CONTINUOUS PROCESS IMPROVEMENTENSURE REPORTS AND OTHER INTERNAL INTELLIGENCE AND INSIGHT IS PROVIDED TO THE SALES AND MARKETING ORGANIZATIONANALYZE SALES CLOUD CRM PIPELINE AND MICROSTRATEGY ANALYTICS, DELIVER PERIODIC REPORTING TO THE SALES AND MARKETING TEAMS PROVIDING KEY BUSINESS INSIGHTS. TYPICAL REPORTING RELATES TO DEMAND GENERATION, PIPELINE FORECAST AND TRENDS, CONVERSION RATES, TARGET ACCOUNT, MARKET SEGMENTATION, WIN/LOSS, ETC.KNOWLEDGE, SKILLS AND ABILITIES NEEDED FOR SUCCESSBACHELOR’S DEGREE IN BUSINESS MANAGEMENT, FINANCE, ENGINEERING, MARKETING OR A RELATED FIELD PLUS A MINIMUM OF 5+ YEARS OF PROGRESSIVE MANAGEMENT EXPERIENCE IN BUSINESS, FINANCE, SALES AND/OR OPERATIONSEXPERIENCE IN BUILDING PRODUCTS AND MANUFACTURING; BUILDING FAÇADE/CURTAIN WALL PROJECTS AND GLASS OR CONSTRUCTION INDUSTRY IS A PLUSMUST BE ABLE TO EFFECTIVELY BUILD RELATIONSHIPS AND INTERACT WITH CUSTOMERS, SUPPLIERS, DISTRIBUTORS AND ALL OTHER COMMERCIAL CONTACTSTRAVEL REQUIREMENTS 40%+MUST BE AN EFFECTIVE COMMUNICATOR WITH LOGICAL, ORGANIZED VERBAL AND WRITTEN COMMUNICATION, AND PRESENTATION SKILLS. STRONG INTERPERSONAL SKILLSREQUIRES STRONG ANALYTICAL, ORGANIZATIONAL AND LEADERSHIP SKILLSMICROSOFT OFFICE 360, SAP, CRM AND BUSINESS ANALYTICS WORKING KNOWLEDGEWHAT OBE OFFERS YOU HIGHLY COMPETITIVE BASE PAYCOMPREHENSIVE MEDICAL, DENTAL, AND DISABILITY BENEFITS PROGRAMSGROUP RETIREMENT SAVINGS PROGRAMHEALTH AND WELLNESS PROGRAMSA CULTURE THAT VALUES OPPORTUNITY FOR GROWTH, DEVELOPMENT, AND INTERNAL PROMOTIONABOUT OBE OBE HAS A LONG AND PROUD HERITAGE. WE ARE A COLLECTION OF FAMILY BUSINESSES, REGIONAL COMPANIES, AND LARGE ENTERPRISES THAT TOGETHER FORM THE OBE FAMILY. OBE OPERATES IN A DECENTRALIZED, DIVERSIFIED STRUCTURE THAT ALLOWS YOU TO WORK IN A SMALL COMPANY ENVIRONMENT WHILE HAVING THE CAREER OPPORTUNITIES OF A LARGE ORGANIZATION.IF YOU’RE UP FOR A REWARDING CHALLENGE, WE INVITE YOU TO TAKE THE FIRST STEP AND APPLY TODAY! ONCE YOU CLICK APPLY NOW, YOU WILL BE BROUGHT TO OUR OFFICIAL EMPLOYMENT APPLICATION. PLEASE COMPLETE YOUR ONLINE PROFILE AND IT WILL BE SENT TO THE HIRING MANAGER. OUR SYSTEM ALLOWS YOU TO VIEW AND TRACK YOUR STATUS 24 HOURS A DAY. THANK YOU FOR YOUR INTEREST!OBE IS AN AFFIRMATIVE ACTION AND EQUAL OPPORTUNITY EMPLOYER.EOE/VET/DISABILITY--IF YOU WANT TO KNOW MORE, PLEASE CLICK ON THIS LINK",
    "job_skill_set": [
      "Communication Skills",
      "Interpersonal Skills",
      "Organizational Skills",
      "Relationship Building",
      "Adaptability",
      "Sales Management",
      "Analytical Skills",
      "CRM Software",
      "Microsoft Office 360",
      "SAP",
      "Business Analytics",
      "Forecasting",
      "Market Analysis",
      "Recruiting",
      "Training and Development",
      "Project Management",
      "Customer Relationship Management",
      "Sales Strategy",
      "Financial Management",
      "Manufacturing Knowledge",
      "Leadership",
      "Collaboration",
      "Problem Solving",
      "Goal Setting",
      "Coaching"
    ],
    "short_keywords": [
      "360",
      "adaptability",
      "analysis",
      "analytical",
      "analytics",
      "and",
      "building",
      "business",
      "coaching",
      "collaboration",
      "communication",
      "crm",
      "customer",
      "development",
      "director",
      "financial",
      "forecasting",
      "goal",
      "interpersonal",
      "knowledge",
      "leadership",
      "management",
      "manufacturing",
      "market",
      "microsoft",
      "office",
      "organizational",
      "problem",
      "project",
      "recruiting",
      "regional",
      "relationship",
      "sales",
      "sap",
      "setting",
      "skills",
      "software",
      "solving",
      "strategy",
      "training"
    ]
  },
  {
    "job_id": "3885104533",
    "job_title": "Salesperson",
    "category": "SALES",
    "job_description": "COMPANY\nWWW.3GHCRE.COM\n ROLE DESCRIPTION THIS IS A FULL-TIME SALES ASSOCIATE ROLE AT 3G HEALTHCARE REAL ESTATE. AS A SALES ASSOCIATE, YOU WILL BE RESPONSIBLE FOR PROSPECTING AND GENERATING NEW LEADS, CONDUCTING SALES PRESENTATIONS AND NEGOTIATIONS, AND BUILDING AND MAINTAINING RELATIONSHIPS WITH CLIENTS. THIS IS A HYBRID ROLE, LOCATED IN INDIANAPOLIS, IN, WITH THE FLEXIBILITY FOR SOME REMOTE WORK.\n QUALIFICATIONS STRONG INTERPERSONAL AND COMMUNICATION SKILLSEXCELLENT SALES AND NEGOTIATION SKILLSPROVEN TRACK RECORD IN MEETING AND EXCEEDING SALES TARGETSEXPERIENCE IN THE HEALTHCARE OR REAL ESTATE INDUSTRY IS A PLUSKNOWLEDGE OF SALES TECHNIQUES AND STRATEGIESABILITY TO WORK INDEPENDENTLY AND AS PART OF A TEAMPROFICIENCY IN MICROSOFT OFFICE AND CRM SOFTWAREBACHELOR'S DEGREE IN BUSINESS ADMINISTRATION, MARKETING, OR RELATED FIELD",
    "job_skill_set": [
      "sales",
      "negotiation",
      "sales techniques",
      "real estate industry",
      "business administration",
      "marketing",
      "communication",
      "interpersonal skills",
      "relationship building",
      "independence",
      "teamwork",
      "CRM software",
      "Microsoft Office",
      "healthcare industry"
    ],
    "short_keywords": [
      "administration",
      "building",
      "business",
      "communication",
      "crm",
      "estate",
      "healthcare",
      "independence",
      "industry",
      "interpersonal",
      "marketing",
      "microsoft",
      "negotiation",
      "office",
      "real",
      "relationship",
      "sales",
      "salesperson",
      "skills",
      "software",
      "teamwork",
      "techniques"
    ]
  },
  {
    "job_id": "3902325188",
    "job_title": "PT Sales Associate Cashier",
    "category": "SALES",
    "job_description": "ADDRESS: USA-NC-RALEIGH-1030 N ROGERS LANE\n\nSTORE CODE: STORE 02504 FRONT END (7232376)\n\nFOOD LION HAS BEEN PROVIDING AN EASY, FRESH AND AFFORDABLE SHOPPING EXPERIENCE TO THE COMMUNITIES WE SERVE SINCE 1957. TODAY, OUR 82,000 ASSOCIATES SERVE MORE THAN 10 MILLION CUSTOMERS A WEEK ACROSS 10 SOUTHEASTERN AND MID-ATLANTIC STATES.\n\nPRIMARY PURPOSE\n\nTO PROVIDE FAST, EASY, FLEXIBLE AND FRIENDLY SERVICE TO OUR CUSTOMERS THROUGH THE ACHIEVEMENT OF FOOD LION CUSTOMER SERVICE STANDARDS. TO BE FRIENDLY, COURTEOUS AND COOPERATIVE WITH OTHER STORE ASSOCIATES. RESPONSIBLE FOR ASSISTING THE CUSTOMER SERVICE MANAGER AND THE ASSISTANT CUSTOMER SERVICE MANAGER IN MAINTAINING STANDARDS ACCORDING TO FRONT END STANDARD PRACTICE MANUAL, MAXIMIZING SALES THROUGH EXCELLENT CUSTOMER SERVICE.\n\nDUTIES AND RESPONSIBILITIES\n\n SMILE AND PROVIDE PROMPT, ACCURATE AND FRIENDLY SERVICE WHILE ENGAGING CUSTOMERS TO CREATE A POSITIVE SHOPPING EXPERIENCE GREET EACH CUSTOMER AND USES HIS OR HER NAME WHENEVER POSSIBLE UNLOAD CUSTOMERS’ GROCERIES FROM CART TO BELT-UNLOAD ITEMS FOR EASE OF BAGGING SUCH AS GROUPING COLD ITEMS TOGETHER CHECK THE BOTTOM OF EVERY CART AND UNDER ALL BABY SEATS FOR ITEMS BEFORE COMPLETING AN ORDER FOLLOW CORRECT BAGGING PROCEDURES FOR THE CORRECT USE OF BAGS BY TYPE SCAN CUSTOMERS' ORDER AND HANDLES THE PAYMENT TRANSACTION, PER STANDARD PRACTICE AVOID PERSONAL CONVERSATIONS WITH OTHER ASSOCIATES WHEN CUSTOMERS ARE PRESENT FOLLOW PROCEDURES IN HANDLING CASH, CHECKS, COUPONS, GIFT CARDS, PARTNER CARDS, FOOD STAMPS AND WIC VOUCHERS FOLLOW PROCEDURES FOR REFUNDS AND ERROR CORRECTION MAKE EVERY ATTEMPT TO MAINTAIN ACCURATE CASH CONTROL FOLLOW PROCEDURES AND PERFORMS OVERRIDES IDENTIFY CUSTOMERS NEEDING ASSISTANCE AND OFFERS TO TAKE THE CUSTOMER’S ORDER TO THEIR CAR MAINTAIN ALERTNESS AND CALLS FOR ASSISTANCE WHEN NEEDED TO SERVICE CUSTOMERS PER SERVICE STANDARDS CHECK PRICES QUICKLY AND ACCURATELY IS COURTEOUS AND HELPFUL TO OTHER ASSOCIATES WEAR THE FOOD LION UNIFORM WITH APRON, COMPLETE WITH NAME BADGE, WHEN ON DUTY, HAS A NEAT AND CLEAN APPEARANCE WHILE ADHERING TO THE FOOD LION DRESS CODE RETRIEVE SHOPPING CARTS FROM THE PARKING LOT AND CART CORRALS UTILIZING THE TETHER STRAP PER STANDARD PRACTICE ENSURE WORK STATION AND FRONT END AREA OF THE STORE HAS A NEAT AND CLEAN PRESENTATION REPORT ANY REGISTER MALFUNCTION TO THE CUSTOMER SERVICE MANAGER OR MOD ENSURE THE MVP SAVINGS CENTER KIOSK IS FILLED WITH PAPER AND PROPERLY WORKING ADHERE TO ALL COMPANY GUIDELINES, POLICIES AND STANDARD PRACTICES OBSERVE AND CORRECT ALL UNSAFE CONDITIONS THAT COULD CAUSE ASSOCIATE OR CUSTOMER ACCIDENTS NOTIFY QA OF ANY CLEANING ISSUES OR MAINTENANCE REQUIRED ON FRONT END SUCCESSFULLY COMPLETE COMPUTER BASED TRAINING (CBT) AND TRAINING AID COURSES PERFORM ALL OTHER DUTIES AS ASSIGNED\n\nQUALIFICATIONS\n\n HIGH SCHOOL GRADUATE OR EQUIVALENT PREFERRED EFFECTIVE COMMUNICATION AND CUSTOMER SERVICE SKILLS ABILITY AND WILLINGNESS TO LEARN MULTIPLE TASKS AND TECHNICAL REQUIREMENTS OF THE JOB ABILITY TO PERFORM THE TECHNICAL REQUIREMENTS OF CASHIER AND SERVICE CENTER MUST MEET MINIMUM AGE REQUIREMENTS TO PERFORM SPECIFIC JOB FUNCTIONS MUST BE ABLE TO MEET THE PHYSICAL REQUIREMENTS OF THE POSITION, WITH OR WITHOUT REASONABLE ACCOMMODATIONS\n\nPHYSICAL REQUIREMENTS\n\n ABILITY TO USE COMPUTERS AND OTHER COMMUNICATION SYSTEMS REQUIRED TO PERFORM JOB FUNCTIONS PERFORM REPETITIVE HAND AND ARM MOTIONS BEND AND LIFT PRODUCTS WEIGHING UP TO 15 LBS. CONTINUOUSLY, 25 LBS. FREQUENTLY, AND 50 LBS. ON OCCASION PULL OR PUSH UP TO 75 LBS. ON OCCASION STAND 100% OF THE TIME, FREQUENTLY WALKING SHORT DISTANCES BE ABLE TO HANDLE A VARIETY OF SUBSTANCES ASSOCIATED WITH CLEANING AND PACKAGING MATERIALS, FRESH FRUITS, VEGETABLES, HOUSE PLANTS/FLOWERS AND HOUSEHOLD CLEANERS USE HANDS TO FREQUENTLY/CONTINUOUSLY HANDLE CURRENCY (PAPER AND COIN) AS WELL AS OPERATE A VARIETY OF EQUIPMENT SUCH AS CASH REGISTER, LOTTERY MACHINE (WHERE APPLICABLE), SCANNER, COMPUTER, AND CALCULATOR FREQUENT REACHING AND GRASPING AT WAIST LEVEL: OCCASIONALLY ABOVE SHOULDER OR BELOW WAIST LEVEL MEET ESTABLISHED VOLUME ACTIVITY STANDARDS FOR THE POSITION TOLERATE WORKING IN EXTREME HOT/COLD TEMPERATURES FOR UP TO 20 MINUTES AT A TIME HAVE SUFFICIENT VISUAL ABILITY TO CHECK ID CARDS, CHECKS, INVOICES AND OTHER WRITTEN DOCUMENTS BOTTLES WHERE APPLICABLE: MOVE EMPTY BOTTLES AND CONTAINERS FROM THE FRONT END TO THE BACK ROOM\n\nFOOD LION PROVIDES EQUAL EMPLOYMENT OPPORTUNITIES TO ALL ASSOCIATES AND APPLICANTS FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX (INCLUDING PREGNANCY, CHILDBIRTH AND RELATED CONDITIONS) NATIONAL ORIGIN, AGE, DISABILITY, SEXUAL ORIENTATION, VETERAN STATUS, GENDER IDENTITY OR GENDER EXPRESSION OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW.\n\nJOB REQUISITION: 374311_EXTERNAL_USA-NC-RALEIGH",
    "job_skill_set": [
      "cash handling",
      "customer service",
      "computer skills",
      "payment processing",
      "product knowledge",
      "communication",
      "teamwork",
      "problem solving",
      "attention to detail",
      "adaptability",
      "courtesy",
      "time management",
      "point of sale systems",
      "bagging procedures"
    ],
    "short_keywords": [
      "adaptability",
      "associate",
      "attention",
      "bagging",
      "cash",
      "cashier",
      "communication",
      "computer",
      "courtesy",
      "customer",
      "detail",
      "handling",
      "knowledge",
      "management",
      "of",
      "payment",
      "point",
      "problem",
      "procedures",
      "processing",
      "product",
      "pt",
      "sale",
      "sales",
      "service",
      "skills",
      "solving",
      "systems",
      "teamwork",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3901675214",
    "job_title": "Sales Consultant",
    "category": "SALES",
    "job_description": "WE ARE LOOKING FOR INDIVIDUALS WHO ARE EAGER TO DEVELOP AND APPLY THEIR SKILLS IN WAYS THAT MAKE A POSITIVE IMPACT TO COMMUNITIES. HERE, YOU’LL BE PROUD TO BE A PART OF A COMPANY KNOWN FOR PUTTING SAFETY AND PEOPLE FIRST, COMBINED WITH UNCOMPROMISING INTEGRITY.\n\nJOB DESCRIPTION\n\nAS A SALES CONSULTANT, YOU BE RESPONSIBLE FOR SELLING PRODUCT LINES TO RESIDENTIAL AND LIGHT COMMERCIAL ACCOUNTS. IDEAL CANDIDATE WILL HAVE EXPERIENCE IN SALES IN THE CONSTRUCTION INDUSTRY AND WILL BE SOMEONE WHO IS MOTIVATED AND AGGRESSIVE IN FINDING NEW ACCOUNTS AND BUILDING TRUSTED RELATIONSHIPS.\n\nHERE IS A GLIMPSE OF WHAT YOU WILL DO\n\n IDENTIFY PROSPECTIVE CUSTOMERS AND CONSISTENTLY GENERATE AND FOLLOW UP ON LEADS. CONDUCT DAILY SALES CALLS, PROVIDE PROPOSALS, GENERATE NEW BUSINESS LEADS AND MANAGE ACCOUNTS. PROVIDE PRODUCT KNOWLEDGE AND EXPERTISE TO CUSTOMERS, RECOMMENDING MATERIALS AND SERVICES BASED ON CUSTOMERS’ NEEDS AND INTERESTS. UNDERSTAND THE MARKET THAT YOU SERVE, MONITOR MARKET CONDITIONS, PRODUCT INNOVATIONS AND COMPETITORS’ PRODUCTS, PRICES AND SALES. MEET MONTHLY SALES TARGETS. COMMUNICATE COMPANY SAFETY PROGRAM TO CUSTOMERS AT THE INCEPTION OF SALE BY INSPECTING JOB SITES TO IDENTIFY ANY SAFETY CONCERNS. MANAGES CUSTOMER EXPERIENCE FROM INITIAL SALE TO PROJECT COMPLETION.\n\nHERE IS SOME OF WHAT YOU WILL NEED (REQUIRED)\n\n 3+ YEARS OF SALES EXPERIENCE IN BUILDING PRODUCTS/CONSTRUCTION MUST BE A MIN OF 18 YEARS OF AGE AND HAVE A VALID DRIVER’S LICENSE. CLEAR POST OFFER DRUG SCREEN.\n\nTHIS IS A SAFETY SENSITIVE POSITION.\n\nWHAT WE OFFER\n\n BASE + COMMISSIONS. PAID HOLIDAY AND PAID TIME OFF. MEDICAL, DENTAL AND VISION. 401K MATCHING. LIFE & DISABILITY INSURANCE. EMPLOYEE PURCHASE AND ASSISTANCE PLANS.\n\nTOPBUILD CORP. IS AN EQUAL OPPORTUNITY EMPLOYER. EOE PROTECTED VETERANS/DISABILITY. TOPBUILD CORP. (NYSE: BLD) IS THE LEADING INSTALLER AND DISTRIBUTOR OF INSULATION AND BUILDING MATERIAL SERVICES NATIONWIDE. WITH OVER 220+ TRUTEAM AND 75+ SERVICE PARTNERS LOCATIONS ACROSS THE UNITED STATES, THERE ARE A VARIETY OF CAREER OPPORTUNITIES AWAITING YOU!",
    "job_skill_set": [
      "sales experience",
      "lead generation",
      "account management",
      "product knowledge",
      "market analysis",
      "customer service",
      "motivation",
      "relationship building",
      "communication",
      "problem solving",
      "teamwork",
      "adaptability",
      "construction industry knowledge",
      "safety program communication",
      "proposal generation",
      "aggressiveness"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "aggressiveness",
      "analysis",
      "building",
      "communication",
      "construction",
      "consultant",
      "customer",
      "experience",
      "generation",
      "industry",
      "knowledge",
      "lead",
      "management",
      "market",
      "motivation",
      "problem",
      "product",
      "program",
      "proposal",
      "relationship",
      "safety",
      "sales",
      "service",
      "solving",
      "teamwork"
    ]
  },
  {
    "job_id": "3889719558",
    "job_title": "Retail Sales Associate",
    "category": "SALES",
    "job_description": "WHEN YOU JOIN VERIZON\n\nVERIZON IS ONE OF THE WORLD'S LEADING PROVIDERS OF TECHNOLOGY AND COMMUNICATIONS SERVICES, TRANSFORMING THE WAY WE CONNECT AROUND THE WORLD. WE'RE A HUMAN NETWORK THAT REACHES ACROSS THE GLOBE AND WORKS BEHIND THE SCENES. WE ANTICIPATE, LEAD, AND BELIEVE THAT LISTENING IS WHERE LEARNING BEGINS. IN CRISIS AND IN CELEBRATION, WE COME TOGETHER-LIFTING UP OUR COMMUNITIES AND STRIVING TO MAKE AN IMPACT TO MOVE THE WORLD FORWARD. IF YOU'RE FUELED BY PURPOSE, AND POWERED BY PERSISTENCE, EXPLORE A CAREER WITH US. HERE, YOU'LL DISCOVER THE RIGOR IT TAKES TO MAKE A DIFFERENCE AND THE FULFILLMENT THAT COMES WITH LIVING THE #NETWORKLIFE.\n\nWHAT YOU'LL BE DOING...\n\nAS A FULL-TIME VERIZON RETAIL SALES ASSOCIATE, YOU'LL HAVE THE OPPORTUNITY TO GROW YOUR CAREER WITH A TEAM FOCUSED ON UNLOCKING YOUR FULL POTENTIAL AND SALES SUCCESS WITHIN ONE OF OUR RETAIL STORES. HERE'S WHAT YOU CAN EXPECT:GENERATE RETAIL SALES BY USING YOUR PASSION FOR CUTTING-EDGE TECHNOLOGY, AND EXCEPTIONAL CUSTOMER SERVICE TO EXPAND THE VERIZON NETWORK.\nLEARN AND UNCOVER CUSTOMERS' NEEDS BY CREATING CONNECTIONS AND ASKING THE RIGHT QUESTIONS.\nPOSITION PRODUCT INSIGHTS AND SOLUTION RECOMMENDATIONS TO PROVIDE CUSTOMERS WITH A COMPLETE TOP-DOWN SALES SOLUTION.\nCLOSE SALES BY USING PHENOMENAL COMMUNICATION SKILLS TO FULFILL CUSTOMER NEEDS WITH SIMPLE AND INTUITIVE TECH SOLUTIONS. \nCONTINUOUSLY DEVELOP YOURSELF THROUGH ONGOING TRAINING AND UP-SKILL IN OPERATIONAL FUNCTIONS ACROSS MERCHANDISING AND INVENTORY.\nPOTENTIAL TO GROW YOUR CUSTOMER BASE BY PLACING OUTBOUND CALLS AND SENDING TEXT MESSAGES TO CURRENT VERIZON CUSTOMERS WHO ARE INTERESTED IN OUR PRODUCTS AND SERVICES.\nOPPORTUNITIES TO ENGAGE WITH THE COMMUNITY OUTSIDE OF THE STORE TO EXPAND YOUR LOYAL CUSTOMER BASE, INCLUDING AT OFF-SITE VERIZON SPONSORED EVENTS.\n\nJOIN VERIZON TODAY AND BE ELIGIBLE FOR A $2,500 SIGN-ON BONUS! (SUBJECT TO THE TERMS AND CONDITIONS OF THE AWARD)\n\nWE'RE HIRING IMMEDIATELY AND THIS ISN'T YOUR AVERAGE ENTRY-LEVEL POSITION! WHETHER YOU'RE EARLY IN YOUR CAREER OR A SEASONED SALES PROFESSIONAL, JOIN TODAY AND EARN FROM $49,000 TO $59,000 A YEAR, WHICH INCLUDES BASE PAY AND TARGET INDIVIDUAL-BASED COMMISSION. PLANNING TO GO ABOVE AND BEYOND? OUR COMMISSION PROGRAM ALLOWS UNLIMITED OPPORTUNITY WHICH COULD ALLOW TOP EARNERS TO MAKE AN EXTRA $10,000 OR MORE PER YEAR IN ADDITION TO THE COMPENSATION RANGE QUOTED EARLIER. COMPENSATION VARIES BY GEOGRAPHY AND PERFORMANCE.\n\nOUR COMPREHENSIVE BENEFITS (STARTING DAY ONE) AND PERKS ARE DESIGNED TO HELP YOU MOVE FORWARD IN YOUR CAREER AND IN YOUR LIFE OUTSIDE OF VERIZON. FROM HEALTH AND WELL-BEING BENEFITS TO INVESTMENT IN YOUR EDUCATION AND CAREER, WE'VE GOT YOU COVERED!\nBEST IN CLASS MEDICAL, DENTAL, AND VISION\nVERIZON 401(K) PLAN WITH MATCHING CONTRIBUTIONS UP TO 6% OF ELIGIBLE PARTICIPANT CONTRIBUTIONS TO THE PLAN, QUALIFIED STUDENT LOAN REPAYMENTS, OR A COMBINATION OF BOTH (EFFECTIVE JANUARY 1, 2024)\n$2,500 STOCK GRANT PER YEAR, PART OF VERIZON'S STOCK TOGETHER AWARD PROGRAM\nSALES RECOGNITION PROGRAMS THAT HAVE, IN THE PAST, AWARDED TOP PERFORMERS WITH ALL INCLUSIVE TRAVEL TO DOMESTIC AND INTERNATIONAL DESTINATIONS, GIFTS, AND OTHER INCENTIVES\nFIVE WEEKS OF PAID TIME OFF (VACATION, HOLIDAYS, PERSONAL DAYS)\n8 WEEKS OF PAID PARENTAL LEAVE FOR ELIGIBLE NEW PARENTS (FOR NEW MOMS, WHEN PAIRED WITH SHORT-TERM DISABILITY, THIS BENEFIT PROVIDES UP TO 16 WEEKS OF PAID TIME-OFF)\nUP TO $8K PER YEAR IN TUITION ASSISTANCE\nDISCOUNTS UP TO 50% OFF ON VERIZON PRODUCTS AND SERVICES\nADDITIONAL EMPLOYEE DISCOUNTS ON ATTRACTIONS, AUTOMOTIVE, TRAVEL AND MORE.\n\nTOO GOOD TO BE TRUE? HEAR FROM OUR VERIZON RETAIL TEAM MEMBERS ON WHAT IT'S LIKE TO BE PART OF A TEAM THAT INVESTS IN YOU. FROM OUR IN-PERSON NEW HIRE EXPERIENCE AND AWARD-WINNING TRAINING PROGRAMS TO OUR INCLUSIVE CULTURE OF LEARNING AND AMAZING BENEFITS, YOU'LL BE ABLE TO APPLY YOUR SKILLS WHILE ELEVATING YOUR CAREER.\n\nWHAT WE'RE LOOKING FOR...\n\nYOU'LL NEED TO HAVE:HIGH SCHOOL DIPLOMA OR GED.\nONE OR MORE YEARS OF WORK EXPERIENCE.\nWILLINGNESS TO WORK EVENINGS, WEEKENDS, AND HOLIDAYS (YOU'LL KNOW YOUR SCHEDULE FOUR WEEKS IN ADVANCE).\nOPENNESS TO PICK UP ADDITIONAL SHIFTS AND EARN MORE INCOME, TYPICALLY DURING THE SUMMER MONTHS, NOVEMBER THROUGH DECEMBER, AND/OR DURING PEAK VACATION PERIODS. \n\nEVEN BETTER IF YOU HAVE ONE OR MORE OF THE FOLLOWING:EXPERIENCE WORKING IN A COMMISSION-BASED ENVIRONMENT.\nDEMONSTRATED SALES EXPERIENCE COMMUNICATING WITH CUSTOMERS TO FIND SOLUTIONS. \nCUSTOMER SERVICE EXPERIENCE.\n\nIF VERIZON AND THIS ROLE SOUND LIKE A FIT FOR YOU, WE ENCOURAGE YOU TO APPLY EVEN IF YOU DON'T MEET EVERY \"EVEN BETTER\" QUALIFICATION LISTED ABOVE. \n\nAFTER YOU APPLY...\n\nYOU MAY BE REQUIRED TO TAKE AN ASSESSMENT. IT TAKES ABOUT 20 MINUTES TO COMPLETE. IF YOU'RE SELECTED TO MOVE FORWARD, ONE OF OUR RECRUITERS WILL REACH OUT TO TELL YOU MORE ABOUT THE ROLE AND ANSWER YOUR QUESTIONS.\n\nWHERE YOU'LL BE WORKING\n\nIN THIS WORKSITE-BASED ROLE, YOU'LL WORK ONSITE AT A DEFINED LOCATION(S).\n\nSCHEDULED WEEKLY HOURS\n40\n\nEQUAL EMPLOYMENT OPPORTUNITY\n\nWE'RE PROUD TO BE AN EQUAL OPPORTUNITY EMPLOYER - AND CELEBRATE OUR EMPLOYEES' DIFFERENCES, INCLUDING RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, AGE, DISABILITY, AND VETERAN STATUS. AT VERIZON, WE KNOW THAT DIVERSITY MAKES US STRONGER. WE ARE COMMITTED TO A COLLABORATIVE, INCLUSIVE ENVIRONMENT THAT ENCOURAGES AUTHENTICITY AND FOSTERS A SENSE OF BELONGING. WE STRIVE FOR EVERYONE TO FEEL VALUED, CONNECTED, AND EMPOWERED TO REACH THEIR POTENTIAL AND CONTRIBUTE THEIR BEST. CHECK OUT OUR DIVERSITY AND INCLUSION PAGE TO LEARN MORE.",
    "job_skill_set": [
      "sales",
      "customer service",
      "communication",
      "technology",
      "merchandising",
      "inventory management",
      "outbound calling",
      "teamwork",
      "problem solving",
      "adaptability",
      "persistence",
      "community engagement",
      "learning orientation",
      "text messaging"
    ],
    "short_keywords": [
      "adaptability",
      "associate",
      "calling",
      "communication",
      "community",
      "customer",
      "engagement",
      "inventory",
      "learning",
      "management",
      "merchandising",
      "messaging",
      "orientation",
      "outbound",
      "persistence",
      "problem",
      "retail",
      "sales",
      "service",
      "solving",
      "teamwork",
      "technology",
      "text"
    ]
  },
  {
    "job_id": "3888956348",
    "job_title": "Real Estate Sales Agent",
    "category": "SALES",
    "job_description": "NC LICENSED REAL ESTATE SALES AGENT\n\nWE'RE LOOKING FOR AN EXPERIENCED REAL ESTATE SALES AGENT WITH AN ACTIVE NC REAL ESTATE LICENSE OR IN THE PROCESS OF OBTAINING ONE.\n\nOPPORTUNITY TO LEVERAGE A PROVEN SYSTEM WITH A DEDICATED CLOSING TEAM HANDLING DEAL LOGISTICS FROM START TO FINISH.\n\nSAVE VALUABLE TIME WITH OUR EFFICIENT CLOSING PROCESSES, ALLOWING YOU TO FOCUS ON INCREASING TRANSACTION VOLUME.\n\nACCESS CUTTING-EDGE TOOLS, AI TECHNOLOGY, AND SUPPORT TO BOOST SALES AND ACHIEVE YOUR GOALS.\n\nDEMONSTRATED COMMITMENT CAN LEAD TO BENEFITS LIKE REVENUE SHARING, HEALTH COVERAGE, AND STOCK OPTIONS.\n\nJOIN TEAM RUBY, SUPPORTED BY PLACE AND OUR PROVEN MODEL, FOR A REWARDING CAREER OPPORTUNITY IN THE TRIANGLE AREA IN A DRAM FREE FAMILY ATMOSPHERE.\n\nALL APPLICATIONS WILL BE TREATED WITH STRICT CONFIDENTIALITY.\n\nCOMPENSATION\n\n$125,000 - $250,000 AT PLAN YEARLY\n\nRESPONSIBILITIES\n\nWHAT YOU’LL DO\n\nEXECUTE A LEAD GENERATION LEVER CONDUCT OPEN HOUSES MONTHLY CONVERT PROSPECTS AND LEAD GEN ACTIVITIES TO APPOINTMENTSPARTICIPATE IN SCRIPT PRACTICE PER TEAM STANDARDSPARTICIPATE IN TEAM ACTIVITIES PER TEAM STANDARDSCOMMIT TO 11 COACHING SESSIONS AND TRAININGCONSULT WITH SELLERS & BUYERS TO CONVERT TO LISTINGSDEMONSTRATE EXPERTISE IN PRICING STRATEGIESCONSULT WITH BUYERS, CONVERT WITH SIGNED BUYER AGREEMENTSNEGOTIATE OFFERS ON BEHALF OF YOUR SELLERS AND BUYERSATTEND AND PROMOTE CLIENT EVENTSKEEP YOUR TASK IN CRM UPDATED\n\nQUALIFICATIONS\n\nSKILLS YOU HAVE\n\nTEAM PLAYERLICENSED REAL ESTATE PROFESSIONAL2+ YEARS’ OF REAL ESTATE SALES EXPERIENCESTRONG WRITTEN AND VERBAL COMMUNICATION SKILLSLEARNING-BASED, GROWTH-MINDED ORGANIZEDWILLINGNESS TO LEARN SCRIPTS AND DIALOGUES EXCELLENT TIME MANAGEMENT SKILLSWILLING TO LEARN NEW AND IMPROVED METHODS AND SYSTEMSGREAT LISTENERABLE TO CONNECT WITH PEOPLE QUICKLYWILLINGNESS TO BE ON TIMEATTENTION TO DETAILGENERAL KNOWLEDGE OF THE AREA\n\nABOUT COMPANY\n\nWHY TEAM RUBY\n\nWE ARE FOCUSED ON PROVIDING YOU WITH THE PROVEN PATH TO INCREASE REAL ESTATE PRODUCTION, DRIVE PROFITABILITY, AND LIVE A BIG LIFE MADE POSSIBLE THROUGH WEALTH BUILDING AND TIME MASTERY. OUR HOME SERVICES AND TECHNOLOGY PLATFORMS EMPOWER YOU TO BUILD LIFELONG RELATIONSHIPS WITH CONSUMERS FROM THEIR FIRST REAL ESTATE PURCHASE THROUGH EVERY PIECE OF PROPERTY THEY BUY IN THEIR LIFETIME. WE ARE FOCUSED ON HELPING OTHERS MANAGE AND GROW WEALTH THROUGH REAL ESTATE THROUGH EDUCATION, TECH, AND WEALTH MANAGEMENT SKILLS. WE ARE FOCUSED ON PROVIDING YOU WITH THE PROVEN PATH TO INCREASE REAL ESTATE PRODUCTION, DRIVE PROFITABILITY, AND LIVE A BIG LIFE MADE POSSIBLE THROUGH WEALTH BUILDING AND TIME MASTERY. OUR HOME SERVICES AND TECHNOLOGY PLATFORMS EMPOWER YOU TO BUILD LIFELONG RELATIONSHIPS WITH CONSUMERS FROM THEIR FIRST REAL ESTATE PURCHASE THROUGH EVERY PIECE OF PROPERTY THEY BUY IN THEIR LIFETIME.\n\n1\n\n",
    "job_skill_set": [
      "CRM Software",
      "Negotiation",
      "Time Management",
      "Team Player",
      "Communication",
      "Organizational Skills",
      "Willingness to Learn",
      "Attention to Detail",
      "Listening Skills",
      "Growth Mindset",
      "Client Relationship Management",
      "NC Real Estate License",
      "Real Estate Sales Experience",
      "Lead Generation",
      "Pricing Strategies",
      "AI Technology"
    ],
    "short_keywords": [
      "agent",
      "ai",
      "attention",
      "client",
      "communication",
      "crm",
      "detail",
      "estate",
      "experience",
      "generation",
      "growth",
      "lead",
      "learn",
      "license",
      "listening",
      "management",
      "mindset",
      "nc",
      "negotiation",
      "organizational",
      "player",
      "pricing",
      "real",
      "relationship",
      "sales",
      "skills",
      "software",
      "strategies",
      "team",
      "technology",
      "time",
      "to",
      "willingness"
    ]
  },
  {
    "job_id": "3904426903",
    "job_title": "Sales Account Manager",
    "category": "SALES",
    "job_description": "BAKERSFIELD, CALIFORNIA\n\nSALES ACCOUNT MANAGER\n\nPAY FROM $75,000 TO $95,000 PER YEAR\n\nSTRONG CUSTOMER RELATIONSHIPS BUILT ON TRUST - THAT’S THE FOUNDATION OF ULINE’S SALES CULTURE! AS A SALES ACCOUNT MANAGER, BUILD OUT YOUR TERRITORY SUPPORTED BY THE BEST TRAINING, TOOLS AND PRODUCT OFFERING TO WIN IN THE FIELD EVERY DAY! ULINE CONTINUES TO GROW, CREATING NEW CAREER OPPORTUNITIES AND JOB STABILITY YOU CAN COUNT ON.\n\nACCOUNT MANAGERS CAN BE BASED ANYWHERE WITHIN YOUR SALES TERRITORY, WITH REGULAR VISITS TO YOUR ULINE BRANCH / SALES OFFICE.\n\nWHY SALES AT ULINE?\n\nSUCCESS FROM THE START - YOU’LL GET 4 WEEKS OF TRAINING FOLLOWED BY A 12-WEEK MENTORSHIP PROGRAM ALONG WITH WEEKLY LEARNING AND STRATEGY MEETINGS WITH LEADERSHIP.“CEO” OF YOUR TERRITORY - MANAGE ACCOUNTS IN ALL INDUSTRIES WITH OPPORTUNITIES TO TRAVEL TO NEW MARKETS.DESIGN YOUR DAY - SPEND MONDAYS IN THE OFFICE ALONGSIDE YOUR PEERS, PLANNING YOUR WEEK WITH WORK-LIFE BALANCE IN MIND. YOU’LL MAKE FACE-TO-FACE CUSTOMER VISITS TUESDAY - FRIDAY.\n\nPOSITION RESPONSIBILITIES\n\nMANAGE AND GROW EXISTING ACCOUNTS AS WELL AS BRING IN NEW BUSINESS WITHIN YOUR TERRITORY.PROVIDE EFFECTIVE BUSINESS SOLUTIONS AT ANNUAL, ON-SITE CUSTOMER CONSULTATIONS, INCLUDING RECOMMENDATIONS FROM OUR CATALOG OF OVER 40,000 QUALITY PRODUCTS.DELIVER LEGENDARY CUSTOMER SERVICE WITH THE HELP OF OUR SALES SUPPORT TEAM.\n\nMINIMUM REQUIREMENTS\n\nBACHELOR’S DEGREE.PREVIOUS SALES EXPERIENCE PREFERRED, BUT OUR THOROUGH TRAINING WILL SUPPORT YOU TO WIN EVERY DAY!VALID DRIVER’S LICENSE AND GREAT DRIVING RECORD.EXCELLENT COMMUNICATION, PROBLEM-SOLVING AND PRESENTATION SKILLS.\n\nBENEFITS\n\nCOMPLETE INSURANCE COVERAGE THAT INCLUDES MEDICAL, DENTAL, VISION AND MORE.401(K) WITH 6% EMPLOYER MATCH.PAID HOLIDAYS AND GENEROUS PAID TIME OFF.BONUS PROGRAMS THAT INCLUDE ANNUAL PERFORMANCE, PROFIT SHARING, SALES GOALS, CONTESTS AND TOP PERFORMER INCENTIVES.TUITION ASSISTANCE PROGRAM THAT COVERS PROFESSIONAL CONTINUING EDUCATION.MONTHLY INTERNET / CELL PHONE ALLOWANCE.CAR MILEAGE REIMBURSEMENT.AS OUR COMPANY EXPANDS, YOU’LL HAVE THE CHANCE TO TRANSITION TO NEW MARKETS, AND WE’LL PROVIDE SUPPORT FOR YOUR MOVE.\n\nABOUT ULINE\n\nULINE IS NORTH AMERICA'S LEADING DISTRIBUTOR OF SHIPPING, INDUSTRIAL AND PACKAGING MATERIALS. WE'RE A FAMILY-OWNED COMPANY KNOWN FOR INCREDIBLE SERVICE, QUALITY PRODUCTS AND SAME-DAY SHIPPING OF OUR HUGE IN-STOCK INVENTORY. WITH OVER 9,000 EMPLOYEES ACROSS 13 BRANCH LOCATIONS AND 15 SALES OFFICES, IT'S TIME YOU JOINED ULINE.\n\nULINE IS PROUD TO OPERATE AS A DRUG-FREE WORKPLACE. ALL NEW HIRES MUST COMPLETE A PRE-EMPLOYMENT HAIR FOLLICLE DRUG SCREENING.\n\nEEO/AA EMPLOYER/VET/DISABLED\n\n(#IN-CASLS)\n\nOUR EMPLOYEES MAKE THE DIFFERENCE AND WE ARE COMMITTED TO OFFERING EXCEPTIONAL BENEFITS AND PERKS! EXPLORE ULINE.JOBS TO LEARN MORE!\n\n",
    "job_skill_set": [
      "sales",
      "customer service",
      "presentation skills",
      "bachelor's degree",
      "training",
      "communication",
      "relationship building",
      "time management",
      "teamwork",
      "leadership",
      "account management",
      "problem-solving",
      "business solutions",
      "valid driver's license",
      "consultation",
      "adaptability",
      "strategic planning",
      "negotiation",
      "self-motivation",
      "work-life balance"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "bachelors",
      "balance",
      "building",
      "business",
      "communication",
      "consultation",
      "customer",
      "degree",
      "drivers",
      "leadership",
      "license",
      "management",
      "manager",
      "negotiation",
      "planning",
      "presentation",
      "problemsolving",
      "relationship",
      "sales",
      "selfmotivation",
      "service",
      "skills",
      "solutions",
      "strategic",
      "teamwork",
      "time",
      "training",
      "valid",
      "worklife"
    ]
  },
  {
    "job_id": "3886466751",
    "job_title": "NetSuite Sales Account Manager - Mountain",
    "category": "SALES",
    "job_description": "JOB DESCRIPTION\n\nABOUT ORACLE NETSUITE\n\nFOUNDED IN 1998, ORACLE NETSUITE WAS THE FIRST CLOUD COMPANY – USHERING IN THE NEW ERA OF CLOUD COMPUTING. NETSUITE’S MISSION IS TO DELIVER ONE SYSTEM, THE SUITE, THAT GIVES LEADERS A COMPLETE VIEW INTO THEIR BUSINESS.\n\nAS THE LEADING PROVIDER OF A FULL, CLOUD-BASED ERP SUITE, INCLUDING FINANCIALS, INVENTORY MANAGEMENT, HR, PROFESSIONAL SERVICES AUTOMATION, AND OMNICHANNEL COMMERCE MODULES, NETSUITE GIVES BUSINESSES THE VISIBILITY, AGILITY, AND CONTROL NEEDED TO GROW.\n\nAS AN EMPLOYEE OF THE FIRST CLOUD COMPANY WITH A 25-YEAR PROVEN TRACK RECORD, YOU’D BE WORKING FOR A TECHNOLOGY COMPANY THAT NOW HAS TENS OF THOUSANDS OF CUSTOMERS FROM AROUND THE GLOBE. AND AS PART OF ORACLE, OUR BENEFITS ARE SECOND TO NONE. BETWEEN HEALTH AND WELLNESS, PREPARING FOR THE FUTURE AND MORE, WE OFFER THE BEST IN GLOBAL BENEFITS.\n\nCLICK HERE TO LEARN MORE ABOUT ORACLE NETSUITE! \n\nWE ARE SEEKING SALES ACCOUNT MANAGERS WITH A SUCCESSFUL BACKGROUND SELLING SOFTWARE, HARDWARE OR BUSINESS SERVICES IN YOUR AREA. YOU’LL MAINTAIN RELATIONSHIPS WITHIN A PORTFOLIO OF NETSUITE CUSTOMERS TO ENSURE THE CONTINUED ADOPTION AND EXPANSION OF NETSUITE’S CLOUD-BASED BUSINESS OPERATIONS SYSTEM, INCLUDING ENTERPRISE RESOURCE PLANNING (ERP), ACCOUNTING, CUSTOMER RELATIONSHIP MANAGEMENT (CRM), PROFESSIONAL SERVICE AUTOMATION (PSA), AND ECOMMERCE. THIS ROLE REQUIRES 3 DAYS PER WEEK IN OFFICE IN A NETSUITE HUB.\n\nAUSTIN, TXBURLINGTON, MACHICAGO, ILDENVER, CONEW YORK CITYSANTA MONICA, CA\n\n\nMORE ABOUT THE OPPORTUNITY:\n\nUPSELL AND CROSS-SELL BUSINESS APPLICATION SOLUTIONS WITHIN AN EXISTING BASE OF NETSUITE CLIENTS.MAINTAIN AND DEVELOP AN ACTIVE PIPELINE OF FORECASTED OPPORTUNITIES TO MEET MONTHLY QUOTA OBJECTIVES WHILE WORKING THROUGH EACH OPPORTUNITY WITH YOUR MANAGER.DRIVE PIPELINE VELOCITY ACTIVITIES, INCLUDING CUSTOMER REFERENCES, COMPLETE QUOTES AND CONTRACT PREPARATION AND EXECUTION.NETWORK INTERNALLY WITH NETSUITE PEERS/LEADERSHIP, VALUE ADDED TEAMS, MARKETING AND ENABLEMENT, ETC. TO INCREASE SALES PERFORMANCE.WORK TO IMPROVE OVERALL CUSTOMER HAPPINESS WITHIN ASSIGNED CUSTOMER ACCOUNTS.ANALYZE CUSTOMERS BUSINESS NEEDS, IDENTIFY STRATEGIC PARTNERSHIP OPPORTUNITIES, AND DEVELOP STRATEGIES TO ENSURE CUSTOMER GROWTH, SATISFACTION, AND RETENTION. LEAD AND DRIVE SALES OPPORTUNITIES THROUGH STRATEGIC SELLING, NEGOTIATE AND CLOSE BUSINESS, AND LEAD THE ONGOING BUSINESS RELATIONSHIP WITH CLIENTS. \n\n\nABOUT YOU:\n\nYOU HAVE A MINIMUM OF 3 YEARS OF SAAS/TECHNOLOGY SALES (OR SIMILAR) AND A DESIRE TO SUCCEED.YOU ARE A REGULAR ON YOUR COMPANY’S TOP PRODUCER’S LIST AND HAVE THE STATS TO BACK IT UP.YOU ARE KNOWN FOR YOUR TREMENDOUS WORK ETHIC, LASER FOCUS, PASSION AND DEDICATION.YOU ENJOY LEARNING ABOUT TECHNOLOGY AND CAN TRANSLATE THAT INTO VALUE FOR CUSTOMERS.YOU’RE RESPONSIVE, ADAPTABLE AND 100% PASSIONATE ABOUT RESULTS AND OWNERSHIP.\n\n\nABOUT THE TEAM:\n\nSTRONG EXPERIENCE WORKING IN COLLABORATIVE, TEAM-BASED ENVIRONMENTS.WE VALUE OUTSTANDING WRITING SKILLS AND A FRIENDLY, THOUGHTFUL, AND EFFECTIVE COMMUNICATION STYLE.WE STRIVE FOR ATTENTION TO DETAIL, EMOTIONAL INTELLIGENCE, AND QUICK TURNAROUND TIMES.WE GET STUFF DONE. AND FAST. \n\n\nDOES THIS SOUND LIKE YOU? IF SO, WE HOPE TO MEET YOU!\n\nCAREER LEVEL - IC2\n\nRESPONSIBILITIES\n\nWORKS TO ACHIEVE MAXIMUM SALES PROFITABILITY, GROWTH, AND ACCOUNT PENETRATION WITHIN AN ASSIGNED TERRITORY. TERRITORY MAY BE COMBINATION OF GEOGRAPHIC, PRODUCT, INDUSTRY AND OTHER CUSTOMER / MARKET DIMENSIONS. SELLS TO THE TERRITORY DIRECTLY OR VIA PARTNERS. THE TERRITORY THAT THIS REP COVERS DOES NOT HAVE AN INSIDE SALES REP OR FIELD REP. UTILIZES INBOUND AND/OR OUTBOUND TECHNIQUES TO IDENTIFY, QUALIFY AND CLOSE NEW OPPORTUNITIES. MANAGES ACCOUNTS THROUGHOUT THE ENTIRE SALES PROCESS, AND COLLABORATES WITH TEAM MEMBERS IN BUSINESS DEVELOPMENT, CONSULTING AND SUPPORT TO UNCOVER ALL CUSTOMER NEEDS. RESPONSIBLE FOR UNDERSTANDING ORACLE'S PRODUCT OFFERINGS AND COMPETITIVE ISSUES TO DEVELOP SOLUTION PROPOSALS ENCOMPASSING ALL ASPECTS OF THE APPLICATION. TRAVELS TO CUSTOMER SITES TO IDENTIFY / DEVELOP SALES OPPORTUNITIES. PARTICIPATES IN THE DEVELOPMENT, PRESENTATION, AND SALES OF A VALUE PROPOSITION. ONSITE CUSTOMER PRESENTATION WITH C-LEVELS TO NEGOTIATE AND CLOSE STRATEGIC AND COMPLEX DEALS. LIAISES WITH CUSTOMER CONTACTS FOR THE PURPOSE OF MANAGING THE CUSTOMER RELATIONSHIP, IDENTIFYING NEW OPPORTUNITIES AND MAXIMIZING SALES.\n\nQUALIFICATIONS\n\nDISCLAIMER:\n\nCERTAIN US CUSTOMER OR CLIENT-FACING ROLES MAY BE REQUIRED TO COMPLY WITH APPLICABLE REQUIREMENTS, SUCH AS IMMUNIZATION AND OCCUPATIONAL HEALTH MANDATES.\n\nRANGE AND BENEFIT INFORMATION PROVIDED IN THIS POSTING ARE SPECIFIC TO THE STATED LOCATIONS ONLY\n\nUS: HIRING RANGE: FROM $26.92 - $43.17 PER HOUR; FROM $56,000 - $89,800 PER YEAR. MAY BE ELIGIBLE FOR EQUITY. ELIGIBLE FOR COMMISSION WITH AN ESTIMATED PAY MIX OF 50 / 50.\n\nORACLE MAINTAINS BROAD SALARY RANGES FOR ITS ROLES IN ORDER TO ACCOUNT FOR VARIATIONS IN KNOWLEDGE, SKILLS, EXPERIENCE, MARKET CONDITIONS AND LOCATIONS, AS WELL AS REFLECT ORACLE’S DIFFERING PRODUCTS, INDUSTRIES AND LINES OF BUSINESS.\n\nCANDIDATES ARE TYPICALLY PLACED INTO THE RANGE BASED ON THE PRECEDING FACTORS AS WELL AS INTERNAL PEER EQUITY.\n\nORACLE US OFFERS A COMPREHENSIVE BENEFITS PACKAGE WHICH INCLUDES THE FOLLOWING:\n\n MEDICAL, DENTAL, AND VISION INSURANCE, INCLUDING EXPERT MEDICAL OPINION SHORT TERM DISABILITY AND LONG TERM DISABILITY LIFE INSURANCE AND AD&D SUPPLEMENTAL LIFE INSURANCE (EMPLOYEE/SPOUSE/CHILD) HEALTH CARE AND DEPENDENT CARE FLEXIBLE SPENDING ACCOUNTS PRE-TAX COMMUTER AND PARKING BENEFITS 401(K) SAVINGS AND INVESTMENT PLAN WITH COMPANY MATCH PAID TIME OFF: FLEXIBLE VACATION IS PROVIDED TO ALL ELIGIBLE EMPLOYEES ASSIGNED TO A SALARIED (NON-OVERTIME ELIGIBLE) POSITION. ACCRUED VACATION IS PROVIDED TO ALL OTHER EMPLOYEES ELIGIBLE FOR VACATION BENEFITS. FOR EMPLOYEES WORKING AT LEAST 35 HOURS PER WEEK, THE VACATION ACCRUAL RATE IS 13 DAYS ANNUALLY FOR THE FIRST THREE YEARS OF EMPLOYMENT AND 18 DAYS ANNUALLY FOR SUBSEQUENT YEARS OF EMPLOYMENT. VACATION ACCRUAL IS PRORATED FOR EMPLOYEES WORKING BETWEEN 20 AND 34 HOURS PER WEEK. EMPLOYEES WORKING FEWER THAN 20 HOURS PER WEEK ARE NOT ELIGIBLE FOR VACATION. 11 PAID HOLIDAYS PAID SICK LEAVE: 72 HOURS OF PAID SICK LEAVE UPON DATE OF HIRE. REFRESHES EACH CALENDAR YEAR. UNUSED BALANCE WILL CARRY OVER EACH YEAR UP TO A MAXIMUM CAP OF 112 HOURS. PAID PARENTAL LEAVE ADOPTION ASSISTANCE EMPLOYEE STOCK PURCHASE PLAN FINANCIAL PLANNING AND GROUP LEGAL VOLUNTARY BENEFITS INCLUDING AUTO, HOMEOWNER AND PET INSURANCE\n\n\nABOUT US\n\nAS A WORLD LEADER IN CLOUD SOLUTIONS, ORACLE USES TOMORROW’S TECHNOLOGY TO TACKLE TODAY’S PROBLEMS. TRUE INNOVATION STARTS WITH DIVERSE PERSPECTIVES AND VARIOUS ABILITIES AND BACKGROUNDS.\n\nWHEN EVERYONE’S VOICE IS HEARD, WE’RE INSPIRED TO GO BEYOND WHAT’S BEEN DONE BEFORE. IT’S WHY WE’RE COMMITTED TO EXPANDING OUR INCLUSIVE WORKFORCE THAT PROMOTES DIVERSE INSIGHTS AND PERSPECTIVES.\n\nWE’VE PARTNERED WITH INDUSTRY-LEADERS IN ALMOST EVERY SECTOR—AND CONTINUE TO THRIVE AFTER 40+ YEARS OF CHANGE BY OPERATING WITH INTEGRITY.\n\nORACLE CAREERS OPEN THE DOOR TO GLOBAL OPPORTUNITIES WHERE WORK-LIFE BALANCE FLOURISHES. WE OFFER A HIGHLY COMPETITIVE SUITE OF EMPLOYEE BENEFITS DESIGNED ON THE PRINCIPLES OF PARITY AND CONSISTENCY. WE PUT OUR PEOPLE FIRST WITH FLEXIBLE MEDICAL, LIFE INSURANCE AND RETIREMENT OPTIONS. WE ALSO ENCOURAGE EMPLOYEES TO GIVE BACK TO THEIR COMMUNITIES THROUGH OUR VOLUNTEER PROGRAMS.\n\nWE’RE COMMITTED TO INCLUDING PEOPLE WITH DISABILITIES AT ALL STAGES OF THE EMPLOYMENT PROCESS. IF YOU REQUIRE ACCESSIBILITY ASSISTANCE OR ACCOMMODATION FOR A DISABILITY AT ANY POINT, LET US KNOW BY CALLING +1 888 404 2494, OPTION ONE.\n\nDISCLAIMER:\n\nORACLE IS AN EQUAL EMPLOYMENT OPPORTUNITY EMPLOYER*. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, NATIONAL ORIGIN, SEXUAL ORIENTATION, GENDER IDENTITY, DISABILITY AND PROTECTED VETERANS’ STATUS, OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW. ORACLE WILL CONSIDER FOR EMPLOYMENT QUALIFIED APPLICANTS WITH ARREST AND CONVICTION RECORDS PURSUANT TO APPLICABLE LAW.\n\n WHICH INCLUDES BEING A UNITED STATES AFFIRMATIVE ACTION EMPLOYER",
    "job_skill_set": [
      "Sales",
      "Customer Relationship Management",
      "Communication",
      "Problem Solving",
      "Work Ethic",
      "Attention to Detail",
      "Customer Focus",
      "SaaS",
      "ERP",
      "CRM",
      "Negotiation",
      "Business Development",
      "Technical Sales",
      "Contract Preparation",
      "Market Analysis",
      "Teamwork",
      "Adaptability",
      "Emotional Intelligence",
      "Responsiveness",
      "Ownership"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "analysis",
      "attention",
      "business",
      "communication",
      "contract",
      "crm",
      "customer",
      "detail",
      "development",
      "emotional",
      "erp",
      "ethic",
      "focus",
      "intelligence",
      "management",
      "manager",
      "market",
      "mountain",
      "negotiation",
      "netsuite",
      "ownership",
      "preparation",
      "problem",
      "relationship",
      "responsiveness",
      "saas",
      "sales",
      "solving",
      "teamwork",
      "technical",
      "to",
      "work"
    ]
  },
  {
    "job_id": "3900938911",
    "job_title": "Sales Lead - White House Black Market",
    "category": "SALES",
    "job_description": "JOIN OUR FASHION-OBSESSED TEAM, DEDICATED TO A STYLING AND SOCIAL EXPERIENCE THAT MAKES WOMEN FEEL BEAUTIFUL.\n\nPOSITION OBJECTIVE\n\nTHE SALES LEAD IS RESPONSIBLE FOR SUPPORTING MANAGEMENT IN IN PROMOTING A CUSTOMER AND PRODUCT-FOCUSED SALES CULTURE, WHERE OUR VALUES AND GUIDING PRINCIPLES ARE AT THE FOREFRONT OF ALL STORE OPERATIONS, INCLUDING GREAT CUSTOMER EXPERIENCE AND MAXIMUM PROFITABILITY. WE LOVE WHAT WE DO, AND BELIEVE THAT WITH OUR TEAMS, WE ARE THE MOST AMAZING PLACE TO WORK, LEARN, AND GROW!\n\nFUNCTIONAL RESPONSIBILITIES\n\nDRIVE FOR RESULTS\n\n ESTABLISHES AND COMMUNICATES CLEAR EXPECTATIONS, HOLDING STORE TEAM AND THEMSELVES ACCOUNTABLE FOR ACHIEVING ALL BRAND, PERFORMANCE, AND BEHAVIOR STANDARDS. PERFORMS AND OVERSEES BASIC OPERATIONAL ACTIVITIES SUCH AS OPENING AND CLOSING DUTIES, AND MERCHANDISE FLOW PROCESSES. SUPERVISES ASSOCIATES ENGAGED IN SALES, INVENTORY RECEIPT, RECONCILING CASH RECEIPTS, OR IN PERFORMING SERVICES FOR CUSTOMERS. UTILIZES WEEKLY SCHEDULES TO ENSURE PROPER FLOOR COVERAGE WITHIN FISCAL GUIDELINES. MAINTAINS KNOWLEDGE OF CURRENT SALES AND PROMOTIONS; PRESENTS AND DISPLAYS MERCHANDISE IN ACCORDANCE WITH CURRENT PROMOTIONS AND STANDARDS. MAINTAINS STANDARDS IN MERCHANDISE HANDLING, PRESENTATION, LOSS PREVENTION, AND ALL OTHER DUTIES AS DIRECTED BY MANAGEMENT. DEVELOPS A HIGH-PERFORMANCE CULTURE, MOTIVATING SALES TEAM TO MEET ASSIGNED SALES AND PRODUCTIVITY GOALS; MEETS PERSONAL SALES GOALS. TRAINS AND COACHES TO ENSURE SELLING TEAM IS FLUENT IN ALL ASPECTS OF PRODUCT KNOWLEDGE ON LINE AND IN STORE. TRAINS, COACHES AND ASSISTS WITH LOCATE FULFILLMENT AND SELLING.\n\nBUILD HIGH PERFORMING TEAMS\n\n MOTIVATES AND INSPIRES STORE TEAM, PROMOTING A SHARED VISION WHILE MODELING CORE VALUES. PROMOTES AN INCLUSIVE, COLLABORATIVE APPROACH TO PROBLEM SOLVING. COMMUNICATES WITH STORE TEAMS AND STORE MANAGEMENT TO EFFECTIVELY LEAD POSITIVE CHANGE. SEEKS PERSONAL DEVELOPMENTAL OPPORTUNITIES AND READILY SOLICITS FEEDBACK TO BUILD LEADERSHIP SKILL SET.\n\nCUSTOMER EXPERIENCE\n\n MODELS, TEACHES, AND PROMOTES THE MOST AMAZING PERSONAL SERVICE (MAPS) PRINCIPLES AND STANDARDS, OFFERING A COHESIVE OMNI CHANNEL EXPERIENCE. MODELS SALES EXPECTATIONS BY UTILIZING VARIOUS TECHNIQUES AND COMMUNICATING PRODUCT KNOWLEDGE TO THE CUSTOMER; RECOMMENDS MERCHANDISE SELECTIONS OR HELPS TO LOCATE OR OBTAIN MERCHANDISE BASED ON CUSTOMER NEEDS AND DESIRES. BUILDS AND MAINTAINS A SOLID CUSTOMER FOLLOWING THROUGH CLIENTELING AND WARDROBING. ENSURES PROMPT RESOLUTION OF CUSTOMER CONCERNS. ENSURES A FAST AND EFFICIENT REGISTER EXPERIENCE, REMAINING CURRENT ON POLICIES REGARDING PAYMENTS, COUPON ACCEPTANCE, RETURNS AND EXCHANGES, SECURITY PRACTICES AND OTHER APPLICABLE OPERATIONS. ENSURES TEAM MAINTAINS CONSISTENT CLIENT COMMUNICATION THROUGH UTILIZATION OF CUSTOMER BOOK, REWARDS PROGRAM PARTICIPATION, AND CUSTOMER CAPTURE SIGN UP.\n\nTALENT\n\n SUPPORTS, IMPLEMENTS, AND PROVIDES FOLLOW-UP FOR ALL TRAINING PROGRAMS, SEMINARS, ETC. ASSISTS IN THE DEVELOPMENT OF STORE ASSOCIATES; INTERPRETS KEY PERFORMANCE INDICATOR REPORTS AND DELIVERS COACHING AS NEEDED; PROVIDES FEEDBACK TO STORE MANAGER FOR ASSOCIATE PERFORMANCE APPRAISALS AND EVALUATIONS. DRIVES ASSOCIATE AND TEAM ENGAGEMENT BY RECOGNIZING AND REWARDING EMPLOYEES FOR OUTSTANDING PERFORMANCE. ENSURES THAT STORE TEAM ADHERES TO ALL EMPLOYMENT PRACTICES AND POLICIES.\n\nOTHER DUTIES AS ASSIGNED.\n\nTHIS POSITION MAY BE FOUND IN MULTIPLE BRANDS. SOME DUTIES MAY VARY FROM BRAND TO BRAND.\n\nQUALIFICATIONS\n\n HIGH SCHOOL DIPLOMA OR EQUIVALENT 1+ YEAR RETAIL OR SALES MANAGEMENT EXPERIENCE PREFERRED MUST BE 18 YEARS OF AGE OR OLDER EXCELLENT COMMUNICATION, VERBAL AND WRITTEN SKILLS EXCELLENT CUSTOMER SERVICE SKILLS ABLE TO LEARN OR ADAPT TO TECHNOLOGY PROVIDED BY THE COMPANY KNOWLEDGE OF ADMINISTRATIVE ASPECTS OF STORE OPERATIONS STRONG ORGANIZATIONAL SKILLS AND ABILITY TO MULTI-TASK IN A FAST-PACED ENVIRONMENT ABLE TO COMMUNICATE WITH CUSTOMERS REGULAR ATTENDANCE IS ESSENTIAL TO THIS POSITION IN ORDER TO ENSURE ADEQUATE COVERAGE TO MEET COMPANY OBJECTIVES. ABILITY TO WORK A FLEXIBLE WORK SCHEDULE, INCLUDING NIGHTS, WEEKENDS, AND HOLIDAYS IS REQUIRED\n\nPHYSICAL REQUIREMENTS\n\n CONSTANT WALKING/STANDING- 67-100% OF 8-HOUR SHIFT OCCASIONAL LIFTING UP TO 50 LBS.- 1-33% OF 8-HOUR SHIFT FREQUENT CLIMBING- 34%-66% OF 8-HOUR SHIFT\n\n3453 HOUSTON PREMIUM OUTLET\n\nCHICO’S FAS, INC. IS AN EQUAL OPPORTUNITY EMPLOYER. WE DO NOT DISCRIMINATE ON THE BASIS OF RACE, COLOR, RELIGION, MARITAL STATUS, AGE, NATIONAL ORIGIN, ANCESTRY, PHYSICAL OR MENTAL DISABILITY, MEDICAL CONDITION, PREGNANCY, CHILDBIRTH AND RELATED MEDICAL CONDITIONS, LACTATION, GENETIC INFORMATION, GENDER, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, MILITARY SERVICE, VETERAN STATUS, OR ANY OTHER CATEGORY PROTECTED UNDER FEDERAL, STATE, OR LOCAL LAW.",
    "job_skill_set": [
      "retail management",
      "customer service",
      "sales techniques",
      "product knowledge",
      "administrative skills",
      "technology adaptation",
      "merchandising",
      "cash handling",
      "inventory management",
      "performance metrics",
      "communication",
      "team leadership",
      "motivation",
      "problem solving",
      "organizational skills",
      "flexibility",
      "customer relationship management",
      "collaboration",
      "feedback reception",
      "time management"
    ],
    "short_keywords": [
      "adaptation",
      "administrative",
      "black",
      "cash",
      "collaboration",
      "communication",
      "customer",
      "feedback",
      "flexibility",
      "handling",
      "house",
      "inventory",
      "knowledge",
      "lead",
      "leadership",
      "management",
      "market",
      "merchandising",
      "metrics",
      "motivation",
      "organizational",
      "performance",
      "problem",
      "product",
      "reception",
      "relationship",
      "retail",
      "sales",
      "service",
      "skills",
      "solving",
      "team",
      "techniques",
      "technology",
      "time",
      "white"
    ]
  },
  {
    "job_id": "3902758415",
    "job_title": "Supervisor, Outside Sales",
    "category": "SALES",
    "job_description": "“AVERAGE TARGET COMPENSATION OF $100K + UNCAPPED INCENTIVES”\n\nJOB SUMMARY\n\nSUPERVISE THE DAILY OPERATIONS OF A GEOGRAPHICALLY ASSIGNED SALES TEAM THAT SELLS TO OUR RESIDENTIAL CUSTOMERS OFFERING BEST-IN-CLASS SERVICES AND SUPPORTING GOALS OF SOLICITING NEW PROSPECTIVE CUSTOMERS.\n\nMAJOR DUTIES AND RESPONSIBILITIES\n\nACTIVELY AND CONSISTENTLY SUPPORT ALL EFFORTS TO SIMPLIFY AND ENHANCE THE CUSTOMER EXPERIENCE.RESPONSIBLE FOR MEETING AND EXCEEDING BUDGETED HEADCOUNT AND SALES GOALS.A CHARISMATIC AND ENTHUSIASTIC LEADER WITH SKILL AND EXPERIENCE IN CREATING EXCITEMENT AND ENERGY, BUILDING AND LEADING TEAMS, AND DEVELOPING SKILLS IN OTHERS.STRONG PROJECT MANAGEMENT SKILLS AND THE ABILITY TO PRIORITIZE MULTIPLE TASKS AND INITIATIVES IN A FAST-PACED ENVIRONMENT.RECRUIT, INTERVIEW, HIRE, AND TRAIN RESIDENTIAL CONNECTIVITY SALES STAFF.SET CLEAR EXPECTATIONS AND HOLD EMPLOYEES ACCOUNTABLE WHEN EXPECTATIONS ARE NOT MET IN A CONSISTENT AND FAIR MANNER.POSSESS THE KNOWLEDGE AND EXPERTISE TO LEAD, GUIDE, AND DEVELOP RESIDENTIAL CONNECTIVITY SALES SPECIALISTS IN THEIR ROLE.IDENTIFY KNOWLEDGE AND TRAINING GAPS WITHIN THE RESIDENTIAL CONNECTIVITY SALES SPECIALIST TEAM AND DEVELOP PLANS TO ADDRESS THEM.BE FAMILIAR WITH REPORTING AND ANALYTICS NECESSARY TO DRIVE AND SUPPORT BUSINESS DECISIONS.COLLABORATE WITH OTHER DEPARTMENTS AND SUPPORT TEAMS TO ACHIEVE GOALS AND OBJECTIVES. WORK ALLOCATED WILL CONSIST OF APPROXIMATELY 60% FIELDWORK AND 40% OFFICE WORK.COACH TO AND FOLLOW CHARTER’S SALES PROCESS.COMMUNICATE TERRITORY ASSIGNMENTS TO RESIDENTIAL CONNECTIVITY SALES SPECIALISTS.MONITOR THE PAYROLL PROCESS AND ENSURE TIMELY AND ACCURATE APPROVAL OF ALL COMMISSION PAYMENTS.HANDLE EMPLOYEE RELATION ISSUES, INCLUDING PERFORMANCE APPRAISALS, COACHING, AND TRAINING.COMPLETES ADMINISTRATIVE TASKS RELATED TO ALL SALES ACTIVITIES AND ENSURES THEIR TEAM DOES THE SAME.HAS A DETAILED UNDERSTANDING OF CHARTERS PRODUCT OFFERINGS AND VALUE PROPOSITION IN THE MARKETS THEY SELL IN.MAINTAINS CURRENT, IN-DEPTH KNOWLEDGE OF THE MARKETPLACE, INCLUDING COMPETITION, AND ENSURES RELATIONSHIPS WITH CUSTOMERS, BUSINESS PARTNERS, AND CO-WORKERS ARE POSITIVE AND PROFESSIONAL.PREPARES REPORTS AS NEEDED.PERFORM OTHER DUTIES AS REQUESTED BY LEADERSHIP.\n\nREQUIRED QUALIFICATIONS\n\nREQUIRED SKILLS/ABILITIES AND KNOWLEDGE\n\nABILITY TO READ, WRITE, SPEAK AND UNDERSTAND THE ENGLISH LANGUAGE.EXCELLENT COMMUNICATION, INTERPERSONAL AND ORGANIZATIONAL SKILLSPOSSESS STRONG TECHNICAL AND COMPUTER SKILLSABILITY TO TRAVEL (INCLUDING DURING INCLEMENT WEATHER) TO AND FROM ASSIGNED TERRITORIES AND COMPANY FACILITIES USING A RELIABLE PERSONAL VEHICLEABILITY TO WORK OUTSIDE FOR EXTENDED PERIODS IN ANY SEASON AND/OR DURING INCLEMENT WEATHERFAMILIARITY WITH COMPUTER OPERATING SYSTEMS, A MYRIAD OF CONSUMER AND COMMERCIAL COMMUNICATIONS DEVICES (E.G., PDAS, SMARTPHONES, ROUTERS, MODEMS, CONVERTERS, AND WIRELESS DEVICES), AND COMPUTER SOFTWARE APPLICATIONSMUST BE ABLE TO WORK NON-TRADITIONAL WORK HOURS SUCH AS EVENINGS AND WEEKENDSVALID DRIVER´S LICENSE, SATISFACTORY DRIVING RECORD WITHIN COMPANY REQUIRED STANDARDS, AND AUTO INSURANCEABILITY TO COMPLETE DOCUMENTATION ACCURATELY.\n\nREQUIRED EDUCATION\n\nBACHELOR´S DEGREE IN BUSINESS OR MARKETING, OR EQUIVALENT WORK EXPERIENCE.\n\nREQUIRED RELATED WORK EXPERIENCE AND NUMBER OF YEARS\n\n2+ YEARS OF OUTSIDE SALES OR RELATED WORK EXPERIENCE.\n\nPREFERRED QUALIFICATIONS\n\nPREFERRED SKILLS/ABILITIES AND KNOWLEDGE\n\nKNOWLEDGE OF DIRECT SALES PRACTICESEXPERIENCE WITH CONSUMER EDUCATION OF PRODUCTS AND SERVICESKNOWLEDGE OF CABLE OR TELECOMMUNICATIONS SERVICES\n\nPREFERRED RELATED WORK EXPERIENCE AND NUMBER OF YEARS\n\nSALES SUPERVISORY EXPERIENCE PREFERRED - 0.5+\n\nWORKING CONDITIONS\n\nFIELD AND OFFICE ENVIRONMENTOUTSIDE FIELD ENVIRONMENT WITH EXPOSURE TO INCLEMENT WEATHERTRAVEL AS REQUIRED\n\nSDT465 2024-32292 2024\n\nHERE, EMPLOYEES DON’T JUST HAVE JOBS, THEY BUILD CAREERS. THAT’S WHY WE BELIEVE IN OFFERING A COMPREHENSIVE PAY AND BENEFITS PACKAGE THAT REWARDS EMPLOYEES FOR THEIR CONTRIBUTIONS TO OUR SUCCESS, SUPPORTS ALL ASPECTS OF THEIR WELL-BEING, AND DELIVERS REAL VALUE AT EVERY STAGE OF LIFE.\n\nA QUALIFIED APPLICANT’S CRIMINAL HISTORY, IF ANY, WILL BE CONSIDERED IN A MANNER CONSISTENT WITH APPLICABLE LAWS, INCLUDING LOCAL ORDINANCES.\n\nGET TO KNOW US CHARTER COMMUNICATIONS IS KNOWN IN THE UNITED STATES BY OUR SPECTRUM BRANDS, INCLUDING: SPECTRUM INTERNET®, TV, MOBILE AND VOICE, SPECTRUM NETWORKS, SPECTRUM ENTERPRISE AND SPECTRUM REACH. WHEN YOU JOIN US, YOU’RE JOINING A STRONG COMMUNITY OF MORE THAN 100,000 INDIVIDUALS WORKING TOGETHER TO SERVE MORE THAN 32 MILLION CUSTOMERS IN 41 STATES AND KEEP THEM CONNECTED TO WHAT MATTERS MOST. WATCH THIS VIDEO TO LEARN MORE.\n\nWHO YOU ARE MATTERS HERE WE’RE COMMITTED TO GROWING A WORKFORCE THAT REFLECTS OUR COMMUNITIES, AND PROVIDING EQUAL OPPORTUNITIES FOR EMPLOYMENT AND ADVANCEMENT. EOE, INCLUDING DISABILITY/VETS. LEARN ABOUT OUR INCLUSIVE CULTURE.",
    "job_skill_set": [
      "customer experience enhancement",
      "technical skills",
      "computer software applications",
      "direct sales practices",
      "consumer education",
      "communication",
      "team building",
      "interpersonal skills",
      "organizational skills",
      "problem solving",
      "accountability",
      "adaptability",
      "collaboration",
      "time management",
      "sales management",
      "project management",
      "reporting and analytics",
      "telecommunications knowledge",
      "recruitment and training",
      "performance appraisal",
      "leadership"
    ],
    "short_keywords": [
      "accountability",
      "adaptability",
      "analytics",
      "and",
      "applications",
      "appraisal",
      "building",
      "collaboration",
      "communication",
      "computer",
      "consumer",
      "customer",
      "direct",
      "education",
      "enhancement",
      "experience",
      "interpersonal",
      "knowledge",
      "leadership",
      "management",
      "organizational",
      "outside",
      "performance",
      "practices",
      "problem",
      "project",
      "recruitment",
      "reporting",
      "sales",
      "skills",
      "software",
      "solving",
      "supervisor",
      "team",
      "technical",
      "telecommunications",
      "time",
      "training"
    ]
  },
  {
    "job_id": "3894663747",
    "job_title": "IT Sales Specialist",
    "category": "SALES",
    "job_description": "HI,\nMAGNETO IT SOLUTIONS IS SEEKING AN IT SALES SPECIALIST IN NEW YORK, USA.\nCOMPANY DESCRIPTIONMAGNETO IT SOLUTIONS IS AN AWARD-WINNING B2C AND B2B ECOMMERCE AGENCY BASED IN THE USA. WITH A TEAM OF OVER 100 PROFESSIONALS, WE SPECIALIZE IN END-TO-END B2C, B2B ECOMMERCE SOLUTIONS DEVELOPMENT, PIM, CRM, DAM, MDM, AND DEM DEVELOPMENT & INTEGRATION.\nPOSITION: IT SALES SPECIALIST\nBUDGET RANGE: $40,000 TO $50,000 ANNUAL + PERFORMANCE INCENTIVES\nRESPONSIBILITIESWORK CLOSELY WITH THE SALES AND MARKETING TEAMS TO IDENTIFY LEADS BASED ON ICP.QUALIFY LEADS FROM MARKETING CAMPAIGNS AND DEVELOP THEM INTO SALES OPPORTUNITIES.BUILD THE SALES PIPELINE BY EDUCATING POTENTIAL CLIENTS ON THE LATEST ECOMMERCE INDUSTRY TRENDS.CONTACT POTENTIAL CLIENTS THROUGH PHONE CALLS AND EMAILS AND SET UP MEETINGS OR CALLS.IDENTIFY CLIENT NEEDS AND SUGGEST APPROPRIATE PRODUCTS/SERVICES.PRESENT MAGNETO AND SERVICES TO POTENTIAL CLIENTSENGAGE WITH POTENTIAL CLIENTS AT EVENTS THROUGHOUT THE YEAR TO BUILD BRAND AWARENESS.IDENTIFY OPPORTUNITIES TO EXHIBIT AT EVENTS TO GENERATE NEW LEADS.PROACTIVELY SEEK NEW BUSINESS OPPORTUNITIES IN THE USA.\nQUALIFICATIONSPREVIOUS EXPERIENCE IN SALES AT LEAST 3 YEARS.PREVIOUS EXPERIENCE IN THE ECOMMERCE/ TECH INDUSTRY.REGULARLY EXCEED MONTHLY/ ANNUAL SALES TARGETS.UNDERSTANDING OF THIRD-PARTY CRM AND ERP SYSTEMS.CAPABILITY TO DELIVER ENGAGING AND COMPELLING PRESENTATIONS.ABILITY TO IDENTIFY AND BUILD RELATIONSHIPS WITH KEY STAKEHOLDERS WITHIN TARGET ACCOUNTS.STRONG UNDERSTANDING OF BUSINESS OPERATIONS AND HOW COMPANIES MAKE BUYING DECISIONS.DEMONSTRATED INDIVIDUAL SUCCESS IN B2C SALES.\nCONTACT: HIRING@MAGNETOITSOLUTIONS.COM\nWEBSITE: HTTPS://MAGNETOITSOLUTIONS.COM/\nREGARDS,HR\nNOTE: NO AGENCIES REQUESTED...!!",
    "job_skill_set": [
      "Sales",
      "Business development",
      "Communication",
      "Relationship building",
      "Team collaboration",
      "Problem solving",
      "Time management",
      "Adaptability",
      "Ecommerce",
      "CRM systems",
      "ERP systems",
      "Presentation skills",
      "Lead qualification",
      "Market analysis"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "building",
      "business",
      "collaboration",
      "communication",
      "crm",
      "development",
      "ecommerce",
      "erp",
      "it",
      "lead",
      "management",
      "market",
      "presentation",
      "problem",
      "qualification",
      "relationship",
      "sales",
      "skills",
      "solving",
      "specialist",
      "systems",
      "team",
      "time"
    ]
  },
  {
    "job_id": "3905869737",
    "job_title": "Outside Sales Representative Trainee",
    "category": "SALES",
    "job_description": "DESCRIPTION: AMERICAN EQUIPMENT HOLDINGS, IS ONE OF THE LEADING OVERHEAD CRANE SOLUTIONS PROVIDERS IN THE UNITED STATES. OVER THE YEARS, OUR ABILITY TO GROW AND SET OURSELVES APART FROM THE COMPETITION IS THE RESULT OF A TRIED AND TRUE PHILOSOPHY – TAKE CARE OF OUR CUSTOMERS AND TAKE CARE OF OUR PEOPLE. \nWE ALSO BELIEVE THAT OUR PEOPLE MATTER, WHICH IS WHY WE ARE COMMITTED TO PROVIDING OUR TEAM MEMBERS WITH COMPETITIVE WAGES, ATTRACTIVE BENEFIT OFFERINGS, AND ABUNDANT TRAINING OFFERINGS. AS ONE OF THE FASTEST GROWING COMPANIES IN OUR INDUSTRY, NEW OPPORTUNITIES ARE REGULARLY AVAILABLE THAT ENABLE OUR TEAM MEMBERS TO DEVELOP, GROW, AND PURSUE THEIR CAREER PASSIONS. \nPOSITION SUMMARY:\nAMERICAN EQUIPMENT IS A LEADING MANUFACTURER AND SUPPLIER OF INDUSTRIAL CRANES, SPECIALIZING IN PROVIDING HIGH-QUALITY AND RELIABLE SOLUTIONS FOR VARIOUS INDUSTRIAL APPLICATIONS. \nWE ARE SEEKING A OUTSIDE SALES REPRESENTATIVE TRAINEE. THIS PERSON SHOULD BE EAGER TO LEARN HOW TO MARKET AND SELL OUR LINE OF INDUSTRIAL EQUIPMENT, INCLUDING OVERHEAD CRANES TO CUSTOMERS IN VARIOUS INDUSTRIES. THE IDEAL CANDIDATE WILL HAVE EFFECTIVE COMMUNICATION AND NEGOTIATION SKILLS, AND THE ABILITY TO BUILD AND MAINTAIN RELATIONSHIPS WITH CLIENTS.\nKEY RESPONSIBILITIES:DEVELOP AND MAINTAIN RELATIONSHIPS WITH CURRENT AND POTENTIAL CLIENTS IN THE ASSIGNED TERRITORY.FOLLOW UP QUALIFIED LEADS AND CONTACTS.EFFICIENTLY COORDINATE PRE- AND POST-SALES SUPPORT TO ACHIEVE CUSTOMER SATISFACTION.HELP PREPARE AND PRESENT SALES PROPOSALS, QUOTES, AND CONTRACTS.UPDATE AND MAINTAIN CRM SYSTEM COVERING THE CUSTOMERS IN THE TERRITORY.CONDUCT PRODUCT DEMONSTRATIONS AND PRESENTATIONS TO CLIENTS AND PROSPECTIVE CUSTOMERS.HELP NEGOTIATE TERMS AND PRICING WITH CLIENTS TO SECURE SALES.COLLABORATE WITH INTERNAL TEAMS, SUCH AS ENGINEERING, SERVICE, AND INSTALLATION, TO ENSURE CUSTOMER NEEDS ARE MET.KEEP UP TO DATE WITH INDUSTRY TRENDS, COMPETITOR ACTIVITY, AND MARKET CHANGES.ATTEND TRADE SHOWS AND EVENTS TO NETWORK AND PROMOTE PRODUCTS.QUALIFICATIONS:BACHELOR'S DEGREE IN CIVIL, MECHANICAL, OR ELECTRICAL ENGINEERING.SALES EXPERIENCE A PLUS.EFFECTIVE COMMUNICATION, NEGOTIATION, AND PEOPLE SKILLS.EXCELLENT TIME MANAGEMENT AND PRIORITIZATION SKILLS.ENGINEERING AND TECHNICAL EXPERIENCE IS A PLUS.PROFICIENCY IN MICROSOFT OFFICE WHAT WE OFFER:WE OFFER COMPETITIVE COMPENSATION AND BENEFITS PACKAGE, INCLUDING HEALTH INSURANCE, RETIREMENT PLANS, AND PAID TIME OFF.HEALTH INSURANCEFSA & HSA OPTIONS FOR HEALTHCARECRITICAL ILLNESS, ACCIDENTAL, AND HOSPITAL INDEMNITY PLANSDENTALVISIONSTD & LTDBASIC & VOLUNTARY LIFE AD&D4% MATCHING 401K80 HOURS PTOCOMPANY PROVIDED PPEEMPLOYEE REFERRAL BONUS: $2000THIS IS A FULL-TIME POSITION; 8-HOUR DAYS, MONDAY THROUGH FRIDAY.\nAMERICAN EQUIPMENT HOLDINGS IS AN ORGANIZATION OF LEADING OVERHEAD CRANE AND HOIST, INDUSTRIAL WEIGHING, AND BELOW-THE-HOOK SERVICE PROVIDERS IN THE UNITED STATES. TOGETHER, OUR COMPANIES PROVIDE COMPREHENSIVE SOLUTIONS FOR EVERYTHING RELATED TO CUSTOMERS' OVERHEAD CRANE AND HOIST, RIGGING, AND WEIGHING AND MEASUREMENT NEEDS, INCLUDING OSHA MANDATED INSPECTIONS, PREVENTATIVE MAINTENANCE AND REPAIR FIELD SERVICES, PARTS, ENGINEERING, ISO CERTIFIED FABRICATION, NEW AND REPLACEMENT EQUIPMENT, AUTOMATED SYSTEMS, SYSTEM MODERNIZATIONS AND TRAINING. AMERICAN EQUIPMENT HOLDINGS IS ONE THE LARGEST AND FASTEST GROWING COMPANIES IN OUR SPACE WITH MORE THAN 800 DEDICATED TEAM MEMBERS THAT SERVE THOUSANDS OF CUSTOMERS THROUGHOUT THE UNITED STATES. \nPROOF OF RIGHT TO LAWFULLY WORK IN THE UNITED STATES REQUIRED. \nPLEASE NOTE THIS JOB DESCRIPTION IS NOT DESIGNED TO COVER OR CONTAIN A COMPREHENSIVE LISTING OF ACTIVITIES, DUTIES OR RESPONSIBILITIES THAT ARE REQUIRED OF THE EMPLOYEE FOR THIS JOB. DUTIES, RESPONSIBILITIES, AND ACTIVITIES MAY CHANGE AT ANY TIME WITH OR WITHOUT NOTICE.\nWE ARE PROUD TO BE AN EQUAL OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, GENDER, GENDER IDENTITY OR EXPRESSION, SEXUAL ORIENTATION, NATIONAL ORIGIN, GENETICS, DISABILITY, AGE, OR VETERAN STATUS. REQUIREMENTS:\n\n\nCOMPENSATION DETAILS: 60000-75000 YEARLY SALARY",
    "job_skill_set": [
      "sales",
      "communication",
      "negotiation",
      "Microsoft Office",
      "technical experience",
      "product demonstrations",
      "time management",
      "relationship building",
      "customer service",
      "team collaboration",
      "adaptability",
      "networking",
      "prioritization",
      "CRM",
      "engineering"
    ],
    "short_keywords": [
      "adaptability",
      "building",
      "collaboration",
      "communication",
      "crm",
      "customer",
      "demonstrations",
      "engineering",
      "experience",
      "management",
      "microsoft",
      "negotiation",
      "networking",
      "office",
      "outside",
      "prioritization",
      "product",
      "relationship",
      "representative",
      "sales",
      "service",
      "team",
      "technical",
      "time",
      "trainee"
    ]
  },
  {
    "job_id": "3901388329",
    "job_title": "Sales Development Representative",
    "category": "SALES",
    "job_description": "DO YOU WANT TO WORK FOR THE GLOBAL LEADER IN THE LANGUAGE SERVICES AND TECHNOLOGY INDUSTRY? ARE YOU INTERESTED IN HELPING INTERNATIONAL BRANDS/ORGANIZATIONS FIND AND IMPLEMENT SOLUTIONS THAT ALLOW THEM TO COMMUNICATE, OPERATE AND SELL THEIR PRODUCTS AND SERVICES EFFICIENTLY AND EFFECTIVELY? AND ARE YOU THE TYPE OF PERSON WHO ENJOYS WORKING IN AN INNOVATIVE AND VIBRANT WORKPLACE? THEN TRANSPERFECT IS FOR YOU!\nSO YOU LIKE WHAT YOU HEAR BUT HAVEN’T WORKED IN ‘LANGUAGE’ BEFORE? THAT IS NOT A PROBLEM, TRANSPERFECT IS FAR FROM “JUST A TRANSLATION AGENCY”. OUR SERVICES PORTFOLIO COVERS EVERYTHING FROM BUSINESS SUPPORT SERVICES SUCH AS INTERPRETATION, MULTICULTURAL AND DIGITAL MARKETING, SEO AND WEBSITE GLOBALIZATION TO MULTIMEDIA WORK, VIDEO, E-LEARNING AND TRAINING, AND LEGAL SUPPORT SERVICES. ALL SERVICES AND CLIENT PARTNERSHIPS ARE AIDED BY BEST-IN-BREED SOFTWARE PLATFORMS, SPECIALIZED IN OPTIMIZING BUSINESS PROCESSES.\nTHAT’S ENOUGH ABOUT US – WHAT ABOUT YOU?\nWE LOOK FOR AND APPRECIATE ANYONE WHO IS WILLING TO ROLL UP THEIR SLEEVES AND GET STUCK IN! WE OFFER A FAST GROWTH PATH AND PROVIDE FULL TRAINING AROUND OUR SERVICES, TECHNOLOGY SOLUTIONS AND WORKFLOWS. THEREFORE THE KEY SKILLS WE ARE LOOKING FOR ARE SOLID COMMUNICATION AND RELATIONSHIP BUILDING ABILITIES, KEEPING A COOL HEAD IF SITUATIONS GET A BIT STRESSFUL AND REALLY OWNING YOUR ROLE, TAKING RESPONSIBILITY FOR YOUR CLIENTS AND THEIR BUSINESS SUCCESS.\nIF THIS SOUNDS LIKE YOU, WE WOULD LOVE TO HEAR FROM YOU! WE HAVE 90 OFFICES WORLDWIDE BUT THIS PARTICULAR OPPORTUNITY IS BASED IN OUR MINNEAPOLIS OFFICE. WE OFFER CAREER DEVELOPMENT AND AN ATTRACTIVE BONUS PLAN AND SOCIAL EVENTS ARE ORGANIZED FREQUENTLY.\nWHAT YOU WILL BE DOING \nPOSITION SUMMARY: THE POSITION OF THE SALES DEVELOPMENT REPRESENTATIVE IS RESPONSIBLE FOR DEVELOPING NEW BUSINESS RELATIONSHIPS AND SERVING AS THE FIRST LEVEL OF SUPPORT TO EXISTING CLIENTS\nDESCRIPTION:DEVELOP PROSPECTIVE CLIENTS THROUGH SEVERAL STRATEGIES INCLUDING INTERNET RESEARCH, TRADE SHOW LISTS, REFERRALS, VARIOUS PROFESSIONAL DIRECTORIES AND PERSONAL INVESTIGATIONFOSTER AND CLOSE NEW CLIENTS THROUGH REFERRALS, COLD CALLING, NETWORKING, AND OTHER MEANS (TRADESHOWS, REGIONAL ORGANIZATIONS, ETC.)RESPONSIBLE FOR GROWING NEW BUSINESS FROM EXISTING CLIENTS, INCLUDING WORKING CLOSELY WITH SENIOR LEADERSHIP TO EXPAND CURRENT RELATIONSHIPS AND UPSELL THE TRANSPERFECT PORTFOLIO.CREATIVELY PROBLEM SOLVE TO IMPROVE CURRENT NEW BUSINESS DEVELOPMENT STRATEGYNEGOTIATE RATES AND DEADLINES WITH PROSPECTIVE AND CURRENT CLIENTSEDUCATE PROSPECTIVE AND EXISTING CLIENTS REGARDING THE TRANSLATION PROCESS, INCLUDING TRANSPERFECT’S RATES, JUSTIFICATION FOR TURNAROUND TIME, AND COMPETITORS’ INFORMATIONLIAISE WITH PRODUCTION TO ENSURE THAT ALL JOBS ARE HANDLED APPROPRIATELY AND WITH KEEN ATTENTION TO DETAIL, RESULTING IN A PERFECT PRODUCTCONSISTENTLY FOLLOW UP WITH CLIENTS TO ENSURE THEIR SATISFACTION WITH DELIVERY, QUALITY AND CUSTOMER SERVICEUNDERSTAND ALL INDUSTRIES THAT TRANSPERFECT MARKETS TO INCLUDING INDUSTRY LEADERS, CURRENT EVENTS AND ANY OTHER PERTINENT DATAPERFORM OTHER SPECIAL PROJECTS OR DUTIES WHEN REQUIRED\nWHO WE ARE LOOKING FOR: REQUIRED SKILLS:EXCELLENT WRITTEN AND VERBAL ENGLISH COMMUNICATION SKILLSMINIMUM BACHELOR'S DEGREE OR EQUIVALENTEXCELLENT PROBLEM SOLVING AND ANALYTICAL SKILLSSTRONG INTERPERSONAL SKILLSEFFECTIVE TIME MANAGEMENT\nWHY TRANSPERFECT:FOR MORE THAN 25 YEARS, WE HAVE HONED A CULTURE WHERE ALL KINDS OF IDEAS ARE SHARED AND NEW VENTURES ARE NOT ONLY WELCOMED, BUT ALSO ENCOURAGED. IN THIS FAST-PACED ENVIRONMENT, EMPLOYEES ARE INTELLECTUALLY STIMULATED SO THEY CAN GROW ALONGSIDE THE ORGANIZATION. FROM INTERN TO PRESIDENT, WE BELIEVE THAT EVERY SINGLE EMPLOYEE SHOULD HAVE A VOICE AND CONTRIBUTE TO THE AMAZING SERVICES WE OFFER OUR CLIENTS.\nWE ALSO OFFER A COMPREHENSIVE BENEFITS PACKAGE INCLUDING MEDICAL, DENTAL, AND VISION INSURANCE, 401K MATCHING, MEMBERSHIP TO CHILD-CARE PROVIDERS, AND OTHER TRANSPERKS. YOU EVEN GET YOUR BIRTHDAY OFF BECAUSE LET'S FACE IT, WE'RE STOKED THAT YOU WERE BORN.\nTRANSPERFECT PROVIDES EQUAL EMPLOYMENT OPPORTUNITY TO ALL INDIVIDUALS REGARDLESS OF THEIR RACE, COLOR, CREED, RELIGION, GENDER, AGE, SEXUAL ORIENTATION, NATIONAL ORIGIN, DISABILITY, VETERAN STATUS, OR ANY OTHER CHARACTERISTIC PROTECTED BY STATE, FEDERAL, OR LOCAL LAW",
    "job_skill_set": [
      "communication",
      "problem solving",
      "analytical skills",
      "time management",
      "negotiation",
      "internet research",
      "customer service",
      "relationship building",
      "business development",
      "interpersonal skills",
      "adaptability",
      "teamwork",
      "creativity",
      "responsibility",
      "attention to detail",
      "stress management"
    ],
    "short_keywords": [
      "adaptability",
      "analytical",
      "attention",
      "building",
      "business",
      "communication",
      "creativity",
      "customer",
      "detail",
      "development",
      "internet",
      "interpersonal",
      "management",
      "negotiation",
      "problem",
      "relationship",
      "representative",
      "research",
      "responsibility",
      "sales",
      "service",
      "skills",
      "solving",
      "stress",
      "teamwork",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3887578305",
    "job_title": "Sales Advisor - Intel Computers",
    "category": "SALES",
    "job_description": "LOCATIONCO - GRAND JUNCTION\n\nDO YOU ENJOY INTERACTING WITH PEOPLE?\n\nACTIONLINK HAS A PART-TIME OPPORTUNITY FOR SOMEONE TO JOIN OUR INTEL COMPUTER PROMOTER TEAM! WE ARE SEEKING AN ENGAGING INDIVIDUAL WHO WILL ENJOY CREATING A WORLD-CLASS SERVICE ENVIRONMENT INSIDE A LOCAL BEST BUY'S COMPUTER DEPARTMENT. THIS ROLE REPRESENTS OUR CLIENT, INTEL®, BY SHOWCASING THEIR LATEST CORE PROCESSING HARDWARE AND SYSTEM ENHANCING TECHNOLOGIES TO STORE CUSTOMERS.\n\nOUR INTEL SALES EXPERT IS RESPONSIBLE FOR EXECUTING RETAIL SALES STRATEGIES TO PROMOTE THE INTEL BRAND. THIS INCLUDES UNDERSTANDING THE NEEDS OF EACH CUSTOMER, ANSWERING THEIR QUESTIONS, COMPARING PC MANUFACTURER MODELS, AND OFFERING EACH A PERSONALIZED, SOLUTION-BASED COMPUTER PURCHASE. IN ADDITION, THE INTEL EXPERT IS TASKED WITH BUILDING POSITIVE RELATIONSHIPS WITH THE BEST BUY SALES STAFF THROUGH CONTINUOUS KNOWLEDGE SHARING AND TRAINING EFFORTS, ENSURING THAT OUR RETAIL PARTNERS ARE AWARE OF INTEL'S PRODUCT OFFERINGS. TO FURTHER ENGAGE WITH THE BEST BUY TEAM, THE INTEL EXPERT HELPS PROMOTE AND ENCOURAGE NEW MEMBERSHIP FOR INTEL’S COMMUNITY WEBSITE, INTEL RETAIL EDGE®. THIS EXCLUSIVE ELEARNING PROGRAM IS FOR DEDICATED SALES PROFESSIONALS, PROVIDING EXPERT KNOWLEDGE OF INTEL TECHNOLOGIES PRESENTED IN THE FORM OF IN-DEPTH ARTICLES, TRAINING COURSES, LEARNING ACTIVITIES, AND REWARDS.\n\nIT IS OUR GOAL AND COMMITMENT TO HELP MAKE CONSUMER ELECTRONIC PURCHASES EASIER, MORE PERSONALIZED, AND MORE INFORMATIVE FOR THE CUSTOMER WHILE ALSO BOOSTING BRAND AWARENESS DURING PEAK WEEKEND SELLING HOURS.\n\nIF YOU WANT TO GET PAID TO SHARE YOUR LOVE OF COMPUTERS WITH OTHERS, THIS JOB IS FOR YOU!\n\nWHEN & WHERE?\n\n10 HOURS PER WEEKEND5 HOUR SHIFTS SATURDAY AND SUNDAYS 11-4LOCATED AT AT BEST BUY IN GRAND JUNCTION, CO 81505\n\n\nWHAT'S IN IT FOR YOU?\n\nREPRESENT INTEL PRODUCTSTHE WAGE RANGE FOR THIS POSITION IS $18.00 PER HOUR COMMENSURATE WITH EXPERIENCEW2 BIWEEKLY PAY SCHEDULEPAID ONLINE TRAININGPAID TIME OFFSPIFFS OFFERED\n\n\nWHAT WILL YOU DO?\n\nBUILD STRONG RELATIONSHIPS AND RAPPORT WITH BEST BUY CUSTOMERS AND PERSONNELPROVIDE TRAININGS TO STORE ASSOCIATES ON THE VARIOUS INTEL PRODUCTS AND TECHNOLOGIESIDENTIFY CUSTOMERS’ NEEDS AND RECOMMEND APPROPRIATE INTEL COMPUTER PRODUCTS AND SERVICESPROACTIVELY ENGAGE CUSTOMERS THROUGHOUT THE SALES PROCESS, FROM GREETING AND DISCOVERING THEIR NEEDS TO CLOSING THE SALERING UP YOUR CUSTOMERS' COMPUTER PURCHASES ON BEST BUY'S POS SYSTEM (NO CASH HANDLING INVOLVED)COMPLETE SAME-DAY ONLINE REPORTS TO DOCUMENT VISITS, INCLUDING PROVIDING FEEDBACK, OBSERVATIONS, AND SUBMITTING CUSTOMER AND STORE PHOTOSMAINTAIN BUSINESS COMMUNICATION WITH DISTRICT MANAGER VIA OCCASIONAL PHONE CALLS, ZOOM MEETINGS, AND/OR EMAILS\n\n\nARE YOU A MATCH?\n\nEXCELLENT INTERPERSONAL COMMUNICATION AND RELATIONSHIP BUILDING SKILLSPHYSICALLY ABLE TO STAND, BEND, STOOP, CLIMB LADDERS, AND LIFT UP TO 50 LBS.AVAILABLE TO WORK REQUIRED SATURDAY & SUNDAY SHIFTSACCESS TO A SMART DEVICE FOR REPORTINGACCESS TO RELIABLE TRANSPORTATION\n\n\nACTIONLINK, IN GOOD FAITH, BELIEVES THAT THIS POSTED RANGE OF COMPENSATION IS THE ACCURATE RANGE FOR THIS ROLE AT THE TIME OF THIS POSTING. ACTIONLINK MAY ULTIMATELY PAY MORE OR LESS THAN THE POSTED RANGE DEPENDING ON CANDIDATE QUALIFICATIONS AND LOCATIONS IN CO. THIS RANGE MAY BE MODIFIED IN THE FUTURE.\n\nACTIONLINK IS AN EQUAL OPPORTUNITY EMPLOYER",
    "job_skill_set": [
      "retail sales",
      "customer service",
      "product knowledge",
      "computer hardware",
      "POS system",
      "reporting",
      "training",
      "interpersonal communication",
      "relationship building",
      "problem solving",
      "engagement",
      "teamwork",
      "adaptability",
      "time management",
      "eLearning"
    ],
    "short_keywords": [
      "adaptability",
      "advisor",
      "building",
      "communication",
      "computer",
      "computers",
      "customer",
      "elearning",
      "engagement",
      "hardware",
      "intel",
      "interpersonal",
      "knowledge",
      "management",
      "pos",
      "problem",
      "product",
      "relationship",
      "reporting",
      "retail",
      "sales",
      "service",
      "solving",
      "system",
      "teamwork",
      "time",
      "training"
    ]
  },
  {
    "job_id": "3905692388",
    "job_title": "Professional Sales Representative",
    "category": "SALES",
    "job_description": "COMPANY DESCRIPTION\n ALBIREO ENERGY IS A LEADING INDEPENDENT BUILDING CONTROLS AND ENERGY SERVICES PROVIDER BASED IN PHILADELPHIA, PA. OUR GOAL IS TO CREATE INTELLIGENT AND HIGH-PERFORMANCE BUILDINGS THAT ACHIEVE OPERATING PERFORMANCE, DECARBONIZATION, AND SUSTAINABILITY GOALS. OUR TEAM OF BUILDING PERFORMANCE EXPERTS DESIGNS AND DELIVERS TECHNOLOGY AND SERVICE SOLUTIONS FOR A VARIETY OF BUILDING TYPES, INCLUDING DATA CENTERS, OFFICES, HOSPITALS, UNIVERSITIES, AND MANUFACTURING SITES.\n ROLE DESCRIPTION\n THIS IS A FULL-TIME HYBRID ROLE FOR A PROFESSIONAL SALES REPRESENTATIVE AT ALBIREO ENERGY. THE SALES REPRESENTATIVE WILL BE RESPONSIBLE FOR DAY-TO-DAY SALES ACTIVITIES, INCLUDING PROSPECTING, LEAD GENERATION, RELATIONSHIP BUILDING, AND CLOSING DEALS. THIS ROLE REQUIRES A COMBINATION OF IN-PERSON SALES MEETINGS AT OUR PHILADELPHIA LOCATION AND REMOTE WORK.\n QUALIFICATIONS\n STRONG SALES AND NEGOTIATION SKILLSPROVEN TRACK RECORD OF ACHIEVING SALES TARGETSEXCELLENT COMMUNICATION AND INTERPERSONAL SKILLSABILITY TO BUILD AND MAINTAIN CUSTOMER RELATIONSHIPSEXPERIENCE IN THE BUILDING CONTROLS OR ENERGY SERVICES INDUSTRY IS PREFERREDKNOWLEDGE OF BUILDING AUTOMATION SYSTEMS AND ENERGY EFFICIENCY CONCEPTSSELF-MOTIVATED AND ABLE TO WORK INDEPENDENTLYBACHELOR'S DEGREE IN BUSINESS, ENGINEERING, OR RELATED FIELD",
    "job_skill_set": [
      "sales",
      "negotiation",
      "communication",
      "interpersonal skills",
      "self-motivation",
      "independence",
      "relationship building",
      "lead generation",
      "building automation systems",
      "energy efficiency concepts",
      "customer relationship management",
      "business degree",
      "engineering degree"
    ],
    "short_keywords": [
      "automation",
      "building",
      "business",
      "communication",
      "concepts",
      "customer",
      "degree",
      "efficiency",
      "energy",
      "engineering",
      "generation",
      "independence",
      "interpersonal",
      "lead",
      "management",
      "negotiation",
      "professional",
      "relationship",
      "representative",
      "sales",
      "selfmotivation",
      "skills",
      "systems"
    ]
  },
  {
    "job_id": "3902806223",
    "job_title": "Insurance Sales Representative",
    "category": "SALES",
    "job_description": "COMMERCIAL LINES INSURANCE AGENCY- LICENSED IN PROPERTY AND CASUALTY INSURANCE OR MUST BE ABLE TO OBTAIN A LICENSE WITHIN 90 DAYS OF EMPLOYMENT. *CLEAN BACKGROUND CHECK AND DRUG TESTING REQUIRED*- ABILITY TO WORK INDEPENDENTLY AND WITH IN TEAM BASED ENVIRONMENT- BASIC KNOWLEDGE OF MICROSOFT OFFICE SUITE (EXCEL, WORD, OUTLOOK)- RELIABLE WITH THE ABILITY TO MAINTAIN REGULAR ATTENDANCE AND PUNCTUALITY- MOTIVATED- SALES EXPERIENCE IN INSURANCE IS PREFERRED BUT NOT REQUIRED- TRAINING/COACHING PROVIDED- NO WEEKENDS- IN OFFICE POSITION ONLY.- COMPENSATION: 60K-85K+ PER YEAR (THIS INCLUDES BASE PAY PLUS EXPECTED COMMISSION EARNINGS)- HOURS: MONDAY-FRIDAY 9AM-5:30PM- MEDICAL/DENTAL/VISION BENEFITS AFTER 90 DAYSJOB TYPE: FULL-TIMEPAY: $60,000.00 - $85,000.00 PER YEARBENEFITS:DENTAL INSURANCEHEALTH INSURANCEVISION INSURANCESUPPLEMENTAL PAY TYPES:COMMISSION PAYWEEKLY DAY RANGE:MONDAY TO FRIDAYWORK SETTING:IN-PERSONOFFICEAPPLICATION QUESTION(S):WHAT ARE YOUR LONG TERM GOALS? 3 YEARS? 5 YEARS?WHAT DO YOU LIKE ABOUT INSURANCE?EXPERIENCE:SALES: 2 YEARS (REQUIRED)WORK LOCATION: IN PERSON",
    "job_skill_set": [
      "Sales Experience",
      "Teamwork",
      "Motivation",
      "Reliability",
      "Independence",
      "Communication",
      "Property and Casualty Insurance License",
      "Microsoft Office Suite"
    ],
    "short_keywords": [
      "and",
      "casualty",
      "communication",
      "experience",
      "independence",
      "insurance",
      "license",
      "microsoft",
      "motivation",
      "office",
      "property",
      "reliability",
      "representative",
      "sales",
      "suite",
      "teamwork"
    ]
  },
  {
    "job_id": "3894289485",
    "job_title": "Sales Manager - US - Packaging Machinery",
    "category": "SALES",
    "job_description": "THE FIELD SALES MANAGER IS SEARCHING FOR NEW PROSPECTS AND LEADS FOR NEW\nBUSINESS OPPORTUNITIES. TRAVELING ACROSS A DESIGNATED REGION (US AND CANADA) HE/SHE NEEDS TO\nIDENTIFY POTENTIAL CUSTOMERS AND PROMOTE OUR SOLUTIONS QUALIFYING OPPORTUNITIES ACCORDINGLY TO OUR CORE BUSINESS.CLIENT DETAILSOUR CLIENT IS A BULK BAGGING AND PALLETIZING MACHINERY COMPANY. THEY ARE EXPANDING INTO THE US AND THIS WILL BE THE FIRST US HIRE.DESCRIPTIONPROSPECTING AND NEW BUSINESS DEVELOPMENTMAXIMIZING CLIENT POTENTIAL IN DESIGNATED REGIONS.PROVIDING PRE-SALES TECHNICAL ASSISTANCE FOR PROPOSAL PREPARATION TO THE SALES ENGINEERING DEPARTMENT.MEASUREMENTS ON SITE FOR LAYOUTS.EFFICIENT REPORTS ABOUT ACTIVITIES, ABOUT COMPETITORS AND MARKET INFORMATION.MANAGING CUSTOMER'S AND PROJECT'S DATA IN THE CRM.DEVELOPING LONG-TERM RELATIONSHIPS WITH CLIENTS THROUGH MANAGING AND INTERPRETING THEIR REQUIREMENTS.MAKING TECHNICAL PRESENTATIONS AND DEMONSTRATING HOW A PRODUCT MEETS CLIENT NEEDS.PERSUADING CLIENTS THAT A PRODUCT OR SERVICE BEST SATISFIES THEIR NEEDS IN TERMS OF QUALITY, PRICE AND DELIVERY.ATTENDING SALES MEETINGS.PREPARING REPORTS FOR HEADQUARTERS.MEETING REGULAR SALES TARGETS.SUPPORTING MARKETING ACTIVITIES BY ATTENDING TRADE SHOWS, CONFERENCES AND OTHER MARKETING EVENTS.RELAY ON THE FIELD WITH OTHER MEMBERS OF THE SALES TEAM AND OTHER TECHNICAL EXPERTS.PROFILE SALES CONSULTANT WITH A PROVEN TECHNICAL BACKGROUNDMS OFFICE TOOLS (WORD, EXCEL, POWER POINT…)BLUE PRINTS UNDERSTANDING5 YEARS EXPERIENCES ON SIMILAR JOB.COMMON SENSEOPEN MINDEDPRO-ACTIVE PERSONALITYAUTONOMY      NOT FOR NEW YORK CITY APPLICANTS.PURSUANT TO THE SAN FRANCISCO FAIR CHANCE ORDINANCE, MICHAEL PAGE WILL CONSIDER FOR EMPLOYMENT QUALIFIED APPLICANTS WITH ARREST AND CONVICTION RECORDS.MICHAEL PAGE WILL CONSIDER FOR EMPLOYMENT QUALIFIED APPLICANTS WITH CRIMINAL HISTORIES IN A MANNER CONSISTENT WITH THE LOS ANGELES FAIR CHANCE INITIATIVE FOR HIRING ORDINANCE.JOB OFFERCAR, CREDIT CARD, LAPTOP$100-150K BASE + BONUSGROWTH OPPORTUNITY\nMPI DOES NOT DISCRIMINATE ON THE BASIS OF RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, NATIONAL ORIGIN, AGE, DISABILITY, VETERAN STATUS, MARITAL STATUS, OR BASED ON AN INDIVIDUAL'S STATUS IN ANY GROUP OR CLASS PROTECTED BY APPLICABLE FEDERAL, STATE OR LOCAL LAW. MPI ENCOURAGES APPLICATIONS FROM MINORITIES, WOMEN, THE DISABLED, PROTECTED VETERANS AND ALL OTHER QUALIFIED APPLICANTS.",
    "job_skill_set": [
      "Communication",
      "Relationship management",
      "Proactivity",
      "Common sense",
      "Team collaboration",
      "CRM",
      "MS Office",
      "Technical presentations",
      "Blueprints understanding",
      "Sales reporting",
      "Market analysis",
      "Business development",
      "Pre-sales technical assistance",
      "Measurements for layouts",
      "Persuasion",
      "Autonomy"
    ],
    "short_keywords": [
      "analysis",
      "assistance",
      "autonomy",
      "blueprints",
      "business",
      "collaboration",
      "common",
      "communication",
      "crm",
      "development",
      "for",
      "layouts",
      "machinery",
      "management",
      "manager",
      "market",
      "measurements",
      "ms",
      "office",
      "packaging",
      "persuasion",
      "presales",
      "presentations",
      "proactivity",
      "relationship",
      "reporting",
      "sales",
      "sense",
      "team",
      "technical",
      "understanding",
      "us"
    ]
  },
  {
    "job_id": "3888959920",
    "job_title": "Sales Associate / Key Sales / Seasonal Opportunities - Banter by Piercing Pagoda - Los Cerritos Center - Cerritos, CA",
    "category": "SALES",
    "job_description": "WE HAVE MANY OPPORTUNITIES AVAILABLE ON OUR OTHER CAREER SITE PAGES. CLICK HERE TO LINK TO OUR CAREERS PAGE!\n\n“BE MORE YOU” ISN’T JUST OUR TAGLINE, IT’S OUR LIFE’S MISSION – A WAY TO HELP PEOPLE CELEBRATE LIVE AND EXPRESS LOVE. AND WE’RE ALWAYS LOOKING FOR EXPRESSIVE, CHARISMATIC PEOPLE TO EMBODY THAT MISSION AND HELP OTHERS BRING OUT WHAT’S INSIDE THEM IN BOLD WAYS. THERE ARE DYNAMIC CAREER PATHS AWAITING YOU – REWARDING OPPORTUNITIES TO IMPACT THE LIVES OF OTHERS AND HELP THEM EXPRESS LOVE AND THEMSELVES LIKE NEVER BEFORE. JOIN US!\n\nSEASONAL POSITIONS NOW AVAILABLE\n\nBANTER BY PIERCING PAGODA IS LOOKING FOR DYNAMIC, DRIVEN AND CREATIVE INDIVIDUALS TO JOIN OUR TEAM.\n\nARE YOU READY TO USE YOUR BUSINESS AND SALES SKILLS TO BEGIN A FINANCIALLY REWARDING CAREER? IF YOU ARE THE TYPE OF PERSON THAT ENJOYS WORKING WITH THE BEST OF THE BEST AND CELEBRATING THE SUCCESSES OF A STRONG TEAM, THEN YOU SHOULD APPLY TO BANTER BY PIERCING PAGODA. MAKE THE DECISION TO BUILD YOUR CAREER WITH A COMPANY THAT THRIVES ON AN OUTSTANDING CUSTOMER EXPERIENCE, INTENSE AND CONTINUOUS TRAINING AND BEING ABLE TO MAKE A DIFFERENCE IN OUR CUSTOMER'S AND EMPLOYEE'S LIVES. IF YOU HAVE THE DRIVE AND PASSION TO SUCCEED, APPLY WITH US TODAY!\n\nKEY SALES ASSOCIATE \n\nJOIN OUR TEAM AS A KEY SALES ASSOCIATE AND HAVE A POSITIVE IMPACT ON MANY LIVES. OUR KEY SALES ASSOCIATES ARE RESPONSIBLE FOR ENGAGING CUSTOMERS IN CONVERSATION TO UNDERSTAND THEIR NEEDS AND OBJECTIONS; PRESENTING MERCHANDISE AND DETAILED INFORMATION ON FEATURES AND BENEFITS; OFFERING EXTENDED SERVICE PLANS AND FINANCING OPTIONS; WORKING WITH THE ENTIRE SALES TEAM TO PROVIDE A SUPERIOR EXPERIENCE TO ALL OF OUR VALUED CUSTOMERS AND MEETING INDIVIDUAL AND TEAM SALES GOALS. MAY ALSO ASSIST THE STORE MANAGER AND/OR ASSISTANT MANAGER WITH SUPERVISORY DUTIES.\n\nWE VALUE INTEGRITY, DIVERSITY, TEAMWORK AND OPPORTUNITIES FOR ADVANCEMENT MAINTAINING OUR PROMOTION FROM WITHIN PHILOSOPHY. WE PROVIDE TRAINING ON SALES TECHNIQUES, PRODUCT KNOWLEDGE, AND SKILLS TO TAKE YOUR CAREER TO THE NEXT LEVEL. IN RETURN, WE ASK THAT YOU BRING YOUR COMMITMENT TO EXCELLENCE, DESIRE TO GROW AND ABILITY TO PROVIDE A SUPERIOR CUSTOMER EXPERIENCE.\n\nJOB REQUIREMENTS\n\nONE YEAR OF SALES, RETAIL AND/OR JEWELRY EXPERIENCE IS PREFERRED, BUT NOT REQUIRED. \n\n\nA SAMPLING OF OUR TOTAL REWARDS\n\nBASE PAY, $18.00 – $19.00. FINAL PAY RATE SHALL BE DETERMINED AND IS BASED ON EXPERIENCE AND QUALIFICATIONS BENEFITS INCLUDING MEDICAL, DENTAL, VISION AND PRESCRIPTION INSURANCE (FULL TIME TEAM MEMBERS) 401 (K) PAID VACATION AND PAID HOLIDAYS (FULL TIME TEAM MEMBERS) TUITION REIMBURSEMENT AND DCA COURSES BASED ON POSITION TRAINING - ASSOCIATE TRAINING SYSTEM, MANAGEMENT TRAINING SYSTEM, CAREER DEVELOPMENT AND MORE TEAM MEMBER MERCHANDISE DISCOUNTS INCENTIVE TRIPS AND CONTESTS \n\n\nSIGNET JEWELERS OPERATES MALL-BASED BANTER BY PIERCING PAGODA KIOSKS THROUGHOUT THE UNITED STATES.\n\nSIGNET JEWELERS IS AN EQUAL OPPORTUNITY EMPLOYER COMMITTED TO PROMOTING DIVERSITY OF ALL LEVELS OF EMPLOYEES. PLEASE KNOW THAT WHILE WE APPRECIATE EVERY APPLICANT'S INTEREST, WE CAN ONLY CONTACT THOSE SELECTED FOR FURTHER CONSIDERATION.\n\nDON'T FORGET, WE HAVE MANY OPPORTUNITIES AVAILABLE ON OUR OTHER CAREER SITE PAGES. CLICK HERE TO LINK TO OUR CAREERS PAGE!",
    "job_skill_set": [
      "sales",
      "customer service",
      "retail experience",
      "product knowledge",
      "supervisory skills",
      "communication",
      "teamwork",
      "sales techniques",
      "drive",
      "adaptability",
      "desire to grow",
      "problem solving",
      "merchandising",
      "financing options",
      "creativity",
      "integrity",
      "commitment to excellence",
      "charisma"
    ],
    "short_keywords": [
      "adaptability",
      "associate",
      "banter",
      "by",
      "ca",
      "center",
      "cerritos",
      "charisma",
      "commitment",
      "communication",
      "creativity",
      "customer",
      "desire",
      "drive",
      "excellence",
      "experience",
      "financing",
      "grow",
      "integrity",
      "key",
      "knowledge",
      "los",
      "merchandising",
      "opportunities",
      "options",
      "pagoda",
      "piercing",
      "problem",
      "product",
      "retail",
      "sales",
      "seasonal",
      "service",
      "skills",
      "solving",
      "supervisory",
      "teamwork",
      "techniques",
      "to"
    ]
  },
  {
    "job_id": "3901952169",
    "job_title": "Business Development Sales Representative",
    "category": "SALES",
    "job_description": "UNIQUE INDUSTRY OPPORTUNITY\n BUSINESS DEVELOPMENT SALES REPRESENTATIVE (BDSR)\nTO PROVIDE EXISTING AND NEW CUSTOMERS WITH DETAILED INFORMATION ON SERVICES OFFERED BY THE COMPANY TO CAPTURE AND INCREASE SALES.\nRESPONSIBILITY: \nCREATE NEW COMPANY OPPORTUNITIES THROUGH NEW TARGETED ACCOUNTS OR SIGNIFICANT NEW BUSINESS FROM ASSIGNED CUSTOMERS.SCHEDULE APPOINTMENTS WITH NEW OR ASSIGNED CUSTOMERS TO REVIEW SERVICES THAT CAN BE PROVIDED BY THE COMPANY.PLAN AND CONDUCT SALES PRESENTATIONS TO CUSTOMERS WITH SCHEDULED FOLLOW-UP CALLS.BE THE LIAISON BETWEEN THE COMPANY AND KEY CUSTOMERS BY PROVIDING VITAL INFORMATION AS TO NEW PRODUCTS, SERVICES, PRICING AND OR CUSTOMER ORDERS.DEVELOP KEY REFERRAL RELATIONSHIPS IN THE LOCAL TERRITORY TO HELP WITH LEAD GENERATION.CREATE NEW COMPANY OPPORTUNITIES THROUGH NEW TARGETED ACCOUNTS OR SIGNIFICANT NEW BUSINESS FROM ASSIGNED CUSTOMERS.MAINTAIN A PROFESSIONAL ATTITUDE REPRESENTING THE COMPANY IN A POSITIVE MANOR IN ADVERSE SITUATIONS WITH THE CUSTOMER.AUTHORITY:PRIORITIZE AND SCHEDULE CUSTOMER VISITS.REPRESENT THE COMPANY AT CUSTOMERS VISITS AND OUTSIDE EVENTS.RESPONSIBLY ENTERTAIN CLIENTS AT BUSINESS-RELATED EVENTS – E.G., COFFEES, LUNCHES, AND DINNERS.RESPONSIBLY SCHEDULE TRAVEL AND HOTEL ACCOMMODATIONS AS REQUIRED.\nQUALIFICATIONS:MINIMUM 3-5 YEARS WORKING SALES EXPERIENCE.FAMILIAR WITH BUSINESS-TO-BUSINESS SALES.SELF-MOTIVATED AND ABLE TO MANAGE A LOT OF DIFFERENT ACTIVITIES SUCCESSFULLY.ABILITY TO NETWORK SUCCESSFUL NETWORKER.\nALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, NATIONAL ORIGIN, DISABILITY, OR VETERAN'S STATUS.\nAPPLICANTS WITH A DISABILITY OR A DISABLED VETERAN MAY REQUEST A REASONABLE ACCOMMODATION IF HE/SHE IS UNABLE OR LIMITED IN HIS/HER ABILITY TO ACCESS JOB OPENINGS OR APPLY FOR A JOB ON OUR WEBSITE AS A RESULT OF HIS/HER DISABILITY. THE APPLICANT MAY REQUEST REASONABLE ACCOMMODATIONS BY CONTACTING US AT 317-647-6436.",
    "job_skill_set": [
      "sales",
      "business development",
      "customer relationship management",
      "networking",
      "sales presentations",
      "lead generation",
      "appointment scheduling",
      "B2B sales",
      "self-motivated",
      "communication",
      "professionalism",
      "problem solving",
      "time management",
      "adaptability",
      "travel planning"
    ],
    "short_keywords": [
      "adaptability",
      "appointment",
      "b2b",
      "business",
      "communication",
      "customer",
      "development",
      "generation",
      "lead",
      "management",
      "networking",
      "planning",
      "presentations",
      "problem",
      "professionalism",
      "relationship",
      "representative",
      "sales",
      "scheduling",
      "selfmotivated",
      "solving",
      "time",
      "travel"
    ]
  },
  {
    "job_id": "3885101181",
    "job_title": "Sales Manager",
    "category": "SALES",
    "job_description": "POSITION SUMMARY: OUR SALES MANAGER HAS MANAGING PARTNERRESPONSIBILITIES FOR A TEAM OF 5-25 EXECUTIVE CONSULTANTS IN MARKETING J.GALT'S SAAS MEMBERSHIPS AND CONSULTING SERVICES. IN ADDITION, THE MANAGINGPARTNER/SALES MANAGER REPRESENTS J. GALT IN ATTRACTING MEMBERSHIPS THROUGHCHANNEL PARTNERS, STRATEGIC ALLIANCES, CHAMBERS OF COMMERCE, AND STATE,TRADE, AND PROFESSIONAL ASSOCIATIONS.\nOUR MISSION: WE BELIEVE IN HELPING SMALL AND MEDIUM-SIZED BUSINESSESSUCCEED. IT IS TRAGIC THAT MOST BUSINESS OWNERS CARRY THE CREDIT NEEDS OFTHEIR BUSINESS. THEY OFTEN RELY ON PERSONAL CREDIT CARDS, OR THEY SIGNPERSONALLY FOR THE BUSINESS TO ACCESS THE FUNDING, EQUIPMENT, OR FACILITIES THEBUSINESS REQUIRES TO OPERATE.\nWHAT WE DO: J. GALT FINANCE SUITE OFFERS A SAAS PLATFORM AND CONSULTATIVESERVICES TO SMALL AND MEDIUM-SIZED BUSINESS OWNERS. OUR SYSTEM INCLUDES APROVEN 7-STEP PROCESS TO BUILD CREDIT FOR A BUSINESS AROUND THE BUSINESS EINWITHOUT PERSONAL GUARANTEES OR USING THE OWNER’S PERSONAL CREDIT PROFILE.\nJ. GALT IS SEEKING SIX-FIGURE SALES TALENT AND AGGRESSIVE GROWTH-ORIENTEDEXECUTIVES WITH A PROVEN TRACK RECORD OF SUCCESS. SUCCESSFUL CANDIDATES WILLPOSSESS A(N):\n• MINIMUM 10 YEARS OF SUCCESSFUL BUSINESS EXPERIENCE IN A MARKETING-INTENSIVE BUSINESS• UNCOMPROMISING NEED FOR TOP-LEVEL EARNINGS• HIGH ENERGY, SELF-DISCIPLINED, SELF-STARTER WITH A POSITIVE ATTITUDE• GOAL-ORIENTED WITH A LIFELONG QUEST FOR PERSONAL DEVELOPMENT AND CAREER GROWTH• PERSUASIVE COMMUNICATION SKILLS IN ORAL & WRITTEN FORM• COMFORTABLE SPEAKING IN FRONT OF GROUPS IN PERSON OR VIRTUALLY• TOP-NOTCH CONSULTATIVE SALES SKILLS• COMFORTABLE MARKETING TO PROFESSIONALS AND C-LEVEL EXECUTIVES• SUPERIOR TIME MANAGEMENT AND ORGANIZATION SKILLS AND A DESIRE TO WORK FROM A HOME-BASED OFFICE• PROFESSIONAL APPEARANCE AND DEMEANOR• PASSION TO MARKET A SAAS PRODUCT THAT SOLVES A SMALL BUSINESS OWNER'S MOST VEXING PROBLEM\nWHY J. GALT? | WHAT WE OFFER• 1ST-YEAR EARNINGS EXPECTATIONS OF $125K-$175K• LONG-TERM EARNINGS EXPECTATIONS OF $350K+• WEEKLY PERSONAL PRODUCTION EARNINGS• WEEKLY OVERRIDE TEAM PRODUCTION EARNINGS• $7,500 QUICK START BONUS AFTER 90 DAYS.• $5,000 MONTHLY PERSONAL PERFORMANCE BONUS• $5,000 MONTHLY BUSINESS UNIT PERFORMANCE BONUS• 5-FIGURE QUARTERLY AND 6-FIGURE ANNUAL BONUS OPPORTUNITIES FOR TOPPRODUCERS• SUBSTANTIAL OPPORTUNITY FOR PROMOTION AND CAREER ADVANCEMENT• ADDITIONAL EARNINGS FROM CROSS-PROMOTION STRATEGIES WITH SISTERCOMPANIES IN THE COST-REDUCTION CONSULTING SPACE\nPROMOTION OPPORTUNITIES: CHIEF REVENUE OFFICER | EQUITY STAKEHOLDER\nMAIN DUTIES & RESPONSIBILITIESTHE MANAGING PARTNER CONTRIBUTES SIGNIFICANTLY TO PERSONAL PRODUCTION,KEY CHANNEL RELATIONSHIPS, AS WELL AS HIRING, TRAINING, AND DEVELOPING ATEAM OF 5-25 EXECUTIVE CONSULTANTS. IN SUMMATION, A MANAGING PARTNERHAS COMPLETE CONTROL OF A J. GALT BUSINESS CREDIT CONSULTING PRACTICE.\nRESPONSIBILITIES INCLUDE:• ATTRACTING MEMBERSHIPS THROUGH CHANNEL PARTNERS• FORMING STRATEGIC ALLIANCES WITH STATE, TRADE, AND PROFESSIONAL ASSOCIATIONS• FORMING PARTNERSHIPS WITH CHAMBERS OF COMMERCE• IN-PERSON AND VIRTUAL PRESENTATIONS• DELIVERING BUSINESS CREDIT SEMINARS TO GROUPS OF 5-50 BUSINESS OWNERS• MONITORING AND IMPROVING THE SALES PERFORMANCE OF DIRECT REPORTS• DEVELOPING SALES STRATEGIES• MANAGING THE SALES PROCESS THROUGH THE J. GALT SALES APP• LEADING TEAM MEETINGS• MEETING MONTHLY, QUARTERLY, AND ANNUAL SALES TARGETS",
    "job_skill_set": [
      "sales management",
      "team management",
      "business development",
      "time management",
      "sales strategy development",
      "performance monitoring",
      "communication",
      "goal-oriented",
      "self-discipline",
      "positive attitude",
      "persuasion",
      "leadership",
      "organizational skills",
      "personal development",
      "adaptability",
      "professional demeanor",
      "consultative sales",
      "marketing",
      "presentation skills",
      "SaaS knowledge"
    ],
    "short_keywords": [
      "adaptability",
      "attitude",
      "business",
      "communication",
      "consultative",
      "demeanor",
      "development",
      "goaloriented",
      "knowledge",
      "leadership",
      "management",
      "manager",
      "marketing",
      "monitoring",
      "organizational",
      "performance",
      "personal",
      "persuasion",
      "positive",
      "presentation",
      "professional",
      "saas",
      "sales",
      "selfdiscipline",
      "skills",
      "strategy",
      "team",
      "time"
    ]
  },
  {
    "job_id": "3903883574",
    "job_title": "Sales Associate",
    "category": "SALES",
    "job_description": "OUR SALES ASSOCIATE ARE ICONIC, APPROACHABLE, AND CONNECTED TO OUR CUSTOMERS. THEY PROVIDE INDIVIDUALIZED EXPERIENCES THROUGH AUTHENTIC CUSTOMER CONNECTIONS, OFFERING EXPERT STYLING ADVICE. THEY BUILD RELATIONSHIPS NATURALLY AND EMBRACE INDIVIDUALITY AND DIVERSITY.\n\nWHO YOU ARE\n\nFRIENDLY, HELPFUL, OPTIMISTIC, AND ENTHUSIASTIC.PASSION FOR SELLING & BUILDING GENUINE RELATIONSHIPS WITH YOUR CUSTOMERS.ACHIEVES AND EXCEEDS GOALS BY DELIVERING EXCEPTIONAL EXPERIENCES IN-STORE AND E-COMMERCE.PARTICIPATES IN OPEN DIALOG WITH TEAM MEMBERS.CELEBRATES TEAM PROGRESS AND ENCOURAGES OTHERS TO EXCEED.WORK WITH THE TEAM TO MAINTAIN A BEAUTIFULLY PRESENTED STORE.CREATES AND MAINTAINS A POSITIVE AND PRODUCTIVE WORK ENVIRONMENT THAT FOSTERS DIVERSITY, INCLUSIVITY, TEAMWORK, CREATIVITY, AND A PASSION FOR THE BRAND.OTHER DUTIES AS ASSIGNED.\n\nWHAT YOU’LL DO\n\nABILITY TO WORK IN A FAST-PACED, INSPIRING COMPANY.GREAT COMMUNICATION AND OPTIMISTIC PROBLEM-SOLVER.FLEXIBILITY TO SUPPORT NON-SELLING ACTIVITIES TO MEET THE NEEDS OF BUSINESS.AVAILABILITY TO WORK WHEN NEEDED, INCLUDING NIGHTS AND WEEKENDS AND HOLIDAYS.ENGAGE WITH CLIENTS TO CREATE A LIFE- LONG EXPERIENCE THERE CAPTURING THEIR CUSTOMER PROFILE.ACTS WITH AUTHENTICITY, SINCERITY, AND TRANSPARENCY.\n\nWHY YOU’LL LOVE US\n\nTHE PRODUCT—SO GOOD, YOU’LL BE USING YOUR EMPLOYEE DISCOUNT MORE THAN YOU PROBABLY SHOULD.THE PEOPLE—ASK ANYONE THAT WORKS HERE…WE HAVE INCREDIBLE PEOPLE ON OUR TEAM.THE EXPERIENCE—YOU’LL ENJOY A REWARDING CAREER AT A RESPECTED LUXURY CHILDREN’S BRAND.THE BENEFITS —401K MATCH (BASED ON HOURS WORKED), WELLNESS SERVICES FOR YOUR CONVENIENCE, AND FLEXIBLE SCHEDULE.40% OFF MERCHANDISE EMPLOYEE DISCOUNT AT JANIE AND JACK.FUN WORK ENVIRONMENT.\n\nACTUAL STARTING PAY FOR THIS ROLE IS DETERMINED BY A WIDE ARRAY OF FACTORS INCLUDING BUT NOT LIMITED TO QUALIFICATIONS, EXPERIENCE, RELEVANT SKILLS, EDUCATION, AND GEOGRAPHIC LOCATION. EMPLOYEES ARE OFFERED A VARIETY OF BENEFITS TO EMPOWER THEM WITH THE RESOURCES AND FLEXIBILITY THEY NEED TO ENJOY SUCCESS ON THE JOB AND TO LIVE A HEALTHY LIFE. FULL-TIME EMPLOYEES ARE ELIGIBLE FOR MEDICAL INSURANCE, DENTAL INSURANCE, VISION INSURANCE, HEALTH AND DEPENDENT CARE FSA, LIFE/AD&D INSURANCE, SHORT TERM AND LONG-TERM DISABILITY, COMMUTER BENEFITS, PET BENEFITS, TUITION REIMBURSEMENT, PAID TIME OFF AND 401(K) INCLUDING MATCHING. ALL EMPLOYEES ARE ELIGIBLE FOR EMPLOYEE DISCOUNTS AND EAP RESOURCES. SALES LEADS, ASSISTANT MANAGERS, GENERAL MANAGERS AND DISTRICT MANAGERS ARE ELIGIBLE FOR THE QUARTERLY BONUS PROGRAM.",
    "job_skill_set": [
      "customer service",
      "sales",
      "store presentation",
      "communication",
      "teamwork",
      "problem solving",
      "flexibility",
      "relationship building",
      "optimism",
      "authenticity",
      "e-commerce",
      "styling advice",
      "creativity"
    ],
    "short_keywords": [
      "advice",
      "associate",
      "authenticity",
      "building",
      "communication",
      "creativity",
      "customer",
      "ecommerce",
      "flexibility",
      "optimism",
      "presentation",
      "problem",
      "relationship",
      "sales",
      "service",
      "solving",
      "store",
      "styling",
      "teamwork"
    ]
  },
  {
    "job_id": "3895210736",
    "job_title": "Insurance Sales Producer",
    "category": "SALES",
    "job_description": "COMPANY DESCRIPTIONBRIGHTWAY INSURANCE IS A LEADING PROPERTY/CASUALTY INSURANCE DISTRIBUTION COMPANY WITH OVER 300 FRANCHISES IN 32 STATES. ESTABLISHED IN 2008, BRIGHTWAY PROVIDES CUSTOMIZED COVERAGE SOLUTIONS FROM A RANGE OF INSURERS ALONG WITH COMPREHENSIVE BACK OFFICE AND MARKETING SUPPORT. THE COMPANY HAS A STRONG TRACK RECORD OF SUCCESS, WITH OVER $980 MILLION IN ANNUAL PREMIUM AND A FOCUS ON HELPING AGENTS AND PRODUCERS GROW THEIR BUSINESS AND BECOME TRUSTED ADVISORS TO THEIR CUSTOMERS.\nROLE DESCRIPTIONTHIS IS A FULL-TIME HYBRID ROLE AS AN INSURANCE SALES PRODUCER AT THE MAMOUZELOS FAMILY AGENCY. THE INSURANCE SALES PRODUCER WILL BE RESPONSIBLE FOR DAY-TO-DAY TASKS RELATED TO SELLING INSURANCE, INCLUDING PROSPECTING AND ACQUIRING NEW CUSTOMERS, PROVIDING CUSTOMER SERVICE, AND EDUCATING CLIENTS ON AVAILABLE COVERAGE OPTIONS. THIS ROLE IS LOCATED IN CLEARWATER, FL, WITH FLEXIBILITY FOR SOME REMOTE WORK.\nQUALIFICATIONSSTRONG SALES SKILLS WITH EXPERIENCE IN INSURANCE SALESEXCELLENT COMMUNICATION AND CUSTOMER SERVICE SKILLSABILITY TO BUILD AND MAINTAIN CLIENT RELATIONSHIPSSELF-MOTIVATED AND GOAL-ORIENTEDABILITY TO WORK INDEPENDENTLY AND AS PART OF A TEAMINSURANCE LICENSURE OR WILLINGNESS TO OBTAIN LICENSUREPRIOR EXPERIENCE IN THE INSURANCE INDUSTRY IS A PLUS",
    "job_skill_set": [
      "customer service",
      "client relationship management",
      "communication",
      "insurance sales",
      "insurance licensure",
      "prospecting",
      "self-motivation",
      "goal-oriented",
      "teamwork",
      "independence"
    ],
    "short_keywords": [
      "client",
      "communication",
      "customer",
      "goaloriented",
      "independence",
      "insurance",
      "licensure",
      "management",
      "producer",
      "prospecting",
      "relationship",
      "sales",
      "selfmotivation",
      "service",
      "teamwork"
    ]
  },
  {
    "job_id": "3906255645",
    "job_title": "Sales Specialist, Miami",
    "category": "SALES",
    "job_description": "THE TEAM:\n\nTHE HERMÈS MIAMI BOUTIQUE OPENED IN 2002 AND FOCUSES ON PROVIDING EXTRAORDINARY SERVICE TO CLIENTS AS A PART OF THE SOUTHEASTERN REGION. THIS POSITION WILL REPORT TO THE MANAGING DIRECTOR AND WILL WORK COLLABORATIVELY WITH THE SALES TEAM AND SELLING SUPPORT TEAMS TO SUPPORT THE CLIENT EXPERIENCE IN A FAST-PACED, LUXURY ENVIRONMENT.\n\nTHE OPPORTUNITY:\n\nTHE PRIMARY RESPONSIBILITIES OF A SALES SPECIALIST ARE TO ACHIEVE SELLING AND CUSTOMER SERVICE OBJECTIVES WHILE ADHERING TO THE OPERATIONAL ASSET PROTECTION STANDARDS OF THE BOUTIQUE.\n\nABOUT THE ROLE:\n\nSALES OBJECTIVES\n\nACCOUNTABLE FOR MEETING MONTHLY AND ANNUAL INDIVIDUAL SALES GOALS WHILE WORKING AS PART OF A TEAM FOR THE BOUTIQUE TO ACHIEVE ITS COLLECTIVE TARGET.ORGANIZE AND PRIORITIZE THE SELLING FLOOR TO SUPPORT THE SALES EFFORT AND OVERALL CUSTOMER EXPERIENCE. ENSURE ALL ITEMS (BAGS, BOXES, NOTE CARDS, RIBBON, STATIONARY AND THE LIKE) ARE STORED AT ALL TIMES. MAINTAIN SELLING FLOOR TO MEET STANDARDS TO INCLUDING STRAIGHTENING, FILLING IN AND REPLENISHMENT OF NEW RECEIPTS FOLLOWING VM GUIDELINES, PHYSICAL EAS TAGGING, TICKETING, ETC.PROVIDES ASSISTANCE AS NEEDED IN INVENTORY PREPARATION.\n\nPOS\n\nRESPONSIBLE FOR PROCESSING AND ENSURING THE ACCURACY OF ALL TRANSACTIONS INCLUDING RECEIPTS, CRM FILES (WHICH PROVIDE MEANINGFUL DETAIL OF PURCHASE HISTORY AND SALES ANALYSIS, SKUS, MONETARY PAYMENT AND CLIENT VERIFICATION), AND THE ADMINISTRATIVE SUPPORT OF AFTER SALES SERVICE WHEN NEEDED.PARTNERS WITH MANAGEMENT ON POS DECISIONS AND COMMUNICATES DISCREPANCIES, SHOULD THEY OCCUR, DURING THE OPENING, CLOSING AND GENERAL POS VARIANCES BY END OF BUSINESS DAY.MAINTAIN CLEANLINESS AND ORGANIZATION OF WORKSTATION AT ALL TIMES.\n\nASSET PROTECTION\n\nRESPONSIBLE FOR COMPLYING WITH ALL ASSET PROTECTION PROCEDURES SUCH AS EMPLOYEE SIGN IN SHEETS, BAG CHECKS IN CONJUNCTION WITH AP AS APPLICATION. PRACTICE APPROPRIATE AP TECHNIQUES AND FOLLOWS ALL GUIDELINES FOR KEY CONTROL AND MERCHANDISE SECURITY. RESPECTS PHYSICAL EAS TAGGING GUIDELINES AND ENSURE ALL PRODUCTS ARE PROPERLY TICKETED (ON FLOOR, BACK OF HOUSE AND MERCHANDISE RETURNS). PROPERLY PREPARES FOR PHYSICAL INVENTORY AND PARTICIPATES IN MONTHLY CYCLE COUNTS (OR AS DIRECTED BY MANAGEMENT).\n\nCUSTOMER SERVICE\n\nCONSISTENTLY PROVIDE HIGH LEVELS OF SERVICE TO OUR CLIENTS WITHIN THE HERMÈS STANDARD OF SERVICE: PROMPT AND FRIENDLY GREETING, OFFER TO ASSIST AND ANSWER QUESTIONS, AND ASSISTANCE WITH WRAPPING AND PACKAGING AT POS\n\nSUPERVISORY RESPONSIBILITY:\n\nNO\n\nBUDGET RESPONSIBILITY:\n\nNO\n\nDECISION MAKING RESPONSIBILITY:\n\nNO\n\nABOUT YOU:\n\n2+ YEARS OF EXPERIENCE IN SALES, EXPERIENCE IN A LUXURY ENVIRONMENT PREFERREDSTRONG RELATIONSHIP DEVELOPMENT AND IMPECCABLE COMMUNICATION SKILLSEVEN-TEMPERED WITH ABILITY TO CONTINUOUSLY MULTI-TASKSELF-STARTER AND ABLE TO WORK INDEPENDENTLY WHILE BALANCING COLLABORATION WITH A TEAMSTRONG ORGANIZATIONAL SKILLSOPEN AVAILABILITY TO ACCOMMODATE NEEDS OF THE BUSINESSABILITY TO LIFT BETWEEN 0-25 LBS. WITHOUT ASSISTANCE\n\nWE ARE LOOKING FOR A CANDIDATE WHO HAS A COMBINATION OF THE ABOVE ATTRIBUTES AND CAN PERFORM THE KEY FUNCTIONS OF THE ROLE WITH OR WITHOUT REASONABLE ACCOMMODATIONS.\n\nCOMPANY OVERVIEW\n\nSINCE 1837, HERMÈS HAS REMAINED FAITHFUL TO ITS ARTISAN BUSINESS MODEL AND HUMANIST VALUES. WE PLACE PEOPLE AT THE HEART OF WHAT WE DO AND ASPIRE TO MAKE A POSITIVE IMPACT ON THE WORLD. THE FREEDOM TO CREATE, THE CONSTANT SEARCH FOR BEAUTIFUL MATERIALS, THE TRANSMISSION OF A SAVOIR-FAIRE OF EXCELLENCE AND THE AESTHETIC OF FUNCTIONALITY DEFINE THE SINGULARITY OF HERMÈS, A HOUSE DEDICATED TO MAKING HIGHLY-CRAFTED, BEAUTIFUL OBJECTS MADE TO STAND THE TEST OF TIME .\n\nAN INDEPENDENT, FAMILY-OWNED COMPANY, HERMÈS IS DEDICATED TO KEEPING PRODUCTION IN FRANCE THROUGH ITS 42 WORKSHOPS, THE HERMÈS ORGANIZATION IS ALSO A TRULY GLOBAL COMMUNITY WITH A NETWORK OF 310 STORES IN 49 COUNTRIES. HERMÈS EMPLOYS MORE THAN 15,000 PEOPLE WORLDWIDE WITH OVER 6,000 OF THE WORKFORCE BEING HERMÈS CRAFTSPEOPLE ENGAGED IN MAKING ARTISANAL PRODUCTS, NURTURING A 180+ YEAR TRADITION OF CREATIVITY AND INNOVATION.\n\nAT HERMÈS, OUR ACTIONS FOR SUSTAINABLE DEVELOPMENT AND CORPORATE SOCIAL RESPONSIBILITY ARE FOUNDED IN VALUES PASSED DOWN BY GENERATIONS OF HUMBLE ARTISANS WHO HAVE SHAPED THE STORY OF OUR HOUSE AND THE INTEGRITY OF OUR OBJECTS. THE ROOTS OF HERMÈS' SUCCESS AND LONGEVITY LIE IN A SENSE OF RESPONSIBILITY; A QUEST FOR AUTHENTICITY AND RESPECT FOR TIME AND PRESERVATION OF NATURAL RESOURCES. ALL AT HERMÈS WISH TO LEAVE A POSITIVE FOOTPRINT ON THE WORLD, A MISSION THAT'S AT THE HEART OF OUR COMMITMENT TO PROGRESS. THIS NARRATIVE CAN BE EXPERIENCED IN A SERIES OF SHORT FILMS “FOOTSTEPS ACROSS THE WORLD” AVAILABLE ON OUR WEBSITE.\n\nOUR COMMITMENT\n\nFAMILY IS AT THE HEART OF HERMÈS. AT HERMÈS OF PARIS, WE ARE COMMITTED TO BEING A MAISON FOR ALL, A HOME WHERE WE MAKE EFFORTS TO GENERATE, SUPPORT AND ADVANCE THE VALUES OF DIVERSITY, INCLUSION AND FAMILY BOTH WITHIN OUR OWN WALLS AND IN THE WIDER WORLD. AT HERMÈS OF PARIS WE LOOK TO CREATE A DIVERSE WORKFORCE OF TALENTED AND UNIQUE INDIVIDUALS WITH DIFFERENT BACKGROUNDS, SKILLSETS AND WORLDVIEWS THAT WILL ENRICH OUR HERMÈS OF PARIS FAMILY. WE SUPPORT OUR INDIVIDUAL TEAM MEMBERS PERSONAL AND PROFESSIONAL SUCCESS THROUGH A CULTURE THAT VALUES EQUALITY, INDIVIDUALITY AND FAIRNESS AND THROUGH AN ENVIRONMENT WHERE INDIVIDUALS CAN THRIVE AND FEEL COMFORTABLE BEING THEIR AUTHENTIC SELVES. BEYOND THE WALLS OF OUR MAISON, WE ADVANCE OUR DIF VALUES THROUGH THE WORK THAT WE DO IN PARTNERSHIP WITH OUR COMMUNITY AND NON-PROFIT PARTNERS.\n\nAT HERMÈS OF PARIS, WE ARE PROUD TO BE AN EQUAL OPPORTUNITY WORKPLACE. IT IS THE POLICY OF HERMÈS OF PARIS, INC. THAT APPLICANTS FOR EMPLOYMENT ARE RECRUITED, SELECTED AND HIRED ON THE BASIS OF INDIVIDUAL MERIT AND ABILITY WITH RESPECT TO POSITIONS BEING FILLED AND POTENTIAL FOR PROMOTION OR TRANSFER WHICH MAY BE EXPECTED TO DEVELOP. APPLICANTS ARE RECRUITED, SELECTED AND HIRED WITHOUT DISCRIMINATION BECAUSE OF RACE, COLOR, RELIGION, SEX, AGE, NATIONAL ORIGIN, DISABILITY, GENETIC INFORMATION, SEXUAL ORIENTATION, CITIZENSHIP, MILITARY OR VETERAN STATUS OR ANY OTHER BASIS PROHIBITED BY APPLICABLE LAW. IN ADDITION, PERSONNEL PROCEDURES AND PRACTICES WITH REGARD TO TRAINING, PROMOTION, TRANSFER, COMPENSATION, DEMOTION, LAY OFF OR TERMINATION ARE TO BE ADMINISTERED WITH DUE REGARD TO JOB PERFORMANCE, EXPERIENCE AND QUALIFICATIONS, BUT WITHOUT DISCRIMINATION BECAUSE OF RACE, COLOR, RELIGION, SEX, AGE, NATIONAL ORIGIN, DISABILITY, GENETIC INFORMATION, SEXUAL ORIENTATION, CITIZENSHIP, MILITARY OR VETERAN STATUS OR ANY OTHER BASIS PROHIBITED BY APPLICABLE LAW. HERMÈS OF PARIS, INC. ALSO PROVIDES REASONABLE ACCOMMODATIONS TO QUALIFIED INDIVIDUALS WITH DISABILITIES, IN ACCORDANCE WITH APPLICABLE LAWS.\n\nWE COLLECT PERSONAL INFORMATION (PI) FROM YOU IN CONNECTION WITH YOUR APPLICATION FOR EMPLOYMENT WITH HERMES, INCLUDING THE FOLLOWING CATEGORIES OF PI: IDENTIFIERS, PERSONAL RECORDS, COMMERCIAL INFORMATION, PROFESSIONAL OR EMPLOYMENT INFORMATION, NON-PUBLIC EDUCATION RECORDS, AND INFERENCES DRAWN FROM YOUR PI. WE COLLECT YOUR PI FOR OUR PURPOSES, INCLUDING PERFORMING SERVICES AND OPERATIONS RELATED TO YOUR POTENTIAL EMPLOYMENT. FOR ADDITIONAL DETAILS OR IF YOU HAVE QUESTIONS, CONTACT US AT CCPA@HERMES.COM. PLEASE DO NOT SUBMIT RESUMES OR APPLICATIONS TO THIS EMAIL ADDRESS.",
    "job_skill_set": [
      "sales",
      "customer service",
      "inventory management",
      "organizational skills",
      "communication",
      "teamwork",
      "relationship development",
      "multi-tasking",
      "self-starter",
      "independence",
      "collaboration",
      "adaptability",
      "POS systems",
      "asset protection procedures",
      "CRM software",
      "merchandising"
    ],
    "short_keywords": [
      "adaptability",
      "asset",
      "collaboration",
      "communication",
      "crm",
      "customer",
      "development",
      "independence",
      "inventory",
      "management",
      "merchandising",
      "miami",
      "multitasking",
      "organizational",
      "pos",
      "procedures",
      "protection",
      "relationship",
      "sales",
      "selfstarter",
      "service",
      "skills",
      "software",
      "specialist",
      "systems",
      "teamwork"
    ]
  },
  {
    "job_id": "3888034270",
    "job_title": "Account Director - Leisure Sales (Miami or New York)",
    "category": "SALES",
    "job_description": "JOB DESCRIPTION:\n\n WHY WYNDHAM? BY JOINING WYNDHAM HOTELS & RESORTS, YOU WILL PLAY AN INTEGRAL ROLE IN OUR MISSION TO MAKE HOTEL TRAVEL POSSIBLE FOR ALL. YOU’LL BE PART OF THE LARGEST HOTEL FRANCHISE COMPANY IN THE WORLD, WHERE WE STRIVE TO DELIVER THE BEST VALUE TO OUR OWNERS AND GUESTS. MOST IMPORTANTLY, YOU’LL BE ENTRUSTED TO LIVE OUR UNIQUE COUNT ON ME CULTURE, SET BY OUR CORE VALUES OF INTEGRITY, ACCOUNTABILITY, INCLUSIVE, CARING AND FUN. AT WYNDHAM, WE PROVIDE ALL TEAM MEMBERS THE OPPORTUNITY TO GROW THROUGH BEST-IN-CLASS TRAINING AND CAREER DEVELOPMENT, LEADERSHIP TRAINING, MENTORSHIP OPPORTUNITIES AND EDUCATIONAL SUPPORT. SUPPORTING OUR TEAM MEMBERS IS A TOP PRIORITY, WHICH IS WHY WE OFFER COMPETITIVE COMPENSATION AND BENEFITS, VACATION, TEAM MEMBER APPRECIATION DAYS, WORKPLACE FLEXIBILITY AND MUCH MORE. AT WYNDHAM HOTELS & RESORTS, WE VALUE AND EMBRACE A CULTURE OF DIVERSITY, EQUITY AND INCLUSION THAT SUPPORTS TEAM MEMBERS OF ALL BACKGROUNDS AND EXPERIENCES. WE CAN’T WAIT TO WELCOME YOU! THE ROLE THE STRATEGIC ACCOUNT DIRECTOR OF LEISURE SALES IS RESPONSIBLE FOR THE OVERALL SALES FOR WYNDHAM HOTELS & RESORTS, IN ALL ASPECTS OF THE LEISURE MARKET INCLUDING A SPECIFIC FOCUS ON DRIVING SALES TO THE CARIBBEAN AND MEXICO MARKETS. IN ADDITION, THEY WILL BE RESPONSIBLE FOR MAINTAINING CLIENT RELATIONSHIPS WITH WHOLESALE ACCOUNTS, LARGE THIRD-PARTY LEISURE ACCOUNTS AND FIT CLIENTS. \n  WHAT YOU'LL DO DEVELOP SALES STRATEGIES AND TACTICAL PLANS FOR THE LEISURE MARKET SEGMENT TO ACHIEVE REVENUE AND ROOM NIGHT GOALS. BUILD AND STRENGTHEN RELATIONSHIPS WITH EXISTING AND NEW CUSTOMERS TO ENABLE FUTURE BOOKINGS.TARGET ACCOUNTS, MARKETS, OR SEGMENTS WITH HEAVY EMPHASIS ON PROACTIVE SOLICITATION AND ACCOUNT SATURATION.UTILIZE NEGOTIATING SKILLS AND CREATIVE SELLING ABILITIES TO CLOSE ON BUSINESS AND NEGOTIATE CONTRACTS.MANAGE COMPLEX BUSINESS INTERACTIONS AND NEGOTIATIONS.LEVERAGE RELATIONSHIPS WITH KEY AND TARGET ACCOUNTS TO INCREASE MARKET SHARE.QUARTERLY BUSINESS REVIEWS WITH DESIGNATED OWNERSHIP GROUPS.RECOMMEND, PLAN, AND PARTICIPATE IN SALES TRIPS AND INDUSTRY RELATED MEETINGS AS APPROPRIATE.   YOU'LL BE SUCCESSFUL IF YOU HAVE MUST BE ABLE TO WORK WELL IN STRESSFUL, HIGH-PRESSURE SITUATIONS, INCLUDING ABILITY TO HANDLE CLIENT OBJECTIONS AND DISPUTES TO ACHIEVE SATISFACTORY RESULTS. ABILITY TO MULTI-TASK, PRIORITIZE AND MEET SIMULTANEOUS DEADLINES WITH ATTENTION TO DETAIL. DEMONSTRATED SELF-STARTER, EXHIBITING INITIATIVE, CONFIDENCE, PROFESSIONALISM, AND GOOD JUDGMENT.EXHIBIT EXCELLENT INTERPERSONAL AND COMMUNICATION SKILLS TO WORK WITH PEOPLE AT ALL LEVELS AND FROM ALL BACKGROUNDS AND PARTS OF THE WORLD.  REQUIRED QUALIFICATIONS/EXPERIENCE 4-YEAR BACHELOR’S DEGREE IN BUSINESS ADMINISTRATION, MARKETING, HOTEL AND RESTAURANT MANAGEMENT, OR RELATED MAJOR OR EXPERIENCE COMMENSURATE WITH ROLE AND RESPONSIBILITY.5 YEARS OF EXPERIENCE IN LEISURE SALES.STRONG PROFESSIONAL PRESENTATION SKILLS.GLOBAL AND/OR MULTI PROPERTY EXPERIENCE.PROFICIENCY IN MICROSOFT OFFICE APPLICATIONS (WORD, EXCEL, POWERPOINT, ETC.).REMOTE BASED IN NEW YORK CITY OR MIAMI.CARIBBEAN/ MEXICO MARKET EXPERIENCE PREFERRED.BI-LINGUAL (SPANISH) A PLUS.",
    "job_skill_set": [
      "sales strategies",
      "client relationship management",
      "business development",
      "communication",
      "problem solving",
      "multi-tasking",
      "initiative",
      "professionalism",
      "interpersonal skills",
      "negotiation",
      "Microsoft Office",
      "presentation skills",
      "leisure sales experience",
      "bilingual (Spanish)",
      "market analysis",
      "industry knowledge (Caribbean/Mexico)",
      "attention to detail",
      "stress management",
      "judgment"
    ],
    "short_keywords": [
      "account",
      "analysis",
      "attention",
      "bilingual",
      "business",
      "caribbeanmexico",
      "client",
      "communication",
      "detail",
      "development",
      "director",
      "experience",
      "industry",
      "initiative",
      "interpersonal",
      "judgment",
      "knowledge",
      "leisure",
      "management",
      "market",
      "miami",
      "microsoft",
      "multitasking",
      "negotiation",
      "new",
      "office",
      "or",
      "presentation",
      "problem",
      "professionalism",
      "relationship",
      "sales",
      "skills",
      "solving",
      "spanish",
      "strategies",
      "stress",
      "to",
      "york"
    ]
  },
  {
    "job_id": "3895531328",
    "job_title": "Sales Lead",
    "category": "SALES",
    "job_description": "OVERVIEW\n\nYOU GET IT. IT IS ALL ABOUT THE IN-STORE CUSTOMER EXPERIENCE. IT’S JUST AS EASY FOR YOU TO CONNECT WITH KIDS AS IT IS WITH PARENTS, AND YOU ENJOY SHARING YOUR ENTHUSIASM FOR KIDS’ ATHLETIC SNEAKERS AND APPAREL. YOU ADAPT TO DIFFERENT KINDS OF CUSTOMERS, AND RESOLVE ISSUES WITH A SMILE. YOU ALSO LIKE TO TEACH OTHERS TO DO THE SAME. LEADING THE TEAM, YOU WILL BE EXPECTED TO DRIVE SALES TO MAXIMIZE PROFITS FOLLOWING DIVISION STANDARDS. YOUR PERFORMANCE WILL BE MEASURED BY YOUR ABILITY TO ACHIEVE PERSONAL AND PRODUCTIVITY GOALS. YOU WILL ASSUME LEADERSHIP AND MANAGERIAL RESPONSIBILITIES WHEN THE STORE MANAGER AND ASSISTANT MANAGER ARE ABSENT.\n\nRESPONSIBILITIES\n\nINSPIRE, AND MOTIVATE YOUR TEAM TO DRIVE SALES THAT DELIVER EXCEPTIONAL CUSTOMER SERVICEENSURING HIGH LEVELS OF CUSTOMER SATISFACTION BY BEING KNOWLEDGEABLE ON ALL PRODUCTS OFFERED, AND TEAMING UP WITH CO-WORKERS TO PROVIDE EXCELLENT SALES SERVICEDELIVERING SALES, CUSTOMER EXPERIENCE, MERCHANDISING, VISUAL, AND OPERATIONAL EXPECTATIONSMAINTAINING PERSONAL AND PRODUCTIVITY GOALSUPHOLD THE QUALITY AND PRODUCTIVITY OF EVERY ASPECT OF YOUR STOREACT AS A PARTNER BETWEEN CUSTOMERS, SALES ASSOCIATES, ASSISTANT MANAGER AND THE STORE MANAGERABILITY TO LEARN AND SHARE EXPERTISE OF PRODUCTS AND TRENDS TO FIT CUSTOMER’S NEEDSMAINTAINS AN AWARENESS OF ALL PRODUCT KNOWLEDGE, AND CURRENT OR UPCOMING PRODUCT / TRENDSCONTRIBUTES TO A POSITIVE AND INCLUSIVE WORK ENVIRONMENT \n\nQUALIFICATIONS\n\nAT LEAST 1 YEAR OF RETAIL EXPERIENCECONFIDENT AND COMFORTABLE ENGAGING CUSTOMERS TO DELIVER AN ELEVATED EXPERIENCEMOTIVATED TO ACHIEVE GREAT RESULTS BECAUSE OF ONE'S ENTHUSIASM FROM INTERACTING WITH CUSTOMERS AND ATHLETIC PRODUCTSINITIATES COMPLETION OF TASKS OR ACTIVITIES WITHOUT NECESSARY SUPERVISIONFLEXIBLE AVAILABILITY – INCLUDING NIGHTS, WEEKENDS, AND HOLIDAYS\n\nBENEFITS\n\nPAY RATE: $18.25/HR",
    "job_skill_set": [
      "retail experience",
      "product knowledge",
      "sales",
      "merchandising",
      "visual merchandising",
      "customer service",
      "team leadership",
      "communication",
      "problem solving",
      "adaptability",
      "collaboration",
      "enthusiasm",
      "operational management",
      "motivation"
    ],
    "short_keywords": [
      "adaptability",
      "collaboration",
      "communication",
      "customer",
      "enthusiasm",
      "experience",
      "knowledge",
      "lead",
      "leadership",
      "management",
      "merchandising",
      "motivation",
      "operational",
      "problem",
      "product",
      "retail",
      "sales",
      "service",
      "solving",
      "team",
      "visual"
    ]
  },
  {
    "job_id": "3887577491",
    "job_title": "Manager Business Sales Agency - Hybrid",
    "category": "SALES",
    "job_description": "RESPONSIBILITIES\n\nTHE INCUMBENT(S) IN THIS POSITION SHOULD EXHIBIT THE FOLLOWING ACOSTA VALUES:\n\nPEOPLE MINDED – MUST SHOW DIGNITY AND RESPECT TO ALL PEOPLE\n\nINTEGRITY – MUST EXEMPLIFY THE HIGHEST DEGREE OF ETHICAL BEHAVIOR\n\nRESULTS ORIENTED – MUST SHOW PASSION, PRIDE AND COMMITMENT TO SUCCEED\n\nTRUST – MUST BE HONEST, SINCERE AND CONFIDENT\n\nTEAMWORK – MUST BUILD TRUSTING RELATIONSHIPS\n\nINNOVATION – MUST PROGRESS THROUGH A COMBINATION OF CREATIVITY, COMMON SENSE AND VISION\n\nBALANCE – MUST MAINTAIN AN OPTIMISTIC ATTITUDE AND KEEP PERSPECTIVE ON WHAT IS IMPORTANT IN LIFE.\n\nESSENTIAL FUNCTIONS:\n\nWE PROVIDE OUR CLIENT AND CUSTOMERS THE TOOLS NEEDED TO DELIVER SOLUTIONS AND ACHIEVE THEIR GOALS WITH MERCHANDISING, ASSORTMENT, PRICING, AND SHELF POSITIONING. THESE INITIATIVES RESULT IN MAXIMIZING MARKET SHARE.\n\nWE ARE SEEKING SELF-MOTIVATED PROFESSIONALS WHO CAN CREATE THESE SOLUTIONS AND HAVE THE ABILITY TO:\n\nCOORDINATE CLIENTS' MARKET VISITS AND KEY ACCOUNT CALLS.COMMUNICATE CLIENTS' PRIORITIES TO RETAIL SALES ORGANIZATION TO DELIVER IN-STORE PRESENCE AND BUSINESS OBJECTIVES.MANAGE AND PARTICIPATE IN THE DEVELOPMENT, DESIGN AND PRESENTATION OF ACOSTA INTRODUCTION TONEW CLIENTS.PROVIDE FEEDBACK ON THE EFFECTIVENESS OF OUR CLIENTS' STRATEGIES, SELLING PROGRAMS, AND INITIATIVES.MAINTAIN CURRENT ACCOUNT DISTRIBUTION INFORMATION.PROVIDE FEEDBACK ON HOW TO BUILD ORGANIZATIONAL CAPACITY AND IMPROVE OUR BUSINESS.\n\n\nQUALIFICATIONS\n\nBACHELOR'S DEGREE OR EQUIVALENT WORK EXPERIENCE.A PROVEN TRACK-RECORD IN SALES; PREFERABLY WITH A FOOD BROKER OR NATIONAL COMPANY.STRONG INTERPERSONAL, ORGANIZATIONAL,PRESENTATION, NEGOTIATION, AND SALES SKILLS.MUST HAVE THE ABILITY TO ANALYZE SALES AND MARKETING INFORMATION NEEDED TO MAKE EFFECTIVE SALES PRESENTATIONS.MUST BE PROFICIENT IN AVARIETY OF SOFTWARE PACKAGES USED TO SUPPORT THE SALES FUNCTION.MUST BE WILLING TO TRAVEL.\n\n\nBY SUBMITTING YOUR APPLICATION YOU AGREE WITH AND ACCEPT THE ACOSTAPRIVACY STATEMENT AND TERMS OF CONDITIONS.\n\nUS: HTTP://ACOSTA.JOBS/PRIVACY-POLICY-US/\n\nCANADA: HTTP://ACOSTA.JOBS/PRIVACY-POLICY-CA/\n\nACOSTA UTILIZES E-VERIFY FOR VALIDATING THE ABILITY TO WORK IN THE UNITED STATES FOR ALL JOB CANDIDATES. IF YOU WANT MORE INFORMATION ON WHAT THIS ENTAILS AND YOUR RIGHTS AS A JOB APPLICANT, PLEASE USE THE LINK PROVIDED TO ACCESS INFORMATION ON OUR USE OF E-VERIFY AND YOUR RIGHT TO WORK. EMPLOYER RESOURCES (E-VERIFY.GOV) (HTTPS://WWW.E-VERIFY.GOV/EMPLOYERS/EMPLOYER-RESOURCES?RESOURCE=32)\n\nABOUT US\n\nACOSTA AND MOSAIC ARE THE SALES AND MARKETING POWERHOUSES BEHIND THE MOST RECOGNIZED AND PROVEN BRANDS WITH TOP RETAILERS IN THE UNITED STATES AND CANADA. WE OFFER FLEXIBLE SERVICES THAT MAXIMIZE EFFICIENCY. ACOSTA HAS THE TALENT AND TECHNOLOGY TO BUILD DATA-, REACH- AND RELATIONSHIP-DRIVEN STRATEGIES TO EXECUTE THOSE STRATEGIES, AND THE TOOLS TO MONITOR, TRACK AND OPTIMIZE METRICS-BASED RESULTS FOR CUSTOMERS AND RETAILERS.\n\nACOSTA AND ITS SUBSIDIARIES, IN GOOD FAITH, BELIEVES THAT THIS POSTED RANGE OF COMPENSATION IS THE ACCURATE RANGE FOR THIS ROLE AT THE TIME OF THIS POSTING. ACOSTA MAY ULTIMATELY PAY MORE OR LESS THAN THE POSTED RANGE DEPENDING ON CANDIDATE QUALIFICATIONS AND LOCATIONS. THIS RANGE MAY BE MODIFIED IN THE FUTURE.\n\nACOSTA ET MOSAIC SONT LES MOTEURS DES VENTES ET DU MARKETING DERRIÈRE LES MARQUES LES PLUS RECONNUES ET ÉPROUVÉES AVEC LES MEILLEURS DÉTAILLANTS AUX ÉTATS-UNIS ET AU CANADA. NOUS OFFRONS DES SERVICES FLEXIBLES QUI MAXIMISENT L'EFFICACITÉ. ACOSTA POSSÈDE LE TALENT ET LA TECHNOLOGIE POUR ÉLABORER DES STRATÉGIES AXÉES SUR LES DONNÉES, LA PORTÉE ET LES RELATIONS POUR EXÉCUTER CES STRATÉGIES, AINSI QUE LES OUTILS POUR SURVEILLER, SUIVRE ET OPTIMISER LES RÉSULTATS BASÉS SUR DES MESURES POUR LES CLIENTS ET LES DÉTAILLANTS.\n\nRESPONSIBLE FOR THE MANAGEMENT OF THE ASSIGNED PRINCIPALS’ BUSINESS IN A DEFINED MARKETING AREA. PRIMARY RESPONSIBILITY INCLUDES INCREASING SALES AND MARKET SHARE OF THE BRANDS REPRESENTED, WHILE EARNING A PROFIT FOR OUR MANUFACTURERS AND ACOSTA.\n\nACOSTA, AND ITS SUBSIDIARIES, IS AN EQUAL OPPORTUNITY EMPLOYER\n\nJOB CATEGORY: WHOLESALE\n\nPOSITION TYPE: FULL TIME\n\nBUSINESS UNIT: SALES\n\nSALARY RANGE: $72,600.00 - $108,900.00\n\nREQ ID: 368",
    "job_skill_set": [
      "sales",
      "organizational skills",
      "analytical skills",
      "software proficiency",
      "client management",
      "teamwork",
      "communication",
      "integrity",
      "people minded",
      "self-motivation",
      "negotiation",
      "presentation",
      "market analysis",
      "results oriented",
      "trust",
      "innovation",
      "optimism"
    ],
    "short_keywords": [
      "agency",
      "analysis",
      "analytical",
      "business",
      "client",
      "communication",
      "hybrid",
      "innovation",
      "integrity",
      "management",
      "manager",
      "market",
      "minded",
      "negotiation",
      "optimism",
      "organizational",
      "oriented",
      "people",
      "presentation",
      "proficiency",
      "results",
      "sales",
      "selfmotivation",
      "skills",
      "software",
      "teamwork",
      "trust"
    ]
  }
]