[
  {
    "job_id": "3895595998",
    "job_title": "Salesperson",
    "category": "SALES",
    "job_description": "JOB DESCRIPTION\n\nWHAT IS A SALESPERSON?\n\nENTRY LEVEL SALES POSITION CAPABLE OF SUPPORTING THE DIY BUSINESS AND ACHIEVE OUR SALES AND SERVICE OBJECTIVES. THE ROLE HAS GOOD KNOWLEDGE OF STORE SYSTEMS, BASIC AUTOMOTIVE SYSTEM KNOWLEDGE AND BASIC PART KNOWLEDGE. THE ROLE HAS THE BASIC ABILITY TO SOURCE FROM STORES, HUBS, PDQ, AND EXTERNAL SUPPLIERS. THE ROLE HAS IN-DEPTH KNOWLEDGE OF THE STORE INVENTORY AND MAINTENANCE PROCESSES. POSITION CAN BE PART TIME OR FULL TIME. FLEET SAFETY CERTIFICATION PREFERRED.\n\nPRIMARY RESPONSIBILITIES\n\nPROVIDE EXCELLENT SELLING EXPERIENCE FOR DIY CUSTOMER VISITS AND PHONE CALLSACHIEVE PERSONAL SALES GOAL AND HELP STORE ACHIEVE ITS SALES GOALSPROVIDE DIY SERVICES INCLUDING BATTERY INSTALLATION, TESTING, WIPER INSTALLS, ETC.MAINTAIN STORE PRODUCT AND OPERATIONAL STANDARDSRESPONSIBLE FOR INVENTORY PROCESSES INCLUDING TRUCK PUT AWAY, SHOOT OUTS, CYCLE COUNTS, BACK STOCK, ETC.\n\nSECONDARY RESPONSIBILITIES\n\nSTORE CLEANLINESS INCLUDING FLOORS, BATHROOMS, FACING, DUSTING, PARKING LOTGENERAL STOCKING INCLUDING TRUCK STOCKING AND BACK STOCKSAFELY DELIVER PARTS TO CUSTOMERS AS NEEDED\n\nSUCCESS FACTORS\n\nBASIC DRIVING AND NAVIGATION ABILITYABILITY TO USE DELIVERY BOARD SYSTEMFRIENDLY COMMUNICATIONABILITY TO LOCATE AND STOCK PARTSSAFETY KNOWLEDGE AND SKILLSOPERATING INVENTORY SYSTEMS AND STORE EQUIPMENTPARTS AND AUTOMOTIVE SYSTEM KNOWLEDGE SKILLSOPERATING POS AND PARTS LOOKUP SYSTEMSEXPERT AT TESTING AND DIAGNOSTIC EQUIPMENT FOR DIY SERVICE\n\nESSENTIAL JOB SKILLS NECESSARY FOR SUCCESS AS A SALESPERSON\n\nSPEAK AND WRITE ENGLISH (SPANISH A PLUS); COMMUNICATE EFFECTIVELY AND BUILD STRONG RELATIONSHIPS WITH CUSTOMERS, PEERS AND MANAGEMENTREAD AND INTERPRET DOCUMENTS SUCH AS SAFETY RULES, OPERATING AND MAINTENANCE INSTRUCTIONS, PARTS CATALOGS, AND PROCEDURE MANUALSUSE BASIC MATH ACCURATELY: ADD, SUBTRACT, MULTIPLY, AND DIVIDE IN ALL UNITS OF MEASURE, USING WHOLE NUMBERS, COMMON FRACTIONS, AND DECIMALSABILITY TO WORK AN ASSORTMENT OF DAYS, EVENINGS, AND WEEKENDS AS NEEDED\n\nPRIOR EXPERIENCE THAT SETS A SALESPERSON UP FOR SUCCESS \n\n2-3 YEARS OF SUCCESSFUL SALES EXPERIENCE IN A DIVERSE RETAIL ENVIRONMENT, PROVIDING SUPERIOR CUSTOMER EXPERIENCES\n\nPHYSICAL DEMANDS \n\nTHE PHYSICAL DEMANDS AND WORK ENVIRONMENT DESCRIBED HERE ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY AN EMPLOYEE TO SUCCESSFULLY PERFORM THE ESSENTIAL FUNCTIONS OF THIS JOB, WITH OR WITHOUT REASONABLE ACCOMMODATION. WHILE PERFORMING THE DUTIES OF THIS JOB, THE EMPLOYEE WILL PREDOMINANTLY BE WALKING OR STANDING. THE EMPLOYEE IS REQUIRED TO BE ABLE TO TALK AND HEAR, AND USE HANDS AND FINGERS TO HANDLE OR FEEL; REACH WITH HANDS AND ARMS; CLIMB OR BALANCE; AND STOOP, KNEEL, CROUCH, OR CRAWL. THE EMPLOYEE MUST FREQUENTLY LIFT AND/OR MOVE UP TO 50 POUNDS AND OCCASIONALLY LIFT AND/OR MOVE UP TO 100 POUNDS. SPECIFIC VISION ABILITIES REQUIRED BY THIS JOB INCLUDE CLOSE VISION, DISTANCE VISION, COLOR VISION, DEPTH PERCEPTION, AND ABILITY TO ADJUST FOCUS.\n\nWORK ENVIRONMENT\n\nTHE WORK ENVIRONMENT CHARACTERISTICS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE AN EMPLOYEE ENCOUNTERS WHILE PERFORMING THE ESSENTIAL FUNCTIONS OF THIS JOB, WITH OR WITHOUT REASONABLE ACCOMMODATION. WHILE PERFORMING THE DUTIES OF THIS JOB, THE EMPLOYEE IS USUALLY WORKING INSIDE; HOWEVER, THEY WILL OCCASIONALLY BE OUTSIDE AND EXPOSED TO VARIOUS WEATHER CONDITIONS WHILE PERFORMING SUCH TASKS AS INSTALLING BATTERIES AND WIPER BLADES. THE EMPLOYEE IS ALSO OCCASIONALLY EXPOSED TO MOVING MECHANICAL PARTS; HIGH, PRECARIOUS PLACES; TOXIC OR CAUSTIC CHEMICALS; RISK OF ELECTRICAL SHOCK; EXPLOSIVES; AND VIBRATION. THE NOISE LEVEL IN THE WORK ENVIRONMENT IS USUALLY MODERATE.\n\n\" APPLICATION CLOSE DATE: ADVANCE AUTO PARTS WILL ACCEPT APPLICATIONS FOR 60 DAYS FROM THE APPLICATION OPEN DATE\"\n\nCOMPENSATION RANGE\n\n18.29 USD PER HOUR - 18.65 USD PER HOUR\n\nBENEFITS INFORMATION\n\nHTTPS://JOBS.ADVANCEAUTOPARTS.COM/US/EN/BENEFITS\n\nCALIFORNIA RESIDENTS CLICK BELOW FOR PRIVACY NOTICE\n\nHTTP://WWW.WORLDPACCAREERS.COM/UPLOADS/2/4/0/4/24047148/ADVANCE_AUTO_PARTS_--_CALIFORNIA_CANDIDATE_PRIVACY_NOTICE.PDF\n\nR-0423934\n\nWE ARE AN EQUAL OPPORTUNITY EMPLOYER AND DO NOT DISCRIMINATE AGAINST ANY EMPLOYEE OR APPLICANT FOR EMPLOYMENT BECAUSE OF RACE, COLOR, SEX, AGE NATIONAL ORIGIN, RELIGION, SEXUAL ORIENTATION, GENDER IDENTITY, STATUS AS A VETERAN AND BASIS OF DISABILITY OR ANY OTHER FEDERAL, STATE OR LOCAL PROTECTED CLASS.",
    "job_skill_set": [
      "inventory management",
      "communication",
      "customer service",
      "relationship building",
      "problem solving",
      "teamwork",
      "adaptability",
      "time management",
      "automotive system knowledge",
      "store systems knowledge",
      "battery installation",
      "POS systems",
      "parts lookup systems",
      "basic math skills",
      "safety knowledge",
      "diagnostic equipment expertise"
    ],
    "short_keywords": [
      "adaptability",
      "automotive",
      "basic",
      "battery",
      "building",
      "communication",
      "customer",
      "diagnostic",
      "equipment",
      "expertise",
      "installation",
      "inventory",
      "knowledge",
      "lookup",
      "management",
      "math",
      "parts",
      "pos",
      "problem",
      "relationship",
      "safety",
      "sales",
      "salesperson",
      "service",
      "skills",
      "solving",
      "store",
      "system",
      "systems",
      "teamwork",
      "time"
    ]
  },
  {
    "job_id": "3906090796",
    "job_title": "Home Care Sales Consultant",
    "category": "SALES",
    "job_description": "COMPANY DESCRIPTIONTHE HOME INSTEAD® NETWORK IS THE WORLD'S LEADING PROVIDER OF PERSONALIZED IN-HOME CARE SERVICES. WE HAVE OVER 1,100 INDEPENDENTLY OWNED AND OPERATED FRANCHISE OFFICES WORLDWIDE THAT EMPLOY COMPASSIONATE CAREGIVERS WHO SHARE OUR DEDICATION TO ENHANCING THE LIVES OF AGING ADULTS AND THEIR FAMILIES. SERVICES SPAN THE CARE CONTINUUM, FROM COMPANIONSHIP AND PERSONAL CARE TO SPECIALIZED ALZHEIMER'S CARE AND HOSPICE SUPPORT.CARING FOR OTHERS IS PART OF OUR DNA, AND THAT INCLUDES CARING FOR YOUR CAREER. \nROLE DESCRIPTIONTHIS IS A FULL-TIME ON-SITE ROLE LOCATED IN ROCKVILLE, MD. AS A HOME CARE SALES CONSULTANT AT HOME INSTEAD, YOU WILL BE RESPONSIBLE FOR DRIVING SALES GROWTH BY DEVELOPING AND MAINTAINING RELATIONSHIPS WITH REFERRAL SOURCES AND PROSPECTIVE CLIENTS. YOU WILL CONDUCT IN-HOME CONSULTATIONS, ASSESS CLIENT NEEDS, AND CREATE PERSONALIZED CARE PLANS. ADDITIONALLY, YOU WILL COLLABORATE WITH THE CAREGIVING TEAM TO ENSURE CLIENT SATISFACTION AND BUILD LONG-TERM PARTNERSHIPS.QUALIFICATIONSEXCEPTIONAL COMMUNICATION AND INTERPERSONAL SKILLSPRIOR SALES EXPERIENCE, PREFERABLY IN THE HEALTHCARE OR SENIOR CARE INDUSTRYABILITY TO BUILD AND MAINTAIN PROFESSIONAL RELATIONSHIPSSTRONG PROBLEM-SOLVING AND DECISION-MAKING SKILLSKNOWLEDGE OF LOCAL COMMUNITY RESOURCES AND REFERRAL SOURCESWILLINGNESS TO LEARN AND ADAPT TO NEW TECHNOLOGIES AND TOOLSDEMONSTRATED ABILITY TO WORK INDEPENDENTLY AND AS PART OF A TEAMVALID DRIVER'S LICENSE AND RELIABLE TRANSPORTATIONBACHELOR'S DEGREE OR EQUIVALENT EXPERIENCEIF YOU ARE PASSIONATE ABOUT MAKING A DIFFERENCE IN THE LIVES OF AGING ADULTS AND THEIR FAMILIES, AND HAVE A PROVEN TRACK RECORD IN SALES, WE ENCOURAGE YOU TO APPLY. JOIN OUR TEAM AT HOME INSTEAD AND HELP US FULFILL OUR MISSION TO ENHANCE THE LIVES OF AGING ADULTS AND BUILD A CAREER THAT MATTERS.\n",
    "job_skill_set": [
      "sales",
      "communication",
      "problem-solving",
      "relationship-building",
      "healthcare knowledge",
      "technology adaptation",
      "interpersonal skills",
      "decision-making",
      "teamwork",
      "independence",
      "adaptability",
      "community resources knowledge",
      "bachelor's degree",
      "driver's license"
    ],
    "short_keywords": [
      "adaptability",
      "adaptation",
      "bachelors",
      "care",
      "communication",
      "community",
      "consultant",
      "decisionmaking",
      "degree",
      "drivers",
      "healthcare",
      "home",
      "independence",
      "interpersonal",
      "knowledge",
      "license",
      "problemsolving",
      "relationshipbuilding",
      "resources",
      "sales",
      "skills",
      "teamwork",
      "technology"
    ]
  },
  {
    "job_id": "3900964564",
    "job_title": "Area Sales Manager - South",
    "category": "SALES",
    "job_description": "ROMAC INDUSTRIES, AN INNOVATOR OF PIPE PRODUCTS FOR THE WATERWORKS INDUSTRY, IS SEEKING AN EXCEPTIONAL SOUTHERN AREA SALES MANAGER, WHO IS DEDICATED TO SERVING AND BUILDING RELATIONSHIPS WITH OUR CUSTOMERS, HAS A STRONG APTITUDE FOR LEARNING TECHNICAL PRODUCTS, AND IS KNOWN TO BE SELF-MOTIVATED AND ORGANIZED. THIS SKILLED AND CAPABLE INDIVIDUAL CAN MASTERFULLY CONTRIBUTE TOWARDS BOTH THE TERRITORY AND THE ORGANIZATION’S STRATEGIC GOALS AND INITIATIVES BY DRIVING SALES. MUST HAVE SUPERB CROSS-FUNCTIONAL COMMUNICATION SKILLS, AND EFFECTIVELY COLLABORATES WITH ALL LEVELS WITHIN THE ORGANIZATION.\nTO BE SUCCESSFUL IN THIS SOUTHERN AREA SALES MANAGER ROLE, YOU MUST HAVE PROVEN SUCCESS IN MANAGING A TERRITORY, AND POLISHED PRESENTATION SKILLS TO PRESENT TO LARGE GROUPS OF CUSTOMERS OR POTENTIAL CUSTOMERS. THE IDEAL CANDIDATE IS ACCUSTOMED TO SIGNIFICANT WEEKLY TRAVEL AND IS STRATEGICALLY LOCATED TO SERVE OUR CUSTOMERS IN THE SOUTHERN TERRITORY OF THE U.S, INCLUDING NORTH TEXAS, WEST TEXAS, OKLAHOMA, ARKANSAS, AND NORTH LOUISIANA. YOU ARE KNOWN TO BE CREATIVE, CAPABLE OF ANALYZING SALES DATA AND DEVELOPING SALES PROJECTIONS. SOME EXPERIENCE IN DISTRIBUTION OR MANUFACTURING IS PREFERRED, THOUGH NOT REQUIRED.\n\nWHY JOIN ROMAC?FOUNDED IN 1969, ROMAC IS COMMITTED TO ‘CONNECTING PEOPLE TO WATER,’ MANUFACTURING INNOVATIVE AND HIGH-QUALITY AMERICAN WATERWORKS PRODUCTS, AND EXCEEDING OUR CUSTOMERS’ EXPECTATIONS, WHILE POSITIVELY IMPACTING THE LIVES OF OUR EMPLOYEES.\n\nPEOPLE LOVE TO WORK AT ROMAC BECAUSE WE ALL SHARE THE SAME CORE CULTURE VALUES:\n\nONE ROMAC-THROUGH HUMILITY, INTEGRITY, AND DETERMINATION WE WORK TOGETHER AS ONE, TO ACCOMPLISH THE OBJECTIVES AND PRIORITIES OF THE BUSINESS.\nPEOPLE FIRST-WE CARE ABOUT THE WELL-BEING AND SUCCESS OF EVERY PERSON. RELATIONSHIP DEVELOPMENT IS CENTRAL TO EVERYTHING WE DO.\nCULTURE OF SOLUTIONS-WE ARE CURIOUS, OPEN, AND FLEXIBLE AS WE SOLVE PROBLEMS AND STRIVE TO CONTINUOUSLY IMPROVE.\nALL-IN ATTITUDE-WE ARE COMMITTED TO EXCELLENCE AND ARE FULLY ENGAGED IN HELPING MOVE THE COMPANY FORWARD.\n\nRESPONSIBILITIES· EXTENSIVELY TRAVEL (BOTH DRIVING AND FLYING) THE ASSIGNED TERRITORY TO BUILD RELATIONSHIPS WITH EXISTING AND NEW CUSTOMERS, INCLUDING ENGINEERS, MUNICIPALITIES, AND DISTRIBUTORS.· CONTINUALLY LOOK FOR OPPORTUNITIES TO PROMOTE,MARKET, AND DEVELOP PRODUCTS WITH DISTRIBUTORS, MUNICIPALITIES, CONTRACTORS, AND ENGINEERS.· ATTEND SALES CONVENTIONS IN TERRITORY (AND NATIONALLY AS REQUIRED); SET-UP DISPLAYS AND PRESENT PRODUCTS.· SUBMIT WEEKLY EXPENSE REPORTS AND MAINTAIN A CURRENT CALL REPORT LOG AND CALENDAR.· INTERACT AS NEEDED WITH INSIDE SALES/CUSTOMERSERVICE, QUOTATIONS, AND ENGINEERING REGARDING CUSTOMERS, SALES ORDERS, AND RETURNS. \nQUALIFICATIONS:· BACHELOR’S DEGREE IN MARKETING OR BUSINESS OR AN EQUIVALENT COMBINATION OF EDUCATION, TRAINING, AND EXPERIENCE.· 5+YEARS OF EXPERIENCE IN SALES.· POSSESS A VALID DRIVER’S LICENSE AND MAINTAIN A GOOD DEPARTMENTOF MOTOR VEHICLES DRIVING RECORD.· ABILITY TO TRAVEL EXTENSIVELY, INCLUDING SOMEWEEKENDS AND HOLIDAYS.· MUST RESIDE WITHIN THE ASSIGNED SALES TERRITORY.\n\nCOMPENSATION: $60,000 – $75,000 A YEAR + BONUSES \nROMAC PROVIDES EMPLOYEES WITH THE FOLLOWING BENEFIT OPTIONS:QUARTERLY DISCRETIONARY PROFIT-SHARING BONUSYEAR-END BONUSPAID TIME OFF (PTO)PAID HOLIDAYSMEDICAL, DENTAL, AND VISION100% EMPLOYER-PAID MEDICAL PLAN OPTION FOR EMPLOYEE-ONLY COVERAGEEMPLOYEE ASSISTANCE PROGRAM (EAP)401(K) RETIREMENT PLAN WITH EMPLOYER MATCHING\n\n\nREADY TO TAKE THE NEXT STEP?IF YOU’RE READY FOR AN ADVENTURE AND ARE INTERESTED IN JOINING AN INDUSTRY LEADER THAT IS MAKING BIG IMPACTS ON THE WATERWORKS INDUSTRY, WE WOULD LOVE TO HEAR FROM YOU! PLEASE EMAIL YOUR RESUME TO HR@ROMAC.COM\nROMAC IS AN EQUAL OPPORTUNITY EMPLOYER AND DOES NOT DISCRIMINATE IN DECISIONS INVOLVING ANY ASPECT OF THE EMPLOYMENT RELATIONSHIP BASED ON A PROTECTED STATUS OR CHARACTERISTIC, AS DEFINED BY FEDERAL, STATE, OR LOCAL LAW.",
    "job_skill_set": [
      "sales management",
      "data analysis",
      "marketing",
      "customer relationship management",
      "technical product knowledge",
      "communication",
      "self-motivation",
      "organization",
      "team collaboration",
      "problem-solving",
      "creativity",
      "relationship development",
      "flexibility",
      "curiosity",
      "commitment to excellence",
      "territory management",
      "presentation skills",
      "valid driver's license",
      "extensive travel",
      "experience in distribution or manufacturing"
    ],
    "short_keywords": [
      "analysis",
      "area",
      "collaboration",
      "commitment",
      "communication",
      "creativity",
      "curiosity",
      "customer",
      "data",
      "development",
      "distribution",
      "drivers",
      "excellence",
      "experience",
      "extensive",
      "flexibility",
      "in",
      "knowledge",
      "license",
      "management",
      "manager",
      "manufacturing",
      "marketing",
      "or",
      "organization",
      "presentation",
      "problemsolving",
      "product",
      "relationship",
      "sales",
      "selfmotivation",
      "skills",
      "south",
      "team",
      "technical",
      "territory",
      "to",
      "travel",
      "valid"
    ]
  },
  {
    "job_id": "3905239587",
    "job_title": "Staffing Sales/Full Desk Recruiter",
    "category": "SALES",
    "job_description": "WELL-ESTABLISHED, MIDTOWN BOUTIQUE SEARCH FIRM WITH OFFICES IN NJ AND CT IS SEEKING AN EXPERIENCED STAFFING INDUSTRY PROFESSIONAL TO JOIN THEIR TEAM. IDEALLY SEEKING SOMEONE WITH SALES OR FULL DESK EXPERIENCE WITH A SPECIALTY IN IT, INSURANCE, HR/OPS OR OFFICE SUPPORT/ADMIN.\nDUTIES:\n- IDENTIFY AND PURSUE NEW BUSINESS OPPORTUNITIES THROUGH VARIOUS CHANNELS, INCLUDING COLD CALLING, NETWORKING, AND REFERRALS.- CONDUCT MARKET RESEARCH TO IDENTIFY POTENTIAL CUSTOMERS AND UNDERSTAND THEIR NEEDS.\n- WORK WITH THE SALES AND RECRUITMENT TEAMS TO DETERMINE PLACES TO RECRUIT, WORK WITH THE HIRING CLIENT TO UNDERSTAND NEEDS, AND SCREEN POTENTIAL CANDIDATES TO EFFECTIVELY IDENTIFY QUALIFIED CANDIDATES FOR REFERRAL TO EMPLOYERS, RESULTING IN THEIR HIRE.\n- DEVELOP AND MAINTAIN STRONG RELATIONSHIPS WITH EXISTING CLIENTS TO ENSURE CUSTOMER SATISFACTION AND LOYALTY.- PREPARE AND DELIVER SALES PRESENTATIONS TO PROSPECTIVE CLIENTS, HIGHLIGHTING THE BENEFITS OF OUR SERVICES.- NEGOTIATE CONTRACTS AND PRICING AGREEMENTS WITH CLIENTS TO MAXIMIZE PROFITABILITY.- PROVIDE REGULAR UPDATES ON SALES ACTIVITIES, INCLUDING PIPELINE STATUS, FORECASTS, AND MARKET TRENDS.- STAY UP-TO-DATE WITH INDUSTRY TRENDS AND DEVELOPMENTS TO IDENTIFY NEW OPPORTUNITIES FOR GROWTH.\nSKILLS:\n- 5+ YEARS OF STAFFING INDUSTRY EXPERIENCE, EITHER AS A FULL DESK RECRUITER OR STAFFING SALES\n- STRONG BUSINESS DEVELOPMENT SKILLS WITH A PROVEN TRACK RECORD OF ACHIEVING SALES TARGETS.\n- STRONG ACCOUNT MANAGEMENT SKILLS WITH THE ABILITY TO BUILD AND MAINTAIN LONG-TERM CLIENT RELATIONSHIPS.- ANALYTICAL MINDSET WITH THE ABILITY TO ANALYZE MARKET TRENDS AND COMPETITOR ACTIVITY.- EXCELLENT COMMUNICATION SKILLS, BOTH VERBAL AND WRITTEN, WITH THE ABILITY TO EFFECTIVELY PRESENT INFORMATION TO CLIENTS.- TECHNICAL SALES KNOWLEDGE OR EXPERIENCE IS A PLUS.\nFANTASTIC ORGANIZATION THAT OFFERS HIGH COMMISSIONS, 401K, GREAT OFFICE SPACE, A FLEXIBLE HYBRID WORK SCHEDULE, AND AN EXPERIENCED TEAM THAT PUTS THEIR CLIENTS FIRST.",
    "job_skill_set": [
      "business development",
      "account management",
      "analytical skills",
      "communication",
      "relationship building",
      "organization",
      "teamwork",
      "customer satisfaction",
      "staffing industry experience",
      "market research",
      "sales presentations",
      "contract negotiation",
      "technical sales knowledge"
    ],
    "short_keywords": [
      "account",
      "analytical",
      "building",
      "business",
      "communication",
      "contract",
      "customer",
      "desk",
      "development",
      "experience",
      "industry",
      "knowledge",
      "management",
      "market",
      "negotiation",
      "organization",
      "presentations",
      "recruiter",
      "relationship",
      "research",
      "sales",
      "salesfull",
      "satisfaction",
      "skills",
      "staffing",
      "teamwork",
      "technical"
    ]
  },
  {
    "job_id": "3905835001",
    "job_title": "National Sales Specialist",
    "category": "SALES",
    "job_description": "\nSELL HEALTHCARE - NO LICENSE REQUIRED\nEMBARK ON AN EXCITING JOURNEY AS A NATIONAL SALES SPECIALIST IN HEALTHCARE, WHERE THE USUAL LICENSING CHALLENGES ARE SIDESTEPPED, AND THE OPPORTUNITY TO RAPIDLY INTRODUCE HEALTHCARE SOLUTIONS ON A NATIONAL SCALE AWAITS. JOIN OUR TEAM AND EXPLORE THE POTENTIAL FOR COMPELLING COMMISSIONS AND BONUSES.\nWE SIMPLIFY THE INITIATION PROCESS, ENSURING YOU CAN COMMENCE NATIONWIDE SALES WITHIN DAYS. ENGAGE IN LIVE DAILY TRAINING SESSIONS AND BENEFIT FROM CONTINUOUS SUPPORT FROM OUR DEDICATED TEAM THROUGHOUT YOUR CAREER DEVELOPMENT.\n- PERSONALIZED HEALTHCARE SOLUTIONS: OUR DIVERSE PLANS CATER TO A BROAD SPECTRUM OF NEEDS, ALLOWING YOU TO OFFER TAILORED SOLUTIONS ON A NATIONAL LEVEL.- LUCRATIVE EARNING POTENTIAL: GENERATE SOLID COMMISSIONS, MONTHLY BONUSES, AND RESIDUAL INCOME BY PROMOTING OUR HEALTHCARE SOLUTIONS ON A NATIONAL SCALE.- ACCELERATED TRAINING: PARTICIPATE IN LIVE DAILY ZOOM SESSIONS TO QUICKLY ACQUIRE THE SKILLS NECESSARY FOR SUCCESSFUL NATIONWIDE HEALTHCARE SALES.- NO LICENSING HASSLES: ENJOY A SEAMLESS ENTRY INTO NATIONAL HEALTHCARE SALES AS NO LICENSING IS REQUIRED.- PROVEN SUCCESS: BUILD YOUR CAREER ON OUR ESTABLISHED TRACK RECORD OF PROVIDING ACCESSIBLE AND SUCCESSFUL HEALTHCARE SOLUTIONS NATIONALLY.- HIGH CLIENT RETENTION: EXPERIENCE A REMARKABLE 98% CLIENT RETENTION RATE, ENSURING A STEADY STREAM OF RESIDUAL INCOME NATIONWIDE.- AFFORDABLE PLANS: OFFER PLANS STARTING AT $73/MONTH FOR INDIVIDUALS AND $378/MONTH FOR FAMILIES, PROVIDING SIGNIFICANT HEALTHCARE COST SAVINGS ON A NATIONAL LEVEL.- FOCUS ON SMALL BUSINESSES: CONTRIBUTE TO SMALL BUSINESSES NATIONWIDE BY HELPING THEM PROVIDE HEALTHCARE TO EMPLOYEES, EARNING THROUGH MULTIPLE SIGN-UPS SIMULTANEOUSLY.\nJOIN US AS A NATIONAL SALES SPECIALIST AND MAKE HEALTHCARE SALES BOTH NATIONALLY IMPACTFUL AND SWIFT TO KICKSTART YOUR SUCCESSFUL CAREER!",
    "job_skill_set": [
      "sales",
      "client retention",
      "training",
      "communication",
      "teamwork",
      "problem solving",
      "adaptability",
      "customer service",
      "time management",
      "negotiation",
      "healthcare solutions",
      "commission generation",
      "zoom",
      "tailored solutions",
      "small business healthcare"
    ],
    "short_keywords": [
      "adaptability",
      "business",
      "client",
      "commission",
      "communication",
      "customer",
      "generation",
      "healthcare",
      "management",
      "national",
      "negotiation",
      "problem",
      "retention",
      "sales",
      "service",
      "small",
      "solutions",
      "solving",
      "specialist",
      "tailored",
      "teamwork",
      "time",
      "training",
      "zoom"
    ]
  },
  {
    "job_id": "3885110319",
    "job_title": "Sales Director",
    "category": "SALES",
    "job_description": "THERMASERVE, AN EXIGENT GROUP COMPANY, IS A RESPECTED LEADER IN PROVIDING MECHANICAL SOLUTIONS, INCLUDING HVAC, PLUMBING AND BUILDING CONTROLS, CATERING TO A DIVERSE RANGE OF INDUSTRIES INCLUDING COMMERCIAL, INDUSTRIAL, AND INSTITUTIONAL SECTORS. OUR COMMITMENT TO INNOVATION, QUALITY, AND CUSTOMER SATISFACTION HAS POSITIONED US AS A PREFERRED PARTNER FOR CLIENTS SEEKING RELIABLE AND EFFICIENT MECHANICAL SERVICES. AS WE CONTINUE TO EXPAND OUR MARKET PRESENCE AND DRIVE GROWTH, WE ARE SEEKING AN EXPERIENCED AND STRATEGIC-MINDED SALES DIRECTOR TO LEAD OUR SALES TEAM.\nTHE SALES DIRECTOR WILL PLAY A PIVOTAL ROLE IN DRIVING REVENUE GROWTH AND EXPANDING MARKET SHARE BY LEADING AND DIRECTING THE SALES EFFORTS OF OUR MECHANICAL SERVICES DIVISION. THIS POSITION REQUIRES A VISIONARY LEADER WITH A PROVEN TRACK RECORD IN SALES MANAGEMENT IN MECHANICAL OR OTHER FACILITY SERVICES AND A STRATEGIC APPROACH TO BUSINESS DEVELOPMENT.\nKEY RESPONSIBILITIES:\nDEVELOP AND EXECUTE STRATEGIC SALES PLANS AND INITIATIVES TO ACHIEVE COMPANY SALES TARGETS AND OBJECTIVES. LEAD AND MENTOR THE SALES TEAM, PROVIDING GUIDANCE, COACHING, AND SUPPORT TO DRIVE PERFORMANCE AND FOSTER A CULTURE OF EXCELLENCE.IDENTIFY NEW BUSINESS OPPORTUNITIES AND CULTIVATE RELATIONSHIPS WITH KEY CLIENTS, STAKEHOLDERS, AND INDUSTRY PARTNERS TO EXPAND THE COMPANY'S MARKET PRESENCECOLLABORATE WITH THE TECHNICAL TEAM TO DEVELOP INNOVATIVE SOLUTIONS AND VALUE-ADDED PROPOSITIONS THAT MEET THE UNIQUE NEEDS OF CLIENTS AND DIFFERENTIATE THE COMPANY FROM COMPETITORS.DRIVE THE DEVELOPMENT AND IMPLEMENTATION OF SALES PROCESSES, TOOLS, AND METRICS TO OPTIMIZE SALES PERFORMANCE, TRACK PROGRESS, AND DRIVE CONTINUOUS IMPROVEMENT.ANALYZE MARKET TRENDS, COMPETITOR ACTIVITIES, AND CUSTOMER FEEDBACK TO IDENTIFY EMERGING OPPORTUNITIES AND CHALLENGES, AND ADAPT SALES STRATEGIES ACCORDINGLY.MANAGE KEY ACCOUNTS AND STRATEGIC PARTNERSHIPS, ENSURING HIGH LEVELS OF CUSTOMER SATISFACTION, RETENTION, AND LOYALTY.LEAD NEGOTIATIONS OF CONTRACTS, PRICING AGREEMENTS, AND OTHER COMMERCIAL TERMS TO MAXIMIZE PROFITABILITY AND MITIGATE RISKS.REPRESENT THE COMPANY AT INDUSTRY EVENTS, CONFERENCES, AND NETWORKING FORUMS TO ENHANCE BRAND VISIBILITY, BUILD RELATIONSHIPS, AND GENERATE LEADS.COLLABORATE WITH CROSS-FUNCTIONAL TEAMS, INCLUDING MARKETING, OPERATIONS, AND FINANCE, TO ALIGN SALES STRATEGIES WITH OVERALL BUSINESS OBJECTIVES AND ENSURE SEAMLESS EXECUTION.\nQUALIFICATIONS:\nBACHELOR'S DEGREE IN BUSINESS, ENGINEERING OR RELATED SUBJECT; OR RELEVANT FIELD AND/OR PROFESSIONAL EXPERIENCEPROVEN TRACK RECORD OF SUCCESS IN SERVICE SALES WITHIN A FIELD OF FACILITIES SERVICES, WITH AT LEAST 3 YEARS OF EXPERIENCE IN A SIMILAR ROLE.STRONG LEADERSHIP AND MANAGERIAL SKILLS, WITH THE ABILITY TO INSPIRE, MOTIVATE, AND DEVELOP A HIGH-PERFORMING SALES TEAM.STRATEGIC THINKER WITH EXCELLENT ANALYTICAL AND PROBLEM-SOLVING ABILITIES, CAPABLE OF IDENTIFYING MARKET OPPORTUNITIES AND DRIVING BUSINESS GROWTH.EXCEPTIONAL COMMUNICATION, NEGOTIATION, AND PRESENTATION SKILLS, WITH THE ABILITY TO EFFECTIVELY ENGAGE WITH CLIENTS AND INTERNAL STAKEHOLDERS AT ALL LEVELS.PROFICIENCY IN SALESFORCE AND MICROSOFT OFFICE SUITE.WILLINGNESS TO TRAVEL AS NEEDED.UNDERSTANDING OF MECHANICAL SYSTEMS, INCLUDING HVAC, PLUMBING, REFRIGERATION, AND BUILDING CONTROLS IS A PLUS BUT NOT REQUIRED\nTHIS POSITION OFFERS A COMPETITIVE SALARY, PERFORMANCE-BASED INCENTIVES, AND OPPORTUNITIES FOR PROFESSIONAL DEVELOPMENT AND CAREER ADVANCEMENT WITHIN A DYNAMIC AND GROWING ORGANIZATION. IF YOU ARE A RESULTS-DRIVEN LEADER WITH A PASSION FOR SALES, WE INVITE YOU TO APPLY AND JOIN OUR TEAM. \nTSI DOES NOT DISCRIMINATE ON THE BASIS OF, AND ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT, WITHOUT REGARD TO RACE, COLOR, RELIGION, GENDER, NATIONAL ORIGIN, AGE, SEXUAL ORIENTATION, VETERAN OR DISABLED STATUS, GENETIC INFORMATION, UNION AFFILIATION, MARITAL STATUS, FAMILIAL STATUS, OR ANY OTHER BASIS PROTECTED BY LAW.",
    "job_skill_set": [
      "Microsoft Office Suite",
      "communication",
      "problem solving",
      "relationship building",
      "customer satisfaction focus",
      "sales management",
      "business development",
      "strategic planning",
      "salesforce",
      "contract negotiation",
      "market analysis",
      "mechanical systems knowledge",
      "leadership",
      "team mentoring",
      "analytical thinking",
      "adaptability"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "analytical",
      "building",
      "business",
      "communication",
      "contract",
      "customer",
      "development",
      "director",
      "focus",
      "knowledge",
      "leadership",
      "management",
      "market",
      "mechanical",
      "mentoring",
      "microsoft",
      "negotiation",
      "office",
      "planning",
      "problem",
      "relationship",
      "sales",
      "salesforce",
      "satisfaction",
      "solving",
      "strategic",
      "suite",
      "systems",
      "team",
      "thinking"
    ]
  },
  {
    "job_id": "3906224894",
    "job_title": "Inside Sales Manager",
    "category": "SALES",
    "job_description": "REQUISITION NUMBER: 171242\n\nJOB DESCRIPTION\n\nCINTAS IS LOOKING FOR AN INSIDE SALES MANAGER. THIS POSITION WILL BE RESPONSIBLE FOR THE DAILY MANAGEMENT OF THE INSIDE SALES TEAM. IN ADDITION TO PROVIDING TRAINING, SUPPORT, AND DIRECTION TO THE TEAM MEMBERS TO ENSURE A HIGH LEVEL OF ACTIVITY AND SALES GROWTH IS ACHIEVED, THE MANAGER WILL WORK WITH THE SALES LEADERSHIP TO DETERMINE AND ACHIEVE DEPARTMENTAL AND INTERNAL GROWTH GOALS.\n\nSKILLS/QUALIFICATIONS\n\nREQUIRED:\n\n HIGH SCHOOL DIPLOMA/GED REQUIRED; BACHELOR’S DEGREE PREFERRED  PRIOR SALES MANAGEMENT AND/OR SUPERVISORY EXPERIENCE INCLUDING HAVING MANAGED 5+ DIRECT REPORTS REQUIRED.  PRIOR SALES EXPERIENCE REQUIRED.  PREVIOUS EXPERIENCE CREATING AND EXECUTING A BUSINESS PLAN REQUIRED. \n\nCINTAS OFFERS COMPREHENSIVE AND COMPETITIVE MEDICAL, DENTAL AND VISION BENEFITS, FEATURING EMPLOYEE HEALTH CARE PREMIUMS THAT ARE 30% LOWER THAN THE NATIONAL AVERAGE FOR OUR INDUSTRY. ONE OF OUR MEDICAL PLAN OPTIONS IS EVEN OFFERED AT ZERO COST TO OUR PARTNERS.\n\nADDITIONALLY, OUR EMPLOYEE-PARTNERS ENJOY\n\n COMPETITIVE PAY 401(K)/PROFIT SHARING/EMPLOYEE STOCK OWNERSHIP PROGRAM DISABILITY AND LIFE INSURANCE PACKAGES PAID TIME OFF AND HOLIDAYS CAREER ADVANCEMENT OPPORTUNITIES\n\nHEADQUARTERED IN CINCINNATI, CINTAS IS A PUBLICLY HELD COMPANY TRADED OVER THE NASDAQ GLOBAL SELECT MARKET UNDER THE SYMBOL CTAS AND IS A COMPONENT OF BOTH THE STANDARD & POOR’S 500 INDEX AND NASDAQ-100 INDEX.\n\nCINTAS CORPORATION HELPS MORE THAN 900,000 BUSINESSES OF ALL TYPES AND SIZES GET READY™ TO OPEN THEIR DOORS WITH CONFIDENCE EVERY DAY BY PROVIDING A WIDE RANGE OF PRODUCTS AND SERVICES THAT ENHANCE OUR CUSTOMERS’ IMAGE AND HELP KEEP THEIR FACILITIES AND EMPLOYEES CLEAN, SAFE AND LOOKING THEIR BEST. WITH PRODUCTS AND SERVICES INCLUDING UNIFORMS, MATS, MOPS, RESTROOM SUPPLIES, FIRST AID AND SAFETY PRODUCTS, FIRE EXTINGUISHERS AND TESTING, AND SAFETY AND COMPLIANCE TRAINING, CINTAS HELPS CUSTOMERS GET READY FOR THE WORKDAY®.\n\nTO SUPPORT OUR GROWTH ACROSS NORTH AMERICA, WE’RE SEEKING DRIVEN PROFESSIONALS WITH AMBITION TO MOVE UP WITHIN OUR COMPANY. OUR PROFESSIONAL CULTURE, OUR DEDICATION TO OUR EMPLOYEE-PARTNERS AND LIMITLESS CAREER OPPORTUNITIES—THESE ARE JUST A FEW BENEFITS WE’RE PROUD TO OFFER. OUR EMPLOYEE-PARTNERS KNOW EVERY JOB IS CRITICAL, AND THAT TEAMWORK DRIVES INNOVATION. LET’S TALK ABOUT HOW YOU’LL FIT INTO OUR TEAM AND HOW YOUR HARD WORK WILL BE RECOGNIZED THROUGH COMPETITIVE PAY, WORLD-CLASS BENEFITS AND ONGOING CAREER DEVELOPMENT. ARE YOU READY™ FOR LIMITLESS OPPORTUNITIES AT CINTAS?\n\nCINTAS CORPORATION IS AN EEO/AFFIRMATIVE ACTION EMPLOYER AND WILL MAKE ALL EMPLOYMENT-RELATED DECISIONS WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY OR PROTECTED VETERAN STATUS.\n\nJOB CATEGORY:  SALES\n\nORGANIZATION: RENTAL\n\nEMPLOYEE STATUS: REGULAR\n\nSCHEDULE: FULL TIME\n\nSHIFT: 1ST SHIFT\n\n",
    "job_skill_set": [
      "sales management",
      "supervisory experience",
      "business plan execution",
      "sales experience",
      "team management",
      "training and support",
      "communication",
      "leadership",
      "goal setting",
      "teamwork",
      "problem solving",
      "ambition"
    ],
    "short_keywords": [
      "ambition",
      "and",
      "business",
      "communication",
      "execution",
      "experience",
      "goal",
      "inside",
      "leadership",
      "management",
      "manager",
      "plan",
      "problem",
      "sales",
      "setting",
      "solving",
      "supervisory",
      "support",
      "team",
      "teamwork",
      "training"
    ]
  },
  {
    "job_id": "3904990495",
    "job_title": "Salesperson",
    "category": "SALES",
    "job_description": "JOB DESCRIPTION\n\nWHAT IS A SALESPERSON?\n\nENTRY LEVEL SALES POSITION CAPABLE OF SUPPORTING THE DIY BUSINESS AND ACHIEVE OUR SALES AND SERVICE OBJECTIVES. THE ROLE HAS GOOD KNOWLEDGE OF STORE SYSTEMS, BASIC AUTOMOTIVE SYSTEM KNOWLEDGE AND BASIC PART KNOWLEDGE. THE ROLE HAS THE BASIC ABILITY TO SOURCE FROM STORES, HUBS, PDQ, AND EXTERNAL SUPPLIERS. THE ROLE HAS IN-DEPTH KNOWLEDGE OF THE STORE INVENTORY AND MAINTENANCE PROCESSES. POSITION CAN BE PART TIME OR FULL TIME. FLEET SAFETY CERTIFICATION PREFERRED.\n\nPRIMARY RESPONSIBILITIES\n\nPROVIDE EXCELLENT SELLING EXPERIENCE FOR DIY CUSTOMER VISITS AND PHONE CALLSACHIEVE PERSONAL SALES GOAL AND HELP STORE ACHIEVE ITS SALES GOALSPROVIDE DIY SERVICES INCLUDING BATTERY INSTALLATION, TESTING, WIPER INSTALLS, ETC.MAINTAIN STORE PRODUCT AND OPERATIONAL STANDARDSRESPONSIBLE FOR INVENTORY PROCESSES INCLUDING TRUCK PUT AWAY, SHOOT OUTS, CYCLE COUNTS, BACK STOCK, ETC.\n\nSECONDARY RESPONSIBILITIES\n\nSTORE CLEANLINESS INCLUDING FLOORS, BATHROOMS, FACING, DUSTING, PARKING LOTGENERAL STOCKING INCLUDING TRUCK STOCKING AND BACK STOCKSAFELY DELIVER PARTS TO CUSTOMERS AS NEEDED\n\nSUCCESS FACTORS\n\nBASIC DRIVING AND NAVIGATION ABILITYABILITY TO USE DELIVERY BOARD SYSTEMFRIENDLY COMMUNICATIONABILITY TO LOCATE AND STOCK PARTSSAFETY KNOWLEDGE AND SKILLSOPERATING INVENTORY SYSTEMS AND STORE EQUIPMENTPARTS AND AUTOMOTIVE SYSTEM KNOWLEDGE SKILLSOPERATING POS AND PARTS LOOKUP SYSTEMSEXPERT AT TESTING AND DIAGNOSTIC EQUIPMENT FOR DIY SERVICE\n\nESSENTIAL JOB SKILLS NECESSARY FOR SUCCESS AS A SALESPERSON\n\nSPEAK AND WRITE ENGLISH (SPANISH A PLUS); COMMUNICATE EFFECTIVELY AND BUILD STRONG RELATIONSHIPS WITH CUSTOMERS, PEERS AND MANAGEMENTREAD AND INTERPRET DOCUMENTS SUCH AS SAFETY RULES, OPERATING AND MAINTENANCE INSTRUCTIONS, PARTS CATALOGS, AND PROCEDURE MANUALSUSE BASIC MATH ACCURATELY: ADD, SUBTRACT, MULTIPLY, AND DIVIDE IN ALL UNITS OF MEASURE, USING WHOLE NUMBERS, COMMON FRACTIONS, AND DECIMALSABILITY TO WORK AN ASSORTMENT OF DAYS, EVENINGS, AND WEEKENDS AS NEEDED\n\nPRIOR EXPERIENCE THAT SETS A SALESPERSON UP FOR SUCCESS \n\n2-3 YEARS OF SUCCESSFUL SALES EXPERIENCE IN A DIVERSE RETAIL ENVIRONMENT, PROVIDING SUPERIOR CUSTOMER EXPERIENCES\n\nPHYSICAL DEMANDS \n\nTHE PHYSICAL DEMANDS AND WORK ENVIRONMENT DESCRIBED HERE ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY AN EMPLOYEE TO SUCCESSFULLY PERFORM THE ESSENTIAL FUNCTIONS OF THIS JOB, WITH OR WITHOUT REASONABLE ACCOMMODATION. WHILE PERFORMING THE DUTIES OF THIS JOB, THE EMPLOYEE WILL PREDOMINANTLY BE WALKING OR STANDING. THE EMPLOYEE IS REQUIRED TO BE ABLE TO TALK AND HEAR, AND USE HANDS AND FINGERS TO HANDLE OR FEEL; REACH WITH HANDS AND ARMS; CLIMB OR BALANCE; AND STOOP, KNEEL, CROUCH, OR CRAWL. THE EMPLOYEE MUST FREQUENTLY LIFT AND/OR MOVE UP TO 50 POUNDS AND OCCASIONALLY LIFT AND/OR MOVE UP TO 100 POUNDS. SPECIFIC VISION ABILITIES REQUIRED BY THIS JOB INCLUDE CLOSE VISION, DISTANCE VISION, COLOR VISION, DEPTH PERCEPTION, AND ABILITY TO ADJUST FOCUS.\n\nWORK ENVIRONMENT\n\nTHE WORK ENVIRONMENT CHARACTERISTICS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE AN EMPLOYEE ENCOUNTERS WHILE PERFORMING THE ESSENTIAL FUNCTIONS OF THIS JOB, WITH OR WITHOUT REASONABLE ACCOMMODATION. WHILE PERFORMING THE DUTIES OF THIS JOB, THE EMPLOYEE IS USUALLY WORKING INSIDE; HOWEVER, THEY WILL OCCASIONALLY BE OUTSIDE AND EXPOSED TO VARIOUS WEATHER CONDITIONS WHILE PERFORMING SUCH TASKS AS INSTALLING BATTERIES AND WIPER BLADES. THE EMPLOYEE IS ALSO OCCASIONALLY EXPOSED TO MOVING MECHANICAL PARTS; HIGH, PRECARIOUS PLACES; TOXIC OR CAUSTIC CHEMICALS; RISK OF ELECTRICAL SHOCK; EXPLOSIVES; AND VIBRATION. THE NOISE LEVEL IN THE WORK ENVIRONMENT IS USUALLY MODERATE.\n\nCALIFORNIA RESIDENTS CLICK BELOW FOR PRIVACY NOTICE\n\nHTTP://WWW.WORLDPACCAREERS.COM/UPLOADS/2/4/0/4/24047148/ADVANCE_AUTO_PARTS_--_CALIFORNIA_CANDIDATE_PRIVACY_NOTICE.PDF\n\nR-0423994\n\nWE ARE AN EQUAL OPPORTUNITY EMPLOYER AND DO NOT DISCRIMINATE AGAINST ANY EMPLOYEE OR APPLICANT FOR EMPLOYMENT BECAUSE OF RACE, COLOR, SEX, AGE NATIONAL ORIGIN, RELIGION, SEXUAL ORIENTATION, GENDER IDENTITY, STATUS AS A VETERAN AND BASIS OF DISABILITY OR ANY OTHER FEDERAL, STATE OR LOCAL PROTECTED CLASS.",
    "job_skill_set": [
      "store systems knowledge",
      "inventory management",
      "safety knowledge",
      "communication",
      "customer service",
      "relationship building",
      "problem solving",
      "teamwork",
      "time management",
      "automotive system knowledge",
      "battery installation",
      "POS systems",
      "parts lookup systems",
      "basic math skills",
      "diagnostic equipment expertise",
      "adaptability"
    ],
    "short_keywords": [
      "adaptability",
      "automotive",
      "basic",
      "battery",
      "building",
      "communication",
      "customer",
      "diagnostic",
      "equipment",
      "expertise",
      "installation",
      "inventory",
      "knowledge",
      "lookup",
      "management",
      "math",
      "parts",
      "pos",
      "problem",
      "relationship",
      "safety",
      "sales",
      "salesperson",
      "service",
      "skills",
      "solving",
      "store",
      "system",
      "systems",
      "teamwork",
      "time"
    ]
  },
  {
    "job_id": "3905827774",
    "job_title": "Regional Vice President of Sales",
    "category": "SALES",
    "job_description": "REGIONAL VICE PRESIDENT OF SALES WITH PROPERTY AND CAUSALITY CERTIFICATION. MUST LIVE IN THE SOUTHEAST (VIRGINIA, NORTH/SOUTH CAROLINA, FLORIDA, TENNESSEE, GEORGIA, KENTUCKY ETC....)\nJOB DESCRIPTIONWE ARE SEEKING A HIGH ENERGY, SELF-STARTER, INDEPENDENT THINKER, AND TEAM PLAYER TO JOIN OUR SALES TEAM WHO LOVES BRINGING DISRUPTIVE, ADVANCED RISK MITIGATION SOLUTIONS TO RESIDENTIAL RENTAL MARKETPLACE AND WANTS TO BE PART OF A GROWING, EVOLVING TEAM.WHAT YOU’LL DOIDENTIFY, BUILD, AND CLOSE OPPORTUNITIES IN SALES PIPELINERESPONSIBLE FOR THE MONTHLY, QUARTERLY, AND ANNUAL ACHIEVEMENT OF INDIVIDUAL REVENUE QUOTASRESPONSIBLE FOR WORKING COLLABORATIVELY WITH ALL CROSS-FUNCTIONAL DEPARTMENTS TO SUPPORT THE ACHIEVEMENT OF OVERALL BUSINESS OBJECTIVESCREATE, DEVELOP, AND IMPLEMENT EFFECTIVE ACCOUNT STRATEGIES TO ACHIEVE SALES QUOTASDEVELOP AND CLOSE SALES OPPORTUNITIES THROUGH PROACTIVE OUTBOUND PROSPECTING AND DILIGENT FOLLOW-UPDELIVER A HIGH VOLUME OF OUTBOUND PROSPECTING TO BUILD OPPORTUNITY PIPELINES FOR ALL PRODUCT LINESACQUIRE NEW CUSTOMERS FROM INDIVIDUAL EFFORTS, MARKETING CAMPAIGNS, PARTNERSHIPS, AND EVENTSEFFECTIVELY DELIVER COMPELLING SALES PRESENTATIONS OR DEMOSMASTER THE ABILITY TO COMMUNICATE PROGRAM VALUE AND SELL IT TO NEW AND EXISTING CLIENTS BY IDENTIFYING BUSINESS CHALLENGES AND REQUIREMENTSADDRESS PROSPECTS' AND CLIENTS' CHALLENGES BY PRESENTING, DEMONSTRATING, AND PERSUASIVELY COMMUNICATING THE VALUE OF THE SOLUTIONRESPONSIBLE FOR WEEKLY REPORTING ON SALES ACTIVITY AND PERFORMANCE TO SALES LEADERSHIP WITH DETAILED DOCUMENTATION IN CRMNAVIGATE KEY DECISION MAKERS TO BUILD AWARENESS WITHIN CURRENT AND PROSPECTIVE INDUSTRY ORGANIZATIONSACTIVELY PARTICIPATE IN SALES MEETINGS AND TRAINING SESSIONSDEVELOP COMPREHENSIVE UNDERSTANDING OF COMPETITIVE LANDSCAPE AND HOW TO DIFFERENTIATE / DESCRIBE VALUE OF OUR SOLUTIONPROVIDE VALUABLE FEEDBACK FROM PROSPECTS TO IDENTIFY BLOCKERS AND ANTICIPATE FUTURE MARKET NEEDSBE A POSITIVE REPRESENTATIVE OF THE COMPANY AND ITS BRAND IN THE MARKETPLACEREPRESENT THE COMPANY AT INDUSTRY-RELATED TRADE SHOWS AND ALL COMPANY-SPONSORED EVENTS\n\n\nWHAT WE’RE LOOKING FOR5+ YEARS OF OUTSIDE SALES EXPERIENCEFAMILIARITY WITH THE RESIDENTIAL RENTAL INDUSTRY BUILDING ON NEW AND EXISTING RELATIONSHIPSPROVEN SUCCESS IN OUTSIDE SALES AS A TRUE HUNTER, EXCEEDING YOUR GOALS AND EXPECTATIONSDETAIL-ORIENTED, COMPETITIVE, HAVE A “CAN-DO” ATTITUDE AND CONSISTENTLY TAKE THE INITIATIVE TO MAKE THINGS BETTER FOR YOUR CLIENTS AND YOUR TEAMPOSSESS A COMPREHENSIVE UNDERSTANDING OF E-COMMERCE AND PRACTICES AND CAN SPEAK TO THE VALUE BEHIND IMPLEMENTING VARIOUS FRONTEND SOFTWARE STRATEGIES ACROSS SEVERAL CHANNELSCAN GROW INTO A THOUGHT LEADERSHIP ROLE IN THE RESIDENTIAL RENTAL INDUSTRYEXPERIENCE WITH CRM’S SUCH AS SALESFORCE, AND THE ABILITY TO LEARN OUR PROPRIETARY TOOLS AND TECHNOLOGIESHOLD A VALID P&C INSURANCE LICENSE",
    "job_skill_set": [
      "sales",
      "account strategies",
      "team player",
      "self-starter",
      "communication",
      "initiative",
      "relationship building",
      "competitive",
      "problem solving",
      "adaptability",
      "positive representation",
      "CRM",
      "property and casualty certification",
      "e-commerce",
      "salesforce",
      "risk mitigation solutions",
      "outbound prospecting",
      "sales presentations",
      "market analysis",
      "feedback"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "analysis",
      "and",
      "building",
      "casualty",
      "certification",
      "communication",
      "competitive",
      "crm",
      "ecommerce",
      "feedback",
      "initiative",
      "market",
      "mitigation",
      "of",
      "outbound",
      "player",
      "positive",
      "presentations",
      "president",
      "problem",
      "property",
      "prospecting",
      "regional",
      "relationship",
      "representation",
      "risk",
      "sales",
      "salesforce",
      "selfstarter",
      "solutions",
      "solving",
      "strategies",
      "team",
      "vice"
    ]
  },
  {
    "job_id": "3899518203",
    "job_title": "Sales Development Trainee",
    "category": "SALES",
    "job_description": "R10041939 SALES DEVELOPMENT TRAINEE (OPEN)\n\nLOCATION:\n\nLA CROSSE, WI - RETAIL SHOP\n\nHOW WILL YOU CONTRIBUTE AND GROW?\n\nTHE SALES TRAINEE WILL BE PLACED IN AND MUST SUCCESSFULLY COMPLETE A COMPREHENSIVE TRAINING PROGRAM THAT WILL GIVE THEM A WORKING KNOWLEDGE OF OUR INDUSTRY, OUR CUSTOMERS AND OUR ORGANIZATION. IN ADDITION, THIS PROGRAM IS DESIGNED AROUND SALES-ORIENTED AND PROFESSIONAL DEVELOPMENT TRAINING TO ENSURE THAT, ONCE COMPLETED, THE TRAINEE WILL BE ABLE TO MEET THE DEMANDING CHALLENGES OF THIS POSITION. UPON COMPLETION, THE TRAINEE WILL BE REQUIRED TO MEET AND EXCEED BOTH CORPORATE AND REGIONAL OBJECTIVES FOR SALES GROWTH, PROFITABILITY GROWTH, AND A/R MANAGEMENT WITHIN THE ASSIGNED TERRITORY. THE TRAINEE WILL NEED TO HAVE THE ABILITY TO SELL ALL AIRGAS PRODUCTS TO HIS/HER CUSTOMER BASE.\n\nTRAVELS THROUGHOUT ASSIGNED TERRITORY TO CALL ON REGULAR AND PROSPECTIVE CUSTOMERSDEVELOP AND EXECUTE PLANS TO MAINTAIN AND GROW THE EXISTING CUSTOMER BASEESTABLISH AND MAINTAIN CLEAR AND CONSISTENT LINES OF COMMUNICATION WITH INTERNAL DEPARTMENTS RELATIVE TO CUSTOMER SUCCESSES, CUSTOMER FAILURES, NEW CUSTOMER DEVELOPMENTS AND OTHER CUSTOMER SPECIFIC INFORMATIONDEVELOP AND EXECUTE PLANS TO IMPROVE AIRGAS MARKET SHARE WITHIN THE ASSIGNED SALES TERRITORYPREPARE AND DELIVER EFFECTIVE SALES PRESENTATIONS AND PROPOSALS TO PROSPECTIVE CUSTOMERS. QUALIFY AND PURSUE SALES LEADS FROM OTHER PARTS OF THE AIRGAS ORGANIZATIONKEEP LOCAL, REGIONAL AND NATIONAL AIRGAS MANAGEMENT INFORMED OF TERRITORY PERFORMANCE, PERSONAL PERFORMANCE AND MARKET TRENDS THROUGH:DEVELOPMENT AND SUBMISSION OF AN ANNUAL SALES PLAN FOR THE ASSIGNED TERRITORYREGULAR AND ON TIME SUBMISSION OF REQUIRED SALES AND ACTIVITY REPORTS, INCLUDING ITINERARIES, CALL REPORTS, “HOT” PROSPECT LISTS, ACCOUNT WINS AND LOSSES AND OTHER INFORMATION AS REQUIREDMAINTAINS A LEADERSHIP ROLE IN THE ORGANIZATION THROUGH OPEN AND HONEST COMMUNICATION WITH ALL AIRGAS ASSOCIATESMAINTAINS FOCUS ON SAFETY IN THE WORKPLACE BY COMPLYING WITH COMPANY SAFETY PROCEDURES AND PRACTICES\n\n________________________\n\nARE YOU A MATCH?\n\nBACHELOR’S DEGREE, PREFERABLY RELATED TO BUSINESS OR SALESABILITY TO EFFECTIVELY NETWORK AND NEGOTIATE. STRONG VERBAL AND WRITTEN COMMUNICATION SKILLS.GOOD ORGANIZATIONAL, TIME AND TERRITORY MANAGEMENT SKILLS; GOAL ORIENTED, SELF-MOTIVATED, AND STRONG LEADERSHIP SKILLS. ABILITY TO LEAD AND FUNCTION WITHIN TEAM ENVIRONMENTS.MUST POSSESS AND MAINTAIN A VALID DRIVER’S LICENSE AND PERSONAL VEHICLE WITH INSURANCE COVERAGEAMBITION TO BUILD A CAREER IN OUTSIDE SALES AND SALES LEADERSHIPONSITE WORK ENVIRONMENT, LOCAL TRAVEL\n\n_________________________\n\nYOUR DIFFERENCES ENHANCE OUR PERFORMANCE\n\nAT AIRGAS, WE ARE COMMITTED TO BUILDING A DIVERSE AND INCLUSIVE WORKPLACE THAT EMBRACES THE DIVERSITY OF OUR EMPLOYEES, OUR CUSTOMERS, PATIENTS, COMMUNITY STAKEHOLDERS AND CULTURES ACROSS THE WORLD.\n\nWE WELCOME AND CONSIDER APPLICATIONS FROM ALL QUALIFIED APPLICANTS, REGARDLESS OF THEIR RACE, GENDER, SEXUAL ORIENTATION, RELIGION, DISABILITY OR ANY OTHER PROTECTED CHARACTERISTIC. WE STRONGLY BELIEVE A DIVERSE ORGANIZATION OPENS UP OPPORTUNITIES FOR PEOPLE TO EXPRESS THEIR TALENT, BOTH INDIVIDUALLY AND COLLECTIVELY AND IT HELPS FOSTER OUR ABILITY TO INNOVATE BY LIVING OUR FUNDAMENTALS, ACTING FOR OUR SUCCESS AND CREATING AN ENGAGING ENVIRONMENT IN A CHANGING WORLD.\n\n_________________________\n\nEQUAL EMPLOYMENT OPPORTUNITY INFORMATION\n\nWE ARE AN EQUAL OPPORTUNITY EMPLOYER. WE EVALUATE QUALIFIED APPLICANTS WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, VETERAN STATUS, OR ANY OTHER PROTECTED CHARACTERISTIC.\n\nPLEASE CLICK HERE TO VIEW THE EEO KNOW YOUR RIGHTS POSTER AND HERE TO VIEW THE PAY TRANSPARENCY NONDISCRIMINATION POSTER. AIRGAS, AN AIR LIQUIDE COMPANY INVITES ANY APPLICANT AND/OR EMPLOYEE TO REVIEW THE COMPANY’S WRITTEN AFFIRMATIVE ACTION PLAN OR POLICY STATEMENT. THIS PLAN OR POLICY STATEMENT IS AVAILABLE FOR INSPECTION UPON REQUEST.\n\nAIRGAS, AN AIR LIQUIDE COMPANY AND ITS GROUP OF COMPANIES DOES NOT DISCRIMINATE AGAINST QUALIFIED APPLICANTS WITH DISABILITIES AND IS COMMITTED TO PROVIDING REASONABLE ACCOMMODATIONS TO THE KNOWN DISABILITIES OF SUCH INDIVIDUALS SO AS TO ENSURE EQUAL ACCESS TO BENEFITS AND PRIVILEGES OF EMPLOYMENT. IF YOU ARE AN INDIVIDUAL WITH A DISABILITY AND WOULD LIKE TO REQUEST A REASONABLE ACCOMMODATION AS PART OF THE EMPLOYMENT SELECTION PROCESS, PLEASE CONTACT US BY EMAIL AT US-ACCOMMODATIONREQUEST@AIRGAS.COM.\n\n_________________________\n\nCALIFORNIA PRIVACY NOTICE",
    "job_skill_set": [
      "sales",
      "communication",
      "organizational skills",
      "time management",
      "customer relationship management",
      "teamwork",
      "problem solving",
      "negotiation",
      "territory management",
      "presentation skills",
      "reporting",
      "valid driver's license",
      "goal oriented",
      "self-motivated",
      "leadership",
      "adaptability",
      "ambition",
      "communication with internal departments"
    ],
    "short_keywords": [
      "adaptability",
      "ambition",
      "communication",
      "customer",
      "departments",
      "development",
      "drivers",
      "goal",
      "internal",
      "leadership",
      "license",
      "management",
      "negotiation",
      "organizational",
      "oriented",
      "presentation",
      "problem",
      "relationship",
      "reporting",
      "sales",
      "selfmotivated",
      "skills",
      "solving",
      "teamwork",
      "territory",
      "time",
      "trainee",
      "valid",
      "with"
    ]
  },
  {
    "job_id": "3904363361",
    "job_title": "Sales Development Rep - DeForest, WI",
    "category": "SALES",
    "job_description": "CAMPING WORLD HOLDINGS, INC., HEADQUARTERED IN LINCOLNSHIRE, IL, (TOGETHER WITH ITS SUBSIDIARIES) IS AMERICA'S LARGEST RETAILER OF RVS AND RELATED PRODUCTS AND SERVICES. OUR VISION IS TO BUILD A LONG-TERM LEGACY BUSINESS THAT MAKES RVING FUN AND EASY, AND OUR CAMPING WORLD AND GOOD SAM BRANDS HAVE BEEN SERVING RV CONSUMERS SINCE 1966.\n\nWE STRIVE TO BUILD LONG-TERM VALUE FOR OUR CUSTOMERS, EMPLOYEES, AND SHAREHOLDERS BY COMBINING A UNIQUE AND COMPREHENSIVE ASSORTMENT OF RV PRODUCTS AND SERVICES WITH A NATIONAL NETWORK OF RV DEALERSHIPS, SERVICE CENTERS AND CUSTOMER SUPPORT CENTERS ALONG WITH THE INDUSTRY'S MOST EXTENSIVE ONLINE PRESENCE AND A HIGHLY TRAINED AND KNOWLEDGEABLE TEAM OF EMPLOYEES SERVING OUR CUSTOMERS, THE RV LIFESTYLE, AND THE COMMUNITIES IN WHICH WE OPERATE. WE ALSO BELIEVE THAT OUR GOOD SAM ORGANIZATION AND FAMILY OF PROGRAMS AND SERVICES UNIQUELY ENABLE US TO CONNECT WITH OUR CUSTOMERS AS STEWARDS OF THE RV ENTHUSIAST COMMUNITY AND THE RV LIFESTYLE. WITH RV SALES AND SERVICE LOCATIONS IN 42 STATES, CAMPING WORLD HAS GROWN TO BECOME THE PRIME DESTINATIONS FOR EVERYTHING RV.\n\nESSENTIAL JOB FUNCTIONS\n\nMAXIMIZE SALES OPPORTUNITIES AND TRAFFIC THROUGH THE INTERNET SALES DEPARTMENTADHERE TO SCRIPTS AND TALKING POINTS PROVIDED FOR EACH TYPE OF PHONE CALL INITIATED OR RECEIVEDREQUIRED TO OUTBOUND CALL 8-10 CUSTOMERS PER HOUR WITH THE GOAL OF SCHEDULING SALES APPOINTMENTSRECORD AND MANAGE PROSPECTIVE CUSTOMER INFORMATION THROUGH THE CRMMAINTAIN A THOROUGH KNOWLEDGE OF ALL CURRENT MARKETING CAMPAIGNSTRACKING PERSONAL RESULTS INCLUDING APPOINTMENTS, CALLS, SALES, AND ENGAGEMENTS USING CRM SYSTEMWORK CLOSELY WITH BUSINESS DEVELOPMENT MANAGER TO INCREASE THE RESULTS OF THE DEPARTMENTAID IN THE MANAGEMENT OF ONLINE REPUTATION THROUGH REVIEW SITES AND SOCIAL MEDIA OUTLETSVINSOLUTIONS EXPERIENCE IS A HUGE PLUS!\n\nESSENTIAL JOB SKILLS\n\nCLEAR AND CONCISE WRITTEN AND VERBAL COMMUNICATIONRESULTS DRIVEN AND MOTIVATED FOR SALESEXCELLENT CUSTOMER SERVICEEFFECTIVELY MANAGES RESPONSIBILITIES WITH TIME MANAGEMENT TO REACH GOALSABILITY TO MULTI-TASK WHILE DEMONSTRATING STRONG ORGANIZATIONAL SKILLSHAS PRIOR CRM EXPERIENCE AND IS VERY COMPUTER SAVVYPREVIOUS SALES EXPERIENCE A PLUSMAY LIFT UP TO 25 LBS AND/OR MOVE UP TO 50 LBS. WITH ASSISTIVE DEVICES\n\nFULL-TIME ASSOCIATES ARE OFFERED A COMPREHENSIVE BENEFIT PACKAGE INCLUDING MEDICAL, DENTAL, VISION, PTO, 401K AND MORE! PART-TIME ASSOCIATES ARE OFFERED ACCESS TO DENTAL & VISION COVERAGE! FOR MORE INFORMATION PLEASE VISIT: WWW.MYCAMPINGWORLDBENEFITS.COM\n\nWE ARE AN EQUAL EMPLOYMENT OPPORTUNITY EMPLOYER. THE COMPANY'S POLICY IS NOT TO DISCRIMINATE AGAINST ANY APPLICANT OR EMPLOYEE BASED ON RACE, COLOR, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, RELIGION, NATIONAL ORIGIN, AGE (40 AND OVER), DISABILITY, VETERAN OR UNIFORMED SERVICE-MEMBER STATUS, GENETIC INFORMATION, OR ANY OTHER BASIS PROTECTED BY APPLICABLE FEDERAL, STATE, OR LOCAL LAWS\n\n#BDREP #BIZD",
    "job_skill_set": [
      "Sales",
      "Computer Skills",
      "Time Management",
      "Organizational Skills",
      "Outbound Calling",
      "Communication",
      "Customer Service",
      "Motivation",
      "Multi-tasking",
      "Results Driven",
      "CRM",
      "Internet Sales",
      "Marketing Campaigns Knowledge",
      "Review Management",
      "Vinsolutions Experience"
    ],
    "short_keywords": [
      "calling",
      "campaigns",
      "communication",
      "computer",
      "crm",
      "customer",
      "deforest",
      "development",
      "driven",
      "experience",
      "internet",
      "knowledge",
      "management",
      "marketing",
      "motivation",
      "multitasking",
      "organizational",
      "outbound",
      "rep",
      "results",
      "review",
      "sales",
      "service",
      "skills",
      "time",
      "vinsolutions",
      "wi"
    ]
  },
  {
    "job_id": "3887882751",
    "job_title": "Sales and Service Route Class B Driver *5K SIGN ON BONUS*",
    "category": "SALES",
    "job_description": "JOB DESCRIPTION\n\nFULL TIME POSITION MONDAY -FRIDAY SATURDAY WORK MAYBE REQUIRED AT TIMES.8-12 HR DAYS- OVERTIME!UNCAPPED COMMISSION $5,000 SIGN ON BONUS! CLASS B W/ HAZMAT ENDORSEMENT (CAN OBTAIN UPON HIRE)AUTOMATIC RESTRICTION OK \n\nSAFETY-KLEEN IN HIGHLAND, CA IS SEEKING A SALES AND SERVICE ROUTE DRIVER.  THIS ROLE WILL TRAIN TO DRIVE A CLASS B BOX TRUCK TO PROVIDE ONSITE SERVICE FOR PARTS WASHER MACHINES, PICK UP CONTAINERIZED HAZARDOUS WASTE, AND SELL PRODUCTS/SERVICES IN A DEFINED ROUTE.\n\nSAFETY-KLEEN, A SUBSIDIARY OF CLEAN HARBORS IS THE LEADING PROVIDER OF ENVIRONMENTAL, ENERGY AND INDUSTRIAL SERVICES THROUGHOUT THE UNITED STATES, CANADA, MEXICO AND PUERTO RICO. EVERYWHERE INDUSTRY MEETS ENVIRONMENT, CLEAN HARBORS IS ON-SITE, PROVIDING PREMIER ENVIRONMENTAL, ENERGY AND INDUSTRIAL SERVICES. WE ARE SOLVING TOUGH PROBLEMS THROUGH INNOVATION AND PROVEN METHODOLOGY – COME BE PART OF THE SOLUTION WITH US.\n\nWHY WORK FOR CLEAN HARBORS?\n\nHEALTH AND SAFETY IS OUR #1 PRIORITY AND WE LIVE IT 3-6-5!FOCUS ON MAINTAINING SUSTAINABILITY AND CLEANING THE EARTH RECRUITING PAY RANGE $24-$25COMPREHENSIVE HEALTH BENEFITS COVERAGE AFTER 30 DAYS OF FULL-TIME EMPLOYMENT INCLUDING 401K WITH COMPANY MATCHOPPORTUNITIES FOR GROWTH AND DEVELOPMENT FOR ALL THE STAGES OF YOUR CAREERCOMPANY PAID TRAINING AND TUITION REIMBURSEMENT\n\nRESPONSIBILITIES\n\nKEY RESPONSIBILITIES:\n\nENSURE HEALTH AND SAFETY IS THE NUMBER ONE PRIORITY BY COMPLYING WITH ALL SAFE WORK PRACTICES, POLICIES, AND PROCESSES AND ALWAYS ACTING IN A SAFE MANNERMAY VISIT 10-12 CUSTOMER SITES PER DAYSWITCH OUT 15- & 30-GALLON DRUMS OF SOLUTIONSSERVICE PARTS WASHER MACHINES AND CLEAN OUT SEDIMENT FROM SINKSUP-SELL AT CUSTOMER LOCATIONS AND GENERATE NEW LEADS IN THE FIELDSERVICE AUTOMOTIVE REPAIR, FLEETS, AND MANUFACTURING TYPE BUSINESSESCOMPLETE DAILY SCHEDULED SERVICES, DELIVERIES, AND PICK-UPS IN A TIMELY MANNERFOLLOW ALL LOCAL, STATE (PROVINCIAL) AND FEDERAL COMPLIANCE REGULATIONS AND RULESSAFELY OPERATE VEHICLES IN ACCORDANCE WITH U.S. DOT, LOCAL, STATE (PROVINCIAL) AND FEDERAL REQUIREMENTSOBSERVE ALL COMPANY ENVIRONMENTAL HEALTH AND SAFETY OPERATING GUIDELINESPERFORMS OTHER DUTIES AS ASSIGNED\n\nQUALIFICATIONS\n\nREQUIRED QUALIFICATIONS:\n\nCLASS B CDLOBTAIN HAZMAT AND TANKER ENDORSEMENT WITHIN 90 DAYS OF EMPLOYMENTBASIC COMPUTER AND MATH SKILLSGOOD WRITTEN AND VERBAL COMMUNICATION SKILLSSTRONG CUSTOMER SERVICE SKILLSPERFORM PHYSICAL FUNCTIONS PER JOB REQUIREMENTS SUCCESSFULLY COMPLETE A BACKGROUND CHECK, DRUG TEST, AND PHYSICAL, BY POSITIONPER OSHA’S RESPIRATORY PROTECTION STANDARD, 29 CFR 1910.134, EMPLOYEES IN POSITIONS REQUIRING RESPIRATORS ARE REQUIRED TO MEET FACIAL HAIR STANDARDS. \n\nPREFERRED QUALIFICATIONS\n\nSTRONG CUSTOMER SERVICE SKILLSCOMMERCIAL ROUTE DRIVING EXPERIENCE (CLASS C OR NON-CDL)\n\nCLEAN HARBORS IS AN EQUAL OPPORTUNITY EMPLOYER. WE DO NOT DISCRIMINATE AGAINST APPLICANTS DUE TO RACE, ANCESTRY, COLOR, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, RELIGION, AGE, PHYSICAL OR MENTAL DISABILITY, VETERAN STATUS, OR BASED ON ANY OTHER FEDERAL, STATE/PROVINCIAL OR LOCAL PROTECTED CLASS.\n\nCLEAN HARBORS IS COMMITTED TO PROVIDING ACCESS, EQUAL OPPORTUNITY AND REASONABLE ACCOMMODATION FOR INDIVIDUALS WITH DISABILITIES IN EMPLOYMENT, ITS SERVICES, PROGRAMS, AND ACTIVITIES. TO REQUEST REASONABLE ACCOMMODATION, CONTACT ECT@CLEANHARBORS.COM OR 1-844-922-5547.\n\nCLEAN HARBORS IS A MILITARY & VETERAN FRIENDLY COMPANY.\n\nSK\n\n",
    "job_skill_set": [
      "Basic computer skills",
      "Math skills",
      "Safety compliance",
      "Vehicle operation",
      "Customer service",
      "Communication",
      "Problem solving",
      "Time management",
      "Class B CDL",
      "Hazmat endorsement",
      "Route driving experience",
      "Physical fitness"
    ],
    "short_keywords": [
      "5k",
      "and",
      "b",
      "basic",
      "bonus",
      "cdl",
      "class",
      "communication",
      "compliance",
      "computer",
      "customer",
      "driver",
      "driving",
      "endorsement",
      "experience",
      "fitness",
      "hazmat",
      "management",
      "math",
      "on",
      "operation",
      "physical",
      "problem",
      "route",
      "safety",
      "sales",
      "service",
      "sign",
      "skills",
      "solving",
      "time",
      "vehicle"
    ]
  },
  {
    "job_id": "3904408852",
    "job_title": "Experienced Vacation Ownership Sales Manager - Elite Line",
    "category": "SALES",
    "job_description": "AT HOLIDAY INN CLUB VACATIONS, WE BELIEVE IN STRENGTHENING FAMILIES. AND WE LOOK FOR PEOPLE WHO EXHIBIT THE COURAGE, CARING, AND CREATIVITY TO HELP US BECOME THE MOST LOVED BRAND IN FAMILY TRAVEL. WE’RE COMMITTED TO GROWING OUR PEOPLE, MEMBERSHIPS, RESORTS, AND GUEST LOVE. THAT’S WHY WE NEED INDIVIDUALS WHO ARE PASSIONATE IN LIFE AND BRING THOSE QUALITIES TO WORK EVERY DAY. \nDO YOU INSTILL CONFIDENCE, TRUST, AND RESPECT IN THOSE AROUND YOU? DO YOU ENCOURAGE SUCCESS AND BUILD RELATIONSHIPS? IF SO, WE’RE LOOKING FOR YOU. \nTHIS POSITION WILL BE RESPONSIBLE FOR SUPERVISING AND PROVIDING LEADERSHIP TO THE DAY-TO-DAY SALES OPERATION. THE SALES MANAGER IS ACCOUNTABLE FOR MENTORING A TEAM TO MEET SPECIFIC SALES GOALS THROUGH TRAINING, COACHING, AND CLOSING IN AN ETHICAL AND PROFESSIONAL MANNER.\nESSENTIAL DUTIES AND TASKS:DEVELOPS AND COACHES THE SALES CONSULTANTS FOR CONTINUOUS IMPROVEMENT. ASSISTS THE SALES TRAINING DEPARTMENT IN EVALUATING AND COACHING THE SALES CONSULTANTS FOR CONTINUOUS IMPROVEMENT.CLOSES THE SALE AND INITIATES THE PURCHASE PROCESS. RECOGNIZES, SUPPORTS, AND IMPLEMENTS POLICIES AND PROCEDURES ESTABLISHED BY HOLIDAY INN CLUB VACATIONS. CONDUCTS PERFORMANCE APPRAISALS.SUPPORTS AND UPHOLDS THE MISSION, VISION, AND PHILOSOPHIES OF ORANGE LAKE RESORTS. RESPONSIBLE FOR RECRUITING, SELECTING, AND HIRING. RESOLVES ALL CUSTOMER SERVICE CHALLENGES.ACHIEVES PERSONAL AND DEPARTMENTAL WRITTEN OBJECTIVES AS ESTABLISHED. ASSISTS ALL TEAM MEMBERS IN ENSURING ALL QUESTIONS ARE ANSWERED IN A PROFESSIONAL, INFORMATIVE, DIPLOMATIC, AND CORRECT MANNER. COACHES ALL NEW HIRE SALES CONSULTANTS TO MEET AND/OR EXCEED MINIMUM SALES PERFORMANCE STANDARDS.ENSURES SALES RIDES ARE SCHEDULED AND PERFORMED FOR SALES CONSULTANTS. ENSURES THE PROFESSIONAL DRESS POLICIES ARE ENFORCED. ENSURES AND/OR PERFORMS A 1-1 COACHING SESSION WITH SALES CONSULTANTS AS NEEDED AND PROVIDES EVALUATION, COACHING, AND THE ASSIGNMENT OF AN ACTION PLAN FOR IMPROVEMENT AND THE FOLLOW-UP TO THAT ESTABLISHED PLAN.\nQUALIFICATIONS:MINIMUM OF 3+ YEARS OF TIMESHARE EXPERIENCE.PROVEN TRACK RECORD OF SUCCESS IN TIMESHARE SALES AND/OR TIMESHARE SALES TRAINING.MUST BE PROCESS-ORIENTED WITH ATTENTION TO DETAIL.COMPELLING LEADERSHIP ABILITIES.MUST BE ABLE TO MANAGE STAFF, MEET SALES AND STAFFING REQUIREMENTS, AND DEVELOP ONGOING ASSOCIATE TRAINING.MUST HAVE THE ABILITY TO MANAGE AND MOTIVATE TEAM MEMBERS WHILE WORKING EFFECTIVELY WITH EXECUTIVE MANAGEMENT.SELF-DIRECTED AND INDEPENDENT BUT WORKS AS A TEAM PLAYER.PERSUASIVE INTERPERSONAL SKILLS TO GAIN ACCEPTANCE OF AN IDEA, PLAN, ACTIVITY, SERVICE, OR PRODUCT FROM GUESTS AND CO-WORKERS.PARTICIPATES IN PROACTIVE TEAM EFFORTS TO ACHIEVE DEPARTMENTAL AND COMPANY GOALS.EXCELLENT CUSTOMER SERVICE SKILLS.STRONG ORAL AND WRITTEN COMMUNICATION SKILLS.STRONG WORK ETHIC, HIGH ENERGY LEVEL, AND POSITIVE ATTITUDE.STRONG ADMINISTRATIVE, ORGANIZATION, AND PLANNING SKILLS.MASTERY OF THE USE OF APPROPRIATE INTERPERSONAL SOCIAL STYLES AND METHODS TO INSPIRE AND GUIDE INDIVIDUALS TOWARD GOAL ACHIEVEMENT.PURSUIT OF CONTINUOUS IMPROVEMENT, ENHANCE OR INCREASE PERSONAL KNOWLEDGE AND SKILLS THAT WILL ASSIST IN JOB PERFORMANCE.MUST HAVE RELIABLE TRANSPORTATION.\nCOMPENSATION, BENEFITS & REPUTATION: OUTSTANDING & FUN COMPANY CULTUREWEEKLY PAY & LUCRATIVE COMPENSATION PLANSREWARDS & RECOGNITION PROGRAMS: QUARTERLY AWARD DINNERS, SUMMER JAM, SALES & MARKETING AWARDS, PRESIDENTS CLUB/MASTERS TRIP & MOREBONUSES! WE'VE AWARDED $4 MILLION THIS YEAR ALONEPAID (ARDA AWARD-WINNING) TRAININGBENEFITS AT 90 DAYS – MEDICAL, DENTAL, PRESCRIPTION, VISION & EVEN ELECTIVE BENEFITS SUCH AS LIFE, DISABILITY, ACCIDENT, PET, & MOREHEALTH SAVINGS & FLEXIBLE SPENDING ACCOUNTSPTO (AND EVEN VOLUNTEER PTO!)EMPLOYEE ASSISTANCE PROGRAM (EAP) – COUNSELING SESSIONS INCLUDE FAMILY, FINANCES, & LEGAL ADVICE (6 SESSIONS PER ISSUE, PER YEAR)401K MATCH - 100% UP TO 4% OF INCOMECLUBGO - POINTS TO USE FOR A FREE RESORT STAY EACH YEARIHG TRAVEL DISCOUNTS – 18 BRANDS – THOUSANDS OF PROPERTIES WORLDWIDE - $39-$99/NIGHTHOLIDAY INN CLUB VACATION ACCOMMODATION DISCOUNT – UP TO 50% OFF REGULAR RATESDISCOUNTED & FREE GOLF, AS WELL AS DISCOUNTS AT RESORT RESTAURANTS & RETAIL STORESHICV PERKSPOT.COM (DISCOUNTS ON EVERYTHING BETWEEN AUTO INSURANCE, APPAREL, WELLNESS, PETS, TRAVEL, GIFTS, ELECTRONICS, ETC.)GROWTH OPPORTUNITIESINTERNAL PROMOTIONS & TRANSFERSTUITION ASSISTANCEACADEMY OF LEARNING & DEVELOPMENT ONLINE, INCLUDING LANGUAGE COURSESEXPANSIONS LEADERSHIP TRAINING/MENTORSHIP PROGRAMBEST REFERRAL COMPENSATION PROGRAM - $200-$12,700.00/PER REFERRALORANGE AT HEART APPRECIATION & REWARD PROGRAMEMPLOYMENT MILESTONE & SERVICE AWARDSA+ RATING WITH BBBANNUAL CHARITY SUPPORT FOR MULTIPLE CHARITIES SUCH AS \"GIVE KIDS THE WORLD\", \"TOYS FOR TOTS AT CHRISTMAS\", & MORE",
    "job_skill_set": [
      "sales training",
      "customer service",
      "organizational skills",
      "planning skills",
      "coaching",
      "performance appraisal",
      "recruiting",
      "process-oriented",
      "leadership",
      "team management",
      "interpersonal skills",
      "communication",
      "problem solving",
      "motivation",
      "relationship building",
      "self-directed",
      "positive attitude",
      "continuous improvement",
      "timeshare sales",
      "administrative skills"
    ],
    "short_keywords": [
      "administrative",
      "appraisal",
      "attitude",
      "building",
      "coaching",
      "communication",
      "continuous",
      "customer",
      "elite",
      "experienced",
      "improvement",
      "interpersonal",
      "leadership",
      "line",
      "management",
      "manager",
      "motivation",
      "organizational",
      "ownership",
      "performance",
      "planning",
      "positive",
      "problem",
      "processoriented",
      "recruiting",
      "relationship",
      "sales",
      "selfdirected",
      "service",
      "skills",
      "solving",
      "team",
      "timeshare",
      "training",
      "vacation"
    ]
  },
  {
    "job_id": "3895548427",
    "job_title": "Lead Rail Sales Representative",
    "category": "SALES",
    "job_description": "ABOUT THIS ROLE\n\nWELLS FARGO RAIL IS SEEKING A LEAD RAIL SALES REPRESENTATIVE FOR THE CENTRAL/SOUTHWEST UNITED STATES.\n\nRESPONSIBILITIES\n\nTHIS POSITION IS RESPONSIBLE FOR THE MANAGEMENT AND DEVELOPMENT OF A PORTFOLIO OF CUSTOMERS AND THEIR ASSOCIATED RAIL CAR LEASES. KEY SUCCESS CRITERIA WILL BE:\n\nPROVIDING THE HIGHEST LEVEL OF CUSTOMER SERVICE THROUGHOUT THE LEASING CYCLEEFFECTIVELY EXECUTING WELLS FARGO RAIL'S COMMERCIAL STRATEGYDEVELOPING STRATEGIC RELATIONSHIPSGENERATING NEW INVESTMENT OPPORTUNITIESACTIVELY SEEKING AND SHARING MARKET INFORMATION, DEVELOPING AN UNDERSTANDING OF INDUSTRY TRENDS, AND FORMULATING OBJECTIVE INPUTS TO INVESTMENT AND DIVESTITURE PLANSTHE ABILITY TO WORK WITH AND INFLUENCE ALL LEVELS (INTERNALLY AND EXTERNALLY)\n\nIN THIS ROLE, YOU WILL:\n\nBE THE COMMERCIAL LEAD AND PRIMARY RELATIONSHIP MANAGER FOR A COMMERCIAL TERRITORYLEAD A CROSS FUNCTIONAL TEAM WITHIN WELLS FARGO RAIL TO PROVIDE BEST-IN-CLASS CUSTOMER SERVICE AND SUPPORTCAPTURE MARKET DATA, IDENTIFY INDUSTRY TRENDS, PRODUCE DETAILED CALL REPORTS, AND MAKE RECOMMENDATIONS THAT WILL DIRECTLY IMPACT BUSINESS STRATEGY AND INVESTMENT DECISIONSBUILD AND EXPAND RELATIONSHIPS AT MULTIPLE LEVELS, FACILITATING COMPREHENSIVE ACCOUNT PLANNING AND THE DEVELOPMENT OF A COMMERCIAL PIPELINE THAT SUPPORTS OUR CUSTOMER'S NEEDS AND THE CONTINUED GROWTH AND DEVELOPMENT OF THE WELLS FARGO RAIL PORTFOLIO\n\nREQUIRED QUALIFICATIONS:\n\n5+ YEARS OF RAILCAR FINANCE SALES EXPERIENCE, OR EQUIVALENT DEMONSTRATED THROUGH ONE OR A COMBINATION OF THE FOLLOWING: WORK EXPERIENCE, TRAINING, MILITARY EXPERIENCE, EDUCATION\n\nDESIRED QUALIFICATIONS:\n\n5+ YEARS OF RAILCAR SALES, LEASING, FINANCE, CREDIT, OR OTHER RELATED EXPERIENCE DEMONSTRATED THROUGH ONE, OR A COMBINATION OF THE FOLLOWING: COMMERCIAL OR MARKETING EXPERIENCE WITH A RAILROAD, COMMERCIAL OR PORTFOLIO EXPERIENCE WITH A RAILCAR LESSOR OR BUILDER, COMMERCIAL EXPERIENCE WITH A LARGE RAIL SHIPPERKNOWLEDGE OF THE RAIL INDUSTRY: EXPERIENCE WITH A CLASS I RAILROAD, RAIL CAR LEASING COMPANY, OR RAIL CAR BUILDER; A COMPREHENSIVE UNDERSTANDING OF RAIL CARS AND THE MARKETS/COMMODITIES THEY SERVE; AN UNDERSTANDING OF RAIL CAR LEASES AND INDUSTRY PRACTICEPROVEN EXPERIENCE IMPLEMENTING AND EXECUTING SALES OR TERRITORY MANAGEMENT STRATEGIES THAT DELIVER FINANCIAL RESULTS AND GROW STRONG RELATIONSHIPSABILITY TO ANALYZE TRENDS AND DEVELOP CORRESPONDING STRATEGIES IN A DIVERSE AND COMPETITIVE MARKETSTRONG FINANCIAL, ACCOUNTING OR DATA ANALYSIS BACKGROUNDSTRONG RISK AND CONTROLS ORIENTATIONEXPERIENCE WITH SALESFORCE\n\nJOB EXPECTATIONS:\n\nABILITY TO TRAVEL UP TO 75%\n\n100% REMOTE WORK LOCATION IS AVAILABLE FOR THIS POSITION. INDIVIDUAL MUST BE LOCATED WITHIN KANSAS, NEBRASKA, MISSOURI, OKLAHOMA, TEXAS, OR ILLINOIS.\n\nSALARY RANGE BY LOCATION:\n\nROSEMONT, IL- $126,400-$262,600\n\nCHICAGO, IL- $126,400-$262,600\n\nOMAHA, NE - $120,400-250,000\n\nSAN ANTONIO, TX- $120,400-250,000\n\nDALLAS, TX-$120,400-250,000\n\nFORT WORTH, TX- $120,400-250,000\n\nKANSAS CITY, KS-$120,400-250,000\n\nOVERLAND PARK, KS- $120,400-250,000\n\nKANSAS CITY, MO-$120,400-250,000\n\nSALARY RANGE IS DETERMINED BY LOCATION OF THE JOB. MAY BE CONSIDERED FOR A DISCRETIONARY BONUS, RESTRICTED SHARE RIGHTS, OR OTHER LONG-TERM INCENTIVE AWARDS.\n\n#COMMERCIALBANKING\n\nPOSTING END DATE\n\n12 APR 2024\n\nJOB POSTING MAY COME DOWN EARLY DUE TO VOLUME OF APPLICANTS.\n\nWE VALUE DIVERSITY\n\nAT WELLS FARGO, WE BELIEVE IN DIVERSITY, EQUITY AND INCLUSION IN THE WORKPLACE; ACCORDINGLY, WE WELCOME APPLICATIONS FOR EMPLOYMENT FROM ALL QUALIFIED CANDIDATES, REGARDLESS OF RACE, COLOR, GENDER, NATIONAL ORIGIN, RELIGION, AGE, SEXUAL ORIENTATION, GENDER IDENTITY, GENDER EXPRESSION, GENETIC INFORMATION, INDIVIDUALS WITH DISABILITIES, PREGNANCY, MARITAL STATUS, STATUS AS A PROTECTED VETERAN OR ANY OTHER STATUS PROTECTED BY APPLICABLE LAW.\n\nEMPLOYEES SUPPORT OUR FOCUS ON BUILDING STRONG CUSTOMER RELATIONSHIPS BALANCED WITH A STRONG RISK MITIGATING AND COMPLIANCE-DRIVEN CULTURE WHICH FIRMLY ESTABLISHES THOSE DISCIPLINES AS CRITICAL TO THE SUCCESS OF OUR CUSTOMERS AND COMPANY. THEY ARE ACCOUNTABLE FOR EXECUTION OF ALL APPLICABLE RISK PROGRAMS (CREDIT, MARKET, FINANCIAL CRIMES, OPERATIONAL, REGULATORY COMPLIANCE), WHICH INCLUDES EFFECTIVELY FOLLOWING AND ADHERING TO APPLICABLE WELLS FARGO POLICIES AND PROCEDURES, APPROPRIATELY FULFILLING RISK AND COMPLIANCE OBLIGATIONS, TIMELY AND EFFECTIVE ESCALATION AND REMEDIATION OF ISSUES, AND MAKING SOUND RISK DECISIONS. THERE IS EMPHASIS ON PROACTIVE MONITORING, GOVERNANCE, RISK IDENTIFICATION AND ESCALATION, AS WELL AS MAKING SOUND RISK DECISIONS COMMENSURATE WITH THE BUSINESS UNIT'S RISK APPETITE AND ALL RISK AND COMPLIANCE PROGRAM REQUIREMENTS.\n\nCANDIDATES APPLYING TO JOB OPENINGS POSTED IN US: ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, STATUS AS A PROTECTED VETERAN, OR ANY OTHER LEGALLY PROTECTED CHARACTERISTIC.\n\nCANDIDATES APPLYING TO JOB OPENINGS POSTED IN CANADA: APPLICATIONS FOR EMPLOYMENT ARE ENCOURAGED FROM ALL QUALIFIED CANDIDATES, INCLUDING WOMEN, PERSONS WITH DISABILITIES, ABORIGINAL PEOPLES AND VISIBLE MINORITIES. ACCOMMODATION FOR APPLICANTS WITH DISABILITIES IS AVAILABLE UPON REQUEST IN CONNECTION WITH THE RECRUITMENT PROCESS.\n\nAPPLICANTS WITH DISABILITIES\n\nTO REQUEST A MEDICAL ACCOMMODATION DURING THE APPLICATION OR INTERVIEW PROCESS, VISIT DISABILITY INCLUSION AT WELLS FARGO .\n\nDRUG AND ALCOHOL POLICY\n\nWELLS FARGO MAINTAINS A DRUG FREE WORKPLACE. PLEASE SEE OUR DRUG AND ALCOHOL POLICY TO LEARN MORE.\n\nREFERENCE NUMBER\n\nR-349452-3",
    "job_skill_set": [
      "sales strategy execution",
      "customer service",
      "commercial strategy",
      "communication",
      "team leadership",
      "influencing skills",
      "strategic thinking",
      "problem solving",
      "adaptability",
      "collaboration",
      "customer focus",
      "initiative",
      "railcar finance",
      "market analysis",
      "financial analysis",
      "salesforce",
      "risk management",
      "account management",
      "data analysis",
      "relationship management",
      "portfolio management",
      "rail industry knowledge",
      "negotiation"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "analysis",
      "collaboration",
      "commercial",
      "communication",
      "customer",
      "data",
      "execution",
      "finance",
      "financial",
      "focus",
      "industry",
      "influencing",
      "initiative",
      "knowledge",
      "lead",
      "leadership",
      "management",
      "market",
      "negotiation",
      "portfolio",
      "problem",
      "rail",
      "railcar",
      "relationship",
      "representative",
      "risk",
      "sales",
      "salesforce",
      "service",
      "skills",
      "solving",
      "strategic",
      "strategy",
      "team",
      "thinking"
    ]
  },
  {
    "job_id": "3894207130",
    "job_title": "Sr. Channel Sales Engineer",
    "category": "SALES",
    "job_description": "ABOUT THE ROLE\n\nABNORMAL SECURITY IS SEEKING A CHANNEL SALES ENGINEER TO JOIN OUR GROWING SALES ENGINEERING TEAM. AS A CHANNEL SALES ENGINEER, YOU WILL BE THE TECHNICAL LEAD FOR ADVANCING INNOVATION, GROWTH, AND SCALE OF ABNORMAL'S CHANNEL PARTNER RELATIONSHIPS TO WIN CUSTOMERS OVER & HELP THEM CONQUER THEIR MOST INTRACTABLE EMAIL SECURITY CHALLENGES.\n\nIN CONJUNCTION WITH CHANNEL ACCOUNT MANAGERS, YOU WILL BE RESPONSIBLE FOR CONDUCTING IN-PERSON AND REMOTE PRODUCT DEMOS, ARTICULATING THE TECHNICAL VALUE OF ABNORMAL SECURITY PRODUCTS, AND DRIVING SUCCESSFUL OUTCOMES FOR PROOF OF VALUE PROGRAMS.\n\nTHE IDEAL CANDIDATE FOR THE ROLE WILL HAVE THE FOLLOWING SKILLSET:\n\nABILITY TO TIE TECHNOLOGY TO BUSINESS OUTCOMES AND DRIVE VALUEABILITY TO INFLUENCE YOUR AUDIENCE IN VIRTUAL AND IN PERSON FORMATSHIGH EQ; ABILITY TO READ THE ROOM, ENGAGE PEOPLE, BE EMPATHETIC, LISTEN AND RESPONDABILITY TO CREATE VALUE DRIVEN PRESENTATIONS AND TELL THE STORY BEHIND THEM (POWERPOINT, GOOGLE SLIDES)ABILITY TO DISCOVER/UNCOVER CUSTOMER PAIN/REQUIREMENTS/OBJECTIVES\n\nWHAT YOU WILL DO\n\nDRIVE REVENUE THROUGH A RANGE OF STRATEGIC PARTNERSHIPSASSIST PARTNERS WITH PROSPECTS AND CUSTOMERS INTERESTED IN ADOPTING ABNORMAL SECURITY PROVIDE OVERSIGHT, GUIDANCE, AND ASSISTANCE DURING THE PARTNERS SALES PROCESS TO ENSURE MUTUAL SUCCESSLEAD TECHNICAL DISCUSSIONS WITH PARTNERS ON THE VALUE ABNORMAL CAN PROVIDE TO THEIR CLIENTSGATHER, TRACK, AND TRANSLATE PARTNER FEEDBACK AND HELP STEER THE ABNORMAL SECURITY PRODUCT ROADMAPDEVELOP DOMAIN EXPERTISE AND THOUGHT LEADERSHIP REGARDING THE PARTNERS’ CURRENT AREAS OF FOCUS AS WELL AS IN NEW AREAS FOR EXPANSIONDEFINE AND DELIVER FORMAL AND INFORMAL TECHNICAL TRAINING SESSIONS FOR PARTNER RESOURCEMAINTAIN FIELD LEVEL RELATIONSHIPS WITH PARTNERS TO ENSURE EFFECTIVE POSITIONING OF ABNORMAL’S SOLUTIONSPREPARE PARTNER DEMOS AND PROOF-OF-VALUE (POV) TO DEMONSTRATE VARIOUS USE CASES FOR ABNORMAL’S SOLUTION. CO-LEADING PARTNER RELATIONSHIPS WITH CHANNEL ACCOUNT MANAGERS, AND GIVING TECHNICAL DEMOSPROVIDE TECHNICAL PRE-SALES SUPPORT FOR ASSIGNED CHANNEL ACCOUNT MANAGERSASSIST CHANNEL ACCOUNT MANAGERS IN DEVELOPMENT AND IMPLEMENTATION OF SALES OBJECTIVES AND PARTNER-BASED PENETRATION STRATEGIESEDUCATE SALES EXECUTIVES AND PARTNERS ON ABNORMAL SECURITY’S PRODUCTS, PLATFORM, AND SECURITYOBSESSIVELY DRIVE CUSTOMER SATISFACTION\n\nMUST HAVES \n\n3+ YEARS INDUSTRY EXPERIENCE IN CHANNEL SALES ENGINEERINGTECHNICAL BACKGROUND IN MESSAGING AND INTERNET SECURITY PRINCIPLESSTRONG UNDERSTANDING OF HOW INTERNET PROTOCOLS WORK (HTTP, SMTP, DNS, ETC.)KNOWLEDGE OF NETWORKING TOPOLOGY, TCP/IP PROTOCOL, NETWORK CONFIGURATION AND COMPONENTS (FIREWALLS, ROUTERS, ETC.)PRIOR EXPERIENCE IN SELLING SOFTWARE TO FORTUNE 500 THROUGH THE PARTNER COMMUNITY STRONG TECHNICAL PRESENTATION AND COMMUNICATION SKILLS, BOTH VERBAL AND WRITTENABILITY TO SEE AND PRESENT “THE BIG PICTURE”, UNCOVER BUSINESS CHALLENGES, AND ARCHITECT A SOLUTION TO SOLVE CUSTOMER BUSINESS ISSUESABILITY TO WORK INDEPENDENTLY IN A HIGH-VELOCITY ENVIRONMENTPOSITIVE ATTITUDE, CUSTOMER FOCUS, AND STRONG SENSE OF OWNERSHIP OVER CUSTOMER RESULTSBSCS/BSEE OR EQUIVALENT WORK EXPERIENCECISSP, CEH AND/OR OTHER RELEVANT SECURITY CERTIFICATIONS A PLUS\n\nAT ABNORMAL SECURITY CERTAIN ROLES ARE ELIGIBLE FOR A BONUS, RESTRICTED STOCK UNITS (RSUS), AND BENEFITS. INDIVIDUAL COMPENSATION PACKAGES ARE BASED ON FACTORS UNIQUE TO EACH CANDIDATE, INCLUDING THEIR SKILLS, EXPERIENCE, QUALIFICATIONS AND OTHER JOB-RELATED REASONS. WE KNOW THAT BENEFITS ARE ALSO AN IMPORTANT PIECE OF YOUR TOTAL COMPENSATION PACKAGE. LEARN MORE ABOUT OUR COMPENSATION AND EQUITY PHILOSOPHY ON OUR BENEFITS & PERKS PAGE.\n\nBASE SALARY RANGE:\n\n$130,600—$175,000 USD\n\n",
    "job_skill_set": [
      "technical presentation",
      "communication",
      "customer focus",
      "problem solving",
      "independence",
      "positive attitude",
      "influence",
      "teamwork",
      "channel sales engineering",
      "messaging security",
      "internet security principles",
      "HTTP",
      "SMTP",
      "DNS",
      "networking topology",
      "TCP/IP protocol",
      "network configuration",
      "firewalls",
      "routers",
      "software sales",
      "security certifications (CISSP, CEH)",
      "empathy",
      "storytelling",
      "listening"
    ],
    "short_keywords": [
      "attitude",
      "ceh",
      "certifications",
      "channel",
      "cissp",
      "communication",
      "configuration",
      "customer",
      "dns",
      "empathy",
      "engineer",
      "engineering",
      "firewalls",
      "focus",
      "http",
      "independence",
      "influence",
      "internet",
      "listening",
      "messaging",
      "network",
      "networking",
      "positive",
      "presentation",
      "principles",
      "problem",
      "protocol",
      "routers",
      "sales",
      "security",
      "smtp",
      "software",
      "solving",
      "sr",
      "storytelling",
      "tcpip",
      "teamwork",
      "technical",
      "topology"
    ]
  },
  {
    "job_id": "3903823749",
    "job_title": "Sales & Service Rep - Banking - Permanent Hire",
    "category": "SALES",
    "job_description": "A PROGRESSIVE NATIONAL CREDIT UNION WITHIN ROCKLIN, CA IS LOOKING TO HIRE A HANDFUL OF SALES & SERVICE REPS TO JOIN THEIR GROWING TEAM!\n\nTHIS IS A DIRECT HIRE OPPORTUNITY\n\nSTARTING PAY: $20.80 - $22.24/HR\n\nSCHEDULE: MON-FRI 8-5\n\nSTART DATE: 5/20\n\nTRAINING PROGRAM IS 5-WEEKS\n\n$1,500 TRAINING COMPLETION BONUS AFTER 90 DAYS (PAID OUT THE FOLLOWING QUARTER)\n\nCAN BE EARNING UP TO $26.44/HR + QUARTETLY INCENTIVES OVERTIME WHEN YOU TRANSITION TO A SENIOR SALES AND SERVICE REP.\n\nTHERE IS SALES & SERVICE REP I, II, & SENIOR\n\n DESCRIPTION \n\n SUPPORT INBOUND CALLS FROM MEMBERS AND PERFORM FINANCIAL TRANSACTIONS PROACTIVELY IDENTIFY AND RECOMMEND THE BEST PRODUCTS AND SERVICES FOR MEMBERS' NEEDS MAINTAIN KNOWLEDGE OF SERVICES SUCH AS INSURANCE, INVESTMENTS, AND MORTGAGE PROVIDE 5-STAR CUSTOMER SERVICE TO ALL MEMBERS AND CREATE A LASTING IMPRESSION MEET QUARTERLY METRICS AND SERVICE OBJECTIVES, ALONG WITH MEETING QUARTERLY SALES GOALS 1ST WEEK: LEARNING THE ROPES, SYSTEMS/PRODUCTS/SERVICES THEY OFFER 2ND WEEK: WILL START SPEAKING WITH MEMBERS, WORKING ALONGSIDE A SENIOR REP OR TRAINER WHILE SENIOR REP NAVIGATES THROUGH COMPUTER SYSTEMS 3RD WEEK: WILL SWITCH, NAVIGATE COMPUTER SYSTEMS WHILE SENIOR REP IS ON THE PHONES 4TH/5TH WEEK: SHADOWING\n\n\n ADDITIONAL SKILLS & QUALIFICATIONS \n\n MINIMUM 1 YEAR OF PREVIOUS EXPERIENCE IN A FAST-PACED CUSTOMER SERVICE ROLE REQUIRED ABILITY TO LISTEN TO MEMBER NEEDS AND SUGGEST APPROPRIATE FINANCIAL PRODUCTS TAILORED TO THEIR NEEDS MUST BE COMFORTABLE MEETING DEADLINES AND WORKING WITHIN A FAST-PACED ENVIRONMENT WHILE PROVIDING STELLAR CUSTOMER SERVICE POSSESS EXCELLENT LISTENING SKILLS WITH THE ABILITY TO ASK PROBING QUESTIONS, OVERCOME OBJECTIONS, AND UNDERSTAND MEMBER CONCERNS STRONG CRITICAL THINKING AND DECISION-MAKING SKILLS\n\n\n BENEFITS OPTIONS INCLUDE \n\n TRADITIONAL MEDICAL, DENTAL, AND VISION COVERAGE 401K MATCHING UP TO 5% PER PAY PERIOD ACCRUE UP TO 17 DAYS OF PAID TIME OFF YOUR FIRST YEAR OF EMPLOYMENT 11 PAID FEDERAL HOLIDAYS SPECIAL EMPLOYEE PRICING ON LENDING PRODUCTS SUCH AS MORTGAGE, AUTO, AND PERSONAL LOANS (ELIGIBILITY FOR SPECIAL EMPLOYEE PRICING IS SUBJECT TO STANDARD ACCOUNT REQUIREMENTS AND UNDERWRITING CRITERIA)\n\n\n EXPERIENCE LEVEL \n\nENTRY LEVEL\n\n ABOUT TEKSYSTEMS \n\nWE'RE PARTNERS IN TRANSFORMATION. WE HELP CLIENTS ACTIVATE IDEAS AND SOLUTIONS TO TAKE ADVANTAGE OF A NEW WORLD OF OPPORTUNITY. WE ARE A TEAM OF 80,000 STRONG, WORKING WITH OVER 6,000 CLIENTS, INCLUDING 80% OF THE FORTUNE 500, ACROSS NORTH AMERICA, EUROPE AND ASIA. AS AN INDUSTRY LEADER IN FULL-STACK TECHNOLOGY SERVICES, TALENT SERVICES, AND REAL-WORLD APPLICATION, WE WORK WITH PROGRESSIVE LEADERS TO DRIVE CHANGE. THAT'S THE POWER OF TRUE PARTNERSHIP. TEKSYSTEMS IS AN ALLEGIS GROUP COMPANY.\n\nTHE COMPANY IS AN EQUAL OPPORTUNITY EMPLOYER AND WILL CONSIDER ALL APPLICATIONS WITHOUT REGARDS TO RACE, SEX, AGE, COLOR, RELIGION, NATIONAL ORIGIN, VETERAN STATUS, DISABILITY, SEXUAL ORIENTATION, GENDER IDENTITY, GENETIC INFORMATION OR ANY CHARACTERISTIC PROTECTED BY LAW.",
    "job_skill_set": [
      "customer service",
      "financial transactions",
      "sales",
      "critical thinking",
      "decision-making",
      "computer systems navigation",
      "listening skills",
      "communication",
      "problem solving",
      "time management",
      "adaptability",
      "teamwork",
      "knowledge of financial products"
    ],
    "short_keywords": [
      "adaptability",
      "banking",
      "communication",
      "computer",
      "critical",
      "customer",
      "decisionmaking",
      "financial",
      "hire",
      "knowledge",
      "listening",
      "management",
      "navigation",
      "of",
      "permanent",
      "problem",
      "products",
      "rep",
      "sales",
      "service",
      "skills",
      "solving",
      "systems",
      "teamwork",
      "thinking",
      "time",
      "transactions"
    ]
  },
  {
    "job_id": "3899522759",
    "job_title": "Territory Sales Manager",
    "category": "SALES",
    "job_description": "ABOUT ZYNEX MEDICAL:SINCE 1996, ZYNEX MEDICAL HAS BEEN AN INNOVATIVE MEDICAL TECHNOLOGY COMPANY SPECIALIZING IN THE MANUFACTURE AND SALE OF NON-INVASIVE MEDICAL DEVICES FOR PAIN MANAGEMENT AND REHABILITATION. THESE ALTERNATIVE PAIN MANAGEMENT DEVICES HELP PATIENTS RECOVER FROM CHRONIC OR ACUTE PAIN AND INCLUDE ELECTROTHERAPY, BRACING, HOT/COLD THERAPY, AND CERVICAL TRACTION.\nABOUT SALES AT ZYNEX MEDICAL:OUR SALES TEAMS CONTINUES TO REACH RECORD-BREAKING NUMBERS EACH QUARTER FOR THE LAST SEVERAL YEARS. COME JOIN A MEDICAL DEVICE SALES TEAM THAT HAS A TRACK RECORD OF SUCCESS!\nOUR TERRITORY MANAGERS ARE FULL-TIME, W2 EMPLOYEES AND RECEIVE FULL BENEFITS INCLUDING A SUBSTANTIAL BASE SALARY, UNCAPPED COMMISSION, AND MONTHLY EXPENSE REIMBURSEMENT.\nWHAT YOU WILL DO:ESTABLISH AND MAINTAIN RELATIONSHIPS WITH PATIENT AND CLINICS IN ASSIGNED TERRITORYTRAVEL TO CLINICS TO INTRODUCE ZYNEX MEDICAL'S VISION, MISSION & PRODUCTSEDUCATE AND TRAIN PRESCRIBERS ON THE BENEFITS AND EFFECTIVENESS OF ZYNEX MEDICAL PRODUCTS AND SERVICESOBTAIN COMPLETED PATIENT ORDERSWORK WITH INTERNAL TEAMS TO ENSURE SMOOTH ORDERING PROCESS FOR PATIENT AND CLINICS\nWHAT WE ARE LOOKING FOR:SELF-MOTIVATED, DRIVEN INDIVIDUALSPERSISTENCE, RESILIENCE, AND ACCOUNTABILITYRELATIONSHIP DEVELOPMENT SKILLSGENUINE PERSONALITY – YOU WILL BE MAKING A HUGE DIFFERENCE IN PATIENT’S LIVES AND THE FIGHT AGAINST THE OPIOID CRISIS!VALID DRIVER’S LICENSE WITH ACTIVE, CURRENT AUTO INSURANCEABILITY TO TRAVEL EXTENSIVELY WITHIN A GEOGRAPHIC REGIONPROFICIENT COMPUTER SKILLS\nZYNEX MEDICAL OFFERS EXCEPTIONAL BENEFITS (FULL-TIME ROLE):SALARY: $55,000 STARTING BASE SALARYUNCAPPED EARNING POTENTIAL THROUGH COMMISSIONSHEALTH, DENTAL, & VISION INSURANCE401K WITH COMPANY CONTRIBUTIONEXTENSIVE ORIENTATION DURING NEW HIRE SALES TRAINING AND ON-GOING SKILLS TRAININGSALES CAREER PATH OPTIONS FOR ADVANCEMENT (BOTH IN COMMISSION OR JOB FUNCTION)",
    "job_skill_set": [
      "sales",
      "relationship management",
      "training and education",
      "self-motivation",
      "persistence",
      "resilience",
      "accountability",
      "genuine personality",
      "communication",
      "teamwork",
      "medical device knowledge",
      "computer skills",
      "order processing",
      "travel"
    ],
    "short_keywords": [
      "accountability",
      "and",
      "communication",
      "computer",
      "device",
      "education",
      "genuine",
      "knowledge",
      "management",
      "manager",
      "medical",
      "order",
      "persistence",
      "personality",
      "processing",
      "relationship",
      "resilience",
      "sales",
      "selfmotivation",
      "skills",
      "teamwork",
      "territory",
      "training",
      "travel"
    ]
  },
  {
    "job_id": "3905296656",
    "job_title": "Part-Time Sales Associate - Famous Footwear",
    "category": "SALES",
    "job_description": "OVERVIEW\n\nAT FAMOUS FOOTWEAR, WE BELIEVE EVERYONE DESERVES TO FEEL A LITTLE FAMOUS. TO US, FAMOUS ISN’T ABOUT STANDING OUT IN THE CROWD. IT’S ABOUT FEELING GOOD WHERE YOU STAND RIGHT NOW. FAMOUS FOOTWEAR IS YOUR PLACE FOR ATHLETIC AND CASUAL SHOES FOR THE WHOLE FAMILY FROM HUNDREDS OF NAME BRANDS.\n\nJOIN FAMOUS FOOTWEAR AS A PART-TIME SALES ASSOCIATE WHERE YOU'LL HAVE THE OPPORTUNITY TO TURN SHOPPERS INTO LOYAL CUSTOMERS BY HELPING THEM FIND THE PERFECT SHOE FOR ANY NEED. WORKING RETAIL FOR FAMOUS IS FAST-PACED AND FUN. BRING YOUR POSITIVE ENERGY AND STYLE SAVVY TO OUR SALES FLOOR. IT’S SOMETHING NEW EVERY DAY — AND THERE’S A SHOE DISCOUNT IN IT FOR YOU! IF YOU ARE PASSIONATE ABOUT FASHION, CUSTOMER SERVICE ORIENTED, AND A SELF-STARTER, THIS IS THE PERFECT ROLE FOR YOU!\n\nCOMPENSATION AND HOURS:\n\nSTARTING PAY IS $15.00 - $17.25/ HOURWE OFFER FLEXIBLE SCHEDULES\n\n\nWHAT YOU’LL BE DOING\n\nCUSTOMER SERVICE. GREET CUSTOMERS WARMLY TO CREATE A WELCOMING ENVIRONMENT AND BUILD RAPPORT WITH CUSTOMERS TO UNDERSTAND THEIR PREFERENCES. PROVIDE PERSONALIZED ASSISTANCE THROUGHOUT THE CUSTOMER’S SHOPPING EXPERIENCE AND ADDRESS PRODUCT-RELATED ISSUES PROMPTLY AND PROFESSIONALLY.PRODUCT KNOWLEDGE AND MERCHANDISING. MAINTAIN A STRONG KNOWLEDGE OF PRODUCTS, FEATURES, AND PROMOTIONS TO EFFECTIVELY COMMUNICATE AND DRIVE SALES.STORE PRESENTATION. ENSURE THAT STORE AISLES AND PRODUCT DISPLAYS ARE CLEAN, ORGANIZED, AND VISUALLY APPEALING TO ENHANCE THE OVERALL CUSTOMER EXPERIENCE.FOLLOW POLICIES. FOLLOW ALL FAMOUS FOOTWEAR POLICIES AND PROCEDURES, PERFORMING OTHER DUTIES AS ASSIGNED.\n\n\nPERKS YOU'LL ENJOY!\n\nRELAXED DRESS CODE & SMALL TEAM ENVIRONMENT. YOU WILL BE A VALUED MEMBER IN A SUPPORTIVE AND HANDS ON SETTING. OUR RELAXED DRESS CODE POLICY LETS YOU SHOWCASE YOUR AUTHENTIC SELF WHILE YOU WORK.OUR SHOE DISCOUNTS. NO MATTER YOUR STYLE, WE’VE GOT YOUR PERFECT FIT COVERED WITH A 30% ASSOCIATE DISCOUNT ACROSS OUR CALERES BRANDS. DAILY ACCESS TO PAY. LOVE AN EARLY PAY DAY? GET PAID AS YOU EARN (WITHOUT THE FEES) WITH DAYFORCE WALLETEASE OF TRANSFERRING LOCATIONS. STILL IN SCHOOL? WE HAVE OVER 850 STORE LOCATIONS YOU CAN EASILY TRANSFER WITHIN.EMPLOYEE ASSISTANCE PROGRAMS. RECEIVE 24/7 ACCESS TO MENTAL HEALTH SERVICES WITH OUR EMPLOYEE ASSISTANCE PROGRAM. BENEFIT OFFERINGS: TO LEARN MORE DETAILS ABOUT OUR TOTAL REWARDS PROGRAM, VISIT WWW.YOURCALERES.COM \n\n\nQUALIFICATIONS THAT MAKE YOU THE PERFECT FIT!\n\n1 YEAR OF RETAIL OR CUSTOMER SERVICE, PREFERRED PASSION FOR CREATING INSPIRING EXPERIENCESTEAM PLAYER WHO LOVES PARTNERING WITH OTHERS ABILITY TO WORK FLEXIBLE SCHEDULES INCLUDING NIGHTS, WEEKENDS, AND HOLIDAYS\n\n\nFAMOUS FOOTWEAR IS PART OF CALERES INC., A DIVERSE PORTFOLIO OF 15 GLOBAL FOOTWEAR BRANDS INCLUDING SAM EDELMAN, NATURALIZER, VIONIC, DR. SCHOLL'S, ALLEN EDMONDS, AND MANY MORE. CALERES' LEGACY INCLUDES MORE THAN 140-YEARS OF CRAFTSMANSHIP, A PASSION FOR FIT AND BUSINESS SAVVY, WITH A MISSION TO CONTINUE TO INSPIRE PEOPLE TO FEEL GOOD…FEET FIRST.\n\nCALERES IS AN EQUAL OPPORTUNITY EMPLOYER BY CHOICE. WE BELIEVE OUR COMPANY SHOULD BE AS DIVERSE AS THE CONSUMERS WE SERVE. WE SEEK AND ENGAGE TALENTED INDIVIDUALS FROM ALL BACKGROUNDS, ETHNICITIES, GENDERS, LIFESTYLES, AND BELIEF SYSTEMS.\n\nCALERES AND FAMOUS FOOTWEAR ARE INVESTED IN OUR ASSOCIATES. WE REGULARLY REVIEW OUR PAY MATRICES AND UPDATE APPROPRIATELY BASED ON NEED. STARTING PAY IS DETERMINED BY SEVERAL FACTORS, INCLUDING RELEVANT SKILLS, QUALIFICATIONS, AND EXPERIENCE. THE ACTUAL HOURLY RATE WILL EQUAL OR EXCEED THE REQUIRED MINIMUM WAGE APPLICABLE TO THE JOB LOCATION. PLEASE VISIT YOURCALERES.COM TO REVIEW ALL ASSOCIATED BENEFITS.",
    "job_skill_set": [
      "customer service",
      "product knowledge",
      "merchandising",
      "retail experience",
      "team player",
      "communication",
      "flexibility",
      "positive energy",
      "self-starter"
    ],
    "short_keywords": [
      "associate",
      "communication",
      "customer",
      "energy",
      "experience",
      "famous",
      "flexibility",
      "footwear",
      "knowledge",
      "merchandising",
      "parttime",
      "player",
      "positive",
      "product",
      "retail",
      "sales",
      "selfstarter",
      "service",
      "team"
    ]
  },
  {
    "job_id": "3905333045",
    "job_title": "Part-Time Sales Associate - Denver Premium Outlet",
    "category": "SALES",
    "job_description": "OVERVIEW\n\nOUR SALES ASSOCIATES PROMOTE OUR CULTURE, VALUES AND MISSION. AS A SALES ASSOCIATE, YOUR NUMBER ONE JOB IS TO SHARE YOUR LOVE OF FASHION AND DO WHATEVER IT TAKES TO CREATE AN AMAZING SHOPPING EXPERIENCE FOR OUR CUSTOMERS.\n\n WHO YOU ARE: \n\n ENGAGING PERSONALITY WHO PROVIDES GREAT SERVICE.  EXCITED TO MEET NEW PEOPLE.  THOUGHTFUL WITH A DESIRE TO MAKE OTHERS FEEL GOOD ABOUT THEMSELVES AND THEIR INDIVIDUAL STYLE. \n\n\nRESPONSIBILITIES\n\nAS A SALES ASSOCIATE YOU WILL:\n\n ENGAGE AND CONNECT WITH CUSTOMERS TO CREATE AN AMAZING SHOPPING EXPERIENCE.  ACHIEVE AND EXCEED SALES GOALS BY EXECUTING OUR SELLING STRATEGY.  SHARE PRODUCT KNOWLEDGE WITH CUSTOMERS TO MAXIMIZE SALES.  ENGAGE WITH CUSTOMERS TO BUILD RELATIONSHIPS AND BRAND LOYALTY BY USING COMPANY TOOLS.  SHOW UNDERSTANDING OF CUSTOMER’S PERSONAL STYLE WHEN OFFERING FASHION ADVICE.  INSPIRE CUSTOMERS WITH YOUR PRODUCT KNOWLEDGE TO CATER TO THEIR NEEDS.  ASSIST WITH DAILY OPENING AND CLOSING TASKS TO MAINTAIN A CLEAN, NEAT, AND TIDY STORE.  COMPLETE ASSIGNED JOB RESPONSIBILITIES SUCH AS FLOOR SETS, FILLING THE FLOOR, RINGING UP CUSTOMERS, ETC.  REMAIN POSITIVE AND PROFESSIONAL, WORKING TOGETHER WITH THE TEAM TO MAKE A GREAT ENVIRONMENT FOR OUR CUSTOMERS AND EACH OTHER.  MODEL OUR VALUES OF RESPECT, INTEGRITY, TEAMWORK, COMPASSION, ACCOUNTABILITY, AND INCLUSIVITY. \n\n\nQUALIFICATIONS\n\nYOU WILL ALSO HAVE:\n\n FLEXIBLE AVAILABILITY TO MEET THE NEEDS OF THE BUSINESS (INCLUDING EVENINGS AND WEEKENDS). \n\n\nOTHER REQUIREMENTS\n\n REQUIREMENTS & EEO STATEMENT \n\n BEND, LIFT, OPEN AND MOVE PRODUCT AND FIXTURES UP TO 50 LBS., AS NEEDED.\n\n\nTHE SALARY FOR THIS POSITION STARTS AT $14.42 HOURLY. PAY IS BASED ON SEVERAL FACTORS INCLUDING BUT NOT LIMITED TO POSITION OFFERED AND WORK EXPERIENCE. IN ADDITION TO YOUR SALARY, NAUTICA, AND ITS AFFILIATED BRANDS, OFFERS A BENEFITS PACKAGE, INCLUDING 401(K) PLAN WITH COMPANY MATCH AFTER 500 HOURS IF AGE 21 OR OLDER, OVERTIME PAY, FLEXIBLE WORK SCHEDULE, PAID SICK LEAVE, AND A GENEROUS EMPLOYEE DISCOUNT PROGRAM (ALL BENEFITS ARE BASED ON ELIGIBILITY). ADDITIONAL INFORMATION REGARDING THE BENEFITS FOR THIS POSITION CAN BE FOUND HERE: HTTPS://SPARCBENEFITS.COM/CANDIDATE-BENEFITS-HIGHLIGHTS\n\nPLEASE NOTE THAT THERE IS NO FIXED DEADLINE TO APPLY FOR THIS POSITION AS WE ACCEPT APPLICATIONS ON AN ONGOING BASIS.\n\nSPARC GROUP LLC IS AN EQUAL OPPORTUNITY EMPLOYER. WE VALUE A CULTURE OF INCLUSION AND DIVERSITY WITHIN OUR WORKFORCE, AND ARE COMMITTED TO MAINTAINING A WORKPLACE FREE FROM PROHIBITED EMPLOYMENT CONDUCT, INCLUDING DISCRIMINATION OR HARASSMENT ON THE BASIS OF RACE, COLOR, NATIONAL ORIGIN, SEX, AGE, RELIGION, DISABILITY, GENETIC INFORMATION, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, MARITAL STATUS, DOMESTIC PARTNER STATUS, CIVIL PARTNERSHIP, STATUS AS A COVERED VETERAN, STATUS IN THE UNIFORMED SERVICES OF THE UNITED STATES, CITIZENSHIP AND ANY OTHER CHARACTERISTIC PROTECTED BY LAW (“PROTECTED CHARACTERISTICS”).\n\nTHE COMPANY IS COMMITTED TO PROVIDING REASONABLE ACCOMMODATION TO ENABLE QUALIFIED EMPLOYEES WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS OF THEIR JOBS AS REQUIRED BY THE AMERICANS WITH DISABILITIES ACT (ADA).\n\n#ENTRY",
    "job_skill_set": [
      "sales",
      "product knowledge",
      "customer service",
      "merchandising",
      "communication",
      "teamwork",
      "engagement",
      "relationship building",
      "positive attitude",
      "compassion",
      "integrity",
      "accountability",
      "inclusivity",
      "cash handling",
      "flexible availability"
    ],
    "short_keywords": [
      "accountability",
      "associate",
      "attitude",
      "availability",
      "building",
      "cash",
      "communication",
      "compassion",
      "customer",
      "denver",
      "engagement",
      "flexible",
      "handling",
      "inclusivity",
      "integrity",
      "knowledge",
      "merchandising",
      "outlet",
      "parttime",
      "positive",
      "premium",
      "product",
      "relationship",
      "sales",
      "service",
      "teamwork"
    ]
  },
  {
    "job_id": "3900989031",
    "job_title": "Dealer Territory Sales Consultant",
    "category": "SALES",
    "job_description": "JOB DESCRIPTION\n\nIMPORTANT THIS IS AN OUTSIDE FIELD SALES ROLE, WHICH MEANS YOU WILL BE REQUIRED TO TRAVEL WITHIN A MULTI-STATE TERRITORY (CA, AZ & NV). THE PREFERENCE IS FOR THIS INDIVIDUAL TO LIVE IN/NEAR/AROUND SOUTHERN CALIFORNIA OR PHOENIX, AZ.\n\nGROW ABOVE AND BEYOND. \n\nAS A DEALER SALES CONSULTANT, YOU’RE RESPONSIBLE FOR MAINTAINING YOUR TERRITORY, WHICH INCLUDES COLD CALLING, DEALER PAR VISITS, AND PHONE CALLS/EMAILS. YOU’LL INCREASE REVENUE AND MEET OR EXCEED SALES OBJECTIVES. RESPONSIBILITIES INCLUDE OVERALL REVENUE PERFORMANCE, PRODUCT PENETRATION, NEW BUSINESS ACQUISITION, ACCOUNT MAINTENANCE, AND OVERALL GROWTH.\n\nWHAT YOU’LL DO AS A DEALER SALES CONSULTANT \n\nCONSISTENTLY MEET OR EXCEED SALES GOALS BY SELLING EPSILON PRODUCT LINE TO TARGETED CLIENTS—DEALERSHIPS AND DEALER GROUPS IN ASSIGNED MARKET AREA.PROVIDE EXCEPTIONAL PROBLEM RESOLUTION BY IMPLEMENTING EPSILON SOLUTIONS TO DEALERSHIPS’ NEEDS.ACTIVELY PARTICIPATE IN CUSTOMER CONCERN RESOLUTION AND CANCELLATION TURNAROUND ATTEMPTS WHILE MAINTAINING CONSISTENT SUPPORT AND SERVICE TO EXISTING CLIENTS.DEMONSTRATE COMPLETE “PROJECT MANAGEMENT” OVER EACH ACCOUNT IN THEIR GEOGRAPHICAL AREA OF RESPONSIBILITY.SCHEDULE DEALER VISIT KICK-OFF MEETINGS ON PROGRAM ACTIVATIONS WITHIN 2 WEEKS OF DEALER ACTIVATING FOR ALL REOCCURRING REVENUE PRODUCTS.\n\nWHAT SKILLS YOU WILL USE\n\nSKILLED IN SALESFORCE.TERRITORY MANAGEMENT COMPETENCE.EXPERIENCE SELLING CORE PRODUCTS & DIRECT CAMPAIGNS.PROVIDE YOUR MSR/AM WITH A ROUGH SCHEDULE OF WHERE YOU WILL BE SO THEY CAN PUSHBACK ANY UPCOMING PAR CALLS TO ANOTHER WEEK.\n\nADDITIONAL INFORMATION\n\nABOUT EPSILON\n\nEPSILON IS A GLOBAL ADVERTISING AND MARKETING TECHNOLOGY COMPANY POSITIONED AT THE CENTER OF PUBLICIS GROUPE. EPSILON ACCELERATES CLIENTS’ ABILITY TO HARNESS THE POWER OF THEIR FIRST-PARTY DATA TO ACTIVATE CAMPAIGNS ACROSS CHANNELS AND DEVICES, WITH AN UNPARALLELED ABILITY TO PROVE OUTCOMES. THE COMPANY’S INDUSTRY-LEADING TECHNOLOGY CONNECTS ADVERTISERS WITH CONSUMERS TO DRIVE PERFORMANCE WHILE RESPECTING AND PROTECTING CONSUMER PRIVACY. EPSILON’S PEOPLE-BASED IDENTITY GRAPH ALLOWS BRANDS, AGENCIES AND PUBLISHERS TO REACH REAL PEOPLE, NOT COOKIES OR DEVICES, ACROSS THE OPEN WEB. FOR MORE INFORMATION, VISIT EPSILON.COM.\n\nWHEN YOU’RE ONE OF US, YOU GET TO RUN WITH THE BEST. FOR DECADES, WE’VE BEEN HELPING MARKETERS FROM THE WORLD’S TOP BRANDS PERSONALIZE EXPERIENCES FOR MILLIONS OF PEOPLE WITH OUR CUTTING-EDGE TECHNOLOGY, SOLUTIONS AND SERVICES. EPSILON’S BEST-IN-CLASS IDENTITY GIVES BRANDS A CLEAR, PRIVACY-SAFE VIEW OF THEIR CUSTOMERS, WHICH THEY CAN USE ACROSS OUR SUITE OF DIGITAL MEDIA, MESSAGING AND LOYALTY SOLUTIONS. WE PROCESS 400+ BILLION CONSUMER ACTIONS EACH DAY AND HOLD MANY PATENTS OF PROPRIETARY TECHNOLOGY, INCLUDING REAL-TIME MODELING LANGUAGES AND CONSUMER PRIVACY ADVANCEMENTS. THANKS TO THE WORK OF EVERY EMPLOYEE, EPSILON HAS BEEN CONSISTENTLY RECOGNIZED AS INDUSTRY-LEADING BY FORRESTER, ADWEEK AND THE MRC. POSITIONED AT THE CORE OF PUBLICIS GROUPE, EPSILON IS A GLOBAL COMPANY WITH MORE THAN 8,000 EMPLOYEES AROUND THE WORLD. CHECK OUT A FEW OF THESE RESOURCES TO LEARN MORE ABOUT WHAT MAKES EPSILON SO EPIC\n\nOUR CULTURE HTTPS //WWW.EPSILON.COM/US/ABOUT-US/OUR-CULTURE-EPSILONLIFE AT EPSILON HTTPS //WWW.EPSILON.COM/US/ABOUT-US/EPIC-BLOGDE&I HTTPS //WWW.EPSILON.COM/US/ABOUT-US/DIVERSITY-EQUITY-INCLUSIONCSR HTTPS //WWW.EPSILON.COM/US/ABOUT-US/CORPORATE-SOCIAL-RESPONSIBILITY\n\nGREAT PEOPLE DESERVE GREAT BENEFITS\n\nWE KNOW THAT WE HAVE SOME OF THE BRIGHTEST AND MOST TALENTED ASSOCIATES IN THE WORLD, AND WE BELIEVE IN REWARDING THEM ACCORDINGLY. IF YOU WORK HERE, EXPECT COMPETITIVE PAY, COMPREHENSIVE HEALTH COVERAGE, AND ENDLESS OPPORTUNITIES TO ADVANCE YOUR CAREER.\n\nEPSILON IS AN EQUAL OPPORTUNITY EMPLOYER. EPSILON’S POLICY IS NOT TO DISCRIMINATE AGAINST ANY APPLICANT OR EMPLOYEE BASED ON ACTUAL OR PERCEIVED RACE, AGE, SEX OR GENDER (INCLUDING PREGNANCY), MARITAL STATUS, NATIONAL ORIGIN, ANCESTRY, CITIZENSHIP STATUS, MENTAL OR PHYSICAL DISABILITY, RELIGION, CREED, COLOR, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION (INCLUDING TRANSGENDER STATUS), VETERAN STATUS, GENETIC INFORMATION, OR ANY OTHER CHARACTERISTIC PROTECTED BY APPLICABLE FEDERAL, STATE OR LOCAL LAW. EPSILON ALSO PROHIBITS HARASSMENT OF APPLICANTS AND EMPLOYEES BASED ON ANY OF THESE PROTECTED CATEGORIES. EPSILON WILL PROVIDE ACCOMMODATIONS TO APPLICANTS NEEDING ACCOMMODATIONS TO COMPLETE THE APPLICATION PROCESS.\n\nREF230684A\n\n",
    "job_skill_set": [
      "Sales",
      "Project Management",
      "Email Communication",
      "Phone Communication",
      "Problem Resolution",
      "Customer Service",
      "Communication",
      "Teamwork",
      "Adaptability",
      "Time Management",
      "Goal Orientation",
      "Salesforce",
      "Territory Management",
      "Cold Calling",
      "New Business Acquisition",
      "Account Maintenance",
      "Product Penetration"
    ],
    "short_keywords": [
      "account",
      "acquisition",
      "adaptability",
      "business",
      "calling",
      "cold",
      "communication",
      "consultant",
      "customer",
      "dealer",
      "email",
      "goal",
      "maintenance",
      "management",
      "new",
      "orientation",
      "penetration",
      "phone",
      "problem",
      "product",
      "project",
      "resolution",
      "sales",
      "salesforce",
      "service",
      "teamwork",
      "territory",
      "time"
    ]
  },
  {
    "job_id": "3889299604",
    "job_title": "Service Sales Representative - East Hartford, CT",
    "category": "SALES",
    "job_description": "\nAT KONECRANES, WE BELIEVE THAT GREAT CUSTOMER EXPERIENCE IS BUILT ON THE PEOPLE BEHIND THE KONECRANES NAME. EVERYTHING WE DO, WE DO WITH PASSION AND DRIVE. WE BELIEVE DIVERSITY DRIVES BUSINESS SUCCESS AND IS THE FOUNDATION FOR OUR GROWTH. WE WELCOME DIFFERENT BACKGROUNDS AND SKILLS THAT ENRICH OUR COMMUNITY AND WE PROMOTE A PLACE WHERE WE CAN ALL BE OURSELVES. THIS IS WHAT MAKES KONECRANES A UNIQUE PLACE TO WORK. \n \nPOSITION TITLE: SERVICE SALES REPRESENTATIVE - CT\n \nLOCATION: CANDIDATE CAN BE BASED ANYWHERE IN CT, RI, OR EASTERN MASSACHUSETTS\n \nREPORTS TO: TERRITORY SALES MANAGER\n \nAT KONECRANES, WE INVEST IN OUR PEOPLE BY OFFERING A COMPETITIVE BASE SALARY PLUS AN UNCAPPED COMMISSION STRUCTURE AND A COMPANY VEHICLE. WE ALSO OFFER EXCELLENT BENEFITS, INCLUDING: MEDICAL, DENTAL, AND VISION INSURANCE; A 401(K) PLAN WITH A GENEROUS COMPANY MATCH AND TENURE-BASED CONTRIBUTIONS, TUITION REIMBURSEMENT; LIFE AND DISABILITY INSURANCE; VACATION AND OTHER LEAVE PROGRAMS; AND OPPORTUNITIES FOR BOTH FORMAL AND ON THE JOB TRAINING. IF YOU ARE LOOKING TO LIFT YOUR CAREER IN SALES, THINK KONECRANES! WE ARE THE WORLD LEADING GROUP OF LIFTING BUSINESSES™ AND ARE LOOKING FOR AMBITIOUS AND MOTIVATED INDIVIDUALS TO JOIN OUR SALES TEAM.\n \nPRINCIPAL RESPONSIBILITIES:\nENGAGE IN VARIOUS SALES ACTIVITIES TO SELL SAFETY AND PRODUCTIVE RETROFITS, COMPONENTS, MODERNIZATION AND NEW EQUIPMENT TO EXISTING CUSTOMERS AND DEVELOP NEW ACCOUNTS TO MEET MINIMUM ESTABLISHED SALES QUOTAS.PREPARE OR ASSIST IN PREPARING PRICE ESTIMATES FOR SERVICE WORK USING ESTABLISHED TOOLS, GUIDELINES AND INPUT FROM THE SERVICE DEPARTMENT.MAINTAIN PERSONAL CONTACT WITH ALL EXISTING ACCOUNTS IN YOUR AREA. PREPARE RELATED MONTHLY REPORTS.WHEN REQUIRED, MAINTAIN MONTHLY CONTACT WITH ASSIGNED ACCOUNTS TO DEVELOP RELATIONSHIPS. DOCUMENT ACTIVITY WITH KEY ACCOUNTS. PREPARE ACCOUNT PLANS WITH APPROPRIATE ACTIONS AND FORWARD TO DISTRICT MANAGER. SCHEDULE AND CONDUCT BUSINESS REVIEWS FOR CUSTOMERS ON AN ANNUAL BASIS OR AS NEEDED.PREPARE AND MAINTAIN A LOG IN CRM SOFTWARE OF ALL ACTIVITIES, BUSINESS OPPORTUNITIES AND OFFERS SUBMITTED TO CUSTOMERS AND PROVIDE REPORT TO MANAGER WEEKLY.MONITOR WORKLOAD OF SERVICE DEPARTMENT AND ENSURE ALL OPEN TIME SLOTS ARE FILLED WITH SOLD WORK.QUALIFY ALL ANY PROJECTS OR CREDIT WORTHINESS AS NEEDED. CHECK D&B RATINGS AND OBTAIN CREDIT APPLICATION, IF APPROPRIATE. OBTAIN TAX-EXEMPT CERTIFICATE, IF REQUIRED.MONITOR THE CREDIT CONTROL LIST AND ASSIST IN COLLECTION EFFORTS OF PROBLEM ACCOUNTS, AS NEEDED. CONSULT DISTRICT STAFF PRIOR TO DELIVERY OF SERVICES OR MATERIALS TO ACCOUNTS OUTSTANDING FOR OVER 60 DAYS.MONITOR THE CONTRACT RENEWAL PROCESS TO ENSURE CUSTOMER NEEDS ARE MET IN A TIMELY MANNER AND OPPORTUNITIES ARE NOT LOST. CONTACT ACCOUNTS THAT ARE NOT RENEWING THEIR AGREEMENTS. DOCUMENT ALL SALES ACTIVITY IN THE CRM SYSTEM. ESTABLISH AND MAINTAIN ON-GOING COMMUNICATIONS WITH THE SERVICE DEPARTMENT TO ADDRESS ISSUES RELATED TO THE CUSTOMER BASE.MAINTAIN CUSTOMER AND CONTACT INFORMATION IN THE CRM SOFTWARE, AS REQUIRED.FOLLOW ALL ESTABLISHED SAFETY RULES AND PROCEDURES, INCLUDING THOSE ESTABLISHED BY THE CUSTOMER.OTHER DUTIES AS ASSIGNED BY SUPERVISOR.\n\nEDUCATION: BACHELOR’S DEGREE OR ASSOCIATE’S DEGREE PREFERRED HOWEVER, PRIOR EQUIVALENT EXPERIENCE AND TRAINING WILL BE CONSIDERED IN LIEU OF FORMAL DEGREE.\n \nEXPERIENCE: TWO (2) YEARS’ EXPERIENCE IN SERVICE RELATED SALES PREFERRED HOWEVER EQUIVALENT EDUCATION, EXPERIENCE AND TRAINING WILL BE CONSIDERED. MUST HAVE DEMONSTRATED LEADERSHIP EXPERIENCE, A BASIC UNDERSTANDING OF MECHANICAL AND ELECTRICAL PRINCIPLES, GOOD WRITTEN AND VERBAL COMMUNICATION SKILLS AND GOOD PC SKILLS. PRIOR EXPERIENCE WITH CRANES IS A PLUS.\n \nOTHER REQUIREMENT: MUST HAVE AND MAINTAIN A GOOD DRIVING RECORD. MUST BE WILLING AND ABLE TO WORK OFF THE GROUND, ON OCCASION. ABILITY TO RELOCATE TO OTHER REGIONS OF THE COUNTRY MAY BE REQUIRED OR ADVANCEMENT OPPORTUNITIES.\n \n*KCN\n \n KONECRANES, INC. AND ITS AFFILIATES WILL NOT ACCEPT RESUMES FROM EXTERNAL RECRUITERS OR AGENCIES WITHOUT A SERVICE AGREEMENT AND AGENCY PORTAL SUBMISSION. ANY RESUMES SENT WITHOUT A SERVICE AGREEMENT AND AGENCY PORTAL SUBMISSION WITH KONECRANES, INC. ARE VOID OF ANY FEES AND FREE FOR INTERNAL USE. APPLICABLE KONECRANES DATA PROTECTION OBLIGATIONS ARE THE RESPONSIBILITY OF THE AGENCY. \n \n KONECRANES IS A GLOBAL LEADER IN MATERIAL HANDLING SOLUTIONS, SERVING A BROAD RANGE OF CUSTOMERS ACROSS MULTIPLE INDUSTRIES. WE CONSISTENTLY SET THE INDUSTRY BENCHMARK, FROM EVERYDAY IMPROVEMENTS TO THE BREAKTHROUGHS AT MOMENTS THAT MATTER MOST, BECAUSE WE KNOW WE CAN ALWAYS FIND A SAFER, MORE PRODUCTIVE AND SUSTAINABLE WAY. THAT'S WHY, WITH 16 000+ PROFESSIONALS IN OVER 50 COUNTRIES, WE ARE TRUSTED EVERY DAY TO LIFT, HANDLE AND MOVE WHAT THE WORLD NEEDS. \n \n KONECRANES IS COMMITTED TO ENSURING THAT ALL EMPLOYEES AND JOB APPLICANTS ARE TREATED FAIRLY IN AN ENVIRONMENT WHICH IS FREE FROM ANY FORM OF DISCRIMINATION. EQUAL OPPORTUNITY EMPLOYER MINORITIES/WOMEN/PROTECTED VETERANS/DISABLED/OTHER PROTECTED CATEGORY.",
    "job_skill_set": [
      "sales",
      "price estimation",
      "report preparation",
      "customer relationship management",
      "driving record",
      "service-related sales",
      "computer skills",
      "communication",
      "leadership",
      "relationship building",
      "problem solving",
      "teamwork",
      "adaptability",
      "customer service",
      "CRM software",
      "mechanical principles",
      "electrical principles"
    ],
    "short_keywords": [
      "adaptability",
      "building",
      "communication",
      "computer",
      "crm",
      "ct",
      "customer",
      "driving",
      "east",
      "electrical",
      "estimation",
      "hartford",
      "leadership",
      "management",
      "mechanical",
      "preparation",
      "price",
      "principles",
      "problem",
      "record",
      "relationship",
      "report",
      "representative",
      "sales",
      "service",
      "servicerelated",
      "skills",
      "software",
      "solving",
      "teamwork"
    ]
  },
  {
    "job_id": "3905846996",
    "job_title": "Food Service Sales Representative",
    "category": "SALES",
    "job_description": "LABATT FOOD SERVICE IS CURRENTLY SEEKING A HIGH ENERGY, MOTIVATED SALESPERSON WHO WANTS TO BUILD A CAREER REPRESENTING LABATT IN SUPPLYING FOOD TO RESTAURANT CHAINS AND INDEPENDENT OPERATORS IN THE DFW AREA. SUCCESSFUL CANDIDATES WILL SHOW THE ABILITY TO BECOME SKILLED IN COMMUNICATING LABATT’S UNIQUE STRENGTHS AND HOW THE COMPANY IS DIFFERENT IN ITS INDUSTRY. A CAREER WITH LABATT INVOLVES FORMING NEW CUSTOMER TIES AND NURTURING CUSTOMER RELATIONSHIPS THAT LAST OVER MANY YEARS.\nRESPONSIBILITIESPRESENT THE COMPANY TO POTENTIAL FOOD-AWAY-FROM-HOME CUSTOMERS AND CREATE LONG-TERM RELATIONSHIPSPERFORM THE FULL SALES CYCLE FROM GENERATING LEADS AND PROSPECTING TO CLOSING AND IMPLEMENTING THE SALEMANAGE CUSTOMER EXPECTATIONS, PROVIDE EXEMPLARY SERVICE, AND MAINTAIN CUSTOMER RELATIONSHIPSDEFEND AGAINST COMPETITOR SALES TACTICS AND BE ABLE TO CRITICALLY ANALYZE AND EXPLAIN THE FLAWS IN COMPETITOR PROPOSALS TO YOUR CUSTOMERSCONDUCT EFFECTIVE SALES MEETINGS WITH PROSPECTS AND CUSTOMERS TO ENGAGE AND TEACH THEM NEW WAYS TO THINK ABOUT THEIR BUSINESSES\nREQUIREMENTSBACHELOR’S DEGREE OR CHEF TRAINED AT CIA OR EQUIVALENTEXCELLENT COMMUNICATION SKILLSENERGETIC, GOAL ORIENTED, AND COMPETITIVE WITH PROVEN EXAMPLES OF INITIATIVE AND ABOVE-AVERAGE PERFORMANCEABILITY TO EXCEL IN A FAST-PACED AND COMPETITIVE SALES ENVIRONMENTABILITY TO MULTITASK AND PRIORITIZE IN ORDER TO WORK ON MULTIPLE PROSPECTS AND MAINTAIN MULTIPLE ACCOUNTS ALL WHILE CONSTANTLY FOCUSING ON GROWTHA BIAS FOR ACTIONEXPERIENCE IN FOOD SERVICE, RESTAURANTS, AND SALES IS A STRONG POSITIVEAN EXTROVERTED PERSONALITY AND SKILLS AT DEALING WITH OTHER PEOPLEGOOD PROBLEM-SOLVING SKILLS AND EQUANIMITY IN STRESSFUL SITUATIONS",
    "job_skill_set": [
      "sales",
      "customer relationship management",
      "lead generation",
      "multitasking",
      "problem solving",
      "communication",
      "presentation skills",
      "initiative",
      "goal-oriented",
      "competitive",
      "extroverted personality",
      "adaptability",
      "food service knowledge",
      "competitive analysis",
      "energetic",
      "equanimity under stress"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "communication",
      "competitive",
      "customer",
      "energetic",
      "equanimity",
      "extroverted",
      "food",
      "generation",
      "goaloriented",
      "initiative",
      "knowledge",
      "lead",
      "management",
      "multitasking",
      "personality",
      "presentation",
      "problem",
      "relationship",
      "representative",
      "sales",
      "service",
      "skills",
      "solving",
      "stress",
      "under"
    ]
  },
  {
    "job_id": "3905285717",
    "job_title": "Seasonal Sales Associate - Deptford Mall",
    "category": "SALES",
    "job_description": "AS THE LARGEST JEWELLERY COMPANY IN THE WORLD, WE A GIVE A VOICE TO MILLIONS OF PEOPLE’S LOVES EVERY DAY. OUR BEAUTIFUL PRODUCTS EMPOWER PEOPLE ALL AROUND THE WORLD TO EXPRESS THEMSELVES. WE ARE PROUD TO BE PART OF THEIR STORIES AND THE MOST IMPORTANT MOMENTS IN THEIR LIVES.\n\nWHERE ORIGINAL THINKING IS WELCOMED, AND CAN TURN INTO POSITIVE IMPACT IN A HEARTBEAT, WE CAN DREAM BIG, DARE TO ACT, AND DELIVER WITH CARE AND PASSION. AT PANDORA WHERE YOU CAN EACH CRAFT FAR MORE THAN JUST AN INCREDIBLE CAREER.\n\n ABOUT THE TEAM: \n\nTHE SEASONAL SALES ASSOCIATE WILL BE THE ULTIMATE PANDORA FAN. YOU WILL BE RESPONSIBLE FOR DRIVING RETAIL EXCELLENCE AND ENSURING EVERY CLIENT RECEIVES OUTSTANDING SERVICE. YOUR PASSION FOR THE BRAND WILL SHINE THROUGH AND WILL BE RESPONSIBLE FOR DELIVERING A WORLD-CLASS CUSTOMER EXPERIENCE, SURPASSING SALES GOALS, AND CONTINUALLY FINDING INNOVATIVE WAYS TO ENGAGE AND ATTRACT CUSTOMERS.\n\nPLEASE NOTE, THIS JOB WILL REQUIRE THE COMPLETION OF AN ASSESSMENT THAT WILL BE EMAILED TO YOU UPON SUBMITTAL OF THE APPLICATION. \n\n\n OUR SEASONAL SALES ASSOCIATES SHINE BY: \n\n DARE TO EMBRACE THE STORE CULTURE FILLED WITH PASSION FOR OUR BRAND, WHERE TEAM MEMBERS SHINE AS EXTRAORDINARY BRAND AMBASSADORS.  WELCOME OPPORTUNITIES AND SOAR BEYOND COMMERCIAL TARGETS AND KPI EXPECTATIONS, SETTING NEW RECORDS AND ACHIEVING REMARKABLE SUCCESS.  EXECUTE A HIGH-PERFORMANCE SELLING ENVIRONMENT THAT CREATES MOMENTS AND EXCEEDS SHOPPER EXPECTATIONS, DELIVERING UNFORGETTABLE EXPERIENCES EVERY TIME.  CRAFT A LOYAL CUSTOMER BASE THROUGH ENGAGING WITH OUR VALUED CLIENTS, BUILDING GENUINE CONNECTIONS, AND FOSTERING LONG-LASTING RELATIONSHIPS. \n\n\n CRAFT YOUR CAREER WITH US IF YOU HAVE   : \n\n YOU CAN DEMONSTRATE YOU’RE RESULTS-ORIENTED, IDEALLY WITH 1 YEAR OF EXPERIENCE IN A SELLING ENVIRONMENT WOULD BE HIGHLY ADVANTAGEOUS  YOU HAVE DEVELOPED A SENSE OF CARE IN YOUR COMMUNICATION SKILLS BOTH WRITTEN AND VERBAL. YOU KNOW HOW TO CHARM AND CAPTIVATE AN AUDIENCE WITH THE ABILITY TO CONNECT WITH PEOPLE AT ALL LEVELS OF THE ORGANIZATION.  KNOWLEDGE OF MICROSOFT OFFICE 365 SUITE, KWI, POS SYSTEMS, AND EVEN APPLICANT TRACKING SYSTEMS IS WHERE YOU SHINE  YOU ARE AT LEAST 18 YEARS OR OLDER AND CAN PROVIDE PROOF OF IDENTIFY AND ELIGIBILITY TO WORK  DREAM AND EMBRACE ADVENTURE! A FLEXIBLE WORK SCHEDULE THAT INCLUDES NIGHTS, WEEKENDS, AND HOLIDAYS IS ALL PART OF THE EXCITEMENT. THIS CAN INCLUDE STANDING FOR EXTENDED PERIODS. \n\n\n OUR BENEFITS: \n\n WE CARE! PANDORA OFFERS PRODUCT DISCOUNTS FOR THEIR SEASONAL EMPLOYEES \n\n\nNJ SALARY: $15.00 - $16.50 COMMENSURATE ON EXPERIENCE\n\n ABOUT PANDORA: \n\nPANDORA DESIGNS, MANUFACTURES, AND MARKETS HAND-FINISHED JEWELLERY MADE FROM HIGH-QUALITY MATERIALS AT AFFORDABLE PRICES. PANDORA JEWELLERY IS SOLD IN MORE THAN 100 COUNTRIES THROUGH 6,800 POINTS OF SALE, INCLUDING MORE THAN 2,700 CONCEPT STORES.\n\nHEADQUARTERED IN COPENHAGEN, DENMARK, PANDORA EMPLOYS 27,000 PEOPLE WORLDWIDE AND CRAFTS ITS JEWELLERY AT TWO LEED CERTIFIED FACILITIES IN THAILAND USING MAINLY RECYCLED SILVER AND GOLD. THE COMPANY PLANS TO BE CARBON NEUTRAL BY 2025 AND HAS JOINED THE SCIENCE BASED TARGETS INITIATIVE TO REDUCE EMISSIONS ACROSS ITS FULL VALUE CHAIN. PANDORA IS LISTED ON THE NASDAQ COPENHAGEN STOCK EXCHANGE AND GENERATED A REVENUE OF DKK 23.4 BILLION IN 2021.\n\nPANDORA’S RECRUITMENT PROCEDURES ARE DESIGNED TO BE TRANSPARENT AND CLEAR FOR ALL CANDIDATES. THIS HELPS US ENSURE THAT APPLICANTS ARE PROVIDED WITH A FAIR AND EQUAL OPPORTUNITY TO DEMONSTRATE THEIR COMPETENCIES AND SKILLS BY REMOVING BLOCKING FACTORS, POSSIBLE BIASES, AND RISKS OF DISCRIMINATION. WE ENCOURAGE EVERYONE APPLYING TO OUR VACANCIES TO REFRAIN FROM ADDING IDENTITY-RELATED ELEMENTS SUCH AS A PHOTO, MARITAL STATUS, AND AGE.\n\n ABOUT PANDORA NAM: \n\nTHE PANDORA TEAM IN THE USA CONSISTS OF MORE THAN 115 EMPLOYEES WORKING AT THE HUB OFFICE IN BALTIMORE, MARYLAND, MORE THAN 80 IN OUR LOGISTICS CENTER IN COLUMBIA, MARYLAND, AN ADDITIONAL 100 IN FIELD POSITIONS, AND MORE THAN 3,900 IN OUR OWNED AND OPERATED STORES. WE HAVE ALSO RECENTLY OPENED AN OFFICE IN NEW YORK CITY IN THE HEART OF TIMES SQUARE AND ARE ACTIVELY BUILDING OUT THIS TEAM WITH THE BEST TALENT IN THE MARKET.\n\nTODAY, THE USA IS PANDORA’S SINGLE LARGEST MARKET. THE PANDORA NORTH AMERICAN REGION ENCOMPASSES OVER 1,400 POINTS OF SALE, INCLUDING OVER 420 CONCEPT STORES, WITH MORE THAN 150 BEING OWNED AND OPERATED BY PANDORA.",
    "job_skill_set": [
      "Microsoft Office 365 Suite",
      "Customer Service",
      "Communication",
      "Sales",
      "Teamwork",
      "Relationship Building",
      "Results-Oriented",
      "Flexibility",
      "Problem Solving",
      "KWI",
      "POS Systems",
      "Applicant Tracking Systems"
    ],
    "short_keywords": [
      "365",
      "applicant",
      "associate",
      "building",
      "communication",
      "customer",
      "deptford",
      "flexibility",
      "kwi",
      "mall",
      "microsoft",
      "office",
      "pos",
      "problem",
      "relationship",
      "resultsoriented",
      "sales",
      "seasonal",
      "service",
      "solving",
      "suite",
      "systems",
      "teamwork",
      "tracking"
    ]
  },
  {
    "job_id": "3888484988",
    "job_title": "Sales Specialist: Diamond and Fine Jewelry (Mandatory Experience in Gemology and Diamond Industry Sales)",
    "category": "SALES",
    "job_description": "*** MANDATORY: 3 YEARS OF PROVEN EXPERIENCE IN GEMOLOGY, ECOM, AND SALES IN THE DIAMOND AND JEWELRY INDUSTRY. ***\nSALES SPECIALIST: DIAMOND AND FINE JEWELRY (MANDATORY EXPERIENCE IN GEMOLOGY AND DIAMOND INDUSTRY SALES)WE ARE A LEADING GLOBAL JEWELRY BRAND RENOWNED FOR OUR IN-HOUSE DESIGNS AND PRECISION MANUFACTURING. AS WE EXPAND OUR FOOTPRINT, WE SEEK A SEASONED SALES SPECIALIST WITH DEEP EXPERTISE IN GEMOLOGY, ECOM, AND SALES WITHIN THE DIAMOND INDUSTRY.\nWHY JOIN US?DIVE DEEP INTO THE CAPTIVATING WORLD OF DIAMONDS AND FINE JEWELRY.PLAY A PIVOTAL ROLE IN SHAPING OUR BRAND'S GLOBAL PRESENCE.THRIVE IN A DYNAMIC, REMOTE ENVIRONMENT THAT VALUES HARD WORK, CONTINUOUS LEARNING, AND GROWTH.\nKEY RESPONSIBILITIES:DELIVER TOP-NOTCH SUPPORT AND SERVICE TO OUR INTERNATIONAL CLIENTELE.EFFICIENTLY RESPOND TO CUSTOMER INQUIRIES, ENSURING SATISFACTION AND RETENTION.COLLABORATE WITH THE LOGISTICS TEAM FOR RELEVANT INQUIRIES.DRIVE UP SALES WHILE OVERSEEING THE MAINTENANCE SERVICES.CONTINUALLY ANALYZE AND ADDRESS ISSUES IMPACTING OUR CUSTOMER SERVICE JOURNEY.\nQUALIFICATIONS:MANDATORY: PROVEN EXPERIENCE IN GEMOLOGY, ECOM, AND SALES IN THE DIAMOND AND JEWELRY INDUSTRY.PRIOR EXPERIENCE IN A SERVICE CENTER OR SIMILAR ROLE.STRONG TECH-SAVVINESS WITH THE ABILITY TO SELF-LEARN AND ADAPT.DEMONSTRATED CREATIVITY AND INITIATIVE IN PROBLEM-SOLVING.EXCEPTIONAL ORGANIZATIONAL AND INTERPERSONAL PROWESS.ABILITY TO MULTITASK AND CATER TO DIVERSE CLIENTS WITH VARIED NEEDS.FLUENT WRITTEN AND ORAL COMMUNICATION SKILLS IN ENGLISH.\nIF YOU POSSESS THE BLEND OF PASSION, EXPERTISE, AND DEDICATION WE'RE LOOKING FOR, WE INVITE YOU TO BE A PART OF OUR ESTEEMED TEAM. REACH OUT TO US, AND LET'S SHAPE THE FUTURE OF FINE JEWELRY TOGETHER!",
    "job_skill_set": [
      "sales",
      "customer service",
      "logistics",
      "problem-solving",
      "organizational skills",
      "tech-savviness",
      "communication",
      "interpersonal skills",
      "multitasking",
      "adaptability",
      "gemology",
      "ecommerce",
      "creativity"
    ],
    "short_keywords": [
      "adaptability",
      "and",
      "communication",
      "creativity",
      "customer",
      "diamond",
      "ecommerce",
      "experience",
      "fine",
      "gemology",
      "in",
      "industry",
      "interpersonal",
      "jewelry",
      "logistics",
      "mandatory",
      "multitasking",
      "organizational",
      "problemsolving",
      "sales",
      "service",
      "skills",
      "specialist",
      "techsavviness"
    ]
  },
  {
    "job_id": "3886835914",
    "job_title": "Sales Associate - White House Black Market",
    "category": "SALES",
    "job_description": "JOIN OUR FASHION-OBSESSED TEAM, DEDICATED TO A STYLING AND SOCIAL EXPERIENCE THAT MAKES WOMEN FEEL BEAUTIFUL.\n\nPOSITION OBJECTIVE\n\nTHE SALES ASSOCIATE IS RESPONSIBLE FOR SUPPORTING MANAGEMENT IN IN PROMOTING A CUSTOMER AND PRODUCT-FOCUSED SALES CULTURE, WHERE OUR VALUES AND GUIDING PRINCIPLES ARE AT THE FOREFRONT OF ALL STORE OPERATIONS, INCLUDING ENSURING A GREAT CUSTOMER EXPERIENCE AND MAXIMUM PROFITABILITY. WE LOVE WHAT WE DO, AND BELIEVE THAT WITH OUR TEAMS, WE ARE THE MOST AMAZING PLACE TO WORK, LEARN, AND GROW!\n\nFUNCTIONAL RESPONSIBILITIES\n\nDRIVE FOR RESULTS\n\n MEETS COMPANY SALES GOALS BY UTILIZING SALES TECHNIQUES AND COMMUNICATING PRODUCT KNOWLEDGE TO THE CUSTOMER; RECOMMENDS MERCHANDISE SELECTIONS OR HELPS TO LOCATE OR OBTAIN MERCHANDISE BASED ON CUSTOMER NEEDS AND DESIRES. MAINTAINS KNOWLEDGE OF CURRENT SALES AND PROMOTIONS; MAINTAINS PRICING AND VISUAL STANDARDS. MAINTAINS STANDARDS IN MERCHANDISE HANDLING, PRESENTATION, LOSS PREVENTION, AND ALL OTHER DUTIES AS DIRECTED BY MANAGEMENT. PARTICIPATES IN VISUAL DIRECTIVES INCLUDING MONTHLY STORE SETS AND ZONE MAINTENANCE.\n\nCUSTOMER EXPERIENCE\n\n MODELS AND PROMOTES THE MOST AMAZING PERSONAL SERVICE (MAPS) PRINCIPLES AND STANDARDS, OFFERING A COHESIVE OMNI CHANNEL EXPERIENCE. ENSURES PROMPT RESOLUTION OF CUSTOMER CONCERNS. ENSURES A FAST AND EFFICIENT REGISTER EXPERIENCE, REMAINING CURRENT ON POLICIES REGARDING PAYMENTS, COUPON ACCEPTANCE, RETURNS AND EXCHANGES, SECURITY PRACTICES AND OTHER APPLICABLE OPERATIONS. REINFORCES BUYING DECISIONS AT THE CHECKOUT AND ACHIEVES ADD ON GOALS INCLUDING GIFT CARD SALES. SIGNS UP CLIENTS FOR REWARD PROGRAM. BUILDS AND MAINTAINS A SOLID CUSTOMER FOLLOWING THROUGH CLIENTELING AND WARDROBING. KNOWS CURRENT PRODUCT FIT AND STYLE ASSORTMENT OFFERINGS IN STORE AND ON LINE. MAINTAINS CONSISTENT CLIENT COMMUNICATION THROUGH UTILIZATION OF CUSTOMER BOOK.\n\nOPERATIONAL EXCELLENCE\n\n SUPPORTS REPLENISHMENT ACTIVITIES THAT KEEP THE STORE FULL AND ABUNDANT. ASSISTS WITH LOCATE FULFILLMENT. ASSISTS WITH VISUAL DIRECTIVES, INCLUDING FLOOR SETS, WINDOW CHANGES, VISUAL PRESENTATIONS, SIGNAGE PLACEMENT, ETC. AS DIRECTED. ASSIST WITH BOUTIQUE CLEANLINESS AND ORGANIZATION\n\nTEAMWORK AND GROWTH\n\n PROMOTES AN INCLUSIVE, COLLABORATIVE APPROACH TO PROBLEM SOLVING. SEEKS PERSONAL DEVELOPMENTAL OPPORTUNITIES AND READILY SOLICITS FEEDBACK.\n\nOTHER DUTIES AS ASSIGNED.\n\nTHIS POSITION MAY BE FOUND IN MULTIPLE BRANDS. SOME DUTIES MAY VARY FROM BRAND TO BRAND.\n\nQUALIFICATIONS\n\n HIGH SCHOOL DIPLOMA OR EQUIVALENT RETAIL OR SALES EXPERIENCE PREFERRED MUST BE 18 YEARS OF AGE OR OLDER EXCELLENT COMMUNICATION SKILLS EXCELLENT CUSTOMER SERVICE SKILLS ABLE TO LEARN OR ADAPT TO TECHNOLOGY PROVIDED BY THE COMPANY STRONG ORGANIZATIONAL SKILLS AND ABILITY TO MULTI-TASK IN A FAST-PACED ENVIRONMENT ABLE TO COMMUNICATE WITH CUSTOMERS, ASSOCIATES, AND MANAGEMENT REGULAR ATTENDANCE IS ESSENTIAL TO THIS POSITION TO ENSURE ADEQUATE COVERAGE TO MEET COMPANY OBJECTIVES. ABILITY TO WORK A FLEXIBLE WORK SCHEDULE, INCLUDING NIGHTS, WEEKENDS, AND HOLIDAYS IS REQUIRED\n\nPHYSICAL REQUIREMENTS\n\n CONSTANT WALKING/STANDING- 67-100% OF 8-HOUR SHIFT OCCASIONAL LIFTING UP TO 50 LBS.- 1-33% OF 8-HOUR SHIFT FREQUENT CLIMBING- 34%-66% OF 8-HOUR SHIFT\n\nDUE TO OUR GROWTH, WE ARE ALWAYS ACCEPTING APPLICATIONS FOR TOP TALENT TO JOIN OUR STORE TEAMS. WHEN WE DO HAVE AN OPEN POSITION, WE WILL REVIEW YOUR APPLICATION TO DETERMINE IF YOUR QUALIFICATIONS ARE A MATCH WITH OUR POSITION REQUIREMENTS. YOU MAY APPLY TO ANY LOCATION OR POSITION AT ANY TIME; HOWEVER, THE POSITION TO WHICH YOU APPLY MAY NOT CURRENTLY BE OPEN. ACCOMMODATION IS AVAILABLE TO APPLICANTS FOR EMPLOYMENT WITH DISABILITIES. TO REQUEST ACCOMMODATION DURING THE APPLICATION PROCESS, PLEASE CONTACT YOUR LOCAL STORE MANAGER FOR ASSISTANCE.\n\n3368 THE MARKET COMMON MYRTLE BEACH\n\nCHICO’S FAS, INC. IS AN EQUAL OPPORTUNITY EMPLOYER. WE DO NOT DISCRIMINATE ON THE BASIS OF RACE, COLOR, RELIGION, MARITAL STATUS, AGE, NATIONAL ORIGIN, ANCESTRY, PHYSICAL OR MENTAL DISABILITY, MEDICAL CONDITION, PREGNANCY, CHILDBIRTH AND RELATED MEDICAL CONDITIONS, LACTATION, GENETIC INFORMATION, GENDER, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, MILITARY SERVICE, VETERAN STATUS, OR ANY OTHER CATEGORY PROTECTED UNDER FEDERAL, STATE, OR LOCAL LAW.",
    "job_skill_set": [
      "sales techniques",
      "product knowledge",
      "customer service",
      "technology adaptation",
      "organizational skills",
      "multi-tasking",
      "visual merchandising",
      "cash register operation",
      "communication",
      "teamwork",
      "problem solving",
      "customer relationship management",
      "flexibility",
      "feedback solicitation"
    ],
    "short_keywords": [
      "adaptation",
      "associate",
      "black",
      "cash",
      "communication",
      "customer",
      "feedback",
      "flexibility",
      "house",
      "knowledge",
      "management",
      "market",
      "merchandising",
      "multitasking",
      "operation",
      "organizational",
      "problem",
      "product",
      "register",
      "relationship",
      "sales",
      "service",
      "skills",
      "solicitation",
      "solving",
      "teamwork",
      "techniques",
      "technology",
      "visual",
      "white"
    ]
  },
  {
    "job_id": "3904415979",
    "job_title": "Seasonal Sales Associate - Glendale Galleria",
    "category": "SALES",
    "job_description": "AS THE LARGEST JEWELLERY COMPANY IN THE WORLD, WE A GIVE A VOICE TO MILLIONS OF PEOPLE’S LOVES EVERY DAY. OUR BEAUTIFUL PRODUCTS EMPOWER PEOPLE ALL AROUND THE WORLD TO EXPRESS THEMSELVES. WE ARE PROUD TO BE PART OF THEIR STORIES AND THE MOST IMPORTANT MOMENTS IN THEIR LIVES.\n\nWHERE ORIGINAL THINKING IS WELCOMED, AND CAN TURN INTO POSITIVE IMPACT IN A HEARTBEAT, WE CAN DREAM BIG, DARE TO ACT, AND DELIVER WITH CARE AND PASSION. AT PANDORA WHERE YOU CAN EACH CRAFT FAR MORE THAN JUST AN INCREDIBLE CAREER.\n\nABOUT THE TEAM: \n\nTHE SEASONAL SALES ASSOCIATE WILL BE THE ULTIMATE PANDORA FAN. YOU WILL BE RESPONSIBLE FOR DRIVING RETAIL EXCELLENCE AND ENSURING EVERY CLIENT RECEIVES OUTSTANDING SERVICE. YOUR PASSION FOR THE BRAND WILL SHINE THROUGH AND WILL BE RESPONSIBLE FOR DELIVERING A WORLD-CLASS CUSTOMER EXPERIENCE, SURPASSING SALES GOALS, AND CONTINUALLY FINDING INNOVATIVE WAYS TO ENGAGE AND ATTRACT CUSTOMERS.\n\nPLEASE NOTE, THIS JOB WILL REQUIRE THE COMPLETION OF AN ASSESSMENT THAT WILL BE EMAILED TO YOU UPON SUBMITTAL OF THE APPLICATION. \n\n\nPOSTING END DATE OF MAY 10, 2024\n\nOUR SEASONAL SALES ASSOCIATES SHINE BY:\n\nDARETO EMBRACE THE STORE CULTURE FILLED WITH PASSION FOR OUR BRAND, WHERE TEAM MEMBERS SHINE AS EXTRAORDINARY BRAND AMBASSADORS.WELCOME OPPORTUNITIES AND SOAR BEYOND COMMERCIAL TARGETS AND KPI EXPECTATIONS, SETTING NEW RECORDS AND ACHIEVING REMARKABLE SUCCESS.EXECUTE A HIGH-PERFORMANCE SELLING ENVIRONMENT THAT CREATESMOMENTS AND EXCEEDS SHOPPER EXPECTATIONS, DELIVERING UNFORGETTABLE EXPERIENCES EVERY TIME.CRAFT A LOYAL CUSTOMER BASE THROUGH ENGAGING WITH OUR VALUED CLIENTS, BUILDING GENUINE CONNECTIONS, AND FOSTERING LONG-LASTING RELATIONSHIPS.\n\n\nCRAFT YOUR CAREER WITH US IF YOU HAVE: \n\nYOU CAN DEMONSTRATE YOU’RE RESULTS-ORIENTED, IDEALLY WITH 1 YEAR OF EXPERIENCE IN A SELLING ENVIRONMENT WOULD BE HIGHLY ADVANTAGEOUSYOU HAVE DEVELOPED A SENSE OF CARE IN YOUR COMMUNICATION SKILLS BOTH WRITTEN AND VERBAL. YOU KNOW HOW TO CHARM AND CAPTIVATE AN AUDIENCE WITH THE ABILITY TO CONNECT WITH PEOPLE AT ALL LEVELS OF THE ORGANIZATION.KNOWLEDGE OF MICROSOFT OFFICE 365 SUITE, KWI, POS SYSTEMS, AND EVEN APPLICANT TRACKING SYSTEMS IS WHERE YOU SHINEYOU ARE AT LEAST 18 YEARS OR OLDER AND CAN PROVIDE PROOF OF IDENTIFY AND ELIGIBILITY TO WORK DREAMAND EMBRACE ADVENTURE! A FLEXIBLE WORK SCHEDULE THAT INCLUDES NIGHTS, WEEKENDS, AND HOLIDAYS IS ALL PART OF THE EXCITEMENT. THIS CAN INCLUDE STANDING FOR EXTENDED PERIODS.\n\n\nOUR BENEFITS: \n\nWE CARE! PANDORA OFFERS PRODUCT DISCOUNTS FOR THEIR SEASONAL EMPLOYEES\n\n\nSALARY: $16.00 TO $17.50 COMMENSURATE WITH EXPERIENCE\n\nABOUT PANDORA: \n\nPANDORA DESIGNS, MANUFACTURES, AND MARKETS HAND-FINISHED JEWELLERY MADE FROM HIGH-QUALITY MATERIALS AT AFFORDABLE PRICES. PANDORA JEWELLERY IS SOLD IN MORE THAN 100 COUNTRIES THROUGH 6,800 POINTS OF SALE, INCLUDING MORE THAN 2,700 CONCEPT STORES.\n\nHEADQUARTERED IN COPENHAGEN, DENMARK, PANDORA EMPLOYS 27,000 PEOPLE WORLDWIDE AND CRAFTS ITS JEWELLERY AT TWO LEED CERTIFIED FACILITIES IN THAILAND USING MAINLY RECYCLED SILVER AND GOLD. THE COMPANY PLANS TO BE CARBON NEUTRAL BY 2025 AND HAS JOINED THE SCIENCE BASED TARGETS INITIATIVE TO REDUCE EMISSIONS ACROSS ITS FULL VALUE CHAIN. PANDORA IS LISTED ON THE NASDAQ COPENHAGEN STOCK EXCHANGE AND GENERATED A REVENUE OF DKK 23.4 BILLION IN 2021.\n\nPANDORA’S RECRUITMENT PROCEDURES ARE DESIGNED TO BE TRANSPARENT AND CLEAR FOR ALL CANDIDATES. THIS HELPS US ENSURE THAT APPLICANTS ARE PROVIDED WITH A FAIR AND EQUAL OPPORTUNITY TO DEMONSTRATE THEIR COMPETENCIES AND SKILLS BY REMOVING BLOCKING FACTORS, POSSIBLE BIASES, AND RISKS OF DISCRIMINATION. WE ENCOURAGE EVERYONE APPLYING TO OUR VACANCIES TO REFRAIN FROM ADDING IDENTITY-RELATED ELEMENTS SUCH AS A PHOTO, MARITAL STATUS, AND AGE.\n\nABOUT PANDORA NAM:\n\nTHE PANDORA TEAM IN THE USA CONSISTS OF MORE THAN 115 EMPLOYEES WORKING AT THE HUB OFFICE IN BALTIMORE, MARYLAND, MORE THAN 80 IN OUR LOGISTICS CENTER IN COLUMBIA, MARYLAND, AN ADDITIONAL 100 IN FIELD POSITIONS, AND MORE THAN 3,900 IN OUR OWNED AND OPERATED STORES. WE HAVE ALSO RECENTLY OPENED AN OFFICE IN NEW YORK CITY IN THE HEART OF TIMES SQUARE AND ARE ACTIVELY BUILDING OUT THIS TEAM WITH THE BEST TALENT IN THE MARKET.\n\nTODAY, THE USA IS PANDORA’S SINGLE LARGEST MARKET. THE PANDORA NORTH AMERICAN REGION ENCOMPASSES OVER 1,400 POINTS OF SALE, INCLUDING OVER 420 CONCEPT STORES, WITH MORE THAN 150 BEING OWNED AND OPERATED BY PANDORA.",
    "job_skill_set": [
      "Microsoft Office 365",
      "customer service",
      "communication",
      "sales",
      "teamwork",
      "relationship building",
      "results-oriented",
      "problem solving",
      "flexibility",
      "POS systems",
      "KWI",
      "Applicant Tracking Systems"
    ],
    "short_keywords": [
      "365",
      "applicant",
      "associate",
      "building",
      "communication",
      "customer",
      "flexibility",
      "galleria",
      "glendale",
      "kwi",
      "microsoft",
      "office",
      "pos",
      "problem",
      "relationship",
      "resultsoriented",
      "sales",
      "seasonal",
      "service",
      "solving",
      "systems",
      "teamwork",
      "tracking"
    ]
  },
  {
    "job_id": "3905207164",
    "job_title": "Sales Academy Associate- Rotational Program (June 2024 Start)",
    "category": "SALES",
    "job_description": "CALLING ALL INNOVATORS – FIND YOUR FUTURE AT FISERV.\n\nWE’RE FISERV, A GLOBAL LEADER IN FINTECH AND PAYMENTS, AND WE MOVE MONEY AND INFORMATION IN A WAY THAT MOVES THE WORLD. WE CONNECT FINANCIAL INSTITUTIONS, CORPORATIONS, MERCHANTS, AND CONSUMERS TO ONE ANOTHER MILLIONS OF TIMES A DAY – QUICKLY, RELIABLY, AND SECURELY. ANY TIME YOU SWIPE YOUR CREDIT CARD, PAY THROUGH A MOBILE APP, OR WITHDRAW MONEY FROM THE BANK, WE’RE INVOLVED. IF YOU WANT TO MAKE AN IMPACT ON A GLOBAL SCALE, COME MAKE A DIFFERENCE AT FISERV.\n\nJOB TITLE\n\nSALES ACADEMY ASSOCIATE- ROTATIONAL PROGRAM (JUNE 2024 START)\n\nTHE CLASS WILL BE IN OUR BERKELEY HEIGHTS, NJ OFFICE. RELOCATION ASSISTANCE IS PROVIDED IF NEEDED. CANDIDATES MUST BE WILLING TO RELOCATE ANYWHERE FOR OTHER ROTATIONS PER BUSINESS NEED.\n\nWHAT DOES A SUCCESSFUL SALES ACADEMY ASSOCIATE I DO AT FISERV?\n\nFISERV'S EARLY-CAREER SALES ACADEMY PROGRAM IS A 2 -YEAR DEVELOPMENT PROGRAM WITH 4 ROTATION EXPERIENCES IN VARIOUS SALES/RELATIONSHIP MANAGEMENT ROLES AND ENVIRONMENTS. IN THE PROGRAM, YOU CAN LOOK FORWARD TO RECEIVING INTENSIVE, FIRST-CLASS TRAINING, COACHING, AND DEVELOPMENT. AS YOU PROGRESS THROUGH THE PROGRAM, YOU WILL BUILD KNOWLEDGE, SKILLS, AND CAPACITIES NECESSARY TO SUCCEED IN ELITE SALES OR RELATIONSHIP MANAGEMENT ROLES. YOU CAN ALSO LOOK FORWARD TO C-LEVEL ENGAGEMENT OF A FORTUNE 500 COMPANY AND ONE ON ONE MENTORSHIP OF TOP TIER SALES & RELATIONSHIP MANAGEMENT PROFESSIONALS.\n\nWE ARE LOOKING FOR RECENT COLLEGE GRADUATES WHO HAVE FOCUSED ON SALES, SALES PROFESSIONALS EARLY IN THEIR CAREER OR IN JUNIOR POSITIONS, AND SOLUTION EXPERTS LOOKING FOR AN ACCELERATED PATH INTO A SALES ROLE GENERALLY OCCUPIED BY PROFESSIONALS WITH MORE EXPERIENCE. CANDIDATES WILL BE CHOSEN BASED ON THEIR DEMONSTRATED POTENTIAL AND ENTHUSIASM FOR A CAREER IN SALES.\n\nGRADUATES OF THIS PROGRAM WILL HAVE DEMONSTRATED HIGH-LEVEL CAPACITY TO:\n\nGENERATE LEADS AND DRIVE PROFITABLE REVENUE BY SELLING FISERV’S ENTERPRISE PAYMENTS SOLUTIONS WITHIN DESIGNATED TERRITORY OR ASSIGNED ACCOUNTS.DRIVE STRATEGIES, TACTICS, AND ACCOUNT PLANS TO IDENTIFY, QUALIFY AND SECURE NEW FISERV CLIENTS TO MEET SALES TARGETS.MANAGE THE EFFECTIVE MOVEMENT OF LEADS THROUGH THE SALES PROCESS, INCLUDING QUALIFICATION OF PROSPECTS; ASSESSMENT OF POTENTIAL CLIENT NEEDS; PRESENTATION OF FISERV SOLUTIONS; AND EXPEDITIOUS CLOSING OF BUSINESS.INDEPENDENTLY DEVELOP SELLING STRATEGIES FOR ASSIGNED ACCOUNTS AND EFFECTIVELY INTERFACES REGULARLY WITH EXECUTIVE LEVELS.LEVERAGE EXECUTIVE LEVEL CONTACTS TO DEVELOP GREATER ACCOUNT COVERAGE AND CREATE DEMAND. DEVELOP STRATEGIES TO UTILIZE KEY INFLUENTIAL INDIVIDUALS WITHIN CLIENT’S DECISION PROCESS AND CREATE ACTION PLANS TO INFLUENCE DECISIONS.SECURE FUNDING FOR FUTURE CUSTOMER INITIATIVES BY LINKING FISERV’S SOLUTIONS TO CLIENT’S BUSINESS ISSUES TO GAIN CREDIBILITY AT EXECUTIVE LEVEL.RECOMMEND NEW VALUE-ADD SOLUTIONS THROUGH UNSOLICITED PROPOSALS TO CREATE CUSTOMER DEMAND AND HELPS CUSTOMER IDENTIFY AND MEASURE THE IMPACT OF THE PROPOSED BUSINESS IMPROVEMENT.BUILD INTERNAL AND EXTERNAL INDUSTRY NETWORKS TO REMAIN CURRENT ON INDUSTRY TRENDS AND DESCRIBES FISERV’S VALUE IN THE CONTEXT OF EMERGING MARKET TRENDS AND HOW THEY AFFECT THE CUSTOMER.ARTICULATE TO THE CUSTOMER HOW FISERV IS BETTER POSITIONED THAN THE COMPETITION TO MEET THEIR BUSINESS NEEDS AND OBJECTIVES.PREVENT OBJECTIONS BY UNCOVERING CUSTOMER CONCERNS EARLY AND BUILDING CONSENSUS TOWARDS A MUTUAL SOLUTION BASED ON CUSTOMER REQUIREMENTS.DEVELOP LONG TERM CLIENT AND BUSINESS RELATIONSHIPS BASED ON MUTUAL VALUE AND TRUST, RESULTING IN REPEAT BUSINESS FOR FISERV. MANAGE CLIENT EXPECTATIONS APPROPRIATELY TO ENSURE MUTUAL SATISFACTION FOR THE CLIENT AND FISERV.MAINTAIN PROMPT AND ACCURATE SALES PIPELINE FORECASTING IN THE ECRM SYSTEM.PRACTICE FISERV WAY OF SELLING PHILOSOPHIES AND SKILL SETS. SHARE INDUSTRY, SOLUTION, DEAL, AND SALES “BEST PRACTICE” KNOWLEDGE WITH THE SALES COMMUNITY.\n\nYOU WILL NEED TO HAVE\n\n BACHELOR DEGREE AND 1+YRS SALES OR FISERV EXPERIENCE A RECENT GRADUATE, WITH 3.0 + GPA, PREFERRED MAJOR OR FOCUS ON SALES WILLINGNESS TO TRAVEL REGULARLY, AND POTENTIALLY RELOCATE 1-4 TIMES MUST POSSESS UNRESTRICTED WORK AUTHORIZATION AND NOT REQUIRE FUTURE SPONSORSHIP\n\nIT WOULD BE GREAT TO HAVE\n\n KNOWLEDGE OF BANKING, FINANCIAL INDUSTRY, OR FINANCIAL TECHNOLOGY FISERV KNOWLEDGE STRONG VERBAL AND WRITTEN COMMUNICATION SKILLS\n\nSALARY RANGE\n\n$66,600- $108,600\n\nTHESE PAY RANGES APPLY TO EMPLOYEES IN NEW JERSEY. PAY RANGES FOR EMPLOYEES IN OTHER STATES MAY DIFFER.\n\nTHIS ROLE IS NOT ELIGIBLE TO BE PERFORMED IN COLORADO, CALIFORNIA, HAWAII, NEW YORK OR WASHINGTON.\n\nPLEASE NOTE THAT SALARY RANGES PROVIDED FOR THIS ROLE ON EXTERNAL JOB BOARDS ARE SALARY ESTIMATES MADE BY OUTSIDE PARTIES AND MAY NOT BE ACCURATE.\n\nTHANK YOU FOR CONSIDERING EMPLOYMENT WITH FISERV. PLEASE\n\nAPPLY USING YOUR LEGAL NAMECOMPLETE THE STEP-BY-STEP PROFILE AND ATTACH YOUR RESUME (EITHER IS ACCEPTABLE, BOTH ARE PREFERABLE).\n\nWHAT YOU SHOULD KNOW ABOUT US\n\nFISERV IS A GLOBAL LEADER IN PAYMENTS AND FINANCIAL TECHNOLOGY WITH MORE THAN 40,000 ASSOCIATES PROUDLY SERVING CLIENTS IN MORE THAN 100 COUNTRIES. AS ONE OF FORTUNE® MAGAZINE'S \"WORLD'S MOST ADMIRED COMPANIES™\" 9 OF THE LAST 10 YEARS, ONE OF FAST COMPANY’S MOST INNOVATIVE COMPANIES, AND A TOP SCORER ON BLOOMBERG’S GENDER-EQUALITY INDEX, WE ARE COMMITTED TO INNOVATION AND EXCELLENCE.\n\nOUR COMMITMENT TO DIVERSITY AND INCLUSION\n\nFISERV IS AN EQUAL OPPORTUNITY EMPLOYER, AND WE WELCOME AND ENCOURAGE DIVERSITY IN OUR WORKFORCE THAT REFLECTS OUR WORLD. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, PROTECTED VETERAN STATUS, OR ANY OTHER CATEGORY PROTECTED BY LAW.\n\nWE WILL ENSURE THAT INDIVIDUALS WITH DISABILITIES ARE PROVIDED REASONABLE ACCOMMODATION TO PARTICIPATE IN THE JOB APPLICATION OR INTERVIEW PROCESS, TO PERFORM ESSENTIAL JOB FUNCTIONS, AND TO RECEIVE OTHER BENEFITS AND PRIVILEGES OF EMPLOYMENT. PLEASE CONTACT US TO REQUEST ACCOMMODATION.\n\nWARNING ABOUT FAKE JOB POSTS\n\nPLEASE BE AWARE OF FRAUDULENT JOB POSTINGS THAT ARE NOT AFFILIATED WITH FISERV. FRAUDULENT JOB POSTINGS MAY BE USED BY CYBER CRIMINALS TO TARGET YOUR PERSONALLY IDENTIFIABLE INFORMATION AND/OR TO STEAL MONEY OR FINANCIAL INFORMATION.\n\nANY COMMUNICATIONS FROM A FISERV REPRESENTATIVE WILL COME FROM A LEGITIMATE BUSINESS EMAIL ADDRESS. WE WILL NOT HIRE THROUGH TEXT MESSAGE, SOCIAL MEDIA, OR EMAIL ALONE, AND ANY INTERVIEWS WILL BE CONDUCTED IN PERSON OR THROUGH A SECURE VIDEO CALL. WE WON’T ASK YOU FOR SENSITIVE INFORMATION NOR WILL WE ASK YOU TO PAY ANYTHING DURING THE HIRING PROCESS. WE ALSO WON’T SEND YOU A CHECK TO CASH ON FISERV’S BEHALF.\n\nIF YOU SEE SUSPICIOUS ACTIVITY OR BELIEVE THAT YOU HAVE BEEN THE VICTIM OF A JOB POSTING SCAM, YOU SHOULD REPORT IT TO YOUR LOCAL FBI FIELD OFFICE OR TO THE FBI’S INTERNET CRIME COMPLAINT CENTER.",
    "job_skill_set": [
      "sales",
      "relationship management",
      "lead generation",
      "account management",
      "sales forecasting",
      "presentation skills",
      "communication",
      "teamwork",
      "problem solving",
      "adaptability",
      "networking",
      "customer focus",
      "trust-building",
      "influence",
      "financial technology",
      "ECRM systems",
      "business strategy",
      "negotiation",
      "mentorship",
      "enthusiasm"
    ],
    "short_keywords": [
      "2024",
      "academy",
      "account",
      "adaptability",
      "associate",
      "business",
      "communication",
      "customer",
      "ecrm",
      "enthusiasm",
      "financial",
      "focus",
      "forecasting",
      "generation",
      "influence",
      "june",
      "lead",
      "management",
      "mentorship",
      "negotiation",
      "networking",
      "presentation",
      "problem",
      "program",
      "relationship",
      "rotational",
      "sales",
      "skills",
      "solving",
      "start",
      "strategy",
      "systems",
      "teamwork",
      "technology",
      "trustbuilding"
    ]
  },
  {
    "job_id": "3888481091",
    "job_title": "Retail Sales Associate Part Time",
    "category": "SALES",
    "job_description": "RETAIL SALES ASSOCIATE – PART-TIME \n\nWE INVEST IN OUR PEOPLE AND CONTINUOUSLY WORK TOWARDS FOSTERING AN INSPIRATIONAL, INCLUSIVE, AND INNOVATIVE CULTURE, SO THAT EVERY TEAM MEMBER HAS A TRUE SENSE OF BELONGING. WE HELP PEOPLE CONFIDENTLY EXPRESS THEIR TRUE SELVES SO THEY CAN BE THEIR BEST. \n\nWE HAVE IMMEDIATE OPENINGS – START RIGHT AWAY! \n\n COMPETITIVE HOURLY RATES FLEXIBLE SCHEDULES TO MEET YOUR AVAILABILITY! TUITION REIMBURSEMENT GENEROUS EMPLOYEE DISCOUNT ON FIRST PURCHASE ONGOING DISCOUNTS ON PURCHASE MADE AT ANY TAILORED BRANDS STORE.\n\nWHAT YOU BRING\n\n CUSTOMER SERVICE – OR AS WE CALL IT – CULTURE OF CUSTOMER-OBSESSION BY BEING CUSTOMER-READY AND DELIVERING A WORLD-CLASS EXPERIENCE EVERY DAY DESIRE TO LEARN AND ADAPT TO NEW PROGRAMS ABILITY TO WORK WELL AND CONSULT WITH RETAIL SALES ASSOCIATES AT ALL LEVELS AND CONTRIBUTE TO A POSITIVE WORK ENVIRONMENT\n\nOUR RETAIL SALES ASSOCIATES ARE RESPONSIBLE FOR ALL ASPECTS OF THE CUSTOMER EXPERIENCE WITHIN MULTIPLE BUSINESSES (RETAIL, RENTAL, CUSTOM, AND OMNI-CHANNEL) WITHIN A STORE LOCATION INCLUDING, BUT NOT LIMITED TO:\n\n ENGAGE AS A MEMBER OF A HIGH-PERFORMING TEAM THROUGH TRUST, COMMITMENT, AND A FOCUS ON RESULTS. BUILD A RELATIONSHIP WITH YOUR CUSTOMER FROM GREETING THROUGH POST-SALE CONTACT. CONSISTENTLY DEMONSTRATE THE BENCHMARK SELLING TECHNIQUES FOR RETAIL SALES, CUSTOM CLOTHING SALES, AND SPECIAL OCCASION RENTALS. CONTINUOUSLY ENCOURAGE AND PARTICIPATE IN TEAM SELLING AND POSITIVELY IMPACT THE ACHIEVEMENT OF THE STORE SALES VOLUME AND METRICS GOALS. ASSIST WITH VISUALLY MERCHANDISING, SET UP, AND OTHER STORE-RELATED PROJECTS, AS WELL AS CONDUCTING MERCHANDISE STOCK COUNTS. HANDLE THE CASH REGISTER, AS A CASHIER, AT THE POINT OF SALE IN THE STORE.\n\nPHYSICAL REQUIREMENTS\n\n ABILITY TO STAND AND WALK FOR THE MAJORITY OF WORK SHIFT, FREQUENTLY BEND, SQUAT AND TWIST, LIFT UP TO 50 LBS., CLIMB A LADDER TO REACH MERCHANDISE AND OR SUPPLIES, AND SEE AND DISTINGUISH BETWEEN FABRIC PATTERNS AND COLORS.\n\nYOU MAY HAVE THE OPPORTUNITY TO VOLUNTARILY WORK BETWEEN MULTIPLE STORE OR SITE LOCATIONS, AND ACROSS MULTIPLE BRANDS. \n\nREASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS\n\nOUR COMPANY CELEBRATES DIVERSITY AND PROVIDES EQUAL EMPLOYMENT OPPORTUNITY TO ALL APPLICANTS AND EMPLOYEES WITHOUT REGARD TO RACE, COLOR, SEX, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, NATIONAL ORIGIN, RELIGION, VETERAN OR MILITARY STATUS, AGE, PHYSICAL OR MENTAL DISABILITY, MARITAL STATUS, OR ANY OTHER PROTECTED STATUS UNDER THE LAW.\n\nWORK LOCATIONS: 02504 THE PAVILIONS 9019 EAST INDIAN BEND ROAD SCOTTSDALE 85260\n\nJOB: SALES\n\nORGANIZATION: MEN'S WEARHOUSE\n\nSHIFT: VARIABLE\n\nZONE: WEST",
    "job_skill_set": [
      "customer service",
      "cash handling",
      "visual merchandising",
      "sales techniques",
      "inventory management",
      "retail operations",
      "teamwork",
      "communication",
      "adaptability",
      "relationship building",
      "problem solving",
      "positive attitude"
    ],
    "short_keywords": [
      "adaptability",
      "associate",
      "attitude",
      "building",
      "cash",
      "communication",
      "customer",
      "handling",
      "inventory",
      "management",
      "merchandising",
      "operations",
      "part",
      "positive",
      "problem",
      "relationship",
      "retail",
      "sales",
      "service",
      "solving",
      "teamwork",
      "techniques",
      "time",
      "visual"
    ]
  },
  {
    "job_id": "3900956231",
    "job_title": "Retail Brand Ambassador (Sales Associate)- PT- Medford (702415)",
    "category": "SALES",
    "job_description": "POSITION DETAILS\n\nPOSITION LOCATION: MEDFORD, OR\n\nDEPARTMENT: RETAIL STORE OPERATIONS\n\nREPORTS TO: STORE MANAGER\n\nFLSA STATUS: NON-EXEMPT (OVERTIME ELIGIBLE)\n\nSUMMARY\n\nWE ARE PROUD TO BE MAKING BEST-IN-CLASS APPAREL FOR THE ACTIVE WORKER. OUR DEDICATION TO QUALITY IS NOT ONLY REFLECTED IN OUR PRODUCTS BUT ALSO IN OUR PEOPLE. AT CARHARTT, WE ARE COMMITTED TO PROVIDING:\n\n OUR CONSUMER WITH A BRAND THEY CAN TRUST AND DEPEND ON. OUR ASSOCIATES WITH CAREER CHALLENGES AND REWARDS. OUR COMMUNITIES WITH SUPPORT AND ASSISTANCE.\n\nOUR WORK ENVIRONMENT IS FRIENDLY, BUSINESS CASUAL, FAMILY ORIENTED AND WELCOMING TO EVERYONE. BEING AN EQUAL OPPORTUNITY EMPLOYER, WE ARE A DIVERSE WORKFORCE WITH ASSOCIATES LOCATED AROUND THE GLOBE AND ACROSS MULTIPLE CULTURES. WE ADVOCATE AN OPEN DOOR POLICY, TEAMWORK, CAREER GROWTH, AND PROMOTING FROM WITHIN. OUR ASSOCIATES ARE OUR MOST VALUABLE ASSETS AND WE INVEST IN THEM THROUGH REWARDING CAREER OPPORTUNITIES.\n\nWE ARE ALL LEADERS AT CARHARTT\n\nRESPONSIBILITIES\n\nENTHUSIASTICALLY PROMOTE THE BRAND BY BEING AN AMBASSADOR FOR CARHARTT.WORK AS A TEAM MEMBER TO ACHIEVE/EXCEED THE OVERALL STORE’S TOTAL REVENUE GOALS.PROVIDE AN EXTRAORDINARY SHOPPING EXPERIENCE BY CONNECTING WITH YOUR CUSTOMERS THROUGH MEETING AND ANTICIPATING THEIR NEEDS.IDENTIFY SALES OPPORTUNITIES FINDING THE PERFECT SOLUTION FOR EACH AND EVERY CUSTOMER.SUPPORT THE STORE MANAGEMENT TEAM IN ACHIEVEMENT OF FINANCIAL AND OPERATIONAL OBJECTIVES WITH REGARDS TO EXPENSE CONTROL, LOSS PREVENTION AND SAFETY.MAINTAIN THE APPEARANCE OF THE SELLING FLOOR; RESTOCK AND MERCHANDISE ACCORDING TO CARHARTT STANDARDS AND COMPANY DIRECTIVES.ENSURE EASE OF CUSTOMER SHOPPING EXPERIENCE THROUGH VISUAL PRESENTATION AND OVERALL STORE MAINTENANCE.ACTIVELY PARTICIPATE IN MERCHANDISING ACTIVITIES INCLUDING, BUT NOT LIMITED TO: DAILY STOCK MAINTENANCE, FOLDING, AND FLOOR CHANGEOVERS.ESTABLISH AND MAINTAIN POSITIVE WORKING RELATIONSHIPS WITH MANAGEMENT, CUSTOMERS AND CO-WORKERS.\n\nKEY PERFORMANCE INDICATORS:\n\nPROVIDE THE CARHARTT HIGH LEVEL OF CUSTOMER SERVICE AND SATISFACTION WITH EVERY CUSTOMER AND SALES OPPORTUNITY.FULLY SUPPORT THE STORE MANAGER AND CORPORATE WITH ALL FUNCTIONS AND DIRECTION AS NECESSARY.STORE IS FULLY STOCKED, VISUALLY APPEALING, AND GIVES EACH AND EVERY CUSTOMER A UNIQUE CARHARTT SHOPPING EXPERIENCE.\n\nEDUCATION\n\nNO MINIMUM DEGREE REQUIRED\n\nREQUIRED SKILLS AND EXPERIENCE\n\nPREVIOUS RETAIL EXPERIENCE PREFERRED.EXCELLENT ORGANIZATION, PRIORITIZATION AND COMMUNICATION SKILLS.EXCEPTIONAL TEAM AND COLLABORATION SKILLS.STRONG PC SKILLS: POS SYSTEMS AND MICROSOFT OFFICE.\n\nWORKING CONDITIONS\n\nEEOMODERATE LIFTING (30-40 LBS.)RETAIL ENVIRONMENTRETAIL HOURSTOBACCO FREETRAVEL (5%)",
    "job_skill_set": [
      "retail experience",
      "merchandising",
      "visual presentation",
      "customer service",
      "communication",
      "teamwork",
      "organization",
      "collaboration",
      "problem solving",
      "POS systems",
      "Microsoft Office",
      "stock maintenance"
    ],
    "short_keywords": [
      "702415",
      "ambassador",
      "associate",
      "brand",
      "collaboration",
      "communication",
      "customer",
      "experience",
      "maintenance",
      "medford",
      "merchandising",
      "microsoft",
      "office",
      "organization",
      "pos",
      "presentation",
      "problem",
      "pt",
      "retail",
      "sales",
      "service",
      "solving",
      "stock",
      "systems",
      "teamwork",
      "visual"
    ]
  },
  {
    "job_id": "3884447063",
    "job_title": "Sales Account Manager",
    "category": "SALES",
    "job_description": "THE SALES ACCOUNT MANAGER IS RESPONSIBLE FOR THE SALES PROCESS FROM GENERATING NEW OPPORTUNITIES THROUGH A CONSULTATIVE SALES PROCESS, TO WORKING WITH THE SALES ENGINEER TO CREATE A SOLUTION, CREATING AND PRESENTING A CLIENT PROPOSAL AND CLOSING THE SALE. THIS POSITION REQUIRES SUPERIOR COMMUNICATION SKILLS TO DEVELOP SUCCESSFUL, LONG-TERM CLIENT RELATIONSHIPS, SATISFY CUSTOMERS’ NEEDS AND REQUESTS, RESPOND TO QUERIES IN A TIMELY MANNER, AND DELIVER A POSITIVE CUSTOMER EXPERIENCE. CCS IS LOOKING FOR SALES ACCOUNT MANAGERS WITH AT LEAST 2 YEARS OF B2B SALES EXPERIENCE. PLEASE SUBMIT ALL RESUMES TO HR@CALCOMSEC.COM RESPONSIBILITIES· GENERATE NEW BUSINESS VIA BUSINESS DEVELOPMENT EFFORTS, NETWORKING, AND SOCIAL MEDIA· DEVELOP RELATIONSHIPS WITH EXISTING CUSTOMERS USING CRM DATABASE· ESTABLISH RELATIONSHIPS WITH A&E’S, CONSULTANTS, AND CONTRACTORS· SET AND TRACK SALES ACCOUNT TARGETS, ALIGNED WITH COMPANY OBJECTIVES· SUPPORT MARKETING EFFORTS BY ATTENDING TRADE SHOWS, CONFERENCES, AND OTHER MARKETING EVENTS· SUGGEST ACTIONS TO IMPROVE SALES PERFORMANCE AND IDENTIFY OPPORTUNITIES FOR GROWTH· FOCUS ON CUSTOMER SATISFACTION AND OVERALL SALES TEAM AND BUSINESS SUCCESS· CREATE AND DELIVER SALES PRESENTATIONS AND DEMOS· PARTICIPATE IN SALES TRAINING, AS REQUESTEDQUALIFICATIONS· EDUCATION LEVEL: BACHELOR’S DEGREETWO OR MORE YEARS OF B2B SALES EXPERIENCE.· INDUSTRY EDUCATION: SALES & MARKETING, BUSINESS ADMINISTRATION· QUALIFICATIONS AND CERTIFICATIONS: N/A· AREA OF EXPERTISE: SALES",
    "job_skill_set": [
      "B2B Sales",
      "CRM Software",
      "Sales Presentations",
      "Business Development",
      "Sales Process Management",
      "Market Research",
      "Communication",
      "Relationship Building",
      "Customer Satisfaction",
      "Problem Solving",
      "Teamwork",
      "Networking"
    ],
    "short_keywords": [
      "account",
      "b2b",
      "building",
      "business",
      "communication",
      "crm",
      "customer",
      "development",
      "management",
      "manager",
      "market",
      "networking",
      "presentations",
      "problem",
      "process",
      "relationship",
      "research",
      "sales",
      "satisfaction",
      "software",
      "solving",
      "teamwork"
    ]
  },
  {
    "job_id": "3889420923",
    "job_title": "Internal Sales - BSC - Welshpool WA",
    "category": "SALES",
    "job_description": "WE ARE CURRENTLY SEEKING AN INTERNAL SALES SUPERSTAR TO JOIN OUR BSC TEAM IN WELSHPOOL. \n\nTHE IDEAL CANDIDATE IS RELIABLE, A TEAM PLAYER AND GOOD WITH BOTH NUMBERS AND COMPUTERS. YOUR ROLE WILL CONSIST OF WORKING TOGETHER IN A TEAM TO HELP DRIVE CUSTOMER SATISFACTION.\n\nTHIS IS A GREAT OPPORTUNITY TO LEARN ABOUT INDUSTRIAL DISTRIBUTION AND ENGINEERING SUPPLIES IN A POSITIVE, HELPFUL, AND INCLUSIVE TEAM ENVIRONMENT.\n\nWHAT YOUR DAY LOOKS LIKE?\n\nYOU WILL ACHIEVE THIS BY ANSWERING PHONE CALLS AND OR ATTENDING TO CUSTOMERS EITHER IN PERSON, PHONE, OR EMAIL. YOUR DAY WILL ALSO CONSIST OF PICK PACKING ITEMS AND HELPING WERE NECESSARY.\n\nPROVIDE COUNTER SALES AND ASSISTANCE.ASSISTING WITH GENERAL BRANCH SUPPORT AND ADMINISTRATION.BUILDING RELATIONSHIP WITH CUSTOMERS VIA PHONE AND EMAIL TO ASSIST IN ANSWERING QUERIES REGARDING PRODUCTS, PRICING, ORDERS, STOCK, DELIVERY, AND ACCOUNT QUERIES. THIS POSITION WILL BE REPORTING TO THE BRANCH MANAGER.\n\n\nWHO ARE WE LOOKING FOR?\n\nMINIMUM 6 MONTHS TO A YEAR PROVEN SALES EXPERIENCE WITHIN A SIMILAR ROLE EXPERIENCE.COMPUTER LITERATE AT AN INTERMEDIATE LEVEL.PROFESSIONAL PHONE MANNER. EXPERIENCE IN BEARINGS, POWER TRANSMISSIONS OR A MECHANICAL APTITUDE (DESIRABLE).WILLINGNESS TO WORK AS PART OF A TEAM AND GO THE EXTRA MILE TO HELP ACHIEVE BUSINESS TARGETS.HAVE A GREAT PHONE MANNER, HELPFUL DISPOSITION, AND THE ABILITY TO KEEP CALM IN CHALLENGING SITUATIONSA CAN- DO ATTITUDE AND WILLING TO LEARN.SOLUTION-ORIENTED IN YOUR APPROACH TO PROBLEM-SOLVING, AND HELPING CUSTOMERS\n\n\nWHY US?\n\nUNIFORMS SUPPLIED – FEEL LIKE A TEAM.GREAT ONGOING TRAINING, COACHING, AND MENTORING.EXCELLENT WORK ENVIRONMENT AND TEAM CULTURE – JOIN A TRANSPARENT AND SUPPORTIVE TEAM THAT VALUES JOB SATISFACTION AND HONESTY.OPPORTUNITY TO PROGRESS WITHIN THE COMPANY AND EARN MORE.OPTION FOR WORK LIFE BALANCE WITH WEEKENDS OFF (OR OPPORTUNITY FOR OVERTIME).COMPANY THAT VALUES LONG TERM EMPLOYMENT AND ITS PEOPLE.RECOGNITION PROGRAMS AND INCENTIVE FOR YOUR PERFORMANCE.ACCESS TO ATTRACTIVE RETAIL DISCOUNT AND EARN CASHBACK.ELIGIBLE FOR 1 GOOD TO GIVE LEAVE DAY PER CALENDAR YEAR IN ADDITION TO NORMAL LEAVE ENTITLEMENTS TO PARTICIPATE IN VOLUNTEERING ACTIVITIES.\n\n\nWE PROVIDE HIGH QUALITY INDUSTRIAL & ENGINEERING PRODUCTS AND SERVICES INCLUDING, BEARINGS, POWER TRANSMISSION, FLUID POWER FITTINGS, SEALS, POWER TOOLS AND CONSUMABLES TO ENGINEERING, MINING, TRANSPORT, DEFENCE, MANUFACTURERS, CIVIL INFRASTRUCTURE, AND THE TRADES, SERVICED BY OUR 85 PLUS STRATEGICALLY LOCATED BRANCHES AROUND AUSTRALIA.\n\nWANT TO LEARN MORE ABOUT US, VISIT OUR WEBSITE HTTPS://BSC.COM.AU/\n\nSO, IF YOU ARE INTERESTED IN JOINING OUR GROUP DON’T WAIT, APPLY NOW, AND LET US HELP YOU EMPOWER YOUR CAREER IN MOTION WITH US.\n\n MOTION IS AN EQUAL OPPORTUNITY EMPLOYER\n\nYOU MUST BE EITHER AN AUSTRALIAN CITIZEN OR A HOLDER OF AN AUSTRALIAN PERMANENT RESIDENCY VISA TO BE ELIGIBLE TO APPLY FOR THIS POSITION.",
    "job_skill_set": [
      "sales experience",
      "computer literacy",
      "customer service",
      "problem solving",
      "administration",
      "product knowledge",
      "teamwork",
      "communication",
      "reliability",
      "positive attitude",
      "calmness under pressure",
      "willingness to learn",
      "solution-oriented",
      "mechanical aptitude"
    ],
    "short_keywords": [
      "administration",
      "aptitude",
      "attitude",
      "bsc",
      "calmness",
      "communication",
      "computer",
      "customer",
      "experience",
      "internal",
      "knowledge",
      "learn",
      "literacy",
      "mechanical",
      "positive",
      "pressure",
      "problem",
      "product",
      "reliability",
      "sales",
      "service",
      "solutionoriented",
      "solving",
      "teamwork",
      "to",
      "under",
      "wa",
      "welshpool",
      "willingness"
    ]
  },
  {
    "job_id": "3902868002",
    "job_title": "Branch Sales Specialist (Full Time)",
    "category": "SALES",
    "job_description": "WORK LOCATION TYPE: ONSITE\n\nAS A LEADING INDUSTRIAL DISTRIBUTOR WITH OPERATIONS PRIMARILY IN NORTH AMERICA, JAPAN AND THE UNITED KINGDOM, WE KEEP THE WORLD WORKING® BY SERVING MORE THAN 4.5 MILLION CUSTOMERS WORLDWIDE WITH PRODUCTS DELIVERED THROUGH INNOVATIVE TECHNOLOGY AND DEEP CUSTOMER RELATIONSHIPS. WITH 2023 SALES OF $16.5 BILLION, WE’RE DEDICATED TO PROVIDING VALUE FOR CUSTOMERS, FOSTERING AN ENGAGING CULTURE FOR TEAM MEMBERS AND DRIVING STRONG FINANCIAL RESULTS.\n\nOUR WELCOMING WORKPLACE ENABLES YOU TO LEARN, GROW AND MAKE A DIFFERENCE BY KEEPING BUSINESSES RUNNING AND THEIR PEOPLE SAFE. AS A 2024 GLASSDOOR BEST PLACE TO WORK AND A GREAT PLACE TO WORK-CERTIFIED™ COMPANY, WE’RE LOOKING FOR PASSIONATE PEOPLE TO JOIN OUR TEAM AS WE CONTINUE LEADING THE INDUSTRY OVER OUR NEXT 100 YEARS.\n\nPOSITION DETAILS\n\nBRANCH SALES SPECIALISTS PROVIDE SOLUTIONS AND EASILY CONNECT WITH OUR WALK IN CUSTOMERS AND HELPS OTHER TEAM MEMBERS TO DO THE SAME. SALES SPECIALISTS OBJECTIVE IS TO MAXIMIZE SALES OPPORTUNITIES, CREATE CUSTOMER LOYALTY, AND EXCEED CUSTOMER EXPECTATIONS BY USING THEIR GUIDANCE, ADVANCED KNOWLEDGE, AND WINNING ATTITUDE. SALES SPECIALISTS COMPLETE AND HAS RESPONSIBILITY FOR A VARIETY OF BRANCH PROCESSES THAT ARE IMPORTANT TO THE BRANCH'S OPERATION AND OVERALL EFFECTIVENESS. SALES SPECIALISTS WILL SHIFT FOCUS TO PERFORM A VARIETY OF WAREHOUSE TASKS AND REPORT TO BRANCH MANAGER.\n\nYOU WILL\n\nUSE INCLUSIVE BEHAVIORS AND USE MULTI TASKING/PRIORITIZATION TO SERVE AS SUBJECT MATTER EXPERT FOR BRANCH TEAM MEMBERSUSE ADVANCED SKILLS TO MAXIMIZE SALES OPPORTUNITIES, TAKE OWNERSHIP AND LEAD BY EXAMPLE WITH ALL SHOWROOM SALES PROMOTIONS AND PRODUCT SPECIALS, AND EXCEED CUSTOMER EXPECTATIONSOVERSEE THE ENTIRE CUSTOMER EXPERIENCE. THIS INCLUDES APPROPRIATE PRODUCT SELECTION, ACCURATE ORDER ENTRY AND MAINTENANCE, SAFELY PICKING PRODUCT, AND SAFELY LOADING CUSTOMER VEHICLE.LEARN AND EASILY NAVIGATE THROUGH SEVERAL COMPUTER APPLICATIONS FOR CUSTOMER-FACING AND WAREHOUSE ACTIVITIESPERFORM ACTIONS CONSISTENT WITH BRANCH SALES FOCUS TO MAXIMIZE SALES OPPORTUNITIES AND ENCOURAGE CUSTOMER LOYALTY \n\nYOU HAVE\n\nHIGH SCHOOL DIPLOMA OR EQUIVALENT1+ YEARS OF EXPERIENCE IN RELATED FIELDLIFT UP TO 50 POUNDS UNASSISTED AND HEAVIER LOADS WITH ASSISTANCEADAPT COMMUNICATION AND STYLE TO DIFFERING AUDIENCES WHETHER IT IS DIFFERENT PERSONALITY TYPES, OTHER TEAM MEMBERS, IN WRITING/EMAIL, OVER PHONE, OR IN PERSONOPERATE POWERED INDUSTRIAL EQUIPMENT \n\nREWARDS AND BENEFITS\n\nWITH BENEFITS STARTING DAY ONE, GRAINGER IS COMMITTED TO YOUR SAFETY, HEALTH AND WELLBEING. OUR PROGRAMS PROVIDE CHOICE AND FLEXIBILITY TO MEET OUR TEAM MEMBERS' INDIVIDUAL NEEDS. CHECK OUT SOME OF THE REWARDS AVAILABLE TO YOU AT GRAINGER\n\nMEDICAL, DENTAL, VISION, AND LIFE INSURANCE PLANSGENEROUS PAID TIME OFF (PTO) AND 6 COMPANY HOLIDAYS PER YEARAUTOMATIC 6% 401(K) COMPANY CONTRIBUTION EACH PAY PERIODEMPLOYEE DISCOUNTS, PARENTAL LEAVE, 3:1 MATCH ON DONATIONS AND TUITION REIMBURSEMENTA COMPREHENSIVE SET OF EMOTIONAL, FINANCIAL, PHYSICAL AND SOCIAL WELLBEING PROGRAMS\n\nWE ARE COMMITTED TO EQUAL EMPLOYMENT OPPORTUNITY REGARDLESS OF RACE, COLOR, ANCESTRY, RELIGION, SEX, NATIONAL ORIGIN, SEXUAL ORIENTATION, AGE, CITIZENSHIP, MARITAL STATUS, DISABILITY, GENDER, GENDER IDENTITY OR EXPRESSION, OR VETERAN STATUS. WE ARE PROUD TO BE AN EQUAL OPPORTUNITY WORKPLACE.\n\nWE ARE COMMITTED TO FOSTERING AN INCLUSIVE, ACCESSIBLE ENVIRONMENT THAT INCLUDES BOTH PROVIDING REASONABLE ACCOMMODATIONS TO INDIVIDUALS WITH DISABILITIES DURING THE APPLICATION AND HIRING PROCESS AS WELL AS THROUGHOUT THE COURSE OF ONE’S EMPLOYMENT. WITH THIS IN MIND, SHOULD YOU NEED A REASONABLE ACCOMMODATION DURING THE APPLICATION AND SELECTION PROCESS, PLEASE ADVISE US SO THAT WE CAN PROVIDE APPROPRIATE ASSISTANCE.",
    "job_skill_set": [
      "sales",
      "computer applications",
      "communication",
      "teamwork",
      "multitasking",
      "problem solving",
      "adaptability",
      "customer service",
      "order entry",
      "warehouse operations",
      "powered industrial equipment operation",
      "lifting (up to 50 pounds)",
      "leadership",
      "customer loyalty"
    ],
    "short_keywords": [
      "50",
      "adaptability",
      "applications",
      "branch",
      "communication",
      "computer",
      "customer",
      "entry",
      "equipment",
      "full",
      "industrial",
      "leadership",
      "lifting",
      "loyalty",
      "multitasking",
      "operation",
      "operations",
      "order",
      "pounds",
      "powered",
      "problem",
      "sales",
      "service",
      "solving",
      "specialist",
      "teamwork",
      "time",
      "to",
      "up",
      "warehouse"
    ]
  },
  {
    "job_id": "3887493118",
    "job_title": "Sales Representative",
    "category": "SALES",
    "job_description": "COMPANY\n\nUS0024 SYSCO CHICAGO, INC.\n\nZIP CODE\n\n60016\n\nMINIMUM YEARS OF EXPERIENCE\n\n0-1 YEARS\n\nEMPLOYMENT TYPE\n\nFULL TIME\n\nTRAVEL PERCENTAGE\n\nUP TO 25%\n\nCOMPENSATION INFORMATION\n\nTHE PAY RANGE PROVIDED IS NOT INDICATIVE OF SYSCO’S ACTUAL PAY RANGE BUT IS MERELY ALGORITHMIC AND PROVIDED FOR GENERALIZED COMPARISON. FACTORS THAT MAY BE USED TO DETERMINE RATE OF PAY INCLUDE SPECIFIC SKILLS, WORK LOCATION, WORK EXPERIENCE AND OTHER INDIVIDUALIZED FACTORS\n\nARE YOU AN EXPERIENCED SALES PROFESSIONAL, RESTAURANT MANAGER, CULINARY MANAGER OR CHEF LOOKING FOR CAREER DEVELOPMENT OPPORTUNITIES? JOIN SYSCO’S WORLD CLASS SALES TEAM AND EXPLORE ALL THE BENEFITS AND PERKS.\n\nWHY YOU SHOULD JOIN OUR SALES TEAM\n\nCOMPETITIVE BASE SALARY, BONUS, PLUS PROMOTIONAL INCENTIVE OPPORTUNITIESCAR ALLOWANCE (MILEAGE REIMBURSEMENT FOR CANDIDATES IN CA) AND CELL PHONE PROVIDEDCAREER PATHING OPPORTUNITIES FOR BOTH ENTRY LEVEL, AND EXPERIENCED INDIVIDUALSOPPORTUNITY TO BE PART OF A PURPOSE DRIVEN ORGANIZATION THAT SUPPORTS COMMUNITIES AND ASSOCIATESSPECIALIZED SALES TRAININGINDIVIDUAL AS WELL AS TEAM-BASED SELLINGOPPORTUNITY TO LEARN DIFFERENT ETHNIC SEGMENTSMONTHLY AND ANNUAL SALES REWARDS AND RECOGNITIONROBUST BENEFITS PACKAGE INCLUDING AN EMPLOYEE STOCK PURCHASE PLAN, & 401(K) WITH AUTOMATIC MATCHING\n\nTERRITORY FOR THIS OPPORTUNITY: :JOLIET, ORLAND PARK, HOMEWOOD\n\nJOB SUMMARY\n\nTHIS IS AN OUTSIDE SALES POSITION RESPONSIBLE FOR PROMOTING THE COMPANY'S PRODUCTS AND SERVICES AND FOR BUILDING RELATIONSHIPS WITH NEW AND EXISTING ACCOUNTS. THE MAIN FOCUS IS TO HELP SYSCO CUSTOMERS SUCCEED WHILE ACHIEVING SALES AND PROFIT GOALS ESTABLISHED BY THE COMPANY. THIS POSITION MAY REQUIRE WORKING SOME NON-TRADITIONAL HOURS (EVENING, WEEKENDS, AND HOLIDAYS) TO SUCCESSFULLY MEET CUSTOMERS' NEEDS.\n\nRESPONSIBILITIES\n\nDEVELOP NEW BUSINESS, PENETRATE EXISTING ACCOUNTS, AND MINIMIZE LOST BUSINESS TO ACHIEVE PROFITABLE SALES GROWTH AND SPECIAL OBJECTIVES WITHIN ASSIGNED TERRITORY.SEEK AND QUALIFY PROSPECTS FOLLOWING COMPANY ACCOUNT STRATIFICATION GOALS.RESEARCH CUSTOMER BUSINESS NEEDS AND DEVELOPS A MIX OF PRODUCTS AND SERVICE TO MEET NEEDS.EVALUATE MARKET TRENDS AND RECOMMEND PRODUCTS TO CUSTOMERS, BASED ON BUSINESS NEEDS AND GOALS.BE INFORMED OF MARKET CONDITIONS, PRODUCT INNOVATIONS, AND COMPETITORS' PRODUCTS, PRICES, AND SALES; SHARE INFORMATION WITH CUSTOMERS AS PART OF VALUE-ADDED SERVICES PROVIDED.ANSWER CUSTOMERS' QUESTIONS ABOUT PRODUCTS, PRICES, AVAILABILITY, AND PRODUCT USE.PROVIDE PRODUCT INFORMATION AND PRACTICAL TRAINING TO CUSTOMER PERSONNEL.DRIVE PERSONAL VEHICLE TO CUSTOMER ACCOUNTS, CONVENTIONS, COMPANY MEETINGS, ETC.COMMUNICATE AND COLLECT ACCOUNTS RECEIVABLE AS NECESSARY, WORKING WITH THE CREDIT DEPARTMENT AND CLIENT; COLLECT ALL BALANCES DUE BASED ON APPROVED CREDIT TERMS.MANAGE DELIVERIES TO THE ROUTING SCHEDULE PUBLISHED BY THE TRANSPORTATION DEPARTMENT; TROUBLESHOOT ANY PROBLEMS THAT OCCUR DURING THE ORDER PROCESS (FOR EXAMPLE, OUT OF STOCK ITEMS, SPECIAL ORDER ITEMS, LOW INVENTORY, ETC.).PARTICIPATE IN COMPANY FUNCTIONS, PROMOTIONS, CUSTOMER VISITS, AND CUSTOMER EVENTS.ATTEND AND PARTICIPATE IN GENERAL SALES AND DISTRICT MEETINGS.ENGAGE IN ONGOING TRAINING SESSIONS.ASSIST WITH THE TRAINING OF NEW EMPLOYEES AS REQUESTED.REVIEW AND ANALYZE DAILY AND WEEKLY REPORTS SUCH AS SPECIAL-ORDER REQUESTS, CUSTOMER BID FILES, AND SALES/GROSS PROFIT MARGIN DATA.PERFORM ADMINISTRATIVE DUTIES, SUCH AS PREPARING SALES BUDGETS AND REPORTS, MAINTAINING SALES RECORDS, PROCESSING CREDITS, AND PICK-UP REQUESTS, PREPARING SALES QUOTES AND MENU SUGGESTIONS, AND FILING REPORTS.OTHER DUTIES MAY BE ASSIGNED.\n\nQUALIFICATIONS\n\nREQUIRED EDUCATION/EXPERIENCE\n\nBACHELOR'S DEGREE IN BUSINESS, SALES, MARKETING, HOSPITALITY, CULINARY ARTS OR RELATED DISCIPLINE OR HSD/GED AND 3 YEARS RESTAURANT MANAGEMENT, B2B OR OUTSIDE SALES EXPERIENCE, OR EQUIVALENT RELATABLE EXPERIENCE.\n\nPREFERRED QUALIFICATIONS\n\nBI-LINGUALRESTAURANT MANAGEMENT, FOODSERVICE OUTSIDE SALES, CHEF EXPERIENCE PREFERRED\n\nCERTIFICATES, LICENSES, AND REGISTRATIONS\n\nVALID DRIVER'S LICENSE WITH A \"CLEAN\" DRIVING RECORD (INCLUDING NO MULTIPLE DUIS WITHIN THE LAST 2 YEARS)CURRENT AUTOMOBILE INSURANCE WITH THE FOLLOWING LIMITS OF LIABILITY: BODILY INJURY - $100,000 EACH PERSON AND $300,000 EACH ACCIDENT; PROPERTY DAMAGE - $100,000 IS REQUIRED\n\nREQUIREMENT\n\nSUBMIT TO PRE-EMPLOYMENT TESTING (DRUG SCREEN, BACKGROUND CHECK).MUST SIGN SYSCO PROTECTIVE COVENANTS AGREEMENT.RESIDE OR WILLING TO RELOCATE TO THE GEOGRAPHICAL VICINITY OF TERRITORY.\n\nPROFESSIONAL SKILLS\n\nBASIC PC SKILLS AND PROFICIENCY WITH MS OFFICE.ABILITY TO READ, WRITE, SPEAK ENGLISH.\n\nCOMPETENCIES\n\nBUILDING TRUSTBUILDING CUSTOMER LOYALTYFOLLOW-UPSALES ABILITY / PERSUASIVENESSMANAGING WORKADAPTABILITYCOMMUNICATION\n\nBENEFITS INFORMATION\n\nFOR INFORMATION ON SYSCO’S BENEFITS, PLEASE VISIT HTTPS://SYSCOBENEFITS.COM\n\nOVERVIEW\n\nSYSCO IS THE GLOBAL LEADER IN FOODSERVICE DISTRIBUTION. WITH OVER 71,000 COLLEAGUES AND A FLEET OF OVER 13,000 VEHICLES, SYSCO OPERATES APPROXIMATELY 333 DISTRIBUTION FACILITIES WORLDWIDE AND SERVES MORE THAN 700,000 CUSTOMER LOCATIONS.\n\nWE OFFER OUR COLLEAGUES THE OPPORTUNITY TO GROW PERSONALLY AND PROFESSIONALLY, TO CONTRIBUTE TO THE SUCCESS OF A DYNAMIC ORGANIZATION, AND TO SERVE OTHERS IN A MANNER THAT EXCEEDS THEIR EXPECTATIONS. WE’RE LOOKING FOR TALENTED, HARD-WORKING INDIVIDUALS TO JOIN OUR TEAM. COME GROW WITH US AND LET US SHOW YOU WHY SYSCO IS AT THE HEART OF FOOD AND SERVICE.\n\nAFFIRMATIVE ACTION STATEMENT\n\nAPPLICANTS MUST BE CURRENTLY AUTHORIZED TO WORK IN THE UNITED STATES.\n\nWE ARE PROUD TO BE AN EQUAL OPPORTUNITY AND AFFIRMATIVE ACTION EMPLOYER, AND CONSIDER QUALIFIED APPLICANTS WITHOUT REGARD TO RACE, COLOR, CREED, RELIGION, ANCESTRY, NATIONAL ORIGIN, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, AGE, DISABILITY, VETERAN STATUS OR ANY OTHER PROTECTED FACTOR UNDER FEDERAL, STATE OR LOCAL LAW.\n\nTHIS OPPORTUNITY IS AVAILABLE THROUGH SYSCO CORPORATION, ITS SUBSIDIARIES AND AFFILIATES.",
    "job_skill_set": [
      "Sales",
      "Customer Relationship Management",
      "Product Knowledge",
      "Training",
      "Communication",
      "Building Trust",
      "Adaptability",
      "Persuasiveness",
      "Teamwork",
      "Follow-up",
      "Customer Loyalty",
      "Problem Solving",
      "Market Research",
      "MS Office",
      "B2B Sales",
      "Driving",
      "Sales Reporting"
    ],
    "short_keywords": [
      "adaptability",
      "b2b",
      "building",
      "communication",
      "customer",
      "driving",
      "followup",
      "knowledge",
      "loyalty",
      "management",
      "market",
      "ms",
      "office",
      "persuasiveness",
      "problem",
      "product",
      "relationship",
      "reporting",
      "representative",
      "research",
      "sales",
      "solving",
      "teamwork",
      "training",
      "trust"
    ]
  },
  {
    "job_id": "3902964047",
    "job_title": "Enterprise Sales Executive",
    "category": "SALES",
    "job_description": "ENTERPRISE SALES EXECUTIVEFORT WORTH, TEXAS, UNITED STATES \nCOME WORK FOR US!JOIN OUR GROWING TEAM OF EXPERTS DEDICATED TO HELPING CLIENTS SIMPLIFY AND STRENGTHEN THEIR MARKETING EFFORTS.\nXPRESSDOCS IS LOOKING FOR AN ENTERPRISE SALES EXECUTIVE TO BE RESPONSIBLE FOR NEW BUSINESS DEVELOPMENT AND DEVELOPING LONG-TERM PROFITABLE RELATIONSHIPS. AS AN OUTSIDE SALES EXECUTIVE, THE CANDIDATE MUST CONVEY KNOWLEDGE AND EXPERTISE ABOUT XPRESSDOCS’ SERVICES AND CAPABILITIES. THE SALES EXECUTIVE WILL BE ACCOUNTABLE FOR DEVELOPING A BOOK OF BUSINESS AND MEETING THE MONTHLY, QUARTERLY, AND ANNUAL REVENUE AND SALES GOALS FOR THE COMPANY.\nIN THIS POSITION, YOU WILL:DEVELOP A PIPELINE OF PROSPECTS IN KEY VERTICALS VIA SELF-PROSPECTING AND MARKETING DRIVEN DEMAND GENERATION TOOLS.ABILITY TO MAINTAIN CONSISTENT OUTREACH PROGRAM (CALLS, EMAILS, LINKEDIN, ETC.) WITH A POSITIVE AND PERSISTENT STYLE.EFFECTIVELY UTILIZE HUBSPOT CRM FOR CLIENT PROSPECTING AND PIPELINE MANAGEMENT.DEVELOP BUSINESS PLANS FOR ACCOUNTS TO MEET OR EXCEED SALES, MARKETING, AND CUSTOMER SATISFACTION OBJECTIVES.ANTICIPATE A CUSTOMER’S NEEDS AND EXPECTATIONS WHILE SELLING XPRESSDOCS PRODUCTS AND SERVICES.MAINTAIN LONG-TERM CONSULTATIVE RELATIONSHIPS WITH CLIENTS FOR REPEAT BUSINESS GROWTH.BE RESOURCEFUL & TAKE RESPONSIBILITY FOR CONTROLLING YOUR SUCCESS IN OUR BUSINESS GROWTH.ENSURE TIMELY DELIVERY OF ALL PRODUCTS AND SERVICES FOR CUSTOMERS.\nYOU’LL THRIVE IN THIS ROLE IF YOU:HAVE FIVE PLUS YEARS OF SUCCESSFUL OUTSIDE SALES EXPERIENCE IN THE PRINT ON DEMAND OR DIRECT MAIL SOLUTIONS INDUSTRY.HAVE RECENT EXPERIENCE IN HEALTHCARE, INSURANCE, FINANCIAL SERVICES OR WITH FRANCHISE ORGANIZATIONS IS AN ASSET.HAVE MET OR EXCEEDED ANNUAL SALES QUOTAS OF $2M – $5M A YEAR.ABILITY TO BUILD STRONG RELATIONSHIPS, ROBUST SALES, AND NEGOTIATING SKILLS.SELF-MOTIVATED AND ABLE TO WORK WITH MINIMAL SUPERVISION.EXCELLENT COMMUNICATION SKILLS—WRITTEN AND VERBAL.CONFIDENT PERSONALITY SUITABLE FOR HANDLING COLD CALLS AND ACCOUNT MANAGEMENT.EXCELLENT PRESENTATION AND ORGANIZATION SKILLS.POSSESS AND SUBSCRIBE TO HIGH WORK AND BUSINESS ETHICS.DEMONSTRABLE TRACK RECORD OF SUCCESS THROUGH EXCEEDING SALES GOALS AND QUOTAS.\nWHAT WE OFFER:AN ENVIRONMENT THAT PRIORITIZES BALANCE BETWEEN WORK AND FAMILY. OUR COMPREHENSIVE BENEFITS PACKAGE AND WORKPLACE OPPORTUNITIES INCLUDE:COLLABORATE WITH AN UPBEAT TEAM OF TECHIES, CREATIVES, AND SPECIALISTS…WHO ACTUALLY LIKE WHAT THEY DO. ENJOY OUR MODERN, SECURE AND CENTRALLY LOCATED OFFICE IN FORT WORTHFLEXIBLE WORK FROM HOME OPTIONSONSITE COFFEE BAR AND WELLNESS ROOMSMEDICAL, DENTAL, VISION, DISABILITY, AND LIFE INSURANCE401K WITH COMPANY MATCHINGPAID HOLIDAYS, VACATION, AND PERSONAL TIMETUITION REIMBURSEMENTEMPLOYEE AWARDS PROGRAMA DEDICATED SOCIAL PLATFORM FOR PEER, WORK ANNIVERSARY AND BIRTHDAY RECOGNITION WHO WE ARE:A MARKETING/PRINT/TECHNOLOGY COMPANY WITH MORE THAN 20 YEARS OF EXPERIENCE HELPING SOME OF TODAY’S TOP COMPANIES SIMPLIFY AND STRENGTHEN THEIR MARKETING. WE PROVIDE CUTTING-EDGE BUT ACCESSIBLE BRAND MANAGEMENT MARKETING TECHNOLOGY, FLEXIBLE PRINT APIS, PRODUCE HIGH-QUALITY MARKETING MATERIALS WITH SAME DAY TURN TIMES, AND CREATE WORLD-CLASS CUSTOMER EXPERIENCES. COME JOIN A TEAM THAT CAN HELP YOU TAKE YOUR SALES GOALS TO THE NEXT LEVEL!TO LEARN MORE ABOUT WHAT WE DO AND WHO WE SERVE, VISIT WWW.XPRESSDOCS.COM.XPRESSDOCS PROVIDES EQUAL EMPLOYMENT OPPORTUNITIES TO ALL EMPLOYEES AND APPLICANTS FOR EMPLOYMENT AND PROHIBITS DISCRIMINATION AND HARASSMENT OF ANY TYPE WITHOUT REGARD TO RACE, COLOR, RELIGION, AGE, SEX, NATIONAL ORIGIN, DISABILITY STATUS, GENETICS, PROTECTED VETERAN STATUS, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, OR ANY OTHER CHARACTERISTIC PROTECTED BY FEDERAL, STATE OR LOCAL LAWS.",
    "job_skill_set": [
      "sales",
      "presentation skills",
      "customer relationship management",
      "communication",
      "self-motivation",
      "relationship building",
      "organization",
      "problem solving",
      "work ethic",
      "team collaboration",
      "CRM (HubSpot)",
      "business development",
      "pipeline management",
      "marketing",
      "negotiation",
      "print on demand",
      "direct mail solutions",
      "healthcare industry knowledge",
      "insurance industry knowledge",
      "financial services knowledge",
      "franchise organizations knowledge",
      "adaptability",
      "persistence"
    ],
    "short_keywords": [
      "adaptability",
      "building",
      "business",
      "collaboration",
      "communication",
      "crm",
      "customer",
      "demand",
      "development",
      "direct",
      "enterprise",
      "ethic",
      "executive",
      "financial",
      "franchise",
      "healthcare",
      "hubspot",
      "industry",
      "insurance",
      "knowledge",
      "mail",
      "management",
      "marketing",
      "negotiation",
      "on",
      "organization",
      "organizations",
      "persistence",
      "pipeline",
      "presentation",
      "print",
      "problem",
      "relationship",
      "sales",
      "selfmotivation",
      "services",
      "skills",
      "solutions",
      "solving",
      "team",
      "work"
    ]
  },
  {
    "job_id": "3884804979",
    "job_title": "Client Sales & Intake Coordinator",
    "category": "SALES",
    "job_description": "JOIN OUR TEAM AS A CLIENT SALES & INTAKE COORDINATOR AT SOUTH ATLANTA INJURY LAWYERS!\nSOUTH ATLANTA INJURY LAWYERS, BASED IN JONESBORO, IS DEDICATED TO PROVIDING COMPASSIONATE AND EXCELLENT LEGAL SERVICES. OUR FIRM SPECIALIZES IN PERSONAL INJURY. WE'RE EXPANDING OUR TEAM AND SEEKING A CLIENT SALES & INTAKE COORDINATOR. IF YOU'RE LOOKING FOR A POSITION CLOSE TO HOME IN A SUPPORTIVE ENVIRONMENT, WE WANT TO HEAR FROM YOU!\nABOUT US:A COLLABORATIVE TEAM THAT PRIORITIZES FEEDBACK AND INVESTS IN MAKING EVERYONE'S JOB EASIER.COMMITMENT TO EXCELLENT CUSTOMER SERVICE, VALUING BOTH CLIENT AND EMPLOYEE SATISFACTION.AN EASY-GOING YET PRODUCTIVE ENVIRONMENT WITH STOCKED SNACKS, QUARTERLY OFFICE RETREATS, AND FLEXIBLE WORKING HOURS.COMMUNITY-ORIENTED WITH VARIOUS EVENTS PLANNED THROUGHOUT THE YEAR.\nABOUT YOU:ARTICULATE, ATTENTIVE, AND AGILE IN HANDLING POTENTIAL CLIENT INQUIRIES AND LEADS.COMFORTABLE WITH SALES WHEN ENGAGING WITH POTENTIAL CLIENTS.ADAPTABLE TEAM PLAYERENJOY WORKING IN A FAST-PACED ENVIRONMENT AND WITH CLIENTELE WHO NEED OUR SERVICES.\nYOUR DUTIES WILL INCLUDE:HANDLING ALL LEADS AND MANAGING ALL LEAD SOURCES AND QUALIFY POTENTIAL CLIENTS.EXCELLENT SALES AND CUSTOMER SERVICE WITH ALL PROSPECTIVE CLIENTELE.GREETING CLIENTS IN PERSON AND ON THE PHONE.ANSWERING PHONES, SCHEDULING APPOINTMENTS, AND MANAGING CLIENT CORRESPONDENCE.MANAGING THE DOCKET PROGRAM AND HANDLING GENERAL OFFICE TASKS.DEMONSTRATING A HISTORY OF EXCEPTIONAL CUSTOMER SERVICE.MUST HAVE A POSITIVE AND OUTGOING PERSONALITY.\nQUALIFICATIONS AND SKILLS MASTERED:TYPING 50 WPM MINIMUMSALES ENTHUSIAST. ENJOY ENGAGING WITH PEOPLE AND GUIDING THEM THROUGH OUR FIRM'S SERVICES.PRIOR EXPERIENCE IN CLIENT COMMUNICATION VIA IN-PERSON, PHONE, AND EMAIL.BI-LINGUAL (SPANISH/ENGLISH) PROFESSIONAL SKILL SETS, PREFERRED.EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS WITH ATTENTION TO DETAIL AND MEETING DEADLINES.PROFICIENCY IN WORD, ADOBE, AND DOCUMENT MANAGEMENT SOFTWARE (LEAD DOCKET).1-2 YEARS OF RECENT SALES OR CUSTOMER SERVICE EXPERIENCE.SOME COLLEGE (DEGREE PREFERRED).\nWE OFFER:COMPETITIVE BASE SALARY WITH SALES INCENTIVES AND A BONUS STRUCTURE FOR SIGNED-UP CLIENTS.MEDICAL, DENTAL, AND VISION INSURANCE.PAID TIME OFF AND HOLIDAYS.401K.FREE PARKING.ON-THE-JOB TRAININGTRAVEL REIMBURSEMENTPOTENTIAL FOR HYBRID WORK*NOTE: WAITING PERIOD MAY APPLY TO SOME BENEFITS.\nIF YOU'RE READY FOR A CHALLENGING YET REWARDING CAREER WHERE YOUR SKILLS WILL FLOURISH, SOUTH ATLANTA INJURY LAWYERS IS THE PLACE FOR YOU. APPLY TODAY AND EMBARK ON A JOURNEY WHERE PROFESSIONALISM MEETS GROWTH.\nAPPLICATION PROCESS:ALL INQUIRIES ARE HELD IN STRICT CONFIDENCE. NO WALK-INS, PHONE CALLS, DIRECT INQUIRIES, OR AGENCIES. WE WILL REACH OUT TO ALL APPLICANTS WHOM WE ARE CONSIDERING FOR THIS OPPORTUNITY.\nNOTE: THIS JOB POSTING SERVES AS INFORMATIONAL PURPOSES ONLY AND DOES NOT CONSTITUTE A CONTRACT OF EMPLOYMENT.\nJOB TYPE: FULL-TIME\nSALARY: $40,000.00 - $45,000.00 PER YEAR\nCOMPENSATION PACKAGE: BONUS OPPORTUNITIES\nSCHEDULE:EVENINGS AS NEEDEDMONDAY TO FRIDAYWEEKENDS AS NEEDED\nTRAVEL REQUIREMENT: TRAVEL\nWORK LOCATION: IN PERSON",
    "job_skill_set": [
      "sales",
      "customer service",
      "lead management",
      "communication",
      "teamwork",
      "adaptability",
      "attention to detail",
      "positive attitude",
      "problem solving",
      "time management",
      "typing",
      "document management software",
      "bilingual (Spanish/English)",
      "proficiency in Word",
      "proficiency in Adobe"
    ],
    "short_keywords": [
      "adaptability",
      "adobe",
      "attention",
      "attitude",
      "bilingual",
      "client",
      "communication",
      "coordinator",
      "customer",
      "detail",
      "document",
      "in",
      "intake",
      "lead",
      "management",
      "positive",
      "problem",
      "proficiency",
      "sales",
      "service",
      "software",
      "solving",
      "spanishenglish",
      "teamwork",
      "time",
      "to",
      "typing",
      "word"
    ]
  },
  {
    "job_id": "3902753778",
    "job_title": "Seasonal Sales Associate",
    "category": "SALES",
    "job_description": "JOB OVERVIEW\n\nTHE CONSULTANT IS RESPONSIBLE FOR ALL ASPECTS OF THE CUSTOMER EXPERIENCE WITHIN MULTIPLE-BUSINESSES (RETAIL, RENTAL, CUSTOM, AND OMNI-CHANNEL) WITHIN A STORE LOCATION. TO BE SUCCESSFUL IN THIS ROLE THE CONSULTANT NEEDS TO SUPPORT AND POSITIVELY IMPACT A CULTURE OF CUSTOMER-OBSESSION, BY BEING CUSTOMER-READY AND DELIVERING A WORLD-CLASS EXPERIENCE EACH AND EVERY DAY. THE CONSULTANT IS EXPECTED TO ENGAGE AS A MEMBER OF A HIGH-PERFORMING TEAM THROUGH TRUST, COMMITMENT, AND A FOCUS ON RESULTS. THE CONSULTANT MUST NAVIGATE THROUGH CHANGE IN ORDER TO ADAPT TO NEW PROGRAMS IN A TIMELY MANNER AND TO ACHIEVE THE EXPECTED OUTCOME. IN ADDITION THE CONSULTANT WILL CONTRIBUTE TO A HEALTHY CULTURE BY WORKING WELL WITH AND DEMONSTRATING RESPECT FOR COLLEAGUES AT ALL LEVELS AND CONSISTENTLY CONTRIBUTE TO A POSITIVE WORK ENVIRONMENT.\n\nESSENTIAL FUNCTIONS\n\n CONSISTENTLY DEMONSTRATE THE BENCHMARK SELLING TECHNIQUES FOR RETAIL SALES, CUSTOM CLOTHING SALES, AND SPECIAL OCCASION RENTALS, AS TRAINED BY MANAGEMENT AND AS DESCRIBED IN CORPORATE TRAINING MATERIALS. CONTINUOUSLY ENCOURAGE AND PARTICIPATE IN TEAM SELLING. BUILD A RELATIONSHIP WITH YOUR CUSTOMER FROM GREETING THROUGH POST-SALE CONTACT. PARTICIPATE IN MONITORING AND POSITIVELY IMPACT THE ACHIEVEMENT OF THE STORE SALES VOLUME AND METRICS GOALS. MEET AND MAINTAIN YOUR OWN PERSONAL VOLUME GOAL WHILE MAINTAINING AN ABOVE AVERAGE QUALITY OF SALE. WHEN POSSIBLE USE TAILORS FOR ALL ALTERATION FITTINGS. WHEN TAILORS ARE NOT AVAILABLE, BE ABLE TO ACCURATELY FIT THE CUSTOMER AND PROVIDE RECOMMENDATIONS FOR ALTERATIONS. ASSIST IN RECEIVING SHIPMENTS, PUTTING AWAY NEW MERCHANDISE, MAINTAINING A CLEAN, NEAT, SIZED AND ORGANIZED STORE BASED ON OUR MERCHANDISING TO SELL STANDARDS. ASSIST WITH VISUALLY MERCHANDISING THE STORE, INCLUDING COMPLYING WITH BRAND STANDARDS WITH REGARD TO ALL VISUAL MERCHANDISING TASKS. HELP MONITOR THE SECURITY OF ALL COMPANY PROPERTY. REPORT OR DOCUMENT DAMAGED OR MISSING PRODUCT. ASSIST IN CONDUCTING MERCHANDISE STOCK COUNTS AS REQUESTED BY YOUR STORE MANAGEMENT TEAM. REPORT ANY DISCREPANCIES TO THE MANAGER ON DUTY. EFFECTIVELY PARTICIPATE AS A MEMBER OF A STORE TEAM WHERE EMPLOYEES ARE HELD ACCOUNTABLE FOR NOT ONLY INDIVIDUAL PERFORMANCE, BUT ALSO FOR INTERACTING WITH THE GREATER STORE TEAM IN MANNER THAT SUPPORTS THE ACHIEVEMENT OF ESTABLISHED TEAM GOALS. MAINTAIN A WORKPLACE FREE OF HARASSMENT AND DISCRIMINATION BY STRICTLY ADHERING TO THE COMPANY’S ANTI-DISCRIMINATION AND HARASSMENT POLICIES AND PROMPTLY REPORTING TO YOUR REGIONAL MANAGER, ZONE VICE PRESIDENT AND THE HUMAN RESOURCES DEPARTMENT ANY CONCERNS THAT MAY ARISE UNDER THOSE POLICIES.\n\nPHYSICAL REQUIREMENTS\n\n ABILITY TO STAND AND WALK FOR THE MAJORITY OF WORK SHIFT, FREQUENTLY BEND, SQUAT AND TWIST, LIFT UP TO 50 LBS., CLIMB A LADDER TO REACH MERCHANDISE AND OR SUPPLIES, AND SEE AND DISTINGUISH BETWEEN FABRIC PATTERNS AND COLORS.\n\nYOU MAY HAVE THE OPPORTUNITY TO VOLUNTARILY WORK BETWEEN MULTIPLE STORE OR SITE LOCATIONS, AND ACROSS MULTIPLE BRANDS. \n\nREASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS.\n\nOUR COMPANY CELEBRATES DIVERSITY AND PROVIDES EQUAL EMPLOYMENT OPPORTUNITY TO ALL APPLICANTS AND EMPLOYEES WITHOUT REGARD TO RACE, COLOR, SEX, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, NATIONAL ORIGIN, RELIGION, VETERAN OR MILITARY STATUS, AGE, PHYSICAL OR MENTAL DISABILITY, MARITAL STATUS, OR ANY OTHER PROTECTED STATUS UNDER THE LAW.\n\nWORK LOCATIONS: 04216 LANSING, MI 5340 W SAGINAW HWY LANSING 48917\n\nJOB: SALES\n\nORGANIZATION: MEN'S WEARHOUSE\n\nSHIFT: VARIABLE\n\nZONE: MIDWEST",
    "job_skill_set": [
      "retail sales",
      "customer service",
      "visual merchandising",
      "sales metrics analysis",
      "inventory management",
      "team selling",
      "product knowledge",
      "teamwork",
      "communication",
      "adaptability",
      "problem solving",
      "customer relationship building",
      "respectfulness",
      "accountability",
      "positive attitude",
      "alteration fitting"
    ],
    "short_keywords": [
      "accountability",
      "adaptability",
      "alteration",
      "analysis",
      "associate",
      "attitude",
      "building",
      "communication",
      "customer",
      "fitting",
      "inventory",
      "knowledge",
      "management",
      "merchandising",
      "metrics",
      "positive",
      "problem",
      "product",
      "relationship",
      "respectfulness",
      "retail",
      "sales",
      "seasonal",
      "selling",
      "service",
      "solving",
      "team",
      "teamwork",
      "visual"
    ]
  },
  {
    "job_id": "3902740269",
    "job_title": "Sales Coordinator - Westminster, CO",
    "category": "SALES",
    "job_description": "THE SALES COORDINATOR OFFERS RELIABLE SUPPORT AND COLLABORATION FOR 3-4 DIFFERENT SALES REPRESENTATIVES WITHIN AN ASSIGNED TERRITORY AND HELPS IMPROVE EFFICIENCY OF THE TERRITORY AS SALES VOLUMES INCREASE. THIS INDIVIDUAL WILL ASSIST IN ANALYZING AND RESOLVING PROBLEMS THAT MAY ARISE WITHIN THE TERRITORY WITH CUSTOMERS AND SALES REPS. THE PRIMARY FOCUS WILL BE ON THE TRANSPORT AUTOMATION (PNEUMATIC TUBING SYSTEMS) SIDE OF OUR BUSINESS, BUT THIS ROLE MAY ALSO ASSIST IN SUPPORTING OUR MEDICATION MANAGEMENT BUSINESS WHEN NEEDED.\n\nWHILE YOUR PRIMARY FUNCTION IS TO PROVIDE GENERAL SALES ADMINISTRATIVE SUPPORT. YOU WILL ALSO BE RESPONSIBLE FOR CERTAIN TASKS RELATED TO CRM ADMINISTRATION & ERP SUPPORT.\n\nTHIS IS A HYBRID ROLE, NOT A REMOTE POSITION. OUR OFFICE IS LOCATED IN WESTMINSTER, COLORADO.\n\nYOUR COLLABORATION\n\nVALIDATE BID REQUESTS THAT COME IN THROUGH PHONE/FAX OR EMAIL, THEN CONVERT EACH REQUEST INTO AN OPPORTUNITY IN SALESFORCE & ASSIGN TO THE CORRECT SALES REP.UPDATE AND/OR CREATE OPPORTUNITIES IN SALESFORCE FOR THE REPS IN YOUR TERRITORY SPECIFIC TO NEW AND RENEWAL OPPORTUNITIES. RESPONSIBLE FOR BID DOCUMENTATION PROCESS FOR CONSTRUCTION TO KEEP PROCESS ON TRACK:AFTER INITIAL DOWNLOAD, FOLLOW UP ON BID PROPOSALS AND CHANGES FOR PROJECTS AND MAINTAIN THOSE IN OUR INTERNAL FILES.CHECK ALL ADDENDUMS SENT BY GC TO SEE IF CHANGES AFFECT PTS WORK AND NOTIFY THE APPS AND SALES TEAMS.RUN TUBE TOOLS TO OBTAIN CUSTOMER CONFIGURATION FILES AND FILE IN SALESFORCE.ENSURE THAT YOUR TERRITORY SALES TEAM CALENDAR IS UP TO DATE WITH BID DUE DATES AND BID DOCUMENTATION.ENSURE THAT INSURANCE REQUIREMENTS ARE MET AND CONTRACTS REVIEWED WITH THE LEGAL DEPARTMENT WITHIN THE APPROPRIATE TIME FRAME.ASSIST IN PREPARING SYSTEM DESIGN ANALYSIS REVIEW BINDERS FOR THE CONSTRUCTION REPS IN YOUR TERRITORY WHEN NEEDED.COLLABORATE WITH OUTSIDE REPS AND INTERNAL APPLICATION ENGINEERS TO ENSURE THAT ALL PROPOSAL DOCUMENTS ARE LEGALLY VALID AND MEET ALL SIGNATORY OBLIGATIONS PRIOR TO SUBMITTING. ENSURE THE TEAM IS ON TRACK WITH BID ADDENDUMS AND SIGN-OFFS.COLLABORATE WITH SALES REPS TO PREPARE THEIR PROPOSALS AS NEEDED.SUPPORT SALES REPS AND OTHER TEAM MEMBERS IN PROCESSING MONTHLY BOOKING NOTIFICATIONS.DELIVER BEST-IN-CLASS SERVICE TO CURRENT AND FUTURE CUSTOMERS IN YOUR TERRITORY, PROMPTLY AND CLEARLY RESPONDING TO ANY QUESTIONS THEY MAY HAVE. BASED ON YOUR TERRITORY NEEDS, GENERATE REPORTS AS NEEDED FOR EXTERNAL CUSTOMERS AS WELL AS FOR INTERNAL DATA ANALYSIS. RESEARCH & OBTAIN CERTIFICATES OF NEED FOR NEW CONSTRUCTION PROJECTS ON A MONTHLY BASIS AND SUBMIT THEM AS LEADS/OPPORTUNITIES IN SALESFORCE.ASSIST CONSTRUCTION REPS WITH PROJECT MAILINGS ASSOCIATED WITH AIA CONFERENCES.PROVIDE MISCELLANEOUS INTERDEPARTMENTAL SUPPORT AS NEEDED. COLLABORATE WITH THE SALES ENABLEMENT TEAM TO SUPPORT THE ONBOARDING PROCESS FOR ANY NEW OUTSIDE REPS STARTING WITH SWISSLOG.RESPONSIBLE FOR DATA INPUT, DATA INTEGRITY AND MAINTENANCE IN OUR CRM PLATFORM.COLLABORATE WITH THE REPS IN YOUR TERRITORY TO HELP UPDATE THEIR PROPOSALS, AND ENSURE THAT ALL SUPPORTING DOCUMENTATION IS INCLUDED WHERE NEEDED.RUN REPORTS FOR YOUR SALES REPS TO HELP THEM MANAGE LEADS/OPPORTUNITIES AS WELL AS ACCOUNT SPEND ANALYSIS.NAVIGATE QUICKLY THROUGH OUR DATABASE TO LOOK UP CONTRACTS AND ACCOUNT INFORMATION AS NEEDED.PERFORM OTHER DUTIES AS ASSIGNED.\n\nYOUR COMPETENCE\n\nHIGH SCHOOL DIPLOMA OR ASSOCIATES DEGREE.0-3 YEARS EXPERIENCE IN A SALES SUPPORT ROLE.PROFICIENT IN MICROSOFT OFFICE (WORD, POWERPOINT, EXCEL).EXPERIENCE IN SAP & SALESFORCE.COM OR SIMILAR CRM SYSTEM.ABILITY TO UTILIZE INTERNET SEARCH AND REPORTING FUNCTIONS.STRONG ORGANIZATIONAL AND TIME MANAGEMENT SKILLS.PROFESSIONAL DEMEANOR AND EXCEPTIONAL INTERPERSONAL COMMUNICATION SKILLS, BOTH WRITTEN AND VERBAL.ABILITY TO LISTEN CAREFULLY TO CUSTOMERS AND TEAM MEMBERS TO UNDERSTAND THEIR NEEDS AND CONCERNS IN ORDER TO RESOLVE ISSUES AS EFFICIENTLY AND EFFECTIVELY AS POSSIBLE.SELF-MOTIVATED, GOAL-ORIENTED AND CURIOUS, WITH A DESIRE TO LEARN.ABILITY TO WORK INDEPENDENTLY WHILE IN A FAST-PACED, HIGH-ENERGY AND FUN TEAM ENVIRONMENT.\n\nDESIRABLE, BUT NOT ESSENTIAL:\n\nBACHELORS DEGREE.\n\nCOMPENSATION: SALARY RANGE FOR THIS POSITION IS $51,200 - 57,000, DEPENDING ON EXPERIENCE AND SKILLSET. COMPREHENSIVE BENEFITS PACKAGE INCLUDING MEDICAL/DENTAL/VISION INSURANCE; TUITION REIMBURSEMENT, DISABILITY, 401K MATCHING (UP TO 8%).\n\nCLARITY ON YOUR PATH\n\nAT SWISSLOG HEALTHCARE, WE ARE CONSTANTLY LOOKING FOR PEOPLE WHO SHAPE AND DEVELOP OUR COMPANY. WE OFFER EXCITING OPPORTUNITIES TO LEARN, DEVELOP AND LEAD CHANGE. YOU BENEFIT FROM CLEAR COMMUNICATION AND DEVELOPMENT PLANS THAT ARE ALIGNED WITH YOUR PERSONAL STRENGTHS AND OUR COMMON GOALS. ENJOY MANY OTHER BENEFITS THAT WE ARE CONSTANTLY REVIEWING AND EXPANDING.\n\nDIVERSITY & INCLUSION\n\nLATEST TECHNOLOGY\n\nGROW WITH US!\n\nOUR COMMITMENT\n\nWE USE AUTOMATION TO MAKE A DIFFERENCE IN HOSPITALS AND HEALTHCARE FACILITIES. 1,200 DEDICATED EMPLOYEES IN MORE THAN 3,500 FACILITIES AROUND THE WORLD ARE ALREADY RELIEVING THE BURDEN ON STAFF AND GIVING THEM MORE TIME FOR PATIENT CARE ACTIVITIES. WITH THE LATEST TECHNOLOGIES IN THE FIELD OF MEDICATION MANAGEMENT, WE ARE TAKING RESPONSIBILITY FOR SHAPING TOMORROW'S HEALTHCARE SYSTEM TO IMPROVE PATIENT CARE AND INCREASE MEDICATION SAFETY.\n\nEQUAL OPPORTUNITY EMPLOYERSWISSLOG HEALTHCARE IS AN EQUAL OPPORTUNITY EMPLOYER, ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO AGE, RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, VETERAN STATUS, STATUS AS A PROTECTED VETERAN, OR ANY OTHER APPLICABLE STATUS PROTECTED BY FEDERAL, STATE OR LOCAL LAW.\n\nSWISSLOG’S FMLA POLICY CAN BE FOUND AT:\n\nHTTP://WWW.DOL.GOV/WHD/REGS/COMPLIANCE/POSTERS/FMLAEN.PDF\n\nFEDERAL LAW REQUIRES EMPLOYERS TO PROVIDE REASONABLE ACCOMMODATION TO QUALIFIED INDIVIDUALS WITH DISABILITIES. IF YOU REQUIRE REASONABLE ACCOMMODATION TO COMPLETE THE APPLICATION OR TO PERFORM YOUR JOB, PLEASE CONTACT HUMAN RESOURCES AT JOBS.HEALTHCARE.US@SWISSLOG-HEALTHCARE.COM .",
    "job_skill_set": [
      "Microsoft Office",
      "Communication",
      "Teamwork",
      "Problem solving",
      "Organizational skills",
      "Self-motivated",
      "Goal-oriented",
      "Interpersonal skills",
      "Adaptability",
      "Salesforce",
      "CRM administration",
      "ERP support",
      "SAP",
      "Data input",
      "Data integrity",
      "Reporting functions",
      "Pneumatic tubing systems",
      "Time management",
      "Listening skills"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "co",
      "communication",
      "coordinator",
      "crm",
      "data",
      "erp",
      "functions",
      "goaloriented",
      "input",
      "integrity",
      "interpersonal",
      "listening",
      "management",
      "microsoft",
      "office",
      "organizational",
      "pneumatic",
      "problem",
      "reporting",
      "sales",
      "salesforce",
      "sap",
      "selfmotivated",
      "skills",
      "solving",
      "support",
      "systems",
      "teamwork",
      "time",
      "tubing",
      "westminster"
    ]
  },
  {
    "job_id": "3906257320",
    "job_title": "Store Sales Manager",
    "category": "SALES",
    "job_description": "IS YOUR CURRENT JOB A NIGHTMARE? MAKE IT A DREAM JOB AT MATTRESS FIRM®! \n\nJOIN MATTRESS FIRM® AS A STORE SALES MANAGER AND HAVE THE JOB OF YOUR DREAMS! \n\nDOES LEADING BY EXAMPLE AND DEVELOPING YOUR TEAM IN A RETAIL SALES ENVIRONMENT EXCITE YOU? DO YOU WANT TO WORK WITH HAPPY, INSPIRED EMPLOYEES, WHERE PEOPLE LOVE TO COME TO WORK AND ALWAYS WAKE UP ON THE RIGHT SIDE OF THE BED? ALL WHILE HELPING CUSTOMERS SLEEP WELL TO LIVE WELL? THEN TAKE YOUR CAREER TO THE NEXT LEVEL AND APPLY FOR THE MATTRESS FIRM STORE SALES MANAGER!\n\nTHIS COMMISSION-DRIVEN SALES ROLE WILL PROVIDE YOU WITH EVERYTHING YOU NEED TO THRIVE AT MATTRESS FIRM. THIS POSITION IS ELIGIBLE TO RECEIVE BONUS PAY.\n\nBILINGUAL PREFERRED – SPANISH.\n\nBENEFITS INCLUDE\n\nEXCELLENT CAREER GROWTH OPPORTUNITIES THROUGH ON-THE-JOB TRAINING AND DEVELOPMENT PROGRAMS\n\n401(K) WITH EMPLOYER MATCHING\n\nMENTAL HEALTH AND LIFE RESOURCES\n\nMEDICAL, DENTAL, PRESCRIPTION AND VISION PLANS\n\nGET PAID ON-DEMAND\n\nBASE PAY OR UNCAPPED COMMISSION\n\nEMPLOYEE DISCOUNTS ON MATTRESS FIRM SLEEP PRODUCTS AND ACCESSORIES\n\nADDITIONAL PERKS MAY INCLUDE DISCOUNTS ON THE FOLLOWING\n\nCELL PHONE PRODUCTS AND SERVICES\n\nTICKETS TO EVENTS AND ATTRACTIONS\n\nPERSONAL TRAVEL\n\nELECTRONICS AND APPLIANCE PURCHASES\n\nPET INSURANCE PLANS\n\nMORTGAGE LOAN RATES\n\nJOB DETAILS\n\nTHE STORE MANAGER LEADS THE MATTRESS FIRM VISION, COMPANY INITIATIVES AND ACHIEVES SALES PERFORMANCE GOALS BY HOLDING ASSOCIATES ACCOUNTABLE FOR THE EXECUTION OF IN-STORE MERCHANDISING IN MULTIPLE STORE UNITS. THE ROLE IS RESPONSIBLE FOR LEADING SELLING PROGRAMS, DRIVING RELATED KPI RESULTS IN MULTIPLE STORE UNITS AND SUPPORTING THE OMNI-CHANNEL EXPERIENCE. THE STORE MANAGER ENSURES TEAMS ALWAYS PUT THE CUSTOMER AT THE CENTER AND CREATE A COMPELLING AND ENGAGING ENVIRONMENT FOR MATTRESS FIRM TEAM MEMBERS.\n\nDRIVE INDIVIDUAL AND TEAM SALES PERFORMANCE AND KPIS. TRAIN AND COACH STORE EMPLOYEES IN SALES, PRODUCT KNOWLEDGE AND OPERATING ACTIVITIES, PROVIDING CONSTRUCTIVE FEEDBACK; ANNUAL PERFORMANCE REVIEWS AND INDIVIDUAL DEVELOPMENT PLANS. CREATE AN ENVIRONMENT WHERE CUSTOMERS ARE ALWAYS AT THE CENTER AND HAVE AN EXCEPTIONAL EXPERIENCE. COMMUNICATE PROFESSIONALLY AND REGULARLY WITH FIELD EMPLOYEES (DISTRIBUTION CENTER, DISTRICT MANAGER, REGIONAL VP, ETC.) TO ADDRESS IMMEDIATE CONCERNS AND QUESTIONS. ASSIST IN MULTI-STORE STAFFING, INTERVIEWING, AND HIRING QUALIFIED CANDIDATES. CONTINUE TO DEVELOP SKILLS, COMPETENCIES, PRODUCT KNOWLEDGE THROUGH ASSIGNED COURSE WORK, TRAINING, AND OTHER COMPANY LED ACTIVITIES. CONDUCT WORKFORCE MANAGEMENT ACTIVITIES (STORE STAFFING SCHEDULE, RECONCILING PUNCHES ETC.), UTILIZING OPERATIONS TEAM SUPPORT AND TOOLS. ACHIEVE OR EXCEED INDIVIDUAL STORE FINANCIAL TARGETS THROUGH EFFECTIVE EXECUTION AND CUSTOMER SERVICE AT THE STORE LEVEL. ENSURE STORE EXECUTION OF PRODUCT MERCHANDISING, MARKETING, AND POP STANDARDS. ENSURE COMPANY POLICIES, INCLUDING APPEARANCE AND FUNCTIONALITY STANDARDS, AND STATE REGULATIONS ARE FOLLOWED. PARTNER WITH MARKETING TO PLAN, IMPLEMENT AND MONITOR ASSIGNED STORE’S SOCIAL MEDIA STRATEGY TO POSITIVELY IMPACT BRAND AWARENESS AND INCREASE SALES. \n\nMATTRESS FIRM \n\nWE’RE NO ORDINARY MATTRESS COMPANY. IN JUST OVER 30 YEARS, MATTRESS FIRM IS AMERICA’S MOST TRUSTED AUTHORITY ON SLEEP. WITH MORE THAN 2,400 STORES NATIONWIDE AND A TEAM OF MORE THAN 6,000 SLEEP EXPERTS, WE HAVE HELPED MILLIONS OF PEOPLE GET BETTER SLEEP. THAT’S WHO WE ARE AND WHAT WE DO—BECAUSE EVERYONE DESERVES A GREAT NIGHT’S SLEEP.\n\nMATTRESS FIRM TAKES PRIDE IN OUR PURPOSE OF HELPING PEOPLE SLEEP WELL TO LIVE WELL, AND WE DEEPLY INVEST IN EVERY NEW SALES ASSOCIATE COMING ON BOARD TO LIVE UP TO THAT PROMISE. OUR AWARD-WINNING TALENT DEVELOPMENT PROGRAMS INCLUDE AN EDUCATION PATH DESIGNED TO SUPPORT ALL NEW SALES ASSOCIATES' LEARNING PROFICIENCY FOR SPECIALTY RETAIL. NOT ONLY DO WE INVEST IN TRAINING, BUT ALL NEW SALES ASSOCIATES ARE ELIGIBLE FOR A PERFORMANCE-BASED BONUS AFTER THEIR SIXTH MONTH OF EMPLOYMENT.\n\nDIVERSE CANDIDATES ARE ENCOURAGED TO APPLY \n\nMATTRESS FIRM IS AN EQUAL EMPLOYMENT OPPORTUNITY EMPLOYER AND IS COMMITTED TO MAINTAINING A NON-DISCRIMINATORY WORK ENVIRONMENT AND DOES NOT DISCRIMINATE AGAINST ANY APPLICANT OR EMPLOYEE FOR EMPLOYMENT ON THE BASIS OF RACE, COLOR, RELIGION, SEX, NATIONAL ORIGIN, AGE, DISABILITY, VETERAN STATUS, MARITAL STATUS, SEXUAL ORIENTATION, GENDER IDENTITY, OR ANY OTHER CHARACTERISTIC PROTECTED BY APPLICABLE LAW. MATTRESS FIRM IS COMMITTED TO CREATING A DYNAMIC WORK ENVIRONMENT THAT VALUES DIVERSITY AND INCLUSION, RESPECT AND INTEGRITY, CUSTOMER FOCUS, AND INNOVATION.\n\nPAY RANGE\n\n72,000 TO 98,000\n\nNOW DON’T FALL ASLEEP OUT THERE… THE SOONER THAT WE RECEIVE YOUR APPLICATION, THE CLOSER YOU ARE TO THE CAREER OF YOUR DREAMS!\n\nDIVERSE CANDIDATES ARE ENCOURAGED TO APPLY\n\nMATTRESS FIRM IS AN EQUAL EMPLOYMENT OPPORTUNITY EMPLOYER AND IS COMMITTED TO MAINTAINING A NON-DISCRIMINATORY WORK ENVIRONMENT, AND DOES NOT DISCRIMINATE AGAINST ANY APPLICANT OR EMPLOYEE FOR EMPLOYMENT ON THE BASIS OF RACE, COLOR, RELIGION, SEX, NATIONAL ORIGIN, AGE, DISABILITY, VETERAN STATUS, MARITAL STATUS, SEXUAL ORIENTATION, GENDER IDENTITY, OR ANY OTHER CHARACTERISTIC PROTECTED BY APPLICABLE LAW. MATTRESS FIRM IS COMMITTED TO CREATING A DYNAMIC WORK ENVIRONMENT THAT VALUES DIVERSITY AND INCLUSION, RESPECT AND INTEGRITY, CUSTOMER FOCUS, AND INNOVATION.",
    "job_skill_set": [
      "customer service",
      "team leadership",
      "product knowledge",
      "merchandising",
      "training and development",
      "workforce management",
      "communication",
      "problem solving",
      "teamwork",
      "adaptability",
      "motivation",
      "leadership",
      "customer focus",
      "constructive feedback",
      "interpersonal skills",
      "time management",
      "sales management",
      "KPI management",
      "social media strategy",
      "bilingual (Spanish)"
    ],
    "short_keywords": [
      "adaptability",
      "and",
      "bilingual",
      "communication",
      "constructive",
      "customer",
      "development",
      "feedback",
      "focus",
      "interpersonal",
      "knowledge",
      "kpi",
      "leadership",
      "management",
      "manager",
      "media",
      "merchandising",
      "motivation",
      "problem",
      "product",
      "sales",
      "service",
      "skills",
      "social",
      "solving",
      "spanish",
      "store",
      "strategy",
      "team",
      "teamwork",
      "time",
      "training",
      "workforce"
    ]
  },
  {
    "job_id": "3905296768",
    "job_title": "Retail Part-Time Sales Advisor - Savage X Fenty (Cross County Center - Yonkers, NY)",
    "category": "SALES",
    "job_description": "JOB DESCRIPTION\n\nSAVAGE X FENTY IS CURRENTLY LOOKING FOR A DRIVEN AND PASSIONATE RETAIL SALES ADVISOR AT CROSS COUNTY CENTER - YONKERS, NY!\n\nHOW DO YOU FIT IN?\n\nAS A RETAIL SALES ADVISOR YOU ARE TASKED WITH DELIVERING A BEST-IN-CLASS SERVICE EXPERIENCE IN OUR FIRST IRL LOCATIONS! IN SUPPORTING OUR RETAIL STORES YOU WILL MAKE A DIRECT IMPACT IN CREATING A FEARLESS, CONFIDENT AND INCLUSIVE ENVIRONMENT FOR OUR SAVAGE X FENTY CUSTOMERS. YOU ARE PASSIONATE ABOUT FORMING GENUINE CONNECTIONS AND ENGAGING WITH A DIVERSE ARRAY OF CUSTOMERS AND TEAMMATES. YOU WILL BE INTEGRAL IN HELPING TO BUILD A FORWARD-THINKING AND INNOVATIVE RETAIL EXPERIENCE FOR BOTH THE STORE TEAM AND THE SAVAGE X FENTY CUSTOMER. INTERESTED? YOUR FUTURE IS SAVAGE!\n\nRESPONSIBILITIES\n\nELEVATE THE SERVICE EXPERIENCE BY EMBODYING OUR VALUES AND BRAND ETHOS RESULTING IN A CULTURE THAT IS WELCOMING TO A DIVERSE ARRAY OF CUSTOMERS.ACTIVELY ENGAGE OUR GUESTS AND VIP MEMBERS BY PROVIDING AN EXPERIENCE CENTERED AROUND BODY POSITIVITY, PRODUCT KNOWLEDGE AND AUTHENTICITY.STAY WELL INFORMED AND KNOWLEDGEABLE ON XTRA VIP MEMBERSHIP MODEL, PROMOTIONS AND BENEFITS.COLLABORATE WITH STORE LEADERS AND SALES TEAM TO SUCCESSFULLY ACHIEVE STORE PERFORMANCE TARGETS.MAINTAIN VISUAL MERCHANDISING STANDARDS TO SUPPORT A STREAMLINED CUSTOMER JOURNEY.ENGAGE IN PROVIDING STORE LEADERSHIP TEAM WITH FEEDBACK TO CONTINUOUSLY IMPROVE THE CUSTOMER\n\nAND TEAM EXPERIENCE.\n\nSUPPORT INVENTORY CONTROLS BY ACCURATELY RECEIVING/TRANSFERRING PRODUCT, JOINING INVENTORY\n\nCOUNTS AND MAINTAINING AN ORGANIZED BACK OF HOUSE.\n\nSTRIVE FOR EXCELLENCE BY ACTIVELY IMPROVING UPON DAY-TO-DAY CUSTOMER SERVICE, VISUAL\n\nMERCHANDISING, AND OPERATIONAL STANDARDS.\n\nMEET AND EXCEED INDIVIDUAL PERFORMANCE GOALS.\n\nREQUIRED SKILLS\n\nEXPERIENCE: 1-2 YEARS IN CUSTOMER FACING ROLE WITH A FOCUS ON LINGERIE AND INTIMATES A PLUS.APPROACH AMBIGUITY AND CHALLENGES WITH POSITIVITY AND A GROWTH MINDSET.EXCELLENT INTERPERSONAL COMMUNICATION SKILLS.TECH-SAVVY OR STRONG COMFORT AROUND TECHNOLOGY AS COMPONENT OF DAILY RESPONSIBILITIES.FLEXIBILITY WITH YOUR SCHEDULE. YOUR WORK HOURS WILL BE BASED ON BUSINESS NEEDS.SELF-DIRECTED AND HIGHLY MOTIVATED TO TAKE OWNERSHIP OF TASKS TO ENSURE SOLUTIONS.ABILITY TO WORK IN TEAM SELLING ENVIRONMENT.THIS POSITION INVOLVES CONSTANT MOVING, TALKING, HEARING, REACHING, GRABBING AND STANDING FOR AT\n\nLEAST TWO CONSECUTIVE HOURS. MAY OCCASIONALLY INVOLVE STOOPING, KNEELING, CROUCHING AND\n\nCLIMBING LADDERS.\n\nFLEXIBILITY WITH YOUR SCHEDULE. OPEN TO WORKING EVENINGS, WEEKENDS AND HOLIDAYS. YOUR WORK\n\nHOURS WILL BE BASED ON BUSINESS NEEDS.\n\nSAVAGE X INC. IS AN EQUAL OPPORTUNITY EMPLOYER. WE RECRUIT, EMPLOY, COMPENSATE, DEVELOP, AND PROMOTE REGARDLESS OF RACE, NATIONAL ORIGIN, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, AGE, DISABILITY, GENETIC INFORMATION, VETERAN STATUS, AND OTHER PROTECTED STATUS AS REQUIRED BY APPLICABLE. AT SAVAGE X INC., WE CHAMPION A VIBRANT WORKPLACE CULTURE THAT THRIVES ON DIVERSITY LAW AND DO NOT TOLERATE DISCRIMINATION OR HARASSMENT. WE ARE ONE TEAM FROM MANY BACKGROUNDS, INNOVATING THROUGH DIVERSITY OF INDIVIDUALS, WHO ARE DRIVEN BY PASSION FOR CREATING AN INCLUSIVE SPACE FOR ALL. SAVAGE X INC. WILL CONTINUE TO CHAMPION A WORKPLACE CULTURE THAT PRIZES DIVERSITY AND INCLUSIVITY.\n\nWE ENCOURAGE YOU TO APPLY REGARDLESS OF MEETING ALL QUALIFICATIONS AND/OR REQUIREMENTS.\n\nSAVAGE X INC. IS AN EQUAL OPPORTUNITY EMPLOYER. WE RECRUIT, EMPLOY, COMPENSATE, DEVELOP, AND PROMOTE REGARDLESS OF RACE, NATIONAL ORIGIN, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, AGE, DISABILITY, GENETIC INFORMATION, VETERAN STATUS, AND OTHER PROTECTED STATUS AS REQUIRED BY APPLICABLE. AT SAVAGE X INC., WE CHAMPION A VIBRANT WORKPLACE CULTURE THAT THRIVES ON DIVERSITY LAW AND DO NOT TOLERATE DISCRIMINATION OR HARASSMENT. WE ARE ONE TEAM FROM MANY BACKGROUNDS, INNOVATING THROUGH DIVERSITY OF INDIVIDUALS, WHO ARE DRIVEN BY PASSION FOR CREATING AN INCLUSIVE SPACE FOR ALL. SAVAGE X INC. WILL CONTINUE TO CHAMPION A WORKPLACE CULTURE THAT PRIZES DIVERSITY AND INCLUSIVITY.\n\nWE ENCOURAGE YOU TO APPLY REGARDLESS OF MEETING ALL QUALIFICATIONS AND/OR REQUIREMENTS.",
    "job_skill_set": [
      "customer service",
      "product knowledge",
      "technology proficiency",
      "interpersonal communication",
      "teamwork",
      "flexibility",
      "self-motivation",
      "problem solving",
      "visual merchandising",
      "inventory management",
      "growth mindset"
    ],
    "short_keywords": [
      "advisor",
      "center",
      "communication",
      "county",
      "cross",
      "customer",
      "fenty",
      "flexibility",
      "growth",
      "interpersonal",
      "inventory",
      "knowledge",
      "management",
      "merchandising",
      "mindset",
      "ny",
      "parttime",
      "problem",
      "product",
      "proficiency",
      "retail",
      "sales",
      "savage",
      "selfmotivation",
      "service",
      "solving",
      "teamwork",
      "technology",
      "visual",
      "x",
      "yonkers"
    ]
  },
  {
    "job_id": "3905334744",
    "job_title": "Sales Associate",
    "category": "SALES",
    "job_description": "OVERVIEW\n\nABOUT EXPRESS, INC.\n\nEXPRESS, INC. IS A MULTI-BRAND FASHION RETAILER WHOSE PORTFOLIO INCLUDES EXPRESS, BONOBOS AND UPWEST. THE COMPANY OPERATES AN OMNICHANNEL PLATFORM AS WELL AS PHYSICAL AND ONLINE STORES. GROUNDED IN A BELIEF THAT STYLE, QUALITY AND VALUE SHOULD ALL BE FOUND IN ONE PLACE, EXPRESS IS A BRAND WITH A PURPOSE - WE CREATE CONFIDENCE. WE INSPIRE SELF-EXPRESSION. - POWERED BY A STYLING COMMUNITY. BONOBOS IS A MENSWEAR BRAND KNOWN FOR EXCEPTIONAL FIT AND AN INNOVATIVE RETAIL MODEL. UPWEST IS AN APPAREL, ACCESSORIES AND HOME GOODS BRAND WITH A PURPOSE TO PROVIDE COMFORT FOR PEOPLE & PLANET.\n\nTHE COMPANY HAS OVER 530 EXPRESS RETAIL AND EXPRESS FACTORY OUTLET STORES IN THE UNITED STATES AND PUERTO RICO, THE EXPRESS.COM ONLINE STORE AND THE EXPRESS MOBILE APP; OVER 60 BONOBOS GUIDESHOP LOCATIONS AND THE BONOBOS.COM ONLINE STORE; AND 13 UPWEST RETAIL STORES AND THE UPWEST.COM ONLINE STORE. EXPRESS, INC. IS TRADED ON THE NYSE UNDER THE SYMBOL EXPR. FOR MORE INFORMATION ABOUT OUR COMPANY, PLEASE VIS IT WWW.EXPRESS.COM/INVESTOR AND FOR MORE INFORMATION ABOUT OUR BRANDS, PLEASE VISIT WWW.EXPRESS.COM , WWW.BONOBOS.COM OR WWW.UPWEST.COM .\n\n STORE NAME \n\nBAY TERRACE\n\nRESPONSIBILITIES\n\n EXPRESS IS SEEKING A RETAIL SALES ASSOCIATE TO JOIN OUR TEAM . \n\nTHE SALES ASSOCIATE IS RESPONSIBLE FOR P ROVIDING A GREAT IN-STORE SHOPPING EXPERIENCE FOR OUR RETAIL CUSTOMERS W HILE ASSI STIN G WITH ADDIT IONA L TASKS SUCH AS STOCKING, CLEANING, FOLDING MERCHANDISE, ETC.\n\n \n\nKEY RESPONSIBILITIES\n\n MAINTAIN A CLEAN AND ORGANIZED SALES FLOOR, CHECKOUT, FITTING ROOM, AND STOCK ROOM TO ENSURE THE STORE IS SAFE AND INVITING TO CUSTOMERS.  FOLLOW COMPANY POLICIES AND PROCEDURES TO ENSURE THE SAFETY OF ALL OUR ASSOCIATES AND CUSTOMERS.  ASSIST WITH PRODUCT LAUNCH CHANGES ACCORDING TO COMPANY SOP.  PROVIDE A GREAT CUSTOMER EXPERIENCE  DELIVER ON ALL ASPECTS OF THE CUSTOMER EXPERIENCE MODEL.  PROCESS TRANSACTIONS QUICKLY AND ACCURATELY REDUCING THE CUSTOMERS WAIT TIME.  POSITIVELY RESOLVE CUSTOMER SERVICE-RELATED ISSUES AS THEY ARISE AND DETERMINE RESOLUTION OR ESCALATE FURTHER - COMMUNICATE ALLISSUES AND RESOLUTIONS TO STORE MANAGEMENT.  DRIVE CREDIT AND LOYALTY MEMBER PROGRAMS BY EXPLAINING BENEFITS AND ENCOURAGING CUSTOMERS TO PARTICIPATE.  OTHER ESSENTIAL FUNCTIONS MAY OCCUR AS DIRECTED BY YOUR SUPERVISOR. \n\nREQUIRED EXPERIENCE & QUALIFICATIONS\n\n EDUCATION: HIGH SCHOOL OR EQUIVALENT  YEARS OF EXPERIENCE: 0-2 OF RELEVANT JOB EXPERIENCE - MINIMUM 6 MONTHS  PROFICIENT IN USE OF TECHNOLOGY (IPAD, REGISTERS)  MEETS DEFINED AVAILABILITY CRITERIA, INCLUDING NIGHTS, WEEKENDS AND NON-BUSINESS HOURS  MEETS PHYSICAL REQUIREMENTS \n\nCRITICAL SKILLS & ATTRIBUTES\n\n PREVIOUS RETAIL EXPERIENCE PREFERRED  CUSTOMER SERVICE SKILLS AND ABILITY TO INTERACT WITH CUSTOMERS  STRONG VERBAL AND WRITTEN COMMUNICATION SKILLS SPECIFICALLY WITH CUSTOMERS, SALES LEADERSHIP TEAM AND ASSOCIATES  DEMONSTRATED COLLABORATIVE SKILLS AND ABILITY TO WORK WELL WITHIN A TEAM \n\nBENEFITS AND COMPENSATION\n\nEXPRESS, INC. OFFERS A RANGE OF BENEFITS TO HELP PROTECT FULL-TIME ASSOCIATE'S HEALTH AND LONG-TERM FINANCIAL SECURITY INCLUDING:\n\n MEDICAL, PHARMACY, DENTAL AND VISION COVERAGE  401(K) AND ROTH 401(K) WITH COMPANY MATCH  MERCHANDISE DISCOUNT  PAID TIME OFF  PARENTAL LEAVE FOR NEW MOMS AND DADS \n\nPART-TIME ASSOCIATES MAY BE ELIGIBLE TO RECEIVE PAID SICK LEAVE, PUBLIC HEALTH EMERGENCY LEAVE AND TO PARTICIPATE IN THE 401(K) AND ROTH 401(K) WITH COMPANY MATCH.\n\nADDITIONALLY, PART-TIME ASSOCIATES ARE ELIGIBLE TO RECEIVE AN EXPRESS MERCHANDISE DISCOUNT, TO PARTICIPATE IN OUR LEARN & EARN INCENTIVE PROGRAM, AND TO CHOOSE VOLUNTARY BENEFITS THROUGH YOUDECIDE .\n\n SALARY RANGE \n\n$24.00 - $34.40\n\n CLOSING \n\nIF YOU WOULD LIKE TO KNOW MORE ABOUT THE CALIFORNIA CONSUMER PRIVACY ACT CLICK HERE.\n\nAN EQUAL OPPORTUNITY EMPLOYER, EXPRESS, INC. DOES NOT DISCRIMINATE IN RECRUITING, HIRING OR ANY OTHER TERMS AND CONDITIONS OF EMPLOYMENT HIRING ON THE BASIS OF ANY FEDERAL, STATE, OR LOCALLY PROTECTED CHARACTERISTIC. EXPRESS, INC. ONLY HIRES INDIVIDUALS AUTHORIZED FOR EMPLOYMENT IN THE UNITED STATES. EXPRESS, INC. IS COMMITTED TO PROVIDING REASONABLE ACCOMMODATION TO INDIVIDUALS WITH DISABILITIES. IF YOU NEED AN ACCOMMODATION BECAUSE OF A DISABILITY TO SEARCH AND APPLY FOR A LISTED JOB POSITION, PLEASE CALL 1-800-964-9793 AND SAY 'ASSOCIATE RELATIONS' OR SEND AN E-MAIL TO ASSOCIATERELATIONS@EXPRESS.COM AND LET US KNOW THE NATURE OF YOUR REQUEST AND YOUR CONTACT INFORMATION.\n\n NOTIFICATION TO AGENCIES  : PLEASE NOTE THAT EXPRESS, INC. DOES NOT ACCEPT UNSOLICITED RESUMES OR CALLS FROM THIRD-PARTY RECRUITERS OR EMPLOYMENT AGENCIES. IN THE ABSENCE OF A SIGNED MASTER SERVICE AGREEMENT AND APPROVAL FROM HR TO SUBMIT RESUMES FOR A SPECIFIC REQUISITION, EXPRESS, INC. WILL NOT CONSIDER OR APPROVE PAYMENT TO ANY THIRD-PARTIES FOR HIRES MADE.",
    "job_skill_set": [
      "customer service",
      "technology proficiency",
      "retail experience",
      "communication",
      "teamwork",
      "problem solving",
      "organization",
      "transaction processing"
    ],
    "short_keywords": [
      "associate",
      "communication",
      "customer",
      "experience",
      "organization",
      "problem",
      "processing",
      "proficiency",
      "retail",
      "sales",
      "service",
      "solving",
      "teamwork",
      "technology",
      "transaction"
    ]
  },
  {
    "job_id": "3905370898",
    "job_title": "Director of Sales",
    "category": "SALES",
    "job_description": "JOB DESCRIPTION\n\nREPORT TO THE EXECUTIVE TEAM AND LEAD A TEAM OF 10+ DIRECT REPORTSMUST HAVE PRIOR LEGAL SALES AND LEADERSHIP EXPERIENCE (COURT REPORTING AND DEPOSITION SERVICES) TO MANAGE AND GROW THE BUSINESS.RESPONSIBLE FOR THE DEVELOPMENT AND PERFORMANCE OF ALL SALES ACTIVITIES IN THE ASSIGNED MARKET(S). THIS WILL INCLUDE BUDGETING AND PIPELINE MANAGEMENT.ESTABLISH PLANS AND STRATEGIES TO EXPAND THE CUSTOMER BASE IN THE ASSIGNED MARKET(S) THAT ENSURES ATTAINMENT OF COMPANY SALES GOALS AND PROFITABILITY.RESPONSIBLE FOR THE PERFORMANCE AND DEVELOPMENT OF THE ACCOUNT EXECUTIVES.PREPARE ACTION PLANS BY INDIVIDUALS AS WELL AS BY TEAM FOR EFFECTIVE SEARCH OF SALES LEADS AND PROSPECTS.CONDUCTS ONE-ON-ONE REVIEW WITH ALL ACCOUNT EXECUTIVES FOR ACCOUNTABILITYSUPPORT TEAM FOR ALL SALES AND MARKETING EFFORTS, INCLUDING COORDINATION OF TRADE SHOWS, CATERING, NETWORKING EVENTS AND SPONSORSHIPS.ASSIST EXECUTIVE TEAMS IN ROLLING OUT CONTESTS, BLITZES, PROJECTS, AND OTHER ACTIVITIES THAT HELP DRIVE THE SALES PROCESS.ADMINISTRATION OF SYSTEMS THAT SUPPORT THE SALES PROCESS (SALESFORCE.COM)\n\nQUALIFICATIONS\n\nKNOWLEDGE OF LEGAL SERVICES INDUSTRY - EXPERIENCE IN SALES AND SALES LEADERSHIP, SELLING COURT REPORTING AND DEPOSITION SERVICES TO LAW FIRMS AND INSURANCE COMPANIES.10 YEARS EXPERIENCE WITH A MINIMUM OF 4-5 YEARS IN MANAGING A SALES TEAM.RESULTS DRIVEN - ABILITY TO GROW AN EXISTING TEAM OF ACCOUNT EXECUTIVES, IN NEW BUSINESS DEVELOPMENT, AS WELL AS, ORGANIC GROWTHSTRONG EXPERTISE WITH PIPELINE MANAGEMENT AND BUDGETINGCUSTOMER SERVICE ORIENTED WITH STRONG INTERPERSONAL SKILLS; ABLE TO RESPOND PROMPTLY TO CLIENT NEEDS, FOLLOW THROUGH AND RESOLVE ISSUES IN A PLEASANT AND HELPFUL MANNER.4-YEAR COLLEGE DEGREE\n\nWHY IS THIS A GREAT OPPORTUNITY\n\nOUR CLIENT IS A DISRUPTOR OF SERVICES TOWARDS THE LEGAL & INSURANCE INDUSTRIES. FORMED OUT OF DEMAND, AND EXPANDED DURING TODAYS VIRTUALIZATION AND TECHNOLOGY, THEY ARE EXPERIENCING SIGNIFICANT GROWTH. AS A PRIVATELY HELD COMPANY WITH DEEP POCKETS THEY WANT SOMEONE WHO CAN WORK IN A VIRTUAL ENVIRONMENT WITH THE ABILITY TO TRAVEL AS NEEDED.\n\nDUE TO GROWTH, OUR CLIENT NEEDS A DIRECTOR OF SALES TO MANAGE AN EXISTING AND GROWING TEAM OF ACCOUNT EXECUTIVES. MUST CURRENTLY RESIDE IN EITHER THE EAST COAST OR CENTRAL TIME ZONE. THERE IS NO RELOCATION OFFERED. (NO EXCEPTIONS).\n\nSALARY TYPE : ANNUAL SALARY\n\nSALARY MIN : $ 140000\n\nSALARY MAX : $ 175000\n\nCURRENCY TYPE : USD",
    "job_skill_set": [
      "sales leadership",
      "budgeting",
      "customer service",
      "interpersonal skills",
      "results driven",
      "team management",
      "problem solving",
      "communication",
      "strategic planning",
      "networking",
      "legal sales",
      "pipeline management",
      "Salesforce.com",
      "court reporting",
      "deposition services"
    ],
    "short_keywords": [
      "budgeting",
      "communication",
      "court",
      "customer",
      "deposition",
      "director",
      "driven",
      "interpersonal",
      "leadership",
      "legal",
      "management",
      "networking",
      "of",
      "pipeline",
      "planning",
      "problem",
      "reporting",
      "results",
      "sales",
      "salesforcecom",
      "service",
      "services",
      "skills",
      "solving",
      "strategic",
      "team"
    ]
  },
  {
    "job_id": "3905249530",
    "job_title": "Part Time Sales Associate- CALVIN KLEIN",
    "category": "SALES",
    "job_description": "DESIGN YOUR FUTURE AT PVH\n\nPART TIME SALES ASSOCIATE- CALVIN KLEIN\n\nPOSITION SUMMARY\n\nSALES ASSOCIATES ARE BRAND AMBASSADORS RESPONSIBLE FOR CREATING AN EMOTIONAL CONNECTION BETWEEN OUR CUSTOMERS AND THE BRAND. THEY CONSISTENTLY EXCEED EXPECTATIONS, PROVIDE EXCEPTIONAL SERVICE AND DISPLAY PASSION FOR OUR BRAND. SALES ASSOCIATES ARE PART OF A TEAM FOCUSED ON DELIVERING TOP LINE SALES RESULTS.\n\nRESPONSIBILITIES\n\nCUSTOMER EXPERIENCE\n\nGREETS AND OFFERS ASSISTANCE TO EVERY CUSTOMER; FOCUSES ON CUSTOMER ENGAGEMENT AND SUGGESTIVE SELLING TO DRIVE UPT AND CONVERSION.MAINTAINS AN IN-DEPTH KNOWLEDGE OF PRODUCT AND PROMOTIONS TO HELP EXPLAIN VALUE AND BUILD BRAND LOYALTY.PRIORITIZES DELIVERING AN EXCEPTIONAL CUSTOMER EXPERIENCE AND ALWAYS PLACES OUR CUSTOMER FIRST; ASKS OUR CUSTOMERS FOR FEEDBACK AND CONVEYS BUSINESS OPPORTUNITIES TO MANAGEMENT.\n\nCOMMITMENT TO EFFICIENCY\n\nEXECUTES PROCESSING, REPLENISHMENT, CASHIERING, PROMOTIONS, AND VISUAL/MARKETING DIRECTIVES IN ALIGNMENT WITH BRAND STANDARDS.UPHOLDS BACKSTOCK ORGANIZATION AND ADHERES TO ALL COMPANY TOOLS, POLICIES AND PROCEDURES.MAINTAINS AWARENESS OF POTENTIAL THEFT AND REPORTS CONCERNS TO MANAGEMENT.\n\nASSOCIATE MORALE\n\nDEMONSTRATES A SENSE OF PRIDE, COMMITMENT, AND PASSION FOR THE BRAND AND OUR CUSTOMERS; TREATS CUSTOMERS AND STORE TEAM PROFESSIONALLY, COURTEOUSLY, AND RESPECTFULLY.CELEBRATES AND EMBRACES INDIVIDUALITY, INCLUSION AND PARTNERSHIP; BUILDS RELATIONSHIPS AND SEEKS OUT FEEDBACK FOR CONTINUOUS SELF-DEVELOPMENT.EMBRACES INNOVATION, CHANGE AND COMPANY INITIATIVES; WORKS COLLABORATIVELY TO ACCOMPLISH BRAND GOALS AND OBJECTIVES.\n\nQUALIFICATIONS\n\nPRIOR RETAIL EXPERIENCE PREFERRED.HIGH SCHOOL GRADUATE/EQUIVALENT PREFERRED.FLEXIBLE SCHEDULE REQUIRED INCLUDING NIGHTS, WEEKENDS AND OVERNIGHT SHIFTS.EXCELLENT COMMUNICATION AND TIME MANAGEMENT SKILLS.ABILITY TO WALK, STAND, BEND, REACH AND SQUAT FOR PROLONGED PERIODS, AND CARRY UP TO 2O POUNDS.\n\nPAY RANGE:$16.00 - $20.70\n\nPVH CURRENTLY PROVIDES BASE SALARY RANGES FOR ALL POSITIONS-ON JOB ADVERTISEMENTS-IN THE UNITED STATES BASED ON LOCAL REQUIREMENTS. THESE RANGES ARE BASED ON WHAT PVH REASONABLY BELIEVES THAT IT WILL PAY AN ASSOCIATE FOR THEIR BASE SALARY FOR SAID POSITION AT THE TIME OF THE POSTING. INDIVIDUAL COMPENSATION WILL ULTIMATELY BE DETERMINED BASED ON A VARIETY OF RELEVANT FACTORS INCLUDING BUT-NOT LIMITED TO QUALIFICATIONS, GEOGRAPHIC LOCATION AND OTHER RELEVANT SKILLS. PVH IS COMMITTED TO PROVIDING A MARKET-COMPETITIVE TOTAL REWARDS PACKAGE TO ELIGIBLE ASSOCIATES, WHICH INCLUDES DIVERSE AND ROBUST HEALTH AND INSURANCE BENEFITS TO MEET THE VARIED NEEDS OF OUR ASSOCIATES AND AN ABOVE-MARKET 401(K) CONTRIBUTION TO HELP OUR ASSOCIATES SAVE FOR RETIREMENT. WE ALSO OFFER CAREER GROWTH OPPORTUNITIES, EMPOWERING OUR ASSOCIATES TO DESIGN THEIR FUTURE AT PVH.\n\nPVH CORP. OR ITS SUBSIDIARY (\"PVH\") IS AN EQUAL OPPORTUNITY EMPLOYER AND CONSIDERS ALL APPLICANTS FOR EMPLOYMENT ON THE BASIS OF THEIR INDIVIDUAL CAPABILITIES AND QUALIFICATIONS, CONSISTENT WITH APPLICABLE LAW AND WITHOUT REGARD TO RACE, COLOR, SEX, GENDER IDENTITY OR EXPRESSION, AGE, RELIGION, CREED, NATIONAL ORIGIN, CITIZENSHIP STATUS, SEXUAL ORIENTATION, GENETIC INFORMATION, PHYSICAL OR MENTAL DISABILITY, MILITARY STATUS OR ANY OTHER CHARACTERISTIC PROTECTED UNDER FEDERAL, STATE OR LOCAL LAW. IN ADDITION TO COMPLYING WITH ALL APPLICABLE LAWS, PVH ALSO HAS A STRONG CORPORATE COMMITMENT TO INCLUSION, DIVERSITY AND TO ENSURING THAT ALL CURRENT AND FUTURE PVH ASSOCIATES ARE COMPENSATED SOLELY ON JOB-RELATED FACTORS SUCH AS SKILL, ABILITY, EDUCATIONAL BACKGROUND, WORK QUALITY, EXPERIENCE AND POTENTIAL. TO ACHIEVE THESE GOALS, ACROSS THE UNITED STATES AND ITS TERRITORIES, PVH PROHIBITS ANY PVH EMPLOYEE, AGENT OR REPRESENTATIVE FROM REQUESTING OR OTHERWISE CONSIDERING ANY JOB APPLICANT’S CURRENT OR PRIOR WAGES, SALARY OR OTHER COMPENSATION INFORMATION IN CONNECTION WITH THE HIRING PROCESS. ACCORDINGLY, APPLICANTS ARE ASKED NOT TO DISCLOSE THIS SALARY HISTORY INFORMATION TO PVH",
    "job_skill_set": [
      "customer service",
      "retail experience",
      "product knowledge",
      "time management",
      "sales techniques",
      "communication",
      "teamwork",
      "problem solving",
      "adaptability",
      "customer engagement",
      "feedback receptiveness",
      "professionalism",
      "passion for brand",
      "cash handling",
      "visual merchandising",
      "inventory management"
    ],
    "short_keywords": [
      "adaptability",
      "associate",
      "brand",
      "calvin",
      "cash",
      "communication",
      "customer",
      "engagement",
      "experience",
      "feedback",
      "for",
      "handling",
      "inventory",
      "klein",
      "knowledge",
      "management",
      "merchandising",
      "part",
      "passion",
      "problem",
      "product",
      "professionalism",
      "receptiveness",
      "retail",
      "sales",
      "service",
      "solving",
      "teamwork",
      "techniques",
      "time",
      "visual"
    ]
  },
  {
    "job_id": "3902753779",
    "job_title": "Seasonal Sales Associate",
    "category": "SALES",
    "job_description": "JOB OVERVIEW\n\nTHE CONSULTANT IS RESPONSIBLE FOR ALL ASPECTS OF THE CUSTOMER EXPERIENCE WITHIN MULTIPLE-BUSINESSES (RETAIL, RENTAL, CUSTOM, AND OMNI-CHANNEL) WITHIN A STORE LOCATION. TO BE SUCCESSFUL IN THIS ROLE THE CONSULTANT NEEDS TO SUPPORT AND POSITIVELY IMPACT A CULTURE OF CUSTOMER-OBSESSION, BY BEING CUSTOMER-READY AND DELIVERING A WORLD-CLASS EXPERIENCE EACH AND EVERY DAY. THE CONSULTANT IS EXPECTED TO ENGAGE AS A MEMBER OF A HIGH-PERFORMING TEAM THROUGH TRUST, COMMITMENT, AND A FOCUS ON RESULTS. THE CONSULTANT MUST NAVIGATE THROUGH CHANGE IN ORDER TO ADAPT TO NEW PROGRAMS IN A TIMELY MANNER AND TO ACHIEVE THE EXPECTED OUTCOME. IN ADDITION THE CONSULTANT WILL CONTRIBUTE TO A HEALTHY CULTURE BY WORKING WELL WITH AND DEMONSTRATING RESPECT FOR COLLEAGUES AT ALL LEVELS AND CONSISTENTLY CONTRIBUTE TO A POSITIVE WORK ENVIRONMENT.\n\nESSENTIAL FUNCTIONS\n\n CONSISTENTLY DEMONSTRATE THE BENCHMARK SELLING TECHNIQUES FOR RETAIL SALES, CUSTOM CLOTHING SALES, AND SPECIAL OCCASION RENTALS, AS TRAINED BY MANAGEMENT AND AS DESCRIBED IN CORPORATE TRAINING MATERIALS. CONTINUOUSLY ENCOURAGE AND PARTICIPATE IN TEAM SELLING. BUILD A RELATIONSHIP WITH YOUR CUSTOMER FROM GREETING THROUGH POST-SALE CONTACT. PARTICIPATE IN MONITORING AND POSITIVELY IMPACT THE ACHIEVEMENT OF THE STORE SALES VOLUME AND METRICS GOALS. MEET AND MAINTAIN YOUR OWN PERSONAL VOLUME GOAL WHILE MAINTAINING AN ABOVE AVERAGE QUALITY OF SALE. WHEN POSSIBLE USE TAILORS FOR ALL ALTERATION FITTINGS. WHEN TAILORS ARE NOT AVAILABLE, BE ABLE TO ACCURATELY FIT THE CUSTOMER AND PROVIDE RECOMMENDATIONS FOR ALTERATIONS. ASSIST IN RECEIVING SHIPMENTS, PUTTING AWAY NEW MERCHANDISE, MAINTAINING A CLEAN, NEAT, SIZED AND ORGANIZED STORE BASED ON OUR MERCHANDISING TO SELL STANDARDS. ASSIST WITH VISUALLY MERCHANDISING THE STORE, INCLUDING COMPLYING WITH BRAND STANDARDS WITH REGARD TO ALL VISUAL MERCHANDISING TASKS. HELP MONITOR THE SECURITY OF ALL COMPANY PROPERTY. REPORT OR DOCUMENT DAMAGED OR MISSING PRODUCT. ASSIST IN CONDUCTING MERCHANDISE STOCK COUNTS AS REQUESTED BY YOUR STORE MANAGEMENT TEAM. REPORT ANY DISCREPANCIES TO THE MANAGER ON DUTY. EFFECTIVELY PARTICIPATE AS A MEMBER OF A STORE TEAM WHERE EMPLOYEES ARE HELD ACCOUNTABLE FOR NOT ONLY INDIVIDUAL PERFORMANCE, BUT ALSO FOR INTERACTING WITH THE GREATER STORE TEAM IN MANNER THAT SUPPORTS THE ACHIEVEMENT OF ESTABLISHED TEAM GOALS. MAINTAIN A WORKPLACE FREE OF HARASSMENT AND DISCRIMINATION BY STRICTLY ADHERING TO THE COMPANY’S ANTI-DISCRIMINATION AND HARASSMENT POLICIES AND PROMPTLY REPORTING TO YOUR REGIONAL MANAGER, ZONE VICE PRESIDENT AND THE HUMAN RESOURCES DEPARTMENT ANY CONCERNS THAT MAY ARISE UNDER THOSE POLICIES.\n\nPHYSICAL REQUIREMENTS\n\n ABILITY TO STAND AND WALK FOR THE MAJORITY OF WORK SHIFT, FREQUENTLY BEND, SQUAT AND TWIST, LIFT UP TO 50 LBS., CLIMB A LADDER TO REACH MERCHANDISE AND OR SUPPLIES, AND SEE AND DISTINGUISH BETWEEN FABRIC PATTERNS AND COLORS.\n\nPAY RANGE : $17.00 - $21.25/HR\n\nWE TAKE INTO CONSIDERATION ON INDIVIDUAL'S SKILLS, BACKGROUND AND EXPERIENCE IN DETERMINING FINAL SALARY. BASE PAY INFORMATION IS BASED ON MARKET LOCATION AND MAY BE SUBJECT TO PREVAILING WAGE LAWS, IF APPLICABLE.\n\nYOU MAY HAVE THE OPPORTUNITY TO VOLUNTARILY WORK BETWEEN MULTIPLE STORE OR SITE LOCATIONS, AND ACROSS MULTIPLE BRANDS. \n\nREASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS.\n\nOUR COMPANY CELEBRATES DIVERSITY AND PROVIDES EQUAL EMPLOYMENT OPPORTUNITY TO ALL APPLICANTS AND EMPLOYEES WITHOUT REGARD TO RACE, COLOR, SEX, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, NATIONAL ORIGIN, RELIGION, VETERAN OR MILITARY STATUS, AGE, PHYSICAL OR MENTAL DISABILITY, MARITAL STATUS, OR ANY OTHER PROTECTED STATUS UNDER THE LAW.\n\nWORK LOCATIONS: 02703 SANTA MONICA 1701 WILSHIRE BLVD SANTA MONICA 90403\n\nJOB: SALES\n\nORGANIZATION: MEN'S WEARHOUSE\n\nSHIFT: VARIABLE\n\nZONE: WEST",
    "job_skill_set": [
      "retail sales",
      "customer service",
      "team selling",
      "product knowledge",
      "communication",
      "teamwork",
      "adaptability",
      "problem solving",
      "customer relationship building",
      "respectfulness",
      "accountability",
      "positive attitude",
      "visual merchandising",
      "sales metrics analysis",
      "alteration fitting",
      "inventory management"
    ],
    "short_keywords": [
      "accountability",
      "adaptability",
      "alteration",
      "analysis",
      "associate",
      "attitude",
      "building",
      "communication",
      "customer",
      "fitting",
      "inventory",
      "knowledge",
      "management",
      "merchandising",
      "metrics",
      "positive",
      "problem",
      "product",
      "relationship",
      "respectfulness",
      "retail",
      "sales",
      "seasonal",
      "selling",
      "service",
      "solving",
      "team",
      "teamwork",
      "visual"
    ]
  },
  {
    "job_id": "3904938501",
    "job_title": "Sales Manager",
    "category": "SALES",
    "job_description": "SAN DIEGO, CALIFORNIA\n\nSALES MANAGER\n\nPAY FROM $120,000 TO $150,000 PER YEAR\n\nSTRONG CUSTOMER RELATIONSHIPS BUILT ON TRUST - THAT’S THE FOUNDATION OF ULINE’S SALES CULTURE! AS SALES MANAGER AT OUR CALIFORNIA LOCATION, YOU’LL GUIDE AND DEVELOP A FAST-GROWING SALES TEAM WITH A CUSTOMER-FIRST FOCUS. HELP DRIVE ULINE’S SUCCESS AS A TOP DISTRIBUTOR OF SHIPPING, INDUSTRIAL AND PACKAGING MATERIALS!\n\nSCHEDULE\n\nMONDAY AND FRIDAY - ONTARIO, CA OFFICE.\n\nTUESDAY THROUGH THURSDAY - SALES TEAM VISITS IN THE SAN DIEGO, ORANGE COUNTY AND INLAND EMPIRE AREAS.\n\nPOSITION RESPONSIBILITIES\n\nRECRUIT, TRAIN, DEVELOP AND MANAGE A SALES TEAM OF 8 – 10 REPRESENTATIVES.CONDUCT REGULAR JOINT SALES CALLS WITH SALES REPRESENTATIVES AND ACCOUNT MANAGERS AND WORK CLOSELY WITH STRATEGIC ACCOUNTS.WORK WITH NATIONAL SALES AND TRAINING MANAGERS TO IMPLEMENT EFFECTIVE SALES STRATEGIES AND TRAINING PROCEDURES.MONITOR AND ANALYZE SALES GOALS, IDENTIFYING OPPORTUNITIES FOR IMPROVEMENTS.\n\nMINIMUM REQUIREMENTS\n\nBACHELOR'S DEGREE.5+ YEARS OF EXPERIENCE IN SALES / SALES MANAGEMENT WITH STRONG LEADERSHIP AND COACHING SKILLS.EXCELLENT INTERPERSONAL AND COMMUNICATION SKILLS.FREQUENT TRAVEL WITHIN TERRITORY WITH OCCASIONAL TRAVEL TO ULINE’S OTHER NORTH AMERICAN LOCATIONS.\n\nBENEFITS\n\nCOMPLETE MEDICAL, DENTAL, VISION AND LIFE INSURANCE COVERAGE, FLEXIBLE SPENDING ACCOUNTS AND WELLNESS PROGRAMS.401(K) WITH 6% EMPLOYER MATCH.PAID HOLIDAYS AND GENEROUS PAID TIME OFF.TUITION ASSISTANCE PROGRAM THAT COVERS PROFESSIONAL CONTINUING EDUCATION.BONUS PROGRAMS THAT INCLUDE ANNUAL PERFORMANCE, SALES GOALS AND PROFIT SHARING.MONTHLY INTERNET / CELL PHONE ALLOWANCE AND CAR MILEAGE REIMBURSEMENT.\n\nABOUT ULINE\n\nULINE IS NORTH AMERICA'S LEADING DISTRIBUTOR OF SHIPPING, INDUSTRIAL AND PACKAGING MATERIALS. WE'RE A FAMILY-OWNED COMPANY KNOWN FOR INCREDIBLE SERVICE, QUALITY PRODUCTS AND SAME-DAY SHIPPING OF OUR HUGE IN-STOCK INVENTORY. WITH OVER 9,000 EMPLOYEES ACROSS 13 BRANCH LOCATIONS AND 15 SALES OFFICES, IT'S TIME YOU JOINED ULINE.\n\nULINE IS PROUD TO OPERATE AS A DRUG-FREE WORKPLACE. ALL NEW HIRES MUST COMPLETE A PRE-EMPLOYMENT HAIR FOLLICLE DRUG SCREENING.\n\nEEO/AA EMPLOYER/VET/DISABLED\n\n(#IN-CASLS)\n\nOUR EMPLOYEES MAKE THE DIFFERENCE AND WE ARE COMMITTED TO OFFERING EXCEPTIONAL BENEFITS AND PERKS! EXPLORE ULINE.JOBS TO LEARN MORE!\n\n",
    "job_skill_set": [
      "customer relationship management",
      "interpersonal communication",
      "coaching",
      "leadership",
      "communication",
      "teamwork",
      "time management",
      "relationship building",
      "motivation",
      "sales management",
      "sales strategy implementation",
      "team recruitment and training",
      "sales goal analysis",
      "data analysis",
      "territory management",
      "problem solving",
      "adaptability"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "and",
      "building",
      "coaching",
      "communication",
      "customer",
      "data",
      "goal",
      "implementation",
      "interpersonal",
      "leadership",
      "management",
      "manager",
      "motivation",
      "problem",
      "recruitment",
      "relationship",
      "sales",
      "solving",
      "strategy",
      "team",
      "teamwork",
      "territory",
      "time",
      "training"
    ]
  },
  {
    "job_id": "3906229779",
    "job_title": "Sales Representative I - Boston",
    "category": "SALES",
    "job_description": "AT ZIMMER BIOMET, WE BELIEVE IN PUSHING THE BOUNDARIES OF INNOVATION AND DRIVING OUR MISSION FORWARD. AS A GLOBAL MEDICAL TECHNOLOGY LEADER FOR NEARLY 100 YEARS, A PATIENT’S MOBILITY IS ENHANCED BY A ZIMMER BIOMET PRODUCT OR TECHNOLOGY EVERY 8 SECONDS.\n\nAS A ZIMMER BIOMET TEAM MEMBER, YOU WILL SHARE IN OUR COMMITMENT TO PROVIDING MOBILITY AND RENEWED LIFE TO PEOPLE AROUND THE WORLD. TO SUPPORT OUR TALENT TEAM, WE FOCUS ON DEVELOPMENT OPPORTUNITIES, ROBUST EMPLOYEE RESOURCE GROUPS (ERGS), A FLEXIBLE WORKING ENVIRONMENT, LOCATION SPECIFIC COMPETITIVE TOTAL REWARDS, WELLNESS INCENTIVES AND A CULTURE OF RECOGNITION AND PERFORMANCE AWARDS. WE ARE COMMITTED TO CREATING AN ENVIRONMENT WHERE EVERY TEAM MEMBER FEELS INCLUDED, RESPECTED, EMPOWERED, AND RECOGNIZED.\n\nWHAT YOU CAN EXPECT\n\nZIMMER BIOMET IS A GLOBAL MEDICAL TECHNOLOGY LEADER. OUR TEAM MEMBERS ARE PART OF A COMPANY WITH A HERITAGE OF LEADERSHIP, A FOCUS ON SHAPING THE FUTURE, AND A MISSION DEDICATED TO ALLEVIATING PAIN AND IMPROVING THE QUALITY OF LIFE FOR PEOPLE AROUND THE WORLD.\n\nRESPONSIBLE FOR ATTAINING SALES GOALS AND OBJECTIVES THROUGH THE CREATION AND EXECUTION OF A SALES PLAN IN THE ASSIGNED AREA. THIS POSITION WILL DRIVE SALES GROWTH THROUGH COMMUNICATION AND IN-PERSON INTERACTIONS WITH CURRENT AND PROSPECTIVE CUSTOMERS REGARDING ZIMMER RESTORATIVE THERAPY PRODUCTS.\n\nHOW YOU'LL CREATE IMPACT\n\nBUILDS STRONG RELATIONSHIPS WITH KEY ACCOUNT DECISION MAKERS IN THE GIVEN AREA, WHILE ABLE TO PRESENT AND CLOSE BUSINESS WITH CLINICAL PROFICIENCY AND BUSINESS ACUMEN. BUILDS AND IMPLEMENTS A SALES PLAN FOR THE ASSIGNED AREA, MANAGES AND TRACKS CUSTOMER SALES ACTIVITY AND PROSPECTIVE CUSTOMER INITIATIVES, ACHIEVES SALES TARGETS, REPORTS ON SALES PROGRESS AND COMPETITOR AND CUSTOMER ACTIVITIES TO SALES LEADER, AND UTILIZES A WORKING BUSINESS PLAN TO ENSURE FLAWLESS EXECUTION AND REALIZED GAINS FOR REVENUE GROWTH. PLANS, COORDINATES AND EXECUTES LOCAL EDUCATIONAL AND SALES BLITZ EVENTS, WITH THE SUPPORT OF OTHER INTERNAL RESOURCES, INTENDED TO AUGMENT THE BUSINESS AND HELP TO DELIVER ASSIGNED SALES GOALS.DRIVES SALES ACTIVITIES RESULTING IN CONVERSIONS AND BUSINESS GROWTH WITHIN THE TERRITORYCOLLABORATES WITH STAFF FROM THE ASSIGNED RECON TERRITORY TO TARGET AND EXECUTE LEADING TO OVER-PLAN PERFORMANCE. STRICTLY ADHERES TO ALL LAWS AND ZIMMER POLICIES AND SOPS REGARDING THE INTERACTION WITH HCP’S (HEALTH CARE PROFESSIONALS), PRODUCT HANDLING AND COMPLAINTS, EXPENSE REPORTING, AND COMPLIANCE TRAINING.\n\nWHAT MAKES YOU STAND OUT\n\nBUILDS STRONG RELATIONSHIPS WITH KEY ACCOUNT DECISION MAKERS IN THE GIVEN AREA, WHILE ABLE TO PRESENT AND CLOSE BUSINESS WITH CLINICAL PROFICIENCY AND BUSINESS ACUMEN.BUILDS AND IMPLEMENTS A SALES PLAN FOR THE ASSIGNED AREA, MANAGES AND TRACKS CUSTOMER SALES ACTIVITY AND PROSPECTIVE CUSTOMER INITIATIVES, ACHIEVES SALES TARGETS, REPORTS ON SALES PROGRESS AND COMPETITOR AND CUSTOMER ACTIVITIES TO SALES LEADER, AND UTILIZES A WORKING BUSINESS PLAN TO ENSURE FLAWLESS EXECUTION AND REALIZED GAINS FOR REVENUE GROWTH.PLANS, COORDINATES AND EXECUTES LOCAL EDUCATIONAL AND SALES BLITZ EVENTS, WITH THE SUPPORT OF OTHER INTERNAL RESOURCES, INTENDED TO AUGMENT THE BUSINESS AND HELP TO DELIVER ASSIGNED SALES GOALS.DRIVES SALES ACTIVITIES RESULTING IN CONVERSIONS AND BUSINESS GROWTH WITHIN THE TERRITORYCOLLABORATES WITH STAFF FROM THE ASSIGNED RECON TERRITORY TO TARGET AND EXECUTE LEADING TO OVER-PLAN PERFORMANCE.STRICTLY ADHERES TO ALL LAWS AND ZIMMER POLICIES AND SOPS REGARDING THE INTERACTION WITH HCP’S (HEALTH CARE PROFESSIONALS), PRODUCT HANDLING AND COMPLAINTS, EXPENSE REPORTING, AND COMPLIANCE TRAINING.TECHNICAL APTITUDE – ABILITY TO LEARN THE PRODUCTS AND ARTICULATE THE ZB VALUE PROPOSITION\n\nYOUR BACKGROUND\n\nBACHELOR’S DEGREE A MINIMUM. PREVIOUS OFFICE-BASED SELLING EXPERIENCE PREFERRED. \n\nTRAVEL EXPECTATIONS\n\nUP TO 80% PREDOMINANTLY BY CAR, DEPENDING ON TERRITORY.UP TO 20% OVERNIGHT TRAVEL MAY BE REQUIRED.\n\nEOE/M/F/VET/DISABILITY\n\nBASE SALARY COMPENSATION: $70,000.00 USD PER YEAR\n\n1851",
    "job_skill_set": [
      "customer relationship management",
      "sales tracking",
      "technical aptitude",
      "product knowledge",
      "communication",
      "team collaboration",
      "problem solving",
      "adaptability",
      "time management",
      "customer service",
      "relationship building",
      "sales planning",
      "clinical proficiency",
      "business acumen",
      "compliance training",
      "event coordination",
      "presentation skills"
    ],
    "short_keywords": [
      "acumen",
      "adaptability",
      "aptitude",
      "boston",
      "building",
      "business",
      "clinical",
      "collaboration",
      "communication",
      "compliance",
      "coordination",
      "customer",
      "event",
      "i",
      "knowledge",
      "management",
      "planning",
      "presentation",
      "problem",
      "product",
      "proficiency",
      "relationship",
      "representative",
      "sales",
      "service",
      "skills",
      "solving",
      "team",
      "technical",
      "time",
      "tracking",
      "training"
    ]
  },
  {
    "job_id": "3901394613",
    "job_title": "Project Sales Manager",
    "category": "SALES",
    "job_description": "UNLOCK THE POTENTIAL OF SYNERGY AS YOU STEP INTO THE ROLE OF PROJECT SALES MANAGER, WHERE THE WORLDS OF DYNAMIC SALES GROWTH AND STRATEGIC PROJECT MANAGEMENT BLEND TO CHART THE COURSE OF OUR COMPANY'S SUSTAINED SUCCESS. SEAMLESSLY NAVIGATE THE INTRICATE DANCE OF LEAD GENERATION, CLIENT ENGAGEMENT, AND PROJECT EXECUTION, CRAFTING EACH INTERACTION INTO A MASTERPIECE OF SUCCESS. ELEVATE YOUR CAREER TO NEW HEIGHTS AS YOU BECOME THE ARCHITECT OF THRIVING CLIENT RELATIONSHIPS AND THE DRIVING FORCE BEHIND OUR EXPONENTIAL GROWTH. JOIN US AT THE FOREFRONT OF INNOVATION AND AMBITION, WHERE EVERY CHALLENGE IS AN OPPORTUNITY AND EVERY SUCCESS A TESTAMENT TO YOUR SKILL.\nJOB SUMMARY: THIS ROLE COMBINES THE ELEMENTS OF PROJECT MANAGEMENT AND SALES MANAGEMENT TO DRIVE BUSINESS GROWTH AND ENSURE SUCCESSFUL PROJECT EXECUTION. THE PROJECT SALES MANAGER WILL BE RESPONSIBLE FOR OVERSEEING THE ENTIRE SALES PROCESS, FROM LEAD GENERATION TO PROJECT COMPLETION, WHILE MAINTAINING STRONG INTERNAL AND CUSTOMER RELATIONSHIPS.\nDUTIES & RESPONSIBILITIES:\nORGANIZE AND PRIORITIZE MULTIPLE PROGRAMS AND ACTIVITIES IN ACCORDANCE WITH THE GOALS OF THE ORGANIZATION AND/OR REQUIREMENTS OF THE CUSTOMER.CONDUCT THOROUGH MARKET RESEARCH TO IDENTIFY POTENTIAL BUSINESS OPPORTUNITIES AND TARGET INDUSTRIES.BUILD AND MAINTAIN A ROBUST SALES PIPELINE BY ACTIVELY PURSUING NEW LEADS AND OPPORTUNITIES.PARTICIPATE IN AND POTENTIALLY LEAD ADVANCED PRODUCT QUALITY PLANNING (APQP)DEVELOP, ESTABLISH AND MAINTAIN EXTERNAL AND INTERNAL RELATIONSHIPS.UNDERSTAND AND EFFECTIVELY COMMUNICATE THE COMPANY'S VALUE PROPOSITION, TECHNOLOGIES, AND VALUE ADD TO CUSTOMERSDEVELOP SALES STRATEGIES TO SUCCESSFULLY GROW PROFITABLE REVENUE YEAR OVER YEARLEAD INSIDE AND OUTSIDE SALES STAFF TO EFFECTIVELY PROVIDE EXCEPTIONAL CUSTOMER SERVICE TO CURRENT AND POTENTIAL CUSTOMERSREPORT ON KEY KPIS RELATED TO GROWTH OBJECTIVES (OPPORTUNITIES AND BOOKINGS)PARTICIPATE AND REPRESENT THE COMPANY AT NETWORKING FUNCTIONS, SPEAKING ENGAGEMENTS AND OTHER INDUSTRY-RELATED EVENTS QUALIFICATIONS  BACHELOR’S DEGREE OR EQUIVALENT IN TECHNICAL OR OTHER RELATED FIELDFIVE (5) YEARS’ EXPERIENCE IN MANUFACTURING ORGANIZATIONS AND/OR SALES ORGANIZATIONS EXCELLENT INTERPERSONAL SKILLS, WITH THE ABILITY TO COMMUNICATE EFFECTIVELY WITH MANAGEMENT, CROSS-FUNCTIONAL TEAMS, AND CUSTOMERS FOR BOTH TECHNICAL AND NON-TECHNICAL AUDIENCESSTRONG PROJECT MANAGEMENT, NEW BUSINESS DEVELOPMENT AND CUSTOMER RETENTION SKILLSSTRONG ORGANIZATIONAL SKILLS WITH SUCCESS IN MEETING STRINGENT DEADLINESPROFICIENCY USING MICROSOFT WINDOWS AND MICROSOFT OFFICE SUITE.UP TO 50% TRAVEL MAY BE REQUIRED, EXPECTED TO BE APPROXIMATELY 25% TRAVEL, DOMESTIC AND INTERNATIONAL.KEEN BUSINESS SENSE, WITH THE ABILITY TO FIND CREATIVE BUSINESS-ORIENTED SOLUTIONS TO CHALLENGING SITUATIONSPROFICIENCY IN CRM SOFTWARE AND PROJECT MANAGEMENT TOOLSCONTRIBUTE TO A WORK ENVIRONMENT THAT FOSTERS PRIDE IN WORKING AT MAGNET-SCHULTZ OF AMERICA  PHYSICAL REQUIREMENTS PROLONGED PERIODS OF SITTING/STANDING AT A DESK AND WORKING ON A COMPUTERMUST BE ABLE TO SIT IN CAR, PLANE OR TRAIN FOR AN EXTENDED PERIOD OF TIME ",
    "job_skill_set": [
      "sales management",
      "interpersonal skills",
      "communication",
      "organizational skills",
      "problem solving",
      "teamwork",
      "creativity",
      "customer service",
      "project management",
      "lead generation",
      "market research",
      "CRM software",
      "Microsoft Office Suite",
      "project management tools",
      "business development",
      "customer retention",
      "KPI reporting"
    ],
    "short_keywords": [
      "business",
      "communication",
      "creativity",
      "crm",
      "customer",
      "development",
      "generation",
      "interpersonal",
      "kpi",
      "lead",
      "management",
      "manager",
      "market",
      "microsoft",
      "office",
      "organizational",
      "problem",
      "project",
      "reporting",
      "research",
      "retention",
      "sales",
      "service",
      "skills",
      "software",
      "solving",
      "suite",
      "teamwork",
      "tools"
    ]
  },
  {
    "job_id": "3895234940",
    "job_title": "Medical Device Sales Internship- KENTUCKY",
    "category": "SALES",
    "job_description": "THIS INTERNSHIP POSTING IS SPECIFIC FOR APPLICANTS IN KENTUCKY. IF YOU ARE FROM OTHER STATES, PLEASE APPLY TO THIS JOB POSTING: HTTPS://WWW.LINKEDIN.COM/JOBS/VIEW/3847055655/\nCOMPANY OVERVIEW:LOCHNESS MEDICAL SUPPLIES INC. (LMS) IS A PREMIER DISTRIBUTOR OF MEDICAL DEVICES, SPECIALIZING IN RAPID DRUG SCREENING AND POINT OF CARE TESTS. WE PROVIDE OUR CLIENTS WITH QUALITY PRODUCTS THEY CAN RELY ON TO MAKE INFORMED DECISIONS FOR THEIR PATIENTS AND CLIENTS. JOIN A SALES TEAM OF HIGHLY MOTIVATED AND CONSULTATIVE PRODUCT EXPERTS WHO ARE COMMITTED TO DRIVING GROWTH AND ESTABLISHING LASTING RELATIONSHIPS WITH CLIENTS.\nJOB OVERVIEW:AS A MEDICAL DEVICE SALES INTERN, YOU WILL BE A PART OF A DYNAMIC TEAM, DRIVING NEW BUSINESS AND DELIVERING EXCEPTIONAL SERVICE. YOU'LL WORK CLOSELY WITH CUSTOMERS, ENSURING THEIR NEEDS ARE MET, AND ESTABLISHING NEW BUSINESS RELATIONSHIPS. YOUR ROLE INVOLVES DAILY OUTREACH, MAINTAINING RECORDS, AND CONTRIBUTING TO LMS’ COMPETITIVE EDGE IN THE MARKETPLACE.THIS POSITION IS DESIGNED TO PROVIDE STUDENTS WITH A PLATFORM TO LEARN, GROW, AND CONTRIBUTE TO THE OVERALL SUCCESS OF LMS.LMS IS HIRING ACROSS THE USA, PRESENTING MULTIPLE EXCITING INTERNSHIP OPPORTUNITIES IN VARIOUS LOCATIONS NATIONWIDE.\nJOB RESPONSIBILITIES:CONNECT WITH CLIENTS/PROSPECTS TO LEARN ABOUT THEIR BUSINESS NEEDS AND PROBLEMS THROUGH PHONE CALLS (INCLUDING COLD CALLING), EMAILS, IN-PERSON MEETINGS ETC.FOCUS YOUR SALES STRATEGIES TO SPECIFICALLY CATER TO LMS TARGET CLIENTS: STAFFING INDUSTRY, TREATMENT HOUSES, PHYSICIAN'S OFFICES, AND URGENT CARE FACILITIES.DRIVE SALES BY EFFECTIVELY MEETING CUSTOMER NEEDS AND ESTABLISHING NEW BUSINESS.PROACTIVELY SEEK NEW SALES OPPORTUNITIES.MANAGE AND GROW EXISTING ACCOUNTS.ANALYZE MARKET TRENDS AND DEALER VOLUMES TO REFINE SALES STRATEGIES.PROVIDE PRODUCT INFORMATION AND SUBMIT ORDERS, ENSURING CUSTOMER SATISFACTION.PREPARE DETAILED REPORTS ON SALES ACTIVITIES, MARKET CONDITIONS, AND COMPETITOR ANALYSIS.ADDRESS CUSTOMER CONCERNS, OFFERING SOLUTIONS AND FEEDBACK TO MANAGEMENT.STAY UPDATED ON INDUSTRY DEVELOPMENTS AND MAINTAIN PROFESSIONAL NETWORKS.KEEP ACCURATE SALES RECORDS AND CONTRIBUTE TO TEAM SUCCESS.TRAVEL IS REQUIRED FOR THIS POSITION.\nSALARY AND COMPENSATIONWAGE RANGE: COMMENSURATE WITH EXPERIENCE.CAR ALLOWANCE AS PER IRS STANDARDS AT 65.5 CENTS PER MILE, PAID MONTHLY.\n QUALIFICATIONS/SKILLS:INTERNSHIP POSITION IDEAL FOR INDIVIDUALS WITH 0-1 YEAR OF DIRECT SALES EXPERIENCE INCLUDING PAST INTERNSHIPS.STRONG CAPABILITY TO PROSPECT AND SUCCESSFULLY REACH DECISION MAKERS, WITH AN APTITUDE FOR STRATEGIC OUTREACH AND PERSUASIVE COMMUNICATION.ABILITY TO GENERATE, SEEK OUT, AND DRIVE NEW BUSINESS DEVELOPING SUCCESSFUL BUSINESS RELATIONSHIPS.CAPABILITY TO MEET AND EXCEED SALES GOALS AND A STRONG ABILITY FOR EFFECTIVELY CLOSING DEALS.EXCELLENT COMMUNICATION AND CUSTOMER SERVICE SKILLS.CONFIDENCE IN PRESENTING IN FRONT OF DECISION MAKERS AND EXECUTIVES, EFFECTIVELY CHAMPIONING PRODUCTS.SKILLED IN NEGOTIATION, WITH A PERSISTENT AND SELF-CONFIDENT APPROACH.UNDERSTANDING OF CONSULTATIVE SELLING WITH THE ABILITY TO QUICKLY LEARN PRODUCT-BASED KNOWLEDGE.STRONG WORK ETHIC, MOTIVATION FOR SALES, AND ABILITY TO WORK INDEPENDENTLY.EXCEPTIONAL ORGANIZATIONAL SKILLS, WITH A PROVEN ABILITY TO MANAGE MULTIPLE TASKS EFFICIENTLY AND PRIORITIZE EFFECTIVELY.ACTIVELY PURSUING A DEGREE OR DIPLOMA IN AREA SUCH AS HEALTH OR LIFE SCIENCES, MARKETING, OR SALES FROM AN ACCREDITED UNIVERSITY OR COLLEGE.MUST POSSESS A PERSONAL LAPTOP AND A CAR FOR TRAVEL REQUIREMENTS.\nAPPLICATION PROCESS: INTERESTED CANDIDATES SHOULD SUBMIT A RESUME AND ANY SUPPORTING DOCUMENTS TO CAREERS@LOCHNESSMEDICAL.COM. ",
    "job_skill_set": [
      "sales",
      "customer service",
      "record keeping",
      "cold calling",
      "report writing",
      "communication",
      "relationship building",
      "problem solving",
      "time management",
      "self-motivation",
      "teamwork",
      "adaptability",
      "confidence",
      "organizational skills",
      "independence",
      "negotiation",
      "market analysis",
      "consultative selling",
      "product knowledge",
      "strategic outreach"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "building",
      "calling",
      "cold",
      "communication",
      "confidence",
      "consultative",
      "customer",
      "device",
      "independence",
      "internship",
      "keeping",
      "kentucky",
      "knowledge",
      "management",
      "market",
      "medical",
      "negotiation",
      "organizational",
      "outreach",
      "problem",
      "product",
      "record",
      "relationship",
      "report",
      "sales",
      "selfmotivation",
      "selling",
      "service",
      "skills",
      "solving",
      "strategic",
      "teamwork",
      "time",
      "writing"
    ]
  },
  {
    "job_id": "3900959341",
    "job_title": "Tire Sales & Installation Associate Part Time",
    "category": "SALES",
    "job_description": "JOIN OUR TEAM OF MORE THAN 34,000 TEAM MEMBERS, SUPPORTING OUR MEMBERS AND COMMUNITIES IN OUR CLUB SUPPORT CENTER, 235+ CLUBS AND EIGHT DISTRIBUTION CENTERS. BJ’S WHOLESALE CLUB OFFERS A COLLABORATIVE AND INCLUSIVE ENVIRONMENT WHERE ALL TEAM MEMBERS CAN LEARN, GROW AND BE THEIR AUTHENTIC SELVES. TOGETHER, WE’RE COMMITTED TO PROVIDING OUTSTANDING SERVICE AND CONVENIENCE TO OUR MEMBERS, HELPING THEM SAVE ON THE PRODUCTS AND SERVICES THEY NEED FOR THEIR FAMILIES AND HOMES. \n\nTHE BENEFITS OF WORKING AT BJ’S\n\n BJ’S PAYS WEEKLY GENEROUS TIME OFF PROGRAMS TO SUPPORT BUSY LIFESTYLES*VACATION, PERSONAL, HOLIDAY, SICK, BEREAVEMENT LEAVE, JURY DUTY BENEFIT PLANS FOR YOUR CHANGING NEEDS*THREE MEDICAL PLANS**, HEALTH REIMBURSEMENT ACCOUNT (HRA), HEALTH SAVINGS ACCOUNT (HSA), TWO DENTAL PLANS, FLEXIBLE SPENDINGELIGIBILITY REQUIREMENTS VARY BY POSITIONMEDICAL PLANS VARY BY LOCATION\n\nJOB SUMMARY\n\nRESPONSIBLE FOR ASSISTING MEMBERS IN THE SELECTION AND PURCHASE OF TIRES, PROPERLY INSTALLING AND REPAIRING TIRES, COMPLETING NECESSARY TIRE BAY DOCUMENTATION, AND MAINTAINING TIRE BAY POLICIES AND PROCEDURES.\n\nTEAM MEMBERS:\n\nCARRY OUT JOB FUNCTIONS AND RESPONSIBILITIES AS ASSIGNED. SUPPORT THE APPLICATION OF CLUB POLICIES, PROCEDURES AND COMPLIANCE.WE STRIVE FOR FLAWLESS EXECUTION AND HOLD OURSELVES ACCOUNTABLE . ACTS WITH HONESTY AND INTEGRITY AND LEAD WITH THE MEMBER IN MIND TO ADDRESS ANY AND ALL CONCERNS AND TO ESCALATE ANY CONCERNS, AS APPROPRIATE. ENSURE A SAFE AND POSITIVE ENVIRONMENT FOR OUR MEMBERS AND EACH OTHER. EMBRACE INCLUSION AND DIVERSITY, BY WORKING TOGETHER WITH COLLABORATION AND RESPECT. WORK AS A TEAM TO ACHIEVE GOALS.MOVE WITH SPEED AND AGILITY IN EVERYTHING WE DO.INNOVATE AND ADAPT SO WE CAN MOVE AS FAST AS THE WORLD AROUND US.MAINTAIN A FRIENDLY AND POSITIVE ATTITUDE.\n\nMEMBERS:\n\nDELIVER SERVICE EXCELLENCE THROUGH ALL POINTS OF CONTACT. RESOLVE AND DEESCALATE TO ADDRESS EVERY MEMBER CONCERN.ENSURE A SAFE AND POSITIVE ENVIRONMENT AND EXPERIENCE FOR THE MEMBERS.DAILY COMMITMENT TO GOLD MEMBER STANDARDSGREET, ANTICIPATE, APPRECIATE (GAA)FAST, FRIENDLY FULL, FRESH, CLEAN\nCLUB STANDARDS: WORK AS A TEAM TO DELIVER GOLD CLUB STANDARDS DAILY.\n\nWORK WITH COMMITMENT AND PRIDE TO DELIVER GOLD- GRAND OPENING LOOK DAILYALL ITEMS STOCKED AND PROMOTIONAL PLANS EXECUTEDMAINTAIN VISIBLE ACCURATE SIGNAGECLEAN AND ORGANIZED, INSIDE AND OUT\nKNOW YOUR BUSINESS:\n\nUNDERSTAND HOW TO ACCESS AND READ PRODUCTION AND/OR FINANCIAL PERFORMANCE REPORTING FOR YOUR DEPARTMENTSEE THE CONNECTION BETWEEN CONSISTENT EXECUTION AND THE POSITIVE IMPACT IT CAN HAVE ON THE BUSINESS\n\nMAJOR TASKS, RESPONSIBILITIES, AND KEY ACCOUNTABILITIES\n\nRESPONSIBLE FOR THE PROPER INSTALLATION OF TIRES, INCLUDING MOUNTING, DISMOUNTING, ROTATING, AND BALANCING TIRES. RESPONSIBLE FOR PROPERLY DISPOSING OF TIRES AND ENSURING PROPANE TANKS ARE FILLED PER CLUB POLICY.MAINTAINS A CLEAN AND PROFESSIONAL TIRE BAY AND WAITING AREA. MERCHANDISES TIRE DISPLAYS AND AUTOMOTIVE PRODUCTS.ENSURES THAT KNOWLEDGEABLE SERVICE IS PROVIDED TO MEMBERS AT THE TIRE DESK. COORDINATES WITH HOME OFFICE REGARDING MEMBER TIRE NEEDS AS NEEDED.MAINTAINS AN ACCURATE AND COMPLETE SUPPLY INVENTORY. UNDERSTANDS AND APPROPRIATELY UTILIZES AVAILABLE SPECIAL-ORDER TIRE PROGRAMS.COMPLIES WITH SAFETY AND CLEANLINESS STANDARDS AND PROPERLY UTILIZES TIRE BAY EQUIPMENT.ASSISTS MEMBERS IN THE SELECTION AND PURCHASE OF TIRES INCLUDING VERIFYING THE SIZES FOR VEHICLES.FILLS PROPANE TANKS AS NEEDED IF CERTIFIED PER DOT REQUIREMENTS.PROVIDES KNOWLEDGEABLE SERVICE TO MEMBERS AT THE TIRE DESK.UNDERSTANDS AND APPROPRIATELY UTILIZES AVAILABLE SPECIAL ORDER TIRE PROGRAMS.ENSURES THAT ALL TIRE BAY SCHEDULING DATA AND DOCUMENTATION IS COMPLETED FOR SALES AND SERVICE ORDERS.MAINTAINS ALL CLUB POLICIES AND PROCEDURES.PERFORMS OTHER DUTIES AS ASSIGNED, INCLUDING WORKING IN OTHER DEPARTMENTS AS NEEDED.REGULAR, PREDICTABLE, FULL ATTENDANCE IS AN ESSENTIAL FUNCTION OF THIS JOB.\n\nQUALIFICATIONS\n\nMUST BE AT LEAST 18 YEARS OF AGE.VALID DRIVER’S LICENSE AND ABILITY TO DRIVE AUTOMATIC AND MANUAL TRANSMISSION VEHICLES REQUIRED.STRONG INTERPERSONAL SKILLS REQUIRED.BASIC COMPUTER SKILLS OR A WILLINGNESS TO LEARN BASIC COMPUTER SKILLS REQUIRED.PRIOR TIRE INSTALLATION EXPERIENCE PREFERRED.MUST PASS MICHELIN TRAINING LEVELS ONE THROUGH FOUR WITHIN THREE MONTHS OF HIRE.ABILITY TO LIFT OVER 30 POUNDS WITH ASSISTANCE.\n\nENVIRONMENTAL JOB CONDITIONS\n\nEXPOSURE TO BOTH INDOOR AND OUTDOOR TEMPERATURES AND WEATHER CONDITIONS.MOST OF THE TIME IS SPENT STANDING AND MOVING ABOUT CONTINUOUSLY ON HARD SURFACES. FREQUENT NEED TO BEND, CLIMB, CRAWL, KNEEL, PUSH, PULL, REACH, MOVE SIDE TO SIDE, STOOP, AND CLIMB LADDERS/STEP STOOLS. FREQUENTLY REQUIRES LIFTING OBJECTS UP TO 30 POUNDS. MAY REQUIRE LIFTING AND MOVING HEAVY AND/OR AWKWARD OBJECTS MORE THAN 30 POUNDS WITH ASSISTANCE.USUALLY PERFORM JOB SURROUNDED BY MOVING CARS, MACHINERY AND/OR LOUD EQUIPMENT THAT MAY REQUIRE SHOUTING TO BE HEARD. THERE MAY BE OCCASIONAL EXPOSURE TO COMPANY APPROVED CHEMICALS AND CLEANING AGENTS, AND STRONG SMELLS.\n\nIN ACCORDANCE WITH THE PAY TRANSPARENCY REQUIREMENTS, THE FOLLOWING REPRESENTS A GOOD FAITH ESTIMATE OF THE COMPENSATION RANGE FOR THIS POSITION. AT BJ’S WHOLESALE CLUB, WE CAREFULLY CONSIDER A WIDE RANGE OF NON-DISCRIMINATORY FACTORS WHEN DETERMINING SALARY. ACTUAL SALARIES WILL VARY DEPENDING ON FACTORS INCLUDING BUT NOT LIMITED TO LOCATION, EDUCATION, EXPERIENCE, AND QUALIFICATIONS. THE PAY RANGE FOR THIS POSITION IS $18.00-$22.50.",
    "job_skill_set": [
      "customer service",
      "inventory management",
      "basic computer skills",
      "teamwork",
      "communication",
      "problem solving",
      "adaptability",
      "interpersonal skills",
      "accountability",
      "collaboration",
      "tire installation",
      "safety compliance",
      "propane tank filling",
      "tire repair",
      "tire selection",
      "merchandising",
      "manual transmission driving",
      "integrity",
      "positive attitude"
    ],
    "short_keywords": [
      "accountability",
      "adaptability",
      "associate",
      "attitude",
      "basic",
      "collaboration",
      "communication",
      "compliance",
      "computer",
      "customer",
      "driving",
      "filling",
      "installation",
      "integrity",
      "interpersonal",
      "inventory",
      "management",
      "manual",
      "merchandising",
      "part",
      "positive",
      "problem",
      "propane",
      "repair",
      "safety",
      "sales",
      "selection",
      "service",
      "skills",
      "solving",
      "tank",
      "teamwork",
      "time",
      "tire",
      "transmission"
    ]
  },
  {
    "job_id": "3891072165",
    "job_title": "Outside Sales Representative",
    "category": "SALES",
    "job_description": "ARE YOU LOOKING FOR A NEW SALES POSITION WITH UNLIMITED EARNING POTENTIAL AND THAT IS IN A FLOURISHING INDUSTRY? OR MAYBE YOU HAVE BEEN THINKING ABOUT SWITCHING CAREER PATHS AND MOVING INTO SALES? LOOKING FOR AN OPPORTUNITY WHERE YOU CAN EARN UNCAPPED COMMISSIONS WHILE STILL HAVING A BASE SALARY?\n\nFIRST YEAR OTE: $85,000-$95,000\n\nWHETHER YOU HAVE SOME SALES EXPERIENCE OR ARE NEW TO SALES, HIBU IS HERE TO SET YOU UP WITH BEST-IN-CLASS TRAINING SO YOU CAN WIN AND GROW YOUR CAREER!\n\nWANT TO KNOW MORE BEFORE GOING ANY FURTHER? CHECK OUT THIS SHORT VIDEO OF WHO WE ARE, AND WE ARE SURE YOU WILL WANT TO EXPLORE FURTHER: HTTPS://VIDEO.HIBU.COM/WATCH/KKXY8EF3ZFSUGSU36YZOM7\n\nWHAT YOU WILL BE RESPONSIBLE FOR: GROW A BOOK OF BUSINESS BY HELPING SMALL BUSINESSES SUCCEEDBECOME A DIGITAL MARKETING EXPERTDEVELOP A CONSULTATIVE SALES APPROACH TO BUILD LONG TERM CLIENT RELATIONSHIPSWORK WITHIN A WIDE VARIETY OF INDUSTRIES, MAKING EACH DAY DIFFERENT!HAVE FUN, WORK HARD, AND CELEBRATE WINS WITH YOUR LOCAL TEAM WHY OUR PEOPLE LOVE WORKING AT HIBU (AND WHY WE HAVE MADE POWER SELLING’S TOP 50 COMPANIES TO SELL FOR SIX YEARS IN A ROW!): FLEXIBILITY AND WORK-LIFE BALANCECLEAR CAREER PATH IN BOTH LEADERSHIP AND SALESTOP-NOTCH TRAINING AND ONGOING SUPPORTCOLLABORATIONPARTNERSHIP SELLING MODELBEST IN CLASS DIGITAL MARKETING OFFERINGSSELL WITH YOUR OWN PERSONALITY AND UNIQUENESSBE THE BEST YOU PHYSICALLY AND MENTALLYCOMMUNITY FOCUSED ORGANIZATIONBASE SALARY, EXPENSE ALLOWANCE, UNCAPPED EARNINGS THROUGH COMMISSION AND BONUSONGOING RECOGNITION AND INCENTIVES INCLUDING AN ANNUAL PRESIDENT’S CLUB TRIP OUR CORE VALUES ARE SOMETHING WE LIVE BY EVERY SINGLE DAY AND WHAT HAS HELPED TO SHAPE OUR BUSINESS TO BECOME A LEADING PROVIDER OF DIGITAL SOLUTIONS ALONG WITH A COMPANY PEOPLE LOVE WORKING FOR. CHECK OUT THIS VIDEO TO LEARN MORE ABOUT HIBU’S CORE VALUES FROM OUR EMPLOYEES THEMSELVES:HTTPS://VIDEO.HIBU.COM/WATCH/NDGVCR4FESAY3CVC43FJYQ\n\nREQUIREMENTS TO WIN IN THIS ROLE: REFUSE TO LOSE ATTITUDE EVERY SINGLE DAYGRIT AND RELENTLESS PERSEVERANCESELF-STARTER AND ABILITY TO STICK WITH AN OUTLINED SUCCESSFUL, PROVEN MODELCRAVE FOR ONGOING LEARNINGQUICK-WITTED, ADAPTABLE, AND STRATEGICPROBLEM SOLVER AND RELATIONSHIP BUILDER1-2 YEARS OF SALES EXPERIENCE OR EXPERIENCE/INTERNSHIPS IN RETAIL, BUSINESS DEVELOPMENT, TEACHING, HEALTHCARE, MANAGEMENT, MILITARY BACKGROUND, OR SELF-EMPLOYED BY NOW, YOU ARE PROBABLY READY TO APPLY IMMEDIATELY, BUT JUST IN CASE YOU NEED 1 MORE REASON TO APPLY, CHECK OUT THIS VIDEO FROM ONE OF OUR SALES REPS ON WHY HIBU IS THE RIGHT CHOICE FOR YOU!HTTPS://WWW.YOUTUBE.COM/WATCH?V=RN9EB_DEDY4\n\n#PANDO\n\nWORKING WITH US MEANS JOINING A TEAM OF TRULY EXTRAORDINARY PEOPLE WORKING TO IMPROVE COMMUNITIES ACROSS THE COUNTRY. JOINING OUR TEAM MEANS NOT ONLY WORKING IN A FUN ENVIRONMENT WITH SMART PEOPLE, BUT ALSO BEING ABLE TO TAKE ADVANTAGE OF OUR COMPETITIVE COMPENSATION, ONGOING TRAINING, INCENTIVES, AND GENEROUS BENEFITS PACKAGE.LEARN MORE ABOUT THE HIBU CULTURE HERE: CULTURE AT HIBU\n\nNOTE: HIBU IS AN EQUAL OPPORTUNITY EMPLOYER, AND CONSISTENT WITH APPLICABLE LAW, PROVIDES REASONABLE ACCOMMODATIONS FOR QUALIFIED INDIVIDUALS WITH DISABILITIES AND DISABLED VETERANS IN COMPLETING OUR JOB APPLICATION PROCESS. IF YOU NEED REASONABLE ACCOMMODATION AND/OR ARE HAVING DIFFICULTY COMPLETING OUR ONLINE APPLICATION PROCESS DUE TO A DISABILITY YOU MAY USE THE FOLLOWING EMAIL ADDRESSAPPLICATIONACCOMODATION@HIBU.COM: PLEASE INCLUDE YOUR NAME AND CONTACT INFORMATION AND THE TITLE OF THE POSITION YOU ARE INTERESTED IN. NOTE: THIS IS NOT FOR GENERAL EMPLOYMENT INQUIRES OR CORRESPONDENCE. HIBU WILL ONLY RESPOND TO REQUESTS RELATED TO THOSE WHO NEED ASSISTANCE WITH THE ONLINE APPLICATION PROCESS DUE TO A DISABILITY PANDOLOGIC. KEYWORDS: FIELD SALES REPRESENTATIVE, LOCATION: WORCESTER, MA - 01653\n\n",
    "job_skill_set": [
      "sales experience",
      "consultative sales",
      "problem solving",
      "relationship building",
      "retail experience",
      "management experience",
      "self-starter",
      "ongoing learning",
      "teamwork",
      "communication",
      "digital marketing",
      "business development",
      "military background",
      "self-employment",
      "adaptability",
      "grit",
      "perseverance",
      "quick-witted"
    ],
    "short_keywords": [
      "adaptability",
      "background",
      "building",
      "business",
      "communication",
      "consultative",
      "development",
      "digital",
      "experience",
      "grit",
      "learning",
      "management",
      "marketing",
      "military",
      "ongoing",
      "outside",
      "perseverance",
      "problem",
      "quickwitted",
      "relationship",
      "representative",
      "retail",
      "sales",
      "selfemployment",
      "selfstarter",
      "solving",
      "teamwork"
    ]
  },
  {
    "job_id": "3895598366",
    "job_title": "Sr. Sales Manager, Aftermarket Programs",
    "category": "SALES",
    "job_description": "ARE YOU A SENIOR SALES MANAGER SEEKING A NEW OPPORTUNITY?\n\nWOULD YOU LIKE THE OPPORTUNITY TO WORK IN A HIGH-IMPACT ROLE RESPONSIBLE FOR SALES GROWTH?\n\nJOIN OUR GROWING VALVES COMMERCIAL TEAM\n\nBAKER HUGHES IS THE LEADING ENERGY TECHNOLOGY COMPANY, WHO DELIVERS ACROSS THE ENERGY VALUE CHAIN THROUGH OUR MARKET-LEADING BUSINESS SEGMENTS. BUILT ON A CENTURY OF EXPERIENCE AND CONDUCTING BUSINESS IN OVER 120 COUNTRIES. OUR INNOVATIVE TECHNOLOGIES AND SERVICES ARE TAKING ENERGY FORWARD! MAKING IT SAFER, CLEANER AND MORE EFFICIENT FOR PEOPLE AND THE PLANET.\n\nPARTNER WITH THE BEST\n\nTHE SENIOR SALES MANAGER WILL BE A CHANNEL AND CUSTOMER FACING POSITION, RESPONSIBLE FOR DEVELOPING GROWTH PROGRAMS FOR THE MASONEILAN AND CONSOLIDATED VALVE LINES.\n\nAS A SENIOR SALES MANAGER - AFTERMARKET PROGRAMS, YOU WILL BE RESPONSIBLE FOR:\n\n\nWORKING CLOSELY WITH CHANNEL PARTNERS AND SUPPORTING SALES TEAMS TO IDENTIFY GROWTH OPPORTUNITIES AT END USER FACILITIESMAPPING BAKER HUGHES VALVE PRODUCT LINES AND OPERATIONAL CAPABILITIES TO IDENTIFY REQUISITE INVESTMENTSEXPANDING BAKER HUGHES AFTERMARKET SALES VOLUMES THROUGH EX MANUFACTURING ASSOCIATE- FIRST SHIFT\n\n\nARE YOU INTERESTED IN PURSUING A CAREER IN MANUFACTURING?\n\nSIGN ON BONUSES OFFERED!\n\nJOIN OUR BAKER HUGHES BENTLY NEVADA TEAM!\n\nBENTLY NEVADA, A BAKER HUGHES BUSINESS, OFFERS A PLANT-WIDE, HOLISTIC SUITE OF MACHINE CONDITION MONITORING AND PROTECTION SOLUTIONS THAT HELP CUSTOMERS ACHIEVE THE HIGHEST LEVEL OF ASSET RELIABILITY POSSIBLE.\n\nPARTNER WITH THE BEST\n\nBUILD WORLD-CLASS INDUSTRIAL MONITORING PRODUCTS AND DELIVER HIGH QUALITY, TIMELY RESULTS FOR OUR CUSTOMERS. ASSOCIATES ARE TRAINED TO WORK WITH A VARIETY OF TOOLS, AUTOMATION, AND SOFTWARE WHILE MAINTAINING A SAFETY FIRST, QUALITY FIRST MINDSET.\n\nAS MANUFACTURING ASSOCIATE, YOU WILL BE RESPONSIBLE FOR:\n\n\nPERFORMING DAILY PRODUCTION OPERATIONS WHILE FOLLOWING ALL APPLICABLE SAFETY, QUALITY AND MANUFACTURING PROCEDURES; COMPLETE WORK IN A TIMELY MANNER WHILE MAINTAINING EXCELLENT STANDARDS.INSPECTING PURCHASED PARTS, COMPONENTS AND EQUIPMENT.FOLLOW ENGINEERING DRAWINGS, DATA SHEETS, SPECIFICATIONS AND OTHER TECHNICAL WORK INSTRUCTIONS.WORK EFFECTIVELY IN A MULTI-TEAM ENVIRONMENT; COMMUNICATE WITH SALES, PLANNING, ENGINEERING AND MANAGEMENT TEAMS REGARDING ASSEMBLY AND SCHEDULING ISSUES.\n\n\nFUEL YOUR PASSION\n\nTO BE SUCCESSFUL IN THIS ROLE YOU WILL:\n\n\nHAVE HIGH SCHOOL DIPLOMA / GED FROM AN ACCREDITED SCHOOL OR INSTITUTIONBE AVAILABLE TO WORK FIRST SHIFT- MONDAY THROUGH FRIDAY 6:00AM TO 2:30PM/OVERTIME AND WEEKENDS AS NEEDED.BE WILLING TO LEARN AND FOLLOW INTERNAL HEALTH, SAFETY AND ENVIRONMENTAL POLICIES TO ENSURE COMPLIANCE.WORK WITH SMALL PARTS AND READ FINE TEXT.WORK WITH APPROVED CHEMICALS.LIFT UP TO 40 LBS. UNASSISTED.\n\n\nWORKING WITH US\n\nOUR PEOPLE ARE AT THE HEART OF WHAT WE DO AT BAKER HUGHES. WE KNOW WE ARE BETTER WHEN ALL OF OUR PEOPLE ARE DEVELOPED, ENGAGED AND ABLE TO BRING THEIR WHOLE AUTHENTIC SELVES TO WORK. WE INVEST IN THE HEALTH AND WELL-BEING OF OUR WORKFORCE, TRAIN AND REWARD TALENT AND DEVELOP LEADERS AT ALL LEVELS TO BRING OUT THE BEST IN EACH OTHER.\n\nWORKING FOR YOU\n\nOUR INVENTIONS HAVE REVOLUTIONIZED ENERGY FOR OVER A CENTURY. BUT TO KEEP GOING FORWARD TOMORROW, WE KNOW WE HAVE TO PUSH THE BOUNDARIES TODAY. WE PRIORITIZE REWARDING THOSE WHO EMBRACE CHANGE WITH A PACKAGE THAT REFLECTS HOW MUCH WE VALUE THEIR INPUT. JOIN US, AND YOU CAN EXPECT:\n\n\nCONTEMPORARY WORK-LIFE BALANCE POLICIES AND WELLBEING ACTIVITIESCOMPREHENSIVE PRIVATE MEDICAL CARE OPTIONSSAFETY NET OF LIFE INSURANCE AND DISABILITY PROGRAMSTAILORED FINANCIAL PROGRAMSEDUCATION ASSISTANCEGENEROUS PARENTAL LEAVEMENTAL HEALTH RESOURCESDEPENDENT CAREADDITIONAL ELECTED OR VOLUNTARY BENEFIT\n\n\nABOUT US:\n\nWE ARE AN ENERGY TECHNOLOGY COMPANY THAT PROVIDES SOLUTIONS TO ENERGY AND INDUSTRIAL CUSTOMERS WORLDWIDE. BUILT ON A CENTURY OF EXPERIENCE AND CONDUCTING BUSINESS IN OVER 120 COUNTRIES, OUR INNOVATIVE TECHNOLOGIES AND SERVICES ARE TAKING ENERGY FORWARD – MAKING IT SAFER, CLEANER AND MORE EFFICIENT FOR PEOPLE AND THE PLANET.\n\nJOIN US:\n\nARE YOU SEEKING AN OPPORTUNITY TO MAKE A REAL DIFFERENCE IN A COMPANY THAT VALUES INNOVATION AND PROGRESS? JOIN US AND BECOME PART OF A TEAM OF PEOPLE WHO WILL CHALLENGE AND INSPIRE YOU! LET’S COME TOGETHER AND TAKE ENERGY FORWARD.\n\nBAKER HUGHES COMPANY IS AN EQUAL OPPORTUNITY EMPLOYER. EMPLOYMENT DECISIONS ARE MADE WITHOUT REGARD TO RACE, COLOR, RELIGION, NATIONAL OR ETHNIC ORIGIN, SEX, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, AGE, DISABILITY, PROTECTED VETERAN STATUS OR OTHER CHARACTERISTICS PROTECTED BY LAW.\n\nR110599",
    "job_skill_set": [
      "sales growth",
      "market analysis",
      "product knowledge",
      "communication",
      "teamwork",
      "problem solving",
      "adaptability",
      "leadership",
      "customer service",
      "collaboration",
      "customer relationship management",
      "manufacturing processes",
      "technical documentation",
      "safety compliance",
      "data analysis",
      "time management"
    ],
    "short_keywords": [
      "adaptability",
      "aftermarket",
      "analysis",
      "collaboration",
      "communication",
      "compliance",
      "customer",
      "data",
      "documentation",
      "growth",
      "knowledge",
      "leadership",
      "management",
      "manager",
      "manufacturing",
      "market",
      "problem",
      "processes",
      "product",
      "programs",
      "relationship",
      "safety",
      "sales",
      "service",
      "solving",
      "sr",
      "teamwork",
      "technical",
      "time"
    ]
  }
]