[
  {
    "job_id": "3887107156",
    "job_title": "Human Resource Administrator",
    "category": "HR",
    "job_description": "EMPLOYMENT TYPE: CONTRACT TO HIRE LOCATION: SYRACUSE, NY HOURS: M-F 8AM-4PM\n\n MUST-HAVE: PRIOR HR KNOWLEDGE AND ATTENTION TO DETAIL. \n THE OPPORTUNITY: \n THE HUMAN RESOURCES TEMP WILL ASSIST THE SR. HR GENERALIST IN SUPPORTING HUMAN RESOURCES INITIATIVES AT THE COMPANY PAPERMILL IN SOLVAY. THIS POSITION WILL ASSIST WITH VARIOUS ADMINISTRATIVE TASKS, ANSWERING EMPLOYEE QUESTIONS, PREPARING FOR NEW HIRE ORIENTATIONS, SCHEDULING INTERVIEWS, AND SUPPORTING EMPLOYEE RELATIONS INITIATIVES WITHIN A NON-UNION ENVIRONMENT. THIS PERSON WILL APPLY COMPREHENSIVE HR KNOWLEDGE TO ASSIST WITH THE COMPLETION OF HR TASKS AND PROJECTS AS ASSIGNED. \n HOW YOU WILL IMPACT COMPANY: \n · SUPPORT EMPLOYEES WITH COMPANY’S LEAVE MANAGEMENT PROCESS: FMLA, DBL, PFL.  · ASSIST MILL EMPLOYEES BY ANSWERING BASIC HR QUESTIONS. THIS WILL INCLUDE UTILIZING HRIS SOFTWARE AND RUNNING BASIC REPORTS.  · BUILD TRUST AND POSITIVE EMPLOYEE RELATIONSHIPS WITH MILL PERSONNEL, UPHOLDING COMPANY’S COMPANY VALUES OF INTEGRITY, RESPECT, ACCOUNTABILITY, AND EXCELLENCE.  · EFFECTIVELY DOCUMENT PERSONNEL MATTERS AND COMMUNICATE/ESCALATE EMPLOYEE ISSUES OR CONCERNS TO SR. HR GENERALIST AS NEEDED.  · ONBOARDING AND RECRUITING SUPPORT.  · HELP COORDINATE EMPLOYEE EVENTS.  · HR ADMINISTRATIVE DUTIES AND PROJECTS AS ASSIGNED.  · SUPPORT LEARNING & DEVELOPMENT TEAM WITH PROJECTS AND INITIATIVES AS ASSIGNED. \n WHAT YOU NEED TO SUCCEED: \n · MINIMUM OF 1 YEAR OF HR-RELATED EXPERIENCE REQUIRED, HR EXPERIENCE IN A MANUFACTURING ENVIRONMENT PREFERRED.  · PRIOR KNOWLEDGE OF LEAVE MANAGEMENT SUCH AS FMLA, DBL, PFL, HIPAA.  · PRIOR KNOWLEDGE OF LOCAL, STATE, AND FEDERAL LEGAL REQUIREMENTS AND GUIDELINES.  · POSITIVE ATTITUDE AND WILLINGNESS TO HELP COWORKERS WITH QUESTIONS AND REQUESTS.  · EXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLS.  · SELF-MOTIVATED, ORGANIZED, AND STRONG ATTENTION TO DETAIL.",
    "job_skill_set": [
      "HR knowledge",
      "HRIS software",
      "onboarding",
      "recruiting",
      "administrative tasks",
      "reporting",
      "attention to detail",
      "communication",
      "teamwork",
      "self-motivation",
      "organization",
      "problem solving",
      "leave management (FMLA, DBL, PFL)",
      "local, state, and federal legal requirements",
      "positive attitude"
    ],
    "short_keywords": [
      "administrative",
      "administrator",
      "and",
      "attention",
      "attitude",
      "communication",
      "dbl",
      "detail",
      "federal",
      "fmla",
      "hr",
      "hris",
      "human",
      "knowledge",
      "leave",
      "legal",
      "local",
      "management",
      "onboarding",
      "organization",
      "pfl",
      "positive",
      "problem",
      "recruiting",
      "reporting",
      "requirements",
      "resource",
      "selfmotivation",
      "software",
      "solving",
      "state",
      "tasks",
      "teamwork",
      "to"
    ]
  },
  {
    "job_id": "3884819780",
    "job_title": "VP Human Resources-PST Segment",
    "category": "HR",
    "job_description": "ABOUT US\n\nINGERSOLL RAND THRIVES ON A CULTURE OF INNOVATION AND A SENSE OF OWNERSHIP, COMMITTED TO ENHANCING THE LIVES OF OUR EMPLOYEES, CUSTOMERS, AND THE PLANET. WITH OVER 80 RENOWNED BRANDS, OUR CUSTOMERS RELY ON OUR PRODUCTS AND SERVICES TO DELIVER HIGH-QUALITY FLOW CREATION AND INDUSTRIAL SOLUTIONS DESIGNED TO PERFORM IN THE MOST COMPLEX AND HARSH CONDITIONS. ADDITIONALLY, OUR UNWAVERING COMMITMENT TO OWNERSHIP HAS ENABLED OUR EMPLOYEES TO CULTIVATE STRONG CUSTOMER RELATIONSHIPS, DRIVING THEM TO SOLVE THE INDUSTRY’S MOST DIFFICULT PROBLEMS.\n\nJOB SUMMARY\n\nREPORTING DIRECTLY TO THE CHRO AND FUNCTIONALLY TO THE SVP OF INGERSOLL RAND’S PRECISION & SCIENCE TECHNOLOGIES (PST) SEGMENT, THE VICE PRESIDENT OF HUMAN RESOURCES – PST SEGMENT WILL SPEARHEAD AND MANAGE ALL HR ASPECTS FOR AN $1.3B GLOBAL, RAPIDLY GROWING BUSINESS SEGMENT WITH 4,000+ ASSOCIATES.\n\nIN THIS ROLE, YOU WILL SERVE AS A CRITICAL BUSINESS PARTNER AND STRATEGIST ON THE LEADERSHIP TEAM FOR THE PST SEGMENT, AND ON THE INGERSOLL RAND HR LEADERSHIP TEAM. YOU WILL CLOSELY PARTNER WITH PST BUSINESS LEADERS TO CONTINUE THE RAPID GROWTH (ORGANICALLY & INORGANICALLY), WHILE ENSURING CONTINUOUS IMPROVEMENT IN CRITICAL AREAS SUCH AS ENGAGEMENT, TALENT DEVELOPMENT, CULTURE, DIVERSITY-EQUITY-INCLUSION, AND ORGANIZATIONAL EFFECTIVENESS. ADDITIONALLY, YOU WILL OVERSEE A TEAM OF HR PROFESSIONALS, AS THEY DELIVER HIGH-QUALITY HR SOLUTIONS FOR LEADERS, MANAGERS, AND ASSOCIATES.\n\nRESPONSIBILITIES\n\nEFFECTIVELY PARTNER WITH PST BUSINESS LEADERS TO DRIVE POSITIVE, BUSINESS-IMPACTING CHANGE, ALIGNING HUMAN RESOURCES PROGRAMS AND INITIATIVES WITH STRATEGIC OBJECTIVES AND ANNUAL OPERATING PLANS. SERVE AS A PERFORMANCE COACH FOR PST BUSINESS LEADERS TO ENSURE THE TEAM IS HIGHLY EFFECTIVE IN IMPROVING ORGANIZATIONAL CAPABILITY AND IS CONTINUING TO WIN IN THE MARKETPLACE. DRIVE HR ASPECTS OF MERGERS & ACQUISITIONS, INCLUDING PIPELINE FORMATION, DUE DILIGENCE, PLANNING & EXECUTION, AND EFFECTIVE INTEGRATION OF ACQUIRED COMPANIES. SUPERVISE A TEAM OF HR PROFESSIONALS IN DELIVERING EFFECTIVE HR EXECUTION GLOBALLY. MANAGE AND DEVELOP CAPABILITIES OF THE HR TEAM TO SUPPORT BUSINESS INITIATIVES AND TO ENSURE DEVELOPMENT OF HR TALENT COLLABORATE WITH HR LEADERSHIP TEAM COLLEAGUES TO SET DIRECTION FOR THE HR-TALENT STRATEGIES FOR THE COMPANY. \n\nBASIC QUALIFICATIONS\n\nBACHELOR’S DEGREE FROM AN ACCREDITED INSTITUTION IS REQUIRED. MASTER’S DEGREE (MBA, MASTER’S IN HR, ETC.) IS PREFERRED, BUT NOT REQUIRED. HR CERTIFICATIONS ARE ALSO A STRONG PLUS. MINIMUM OF 10 YEARS OF INCREASING RESPONSIBILITY IN A PROGRESSIVE HR ENVIRONMENT. MINIMUM OF 5 YEARS LEADING EXPERIENCED HR LEADERS. DEMONSTRATED EXPERTISE IN BUILDING TALENT, ENGAGING TEAMS, DRIVING CULTURE CHANGE AND STRATEGIC GROWTH OF BUSINESSES AND ORGANIZATIONS. DIRECT EXPERIENCE SUPPORTING MULTIPLE BUSINESSES IN A GLOBAL MATRIX ENVIRONMENT. DIRECT EXPERIENCE LEADING HR TEAMS IN EUROPE. DEMONSTRATED SUCCESS IN CREATING AN ENVIRONMENT OF TRUST WITH BUSINESS PARTNERS WHERE INTEGRITY IS UNQUESTIONED. EXCELLENT INTERPERSONAL, INFLUENCING AND COMMUNICATIONS SKILLS. KNOWLEDGE OF RELEVANT LOCAL/STATE/FEDERAL/PROVINCIAL EMPLOYMENT LAWS. MUST BE AUTHORIZED TO WORK IN THE US WITHOUT COMPANY SPONSORSHIP. \n\nTRAVEL & WORK ARRANGEMENTS/REQUIREMENTS\n\nTHIS WILL BE A REMOTELY BASED POSITION WITH ANTICIPATED TRAVEL OF UP TO 50%.\n\nKEY COMPETENCIES\n\nPRIOR EXPERIENCE IN AN INDUSTRIAL COMPANY. EXPERIENCE LEADING THE HR ASPECTS OF MERGERS & ACQUISITIONS. DIRECT EXPERIENCE IN MANUFACTURING AND COMMERCIAL ENVIRONMENTS. \n\n\n\nWHAT WE OFFER\n\nAT INGERSOLL RAND, WE EMBRACE A CULTURE OF PERSONAL OWNERSHIP — TAKING RESPONSIBILITY FOR OUR COMPANY, OUR COMMUNITIES, AND OUR ENVIRONMENT, AS WELL AS OUR INDIVIDUAL HEALTH AND WELL-BEING. OUR COMPREHENSIVE BENEFITS PACKAGE IS DESIGNED TO EMPOWER YOU WITH THE TOOLS AND SUPPORT NECESSARY TO TAKE CHARGE OF YOUR HEALTH, ENSURING THAT TOGETHER, WE CAN CONTINUE TO MAKE LIFE BETTER. OUR RANGE OF BENEFITS INCLUDES HEALTH CARE OPTIONS LIKE MEDICAL AND PRESCRIPTION PLANS, DENTAL AND VISION COVERAGE, AS WELL AS WELLNESS PROGRAMS. ADDITIONALLY, WE PROVIDE LIFE INSURANCE, A ROBUST 401(K) PLAN, PAID TIME OFF, AND EVEN AN EMPLOYEE STOCK GRANT, AMONG OTHER OFFERINGS. THESE BENEFITS ARE OUR COMMITMENT TO YOU, SO YOU CAN BE YOUR BEST AT WORK AND BEYOND.\n\n",
    "job_skill_set": [
      "HR Management",
      "Talent Development",
      "Employment Law",
      "Strategic Planning",
      "Team Leadership",
      "Organizational Effectiveness",
      "HR Certifications",
      "Communication",
      "Interpersonal Skills",
      "Influencing",
      "Problem Solving",
      "Cultural Awareness",
      "Coaching",
      "Collaboration",
      "Integrity",
      "Mergers & Acquisitions",
      "Global HR Experience"
    ],
    "short_keywords": [
      "acquisitions",
      "awareness",
      "certifications",
      "coaching",
      "collaboration",
      "communication",
      "cultural",
      "development",
      "effectiveness",
      "employment",
      "experience",
      "global",
      "hr",
      "human",
      "influencing",
      "integrity",
      "interpersonal",
      "law",
      "leadership",
      "management",
      "mergers",
      "organizational",
      "planning",
      "problem",
      "resourcespst",
      "segment",
      "skills",
      "solving",
      "strategic",
      "talent",
      "team",
      "vp"
    ]
  },
  {
    "job_id": "3901167325",
    "job_title": "Human Resources Specialist",
    "category": "HR",
    "job_description": "WE ARE SEEKING AN EXPERIENCED HUMAN RESOURCES PROFESSIONAL TO WORK FOR OUR MAJOR CLIENT, A GLOBAL CHEMICAL MANUFACTURER BASED IN THE BEAUMONT AREA. \nTHIS IS A VERY STRATEGIC POSITION SINCE IT'S A NEW HIRE AND WILL BE RESPONSIBLE FOR DEVELOPING AND IMPLEMENTING HR STRATEGIES, POLICIES, AND PROCEDURES TAILORED SPECIFICALLY TO THE DEMANDS AND CHALLENGES OF A CHEMICAL MANUFACTURING ENVIRONMENT. \nRESPONSIBILITIES: \nRECRUITMENT: OVERSEE RECRUITMENT EFFORTS, INCLUDING SOURCING, SCREENING, AND ONBOARDING OF PERSONNEL, WITH A FOCUS ON SAFETY, QUALITY, AND PRODUCTIVITY.\nEMPLOYEE RELATIONS: SERVE AS A TRUSTED ADVISOR AND ADVOCATE FOR EMPLOYEES, THE INCUMBENT WILL ADDRESS EMPLOYEE CONCERNS, CONFLICTS, AND GRIEVANCES IN A FAIR AND TIMELY MANNER. \nCOMPENSATION: COORDINATION AND IMPLEMENTATION OF THE EMPLOYEE BENEFITS PROGRAMS; ASSISTS IN THE COMMUNICATION OF BENEFITS, KNOWLEDGEABLE OF BENEFIT TRENDS AND NEW OPTIONS, RECOMMENDS BENEFIT PROGRAMS, ENSURES COMPLIANCE WITH PROCESSING OF OFFERED BENEFIT ENROLLMENTS AND CLAIMS AS WELL AS PROTECTED LEAVE MANAGEMENT. \nGENERAL: ENHANCE THE ORGANIZATION’S HUMAN CAPITAL BY PLANNING, IMPLEMENTING, AND EVALUATING EMPLOYEE RELATIONS AND HUMAN RESOURCES POLICIES, PROGRAMS, TRAINING AND PRACTICES. \nREQUIREMENTS: \nBACHELORS IN HUMAN RESOURCES OR EQUIVALENT RELEVANT EXPERIENCEOVER 7 YEARS OF PROGRESSIVE HUMAN RESOURCES EXPERIENCEPROFICIENT WITH MS OFFICE SUITEPREFERRED PHR/SPHR/SHRM-CP/SHRM-SCP CERTIFICATION",
    "job_skill_set": [
      "recruitment",
      "employee relations",
      "HR policies and procedures",
      "communication",
      "problem solving",
      "conflict resolution",
      "advisory skills",
      "strategic thinking",
      "teamwork",
      "HR strategies",
      "compensation management",
      "MS Office Suite",
      "benefits administration",
      "PHR/SPHR/SHRM-CP/SHRM-SCP certification"
    ],
    "short_keywords": [
      "administration",
      "advisory",
      "and",
      "benefits",
      "certification",
      "communication",
      "compensation",
      "conflict",
      "employee",
      "hr",
      "human",
      "management",
      "ms",
      "office",
      "phrsphrshrmcpshrmscp",
      "policies",
      "problem",
      "procedures",
      "recruitment",
      "relations",
      "resolution",
      "resources",
      "skills",
      "solving",
      "specialist",
      "strategic",
      "strategies",
      "suite",
      "teamwork",
      "thinking"
    ]
  },
  {
    "job_id": "3905878349",
    "job_title": "Human Resources Business Partner",
    "category": "HR",
    "job_description": "JOB SUMMARY: \n\nTHE HR BUSINESS PARTNER WILL CONTRIBUTE AT BOTH HANDS-ON AND STRATEGIC LEVELS TO CULTIVATE A CULTURE FOCUSED ON SAFETY, RESPECT, AND BUSINESS EXCELLENCE. THE IDEAL CANDIDATE WILL THOUGHT-PARTNER, COACH, AND COLLABORATE TO BRING CREATIVE AND EFFECTIVE IDEAS AND SOLUTIONS TO THE OPERATIONS ORGANIZATION. THE HR BUSINESS PARTNER WILL MAINTAIN A PRODUCTIVE RELATIONSHIP WITH THE UNION IN THE MUTUALLY BENEFICIAL INTEREST OF EMPLOYEES.\n\nESSENTIAL FUNCTIONS: \n\nSAFETY: \n\nEMBRACE THE VALUES OF THE ENPRO SAFETY PLEDGE IN EACH OF THE BELOW RESPONSIBILITIES. PARTICIPATE IN THE ORGANIZATION’S SAFETY CULTURE AND AIM TO CONTINUOUSLY IMPROVE SAFETY WITHIN ALL ASPECTS OF YOUR WORK. \n\nRESPECT: \n\nFOSTER A WORK ENVIRONMENT THAT PROMOTES MUTUAL RESPECT OF ALL COLLEAGUES AND CREATES AN ENVIRONMENT FOCUSED ON A DUAL-BOTTOM LINE. \n\nEXCELLENCE: \n\nPROMOTE THE SEALING TECHNOLOGIES AND ENPRO CULTURE AROUND CREATING VALUE AND DRIVING EXCELLENCE IN OUR ORGANIZATION BY: \n\nDESIGN AND DELIVER TARGETED SOLUTIONS WITH A HIGH DEGREE OF FOCUS ON BUSINESS EXPANSION AND OPTIMIZATION, INCLUDING STRATEGIC PLANNING, TALENT ACQUISITION AND MANAGEMENT, DEVELOPMENT, CHANGE MANAGEMENT AND EMPLOYEE RELATIONS.  PROVIDE STRATEGIC BUSINESS PARTNERSHIP, THOUGHT PARTNERSHIP, AND COACHING TO ALL LEVELS OF THE ORGANIZATION.  PROACTIVELY ASSESS TEAM, MANAGER, ORGANIZATIONAL DEVELOPMENT NEEDS, MAKE RECOMMENDATIONS, AND IMPLEMENT APPROPRIATE SOLUTIONS.  ANALYZE TRENDS, MARKET DATA, AND METRICS TO PROPOSE SOLUTIONS BASED ON BUSINESS NEEDS  DRIVE TALENT MANAGEMENT STRATEGIES TO SUPPORT A TEAM’S GROWTH AND INDIVIDUAL DEVELOPMENT PLANS  PARTNER CLOSELY WITH SITE HR PARTNERS ON OVERALL HR BUSINESS STRATEGY AND EXECUTION  WORK CLOSELY WITH OUR OPERATIONS LEADERSHIP TEAM AND UNION LEADERS TO SUPPORT EMPLOYEE RELATIONS ISSUES. SERVES AS COMPANY REPRESENTATIVE FOR UNION-RELATED MATTERS INCLUDING PROACTIVE COMMUNICATION WITH UNION, PARTNERING ON MUTUAL COMPANY AND UNION INTERESTS AND SERVES AS ESCALATION POINT IN THE GRIEVANCE PROCESS. ACTS AS A SHEPHERD OF THE COLLECTIVE BARGAINING AGREEMENT IN PARTNERSHIP WITH LABOR RELATIONS COORDINATOR. IDENTIFIES ORGANIZATIONAL NEEDS, DETERMINES STRATEGY AND FACILITATES WORKFORCE PLANNING AND PERFORMANCE INTEGRATES BEST PRACTICES TO ENHANCE THE EFFICIENCY AND EFFECTIVENESS OF THE DELIVERY OF HR SERVICES TO BUSINESS UNITS. RESPONSIBILITIES SPAN ALL ASPECTS OF HR TO INCLUDE : TALENT MANAGEMENT AND WORKFORCE PLANNING, PERFORMANCE MANAGEMENT, EMPLOYEE RELATIONS, ORGANIZATIONAL DEVELOPMENT, EMPLOYEE DEVELOPMENT, AND SUCCESSION PLANNING PARTICIPATE AND LEAD PROJECTS AS AN INTEGRAL MEMBER OF THE EXTENDED HR TEAM   \n\n\n \n\n \n\nREQUIREMENTS: \n\nDEMONSTRATED EXPERIENCE SUPPORTING A UNION ENVIRONMENT. DEMONSTRATES SOLID JUDGMENT AND EXPERIENCE ASSESSING RISK RELATIVE TO THE BUSINESS  EFFECTIVE COMMUNICATION AND CRITICAL THINKING SKILLS  DEMONSTRATES EMPATHY AND EXPERIENCE DRIVING INCLUSION WORK  DEMONSTRATED PROJECT MANAGEMENT AND CHANGE MANAGEMENT EXPERIENCE  DEMONSTRATED EXPERIENCE LEARNING AND THRIVING IN A CONSTANTLY CHANGING ENVIRONMENT AND TO CULTIVATE RELATIONSHIPS ACROSS TEAMS  SOLID EXPERIENCE USING DATA TO IDENTIFY TRENDS THAT DRIVE ACTION  EXPERIENCE HELPING GLOBAL AND/OR MATRIXED ORGANIZATIONS  DEMONSTRATED EXPERIENCE IN INFLUENCING AND STRATEGICALLY SOLVING PROBLEMS  COACHING FACILITATION SKILLS AND EXPERIENCE  \n\n\nMINIMUM EDUCATION:  BACHELOR’S DEGREE IN HUMAN RESOURCES, MANAGEMENT, I/O PSYCHOLOGY, OR RELATED FIELD OR EQUIVALENT.  PHR OR SHRM- CP CERTIFIED PREFERRED \n\nMINIMUM EXPERIENCE:  5-7 YEARS OF HUMAN RESOURCES EXPERIENCE WITH A DEMONSTRATED PROGRESSIVELY INCREASING SCOPE AND LEVEL OF RESPONSIBILITIES. A MINIMUM OF 3 YEARS OF EXPERIENCE SERVING A UNION POPULATION. HR EXPERIENCE IN A MANUFACTURING ENVIRONMENT IS PREFERRED.\n\nEEO AND CULTURE STATEMENT: \n\nENPRO IS A LEADING PROVIDER OF ENGINEERED INDUSTRIAL PRODUCTS FOR THE PROCESSING AND GENERAL MANUFACTURING INDUSTRIES WORLDWIDE. THE COMPANY OPERATES IN TWO SEGMENTS: SEALING PRODUCTS, ADVANCED SURFACE TECHNOLOGIES, AND ENGINEERED MATERIALS.  \n\nSEALING TECHNOLOGIES-SAFEGUARDING CRITICAL ENVIRONMENTS \n\nCOMPOSED OF GARLOCK, STEMCO, AND TECHNETICS GROUP, THESE BUSINESSES LEVERAGE A HIGH DEGREE OF MATERIALS SCIENCE APPLICATION EXPERTISE, EXTENSIVE PROPRIETARY KNOWLEDGE, AND DEEP CUSTOMER RELATIONSHIPS TO CREATE INNOVATIVE SEALING SOLUTIONS COMPLEMENTED BY VALUE-ADDED SYSTEMS INTEGRATION. \n\nENPRO INDUSTRIES IS AN EQUAL OPPORTUNITY EMPLOYER. LEGAL AUTHORIZATION TO WORK IN THE UNITED STATES IS REQUIRED. WE WILL NOT SPONSOR EMPLOYMENT VISAS NOW OR IN THE FUTURE FOR THIS JOB. \n\nENPRO CAREFULLY CONSIDERS A WIDE RANGE OF COMPENSATION FACTORS INCLUDING THE BACKGROUND, EDUCATION, TRAINING, AND EXPERIENCE REQUIRED, AS WELL AS GEOGRAPHIC CONSIDERATIONS SUCH AS COST OF LABOR, AND APPLICABLE LOCAL AND STATE LAWS. THESE CONSIDERATIONS CAN CAUSE OFFERED COMPENSATION TO VARY. THE HIRING RANGE FOR THIS POSITION IS TYPICALLY $61,000 TO $99,000 ANNUALLY. ACTUAL OFFER WILL BE BASED ON THE INDIVIDUAL CANDIDATE. ENPRO OFFERS A RANGE OF BENEFITS INCLUDING, BUT NOT LIMITED TO MEDICAL, DENTAL, VISION, LIFE, 401(K) MATCHING, AND OTHER SUPPLEMENTAL INSURANCE OPTIONS.",
    "job_skill_set": [
      "talent acquisition",
      "employee relations",
      "organizational development",
      "performance management",
      "coaching",
      "HR metrics",
      "communication",
      "collaboration",
      "critical thinking",
      "problem solving",
      "relationship building",
      "adaptability",
      "creativity",
      "coaching facilitation",
      "teamwork",
      "union relations",
      "project management",
      "change management",
      "data analysis",
      "succession planning",
      "strategic planning",
      "HR policies",
      "risk assessment",
      "workforce planning",
      "empathy",
      "influence"
    ],
    "short_keywords": [
      "acquisition",
      "adaptability",
      "analysis",
      "assessment",
      "building",
      "business",
      "change",
      "coaching",
      "collaboration",
      "communication",
      "creativity",
      "critical",
      "data",
      "development",
      "empathy",
      "employee",
      "facilitation",
      "hr",
      "human",
      "influence",
      "management",
      "metrics",
      "organizational",
      "partner",
      "performance",
      "planning",
      "policies",
      "problem",
      "project",
      "relations",
      "relationship",
      "resources",
      "risk",
      "solving",
      "strategic",
      "succession",
      "talent",
      "teamwork",
      "thinking",
      "union",
      "workforce"
    ]
  },
  {
    "job_id": "3904986478",
    "job_title": "Human Resources Generalist",
    "category": "HR",
    "job_description": "THE HR GENERALIST IS RESPONSIBLE FOR TALENT ACQUISITION, MANAGING THE ONBOARDING PROCESS, AND FOSTERING POSITIVE EMPLOYEE RELATIONS WITHIN THE COMPANY. THIS ROLE REQUIRES A STRONG UNDERSTANDING OF HR PRINCIPLES AND PRACTICES, EXCELLENT COMMUNICATION SKILLS, AND THE ABILITY TO BUILD RELATIONSHIPS ACROSS ALL LEVELS OF THE ORGANIZATION.\n\nRESPONSIBILITIES \n\nTALENT ACQUISITIONDEVELOP AND IMPLEMENT RECRUITMENT PLANS TO ATTRACT TOP TALENT.MANAGE THE FULL RECRUITMENT CYCLE, INCLUDING JOB POSTINGS, SCREENING RESUMES, CONDUCTING INTERVIEWS, AND MAKING HIRING DECISIONS.COLLABORATE WITH HIRING MANAGERS TO UNDERSTAND STAFFING NEEDS AND PROVIDE GUIDANCE THROUGHOUT THE HIRING PROCESS.UTILIZE VARIOUS RECRUITING CHANNELS, INCLUDING JOB BOARDS, SOCIAL MEDIA, AND NETWORKING EVENTS, TO SOURCE QUALIFIED CANDIDATES.ONBOARDINGFACILITATE THE ONBOARDING PROCESS FOR NEW HIRES, ENSURING A SMOOTH TRANSITION INTO THE ORGANIZATION.COORDINATE NEW HIRE ORIENTATION SESSIONS TO FAMILIARIZE EMPLOYEES WITH COMPANY POLICIES, PROCEDURES, AND CULTURE.WORK CLOSELY WITH CROSS-FUNCTIONAL TEAMS TO ENSURE NEW EMPLOYEES HAVE THE NECESSARY RESOURCES AND SUPPORT TO SUCCEED IN THEIR ROLES.CONDUCT CHECK-INS WITH NEW HIRES TO ADDRESS ANY QUESTIONS OR CONCERNS AND PROVIDE ONGOING SUPPORT AS NEEDED. EMPLOYEE RELATIONSSERVE AS A TRUSTED ADVISOR TO EMPLOYEES AND MANAGEMENT ON HR-RELATED ISSUES.ADDRESS EMPLOYEE CONCERNS AND COMPLAINTS IN A TIMELY AND PROFESSIONAL MANNER, STRIVING TO RESOLVE CONFLICTS EFFECTIVELY.CONDUCT INVESTIGATIONS INTO EMPLOYEE RELATIONS ISSUES, INCLUDING BUT NOT LIMITED TO HARASSMENT ALLEGATIONS, PERFORMANCE CONCERNS, AND POLICY VIOLATIONS.RECOMMEND AND IMPLEMENT SOLUTIONS TO PROMOTE A POSITIVE AND INCLUSIVE WORK ENVIRONMENT.\n\nQUALIFICATIONS\n\nBACHELOR’S DEGREE IN HUMAN RESOURCES, BUSINESS ADMINISTRATION, OR RELATED FIELD.MINIMUM OF 3 YEARS OF PROGRESSIVE EXPERIENCE IN HR ROLES, WITH A FOCUS ON TALENT ACQUISITION, ONBOARDING, AND EMPLOYEE RELATIONS.STRONG KNOWLEDGE OF EMPLOYMENT LAWS AND REGULATIONS.EXCELLENT INTERPERSONAL AND COMMUNICATION SKILLS, WITH THE ABILITY TO BUILD RAPPORT AND COLLABORATE EFFECTIVELY WITH DIVERSE TEAMS.PROVEN ABILITY TO MANAGE MULTIPLE PRIORITIES AND MEET DEADLINES IN A FAST-PACED ENVIRONMENT.DETAIL-ORIENTED WITH STRONG ORGANIZATIONAL AND PROBLEM-SOLVING SKILLS.HR CERTIFICATION (E.G., SHRM-CP, PHR) IS PREFERRED BUT NOT REQUIRED.\n\nAPPLY NOW",
    "job_skill_set": [
      "Talent Acquisition",
      "Onboarding",
      "Employee Relations",
      "HR Principles and Practices",
      "Employment Laws and Regulations",
      "HR Certification (e.g., SHRM-CP, PHR)",
      "Communication",
      "Interpersonal Skills",
      "Relationship Building",
      "Problem Solving",
      "Organizational Skills",
      "Time Management"
    ],
    "short_keywords": [
      "acquisition",
      "and",
      "building",
      "certification",
      "communication",
      "eg",
      "employee",
      "employment",
      "generalist",
      "hr",
      "human",
      "interpersonal",
      "laws",
      "management",
      "onboarding",
      "organizational",
      "phr",
      "practices",
      "principles",
      "problem",
      "regulations",
      "relations",
      "relationship",
      "resources",
      "shrmcp",
      "skills",
      "solving",
      "talent",
      "time"
    ]
  },
  {
    "job_id": "3905863460",
    "job_title": "Talent Acquisition Specialist (Human Resources Coordinator II)",
    "category": "HR",
    "job_description": "ACCOUNTABLE. RESPECTFUL. ETHICAL.WE A.R.E. PIMA COUNTY! POSITION: TALENT ACQUISITION SPECIALIST (HUMAN RESOURCES COORDINATOR II)  DEPARTMENT: HUMAN RESOURCES  PAY RANGE: HIRING RANGE: $57,607 - $69,128 ANNUALLYFULL RANGE: $57,607 - $80,649 ANNUALLY SALARY OFFERS ARE BASED ON THE CANDIDATE'S EQUIVALENT EXPERIENCE AND INTERNAL EQUITY WITH OTHER EMPLOYEES WITHIN THE SAME JOB CLASSIFICATION.   THE PIMA COUNTY HUMAN RESOURCES DEPARTMENT IS A TEAM OF DEDICATED HR PROFESSIONALS COMMITTED TO PROVIDING INNOVATIVE CUSTOMER SERVICE TO OUR DIVERSE COMMUNITY. WE ARE SEARCHING FOR A CREATIVE INDIVIDUAL WHO CAN CONTRIBUTE TO DEVELOPING CUTTING-EDGE RECRUITMENT SOLUTIONS FOR THE MODERN CHALLENGES FACED BY GOVERNMENTS. WE ARE SEEKING A TALENT ACQUISITION SPECIALIST WHO WILL ACT AS A CATALYST FOR CHANGE, WORKING COLLABORATIVELY TO BRING OPPORTUNITIES TO THE COMMUNITY AND ELEVATE OUR RECRUITMENT PROCESSES TO NEW HEIGHTS. AS A PIMA COUNTY CULTURAL ADVOCATE, YOU WILL EFFECTIVELY CONVEY WHAT WE ALREADY KNOW - PIMA COUNTY IS THE PLACE TO WORK! DUTIES AND RESPONSIBILITIES MAY INCLUDE: CONDUCTS SPECIAL STUDIES AS ASSIGNED, ANALYZES DATA AND FINDINGS, DEVELOPS RECOMMENDATIONS, AND MAKES PRESENTATIONS TO MANAGEMENT; MAKES RECOMMENDATIONS ON NEW AND/OR REVISED HUMAN RESOURCES PRACTICES AND PROCEDURES; CONDUCTS INTERNAL AND EXTERNAL SURVEYS AND STUDIES; REVIEWS, COMPARES AND ANALYZES DATA; CREATES QUESTIONNAIRES OR SURVEY TOOLS TO GATHER DATA; COLLABORATES AND FOLLOWS UP TO COMPLETION; COMPLETES AND RESPONDS TO EXTERNAL SURVEYS OR OTHER RELATED INQUIRES; PROVIDES INPUT TO SUPERVISORS AND MANAGEMENT IN LONG- AND SHORT-TERM PLANNING, GOALS AND OBJECTIVES RELATED TO THE AREA OF ASSIGNMENT; MAINTAINS APPROPRIATE CONFIDENTIALITY OF ALL MATERIALS AND INFORMATION ENCOUNTERED IN PERFORMANCE OF DUTIES; MAINTAINS CURRENT KNOWLEDGE OF ALL FEDERAL, STATE, LOCAL STATUTES/REGULATIONS, POLICIES AND PROCEDURES RELATING TO AREA OF ASSIGNMENT; REPRESENTS HUMAN RESOURCES MANAGEMENT OR ASSIGNED WORK UNIT WHEN DIRECTED, AT VARIOUS MEETINGS; PARTICIPATES IN PROFESSIONAL TRAINING MEETINGS, SEMINARS, CONFERENCES, ETC., TO STAY CURRENT OF LAW AND BEST PRACTICES IN THE FIELD OF HUMAN RESOURCES; MAY CONDUCT TRAINING AND INFORMATION SESSIONS, USING MULTIPLE MODALITIES; MAY COORDINATE, PARTICIPATE AND LEAD OTHER STAFF IN UNIQUE OR COMPLEX STUDIES, PROJECTS OR ASSIGNMENTS AS DIRECTED.\n TALENT ACQUISITION/RECRUITING:\nCOLLABORATES WITH THE COMMUNICATIONS DEPARTMENT IN THE CREATION OF THE PIMA COUNTY EMPLOYER BRAND; ASSISTS IN THE DEVELOPMENT OF THE PIMA COUNTY “BRAND” AWARENESS; UPDATES AND REVISES THE PIMA COUNTY HUMAN RESOURCES WEBSITE; ENSURES A POSITIVE CANDIDATE EXPERIENCE; SUPPORTS ASSIGNED COUNTY DEPARTMENTS WITH THEIR RECRUITMENT NEEDS; MAINTAINS A COLLABORATIVE RELATIONSHIP WITH COMMUNITY ORGANIZATIONS; CREATES AND CURATES SOCIAL MEDIA AND ADVERTISING CONTENT; DRIVES QUALIFIED APPLICANTS TO OPEN JOBS; MAINTAINS A TALENT NETWORK/TALENT COMMUNITY; ASSISTS WITH THE ORGANIZATION AND IMPLEMENTATION OF RECRUITING EVENTS; COORDINATES EMPLOYEE AMBASSADORS; GENERATES EMPLOYEE REFERRALS; TRACKS, MEASURES, AND REPORTS ON CAMPAIGN RESULTS (ANALYTICS); PROCESSES INVOICES FROM VENDORS AND AGENCIES. MINIMUM QUALIFICATIONS: (1) A BACHELOR’S DEGREE FROM AN ACCREDITED COLLEGE OR UNIVERSITY IN PUBLIC OR BUSINESS ADMINISTRATION, HUMAN RESOURCES MANAGEMENT OR OTHER CLOSELY RELATED FIELD AS DETERMINED BY THE APPOINTING AUTHORITY AT THE TIME OF RECRUITMENT AND TWO YEARS OF PROFESSIONAL-LEVEL HUMAN RESOURCES EXPERIENCE IN EITHER COMPENSATION/CLASSIFICATION, BENEFITS/WELLNESS PROGRAMS, HUMAN RESOURCES INFORMATION SYSTEMS, AND/OR TALENT ACQUISITION/RECRUITMENT. (ADDITIONAL RELEVANT EXPERIENCE OR EDUCATION FROM AN ACCREDITED COLLEGE OR UNIVERSITY MAY BE SUBSTITUTED.) OR (2) FIVE YEARS OF EXPERIENCE WITH PIMA COUNTY IN A PROFESSIONAL-LEVEL CLASSIFICATION PERFORMING HUMAN RESOURCES RESPONSIBILITIES. PREFERRED QUALIFICATIONS:\n1. MINIMUM ONE (1) YEAR OF RECRUITING EXPERIENCE.2. EXPERIENCE CREATING CONTENT FOR SOCIAL MEDIA POSTS, JOB BOARDS, AND ADVERTISEMENTS TO MARKET EMPLOYER BRAND.3. HRIS AND ATS EXPERIENCE (ADP, NEOGOV, WORKDAY).4. EXPERIENCE DEVELOPING AND MAINTAINING PERIODICAL REPORTING, DETAILING RECRUITMENT ACTIVITIES INCLUDING SOURCING, OFFERS, PREEMPLOYMENT STATUS, ETC.",
    "job_skill_set": [
      "Talent Acquisition",
      "Recruitment",
      "Data Analysis",
      "Project Management",
      "Collaboration",
      "Communication",
      "Customer Service",
      "Confidentiality",
      "Problem Solving",
      "Adaptability",
      "Creativity",
      "Teamwork",
      "Ethical Judgment",
      "Networking",
      "HRIS",
      "ATS",
      "Social Media Marketing",
      "Content Creation",
      "Survey Design",
      "Presentation Skills"
    ],
    "short_keywords": [
      "acquisition",
      "adaptability",
      "analysis",
      "ats",
      "collaboration",
      "communication",
      "confidentiality",
      "content",
      "coordinator",
      "creation",
      "creativity",
      "customer",
      "data",
      "design",
      "ethical",
      "hr",
      "hris",
      "human",
      "ii",
      "judgment",
      "management",
      "marketing",
      "media",
      "networking",
      "presentation",
      "problem",
      "project",
      "recruitment",
      "resources",
      "service",
      "skills",
      "social",
      "solving",
      "specialist",
      "survey",
      "talent",
      "teamwork"
    ]
  },
  {
    "job_id": "3905871298",
    "job_title": "Human Resources Manager",
    "category": "HR",
    "job_description": "ARE YOU AN EXPERIENCED HR PROFESSIONAL LOOKING FOR AN EXCITING OPPORTUNITY? LOOK NO FURTHER! OUR CLIENT, A GLOBAL COMPANY WITH A MANUFACTURING FACILITY IN COLUMBUS, INDIANA, IS SEEKING A DYNAMIC HR MANAGER TO JOIN THEIR TEAM.\nABOUT THE ROLE:AS THE HR MANAGER, YOU WILL PLAY A PIVOTAL ROLE IN OUR ORGANIZATION'S SUCCESS. REPORTING DIRECTLY TO THE GLOBAL HEAD OF HR AND WITH A DOTTED LINE TO THE PLANT MANAGER, YOU WILL LEAD A TEAM AND OVERSEE HR OPERATIONS FOR OUR 110 EMPLOYEES. THIS INCLUDES MANAGING AN HR GENERALIST AND OVERSEEING ADP PAYROLL PROCESSES.\nKEY RESPONSIBILITIES:- IMPLEMENT HR POLICIES AND PROCEDURES IN ALIGNMENT WITH COMPANY OBJECTIVES.- PROVIDE GUIDANCE AND SUPPORT TO MANAGEMENT AND EMPLOYEES ON HR-RELATED MATTERS.- LEAD RECRUITMENT EFFORTS, INCLUDING SOURCING, INTERVIEWING, AND ONBOARDING NEW TALENT.- MANAGE PERFORMANCE EVALUATION PROCESSES AND EMPLOYEE RELATIONS ISSUES.- OVERSEE PAYROLL ADMINISTRATION AND ENSURE ACCURACY AND COMPLIANCE.- DRIVE INITIATIVES TO ENHANCE EMPLOYEE ENGAGEMENT AND RETENTION.- COLLABORATE WITH GLOBAL HR TEAMS TO IMPLEMENT BEST PRACTICES AND INITIATIVES.\nREQUIREMENTS:- BACHELOR'S DEGREE IN HUMAN RESOURCES OR RELATED FIELD.- PROVEN EXPERIENCE AS AN HR MANAGER OR SIMILAR ROLE, PREFERABLY IN A MANUFACTURING ENVIRONMENT.- STRONG KNOWLEDGE OF HR PRACTICES, EMPLOYMENT LAW, AND REGULATIONS.- EXPERIENCE WITH ADP PAYROLL SYSTEM PREFERRED.- EXCELLENT COMMUNICATION AND INTERPERSONAL SKILLS.- ABILITY TO WORK INDEPENDENTLY AND COLLABORATIVELY IN A FAST-PACED ENVIRONMENT.- SHRM OR HRCI CERTIFICATION A PLUS.\nPERKS AND BENEFITS:- COMPETITIVE SALARY RANGE: $100,000 TO $125,000, PLUS A 10% BONUS.- OPPORTUNITY TO WORK WITH A GLOBAL TEAM IN A DYNAMIC ENVIRONMENT.- POTENTIAL FOR FLEXIBLE HYBRID WORK ARRANGEMENTS (3 OR 4 DAYS IN THE OFFICE DEPENDING ON PLANT NEEDS).",
    "job_skill_set": [
      "HR policies and procedures",
      "recruitment",
      "performance evaluation",
      "employee relations",
      "employment law",
      "HR practices",
      "communication",
      "interpersonal skills",
      "independent work",
      "collaboration",
      "problem solving",
      "employee engagement",
      "ADP payroll processes",
      "SHRM certification",
      "HRCI certification"
    ],
    "short_keywords": [
      "adp",
      "and",
      "certification",
      "collaboration",
      "communication",
      "employee",
      "employment",
      "engagement",
      "evaluation",
      "hr",
      "hrci",
      "human",
      "independent",
      "interpersonal",
      "law",
      "manager",
      "payroll",
      "performance",
      "policies",
      "practices",
      "problem",
      "procedures",
      "processes",
      "recruitment",
      "relations",
      "resources",
      "shrm",
      "skills",
      "solving",
      "work"
    ]
  },
  {
    "job_id": "3905247322",
    "job_title": "Human Resources Information System Specialist",
    "category": "HR",
    "job_description": "JOB ROLE - HUMAN RESOURCES INFORMATION SYSTEM SPECIALIST - WORKDAY TESTING LEADLOCATION - NEW YORK, NY - HYBRID DURATION- 12 MONTHS DEVELOP AND MAINTAIN TEST PLANS, TEST CASES, AND TEST SCRIPTS FOR WORKDAY TESTINGASSIST WITH COORDINATE TESTING ACTIVITIES, INCLUDING SYSTEM, INTEGRATION, AND USER ACCEPTANCE TESTINGTEST, IDENTIFY AND REPORT DEFECTS, AND WORK WITH DEVELOPERS AND FUNCTIONAL CONSULTANTS TO RESOLVE ISSUESENSURE TESTING ACTIVITIES ARE COMPLETED ON TIME AND WITHIN BUDGETPROVIDE REGULAR STATUS UPDATES TO PROJECT STAKEHOLDERSCREATES DOCUMENTATION FOR BUSINESS PROCESSES AND UPDATES AS REQUIRED.CREATE TRAINING DOCUMENTS/GUIDES END-USER.\nQUALIFICATIONS:BACHELOR'S DEGREE IN COMPUTER SCIENCE, INFORMATION SYSTEMS, OR RELATED FIELDMINIMUM OF 2 YEARS OF EXPERIENCE IN WORKDAY TESTINGEXPERIENCE WITH WORKDAY HCM AND RECRUIT REQUIREDSTRONG UNDERSTANDING OF TESTING METHODOLOGIES AND BEST PRACTICESPROVEN PROJECT MANAGEMENT SKILLS INCLUDING EXPERIENCE WITH PROJECT MANAGEMENT TOOLS (I.E. JIRA, SMARTSHEET, EXCEL).PRIOR HR EXPERIENCE IN AN HRIS/HR REPORTING ROLE.EXCELLENT PROBLEM-SOLVING AND COMMUNICATION SKILLSWORKDAY CERTIFICATION IS A PLUS",
    "job_skill_set": [
      "Excel",
      "Problem Solving",
      "Communication",
      "Time Management",
      "Documentation",
      "Training",
      "Collaboration",
      "Workday Testing",
      "Test Plans",
      "Test Cases",
      "Test Scripts",
      "System Testing",
      "Integration Testing",
      "User Acceptance Testing",
      "Defect Identification",
      "Project Management",
      "JIRA",
      "Smartsheet",
      "HRIS",
      "HR Reporting",
      "Workday HCM",
      "Workday Certification"
    ],
    "short_keywords": [
      "acceptance",
      "cases",
      "certification",
      "collaboration",
      "communication",
      "defect",
      "documentation",
      "excel",
      "hcm",
      "hr",
      "hris",
      "human",
      "identification",
      "information",
      "integration",
      "jira",
      "management",
      "plans",
      "problem",
      "project",
      "reporting",
      "resources",
      "scripts",
      "smartsheet",
      "solving",
      "specialist",
      "system",
      "test",
      "testing",
      "time",
      "training",
      "user",
      "workday"
    ]
  },
  {
    "job_id": "3903445892",
    "job_title": "Mid-Level Human Resource Support",
    "category": "HR",
    "job_description": "JOB CATEGORY: HUMAN RESOURCES\n\nTIME TYPE: FULL TIME\n\nMINIMUM CLEARANCE REQUIRED TO START: TS/SCI WITH POLYGRAPH\n\nEMPLOYEE TYPE: REGULAR\n\nPERCENTAGE OF TRAVEL REQUIRED: UP TO 25%\n\nTYPE OF TRAVEL: LOCAL\n\n* * *\n\nCACI IS LOOKING FOR A FULL-TIME MID-LEVEL HUMAN RESOURCE SUPPORT TO JOIN OUR DYNAMIC TEAM IN PROVIDING A WIDE RANGE OF FINANCIAL SUPPORT DUTIES TO ACCOMPLISH CRITICAL OBJECTIVES.\n\nOUR CONTRACTS OFFER A DIVERSE SELECTION OF LABOR CATEGORIES, JOB TYPES, AND LOCATIONS WITHIN THE WASHINGTON METROPOLITAN AREA WITH COMPETITIVE BENEFITS, SALARIES AND INTERNAL GROWTH OPPORTUNITIES (E.G., CAREER ADVANCEMENT OPPORTUNITIES, PROFESSIONAL TRAINING, AND TUITION REIMBURSEMENT.) IF YOU ARE A MOTIVATED INDIVIDUAL LOOKING TO BE A PART OF CRITICAL MISSION, CACI WOULD LIKE TO SPEAK WITH YOU.\n\nFOR ADDITIONAL INFORMATION REGARDING CACI’S OUTSTANDING BENEFITS AND CAREER DEVELOPING TOOLS, PLEASE VISIT WWW.CACI.COM.\n\nWHAT YOU’LL GET TO DO\n\nPROVIDES POLICY AND PROCEDURAL INFORMATION AND GUIDANCE ON PROGRAMS AND PROCESSES.FORMULATE REPORTS, PROVIDE STATUS REPORTS TO MANAGEMENT, AND COMPILE AND DISTRIBUTE MATERIAL FOR MANAGEMENT.PROCESS, VERIFY, AND MAINTAIN DOCUMENTATION RELATING TO PERSONNEL ACTIVITIES SUCH AS RECRUITMENT AND TRAINING.RECOMMEND AND ANALYZE DATA.BECOME AWARE OF GUIDELINES.RESPONSIBLE FOR AD HOC OR OTHER TASKS RELEVANT TO THE ROLE.\n\nYOU’LL BRING THESE QUALIFICATIONS\n\nTS/SCI WITH POLYGRAPHTHREE YEARS’ EXPERIENCE IN HUMAN RESOURCES.STRONG COMMUNICATION SKILLS.EXPERIENCE WITH MICROSOFT APPLICATIONS.\n\nEDUCATION\n\nBACHELOR’S DEGREE IN HUMAN RESOURCES OR HUMAN CAPITAL MANAGEMENT; OR RELATED DEGREE IN BUSINESS ADMINISTRATION, BUSINESS MANAGEMENT, ORGANIZATIONAL DEVELOPMENT PSYCHOLOGY, OR SOCIOLOGY. ADDITIONAL YEARS OF EXPERIENCE MAY BE SUBSTITUTED FOR THE BACHELOR’S DEGREE (MINIMUM OF 3 YEARS).\n\nWHAT WE CAN OFFER YOU\n\nWE’VE BEEN NAMED A BEST PLACE TO WORK BY THE WASHINGTON POST.OUR EMPLOYEES VALUE THE FLEXIBILITY AT CACI THAT ALLOWS THEM TO BALANCE QUALITY WORK AND THEIR PERSONAL LIVES.WE OFFER COMPETITIVE BENEFITS AND LEARNING AND DEVELOPMENT OPPORTUNITIES.WE ARE MISSION-ORIENTED AND EVER VIGILANT IN ALIGNING OUR SOLUTIONS WITH THE NATION’S HIGHEST PRIORITIES.FOR OVER 60 YEARS, THE PRINCIPLES OF CACI’S UNIQUE, CHARACTER-BASED CULTURE HAVE BEEN THE DRIVING FORCE BEHIND OUR SUCCESS.\n\nCACI IS AN EQUAL OPPORTUNITY EMPLOYER - FEMALES/MINORITIES/PROTECTED VETERANS/INDIVIDUALS WITH DISABILITIES.\n\nCOMPANY OVERVIEW\n\nCACI IS AN EQUAL OPPORTUNITY/AFFIRMATIVE ACTION EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, STATUS AS A PROTECTED VETERAN, OR ANY OTHER PROTECTED CHARACTERISTIC.\n\nPAY RANGE: THERE ARE A HOST OF FACTORS THAT CAN INFLUENCE FINAL SALARY INCLUDING, BUT NOT LIMITED TO, GEOGRAPHIC LOCATION, FEDERAL GOVERNMENT CONTRACT LABOR CATEGORIES AND CONTRACT WAGE RATES, RELEVANT PRIOR WORK EXPERIENCE, SPECIFIC SKILLS AND COMPETENCIES, EDUCATION, AND CERTIFICATIONS. OUR EMPLOYEES VALUE THE FLEXIBILITY AT CACI THAT ALLOWS THEM TO BALANCE QUALITY WORK AND THEIR PERSONAL LIVES. WE OFFER COMPETITIVE COMPENSATION, BENEFITS AND LEARNING AND DEVELOPMENT OPPORTUNITIES. OUR BROAD AND COMPETITIVE MIX OF BENEFITS OPTIONS IS DESIGNED TO SUPPORT AND PROTECT EMPLOYEES AND THEIR FAMILIES. AT CACI, YOU WILL RECEIVE COMPREHENSIVE BENEFITS SUCH AS; HEALTHCARE, WELLNESS, FINANCIAL, RETIREMENT, FAMILY SUPPORT, CONTINUING EDUCATION, AND TIME OFF BENEFITS. LEARN MORE HERE\n\nTHE PROPOSED SALARY RANGE FOR THIS POSITION IS\n\n$85,800 - $180,200",
    "job_skill_set": [
      "Human Resources",
      "Microsoft Applications",
      "Data Analysis",
      "Report Writing",
      "Recruitment",
      "Training Documentation",
      "Communication",
      "Teamwork",
      "Problem Solving",
      "Attention to Detail",
      "Adaptability",
      "TS/SCI Clearance"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "applications",
      "attention",
      "clearance",
      "communication",
      "data",
      "detail",
      "documentation",
      "hr",
      "human",
      "microsoft",
      "midlevel",
      "problem",
      "recruitment",
      "report",
      "resource",
      "resources",
      "solving",
      "support",
      "teamwork",
      "to",
      "training",
      "tssci",
      "writing"
    ]
  },
  {
    "job_id": "3905849388",
    "job_title": "Vice President Human Resources",
    "category": "HR",
    "job_description": "AT MOORE, YOU WILL DO MEANINGFUL, LIFE-CHANGING WORK EVERY DAY BY SUPPORTING THE NATION’S MOST BELOVED NONPROFITS AND SERVICE ORGANIZATIONS. SOME OF OUR CLIENTS INCLUDE SHRINERS CHILDREN’S, FEEDING AMERICA, ASPCA, WOUNDED WARRIOR AND HABITAT FOR HUMANITY. \nMOORE IS AN INNOVATION LED COMPANY OF 5,000 PEOPLE AND THE LARGEST MARKETING, DATA AND FUNDRAISING COMPANY IN NORTH AMERICA SERVING THE NONPROFIT INDUSTRY. WE COMBINE OUR STRENGTH IN TECHNOLOGY AND UNMATCHED INDUSTRY EXPERTISE TO PROVIDE CLIENTS WITH STRATEGY, CREATIVITY, PRODUCTION, MEDIA, DATA, RESPONSE MANAGEMENT AND ANALYTIC SERVICES.\nFOR MORE INFORMATION ABOUT MOORE, PLEASE VISIT WWW.WEAREMOORE.COM.\nAS THE VICE PRESIDENT, HUMAN RESOURCES, YOU WILL EMBODY THESE ATTRIBUTES: \nROLE MODEL - ACTIVELY LIVE OUR PURPOSE AND VALUES. ADHERE TO THE HIGHEST LEVELS OF INTEGRITY. BUILDS GENUINE, TRUSTED RELATIONSHIPS WITH TEAM MEMBERS AND OTHER CONSTITUENTS AND TREATS EVERY INDIVIDUAL WITH THE UTMOST DIGNITY AND RESPECT.LEADER - RESPECTFULLY LISTEN AND LEARN FROM OTHERS, COLLABORATE ON PROJECTS, AND COMMUNICATE RESULTS. CONFIDENTLY ENGAGE WITH STAFF AT ALL LEVELS TO DEFINE NEEDS AND EXPECTATIONS. YOU INSPIRE AND MOTIVATE OTHERS TO PERFORM WELL.CREATIVE - CONSISTENTLY IDENTIFY NEW AND IMPROVED WAYS OF DOING THINGS. PROBLEM SOLVER - ANALYTICAL IN YOUR APPROACH AND INTELLECTUALLY CURIOUS. DETAIL-ORIENTED BUT CAN SEE HOW THE DETAILS RELATE TO THE OVERALL MISSION OF AN ORGANIZATION.INNOVATIVE TEAM AND RELATIONSHIP BUILDER - BUILD STRONG, COHESIVE TEAMS AS YOU NAVIGATE AND INNOVATE THROUGH CHALLENGES WITH A SENSE OF FORTITUDE. EXPERTLY USE YOUR ABILITY TO KEEP OTHERS INFORMED AND ON TRACK. UNDERSTAND HOW CHANGE IMPACTS OTHERS AND CAN BALANCE ALL STAKEHOLDERS' NEEDS WHILE CREATING A POSITIVE TEAM SPIRIT. RAPPORT BUILDER - UNDERSTAND THE VARYING NEEDS OF EVERYONE YOU SUPPORT. ESTABLISH CREDIBILITY THROUGH YOUR RELIABLE, INCLUSIVE AND TRUSTWORTHY APPROACH.ORGANIZED - STRONG TIME MANAGEMENT AND PROJECT MANAGEMENT SKILLS. DEAL WITH AND DRIVE CHANGE AND SEE MULTIPLE CONCURRENT PROJECTS THROUGH TO COMPLETION. \nIN THIS ROLE YOU WILL: \nPARTNER WITH THE CHRO TO ENSURE THE SCALABLE EVOLUTION OF THE HUMAN RESOURCES FUNCTION WITHIN A DIVERSE, FAST GROWING, MULTI-COMPANY ENTERPRISE.DEVELOP HR PLANS AND STRATEGIES TO SUPPORT THE ACHIEVEMENT OF THE OVERALL BUSINESS OBJECTIVES ACROSS MULTIPLE PROFESSIONAL SERVICES COMPANIES.FUNCTION AS A STRATEGIC BUSINESS ADVISOR TO THE EXECUTIVE/SENIOR MANAGEMENT REGARDING KEY ORGANIZATIONAL AND MANAGEMENT ISSUES.PROVIDE THOUGHT LEADERSHIP, AND OVERSIGHT TO ALL HUMAN RESOURCES FUNCTIONS INCLUDING ORGANIZATIONAL DEVELOPMENT, TALENT MANAGEMENT, TOTAL REWARDS STRATEGY, EMPLOYEE ENGAGEMENT AND RELATIONS, COMPLIANCE AND EMPLOYEE PROFESSIONAL DEVELOPMENT.LEAD A TEAM OF HR PROFESSIONALS ACROSS MULTIPLE FUNCTIONS AND COMPANIES.DEVELOP TALENT MANAGEMENT STRATEGIES INCLUSIVE OF RECRUITMENT AND RETENTION PLANS TO MEET HUMAN CAPITAL NEEDS AND STRATEGIC GOALS.DEVELOP AND IMPLEMENT TOTAL REWARDS STRATEGIES INCLUSIVE OF COMPENSATION AND BENEFITS PLANS THAT ARE COMPREHENSIVE, COMPETITIVE, AND COST-EFFECTIVE.\nFOR THIS ROLE, WE SEEK: \nA BS/BA DEGREE FROM AN ACCREDITED COLLEGE OR UNIVERSITY; MBA OR MA/MS IN HUMAN RESOURCES OR RELATED FIELD PREFERRED.A MINIMUM OF 12-15 YEARS OF HUMAN RESOURCES EXPERIENCE, WITH TEN YEARS OF EXPERIENCE AT THE EXECUTIVE LEVEL MANAGING TEAMS.EXTENSIVE EXPERIENCE WORKING CONCURRENTLY WITH MULTIPLE COMPANIES AND STAKEHOLDERS.CHALLENGES THE STATUS QUO, EXPERIMENTS, AND EVEN FAILS, BUT HAS THE HUMILITY, CONFIDENCE, AND EXPERIENCE TO LEARN FROM AND ENSURE THAT ALL FAILURES ARE SMART FAILURES.MUST HAVE AN ENTREPRENEURIAL SPIRIT, STRONG COACHING SKILLS, POSSESS A HIGH LEVEL OF EMOTIONAL INTELLIGENCE, WITH AN EXCEPTIONAL ABILITY TO MITIGATE AND RESOLVE COMPLEX ISSUES.PROVEN ABILITY TO SUCCESSFULLY LEAD AND DRIVE CHANGE.EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS.STRONG PRESENTATION SKILLS.PROFICIENT WITH TECHNOLOGY INCLUDING MICROSOFT OFFICE SUITE.\nOUR BENEFITS:TO HELP YOU STAY ENERGIZED, ENGAGED, AND INSPIRED, WE OFFER A WIDE RANGE OF BENEFITS INCLUDING COMPREHENSIVE HEALTHCARE, SUPPORT FOR WORKING PARENTS AND PAID TIME OFF SO YOU CAN RELAX, RECHARGE AND BE THERE FOR THE PEOPLE YOU CARE ABOUT.\nMOORE IS PROUD TO BE AN EQUAL OPPORTUNITY AND AFFIRMATIVE ACTION EMPLOYER. WE EVALUATE QUALIFIED APPLICANTS WITHOUT REGARD TO RACE, COLOR, NATIONAL ORIGIN, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, DISABILITY, PROTECTED VETERAN STATUS, AND OTHER STATUSES PROTECTED BY LAW.",
    "job_skill_set": [
      "Human Resources Management",
      "Talent Management",
      "Project Management",
      "Compensation and Benefits Strategy",
      "Data Analysis",
      "Microsoft Office Suite",
      "Leadership",
      "Communication",
      "Emotional Intelligence",
      "Problem Solving",
      "Team Building",
      "Creativity",
      "Time Management",
      "Relationship Building",
      "Adaptability"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "and",
      "benefits",
      "building",
      "communication",
      "compensation",
      "creativity",
      "data",
      "emotional",
      "hr",
      "human",
      "intelligence",
      "leadership",
      "management",
      "microsoft",
      "office",
      "president",
      "problem",
      "project",
      "relationship",
      "resources",
      "solving",
      "strategy",
      "suite",
      "talent",
      "team",
      "time",
      "vice"
    ]
  },
  {
    "job_id": "3903846584",
    "job_title": "Human Resource Adminstrator",
    "category": "HR",
    "job_description": "DRIFTWOOD HOSPITALITY MANAGEMENT’S COMPANY CULTURE EMPOWERS OUR ASSOCIATES TO TAKE INITIATIVE, BE PROACTIVE, AND CONTRIBUTE TO THE SUCCESS OF THEIR PROPERTY WITH WELL-DEFINED STRATEGIES AND OBJECTIVES. DRIFTWOOD HOSPITALITY MANAGEMENT IS RENOWNED FOR OUR FULLY INTEGRATED APPROACH TO HOSPITALITY SERVICES — ALL WITH OUTSTANDING CLIENT SERVICE. OUR TEAM IS MADE UP OF THE BEST TALENT IN THE HOSPITALITY INDUSTRY, DOWN TO EVERY EMPLOYEE, POSITION, AND HOTEL.\n\nA HUMAN RESOURCES ADMINISTRATOR COORDINATES AND IMPLEMENTS DEPARTMENT ACTIVITIES AND PROJECTS, AS ASSIGNED. PROVIDES CLERICAL AND OFFICE SUPPORT AND ASSISTANCE TO DEPARTMENT MANAGEMENT.\n\nWHAT WILL I BE DOING?\n\nRESPONSIBILITIES\n\nTHE HUMAN RESOURCES ADMINISTRATOR COORDINATES AND IMPLEMENTS DEPARTMENT ACTIVITIES AND PROJECTS, AS ASSIGNED. PROVIDES CLERICAL AND OFFICE SUPPORT AND ASSISTANCE TO DEPARTMENT MANAGEMENT. SPECIFICALLY, YOU WILL BE RESPONSIBLE FOR PERFORMING THE FOLLOWING TASKS TO THE HIGHEST STANDARDS:\n\n COORDINATES PROJECTS AND ACTIVITIES AND PROJECTS, AS ASSIGNED. PROVIDES CLERICAL AND OFFICE SUPPORT AND ASSISTANCE TO DEPARTMENT MANAGEMENT  MAINTAIN COMMUNICATION WITH DEPARTMENTS INVOLVED IN THE ASSIGNED PROJECT/ACTIVITY  ANSWER TELEPHONE AND ASSIST INTERNAL AND EXTERNAL GUESTS WITH REQUESTS  WRITES CORRESPONDENCE ON BEHALF OF THE DEPARTMENT  MAKES COPIES, SEND/DISTRIBUTES OUTGOING MAIL  USES EMAIL SYSTEM TO DELIVER AND ACCEPT EMAILS  GREET INTERNAL AND EXTERNAL CUSTOMERS WHEN ENTERING THE DEPARTMENT  ASSIST WITH A VARIETY OF REQUESTS  MAINTAINS DETAILED FILING SYSTEM FOR DEPARTMENT  MAINTAIN OFFICE SUPPLIES FOR DEPARTMENT  REPORT ALL UNSAFE CONDITIONS IMMEDIATELY  ATTEND ALL MANDATORY MEETINGS  FOLLOW AND KNOW EMERGENCY PROCEDURES AS NEEDED  KEEP WORK AREA CLEAN AND ORGANIZED  MAINTAIN A GOOD WORKING RELATIONSHIP WITH OTHER DEPARTMENT, EMPLOYEES, AND GUESS \n\nWHAT ARE WE LOOKING FOR?\n\nSKILLS\n\nA HUMAN RESOURCES ADMINISTRATOR SERVING HILTON CURIO BRAND HOTELS IS ALWAYS WORKING ON BEHALF OF OUR GUESTS AND WORKING WITH OTHER TEAM MEMBERS. TO SUCCESSFULLY FILL THIS ROLE, YOU SHOULD MAINTAIN THE ATTITUDE, BEHAVIORS, SKILLS, AND VALUES THAT FOLLOW:\n\n PREVIOUS EXPERIENCE IN OR EQUIVALENT ROLE  POSITIVE ATTITUDE  EXCELLENT COMMUNICATION AND PEOPLE SKILLS  COMMITTED TO DELIVERING A HIGH LEVEL OF CUSTOMER SERVICE, BOTH INTERNALLY AND EXTERNALLY  EXCELLENT GROOMING STANDARDS  EXPERIENCE WITH MS OFFICE APPLICATIONS AND OUTLOOK \n\nIT WOULD BE ADVANTAGEOUS IN THIS POSITION FOR YOU TO DEMONSTRATE THE FOLLOWING CAPABILITIES AND DISTINCTIONS:\n\n KNOWLEDGE OF HOSPITALITY \n\nBENEFITS\n\n401(K)DENTAL INSURANCEDISABILITY INSURANCEEMPLOYEE ASSISTANCE PROGRAMFLEXIBLE SPENDING ACCOUNTHEALTH INSURANCELIFE INSURANCEPAID TIME OFFVISION INSURANCEROOM DISCOUNTSEMPLOYEE FOOD AND BEVERAGE DISCOUNTS\n\nEEO: DRIFTWOOD HOSPITALITY MANAGEMENT IS COMMITTED TO A DIVERSE AND INCLUSIVE WORKPLACE. WE ARE AN EQUAL OPPORTUNITY EMPLOYER. QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, NATIONAL ORIGIN, AGE, DISABILITY, PREGNANCY, GENETIC INFORMATION, PROTECTED VETERAN STATUS, OR ANY OTHER LEGALLY PROTECTED STATUS.\n\nAPPLY NOW",
    "job_skill_set": [
      "MS Office",
      "Clerical support",
      "Project coordination",
      "Communication",
      "Teamwork",
      "Problem solving",
      "Attention to detail",
      "Interpersonal skills",
      "Organizational skills",
      "Outlook",
      "Filing system management",
      "Customer service",
      "Positive attitude"
    ],
    "short_keywords": [
      "adminstrator",
      "attention",
      "attitude",
      "clerical",
      "communication",
      "coordination",
      "customer",
      "detail",
      "filing",
      "hr",
      "human",
      "interpersonal",
      "management",
      "ms",
      "office",
      "organizational",
      "outlook",
      "positive",
      "problem",
      "project",
      "resource",
      "service",
      "skills",
      "solving",
      "support",
      "system",
      "teamwork",
      "to"
    ]
  },
  {
    "job_id": "3894586785",
    "job_title": "Human Resources Specialist",
    "category": "HR",
    "job_description": "JOB DESCRIPTION\n\nJOIN THE CLEAN ENERGY REVOLUTION\n\nBECOME HUMAN RESOURCES SPECIALIST AT SOUTHERN CALIFORNIA EDISON (SCE) AND BUILD A BETTER TOMORROW. IN THIS JOB, YOU’LL BE IN THE COMPANY’S HUMAN RESOURCES CONTACT CENTER, AND WILL ACT AS A KEY RESOURCE/SUBJECT MATTER EXPERT TO HR’S CLIENT BASE AND DEPARTMENT MANAGEMENT IN A CENTRALIZED INTERNAL CONTACT CENTER ON SPECIFIC PROGRAM(S) AND OTHER ASSIGNED AREAS OF RESPONSIBILITY REQUIRING ANALYSIS AND DECISION MAKING. THE SUCCESSFUL CANDIDATE WILL INTERPRET AND COMMUNICATE COMPLEX INFORMATION TO CUSTOMERS WITH A HIGH LEVEL OF ACCURACY; ANSWERS AND LOGS CUSTOMER QUESTIONS ON THE FULL SCOPE OF HR CONTACT CENTER ISSUES; RESEARCHES AND REPORTS BACK ON NEW OR UNUSUAL PROBLEMS; STAYS CURRENT ON THE PLANS AND PURSUES CONTINUOUS LEARNING ON THE SUBJECTS AND PROCESSES HANDLED BY THE CENTER; CULTIVATES POSITIVE WORKING RELATIONSHIPS WITH ASSIGNED KEY AREAS; CONTINUES TO WORK ON SELF-GROWTH AND DEVELOPMENT. IN ADDITION, MAINTAINING A SAFETY CONSCIOUS WORK ENVIRONMENT BY FOLLOWING EDISON SAFETY PROTOCOLS AND SAFE WORK PRACTICES; AND PERFORMING OTHER RESPONSIBILITIES AND DUTIES AS ASSIGNED.\n\nAS A HUMAN RESOURCES SPECIALIST, YOUR WORK WILL HELP POWER OUR PLANET, REDUCE CARBON EMISSIONS AND CREATE CLEANER AIR FOR EVERYONE. ARE YOU READY TO TAKE ON THE CHALLENGE TO HELP US BUILD THE FUTURE?\n\nA DAY IN THE LIFE - GET READY TO THINK BIG, WORK SMART AND SHINE BRIGHT!\n\nPROVIDE PROFESSIONAL CONSULTATION AND ACCURATE INFORMATION TO ALL LEVELS OF EMPLOYEES, MANAGEMENT, OFFICERS, EMPLOYMENT CANDIDATES, RETIREES, AND EXTERNAL CONTACTS ON A FULL RANGE OF HUMAN RESOURCE PROGRAMS, PRODUCTS, SERVICES, PRACTICES, AND POLICIES, INCLUDING, BENEFIT PLANS (TIME OFF, DISABILITY, ETC.), EMPLOYEE PROGRAMS (RIDESHARE PROGRAMS, EDUCATIONAL REIMBURSEMENT, WORK LIFE EVENTS, EMPLOYEE ACTIVITIES, ETC.), PAYROLL, COMPENSATION, LABOR, TRAINING, AND STAFFING. RESEARCHES, EVALUATES, AND RESOLVES CUSTOMER (INTERNAL/EXTERNAL) RELATED ISSUES. DEVELOP SOLUTIONS AND RECOMMENDATIONS THAT ARE CONSISTENT WITH CURRENT LAWS, POLICY GUIDELINES, BENEFIT PLAN PROVISIONS, REGULATIONS, AND CONTRACT PROVISIONS. INTERACT WITH CUSTOMERS VIA PHONE CALLS, VOICEMAILS, EMAILS, WRITTEN CORRESPONDENCE AND IN PERSON. USES SYSTEMS SUCH AS HELP DESK SOFTWARE, CASE MANAGEMENT, SAP, ETC., TO TRACK, MONITOR, ANALYZE, PROCESS, AND DOCUMENT ALL ASPECTS OF CUSTOMER INTERACTIONS.BUILD AND MAINTAIN POSITIVE RELATIONSHIPS WITH BUSINESS PARTNERS INCLUDING MANAGEMENT, KEY AREA REPRESENTATIVES, PROGRAM VENDORS, AND THE CONTACT CENTER TEAM.LEAD AND OVERSEE, OR SUPPORT ONE OR MORE HR PROJECTS, PROGRAMS OR SERVICES HANDLED BY THE CENTER. IDENTIFY AND RECOMMEND CONTINUOUS IMPROVEMENT OPPORTUNITIES IN PROGRAM(S) AND THE CENTER’S OPERATIONS TO OPTIMIZE CUSTOMER SATISFACTION AND EFFICIENCY.PERFORM OTHER DUTIES AND RESPONSIBILITIES AS ASSIGNED. \n\nTHE ESSENTIALS\n\nTHREE YEARS OF EXPERIENCE IN THE FIELD OF HUMAN RESOURCES SUPPORTING EMPLOYEE PROGRAMS, PROVIDING GUIDANCE ON POLICIES AND PROCEDURES, TRIAGING ESCALATIONS, AND SUPPORTING GENERAL INQUIRIES. THREE YEARS OF EXPERIENCE INTERACTING DIRECTLY WITH INTERNAL OR EXTERNAL CUSTOMERS IN A CUSTOMER/CLIENT SERVICES ENVIRONMENT ANALYZING AND RESOLVING CUSTOMER ISSUES.EXPERIENCE USING CUSTOMER SERVICE SYSTEMS OR CUSTOMER INFORMATION SYSTEMS (E.G., SAP, COMPUTER TELEPHONY INTEGRATION (CTI), RELEVANT CASE MANAGEMENT SYSTEMS, OR OTHER HELPDESK SOFTWARE, ETC).\n\nTHE PREFERRED\n\nASSOCIATE’S DEGREE IN HUMAN RESOURCES, BUSINESS OR A RELATED FIELD OR AN EQUIVALENT COMBINATION OF EDUCATION, TRAINING, AND EXPERIENCE.EXPERIENCE WITH HR POLICIES OR PROGRAMS SUCH AS TIME-OFF, EDUCATIONAL ASSISTANCE/REIMBURSEMENT, AND COMMUTER/RIDESHARE PROGRAMS.EXPERIENCE COMMUNICATING BOTH ORALLY AND IN A WRITTEN FORMAT TO A WIDE VARIETY OF AUDIENCES.EXPERIENCE IDENTIFYING PROCESS IMPROVEMENT OPPORTUNITIES AND DEVELOPING AND MAKING RECOMMENDATIONS.EXPERIENCE TRACKING, MONITORING, ANALYZING, PROCESSING, AND/OR DOCUMENTING DATA/INFORMATION.EXPERIENCE CREATING AND EDITING REPORTS AND PRESENTATIONS, CONVERTING FORMATS AND INFORMATION, USING SOFTWARE AND/OR SYSTEM FUNCTIONS, AND GENERATING NON-STANDARD REPORTS FROM BUSINESS APPLICATIONS/DATABASES. EXPERIENCE SUPPORTING OBJECTIVES AND INITIATIVES THAT HELP ACHIEVE ORGANIZATIONAL GOALS.EXPERIENCE WORKING INDEPENDENTLY AND EFFICIENTLY WHEN HANDLING CUSTOMER REQUESTS.EXCELLENT INTERPERSONAL SKILLS, AND THE ABILITY TO COLLABORATE AND MAINTAIN POSITIVE WORKING RELATIONSHIPS WITH STAFF AND ALL LEVELS OF MANAGEMENT.ABILITY TO INTEGRATE WORK ACROSS RELEVANT AREAS, DEVELOP THE BUSINESS AND SERVICES TO ENHANCE CUSTOMER SATISFACTION AND PRODUCTIVITY, MANAGE RISKS APPROPRIATELY, DEVELOP AND EXECUTE BUSINESS PLANS, MANAGE INFORMATION, AND PROVIDE EXCEPTIONAL SERVICE TO INTERNAL AND EXTERNAL CUSTOMERS.EFFECTIVE RESOURCE AND PROJECT PLANNING, DECISION MAKING, RESULTS DELIVERY, TEAM BUILDING, AND THE ABILITY TO STAY CURRENT WITH RELEVANT TECHNOLOGY AND INNOVATION.STRONG ETHICS, INFLUENCE AND NEGOTIATION, LEADERSHIP, INTERPERSONAL SKILLS, COMMUNICATION, AND THE ABILITY TO EFFECTIVELY MANAGE STRESS AND ENGAGE IN CONTINUOUS LEARNING.\n\nYOU SHOULD KNOW \n\nTHIS POSITION’S WORK MODE IS HYBRID. THE EMPLOYEE WILL REPORT TO AN SCE FACILITY FOR A SET NUMBER OF DAYS WITH THE OPTION TO WORK REMOTELY ON THE REMAINING DAYS. UNLESS OTHERWISE NOTED, EMPLOYEES ARE REQUIRED TO RESIDE IN THE STATE OF CALIFORNIA. FURTHER DETAILS OF THIS WORK MODE WILL BE DISCUSSED AT THE INTERVIEW STAGE. THE WORK MODE CAN BE CHANGED BASED ON BUSINESS NEEDS.VISIT OUR CANDIDATE RESOURCE PAGE TO GET MEANINGFUL INFORMATION RELATED TO BENEFITS, PERKS, RESOURCES, TESTING INFORMATION, HIRING PROCESS, AND MORE!RELOCATION DOES NOT APPLY TO THIS POSITION.\n\nABOUT SOUTHERN CALIFORNIA EDISON\n\nTHE PEOPLE AT SCE DON'T JUST KEEP THE LIGHTS ON. OUR MISSION IS SO MUCH BIGGER. WE’RE FUELING THE KIND OF INNOVATION THAT’S CHANGING AN ENTIRE INDUSTRY, AND QUITE POSSIBLY THE PLANET. JOIN US AND CREATE A FUTURE WITH CLEANER ENERGY, WHILE PROVIDING OUR CUSTOMERS WITH THE SAFETY AND RELIABILITY THEY DEMAND. AT SCE, YOU’LL HAVE A CHANCE TO GROW PERSONALLY AND PROFESSIONALLY, MAKING A REAL IMPACT IN SOUTHERN CALIFORNIA AND AROUND THE WORLD.\n\nAT SCE, WE CELEBRATE OUR DIFFERENCES. WE ARE A PROUD EQUAL OPPORTUNITY EMPLOYER AND WILL NOT DISCRIMINATE BASED ON RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, AGE, DISABILITY, PROTECTED VETERAN STATUS OR ANY OTHER PROTECTED STATUS.\n\nWE ARE COMMITTED TO ENSURING THAT INDIVIDUALS WITH DISABILITIES ARE PROVIDED REASONABLE ACCOMMODATION TO PARTICIPATE IN THE JOB APPLICATION OR INTERVIEW PROCESS, TO PERFORM ESSENTIAL JOB FUNCTIONS, AND TO RECEIVE OTHER BENEFITS AND PRIVILEGES OF EMPLOYMENT. PLEASE CONTACT US TO REQUEST ACCOMMODATIONS AT (833) 343-0727.",
    "job_skill_set": [
      "HR policies",
      "data analysis",
      "project management",
      "interpersonal skills",
      "communication",
      "problem solving",
      "teamwork",
      "decision making",
      "continuous learning",
      "relationship building",
      "self-growth",
      "customer service systems",
      "SAP",
      "case management",
      "report creation",
      "help desk software",
      "communication software",
      "stress management",
      "influence and negotiation"
    ],
    "short_keywords": [
      "analysis",
      "and",
      "building",
      "case",
      "communication",
      "continuous",
      "creation",
      "customer",
      "data",
      "decision",
      "desk",
      "help",
      "hr",
      "human",
      "influence",
      "interpersonal",
      "learning",
      "making",
      "management",
      "negotiation",
      "policies",
      "problem",
      "project",
      "relationship",
      "report",
      "resources",
      "sap",
      "selfgrowth",
      "service",
      "skills",
      "software",
      "solving",
      "specialist",
      "stress",
      "systems",
      "teamwork"
    ]
  },
  {
    "job_id": "3891808187",
    "job_title": "Senior Human Resources Representative,",
    "category": "HR",
    "job_description": "VANTIVE: A NEW COMPANY BUILT ON OUR LEGACY\n\nBAXTER IS ON A JOURNEY TO SEPARATE OUR ~$5B KIDNEY CARE SEGMENT INTO A STANDALONE COMPANY. VANTIVE* WILL BUILD ON OUR NEARLY 70-YEAR LEGACY IN ACUTE THERAPIES AND HOME AND IN-CENTER DIALYSIS TO PROVIDE BEST-IN-CLASS CARE TO THE PEOPLE WE SERVE. WE BELIEVE VANTIVE WILL NOT ONLY BUILD OUR LEADERSHIP IN THE KIDNEY CARE SPACE, IT WILL ALSO OFFER MEANINGFUL WORK TO THOSE WHO JOIN US.\n\nAT VANTIVE, YOU WILL BECOME PART OF A COMMUNITY OF PEOPLE WHO ARE FOCUSED, COURAGEOUS AND DON’T SETTLE FOR THE MEDIOCRE. EACH OF US ARE DRIVEN TO HELP IMPROVE PATIENTS’ LIVES WORLDWIDE. JOIN US AS WE REVOLUTIONIZE KIDNEY CARE AND OTHER VITAL ORGAN SUPPORT.\n\nCOMPLETION OF THE PROPOSED SEPARATION OF KIDNEY CARE FROM BAXTER INTO A STANDALONE COMPANY (TO BE NAMED VANTIVE) REMAINS SUBJECT TO THE SATISFACTION OF CUSTOMARY CONDITIONS.\n\nYOUR ROLE\n\nKIDNEYCO IS LOOKING FOR A SR. HR REPRESENTATIVE TO JOIN THE ORGANIZATION. THIS POSITION WILL BE RESPONSIBLE FOR PROVIDING HR GENERALIST SUPPORT IN THE GLOBAL FUNCTIONS AND AMERICAS FOR PROCESSES AND PROGRAMS WITHIN BAXTER/KIDNEYCO. THE SR. HR REPRESENTATIVE WILL PARTNER WITH KEY TEAM MEMBERS TO IMPLEMENT AND DRIVE KEY INITIATIVES, COMMUNICATE POLICIES AND BEST PRACTICES, AND IDENTIFY WAYS TO CONTRIBUTE TO THE DEPARTMENT AND ORGANIZATION.\n\nWHAT YOU'LL BE DOING\n\nSUPPORT HR TEAM IN IMPLEMENTING FUNCTION HR PLANS AND PROGRAMS (E.G., TALENT REVIEW AND PLANNING, ANNUAL COMPENSATION REVIEW, PERFORMANCE MANAGEMENT).SUPPORT EMPLOYEES AND MANAGERS, AS NEEDED, REGARDING HR MATTERS (E.G., EMPLOYEE RELATIONS, TOPICS RAISED BEYOND HR CENTRAL).SUPPORT THE ADMINISTRATION AND IMPLEMENTATION OF THE ANNUAL MERIT INCREASE AND BONUS PROCESSPARTNER AND LIAISE WITH FUNCTIONAL COE MEMBERS TO RESOLVE HR MATTERS.SERVE AS THE POINT LIAISON REGARDING HR OPERATIONS MATTERS (E.G., PROCESSING HR ACTIONS, DRAFTING CONTENT, OFF-BOARDING PROCESSES).MANAGE EMPLOYEE-RELATED DATA (E.G., EXTRACT DATA REPORTS, APPLY FOUNDATIONAL ANALYSIS, CREATE DATA FILES).LEAD VARIOUS EMPLOYEE DATA AUDITS, DATA GOVERNANCEWORK INDEPENDENTLY TO RESOLVE STRAIGHTFORWARD HR MATTERS. AS WELL AS HELP RESOLVE MODERATELY COMPLEX HR MATTERS.RECOMMEND AND DRIVE IMPROVEMENT TO HR SYSTEMS, POLICIES AND PROCESSES ESCALATE HR MATTERS TO RESPECTIVE HR TEAM MEMBERS, AS NEEDED.\n\nWHAT YOU'LL BRING\n\nMINIMUM 3+ YEARS OF HUMAN RESOURCE PROFESSIONAL EXPERIENCE.KNOWLEDGE OF HR MANAGEMENT COMPONENTS INCLUDING PERFORMANCE MANAGEMENT, DEVELOPMENT, COMPENSATION, CULTURE AND ENGAGEMENT, CHANGE MANAGEMENT, ORGANIZATIONAL DESIGN, AND INCLUSION & DIVERSITY.EXPERIENCE WORKING WITH LEADERSHIP TEAM MEMBERS, PEOPLE MANAGERS AND EMPLOYEES WORKING IN A VARIETY OF LOCATIONS (FIELD, CORPORATE, GLOBAL).\n\nBAXTER IS COMMITTED TO SUPPORTING THE NEEDS FOR FLEXIBILITY IN THE WORKPLACE. WE DO SO THROUGH OUR FLEXIBLE WORKPLACE POLICY WHICH INCLUDES A MINIMUM OF 3 DAYS A WEEK ONSITE. THIS POLICY PROVIDES THE BENEFITS OF CONNECTING AND COLLABORATING IN-PERSON IN SUPPORT OF OUR MISSION.\n\nWE UNDERSTAND COMPENSATION IS AN IMPORTANT FACTOR AS YOU CONSIDER THE NEXT STEP IN YOUR CAREER. AT BAXTER, WE ARE COMMITTED TO EQUITABLE PAY FOR ALL EMPLOYEES, AND WE STRIVE TO BE MORE TRANSPARENT WITH OUR PAY PRACTICES. THE ESTIMATED BASE SALARY FOR THIS POSITION IS $80,000 TO $110,000 ANNUALLY. THE ESTIMATED RANGE IS MEANT TO REFLECT AN ANTICIPATED SALARY RANGE FOR THE POSITION. WE MAY PAY MORE OR LESS THAN OF THE ANTICIPATED RANGE BASED UPON MARKET DATA AND OTHER FACTORS, ALL OF WHICH ARE SUBJECT TO CHANGE. INDIVIDUAL PAY IS BASED ON UPON LOCATION, SKILLS AND EXPERTISE, EXPERIENCE, AND OTHER RELEVANT FACTORS. THIS POSITION IS ALSO ELIGIBLE FOR A DISCRETIONARY BONUS. FOR QUESTIONS ABOUT THIS, OUR PAY PHILOSOPHY, AND AVAILABLE BENEFITS, PLEASE SPEAK TO THE RECRUITER IF YOU DECIDE TO APPLY AND ARE SELECTED FOR AN INTERVIEW.\n\nTHE SUCCESSFUL CANDIDATE FOR THIS JOB MAY BE REQUIRED TO VERIFY THAT HE OR SHE HAS BEEN VACCINATED AGAINST COVID-19, SUBJECT TO REASONABLE ACCOMMODATIONS FOR INDIVIDUALS WITH MEDICAL CONDITIONS OR RELIGIOUS BELIEFS THAT PREVENT VACCINATION, AND IN ACCORDANCE WITH APPLICABLE LAW.\n\nBACHELOR'S DEGREE (±16 YEARS)\n\nEQUAL EMPLOYMENT OPPORTUNITY\n\nBAXTER IS AN EQUAL OPPORTUNITY EMPLOYER. BAXTER EVALUATES QUALIFIED APPLICANTS WITHOUT REGARD TO RACE, COLOR, RELIGION, GENDER, NATIONAL ORIGIN, AGE, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, PROTECTED VETERAN STATUS, DISABILITY/HANDICAP STATUS OR ANY OTHER LEGALLY PROTECTED CHARACTERISTIC.\n\nEEO IS THE LAW\n\nEEO IS THE LAW - POSTER SUPPLEMENT\n\nPAY TRANSPARENCY POLICY\n\nREASONABLE ACCOMMODATIONS\n\nBAXTER IS COMMITTED TO WORKING WITH AND PROVIDING REASONABLE ACCOMMODATIONS TO INDIVIDUALS WITH DISABILITIES GLOBALLY. IF, BECAUSE OF A MEDICAL CONDITION OR DISABILITY, YOU NEED A REASONABLE ACCOMMODATION FOR ANY PART OF THE APPLICATION OR INTERVIEW PROCESS, PLEASE CLICK ON THE LINK HERE AND LET US KNOW THE NATURE OF YOUR REQUEST ALONG WITH YOUR CONTACT INFORMATION.\n\nRECRUITMENT FRAUD NOTICE\n\nBAXTER HAS DISCOVERED INCIDENTS OF EMPLOYMENT SCAMS, WHERE FRAUDULENT PARTIES POSE AS BAXTER EMPLOYEES, RECRUITERS, OR OTHER AGENTS, AND ENGAGE WITH ONLINE JOB SEEKERS IN AN ATTEMPT TO STEAL PERSONAL AND/OR FINANCIAL INFORMATION. TO LEARN HOW YOU CAN PROTECT YOURSELF, REVIEW OUR RECRUITMENT FRAUD NOTICE.\n\n127966\n\n",
    "job_skill_set": [
      "HR Management",
      "Performance Management",
      "Compensation Analysis",
      "Data Analysis",
      "Employee Relations",
      "Organizational Design",
      "Change Management",
      "Diversity and Inclusion",
      "Talent Review",
      "HR Policies Implementation",
      "Communication",
      "Team Collaboration",
      "Problem Solving",
      "Independence",
      "Adaptability",
      "Leadership",
      "Attention to Detail",
      "Empathy"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "and",
      "attention",
      "change",
      "collaboration",
      "communication",
      "compensation",
      "data",
      "design",
      "detail",
      "diversity",
      "empathy",
      "employee",
      "hr",
      "human",
      "implementation",
      "inclusion",
      "independence",
      "leadership",
      "management",
      "organizational",
      "performance",
      "policies",
      "problem",
      "relations",
      "representative",
      "resources",
      "review",
      "senior",
      "solving",
      "talent",
      "team",
      "to"
    ]
  },
  {
    "job_id": "3902315334",
    "job_title": "Human Resources Generalist",
    "category": "HR",
    "job_description": "WE ARE WORKING WITH A LOCAL GROWING START-UP COMPANY ON A HUMAN RESOURCES GENERALIST OPPORTUNITY! \nTHE IDEAL CANDIDATE WILL BE RESPONSIBLE FOR RECRUITMENT EFFORTS, NEW HIRE ORIENTATION AND ONBOARDING, EMPLOYEE TERMINATION, PAYROLL AND BENEFITS, COMPANY POLICY AND PROCEDURE ADHERENCE. IN ADDITION, YOU WILL BUILD STRONG RELATIONSHIPS WITH C-SUITE IN ORDER TO HELP THEM WITH DELIVER THEIR HUMAN RESOURCES VISION.  RESPONSIBILITIESESTABLISH STRONG HUMAN RESOURCES PRESENCE IN THE COMPANY OVERSEE FULL-CYCLE OF RECRUITMENT EFFORTSDEVELOP AND OVERSEE NEW HIRE ORIENTATION, ONBOARDING EFFORTS AND EMPLOYEE TERMINATION PROCESSASSIST WITH PAYROLL AND BENEFITS ADMINISTRATIONENSURES COMPLIANCE WITH COMPANY POLICIES AND PROCEDURES AND LEGAL RESPONSIBILITIES\nQUALIFICATIONS\nBACHELOR'S DEGREE OR EQUIVALENT EXPERIENCE IN BUSINESS, HUMAN RESOURCES, OR RELATED AREA3~5+ YEARS' OF EXPERIENCE WORKING IN HUMAN RESOURCESSTRONG INTERPERSONAL AND COMMUNICATION SKILLS",
    "job_skill_set": [
      "recruitment",
      "onboarding",
      "payroll administration",
      "benefits administration",
      "compliance",
      "human resources policies",
      "employee termination",
      "business degree",
      "interpersonal skills",
      "communication",
      "relationship building",
      "problem solving"
    ],
    "short_keywords": [
      "administration",
      "benefits",
      "building",
      "business",
      "communication",
      "compliance",
      "degree",
      "employee",
      "generalist",
      "hr",
      "human",
      "interpersonal",
      "onboarding",
      "payroll",
      "policies",
      "problem",
      "recruitment",
      "relationship",
      "resources",
      "skills",
      "solving",
      "termination"
    ]
  },
  {
    "job_id": "3894925340",
    "job_title": "Human Resource Manager",
    "category": "HR",
    "job_description": "GLOBAL INDUSTRIALCORPORATE OVERVIEWFOR OVER 70 YEARS GLOBAL INDUSTRIAL HAS BEEN AN INDUSTRY LEADER PROVIDING PRIVATE LABEL AND BRAND NAME INDUSTRIAL EQUIPMENT AND SUPPLIES TO BUSINESSES THROUGHOUT NORTH AMERICA.\nWE CARRY OVER ONE MILLION INDUSTRIAL, MATERIAL HANDLING AND BUSINESS PRODUCTS THAT ARE SOLD THROUGH OUR WEBSITE, CORPORATE SALES PEOPLE AND FULL COLOR CATALOGS. WE ARE CONSTANTLY INCREASING OUR PRODUCT OFFERINGS TO MEET THE DIVERSE AND CHANGING NEEDS OF OUR CUSTOMERS. OUR CUSTOMERS INCLUDE SMALL TO LARGE CORPORATIONS, INSTITUTIONS, GOVERNMENT AGENCIES AND CONSUMERS ACROSS NORTH AMERICA.\nKEY RESPONSIBILITIESMAINTAIN AND OPTIMIZE THE NEW HIRE ONBOARDING PROGRAM; ENSURING AN EXCELLENT ORIENTATION EXPERIENCE.COLLABORATE WITH THE HIRING MANAGERS TO PROGRESS THE BUSINESS ONBOARDING PLAN AND ALIGN EXPECTATIONS.FOLLOWS STANDARD PROCEDURES TO EXECUTE NEW HIRES AND ENSURE TERMINATED EMPLOYEE DATA IS REMOVED FROM APPROPRIATE EMPLOYEE DATABASES AND IS MOVED TO AN INACTIVE STATUS.UPHOLD THE INTEGRITY, ACCURACY, AND CLEANLINESS OF INTERNAL HR EMPLOYEE DATA; PREPARE STANDARD AND AD HOC REPORTS AND GENERATE METRICS BASED ON RETENTION, TURNOVER AND INTERNAL MOBILITY RATES.PARTNERS WITH RECRUITING STAFF TO ALIGN ON INTERNAL TRANSFERS, EMPLOYEE REFERRALS AND NEW HIRES / TERMS AND ENSURE ALL ARE ACTIONED APPROPRIATELY. FACILITATE BEST PRACTICES FOR PERFORMANCE REVIEW CYCLES INCLUDING SETUP, COMMUNICATIONS, AND REPORTING AND GATHER, PRESENT INFORMATION TO SENIOR LEADERSHIP.REVIEW, UPDATE AND MANAGE COMPANY POLICIES AND COMPLIANCE.PROVIDE COUNSEL AND SUPPORT TO MANAGERS BY RESPONDING TO EMPLOYEE RELATIONS ISSUES, CONDUCT INVESTIGATIONS AND PROVIDE RECOMMENDATIONS FOR EFFECTIVE RESOLUTION OF ISSUES AND CONCERNS.ASSIST CORPORATE BENEFITS MANAGER WITH ADMINISTERING THE COMPANY HEALTH, WELFARE AND RETIREMENT PLAN BENEFITS. ANALYZES WORKFORCE CHANGES AND PARTICIPATE IN THE DEVELOPMENT OF WORKFORCE PLANNING INITIATIVES. PARTICIPATES IN BUSINESS MANAGER MEETINGS FOR ASSIGNED TEAMS, AND PARTNERS WITH THEM ON STRATEGIES FOR PERFORMANCE MANAGEMENT, EMPLOYEE RELATIONS AND OTHER AREAS\nQUALIFICATIONA BACHELOR’S DEGREE WITH A MINIMUM OF 3 - 5 YEARS OF EXPERIENCE IN A GENERALIST ROLE IS REQUIRED. MUST HAVE EXCELLENT INTERPERSONAL SKILLS AND ABILITIES, AND BE WELL VERSED IN ALL AREAS OF HUMAN RESOURCES.STRONG PC SKILLS AND PROFICIENCY IN MS OFFICE (WORD, EXCEL, POWERPOINT, OUTLOOK). STRONG ORGANIZATIONAL SKILLS, DETAIL-ORIENTED AND EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS.DEMONSTRATED ABILITY TO MULTI-TASK IN A FAST PACED, INNOVATIVE ENVIRONMENT AND PRIORITIZE PROJECTS. RESULTS ORIENTED WITH PRIOR SUCCESS WORKING WITHIN TIGHT DEADLINES.\nEEO/AA STATEMENTGLOBAL INDUSTRIAL PROVIDES EQUAL EMPLOYMENT OPPORTUNITIES TO ALL EMPLOYEES AND APPLICANTS FOR EMPLOYMENT AND PROHIBITS DISCRIMINATION AND HARASSMENT OF ANY TYPE WITHOUT REGARD TO RACE, COLOR, RELIGION, AGE, SEX, NATIONAL ORIGIN, DISABILITY STATUS, GENETICS, PROTECTED VETERAN STATUS, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, OR ANY OTHER CHARACTERISTIC PROTECTED BY FEDERAL, STATE OR LOCAL LAWS.THIS POLICY APPLIES TO ALL TERMS AND CONDITIONS OF EMPLOYMENT, INCLUDING RECRUITING, HIRING, PLACEMENT, PROMOTION, TERMINATION, LAYOFF, RECALL, TRANSFER, LEAVES OF ABSENCE, COMPENSATION AND TRAINING.",
    "job_skill_set": [
      "HR Management",
      "Onboarding",
      "Employee Relations",
      "Data Analysis",
      "MS Office",
      "Workforce Planning",
      "Policy Management",
      "Performance Management",
      "Report Generation",
      "Interpersonal Skills",
      "Communication",
      "Organizational Skills",
      "Detail-Oriented",
      "Multi-tasking",
      "Results-Oriented",
      "Problem Solving"
    ],
    "short_keywords": [
      "analysis",
      "communication",
      "data",
      "detailoriented",
      "employee",
      "generation",
      "hr",
      "human",
      "interpersonal",
      "management",
      "manager",
      "ms",
      "multitasking",
      "office",
      "onboarding",
      "organizational",
      "performance",
      "planning",
      "policy",
      "problem",
      "relations",
      "report",
      "resource",
      "resultsoriented",
      "skills",
      "solving",
      "workforce"
    ]
  },
  {
    "job_id": "3902953786",
    "job_title": "Human Resources Generalist",
    "category": "HR",
    "job_description": "THE IDEAL CANDIDATE WILL BE RESPONSIBLE FOR RECRUITMENT EFFORTS, NEW HIRE ORIENTATION AND ONBOARDING, EMPLOYEE TERMINATION, PAYROLL AND BENEFITS, COMPANY POLICY AND PROCEDURE ADHERENCE. IN ADDITION, YOU WILL BUILD STRONG RELATIONSHIPS WITH OUR COMPANY'S MANAGERS IN ORDER TO HELP THEM WITH THEIR HUMAN RESOURCE NEEDS.  RESPONSIBILITIESOVERSEE FULL-CYCLE OF RECRUITMENT EFFORTSDEVELOP AND OVERSEE NEW HIRE ORIENTATION, ONBOARDING EFFORTS AND EMPLOYEE TERMINATION PROCESSASSIST WITH PAYROLL AND BENEFITS ADMINISTRATIONENSURES COMPLIANCE WITH COMPANY POLICIES AND PROCEDURES AND LEGAL RESPONSIBILITIES\nQUALIFICATIONSBACHELOR'S DEGREE OR EQUIVALENT EXPERIENCE IN BUSINESS, HUMAN RESOURCES, OR RELATED AREA2+ YEARS' OF EXPERIENCE WORKING IN HUMAN RESOURCESSTRONG INTERPERSONAL AND COMMUNICATION SKILLS",
    "job_skill_set": [
      "recruitment",
      "onboarding",
      "payroll administration",
      "compliance",
      "policy adherence",
      "human resources management",
      "interpersonal skills",
      "communication",
      "relationship building",
      "benefits administration"
    ],
    "short_keywords": [
      "adherence",
      "administration",
      "benefits",
      "building",
      "communication",
      "compliance",
      "generalist",
      "hr",
      "human",
      "interpersonal",
      "management",
      "onboarding",
      "payroll",
      "policy",
      "recruitment",
      "relationship",
      "resources",
      "skills"
    ]
  },
  {
    "job_id": "3904973138",
    "job_title": "Human Resources Manager",
    "category": "HR",
    "job_description": "OUR CLIENT IS A FAST-GROWING COMPANY IN THE LOGISTICS INDUSTRY WHO HAS ENGAGED US TO IDENTIFY AND REFER A HUMAN RESOURCES MANAGER TO JOIN THEIR TEAM. THE PERSON HIRED FOR THIS ROLE WILL BE RESPONSIBLE FOR PROVIDING GUIDANCE IN ALL ASPECTS OF HUMAN RESOURCES MANAGEMENT, INCLUDING TALENT ACQUISITION, PERFORMANCE MANAGEMENT, EMPLOYEE RELATIONS, BENEFITS ADMINISTRATION AND ORGANIZATIONAL DEVELOPMENT. WE ARE SEEKING AN HR PROFESSIONAL AND TRUSTED PARTNER TO FACILITATE AND IMPLEMENT HR PROGRAMS, POLICIES AND PROCEDURES AND HELP TO IMPROVE THE OVERALL CULTURE OF THE COMPANY.\nTO QUALIFY…BACHELOR’S DEGREE IN HUMAN RESOURCES OR RELATED AREA5+ YEARS OF HR EXPERIENCE WITH AT LEAST 2 YEARS OF HR MANAGEMENT EXPERIENCEMUST BE TECH-SAVVY AND PROFICIENT IN MS WORD, EXCEL AND POWERPOINTSOLID ORGANIZATIONAL SKILLS WITH ATTENTION TO DETAILSTRONG VERBAL AND WRITTEN COMMUNICATION SKILLSMUST BE EASILY ADAPTABLE TO CHANGE IN A FAST-PACED, CHANGING ENVIRONMENTDEMONSTRATED ANALYTICAL AND PROBLEM-SOLVING SKILLS AND UNQUESTIONABLE INTEGRITY IS A MUST\nFOR FURTHER INFORMATION ABOUT THIS OUTSTANDING CAREER OPPORTUNITY, PLEASE EMAIL YOUR RESUME IN CONFIDENCE",
    "job_skill_set": [
      "Talent Acquisition",
      "Employee Relations",
      "Benefits Administration",
      "Organizational Development",
      "MS Word",
      "MS Excel",
      "Analytical Skills",
      "Problem-Solving",
      "Communication",
      "Organizational Skills",
      "Attention to Detail",
      "Adaptability",
      "Integrity",
      "Performance Management",
      "MS PowerPoint"
    ],
    "short_keywords": [
      "acquisition",
      "adaptability",
      "administration",
      "analytical",
      "attention",
      "benefits",
      "communication",
      "detail",
      "development",
      "employee",
      "excel",
      "hr",
      "human",
      "integrity",
      "management",
      "manager",
      "ms",
      "organizational",
      "performance",
      "powerpoint",
      "problemsolving",
      "relations",
      "resources",
      "skills",
      "talent",
      "to",
      "word"
    ]
  },
  {
    "job_id": "3889702368",
    "job_title": "Human Resource Coordinator",
    "category": "HR",
    "job_description": "ABOUT THE COMPANY\n\nOUR CLIENT IS A HIGH-FREQUENCY TRADING FIRM SEEKING AN HR COORDINATOR TO JOIN ITS RECRUITING AND HR TEAM BASED IN NEW YORK. THE HR COORDINATOR WILL SUPPORT THE NON-TRADING TEAM IN HANDLING THE COORDINATION OF AND SUPPORT OF DAILY GENERALIST RESPONSIBILITIES INCLUDING ONBOARDING, OFFBOARDING, EMPLOYEE RELATIONS, ASSISTING IN THE DEVELOPMENT AND ROLLOUT OF LEARNING AND DEVELOPMENT INITIATIVES, PERFORMANCE MANAGEMENT, AND THE HANDLING OF MID-YEAR AND YEAR-END PROCESSES FOR GIVEN CLIENT GROUPS.\n\nRESPONSIBILITIES\n\nMANAGE EMPLOYEE RELATIONS, PERFORMANCE ISSUES, AND PERFORMANCE REVIEWSSUPPORT RECRUITERS WITH FULL LIFECYCLE RECRUITING INCLUDING CREATING AND POSTING JOB DESCRIPTIONS, SCHEDULING INTERVIEWS, GATHERING INTERVIEWER FEEDBACK, AND CREATING OFFER LETTERSPROVIDE ADMINISTRATIVE SUPPORT ON VARIOUS HR AND RECRUITING PROCESSES AND INITIATIVESENSURE TIMELY COMMUNICATION THROUGHOUT THE INTERVIEW PROCESS TO DELIVER AN OUTSTANDING EXPERIENCE TO ALL CANDIDATESMAINTAIN CANDIDATE INFORMATION IN OUR APPLICANT TRACKING SYSTEMESTABLISH EFFECTIVE WORKING RELATIONSHIPS WITH INTERNAL CLIENTSACT AS THE FIRST POINT OF CONTACT FOR EMPLOYEE INQUIRIES WITHIN GIVEN CLIENT GROUPSMAINTAIN CONFIDENTIALITY AND INTEGRITY WHEN HANDLING SENSITIVE INFORMATIONPARTICIPATE IN ON CAMPUS RECRUITING EFFORTS, INCLUDING POSTING ROLES, COORDINATING INTERVIEWS, ATTENDING CAREER FAIRS AND INFORMATION SESSIONS, AND CREATING OFFERS\n\nREQUIREMENTS\n\nBACHELOR’S DEGREE OR EQUIVALENT EXPERIENCE1-3 YEARS OF RECRUITING AND/OR HR GENERALIST EXPERIENCESTRONG WRITTEN AND VERBAL COMMUNICATION SKILLSEXCELLENT ORGANIZATIONAL SKILLS AND ATTENTION TO DETAIL\n\nSALARY RANGE\n\n$70,000 – $80,000\n\n",
    "job_skill_set": [
      "recruiting",
      "employee relations",
      "performance management",
      "onboarding",
      "offboarding",
      "administrative support",
      "job descriptions",
      "interview scheduling",
      "confidentiality",
      "communication",
      "organizational skills",
      "attention to detail",
      "relationship building",
      "problem solving",
      "applicant tracking system"
    ],
    "short_keywords": [
      "administrative",
      "applicant",
      "attention",
      "building",
      "communication",
      "confidentiality",
      "coordinator",
      "descriptions",
      "detail",
      "employee",
      "hr",
      "human",
      "interview",
      "job",
      "management",
      "offboarding",
      "onboarding",
      "organizational",
      "performance",
      "problem",
      "recruiting",
      "relations",
      "relationship",
      "resource",
      "scheduling",
      "skills",
      "solving",
      "support",
      "system",
      "to",
      "tracking"
    ]
  },
  {
    "job_id": "3901981049",
    "job_title": "Human Resources Business Partner III International",
    "category": "HR",
    "job_description": "POSITION SUMMARY:\nTHE HUMAN RESOURCES BUSINESS PARTNER III IS A STRATEGIC CONSULTING RESOURCE TO EXECUTIVE LEADERSHIP WITHIN THE INTERNATIONAL BUSINESS UNIT OVERSEEING THE LATIN AMERICA, OCEANIA AND ASIA PACIFIC REGION. THE POSITION WILL CREATE ALIGNMENT BETWEEN TALENT AND ORGANIZATIONAL DEVELOPMENT STRATEGY BY CONDUCTING PROACTIVE GAP ANALYSIS. THE POSITION DRIVES AND INFLUENCES KEY BUSINESS UNIT INITIATIVES WHICH REQUIRES BUSINESS ACUMEN TO PROVIDE THOUGHT LEADERSHIP, PROGRAM CONSULTATION AND DESIGN. PROVIDES AND GUIDES TALENT MANAGEMENT RESOURCES FOR EMPLOYEES AT ALL LEVELS. THE POSITION WILL ENSURE COMPLIANCE WITH ALL APPLICABLE LAWS WITHIN , COMPANY POLICIES AND PROCEDURES, RESOLVE EMPLOYEE RELATIONS ISSUES AND PREPARE VARIOUS HR REPORTS AND METRICS THAT SUPPORT BUSINESS OBJECTIVES.\nESSENTIAL JOB FUNCTIONS:\nALIGN HR WORKFORCE PLANNING AND ORGANIZATIONAL DESIGN WITH LOCAL BUSINESS MATURITY, WHILE IDENTIFYING AND ADVISING COURSES OF ACTION WITH GLOBAL MINDSET AND LOCAL SCALABILITY TO ACHIEVE STRATEGIC BUSINESS GOALS.LIASE WITH MANAGEMENT BY FOSTERING TALENT MANAGEMENT SOLUTIONS TO COACH LEADERS AND EMPLOYEES WHEN IMPLEMENTING PERFORMANCE MANAGEMENT, SUCCESSION PLANNING, PERFORMANCE DISCIPLINARY ACTIONS, PERFORMANCE IMPROVEMENT PLANS, CHANGE AND CONFLICT MANAGEMENT, AND LEARNING & DEVELOPMENT SOLUTIONS.DEVELOP AND CONTINUOUSLY ANALYZE TRENDS, METRICS, POLICIES AND PRACTICES TO MEASURE EFFECTIVENESS AND TIMELINESS IN RECRUITMENT AND RETENTION. WARRANTY A SUCCESSFUL EMPLOYEE EXPERIENCE ALIGNED WITH COMPANY VALUES AND CULTURE BY OVERSEEING AND SPONSORING SOLUTIONS TO PROACTIVELY RETAIN TALENT.MAINTAIN THE INTEGRITY OF THE COMPANY’S ETHICS AND COMPLIANCE PROGRAM BY LEADING WORKPLACE INVESTIGATIONS, COMPLYING WITH CORPORATE PROTOCOLS BY COLLECTING EVIDENCE, PROVIDING COUNSELING AND RESOLUTION, WHILE ADVISING EXECUTIVE MANAGEMENT ABOUT ANY RISK TO THE COMPANY.PREPARE AND ANALYZE VARIOUS HRIS REPORTS AND METRICS, EVALUATE TRENDS, MAKE RECOMMENDATIONS AND IMPLEMENT ORGANIZATIONAL CHANGE MANAGEMENT TO CONTINUOUSLY ENSURE HR BEST PRACTICES FOR EXECUTIVE LEADERS.PARTNER WITH MANAGEMENT AND INTERNAL TRAINING SPECIALIST ON THE EVALUATION, DESIGN AND IMPLEMENTATION OF TRAINING AND DEVELOPMENT PROGRAMS, INCLUDING SKILLS DEVELOPMENT, GAP ASSESSMENTS AND PERFORMANCE MANAGEMENT. ASSIST IN PREPARING CAREER PATH AND SUCCESSION PLAN MODELS, AND PARTICIPATE IN THE DEVELOPMENT AND FACILITATION OF EMPLOYEE RELATIONS AND PERFORMANCE IMPROVEMENT TRAINING AND EDUCATION OF MANAGERS.LEAD A TEAM OF HUMAN RESOURCES GENERALISTS WITHIN A BUSINESS UNIT OR CLIENT GROUP. PROVIDING GUIDANCE ON BEST PRACTICE TO PROVIDE ADVICE AND COUNSELING ON PERFORMANCE MANAGEMENT ISSUES, CONFLICT MANAGEMENT, INTERPRETATION OF EMPLOYMENT POLICIES, AND EMPLOYEE COUNSELING.ENSURE COMPLIANCE WITH COUNTRY, STATE AND LOCAL EMPLOYMENT LAWS, AS WELL AS COMPANY POLICIES AND PROCEDURES. ASSIST IN THE DEVELOPMENT, UPDATING AND IMPLEMENTATION OF PERSONNEL POLICIES AND PROCEDURES. ATTEND HUMAN RESOURCES CONFERENCES TO STAY ABREAST OF ANNUAL UPDATES.PARTNER WITH TALENT ACQUISITION BY INTERVIEWING HIGH LEVEL POSITION CANDIDATES, USING BEHAVIORAL PREDICTABLE METHODOLOGIES, AND PROVIDING RECOMMENDATIONS TO HIRING MANAGERS/LEADERS.CONDUCT HIGH LEVEL EMPLOYEE SEPARATIONS AND EXIT INTERVIEW, ANALYZE DATA AND MAKE RECOMMENDATIONS TO THE MANAGEMENT TEAM FOR APPLICABLE CORRECTIVE ACTIONS AND CONTINUOUS IMPROVEMENT.  OTHER RELATED DUTIES AS ASSIGNED.\nPOSITION REQUIREMENTS: BACHELOR DEGREE IN HUMAN RESOURCES, GLOBAL HUMAN RESOURCES OR LABOR RELATIONS10+ YEARS OF HUMAN RESOURCES EXPERIENCE7+ YEARS OF TALENT ACQUISITION & EMPLOYEE RELATION EXPERIENCE3-5 YEARS OF INTERNATIONAL HUMAN RESOURCES EXPERIENCEFLUENT IN SPANISH AND ADDITIONAL LANGUAGES A PLUS (PORTUGUESE, MANDARIN, ETC.)MICROSOFT OFFICE, HRIS SYSTEM EXPERIENCE\nPAY RANGE : $100,900 - $118,700",
    "job_skill_set": [
      "Human Resources",
      "Talent Acquisition",
      "Microsoft Office",
      "Data Analysis",
      "Compliance",
      "Conflict Management",
      "Communication",
      "Problem Solving",
      "Leadership",
      "Collaboration",
      "Adaptability",
      "Employee Relations",
      "HRIS Systems",
      "Organizational Design",
      "Performance Management",
      "Change Management",
      "Bilingual (Spanish)",
      "International HR Experience",
      "Business Acumen",
      "Coaching",
      "Strategic Thinking",
      "Influencing"
    ],
    "short_keywords": [
      "acquisition",
      "acumen",
      "adaptability",
      "analysis",
      "bilingual",
      "business",
      "change",
      "coaching",
      "collaboration",
      "communication",
      "compliance",
      "conflict",
      "data",
      "design",
      "employee",
      "experience",
      "hr",
      "hris",
      "human",
      "iii",
      "influencing",
      "international",
      "leadership",
      "management",
      "microsoft",
      "office",
      "organizational",
      "partner",
      "performance",
      "problem",
      "relations",
      "resources",
      "solving",
      "spanish",
      "strategic",
      "systems",
      "talent",
      "thinking"
    ]
  },
  {
    "job_id": "3903867896",
    "job_title": "Data Engineer - Enterprise Data and Analytics, Human Resources Stream",
    "category": "HR",
    "job_description": "WHAT YOU'LL DO\n\nWE’RE LOOKING FOR A DATA ENGINEER TO JOIN OUR ENTERPRISE DATA & ANALYTICS SPACE, SUPPORTING AND MAINTAINING DATA PRODUCTS FOR PRINCIPAL’S HUMAN RESOURCES VALUE STREAM. IN THIS ROLE, YOU’LL APPLY YOUR DATA ENGINEERING AND ANALYSIS SKILLS TO PROVIDE INNOVATIVE DATA SOLUTIONS AND DRIVE BUSINESS OUTCOMES!\n\nOWN TECHNICAL ASPECTS OF DATA MANAGEMENT FUNCTIONS INCLUDING CREATING, LOADING, TRANSFORMING, CLEANSING, PROCESSING, ANALYZING, AND VISUALIZING DATA.WORK DIRECTLY OR IN SUPPORT OF DATA SCIENCE/ANALYTICS TO DESIGN, DEVELOP, TEST AND INTEGRATE DATA FROM VARIOUS SOURCE SYSTEMS INTO LARGE-SCALE, EASILY CONSUMABLE DATA PLATFORMS USED FOR PROVIDING INSIGHTS THAT PROMOTES BUSINESS GROWTH AND EFFICIENCY. BUILD DATA SOLUTION DESIGNS, MODELS AND INFRASTRUCTURE BY APPLYING ARCHITECTURAL PATTERNS AND PRINCIPLES, DATA GOVERNANCE AND SECURITY, RESEARCHING NEW TECHNOLOGIES AND APPROACHES, UNDERSTANDING REQUIREMENTS, ALL PHASES OF TESTING, DEBUGGING, DOCUMENTING, QUALITY ASSURANCE PRACTICES, IMPLEMENTATION AND MAINTENANCE. DEMONSTRATE KNOWLEDGE OF INDUSTRY TRENDS, CREATE OPTIMIZED DATA COMPONENTS AND SYSTEMS THAT USE APPROPRIATE DEVELOPMENT ENVIRONMENT. EMPLOY TECHNOLOGY (I.E., SCRIPTING LANGUAGES, DATA MOVEMENT TOOLS) FOR EFFICIENT SYSTEM INTEGRATION.RECOMMEND WAYS TO IMPROVE DATA RELIABILITY, EFFICIENCY AND QUALITY.\n\n\nOPERATING AT THE INTERSECTION OF FINANCIAL SERVICES AND TECHNOLOGY, PRINCIPAL BUILDS FINANCIAL TOOLS THAT HELP OUR CUSTOMERS LIVE BETTER LIVES. WE TAKE PRIDE IN BEING A PURPOSE-LED FIRM, MOTIVATED BY OUR MISSION TO MAKE FINANCIAL SECURITY ACCESSIBLE TO ALL. OUR MISSION, INTEGRITY, AND CUSTOMER FOCUS HAVE MADE US A TRUSTED LEADER FOR MORE THAN 140 YEARS.\n\nAS PRINCIPAL CONTINUES TO MODERNIZE ITS SYSTEMS, THIS ROLE WILL OFFER YOU AN EXCITING OPPORTUNITY TO BUILD SOLUTIONS THAT WILL DIRECTLY IMPACT OUR LONG-TERM STRATEGY AND TECH STACK, ALL WHILE ENSURING THAT OUR PRODUCTS ARE ROBUST, SCALABLE, AND SECURE!\n\nWHO YOU ARE\n\nBACHELOR'S DEGREE PLUS 2 + YEARS RELATED WORK EXPERIENCE OR A MASTER'S IN A RELATED FIELDYOU HAVE EXPERIENCE WITH ETL (EXTRACT/TRANSFORM/LOAD) CONCEPTS AND TOOLS.YOU HAVE WORKED WITH RELATIONAL DATABASE CONCEPTS AND TABLE STRUCTURES AND ARE PROFICIENT IN WRITING QUERIES USING SQL.YOU ARE EXPERIENCED IN DEVELOPMENT OF SYSTEMS FOR DATA EXTRACTION, INGESTION AND PROCESSING OF LARGE VOLUMES OF DATA.\n\n\nSKILLS THAT WILL HELP YOU STAND OUT\n\nCLOUD TECHNOLOGIES (I.E, AWS, CD/CI PIPELINES) PYTHON SCRIPTINGSNOWFLAKEDATA WAREHOUSE EXPERIENCEEXPERIENCE SUPPORTING HR SYSTEMS SUCH AS ICIMS, ORACLE HUMAN CAPITAL MANAGEMENT, PEOPLESOFT OR OTHER SIMILAR ENVIRONMENTSDATA SECURITYTEST AUTOMATION\n\n\nSALARY RANGE INFORMATION\n\nSALARY RANGES BELOW REFLECT TARGETED BASE SALARIES. NON-SALES POSITIONS HAVE THE OPPORTUNITY TO PARTICIPATE IN A BONUS PROGRAM. SALES POSITIONS ARE ELIGIBLE FOR SALES INCENTIVES, AND IN SOME INSTANCES A BONUS PLAN, WHEREBY TOTAL COMPENSATION MAY FAR EXCEED BASE SALARY DEPENDING ON INDIVIDUAL PERFORMANCE. ACTUAL COMPENSATION FOR ALL ROLES WILL BE BASED UPON GEOGRAPHIC LOCATION, WORK EXPERIENCE, EDUCATION, LICENSURE REQUIREMENTS AND/OR SKILL LEVEL AND WILL BE FINALIZED AT THE TIME OF OFFER.\n\nSALARY RANGE (NON-EXEMPT EXPRESSED AS HOURLY; EXEMPT EXPRESSED AS YEARLY)\n\n$75000 - $123000 / YEAR\n\nTIME OFF PROGRAM\n\nFLEXIBLE TIME OFF (FTO) IS PROVIDED TO SALARIED (EXEMPT) EMPLOYEES AND PROVIDES THE OPPORTUNITY TO TAKE TIME AWAY FROM THE OFFICE WITH PAY FOR VACATION, PERSONAL OR SHORT-TERM ILLNESS. EMPLOYEES DON’T ACCRUE A BANK OF TIME OFF UNDER FTO AND THERE IS NO SET NUMBER OF DAYS PROVIDED.\n\nPENSION ELIGIBLE\n\nYES\n\nADDITIONAL INFORMATION\n\nOUR ENGINEERING CULTURE\n\nTHROUGH OUR PRODUCT-DRIVEN AGILE/LEAN DEVOPS ENVIRONMENT, WE’VE FOSTERED A CULTURE OF INNOVATION AND EXPERIMENTATION ACROSS OUR DEVELOPMENT TEAMS. AS A CUSTOMER-FOCUSED ORGANIZATION, WE WORK CLOSELY WITH OUR END USERS AND PRODUCT OWNERS TO UNDERSTAND AND RAPIDLY RESPOND TO EMERGING BUSINESS NEEDS.\n\nCOLLABORATION IS EMBEDDED INTO EVERYTHING WE DO – FROM THE PRODUCTS WE DEVELOP TO THE QUALITY SERVICE WE PROVIDE. WE’RE DRIVEN BY THE BELIEF THAT DIVERSITY OF THOUGHT, BACKGROUND, AND PERSPECTIVE IS CRITICAL TO CREATING THE BEST PRODUCTS AND EXPERIENCES FOR OUR CUSTOMERS.\n\nWORK ENVIRONMENTS\n\nTHIS ROLE OFFERS IN-OFFICE, HYBRID (BLENDING AT LEAST THREE OFFICE DAYS IN A TYPICAL WORKWEEK).\n\nJOB LEVEL\n\nWE’LL CONSIDER TALENT AT THE NEXT LEVEL WITH THE RIGHT EXPERIENCE, BACKGROUND AND SKILL LEVEL.\n\nWORK AUTHORIZATION/SPONSORSHIP\n\nAT THIS TIME, WE'RE NOT CONSIDERING CANDIDATES THAT NEED ANY TYPE OF IMMIGRATION SPONSORSHIP (ADDITIONAL WORK AUTHORIZATION OR PERMANENT WORK AUTHORIZATION) NOW OR IN THE FUTURE TO WORK IN THE UNITED STATES? THIS INCLUDES, BUT IS NOT LIMITED TO: F1-OPT, F1-CPT, H-1B, TN, L-1, J-1, ETC. FOR ADDITIONAL INFORMATION AROUND WORK AUTHORIZATION NEEDS PLEASE USE THE FOLLOWING LINKS.\n\nNONIMMIGRANT WORKERS AND GREEN CARD FOR EMPLOYMENT-BASED IMMIGRANTS\n\nINVESTMENT CODE OF ETHICS\n\nFOR PRINCIPAL ASSET MANAGEMENT POSITIONS, YOU’LL NEED TO FOLLOW AN INVESTMENT CODE OF ETHICS RELATED TO PERSONAL AND BUSINESS CONDUCT AS WELL AS PERSONAL TRADING ACTIVITIES FOR YOU AND MEMBERS OF YOUR HOUSEHOLD. THESE SAME REQUIREMENTS MAY ALSO APPLY TO OTHER POSITIONS ACROSS THE ORGANIZATION.\n\nEXPERIENCE PRINCIPAL\n\nWHILE OUR EXPERTISE SPANS THE GLOBE, WE'RE BOUND BY ONE COMMON PURPOSE: TO FOSTER A WORLD WHERE FINANCIAL SECURITY IS ACCESSIBLE TO ALL. AND OUR SUCCESS DEPENDS ON THE UNIQUE EXPERIENCES, BACKGROUNDS, AND TALENTS OF OUR EMPLOYEES – INDIVIDUALLY AND ALL OF US TOGETHER. EXPLORE OUR CORE VALUES, BENEFITS AND WHY WE’RE AN EXCEPTIONAL PLACE TO GROW YOUR CAREER.\n\nPRINCIPAL IS AN EQUAL OPPORTUNITY EMPLOYER\n\nALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, OR VETERAN STATUS.\n\nPOSTING WINDOW\n\nWE WILL ACCEPT APPLICATIONS FOR 3 FULL DAYS FOLLOWING THE ORIGINAL POSTING DATE, AFTER WHICH THE POSTING MAY REMAIN OPEN OR BE REMOVED BASED UPON APPLICATIONS RECEIVED. IF WE CHOOSE TO POST THE JOB AGAIN, WE WILL ACCEPT ADDITIONAL APPLICATIONS FOR AT LEAST 1 FULL DAY FOLLOWING THE MOST RECENTLY POSTED DATE. PLEASE SUBMIT APPLICATIONS IN A TIMELY MANNER AS THERE IS NO GUARANTEE THE POSTING WILL BE AVAILABLE BEYOND THE APPLICABLE DEADLINE.\n\nORIGINAL POSTING DATE\n\n4/17/2024\n\nMOST RECENTLY POSTED DATE\n\n4/18/2024\n\nLINKEDIN HASHTAG\n\n",
    "job_skill_set": [
      "Data Security",
      "Data Management",
      "Data Analysis",
      "Collaboration",
      "Problem Solving",
      "Communication",
      "Adaptability",
      "Customer Focus",
      "ETL",
      "SQL",
      "Python",
      "Cloud Technologies",
      "Data Warehousing",
      "Test Automation",
      "Data Visualization",
      "Innovation"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "analytics",
      "and",
      "automation",
      "cloud",
      "collaboration",
      "communication",
      "customer",
      "data",
      "engineer",
      "enterprise",
      "etl",
      "focus",
      "hr",
      "human",
      "innovation",
      "management",
      "problem",
      "python",
      "resources",
      "security",
      "solving",
      "sql",
      "stream",
      "technologies",
      "test",
      "visualization",
      "warehousing"
    ]
  },
  {
    "job_id": "3904001514",
    "job_title": "Information Technology Project Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOB TITLE: PROJECT MANAGER LOCATION: TALLAHASSEE, FLORIDA (REMOTE)DURATION: 1 YRRATE: W2 + CHPSTART DATE: MAY, 2024\n\nOUR CLIENT’S DIVISION OF INFORMATION SYSTEMS ADMINISTRATION (ISA) IS SEEKING THE SERVICES OF AN EXPERIENCED CONSULTANT TO ACT AS A SENIOR (SR.) PROJECT MANAGER FOR STRATEGICALLY ALIGNED ENTERPRISE PROJECTS. THE SR. PROJECT MANAGER SHALL HAVE PROVEN EXPERIENCE IN PLANNING AND MANAGING PROJECTS INVOLVING APPLICATION SYSTEM DEVELOPMENT, INTEGRATION AND DEPLOYMENT OF EQUIVALENT SCOPE AND COMPLEXITY.\nA.WORK WITH THE DEPARTMENT’S CONTRACT MANAGER TO SERVE AS THE PRIMARY POINT OF CONTACT TO ENSURE THAT START-UP ACTIVITIES ARE COMPLETED WITHIN FOURTEEN (14) DAYS PRIOR TO THE PERFORMANCE OF SERVICES. START-UP ACTIVITIES INCLUDE DEPARTMENT’S FINGERPRINT BACKGROUND CHECK AND ONLINE INFORMATION SECURITY TRAINING SECURITY REQUIREMENTS;\nB.DEVELOP, UPDATE, AND MANAGE PROJECT PLANS AS INDICATED BELOW:\n1) THE PROJECT SCHEDULE SHALL DETERMINE HOW AND WHEN PROJECT ACTIVITIES AND TASKS WILL BE COMPLETED AND WHO THOSE ACTIVITIES OR TASKS ARE ASSIGNED TO WITHIN THE PROJECT TEAM. THE PROJECT SCHEDULE SHALL ALSO REFLECT ALL KEY MILESTONES. THE PROJECT MANAGER SHALL UPDATE THE PROJECT SCHEDULE, ON A WEEKLY BASIS AND AS NEEDED, AND UPLOAD THE PROJECT SCHEDULE TO THE PROJECT CONTROL BOOK (PCB) ON SHAREPOINT. ADDITIONALLY, THE PROJECT MANAGER SHALL MANAGE AND REPORT THE DEPARTMENT’S PROGRESS AGAINST THE SCHEDULE ON A REGULAR BASIS, AS AGREED UPON IN WRITING BY THE DEPARTMENT AND THE CONTRACTOR.2) THE PROJECT MANAGER SHALL WORK DIRECTLY WITH THE PROJECT TEAMS TO PROVIDE WEEKLY UPDATES, INCLUDING BUT NOT LIMITED TO, MEETING MINUTES; STATUS OF FUNCTIONAL TEAMS; POTENTIAL RISKS; AND IDENTIFIED ISSUES, WHICH SHALL BE SUBMITTED TO THE PMO MANAGER.\nC. PERFORM PROJECT MANAGEMENT TASKS TO INCLUDE BUT NOT LIMITED TO:\n1) DEVELOPING PROJECT PLANS;2) MANAGING PLANS;3) LIAISING WITH USERS;4) COMPLETING PROJECT MANAGEMENT PLAN(S) AND ADDITIONAL PROJECT DOCUMENTATION DETERMINED FOR THE SIZE OF THE PROJECT;5) PROVIDING HANDS ON LEADERSHIP FOR COMPLEX TASKS;6) PROVIDING STATUS REPORTS AND RESOURCE MANAGEMENT FOR ASSOCIATED PROJECTS;7) WORKING WITH INFORMATION SYSTEM ADMINISTRATION LEADERSHIP; AND8) HAVING DIRECT RESPONSIBILITY FOR ENSURING WORK PRODUCTS ARE COMPLETED ON SCHEDULE, WITHIN BUDGET AND TO THE LEVEL OF QUALITY REQUIRED BY THE DEPARTMENT.D. BE RESPONSIBLE FOR THE FOLLOWING:1) SUCCESSFUL COMPLETION OF END-TO-END PROJECT WORK, INCLUDING ALL WORK PRODUCTS;2)OVERSIGHT OF PROJECTS COMPRISED OF MULTIPLE DELIVERABLES, INCLUDING DELEGATION AND COORDINATION TASK;3) CREATION OR PROJECT MANAGEMENT OF THE INTEGRATED PROJECT PLAN, EXECUTION OF PROJECT PLAN, PROJECT STATUS, MEETINGS, SCOPE CHANGES, RISK AND ISSUE TRACKING/MITIGATION, COORDINATION ACROSS PROJECT TEAMS, ETC.;4) NEGOTIATIONS INTERNAL AND EXTERNAL TO THE PROJECT TEAMS;5) MANAGING SCOPE, RESOURCES, TIMELINES, COST/BUDGET, QUALITY, COMMUNICATION, AND PROCUREMENTS TO MEET THE GOALS OF THE DEPARTMENT; AND6) DEVELOPMENT AND EXECUTION OF TRAINING AND EDUCATION ON STANDARD PROJECT MANAGEMENT REQUIREMENTS AND METHODS, FACILITATING PROJECT GOVERNANCE AND REPORTING, AND CREATING MODELS TO IMPROVE BUSINESS DECISIONSE. LIAISON WITH PROJECT TEAMS, TECHNICAL AND BUSINESS STAFF;F. PROVIDE HANDS-ON LEADERSHIP FOR COMPLEX PROJECTS;G. ATTEND AND COMPLETE DEPARTMENT-REQUIRED TRAINING; AND,H. ON A WEEKLY BASIS, COMPLETE A STATUS REPORT THAT INCLUDES SPECIFIC TASKS HANDLED BY BOTH THE PROJECT MANAGER AND PROJECT TEAM(S), AND ALSO COMPLETE A PROJECT TIMESHEET.",
    "job_skill_set": [
      "project management",
      "application system development",
      "integration",
      "deployment",
      "project planning",
      "risk management",
      "resource management",
      "budget management",
      "quality assurance",
      "status reporting",
      "training and education",
      "leadership",
      "communication",
      "negotiation",
      "team collaboration",
      "problem solving",
      "time management",
      "adaptability",
      "attention to detail",
      "SharePoint"
    ],
    "short_keywords": [
      "adaptability",
      "and",
      "application",
      "assurance",
      "attention",
      "budget",
      "collaboration",
      "communication",
      "deployment",
      "detail",
      "development",
      "education",
      "information",
      "informationtechnology",
      "integration",
      "leadership",
      "management",
      "manager",
      "negotiation",
      "planning",
      "problem",
      "project",
      "quality",
      "reporting",
      "resource",
      "risk",
      "sharepoint",
      "solving",
      "status",
      "system",
      "team",
      "technology",
      "time",
      "to",
      "training"
    ]
  },
  {
    "job_id": "3902828915",
    "job_title": "Information Technology Security Analyst",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "FULL JOB DESCRIPTIONAS AN INFORMATION SECURITY ANALYST, YOU WILL DESIGN AND IMPLEMENT IT SECURITY SYSTEMS, ESTABLISH BEST PRACTICES, AND MONITOR NETWORKS FOR SECURITY ISSUES. THIS ROLE ALSO INCLUDES RESPONSIBILITIES RELATED TO AUDITING, AND CONTRIBUTING TO VARIOUS SECURITY PROJECTS.\nROLES AND RESPONSIBILITIES:DAILY AUDITING:AUDIT VARIOUS SECURITY TOOLS AND SYSTEMS, INCLUDING BUT NOT LIMITED TO:CISCO AMPFIREPOWERCISCO STEALTHWATCHQRADARESETMAINTAIN AND UPDATE CONFIGURATIONS AS NEEDED ON BOTH CLIENTS AND SERVERS.TROUBLESHOOT ANY ISSUES THAT ARISE.STEALTHWATCH:MONITOR AND MAINTAIN STEALTHWATCH FOR NETWORK SECURITY AND ANOMALY DETECTION.SECURITY PROJECTS:COLLABORATE ON VARIOUS SECURITY PROJECTS AND INITIATIVES AS ASSIGNED BY THE INFORMATION SECURITY TEAM.ADDITIONAL ASSIGNMENTS:BE FLEXIBLE AND WILLING TO TAKE ON ADDITIONAL TASKS AS NEEDED, AS SECURITY NEEDS AND PRIORITIES EVOLVE.\nQUALIFICATIONS:BACHELOR'S DEGREE IN INFORMATION SECURITY, COMPUTER SCIENCE, OR A RELATED FIELD (OR EQUIVALENT WORK EXPERIENCE).PROVEN EXPERIENCE IN IT SECURITY AND NETWORK MONITORING.FAMILIARITY WITH SECURITY TOOLS, INCLUDING CISCO AMP, FIREPOWER, STEALTHWATCH, AND ESET.STRONG TROUBLESHOOTING SKILLS FOR SECURITY SYSTEMS AND HARDWARE.KNOWLEDGE OF BEST PRACTICES FOR IT SECURITY AND COMPLIANCE.AWS CLOUD EXP IS A MUSTEXCELLENT COMMUNICATION AND DOCUMENTATION SKILLS.ABILITY TO WORK EFFECTIVELY IN A TEAM AND HANDLE MULTIPLE TASKS.",
    "job_skill_set": [
      "Communication",
      "Teamwork",
      "Flexibility",
      "Multitasking",
      "IT Security Systems Design",
      "Network Monitoring",
      "Auditing",
      "Cisco AMP",
      "Cisco Firepower",
      "Cisco Stealthwatch",
      "QRadar",
      "ESET",
      "Troubleshooting",
      "AWS Cloud",
      "Documentation"
    ],
    "short_keywords": [
      "amp",
      "analyst",
      "auditing",
      "aws",
      "cisco",
      "cloud",
      "communication",
      "design",
      "documentation",
      "eset",
      "firepower",
      "flexibility",
      "information",
      "informationtechnology",
      "it",
      "monitoring",
      "multitasking",
      "network",
      "qradar",
      "security",
      "stealthwatch",
      "systems",
      "teamwork",
      "technology",
      "troubleshooting"
    ]
  },
  {
    "job_id": "3902759048",
    "job_title": "Application Analyst I, Day Shift, Information Technology",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "SUPPORT CENTER\n\nIF YOU ARE A CURRENT ADVENTIST HEALTHCARE EMPLOYEE, PLEASE CLICK THIS LINK TO APPLY THROUGH YOUR WORKDAY ACCOUNT.\n\nADVENTIST HEALTHCARE SEEKS TO HIRE AN EXPERIENCED APPLICATION ANALYST I FOR OUR SUPPORT CENTER WHO WILL EMBRACE OUR MISSION TO EXTEND GOD’S CARE THROUGH THE MINISTRY OF PHYSICAL, MENTAL, AND SPIRITUAL HEALING.\n\nAS AN APPLICATION ANALYST I YOU WILL\n\nREVIEW AND MANAGE END-USER TROUBLE TICKETS, ENSURING ALL ASSIGNED WORK IS COMPLETED WITHIN THE REQUIRED SERVICE LEVEL AGREEMENTS.PROVIDE FIRST-LEVEL TROUBLESHOOTING FOR APPLICATIONS WITHIN THE CLINICAL AND BUSINESS DOMAINS.PARTICIPATE IN THE ON-CALL ROTATION AS A LIAISON BETWEEN CUSTOMERS AND BUSINESS LINES.PERFORM BASIC TROUBLESHOOTING FOR COMPUTERS AND COMPUTER PERIPHERALS.TRACK, RESOLVE, AND MANAGE ENHANCEMENT REQUESTS, ACTIVELY PARTICIPATING IN SYSTEM TESTING.MANAGE AND RESOLVE SERVICE REQUESTS AND INCIDENTS ASSIGNED VIA THE SERVICE DESK TICKETING SYSTEM, ADHERING TO STANDARD OPERATING PROCEDURES OR DEFINING NEW SOPS AS NEEDED.COORDINATE WITH SECOND AND THIRD-LEVEL SUPPORT TO RESOLVE ISSUES, LIAISING WITH SYSTEM VENDORS AS NECESSARY.COMMUNICATE WITH END USERS AND OTHER TEAM MEMBERS REGARDING ISSUES NOT RESOLVED WITHIN DEFINED SERVICE LEVEL AGREEMENTS.CONDUCT ROUNDING AND CONNECT WITH END USERS AT ALL LOCATIONS AS SCHEDULED, DOCUMENTING AND RESOLVING ISSUES AS APPROPRIATE.CARRY OUT SYSTEM MODIFICATIONS OR CHANGE REQUESTS FOLLOWING THE CHANGE MANAGEMENT PROCESS\n\nQUALIFICATIONS INCLUDE\n\nBACHELOR’S DEGREE IN COMPUTER SCIENCE OR INFORMATION TECHNOLOGY IS PREFERRED.MINIMUM OF 2-3 YEARS OF EXPERIENCE IN A HEALTHCARE IT SETTING, FOCUSING ON APPLICATION SUPPORT AND ANALYSIS.\n\nWORK SCHEDULE\n\nMONDAY - FRIDAY 8 AM -5 PM WITH ON-CALL ROTATION\n\n#GR8 INFORMATION TECHNOLOGY\n\nAT ADVENTIST HEALTHCARE OUR JOB IS TO CARE FOR YOU.\n\nWE DO THIS BY OFFERING\n\nWORK LIFE BALANCE THROUGH NONROTATING SHIFTSRECOGNITION AND REWARDS FOR PROFESSIONAL EXPERTISE403(B) RETIREMENT PLANFREE EMPLOYEE PARKINGBENEFITS ELIGIBLE POSITIONS:COMPETITIVE, COMPREHENSIVE BENEFIT PLANS [INCLUDING HEALTH, EMPLOYER-PAID DISABILITY AND LIFE INSURANCE, PTO]EMPLOYER RETIREMENT CONTRIBUTION AND MATCH AFTER 1-YEAR OF ELIGIBLE EMPLOYMENT WITH 3 YEAR VESTING ANCILLARY BENEFITS SUCH AS FLEXIBLE SPENDING, LEGAL AND PET INSURANCE TO MEET THE NEEDS OF EMPLOYEES AND THEIR ELIGIBLE FAMILY MEMBERSSUBSIDIZED CHILDCARE AT PARTICIPATING CHILDCARE CENTERS\nAS A FAITH-BASED ORGANIZATION, WITH OVER A CENTURY OF CARING FOR THE COMMUNITIES IN THE MARYLAND AREA, ADVENTIST HEALTHCARE HAS EARNED A REPUTATION FOR HIGH-QUALITY, COMPASSIONATE CARE. ADVENTIST HEALTHCARE WAS THE FIRST AND IS THE LARGEST HEALTHCARE PROVIDER IN MONTGOMERY COUNTY.\n\nIF YOU WANT TO MAKE A DIFFERENCE IN SOMEONE’S LIFE EVERY DAY, CONSIDER A POSITION WITH A TEAM OF PROFESSIONALS WHO ARE DOING JUST THAT, MAKING A DIFFERENCE.\n\nJOIN THE ADVENTIST HEALTHCARE TEAM TODAY, APPLY NOW TO BE CONSIDERED!\n\nCOVID-19 VACCINATION\n\nADVENTIST HEALTHCARE REQUIRES ALL APPLICANTS TO BE FULLY VACCINATED FOR COVID-19 BEFORE COMMENCING EMPLOYMENT. APPLICANTS MAY BE REQUIRED TO FURNISH PROOF OF VACCINATION AND, IF NEEDED, MAY ELECT TO BE VACCINATED AT ANY COMMUNITY PHARMACY OR LOCATION OFFERING COVID-19 VACCINATIONS.\n\nTOBACCO AND DRUG STATEMENT\n\nTOBACCO USE IS A WELL-RECOGNIZED PREVENTABLE CAUSE OF DEATH IN THE UNITED STATES AND AN IMPORTANT PUBLIC HEALTH ISSUE. IN ORDER TO PROMOTE AND MAINTAIN A HEALTHY WORK ENVIRONMENT, ADVENTIST HEALTHCARE WILL NOT HIRE APPLICANTS FOR EMPLOYMENT WHO EITHER STATE THAT THEY ARE NICOTINE USERS OR WHO TEST POSITIVE FOR NICOTINE AND DRUG USE.\n\nWHILE SOME JURISDICTIONS, INCLUDING MARYLAND, PERMIT THE USE OF MARIJUANA FOR MEDICAL PURPOSES, MARIJUANA CONTINUES TO BE CLASSIFIED AS AN ILLEGAL DRUG UNDER THE FEDERAL CONTROLLED SUBSTANCES ACT. AS A RESULT, MEDICAL MARIJUANA USE WILL NOT BE ACCEPTED AS A VALID EXPLANATION FOR A POSITIVE DRUG TEST RESULT.\n\nADVENTIST HEALTHCARE WILL WITHDRAW OFFERS OF EMPLOYMENT TO APPLICANTS WHO TEST POSITIVE FOR COTININE (NICOTINE) AND MARIJUANA. THOSE TESTING POSITIVE ARE GIVEN THE OPPORTUNITY TO RE-APPLY IN 90 DAYS, IF THEY CAN TRUTHFULLY ATTEST THAT THEY HAVE NOT USED ANY NICOTINE PRODUCTS IN THE PAST NINETY (90) DAYS AND SUCCESSFULLY PASS FOLLOW-UP TESTING. (\"NICOTINE PRODUCTS\" INCLUDE, BUT ARE NOT LIMITED TO: CIGARETTES, CIGARS, PIPES, CHEWING TOBACCO, E-CIGARETTES, VAPING PRODUCTS, HOOKAH, AND NICOTINE REPLACEMENT PRODUCTS (E.G., NICOTINE GUM, NICOTINE PATCHES, NICOTINE LOZENGES, ETC.).\n\nEQUAL EMPLOYMENT OPPORTUNITY\n\nADVENTIST HEALTHCARE IS AN EQUAL OPPORTUNITY/AFFIRMATIVE ACTION EMPLOYER. WE ARE COMMITTED TO ATTRACTING, ENGAGING, AND DEVELOPING THE BEST PEOPLE TO CULTIVATE OUR MISSION-CENTRIC CULTURE. OUR GOAL IS TO HAVE A WELCOMING, EQUITABLE, AND SAFE PLACE TO WORK AND GROW FOR ALL EMPLOYEES, NO MATTER THEIR BACKGROUND. AHC DOES NOT DISCRIMINATE IN EMPLOYMENT OPPORTUNITIES OR PRACTICES ON THE BASIS OF RACE, ETHNICITY, COLOR, RELIGION, SEX, NATIONAL ORIGIN, AGE, DISABILITY, SEXUAL ORIENTATION, GENDER IDENTITY, PREGNANCY AND RELATED MEDICAL CONDITIONS, PROTECTED VETERAN STATUS, OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW.\n\nADVENTIST HEALTHCARE WILL MAKE REASONABLE ACCOMMODATIONS FOR APPLICANTS WITH DISABILITIES, IN ACCORDANCE WITH APPLICABLE LAW. ADVENTIST HEALTHCARE IS A RELIGIOUS ORGANIZATION AS DEFINED UNDER APPLICABLE LAW; HOWEVER, IT WILL ENDEAVOR TO PROVIDE REASONABLE ACCOMMODATIONS FOR APPLICANTS’ RELIGIOUS BELIEFS.\n\nAPPLICANTS WHO WISH TO REQUEST ACCOMMODATIONS FOR DISABILITIES OR RELIGIOUS BELIEF SHOULD CONTACT THE SUPPORT CENTER HR OFFICE.",
    "job_skill_set": [
      "troubleshooting",
      "ticketing system",
      "application support",
      "system testing",
      "change management",
      "computer science",
      "information technology",
      "enhancement requests",
      "communication",
      "teamwork",
      "problem solving",
      "customer service",
      "adaptability",
      "documentation",
      "service level agreements"
    ],
    "short_keywords": [
      "adaptability",
      "agreements",
      "analyst",
      "application",
      "change",
      "communication",
      "computer",
      "customer",
      "day",
      "documentation",
      "enhancement",
      "i",
      "information",
      "informationtechnology",
      "level",
      "management",
      "problem",
      "requests",
      "science",
      "service",
      "shift",
      "solving",
      "support",
      "system",
      "teamwork",
      "technology",
      "testing",
      "ticketing",
      "troubleshooting"
    ]
  },
  {
    "job_id": "3902843719",
    "job_title": "Information Technology Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "COMPANY DESCRIPTION\n ENSPYRE MANAGEMENT SERVICES IS A CERTIFIED SMALL BUSINESS BASED IN CHICAGO, IL. WE SPECIALIZE IN PROVIDING IT, PROJECT MANAGEMENT, AND ENERGY SOLUTIONS. WE HAVE A COLLABORATIVE LEADERSHIP STYLE THAT HAS LED TO OUR HISTORY OF SUCCESS IN ACCOMPLISHING SHORT- AND LONG-RANGE OBJECTIVES. OUR TEAM EXCELS AT CONVEYING COMPLEX TECHNICAL INFORMATION AND PROPOSING INNOVATIVE SOLUTIONS TO BUILD CONSENSUS WITH KEY STAKEHOLDERS AND EXECUTIVE LEADERSHIP. WE REMAIN AT THE FOREFRONT OF RAPIDLY EVOLVING TECHNOLOGY TO DRIVE ENTERPRISE-WIDE INNOVATION AND MAINTAIN A COMPETITIVE ADVANTAGE.\n ROLE DESCRIPTION\n THIS IS A CONTRACT ROLE FOR AN INFORMATION TECHNOLOGY SPECIALIST. THE IT SPECIALIST WILL BE RESPONSIBLE FOR NETWORK ADMINISTRATION, TROUBLESHOOTING, NETWORK SECURITY, AND PROVIDING EXCEPTIONAL CUSTOMER SERVICE. THIS IS A HYBRID ROLE, BASED IN CHICAGO, IL, WITH FLEXIBILITY FOR SOME REMOTE WORK.\n QUALIFICATIONS\n NETWORK ADMINISTRATION AND TROUBLESHOOTING SKILLSEXPERIENCE IN INFORMATION TECHNOLOGYNETWORK SECURITY KNOWLEDGESTRONG CUSTOMER SERVICE SKILLSEXCELLENT PROBLEM-SOLVING ABILITIESABILITY TO WORK BOTH INDEPENDENTLY AND AS PART OF A TEAMEXCELLENT COMMUNICATION AND INTERPERSONAL SKILLSRELEVANT CERTIFICATIONS SUCH AS COMPTIA NETWORK+, CISCO CCNA, OR MICROSOFT CERTIFIED SOLUTIONS ASSOCIATE (MCSA)",
    "job_skill_set": [
      "network administration",
      "troubleshooting",
      "network security",
      "customer service",
      "CompTIA Network+",
      "problem-solving",
      "teamwork",
      "communication",
      "interpersonal skills",
      "Cisco CCNA",
      "Microsoft Certified Solutions Associate (MCSA)"
    ],
    "short_keywords": [
      "administration",
      "associate",
      "ccna",
      "certified",
      "cisco",
      "communication",
      "comptia",
      "customer",
      "information",
      "informationtechnology",
      "interpersonal",
      "mcsa",
      "microsoft",
      "network",
      "problemsolving",
      "security",
      "service",
      "skills",
      "solutions",
      "specialist",
      "teamwork",
      "technology",
      "troubleshooting"
    ]
  },
  {
    "job_id": "3905849817",
    "job_title": "Information Technology Support Technician",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "THEIR IS A PHYSICAL ASPECT TO THIS JOB THAT THE THE TECHNICAL TEAM ON CAMPUS MUST WORK IN ALL IT AND AV CAPACITIES, INCLUDING INSTALLING AND MOVING EQUIPMENT; CONDUCTING, AND PREPARING INVENTORY FOR DISPOSAL; ADDRESSING ISSUES WITH MOUNTED CAMERAS, MICROPHONES, AND PROJECTORS. \nLOCATION: JACKSONVILLE CAMPUS (100% ONSITE) HOURS:37.5HR PER WEEKSCHEDULE:DAYS, EVENINGS AND WEEKENDS, DEPENDING ON OPERATIONAL NEEDSINITIAL WORK HOURS:8:30AM - 5:00PM M-F, 1 HR LUNCH\n\nUNDER DIRECT SUPERVISION PROVIDES ACCURATE AND TIMELY, TECHNICAL SUPPORT SERVICES TO STUDENTS, FACULTY AND STAFF VIA TELEPHONE, CHAT, EMAIL, REMOTELY AND AT DESK SIDE. RESOLVES SUPPORT ISSUES OF A BASIC TECHNICAL NATURE WITH VARYING DEGREES OF PRIORITY. ADDRESSES INCIDENTS WITHIN PREDETERMINED SERVICE LEVELS, REQUIRING THE ABILITY TO MULTI-TASK AND PRIORITIZE.INSTALLS AND MAINTAINS SOFTWARE SYSTEMS FOR FACULTY AND STAFF TO ENSURE TECHNOLOGY RESOURCES ARE PROPERLY FUNCTIONING.REPAIRS AND TROUBLESHOOTS COMPUTER EQUIPMENT AT THE SITE TO ENSURE PROBLEMS ARE RESOLVED TIMELY.PROVIDES FIRST-LINE, BASIC, SUPPORT FOR THE INSTALLATION, CONFIGURATION, MAINTENANCE AND SUPPORT OF HARDWARE AND SOFTWARE FOR DESKTOPS, LAPTOPS, WIRELESS AND CELLULAR DEVICES, WINDOWS-BASED SERVERS, PERIPHERALS, VIDEOCONFERENCING, WIRELESS, LANS, WANS AND DIGITAL MEDIA.PROVIDES SUPPORT AT ALL FACILITIES INCLUDING SMART CLASSROOMS, ELECTRONIC CLASSROOMS, OFFICES, CLINICS, VIDEOCONFERENCING CLASSROOMS, AND ALL UNIVERSITY LOCATIONS ON CAMPUS OR OFF, AS REQUIRED.RESOLVES ISSUES FOR FACULTY AND/OR STAFF ENCOUNTERING HARDWARE, SOFTWARE AND OTHER PROBLEMS RELATING TO TECHNOLOGIES' RESOURCES.INSPECTS AND RECOMMENDS MAINTENANCE OF EQUIPMENT HOUSED IN UNIVERSITY FACILITIES: OFFICES, SMART CLASSROOMS, ELECTRONIC CLASSROOMS, VIDEOCONFERENCING CLASSROOMS AND CLINICS, AS ASSIGNED.USES APPROPRIATE DEPARTMENTAL SOFTWARE TO LOG AND TRACK USER REQUESTS AND PROBLEM REPORTS IN A TIMELY MATTER.PROVIDES CUSTOMER SERVICE AND TECHNICAL SUPPORT TO OUR NSU COMMUNITY REMOTELY AND ON-SITE.MOVES PCS AND OTHER TECHNOLOGY EQUIPMENT WITHIN UNIVERSITY FACILITIES TO OTHER LOCATIONS ON AND OFF CAMPUS.PERFORMS OTHER DUTIES AS ASSIGNED. ? REQUIREMENTS:ABILITY TO LIFT OBJECTS WEIGHING UP TO 50 POUNDS AND TO CLIMB LADDERS IF REQUIRED.EXCELLENT ORAL AND WRITTEN SKILLS.ABILITY TO WORK COLLABORATIVELY WITH OTHER TECHNOLOGY SUPPORT UNITS WITHIN OIIT AND THROUGHOUT THE UNIVERSITY COMMUNITY.POSSESS THE REQUIRED SKILLS, KNOWLEDGE, AND EXPERIENCE TO EFFECTIVELY MANAGE TECHNICAL SUPPORT FUNCTIONS INCLUDING BUT NOT LIMITED TO THE INSTALLATION, CONFIGURATION, MAINTENANCE AND SUPPORT OF HARDWARE AND SOFTWARE AT FACILITIES ON AND OFF CAMPUS, AS REQUIRED.EXCELLENT WRITTEN AND ORAL COMMUNICATION SKILLS.INFORMATION GATHERING AND MONITORING SKILLS? INCLUDING THE ABILITY TO PREPARE REPORTS, WHILE MAINTAINING CONFIDENTIALITY.TAKES INITIATIVE, IS FLEXIBLE, AND PROVIDES GREAT ATTENTION TO DETAIL AND ACCURACY.POSSESSES ADVANCED COMPUTER SKILLS AND IS ABLE TO TRAIN OTHERS.KNOWLEDGE OF ACCOUNTING AND DATABASE MAINTENANCE AND/OR CALL ACCOUNTING SOFTWARE.GENERAL KNOWLEDGE OF CELLULAR SERVICES.",
    "job_skill_set": [
      "technical support",
      "hardware installation",
      "software installation",
      "troubleshooting",
      "computer maintenance",
      "customer service",
      "networking (LAN/WAN)",
      "advanced computer skills",
      "database maintenance",
      "communication",
      "teamwork",
      "problem solving",
      "attention to detail",
      "flexibility",
      "initiative",
      "time management",
      "report preparation",
      "inventory management",
      "videoconferencing support",
      "call accounting software",
      "lifting (up to 50 pounds)",
      "climbing ladders",
      "confidentiality"
    ],
    "short_keywords": [
      "50",
      "accounting",
      "advanced",
      "attention",
      "call",
      "climbing",
      "communication",
      "computer",
      "confidentiality",
      "customer",
      "database",
      "detail",
      "flexibility",
      "hardware",
      "information",
      "informationtechnology",
      "initiative",
      "installation",
      "inventory",
      "ladders",
      "lanwan",
      "lifting",
      "maintenance",
      "management",
      "networking",
      "pounds",
      "preparation",
      "problem",
      "report",
      "service",
      "skills",
      "software",
      "solving",
      "support",
      "teamwork",
      "technical",
      "technician",
      "technology",
      "time",
      "to",
      "troubleshooting",
      "up",
      "videoconferencing"
    ]
  },
  {
    "job_id": "3889718108",
    "job_title": "Information Technology Support Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "SALES REPRESENTATIVE - NORTHEAST TARGET STATES: BALTIMORE, MD, WASHINGTON,DC AND DELAWARE\n\nDIGI AMERICA INC, WAS FOUNDED IN 1974 AS THE EXCLUSIVE US DISTRIBUTOR OF THE DIGI BRAND OF SUPERMARKET SCALES AND AUTOMATED WRAPPERS. SINCE OUR INCEPTION, DIGI AMERICA HAS AGGRESSIVELY BROADENED THE DIGI BRAND ACROSS THE UNITED STATES AND EXPANDED OUR SELLING TERRITORY TO INCLUDE BOTH CENTRAL AMERICA AND THE CARIBBEAN. DURING THAT TIME, DIGI AMERICA HAS ADDED MAJOR RETAILERS LIKE COSTCO, WALMART CENTRAL AMERICA, AHOLD USA, WINCO, AND H.E.B. AS VALUED AND LOYAL CUSTOMERS. DIGI AMERICA INC. CONTINUES TO OFFER THE HIGHEST QUALITY AND BEST VALUE ON A COMPREHENSIVE RANGE OF SUPERMARKET SCALES AND WRAPPERS, ALWAYS PUTTING OUR CUSTOMERS FIRST.\n\nTO PROSPECT, PROMOTE, AND INCREASE CUSTOMER AND DEALER ACCOUNTS IN THE NORTHEAST REGION AS IT RELATES TO RETAIL FOOD EQUIPMENT INCLUDING DIGITAL FOOD INDUSTRY SCALES, AUTOMATED WRAPPING SYSTEMS, ZERO WASTE SOLUTIONS, AND CONSUMABLE FILM/ LABELS.\n\nACHIEVE MONTHLY, QUARTERLY, AND ANNUAL SALES PLANS.\n\nSALARY RANGE: $52K - $58K PER YEAR\n\nRESPONSIBILITIES\n\n 50% - 75% REQUIRED TERRITORY TRAVEL TO PROSPECT FOR LEAD GENERATION & CONVERSION, CONDUCT SALES PRESENTATIONS, MEET WITH DEALERS & CUSTOMERS, DEMO SOLUTIONS, AND PENETRATE THE ADDRESSABLE TARGET MARKET.  PRESENT, DEMO, AND SELL THE FULL PORTFOLIO OF DIGI PRODUCTS AND SERVICES TO PROSPECTS, CUSTOMERS, AND DEALERS/DISTRIBUTORS.  DEVELOP SOLUTIONS BASED ON CUSTOMER NEEDS THROUGH ACTIVE CUSTOMER ENGAGEMENT, LISTENING TO CUSTOMER NEEDS, AND PROBLEM SOLVING WITH ROI FOR DIGI SOLUTIONS.  RESPONSIBILITIES INCLUDE COLD CALLING TO ESTABLISH AND DEVELOP RELATIONSHIPS WITH NEW CUSTOMERS AND PROSPECTS.  AFTER UNDERSTANDING AND ADDRESSING CUSTOMERS’ NEEDS, PREPARE QUOTATIONS.  DEVELOP STRATEGY AND ACTIONS PLANS TO FORECAST, MEET, AND EXCEED SALES REVENUE PLAN.  MAINTAIN AND SUPPORT EXISTING DEALER AND CUSTOMER RELATIONSHIPS THROUGH REGULAR CONTACT AND SUPPORT.  INCREASE POSITIVE BRAND AWARENESS THROUGH CASE STUDIES AND DIGITAL SOCIAL MEDIA PLATFORMS.  UTILIZE EXPENSE ALLOWANCE WITHIN COMPANY GUIDELINES TO MAXIMIZE SALES ACTIVITY AND EFFICIENCY.  EXPEDITE THE RESOLUTION OF CUSTOMER PROBLEMS AND COMPLAINTS TO ENSURE CUSTOMER DELIGHT.  WORK WITH SALES MANAGER AND SALES TEAM TO OVERCOME OBJECTIONS AND ACHIEVE BUDGET GOALS WITHIN PLAN TIMEFRAME.  COORDINATE DELIVERY AND INSTALLATION OF DIGI EQUIPMENT TO CUSTOMERS WITH THE ASSISTANCE OF PRODUCT SUPPORT AND SERVICE TEAMS  ANALYZE ADDRESSABLE AND ADJACENT TARGET MARKETS WITHIN TERRITORY FOR TRENDS AND POTENTIAL, WHILE TRACKING AND RECORDING PROGRESS  PROVIDE CUSTOMER FEEDBACK INCLUDING NEEDS, USAGE, COMPETITOR ACTIVITY, AND POTENTIAL FOR DIGI SOLUTIONS. \n\nQUALIFICATIONS\n\n VALID DRIVER’S LICENSE WITH SAFE DRIVING RECORD AND RELIABLE TRANSPORTATION PREFERRED BUSINESS DEGREE  2-3 YEARS OF PROGRESSIVE SALES EXPERIENCE SELLING THROUGH DISTRIBUTION/RESELLER NETWORK WITH PROVEN TRACK RECORD FOR SALES GROWTH  MUST RESIDE IN THE STATE OF NEW JERSEY.  REQUIRED STRONG COMMUNICATIONS, ORGANIZATION, PRESENTATION, NEGOTIATION, AND SELLING SKILLS.  KNOWLEDGE OF MS OFFICE. \n\nTRAVEL\n\n TRAVEL IS REQUIRED, WITH THE POSSIBILITY OF UP TO 50% - 75% TRAVEL REQUIRED. \n\nPLEASE SEND YOUR RESUME TO RESUME@US.DIGI-GROUP.COM",
    "job_skill_set": [
      "presentation",
      "MS Office",
      "problem solving",
      "communication",
      "organization",
      "relationship building",
      "teamwork",
      "customer service",
      "time management",
      "sales",
      "customer engagement",
      "negotiation",
      "lead generation",
      "quotations preparation",
      "market analysis",
      "product demonstration",
      "adaptability",
      "strategic planning"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "building",
      "communication",
      "customer",
      "demonstration",
      "engagement",
      "generation",
      "information",
      "informationtechnology",
      "lead",
      "management",
      "market",
      "ms",
      "negotiation",
      "office",
      "organization",
      "planning",
      "preparation",
      "presentation",
      "problem",
      "product",
      "quotations",
      "relationship",
      "sales",
      "service",
      "solving",
      "specialist",
      "strategic",
      "support",
      "teamwork",
      "technology",
      "time"
    ]
  },
  {
    "job_id": "3902329403",
    "job_title": "Information Technology Support Engineer",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "OUR ENTERPRISE-LEVEL CLIENT IN VANCE, AL, HAS AN IMMEDIATE NEED FOR SEVERAL IT SUPPORT TECHNICIANS ACROSS MULTIPLE 12-HOUR SHIFTS IN A MANUFACTURING / FACTORY SETTING. PLEASE SEE BELOW FOR FULL DETAILS:\nJOB NOTES:--6+ MONTH CONTRACT / EXTENDABLE AND LIKELY TO GO PERM WITH GOOD PERFORMANCE.--ONSITE IN VANCE, ALABAMA--DRUG & BACKGROUND CHECK REQUIRED.--DUE TO THE NATURE OF THE 24/7/365 FACTORY SCHEDULE, THE CLIENT CAN ONLY CONSIDER CANDIDATES WHO ARE FLEXIBLE ON THE SHIFT THEY CAN WORK.\nSHIFT DETAILS: - CLIENT USES A 12-HOUR SHIFT MODEL. THE SHIFTS WILL BE AS FOLLOWS:\nHOURS: 6AM – 6PM OR 6PM – 6AM--WEEK 1 WILL BE A 3 DAY WEEK (OFF DAYS CONSECUTIVE, SO 4 DAYS OFF)--WEEK 2 WILL BE A 4 DAY WEEK (OFF DAYS CONSECUTIVE, SO 3 DAYS OFF)NOTE: THIS WILL BE AFTER THE TRAINING PERIOD.\n- DAYS WORKED = SUNDAY - TUESDAY OR WEDNESDAY - FRIDAY AND THEN EVERY OTHER SATURDAY.\nMAIN RESPONSIBILITIES:--PERFORM A RANGE OF TECHNICAL WORK ACTIVITIES EITHER REMOTELY OR AT CUSTOMER SITE TO MEET BUSINESS AND CUSTOMER REQUIREMENTS.--COORDINATE SMALL TEAMS DELIVERING BASIC WORK PACKAGES IN LINE WITH COMPANY PROCESS TO MEET BUSINESS AND CUSTOMER REQUIREMENTS.--DOCUMENT AND REPORTS ON WORK COMPLETED TO ENSURE COMPLIANCE WITH COMPANY AND CUSTOMER PROCEDURES.--ESCALATE ISSUES IN LINE WITH COMPANY PROCESSES TO ENSURE CUSTOMER DEMANDS ARE MET AND EVALUATE ESCALATIONS AND ACTION APPROPRIATELY TO ENSURE CUSTOMER DEMANDS ARE MET.--PROVIDE CUSTOMER SERVICE TO INTERNAL AND EXTERNAL CUSTOMERS TO ENSURE CONSISTENT EXPERIENCE.--ABILITY TO ADAPT QUICKLY TO DYNAMIC TEAM ENVIRONMENTS TO MAINTAIN CONSISTENT EFFECTIVE CONTRIBUTION.\nTHE IDEAL CANDIDATE:--ABLE TO FOLLOW INSTRUCTIONS AND PROCEDURES--PROVEN EXPERIENCE IN IT DESKTOP SERVICE ENVIRONMENT.--USES INFORMATION SYSTEMS, TECHNOLOGY FUNCTIONS AND APPLICATIONS IN LINE WITH IT INDUSTRY STANDARDS AS APPROPRIATE TO THE ROLE--DEMONSTRATES AN ORGANIZED APPROACH TO WORK.--DEMONSTRATES CUSTOMER SERVICE ABILITIES--ROUTINE ADMINISTRATIVE SKILLS--GOOD INTERPERSONAL SKILLS, BASIC LITERACY AND NUMERACY SKILLS--DEMONSTRATES AWARENESS OF HEALTH AND SAFETY AT WORK.\nWHY CHOOSE MERGE IT?WE HAVE A TEAM OF TALENTED AND AMBITIOUS PROFESSIONALS THAT DRIVE GROWTH BY IDENTIFYING AND DELIVERING TOP QUALITY IT TALENT FOR OUR FORTUNE 100, ENTERPRISE-LEVEL CLIENTS (AKA ‘BIG NAME’ - THINK BIG BANKS, BIG PHARMA, ETC.).\nWE WOULD LOVE TO CONNECT WITH YOU! FOLLOW US ON SOCIAL MEDIA AND BE THE FIRST TO KNOW ABOUT OPEN POSITIONS, CAREER ADVICE, AND INSIDER TIPS AND TRICKS. FIND US BY SEARCHING @MERGEITLLC ON INSTAGRAM, FACEBOOK, OR TWITTER OR PASTE THIS LINK INTO YOUR BROWSER: HTTPS://COMPILED.SOCIAL/MERGEITLLC\nMERGE IT IS AN EQUAL OPPORTUNITY EMPLOYER. WE CELEBRATE DIVERSITY AND ARE COMMITTED TO CREATING AN INCLUSIVE ENVIRONMENT FOR ALL EMPLOYEES. IN COMPLIANCE WITH FEDERAL LAW, ALL PERSONS HIRED WILL BE REQUIRED TO VERIFY IDENTITY AND ELIGIBILITY TO WORK IN THE UNITED STATES AND TO COMPLETE THE REQUIRED EMPLOYMENT ELIGIBILITY VERIFICATION DOCUMENT FORM UPON HIRE. NOTHING IN THIS JOB POSTING GUARANTEES EMPLOYMENT.",
    "job_skill_set": [
      "IT desktop service",
      "technical work activities",
      "information systems",
      "technology functions",
      "administrative skills",
      "customer service",
      "team coordination",
      "adaptability",
      "communication",
      "interpersonal skills",
      "organizational skills",
      "problem solving",
      "health and safety awareness"
    ],
    "short_keywords": [
      "activities",
      "adaptability",
      "administrative",
      "and",
      "awareness",
      "communication",
      "coordination",
      "customer",
      "desktop",
      "engineer",
      "functions",
      "health",
      "information",
      "informationtechnology",
      "interpersonal",
      "it",
      "organizational",
      "problem",
      "safety",
      "service",
      "skills",
      "solving",
      "support",
      "systems",
      "team",
      "technical",
      "technology",
      "work"
    ]
  },
  {
    "job_id": "3904403623",
    "job_title": "Information Technology Support Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "AT FOSS, WE ARE DRIVEN BY A STRONG SENSE OF PURPOSE, AND WE HOPE YOU ARE TOO. A FAST-GROWING WORLD POPULATION MEANS THAT THE GLOBAL FOOD PRODUCTION WILL HAVE TO INCREASE BY 60% BY 2050 TO MEET DEMAND. WE WANT TO COME UP WITH SMARTER WAYS TO MAKE THE BEST USE OF AGRICULTURAL RESOURCES, AND TO HELP ELIMINATE FOOD WASTE. IF THAT SOUNDS LIKE SOMETHING YOU WOULD LIKE TO GET OUT OF BED FOR EVERY MONDAY MORNING, THEN READ ON.\nTHE IT SUPPORT SPECIALIST PROVIDES TECHNICAL SUPPORT FOR THE COMPANY'S IT SYSTEMS TO FOSS EMPLOYEES BY HANDLING REQUESTS FROM END USERS ON-SITE AND REMOTELY, IN ACCORDANCE WITH USER NEEDS. HANDLES REQUESTS ACCORDING TO INTERNAL PROCEDURES AND DEFINED COMPLETION DEADLINES. ALSO IMPLEMENTS NEW ORGANIZATIONAL AND TECHNOLOGICAL SOLUTIONS AIMED AT IMPROVING THE ORGANIZATION'S EFFICIENCY AND SECURITY.\n\nKEY TASKS AND RESPONSIBILITIES RELATED TO THE BUSINESS AREA AND SERVICE PROVIDED:\nSUPPORT FOR USERS REGARDING HARDWARE, SOFTWARE, AND NETWORK ISSUES USING TOOLS SUCH AS THE TICKETING SYSTEM, PHONE, SKYPE, TEAMS, AND EMAIL.REGISTERING AND RESOLVING INCIDENTS AND SERVICE REQUESTS IN THE TICKETING SYSTEM.ANALYZING, CLASSIFYING, AND RESOLVING INCIDENTS AND SERVICE REQUESTS REGISTERED BY USERS IN ACCORDANCE WITH ESTABLISHED PROCEDURES, PROCESSES, AND SLAS.CONFIGURING AND INSTALLING COMPUTERS AND APPLICATIONS,REMOTELY ADMINISTERING SYSTEMS AND SERVICES SUCH AS OFFICE 365, EXCHANGE, SHAREPOINT, ACTIVE DIRECTORY, ETC.CLOSE COOPERATION WITH HIGHER LEVELS OF SUPPORT.ONSITE SUPPORT.ACTIVE PARTICIPATION IN MONITORING THE CORRECTNESS OF IT INFRASTRUCTURE FUNCTIONING IN FOSS.CREATING DOCUMENTATION.ONGOING CONTACT WITH IT SERVICE PROVIDERS.PERFORMING TASKS IN ACCORDANCE WITH INTERNATIONAL IT SERVICE STANDARDS SUCH AS ITIL, ISO 27001, ETC.\n\nKEY COMPETENCIES, SKILLS, AND EXPECTED ATTITUDES REQUIRED FOR THE PROPER PERFORMANCE OF TASKS:\nVERY GOOD KNOWLEDGE OF ENGLISH IN SPEECH AND WRITING.KNOWLEDGE OF ACTIVE DIRECTORY SERVICE.KNOWLEDGE OF WINDOWS, OFFICE365, SHAREPOINT, WINDOWS SERVER, ETC.BASIC NETWORK KNOWLEDGE.ABILITY TO DIAGNOSE USER PROBLEMS.PROFESSIONAL COMMUNICATION WITH USERS AND VENDORS.COMPREHENSIVE APPROACH TO REPORTED PROBLEMS.ENSURING A HIGH LEVEL OF TICKET HANDLING AND USER SATISFACTION.PUNCTUALITY AND TAKING RESPONSIBILITY FOR THE ASSIGNED TASKS.CLOSE TEAMWORK WITHIN THE TEAM AND BETWEEN OTHER DEPARTMENTS.HELPING TO MAINTAIN A HIGH LEVEL OF IT SECURITY IN THE DEPARTMENT.ENSURING COMPLIANCE WITH COMPANY VALUES AND QUALITY STANDARDS.\nFOSS\nTODAY, MORE THAN 8 BILLION PEOPLE AROUND THE WORLD ARE DEPENDENT ON NUTRITIONAL FOOD. TONS OF FOOD BEING PRODUCED IN A MILLION DIFFERENT WAYS AND UNDER VARYING CONDITIONS, CREATING CHALLENGES ALL THE WAY FROM FIELD TO FORK. ONE OF THEM, OBVIOUSLY, BEING THE EFFECTS IT HAS ON CLIMATE CHANGE.\nFOSS HELPS THE WORLD’S 100 BIGGEST FOOD COMPANIES AND MORE THAN 40,000 OTHERS AROUND THE WORLD NAVIGATE EXACTLY THAT WITH INTELLIGENT, DATA-DRIVEN AND INNOVATIVE ANALYTICAL SOLUTIONS. WE ARE MAKING SUSTAINABILITY A BETTER BUSINESS AND WE’RE DOING SO AS GLOBAL MARKET LEADER IN OUR FIELD – IMPROVING FOOD QUALITY, MINIMIZING FOOD WASTE, ENSURING FOOD SAFETY, AND SECURING FAIR PAYMENT.\nJOIN A PIONEERING AND INNOVATIVE COMPANY IN THE FOOD AND AGRICULTURE INDUSTRY. A COMPANY ON A MISSION, WITH OFFICES ALL AROUND THE WORLD AND 1,700 TALENTED COLLEAGUES FROM MORE THAN 32 DIFFERENT COUNTRIES.",
    "job_skill_set": [
      "Windows",
      "Basic Network Knowledge",
      "Professional Communication",
      "Problem Diagnosis",
      "Teamwork",
      "Responsibility",
      "User Satisfaction",
      "Documentation",
      "Comprehensive Approach",
      "Active Directory",
      "Office 365",
      "SharePoint",
      "Windows Server",
      "ITIL",
      "ISO 27001",
      "Ticketing System",
      "Remote Administration",
      "Punctuality",
      "Compliance with Standards"
    ],
    "short_keywords": [
      "27001",
      "365",
      "active",
      "administration",
      "approach",
      "basic",
      "communication",
      "compliance",
      "comprehensive",
      "diagnosis",
      "directory",
      "documentation",
      "information",
      "informationtechnology",
      "iso",
      "itil",
      "knowledge",
      "network",
      "office",
      "problem",
      "professional",
      "punctuality",
      "remote",
      "responsibility",
      "satisfaction",
      "server",
      "sharepoint",
      "specialist",
      "standards",
      "support",
      "system",
      "teamwork",
      "technology",
      "ticketing",
      "user",
      "windows",
      "with"
    ]
  },
  {
    "job_id": "3894285424",
    "job_title": "ServiceNow - Information Technology Manager ",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "THE SERVICENOW MANAGER AT FLOOR & DECOR IS TASKED WITH COLLABORATING CLOSELY WITH INTERNAL TEAMS, ENGAGING STAKEHOLDERS, AND ESTABLISHING SERVICE LEVEL AGREEMENTS (SLAS) FOR BOTH INTERNAL AND MANAGED SERVICE PROVIDER (MSP) TEAMS. THIS ROLE INVOLVES INTRICATELY DEFINING THE SCOPE OF IT SERVICES TO BE PROVIDED AND SETTING KEY PERFORMANCE INDICATORS (KPIS) AND METRICS TO ASSESS THE PERFORMANCE OF THE SERVICENOW PLATFORM AND MSP PARTNERS, DETAILING THEIR MEASUREMENT METHODOLOGIES.\nMOREOVER, THE SERVICENOW MANAGER IS RESPONSIBLE FOR CRAFTING AND REFINING THE PROCESSES FOR IT SERVICE DESK CORPORATE, STORE SUPPORT, AND MSP OPERATIONS WITHIN THE SERVICENOW PLATFORM. THIS INCLUDES COMPREHENSIVE DOCUMENTATION, AUDITING PROCEDURES, AND ENSURING ALIGNMENT WITH THE STRATEGIC DIRECTION AND OBJECTIVES SET FORTH BY SERVICE DESK LEADERSHIP. CONTINUAL ANALYSIS OF WORKFLOWS AND PERFORMANCE METRICS IS CENTRAL TO THIS ROLE, DRIVING THE IMPLEMENTATION OF STRATEGIES AIMED AT ENHANCING EFFICIENCY AND STREAMLINING OPERATIONS WITHIN THE SERVICENOW ENVIRONMENT.\nMINIMUM ELIGIBILITY REQUIREMENTS:\nCERTIFICATIONS: SERVICENOW CERTIFIED SYSTEM ADMINISTRATOR (CSA)PLATFORM MANAGEMENT: 5+ YEARS OF EXPERIENCE OVERSEEING THE ADMINISTRATION, CONFIGURATION, AND CUSTOMIZATION OF THE SERVICENOW PLATFORM TO MEET THE ORGANIZATION'S NEEDS. THIS INCLUDES MANAGING USER ACCESS, SECURITY, WORKFLOWS, FORMS, AND INTEGRATIONS WITH OTHER SYSTEMS. EXPERIENCE WORKING IN ALL THE FLOWING SERVICENOW APPLICATIONS SUITES IS PREFERRED ITSM, CSM, SPM, AND ITOM.SERVICE DELIVERY: 5+ YEARS OF EXPERIENCE ENSURING THE EFFECTIVE DELIVERY OF IT SERVICES THROUGH SERVICENOW, INCLUDING INCIDENT MANAGEMENT, PROBLEM MANAGEMENT, CHANGE MANAGEMENT, SERVICE CATALOG MANAGEMENT, AND REQUEST FULFILLMENT. THIS INVOLVES DEFINING AND OPTIMIZING SERVICE PROCESSES AND WORKFLOWS WITHIN SERVICENOW.STAKEHOLDER ENGAGEMENT: COLLABORATING WITH STAKEHOLDERS ACROSS THE ORGANIZATION TO UNDERSTAND THEIR REQUIREMENTS AND PRIORITIES, AND TO ENSURE THAT SERVICENOW SOLUTIONS ALIGN WITH BUSINESS GOALS. THIS MAY INVOLVE GATHERING FEEDBACK, CONDUCTING WORKSHOPS, AND FACILITATING DISCUSSIONS TO DRIVE ADOPTION AND SATISFACTION.GOVERNANCE AND COMPLIANCE: ESTABLISHING GOVERNANCE FRAMEWORKS AND BEST PRACTICES FOR THE USE OF SERVICENOW, ENSURING COMPLIANCE WITH ORGANIZATIONAL POLICIES, INDUSTRY REGULATIONS, AND SECURITY STANDARDS. THIS INCLUDES CONDUCTING REGULAR AUDITS, IMPLEMENTING CONTROLS, AND MANAGING RISKS ASSOCIATED WITH SERVICENOW USAGE.PERFORMANCE MONITORING AND OPTIMIZATION: MONITORING THE PERFORMANCE AND UTILIZATION OF THE SERVICENOW PLATFORM, ANALYZING DATA AND METRICS TO IDENTIFY AREAS FOR IMPROVEMENT AND OPTIMIZATION. THIS MAY INVOLVE CONDUCTING PERFORMANCE TUNING, CAPACITY PLANNING, AND IMPLEMENTING ENHANCEMENTS TO ENHANCE THE PLATFORM'S EFFECTIVENESS AND EFFICIENCY.TEAM LEADERSHIP AND DEVELOPMENT: LEADING A TEAM OF SERVICENOW ADMINISTRATORS, DEVELOPERS, AND ANALYSTS, PROVIDING GUIDANCE, SUPPORT, AND MENTORSHIP TO ENSURE THEIR SUCCESS. THIS INCLUDES DEFINING ROLES AND RESPONSIBILITIES, SETTING GOALS AND OBJECTIVES, AND FOSTERING A CULTURE OF CONTINUOUS LEARNING AND PROFESSIONAL DEVELOPMENT.VENDOR MANAGEMENT: MANAGING RELATIONSHIPS WITH SERVICENOW VENDORS, PARTNERS, AND CONSULTANTS, INCLUDING CONTRACT NEGOTIATION, VENDOR SELECTION, AND OVERSIGHT OF EXTERNAL RESOURCES. THIS MAY INVOLVE COLLABORATING WITH PROCUREMENT AND LEGAL TEAMS TO ENSURE COMPLIANCE WITH CONTRACTUAL AGREEMENTS AND SERVICE LEVEL AGREEMENTS.PROJECT MANAGEMENT: LEADING SERVICENOW IMPLEMENTATION PROJECTS, UPGRADES, AND ENHANCEMENTS FROM INITIATION TO COMPLETION. THIS INCLUDES DEFINING PROJECT SCOPE, TIMELINES, AND DELIVERABLES, MANAGING RESOURCES AND BUDGETS, AND COMMUNICATING PROGRESS AND STATUS UPDATES TO STAKEHOLDERS.USER TRAINING AND SUPPORT: PROVIDING TRAINING AND SUPPORT TO USERS OF THE SERVICENOW PLATFORM, ENSURING THEY HAVE THE KNOWLEDGE AND SKILLS REQUIRED TO EFFECTIVELY UTILIZE ITS FEATURES AND FUNCTIONALITY. THIS MAY INVOLVE DEVELOPING TRAINING MATERIALS, CONDUCTING WORKSHOPS, AND PROVIDING ONGOING ASSISTANCE AND GUIDANCE AS NEEDED.CONTINUOUS IMPROVEMENT: DRIVING CONTINUOUS IMPROVEMENT INITIATIVES TO ENHANCE THE CAPABILITIES, USABILITY, AND VALUE OF THE SERVICENOW PLATFORM. THIS INCLUDES SOLICITING FEEDBACK FROM USERS, STAYING CURRENT WITH PLATFORM UPDATES AND BEST PRACTICES, AND ACTIVELY PARTICIPATING IN USER COMMUNITIES AND FORUMS.\nESSENTIAL JOB FUNCTIONS:\nMANAGE AND LEAD A TEAM OF SERVICENOW DEVELOPERS AND CONFIGURATORS, INCLUDING HIRING, TRAINING, COACHING, AND PERFORMANCE MANAGEMENT.DEVELOP AND IMPLEMENT SERVICENOW POLICIES, PROCEDURES, AND BEST PRACTICES TO ENSURE CONSISTENT AND HIGH-QUALITY SUPPORT SERVICES.MONITOR SERVICENOW PERFORMANCE METRICS AND KPIS TO IDENTIFY AREAS FOR IMPROVEMENT AND DRIVE CONTINUOUS SERVICE IMPROVEMENT INITIATIVES.COORDINATE WITH OTHER IT TEAMS AND STAKEHOLDERS TO RESOLVE ESCALATED ISSUES AND ENSURE TIMELY RESOLUTION OF SERVICE REQUESTS AND INCIDENTS.OVERSEE THE DEPLOYMENT AND MAINTENANCE OF THE SERVICENOW SYSTEM TO SUPPORT EFFICIENT SERVICE DELIVERY.PROVIDE TECHNICAL EXPERTISE AND GUIDANCE TO SERVICENOW STAFF, ASSISTING WITH COMPLEX TECHNICAL ISSUES AND ESCALATIONS.FOSTER A CUSTOMER-FOCUSED CULTURE WITHIN THE SERVICENOW TEAM, PROMOTING EXCELLENT COMMUNICATION AND COLLABORATION WITH END-USERS.STAY UP TO DATE ON INDUSTRY TRENDS AND BEST PRACTICES IN IT SERVICE MANAGEMENT, RECOMMENDING AND IMPLEMENTING INNOVATIONS TO ENHANCE SERVICE DELIVERY.DEVELOP AND MAINTAIN DOCUMENTATION, KNOWLEDGE ARTICLES, AND TRAINING MATERIALS TO SUPPORT SERVICENOW OPERATIONS AND KNOWLEDGE TRANSFER.WORK WITH IT TEAMS TO GENERATE AND DELIVER REGULAR SERVICENOW REPORTS AND PRESENTATIONS FOR SENIOR MANAGEMENT, SUMMARIZING SERVICE DESK PERFORMANCE, TRENDS, AND KEY METRICS.ESTABLISH BEST PRACTICES THROUGHOUT THE ENTIRE TECHNICAL SUPPORT PROCESS.OVERSEE IT SERVICE DESK TRANSFORMATION INITIATIVES TO ENSURE THEY SUPPORT THE ACHIEVEMENT OF THE SHORT/LONG TERM PLAN(S)PERFORM OTHER SUCH ROLES, ACTIVITIES AND DUTIES AS MAY BE REQUIRED BY EXECUTIVE MANAGEMENT OR BY ANY OTHER MANAGERIAL REPRESENTATIVE OF F&D FROM TIME TO TIME..\nWORKING CONDITIONS (TRAVEL & ENVIRONMENT):\nLIMITED TRAVEL REQUIRED INCLUDING AIR AND CARWHILE PERFORMING THE DUTIES OF THIS JOB, THE EMPLOYEE MAY OCCASIONALLY BE EXPOSED TO A WAREHOUSE ENVIRONMENT AND MOVING VEHICLES. THE NOISE LEVEL IN THE WORK ENVIRONMENT IS TYPICALLY QUIET TO MODERATE.\nPHYSICAL/SENSORY REQUIREMENTS\nSEDENTARY WORK – ABILITY TO EXERT 10 - 20 POUNDS OF FORCE OCCASIONALLY, AND/OR NEGLIGIBLE AMOUNT OF FORCE FREQUENTLY TO LIFT, CARRY, PUSH, PULL OR OTHERWISE MOVE OBJECTS. SEDENTARY WORK INVOLVES SITTING MOST OF THE TIME, BUT MAY INVOLVE WALKING OR STANDING FOR BRIEF PERIODS OF TIME.\nBENEFITS & REWARDS\n· BONUS OPPORTUNITIES AT EVERY LEVEL· CAREER ADVANCEMENT OPPORTUNITIES· RELOCATION OPPORTUNITIES ACROSS THE COUNTRY· 401K WITH DISCRETIONARY COMPANY MATCH· EMPLOYEE STOCK PURCHASE PLAN· REFERRAL BONUS PROGRAM· A PERSONAL HOLIDAY AND VOLUNTEER TIME OFF PROGRAM· MEDICAL, DENTAL, VISION, LIFE AND OTHER INSURANCE PLANS (SUBJECT TO ELIGIBILITY CRITERIA)\nEQUAL EMPLOYMENT OPPORTUNITY\nFLOOR & DECOR IS AN EQUAL OPPORTUNITY EMPLOYER AND IS COMMITTED TO EQUAL OPPORTUNITY FOR ALL ASSOCIATES AND APPLICANTS. F&D RECRUITS, HIRES, TRAINS, PROMOTES, COMPENSATES AND ADMINISTERS ALL PERSONNEL ACTIONS WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEX STEREOTYPING, PREGNANCY (WHICH INCLUDES PREGNANCY, CHILDBIRTH AND MEDICAL CONDITIONS RELATED TO PREGNANCY, CHILDBIRTH OR BREASTFEEDING), GENDER, GENDER IDENTITY, GENDER EXPRESSION, NATIONAL ORIGIN, AGE, MENTAL OR PHYSICAL DISABILITY, ANCESTRY, MEDICAL CONDITION, MARITAL STATUS, MILITARY OR VETERAN STATUS, CITIZENSHIP STATUS, SEXUAL ORIENTATION, GENETIC INFORMATION OR ANY OTHER STATUS PROTECTED BY APPLICABLE LAW.\nTHIS POLICY APPLIES TO ALL AREAS OF EMPLOYMENT, INCLUDING RECRUITMENT, TESTING, SCREENING, HIRING, SELECTION FOR TRAINING, UPGRADING, TRANSFER, DEMOTION, LAYOFF, DISCIPLINE, TERMINATION, COMPENSATION, BENEFITS AND ALL OTHER PRIVILEGES, TERMS AND CONDITIONS OF EMPLOYMENT. THIS POLICY AND THE LAW PROHIBIT EMPLOYMENT DISCRIMINATION AGAINST ANY ASSOCIATE OR APPLICANT ON THE BASIS OF ANY LEGALLY PROTECTED STATUS OUTLINED ABOVE.",
    "job_skill_set": [
      "Project management",
      "Documentation",
      "Technical expertise",
      "ServiceNow Certified System Administrator (CSA)",
      "ServiceNow platform administration",
      "IT service management (ITSM)",
      "Customer service management (CSM)",
      "Service portfolio management (SPM)",
      "IT operations management (ITOM)",
      "Incident management",
      "Problem management",
      "Change management",
      "Service catalog management",
      "Request fulfillment",
      "Governance frameworks",
      "Performance monitoring",
      "Vendor management",
      "User training and support",
      "Data analysis",
      "Capacity planning",
      "Team leadership",
      "Stakeholder engagement",
      "Communication",
      "Collaboration",
      "Problem solving",
      "Continuous improvement",
      "Mentorship",
      "Customer-focused culture",
      "Adaptability",
      "Strategic thinking"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "administrator",
      "analysis",
      "and",
      "capacity",
      "catalog",
      "certified",
      "change",
      "collaboration",
      "communication",
      "continuous",
      "csa",
      "csm",
      "culture",
      "customer",
      "customerfocused",
      "data",
      "documentation",
      "engagement",
      "expertise",
      "frameworks",
      "fulfillment",
      "governance",
      "improvement",
      "incident",
      "information",
      "informationtechnology",
      "it",
      "itom",
      "itsm",
      "leadership",
      "management",
      "manager",
      "mentorship",
      "monitoring",
      "operations",
      "performance",
      "planning",
      "platform",
      "portfolio",
      "problem",
      "project",
      "request",
      "service",
      "servicenow",
      "solving",
      "spm",
      "stakeholder",
      "strategic",
      "support",
      "system",
      "team",
      "technical",
      "technology",
      "thinking",
      "training",
      "user",
      "vendor"
    ]
  },
  {
    "job_id": "3901351878",
    "job_title": "Information Technology Support Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "THE IT SUPPORT SPECIALIST IS RESPONSIBLE FOR PROVIDING TECHNICAL SUPPORT TO END-USERS IN ALL VERTICALS OF OPTIMUM. THIS ROLE INVOLVES TROUBLESHOOTING HARDWARE AND SOFTWARE ISSUES, ASSISTING WITH NETWORK-RELATED PROBLEMS, AND ENSURING THAT ALL IT SYSTEMS AND EQUIPMENT ARE FUNCTIONING EFFECTIVELY. THE IT SUPPORT SPECIALIST PLAYS A CRUCIAL ROLE IN MAINTAINING THE PRODUCTIVITY AND EFFICIENCY OF THE ORGANIZATION'S TECHNOLOGY INFRASTRUCTURE. THIS ROLE REPORTS TO THE SR. DIRECTOR OF IT.\nKEY RESPONSIBILITIES:TECHNICAL SUPPORT:RESPOND PROMPTLY TO END-USER INQUIRIES VIA PHONE, EMAIL, OR IN PERSON, PROVIDING TECHNICAL ASSISTANCE AND SUPPORT FOR HARDWARE AND SOFTWARE ISSUES.DIAGNOSE AND TROUBLESHOOT PROBLEMS RELATED TO DESKTOPS, LAPTOPS, PRINTERS, MOBILE DEVICES, AND OTHER IT EQUIPMENT.INSTALL, CONFIGURE, AND MAINTAIN HARDWARE AND SOFTWARE COMPONENTS, ENSURING COMPATIBILITY AND OPTIMAL PERFORMANCE.ASSIST WITH THE SETUP AND CONFIGURATION OF USER ACCOUNTS, EMAIL CLIENTS, AND SOFTWARE APPLICATIONS.MONITOR SYSTEM PERFORMANCE AND IDENTIFY AREAS FOR IMPROVEMENT, RECOMMENDING UPGRADES OR ENHANCEMENTS TO HARDWARE AND SOFTWARE AS NEEDED.PERFORM ROUTINE MAINTENANCE TASKS, SUCH AS SOFTWARE UPDATES, SYSTEM PATCHES, AND EQUIPMENT INSPECTIONS, TO ENSURE THE STABILITY AND SECURITY OF IT SYSTEMS.TROUBLESHOOTING NETWORK RELATED ISSUES SUCH AS CONNECTIVITY ISSUES, CONFIGURING ROUTERS AND SWITCHES, AND IMPLEMENTING NETWORK SECURITY MEASURES.ENSURE THE INTEGRITY AND RELIABILITY OF OPTIMUM’S NETWORK INFRASTRUCTURE.COORDINATE THE SETUP AND DEPLOYMENT OF NEW WORKSTATIONS FOR EMPLOYEES, INCLUDING HARDWARE INSTALLATION, SOFTWARE CONFIGURATION, AND USER ACCOUNT SETUP.\nPROBLEM RESOLUTION:IDENTIFY AND RESOLVE HARDWARE, SOFTWARE, AND NETWORK-RELATED ISSUES IN A TIMELY MANNER, ESCALATING COMPLEX PROBLEMS TO HIGHER-LEVEL SUPPORT TEAMS WHEN NECESSARY.UTILIZE TROUBLESHOOTING TECHNIQUES AND DIAGNOSTIC TOOLS TO ISOLATE AND RESOLVE TECHNICAL ISSUES EFFECTIVELY.DOCUMENT ALL SUPPORT ACTIVITIES, INCLUDING PROBLEM DESCRIPTIONS, RESOLUTION STEPS, AND SYSTEM CONFIGURATIONS, TO MAINTAIN ACCURATE RECORDS AND FACILITATE KNOWLEDGE SHARING.\nQUALIFICATIONS:BACHELOR'S DEGREE IN INFORMATION TECHNOLOGY, COMPUTER SCIENCE, OR RELATED FIELD PREFERRED BUT NOT REQUIREDPROVEN EXPERIENCE IN PROVIDING TECHNICAL SUPPORT TO END-USERS IN A CORPORATE ENVIRONMENT.STRONG KNOWLEDGE OF HARDWARE COMPONENTS, OPERATING SYSTEMS, AND SOFTWARE APPLICATIONS.FAMILIARITY WITH NETWORKING CONCEPTS, PROTOCOLS, AND TROUBLESHOOTING TECHNIQUES.EXCELLENT PROBLEM-SOLVING SKILLS AND THE ABILITY TO PRIORITIZE TASKS IN A FAST-PACED ENVIRONMENT.EFFECTIVE COMMUNICATION SKILLS, WITH THE ABILITY TO EXPLAIN TECHNICAL CONCEPTS TO NON-TECHNICAL USERS.RELEVANT CERTIFICATIONS (E.G., COMPTIA A+, NETWORK+, MICROSOFT CERTIFIED PROFESSIONAL) A PLUS.\nTHE IT SUPPORT SPECIALIST PLAYS A VITAL ROLE IN ENSURING THE SMOOTH OPERATION OF THE ORGANIZATION'S IT SYSTEMS AND INFRASTRUCTURE, PROVIDING ESSENTIAL SUPPORT TO END-USERS AND HELPING TO RESOLVE TECHNICAL ISSUES PROMPTLY AND EFFICIENTLY.",
    "job_skill_set": [
      "technical support",
      "troubleshooting",
      "software configuration",
      "operating systems",
      "software applications",
      "problem-solving",
      "communication",
      "prioritization",
      "time management",
      "teamwork",
      "hardware installation",
      "networking concepts",
      "diagnostic tools",
      "system performance monitoring",
      "software updates",
      "user account setup",
      "network security measures",
      "CompTIA A+",
      "Network+",
      "Microsoft Certified Professional"
    ],
    "short_keywords": [
      "a",
      "account",
      "applications",
      "certified",
      "communication",
      "comptia",
      "concepts",
      "configuration",
      "diagnostic",
      "hardware",
      "information",
      "informationtechnology",
      "installation",
      "management",
      "measures",
      "microsoft",
      "monitoring",
      "network",
      "networking",
      "operating",
      "performance",
      "prioritization",
      "problemsolving",
      "professional",
      "security",
      "setup",
      "software",
      "specialist",
      "support",
      "system",
      "systems",
      "teamwork",
      "technical",
      "technology",
      "time",
      "tools",
      "troubleshooting",
      "updates",
      "user"
    ]
  },
  {
    "job_id": "3902913489",
    "job_title": "Information Technology Infrastructure Engineer",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOB TITLE- IT INFRASTRUCTURE ENGINEERLOCATION- DEVENS, MADIRECT CLIENT\n\"MUST HAVE LIST:\n10+ YEARS OF EXPERIENCE WITH THE FOLLOWING:• KNOWLEDGE OF DATA CENTER OPERATION AND IT INFRASTRUCTURE.• KNOWLEDGE OF NETWORK CONNECTIVITY, NETWORK SERVICES, AND NETWORK SECURITY.• HANDS ON EXPERIENCES OF MANAGING WINDOWS OPERATING SYSTEMS, WINDOWS DOMAINS, ACTIVE DIRECTORY, AND GROUP POLICY.• HANDS ON EXPERIENCES OF SUPPORTING WINDOWS PC, THIN CLIENT, MOBILE DEVICES, AND PERIPHERALS.• EXPERIENCE OF PATCHING OF OPERATING SYSTEMS AND APPLICATIONS, FIRMWARE UPGRADE, AND CYBERSECURITY TOOLS.• EXPERIENCE OF MANAGING ACRONIS BACKUP AND THINMANAGER.\nSHARED SERVICE INFRASTRUCTURE ENGINEER IN CTF DEVENS\nTHE SHARED SERVICES INFRASTRUCTURE ENGINEER IN DEVENS HAS RESPONSIBILITY TO EXECUTE LIFECYCLE MANAGEMENT AND DIGITAL MODERNIZATION RELATED PROJECT FOR SUPPORTING CELL THERAPY OPERATIONS. THE INCUMBENT WILL WORK TO PROTECT OUR OPERATIONS IN MANUFACTURING WITH INCREASED NEED FOR RESOURCES TO SUPPORT DIGITAL INNOVATION, BUSINESS CONTINUITY, AND CYBER SECURITY.\n• WORK IN SHARED SERVICES TEAM, AND PARTICIPATE INFRASTRUCTURE PROJECT WITH DIGITAL PLANT TEAMS, ENTERPRISE ARCHITECT TEAM, IT OPERATIONS TEAM, AND CYBER RESILIENCE TEAM.• COLLABORATE WITH PARTNERS AND CUSTOMERS, SUCH AS MANUFACTURING, FACILITIES, MS&T, SUPPLY CHAIN, AND QUALITY TO GET ALIGNMENT AND ENDORSEMENT ON OPERATIONS AND RESILIENCE RELATED INITIATIVES.• EXECUTE PROJECTS OF DIGITAL MODERNIZATION AND LIFECYCLE MANAGEMENT IN CELL THERAPY MANUFACTURING.• PROVIDE STATUS REPORTS OF MANUFACTURING RESILIENCE RELATED DELIVERABLES.• PARTICIPATE IN RISK ASSESSMENT ACTIVITIES TO EVALUATE NEW AND EXISTING THREATS OR VULNERABILITIES IN DIGITAL PLANT, AND PREPARE FOR REMEDIATION.• UNDERSTAND AND PROMOTE SITE COMPLIANCE WITH LATEST ENTERPRISE CYBERSECURITY GUIDELINES, AND PROVIDE INPUT TO SITE RISK ASSESSMENTS.• MAINTAIN MANUFACTURING IT ARCHITECTURE, INFRASTRUCTURE, AND DOCUMENTATION.• ENSURE DATA QUALITY OF LOCAL IT ASSETS INVENTORY.• PARTICIPATE RECOVERY VERIFICATION ACTIVITIES INCLUDING HIGH AVAILABILITY AND ONSITE APPLICATION RECOVERY EXERCISES.\nEDUCATION: BACHELOR DEGREE IN TECHNICAL FIELD OR IT CERTIFICATES, WITH 10+ YEARS OF EXPERIENCES OF MANAGING IT INFRASTRUCTURE AND APPLICATIONS.• KNOWLEDGE OF DATA CENTER OPERATION AND IT INFRASTRUCTURE.• KNOWLEDGE OF NETWORK CONNECTIVITY, NETWORK SERVICES, AND NETWORK SECURITY.• HANDS ON EXPERIENCES OF MANAGING WINDOWS OPERATING SYSTEMS, WINDOWS DOMAINS, ACTIVE DIRECTORY, AND GROUP POLICY.• HANDS ON EXPERIENCES OF SUPPORTING WINDOWS PC, THIN CLIENT, MOBILE DEVICES, AND PERIPHERALS.• EXPERIENCE OF PATCHING OF OPERATING SYSTEMS AND APPLICATIONS, FIRMWARE UPGRADE, AND CYBERSECURITY TOOLS.• EXPERIENCE OF MANAGING ACRONIS BACKUP AND THINMANAGER.• ABILITY TO EFFECTIVELY COMMUNICATE WITH BOTH TECHNICAL TEAM AND NON-TECHNICAL TEAM.• ABILITY TO RESPOND TO URGENT REQUEST AND LIVE TROUBLESHOOTING.• ABILITY TO WORK ON AN ON-CALL BASIS OR OVERTIME WHEN REQUIRED.• ABILITY TO WORK IN A DIVERSE GROUP.• ABILITY TO MANAGE MULTIPLE PRIORITIES WITH TIGHT TIMELINE.• BASIC PROJECT MANAGEMENT SKILLS.• EXCELLENT DOCUMENTATION AND TECHNICAL WRITING SKILLS.• DEMONSTRATED CREATIVE PROBLEM-SOLVING SKILLS.• STRONG SELF-MANAGEMENT SKILL AND ABILITY TO WORK INDEPENDENTLY.• STRONG INTERPERSONAL SKILLS IN TEAMWORK AND COLLABORATION.• GOOD CUSTOMER SERVICE SKILLS.• UNDERSTAND REGULATORY AND COMPLIANCE IN GMP REQUIREMENTS.• UNDERSTAND COMPUTER SYSTEM VALIDATION.• STRONG ATTENTION TO SAFETY A MUST.• EXPERIENCE IN PHARMACEUTICAL MANUFACTURING IS A PLUS.",
    "job_skill_set": [
      "IT infrastructure",
      "network connectivity",
      "network services",
      "network security",
      "communication",
      "troubleshooting",
      "teamwork",
      "collaboration",
      "time management",
      "project management",
      "documentation",
      "problem-solving",
      "self-management",
      "customer service",
      "attention to safety",
      "data center operation",
      "Windows operating systems",
      "Active Directory",
      "Group Policy",
      "Windows PC support",
      "thin client support",
      "mobile devices support",
      "patching operating systems",
      "firmware upgrade",
      "cybersecurity tools",
      "Acronis backup management",
      "ThinManager",
      "digital modernization",
      "lifecycle management",
      "risk assessment",
      "data quality management",
      "GMP compliance",
      "computer system validation"
    ],
    "short_keywords": [
      "acronis",
      "active",
      "assessment",
      "attention",
      "backup",
      "center",
      "client",
      "collaboration",
      "communication",
      "compliance",
      "computer",
      "connectivity",
      "customer",
      "cybersecurity",
      "data",
      "devices",
      "digital",
      "directory",
      "documentation",
      "engineer",
      "firmware",
      "gmp",
      "group",
      "information",
      "informationtechnology",
      "infrastructure",
      "it",
      "lifecycle",
      "management",
      "mobile",
      "modernization",
      "network",
      "operating",
      "operation",
      "patching",
      "pc",
      "policy",
      "problemsolving",
      "project",
      "quality",
      "risk",
      "safety",
      "security",
      "selfmanagement",
      "service",
      "services",
      "support",
      "system",
      "systems",
      "teamwork",
      "technology",
      "thin",
      "thinmanager",
      "time",
      "to",
      "tools",
      "troubleshooting",
      "upgrade",
      "validation",
      "windows"
    ]
  },
  {
    "job_id": "3898167090",
    "job_title": "Information Technology Support Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "LAYCO ELECTRIC INNOVATIONS, A WELL-ESTABLISHED ELECTRICAL MANUFACTURER OF E-HOUSES AND SKID MOUNTED EQUIPMENT IS SEEKING QUALIFIED CANDIDATES FOR THE POSITION OF IT SUPPORT. TO THE SUCCESSFUL CANDIDATE WE OFFER A COMPETITIVE COMPENSATION PACKAGE THAT INCLUDES COMPANY PAID HEALTH INSURANCE, 9 PAID HOLIDAYS AND A 401K PLAN.\nOVERVIEWAS THE IT SUPPORT, YOU WILL BE RESPONSIBLE FOR TECHNICAL SUPPORT OF BOTH SOFTWARE AND HARDWARE ISSUES FOR ALL EMPLOYEES, TO RESOLVE A WIDE RANGE OF SUPPORT REQUESTS.\nRESPONSIBILITIESPROVIDE ALL LEVELS OF HARDWARE SUPPORT FOR DESKTOPS, LAPTOPS, PRINTERS, SCANNERS, SURFACE PROS, AND OTHER DEVICES INCLUDING THOSE INSTALLED AT REMOTE LOCATIONS.PROVIDE ALL LEVELS OF SOFTWARE SUPPORT FOR WINDOWS 10 &11, MICROSOFT 365, AUTOCAD, TRAVERSE ERP AND OTHERS.SUPPORT CORPORATE CELLULAR PHONES AND CORPORATE PHONE SYSTEM (3CX)SUPPORT THE OFFICE TECHNOLOGY PLATFORMS, INCLUDING WIRELESS AND WIRED NETWORKS, AND CONFERENCE ROOM TECHNOLOGY (ZOOM AND MICROSOFT TEAMS).PERFORM ROUTINE USER SUPPORT PROCESSES SUCH AS PASSWORD RESETS AND MFA MANAGEMENTIMPLEMENTS SECURITY MEASURESMONITORS SECURITY CERTIFICATES AND COMPANY COMPLIANCE OF REQUIREMENTSINSTALL AND UPDATE COMPANY SOFTWARE AS NEEDEDTROUBLESHOOT BASIC NETWORKING AND CONNECTIVITY ISSUES AFFECTING END USER APPLICATIONS.MONITOR AND RESPOND TO SUPPORT TICKETS THROUGH THE HELP DESK SYSTEM.ACTS AS A QUALITY ASSURANCE BY IDENTIFYING, RESEARCHING, RESOLVING, AND RESPONDING TO TECHNICAL AND NON-TECHNICAL ISSUES OR QUESTIONS FROM USERS.ASSIST IN CREATING AND IMPLEMENTING EVALUATION TOOLS FOR USER SATISFACTION AND COMPANY IT NEEDS.BE CURRENT WITH THE LATEST SOFTWARE (PREDOMINANTLY THE ENTIRE MICROSOFT M365 SUITE AND WINDOWS 10&11) AND OTHER TYPICAL ENTERPRISE APPS.COLLABORATES WITH THIRD PARTY IT SUPPORT TEAM REQUESTING AND ASSISTING WITH THE PROMPT RESOLUTION OF UNRESOLVED IT ISSUESMAINTAIN GOOD USER RELATIONSHIPS.OTHER DUTIES AS ASSIGNED BY SUPERVISOR.\nQUALIFICATIONSWORKING KNOWLEDGE OF RELEVANT OPERATING SYSTEMS AND SOFTWAREEXCELLENT PROBLEM-SOLVING AND CRITICAL THINKING SKILLS.KEEN ATTENTION TO DETAIL.GOOD ORGANIZATION, TIME MANAGEMENT AND PRIORITIZATION.COMMUNICATION SKILLS, INCLUDING SPEAKING, WRITING AND ACTIVE LISTENING.CUSTOMER SERVICE ORIENTED.EFFICIENT TROUBLESHOOTING ABILITIES.PREFERRED EXPERIENCE WITH VOIP, 3CX SYSTEM.\nEDUCATION & EXPERIENCEASSOCIATE’S DEGREE IN COMPUTER SCIENCE, INFORMATION SYSTEMS, INFORMATION TECHNOLOGY OR COMPUTER ENGINEERING IS PREFERRED.5 YEARS OF EXPERIENCE DESIREDKNOWLEDGE OF AND PRIOR EXPERIENCE WORKING WITH MICROSOFT PRODUCTS INCLUDING BUT NOT LIMITED TO CURRENT OPERATING SYSTEMS, SOFTWARE, AND APPLICATIONS.",
    "job_skill_set": [
      "hardware support",
      "software support",
      "networking",
      "troubleshooting",
      "security measures",
      "help desk systems",
      "user support processes",
      "problem-solving",
      "critical thinking",
      "attention to detail",
      "organization",
      "time management",
      "prioritization",
      "communication",
      "customer service",
      "collaboration",
      "Windows 10",
      "Windows 11",
      "Microsoft 365",
      "AutoCAD",
      "Traverse ERP",
      "3CX",
      "Zoom",
      "Microsoft Teams",
      "VoIP"
    ],
    "short_keywords": [
      "10",
      "11",
      "365",
      "3cx",
      "attention",
      "autocad",
      "collaboration",
      "communication",
      "critical",
      "customer",
      "desk",
      "detail",
      "erp",
      "hardware",
      "help",
      "information",
      "informationtechnology",
      "management",
      "measures",
      "microsoft",
      "networking",
      "organization",
      "prioritization",
      "problemsolving",
      "processes",
      "security",
      "service",
      "software",
      "specialist",
      "support",
      "systems",
      "teams",
      "technology",
      "thinking",
      "time",
      "to",
      "traverse",
      "troubleshooting",
      "user",
      "voip",
      "windows",
      "zoom"
    ]
  },
  {
    "job_id": "3886447150",
    "job_title": "Director, Information Technology",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "WHY PLAYSTATION?\n\nPLAYSTATION ISN’T JUST THE BEST PLACE TO PLAY — IT’S ALSO THE BEST PLACE TO WORK. TODAY, WE’RE RECOGNIZED AS A GLOBAL LEADER IN ENTERTAINMENT PRODUCING THE PLAYSTATION FAMILY OF PRODUCTS AND SERVICES INCLUDING PLAYSTATION®5, PLAYSTATION®4, PLAYSTATION®VR, PLAYSTATION®PLUS, ACCLAIMED PLAYSTATION SOFTWARE TITLES FROM PLAYSTATION STUDIOS, AND MORE.\n\nPLAYSTATION ALSO STRIVES TO CREATE AN INCLUSIVE ENVIRONMENT THAT EMPOWERS EMPLOYEES AND EMBRACES DIVERSITY. WE WELCOME AND ENCOURAGE EVERYONE WHO HAS A PASSION AND CURIOSITY FOR INNOVATION, TECHNOLOGY, AND PLAY TO EXPLORE OUR OPEN POSITIONS AND JOIN OUR GROWING GLOBAL TEAM.\n\nTHE PLAYSTATION BRAND FALLS UNDER SONY INTERACTIVE ENTERTAINMENT, A WHOLLY-OWNED SUBSIDIARY OF SONY CORPORATION.\n\nAT SIE, WE WANT TO ENABLE PLAYSTATION TO DELIVER ON ITS PROMISE TO BE THE BEST PLACE TO PLAY BY MAKING IT THE BEST PLACE TO WORK! IN IT, WE AIM TO ACHIEVE THIS BY PROVIDING INFORMATION AND TECHNOLOGY PLATFORMS THAT ENABLE SEAMLESS WORKING, COMMUNICATION AND COLLABORATION WITH COLLEAGUES AND PARTNERS ANYWHERE IN THE WORLD.\n\nTHE SIE IT – CORPORATE APPLICATIONS DEPARTMENT IMPLEMENTS, ENHANCES, AND SUPPORTS PRODUCTS AND SERVICES THAT UNDERPIN PLAYSTATION’S BUSINESS OPERATIONS. SAP IS A STRATEGIC SOLUTION IN THIS SPACE, AND THE PLATFORM CURRENTLY COMPRISES SAP S/4HANA, BW4 HANA, MDG, GRC, SRM,IBP. WE ARE LOOKING FOR AN EXPERIENCED AND HANDS-ON GLOBAL DIRECTOR TO DRIVE, HANDLE AND SUPPORT THE DELIVERY OF TECHNICAL SOLUTIONS TO ENSURE THAT THE PLATFORM CONTINUES TO MEET THE NEEDS OF THE BUSINESS GLOBALLY. YOU WILL COLLABORATE WITH BUSINESS PARTNERS FROM THE BUSINESS AND IDENTIFY AND COMMUNICATE HOW TECHNICAL SOLUTIONS CAN BE ACHIEVED. YOU WILL DO THIS BY GATHERING, ANALYZING, AND PRIORITIZING BUSINESS REQUIREMENTS, AND BY WORKING WITH BUSINESS AND TECHNICAL TEAMS TO DESIGN, AGREE AND COORDINATE THE DELIVERY OF TECHNICAL SOLUTIONS THAT ALIGN WITH BUSINESS STRATEGY.\n\nAT PLAYSTATION, WE ARE DRIVEN BY THE DESIRE TO ENSURE THAT PLAYSTATION REMAINS THE BEST PLACE TO PLAY AND THE BEST PLACE TO WORK. THIS DRIVE IS MOTIVATED BY OUR CORE VALUES: WE ARE LOOKING FOR PEOPLE TO JOIN US WHO ARE PASSIONATE, TRAILBLAZERS AND HAVE A ONE TEAM MENTALITY!\n\nTHESE VALUES AND BEHAVIORS ARE EVIDENT THROUGHOUT YOUR PREVIOUS EXPERIENCE:\n\nDEMONSTRABLE TECHNICAL SAP ERP S/4 HANA EXPERIENCE, WITH PROVEN HANDS-ON EXPERIENCE OF PRODUCT IMPLEMENTATION AND PRODUCTION SUPPORT.DEMONSTRABLE EXPERIENCE PROVIDING EFFECTIVE TECHNICAL SUPPORT TO BUSINESS USERS WITHIN A COMPLEX AND INTERCONNECTED SYSTEM LANDSCAPE.WORKING SUCCESSFULLY ACROSS THE FULL LIFECYCLE OF TECHNOLOGY-ENABLED CHANGE: FROM REQUIREMENTS DEFINITION THROUGH SOLUTION DESIGN, BUILD, TESTING TO TRANSITION TO LIVE OPERATION.HANDS-ON SAP MODULE CONFIGURATION EXPERIENCE WORKING ON A WIDE RANGE OF ERP IMPLEMENTATIONS.BROAD AND SOUND UNDERSTANDING OF ONE OR MORE OF THE FOLLOWING AREAS:SUPPLY CHAIN AND LOGISTICS IN A FAST PACED CONSUMER GOODS (FMCG) ENVIRONMENT.PRODUCT DATA MANAGEMENT INCLUDING BILL OF MATERIALS.DATA INTERFACES AND SYSTEM INTEGRATION, INCLUDING EDI AND OTHER INTERFACE SOLUTIONS WHICH INVOLVE IDOC INTERFACES BETWEEN SAP MM / SD AND NON-SAP THIRD-PARTY WAREHOUSE, CARRIER AND MASTER DATA SYSTEMS;KEY INTEGRATION POINTS BETWEEN SD/MM/PURCHASING/FICO.SALES AND PURCHASE TO PAY SCENARIOS, REQUISITION RELEASE STRATEGIES AND SAP PO AND INVENTORY FUNCTIONALITY.WAREHOUSE ENVIRONMENTS AND PROCESSES.WORKING EFFECTIVELY WITH OFFSHORE / NEAR SHORE SERVICE PROVIDERSWORKING WITH ITIL, PRINCE2 & AGILE METHODOLOGIES.WORKING WITH A DIVERSE RANGE OF PARTNERS AND AUDIENCES WITHIN A MATRIX ORGANIZATION.EXCELLENT AT INFLUENCING AND NEGOTIATION, COMFORTABLE DEALING WITH SENIOR CUSTOMERS AND WILLING TO CHALLENGE THEM BASED ON SOUND REASONING.EXCELLENT WRITTEN, VERBAL, SOCIAL AND DECISION-MAKING SKILLS,SELF-MOTIVATED, HIGHLY ORGANIZED, WORKING WELL UNDER PRESSURE, REMAINING FOCUSED AND CALM IN THE FACE OF DISTRACTIONS AND CHANGING PRIORITIES.STRONG ANALYTICAL AND PROBLEM-SOLVING SKILLS.WORKING WITH THE FOLLOWING TOOLS (OR SIMILAR):ISSUE TRACKING (E.G. JIRA, SERVICE NOW)COLLABORATION (E.G. CONFLUENCE, TRELLO)COMMUNICATION (E.G. SLACK, WEBEX, SKYPE FOR BUSINESS)WORKING WITHIN CONTROLLED/COMPLIANCE-BASED ENVIRONMENTS (PARTICULARLY SARBANES OXLEY) WOULD BE BENEFICIAL.\n\nYOUR TECHNICAL DEVELOPMENT AND SUPPORT COMPETENCIES WILL INCLUDE THE FOLLOWING:\n\nECC6 / S4 HANAFIORIBW4HANAMDGGRCSRMEXPERIENCE OF DESIGNING, IMPLEMENTING, AND SUPPORTING COMPLEX ABAP AND IDOC DEVELOPMENTS\n\nQUALIFICATIONS:\n\n15+ YEARS OF SAP EXPERIENCE.BACHELOR'S DEGREE, OR EQUIVALENT EXPERIENCE.DEMONSTRABLE ABILITY TO BREAK DOWN COMPLEX TASKS INTO SMALLER GOALS, BOTH FOR TROUBLESHOOTING OF ISSUES AND DEVELOPMENT OF SOLUTIONSABILITY TO GATHER AND INTEGRATE COMPLEX BUSINESS REQUIREMENTS TO GENERATE COMPREHENSIVE PROPOSALS FOR A DESIRED SOLUTION.ABILITY TO EFFECTIVELY CONVERSE WITH END USERS, BUSINESS LEADERS, TECHNICAL DEVELOPERS, AND REPRESENTATIVES OF THIRD-PARTY COMPANIES.\n\n PLEASE REFER TO OUR CANDIDATE PRIVACY NOTICE FOR MORE INFORMATION ABOUT HOW WE PROCESS YOUR PERSONAL INFORMATION, AND YOUR DATA PROTECTION RIGHTS. \n\nAT SIE, WE CONSIDER SEVERAL FACTORS WHEN SETTING EACH ROLE’S BASE PAY RANGE, INCLUDING THE COMPETITIVE BENCHMARKING DATA FOR THE MARKET AND GEOGRAPHIC LOCATION.\n\nPLEASE NOTE THAT THE BASE PAY RANGE MAY VARY IN LINE WITH OUR HYBRID WORKING POLICY AND INDIVIDUAL BASE PAY WILL BE DETERMINED BASED ON JOB-RELATED FACTORS WHICH MAY INCLUDE KNOWLEDGE, SKILLS, EXPERIENCE, AND LOCATION.\n\nIN ADDITION, THIS ROLE IS ELIGIBLE FOR SIE’S TOP-TIER BENEFITS PACKAGE THAT INCLUDES MEDICAL, DENTAL, VISION, MATCHING 401(K), PAID TIME OFF, WELLNESS PROGRAM AND COVETED EMPLOYEE DISCOUNTS FOR SONY PRODUCTS. THIS ROLE ALSO MAY BE ELIGIBLE FOR A BONUS PACKAGE. CLICK HERE TO LEARN MORE.\n\nTHE ESTIMATED BASE PAY RANGE FOR THIS ROLE IS LISTED BELOW.\n\n$214,600 — $321,800 USD\n\nEQUAL OPPORTUNITY STATEMENT:\n\nSONY IS AN EQUAL OPPORTUNITY EMPLOYER. ALL PERSONS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO GENDER (INCLUDING GENDER IDENTITY, GENDER EXPRESSION AND GENDER REASSIGNMENT), RACE (INCLUDING COLOUR, NATIONALITY, ETHNIC OR NATIONAL ORIGIN), RELIGION OR BELIEF, MARITAL OR CIVIL PARTNERSHIP STATUS, DISABILITY, AGE, SEXUAL ORIENTATION, PREGNANCY OR MATERNITY, TRADE UNION MEMBERSHIP OR MEMBERSHIP IN ANY OTHER LEGALLY PROTECTED CATEGORY.\n\nWE STRIVE TO CREATE AN INCLUSIVE ENVIRONMENT, EMPOWER EMPLOYEES AND EMBRACE DIVERSITY. WE ENCOURAGE EVERYONE TO RESPOND.\n\nPLAYSTATION IS A FAIR CHANCE EMPLOYER AND QUALIFIED APPLICANTS WITH ARREST AND CONVICTION RECORDS WILL BE CONSIDERED FOR EMPLOYMENT.\n\n",
    "job_skill_set": [
      "Communication",
      "Collaboration",
      "Problem Solving",
      "Decision Making",
      "Self-Motivation",
      "Organization",
      "Teamwork",
      "Customer Engagement",
      "Leadership",
      "SAP ERP S/4 HANA",
      "ABAP",
      "IDOC",
      "SAP BW4 HANA",
      "SAP MDG",
      "SAP GRC",
      "SAP SRM",
      "SAP IBP",
      "Data Interfaces",
      "EDI",
      "SAP MM",
      "SAP SD",
      "SAP FICO",
      "Supply Chain Management",
      "Logistics",
      "Product Data Management",
      "Warehouse Management",
      "ITIL",
      "PRINCE2",
      "Agile Methodologies",
      "JIRA",
      "Service Now",
      "Confluence",
      "Trello",
      "Slack",
      "Webex",
      "Skype for Business",
      "Sarbanes Oxley Compliance",
      "Analytical Skills",
      "Negotiation",
      "Influencing Skills",
      "Adaptability"
    ],
    "short_keywords": [
      "abap",
      "adaptability",
      "agile",
      "analytical",
      "business",
      "bw4",
      "chain",
      "collaboration",
      "communication",
      "compliance",
      "confluence",
      "customer",
      "data",
      "decision",
      "director",
      "edi",
      "engagement",
      "erp",
      "fico",
      "for",
      "grc",
      "hana",
      "ibp",
      "idoc",
      "influencing",
      "information",
      "informationtechnology",
      "interfaces",
      "itil",
      "jira",
      "leadership",
      "logistics",
      "making",
      "management",
      "mdg",
      "methodologies",
      "mm",
      "negotiation",
      "now",
      "organization",
      "oxley",
      "prince2",
      "problem",
      "product",
      "s4",
      "sap",
      "sarbanes",
      "sd",
      "selfmotivation",
      "service",
      "skills",
      "skype",
      "slack",
      "solving",
      "srm",
      "supply",
      "teamwork",
      "technology",
      "trello",
      "warehouse",
      "webex"
    ]
  },
  {
    "job_id": "3904383649",
    "job_title": "Analyst II - Information Technology",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "CARPENTER TECHNOLOGY CORPORATION IS A LEADING PRODUCER AND DISTRIBUTOR OF PREMIUM SPECIALTY ALLOYS, INCLUDING TITANIUM ALLOYS, NICKEL AND COBALT BASED SUPERALLOYS, STAINLESS STEELS, ALLOY STEELS AND TOOL STEELS. CARPENTER’S HIGH-PERFORMANCE MATERIALS AND ADVANCED PROCESS SOLUTIONS ARE AN INTEGRAL PART OF CRITICAL APPLICATIONS USED WITHIN THE AEROSPACE, TRANSPORTATION, MEDICAL AND ENERGY MARKETS, AMONG OTHER MARKETS. BUILDING ON ITS HISTORY OF INNOVATION, CARPENTER’S WROUGHT AND POWDER TECHNOLOGY CAPABILITIES SUPPORT A RANGE OF NEXT-GENERATION PRODUCTS AND MANUFACTURING TECHNIQUES, INCLUDING NOVEL MAGNETIC MATERIALS AND ADDITIVE MANUFACTURING.\n\nANALYST - INFORMATION TECHNOLOGY\n\nTHE ANALYST - INFORMATION TECHNOLOGY WILL . . .\n\nRESEARCHES, DESIGNS, DEVELOPS, INSTALLS, AND MAINTAINS TECHNOLOGY SOLUTIONS (HARDWARE AND SOFTWARE) FOR THE CORPORATE INFRASTRUCTURE USING EXPANDED DEVELOPMENT AND SYSTEM SUPPORT SKILL SET. PROVIDES PHYSICAL DELIVERY AND ONGOING SUPPORT OF MODERATELY COMPLEX PRODUCTS/SERVICES, APPLICATIONS, NETWORK SYSTEMS AND OVERALL SOLUTIONS.PERFORMS ALL STANDARD SYSTEMS UPGRADES, WORKSTATION SETUPS AND SERVER CONFIGURATIONS.MAINTAINS SOFTWARE AND HARDWARE INVENTORIES. WORKS WITH VARIOUS STANDARD SOFTWARE TOOLS, LANGUAGES, TECHNOLOGY PLATFORMS AND THIRD-PARTY APPLICATION SOFTWARE PRODUCTS.PERFORM ALL OTHER DUTIES AND SPECIAL PROJECTS AS ASSIGNED. REQUIREMENTS FOR ANALYST - INFORMATION TECHNOLOGYTWO-YEAR COLLEGE DEGREE REQUIRED.1-5 YEARS OF INFORMATION TECHNOLOGY EXPERIENCE REQUIRED.KNOWLEDGE OF MACHINE LEARNING ALGORITHMS, STATISTICAL MODELING, AND DATA VISUALIZATION TECHNIQUES.KNOWLEDGE OF RELEVANT INFRASTRUCTURE TECHNOLOGIES INCLUDING BUT NOT LIMITED TO:MAINFRAME OPERATING SYSTEMS AND SOFTWARESTORAGE HARDWARE AND SOFTWARENETWORK HARDWARE, SOFTWARE, AND CABLINGNETWORK SERVICES – VOICE AND DATAPC AND SERVER HARDWARE AND OPERATING SYSTEMSABILITY TO ORGANIZE AND PRIORITIZE TASKS AND MAKE APPROPRIATE DECISIONS.ABILITY TO WORK WITH MODERATE SUPERVISION ENCOUNTERING A BROAD SCOPE OF PROJECTS.VERBAL AND WRITTEN COMMUNICATION SKILLS.MAINTAINS EFFECTIVE WORKING RELATIONSHIPS WITHIN THE DEPARTMENT AS WELL AS EXTERNALLY.ABILITY TO WORK IN A TEAM ENVIRONMENT.ANALYTICAL SKILLS.PROBLEM SOLVING SKILLS.STAYS ABREAST OF NEW TECHNOLOGY.\n\nCARPENTER TECHNOLOGY COMPANY OFFERS A COMPETITIVE SALARY AND A COMPREHENSIVE BENEFITS PACKAGE INCLUDING LIFE, MEDICAL, DENTAL, VISION, FLEXIBLE SPENDING ACCOUNTS, DISABILITY COVERAGE, 401K WITH COMPANY CONTRIBUTIONS AS WELL AS MANY OTHER OPTIONS TO EMPLOYEES.\n\nCARPENTER TECHNOLOGY CORPORATION’S POLICY IS TO FULLY AND EFFECTIVELY MAINTAIN A PROGRAM OF EQUAL EMPLOYMENT OPPORTUNITY AND NONDISCRIMINATION FOR ALL EMPLOYEES, TO EMPLOY AFFIRMATIVE ACTION FOR ALL PROTECTED CLASSES, AND TO RECRUIT AND DEVELOP THE BEST QUALIFIED PERSONS AVAILABLE REGARDLESS OF AGE, RACE, COLOR, RELIGION, SEX, GENDER IDENTITY, SEXUAL ORIENTATION, MARITAL STATUS, NATIONAL ORIGIN, POLITICAL AFFILIATION OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW. THE COMPANY ALSO WILL RECRUIT, DEVELOP AND PROVIDE OPPORTUNITIES FOR QUALIFIED PERSONS WITH DISABILITIES AND PROTECTED VETERANS.",
    "job_skill_set": [
      "hardware inventory management",
      "organizational skills",
      "decision making",
      "communication",
      "teamwork",
      "problem solving",
      "machine learning",
      "statistical modeling",
      "data visualization",
      "mainframe operating systems",
      "storage hardware",
      "network hardware",
      "PC hardware",
      "server operating systems",
      "network services",
      "software installation",
      "system upgrades",
      "workstation setup",
      "server configuration",
      "software inventory management",
      "analytical skills",
      "adaptability to new technology"
    ],
    "short_keywords": [
      "adaptability",
      "analyst",
      "analytical",
      "communication",
      "configuration",
      "data",
      "decision",
      "hardware",
      "ii",
      "information",
      "informationtechnology",
      "installation",
      "inventory",
      "learning",
      "machine",
      "mainframe",
      "making",
      "management",
      "modeling",
      "network",
      "new",
      "operating",
      "organizational",
      "pc",
      "problem",
      "server",
      "services",
      "setup",
      "skills",
      "software",
      "solving",
      "statistical",
      "storage",
      "system",
      "systems",
      "teamwork",
      "technology",
      "to",
      "upgrades",
      "visualization",
      "workstation"
    ]
  },
  {
    "job_id": "3900980589",
    "job_title": "Entry-level Information Technology (IT) Role",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "YEAR UP IS A ONE-YEAR OR LESS, INTENSIVE JOB TRAINING PROGRAM THAT PROVIDES YOUNG ADULTS WITH IN-CLASSROOM SKILL DEVELOPMENT, ACCESS TO INTERNSHIPS AND/OR JOB PLACEMENT SERVICES, AND PERSONALIZED COACHING AND MENTORSHIP. YEAR UP PARTICIPANTS ALSO RECEIVE AN EDUCATIONAL STIPEND.\n\nTHE PROGRAM COMBINES TECHNICAL AND PROFESSIONAL TRAINING WITH ACCESS TO INTERNSHIPS AND JOB PLACEMENT SUPPORT THROUGH OUR INDUSTRY-LEADING TALENT PLACEMENT FIRM YUPRO PLACEMENT. IF YOU RECEIVE AN INTERNSHIP, IT MAY BE AT CITIZENS, AMICA MUTUAL INSURANCE COMPANY, LIFESPAN, OR FIDELITY, AMONG OTHER LEADING ORGANIZATIONS IN THE PROVIDENCE AREA.\n\nARE YOU ELIGIBLE?YOU CAN APPLY TO YEAR UP IF YOU ARE:- 18-29 YEARS OLD- A HIGH SCHOOL GRADUATE OR GED RECIPIENT- ELIGIBLE TO WORK IN THE U.S.- AVAILABLE MONDAY-FRIDAY THROUGHOUT THE DURATION OF THE PROGRAM- HIGHLY MOTIVATED TO LEARN TECHNICAL AND PROFESSIONAL SKILLS- HAVE NOT OBTAINED A BACHELORʼS DEGREE\n\nWHAT WILL YOU GAIN?PROFESSIONAL BUSINESS AND COMMUNICATION SKILLS, INTERVIEWING AND NETWORKING SKILLS, RESUME BUILDING, ONGOING SUPPORT AND GUIDANCE TO HELP YOU LAUNCH YOUR CAREER. SOME COURSEWORK IS ELIGIBLE FOR COLLEGE CREDIT. DURING THE INTERNSHIP PHASE, YEAR UP STUDENTS EARN AN EDUCATIONAL STIPEND OF $525 PER WEEK. IN-DEPTH CLASSES INCLUDE:- BUSINESS FUNDAMENTALS- HELPDESK/DESKTOP SUPPORT- INVESTMENT OPERATIONS- BANKING & CUSTOMER SUCCESS\n\nGET THE SKILLS AND OPPORTUNITY YOU NEED TO LAUNCH YOUR PROFESSIONAL CAREER.80% OF YEAR UP GRADUATES ARE EMPLOYED AND/OR ENROLLED IN POSTSECONDARY EDUCATION WITHIN 4 MONTHS OF GRADUATION. PANDOLOGIC. KEYWORDS: IT ASSISTANT, LOCATION: PROVIDENCE, RI - 02902",
    "job_skill_set": [
      "Helpdesk/Desktop Support",
      "Technical Skills",
      "Customer Success",
      "Communication",
      "Motivation",
      "Teamwork",
      "Problem Solving",
      "Business Fundamentals",
      "Networking",
      "Interviewing Skills",
      "Resume Building"
    ],
    "short_keywords": [
      "building",
      "business",
      "communication",
      "customer",
      "entrylevel",
      "fundamentals",
      "helpdeskdesktop",
      "information",
      "informationtechnology",
      "interviewing",
      "it",
      "motivation",
      "networking",
      "problem",
      "resume",
      "role",
      "skills",
      "solving",
      "success",
      "support",
      "teamwork",
      "technical",
      "technology"
    ]
  },
  {
    "job_id": "3891069921",
    "job_title": "Senior Project Manager, Information Technology PMO",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "MITSUBISHI POWER AMERICAS, INC. IN LAKE MARY, FLORIDA  IS LOOKING FOR A SENIOR PROJECT MANAGER, INFORMATION TECHNOLOGY PMO – HYBRID SCHEDULE (3 DAYS A WEEK IN THE OFFICE).\nSUMMARYTHIS POSITION WILL PROVIDE DAY-TO-DAY SUPPORT OF THE INFORMATION TECHNOLOGY (IT) PROJECT MANAGEMENT OFFICE (PMO), PLAY A LEAD ROLE IN COMPANY-WIDE TRANSFORMATION EFFORTS, AND REPORT TO THE DIRECTOR, IT PMO. AS THE SENIOR PROJECT MANAGER FOR IT, YOU WILL WORK WITH IT AND BUSINESS UNIT TEAMS TO ESTABLISH AND BE JOINTLY ACCOUNTABLE FOR DELIVERING PROJECT OBJECTIVES AND TIMELINES. THIS INCLUDES MANAGING IT PROJECTS INVOLVING COMPLEX BUSINESS PROCESSES, TAKING THESE PROJECTS FROM IDEA TO FULL IMPLEMENTATION, AND TRACKING AND REPORTING ON PROGRESS TO VARIOUS AUDIENCES.\nESSENTIAL DUTIES & RESPONSIBILITIESDRIVE WEEKLY IT PMO CADENCE BY COORDINATING AND PREPARING MATERIALS, FACILITATING THE MEETINGS, COORDINATING AGENDAS SO THE CORRECT TOPICS ARE DISCUSSED, AND TRACKING ASSIGNED ACTION ITEMS.PROJECT MANAGE CRITICAL CROSS-FUNCTIONAL TRANSFORMATION IMPLEMENTATIONS AND ENSURE THAT PROJECTS MEET USERS’ BUSINESS NEEDS AND EXPECTATIONS OF QUALITY.DEVELOP, MANAGE, AND DELIVER MULTIPLE IT PROJECTS FROM BEGINNING TO END, INCLUDING PROJECT SCOPE, TIMELINE, CAPACITY PLANNING, RESOURCE ALLOCATION, AND PROJECT EXECUTION.PROVIDE PROJECT MANAGEMENT AND DIRECTION TO ENSURE THE PROJECT TEAM HAS A CLEAR UNDERSTANDING OF TIMELINES, RISKS, ESCALATION PATH AND ROLES/RESPONSIBILITIES THEY WILL UNDERTAKE WITHIN THE PROJECT TEAM.COLLABORATE WITH DIRECTOR, IT PMO, AND BUSINESS LEADERSHIP TEAMS IN STRATEGIC PLANNING AND DECISION-MAKING.TRACK THE EXECUTION OF VARIOUS IT PROJECTS ACROSS BUS MEASURING THE ATTAINMENT OF GOALS, AND ADHERENCE TO BUDGET, SCHEDULE, AND SCOPE.DEMONSTRATE ADVANCED COMMUNICATION SKILLS WHILE PREPARING AND DISSEMINATING IT PMO REPORTS, STEERCO BRIEFINGS, C-SUITE REPORTS, AND GENERAL ORGANIZATION UPDATES.MANAGE PIPELINE PROGRESS (KNOWS THE PIPELINE AND WHAT POTENTIAL ROADBLOCKS EXIST) AND MENTORS OTHERS WHEN PROJECTS ARE OFF TRACK.HAS OR IS ABLE TO ATTAIN THE BUSINESS UNIT DOMAIN EXPERTISE REQUIRED TO COLLABORATE ACROSS THE MULTIFUNCTIONAL PROJECT TEAM.CULTIVATE AND MAINTAIN STRONG RELATIONSHIPS WITH PROJECT TEAMS AND BUSINESS PARTNERS.KNOW THE ORGANIZATION WELL AND IS PROACTIVE IN FINDING INDIVIDUALS THAT CAN ASSIST IN ELIMINATING ROADBLOCKS.CHALLENGE THE PACE, AMBITION, AND PERFORMANCE OF IT PMO PROJECT TEAMS AND BRING AWARENESS OF ISSUES THAT WILL IMPACT PROJECT COMPLETION TIMELINE, SCOPE, OR COST.PRO-ACTIVELY SEEK TO IDENTIFY AND COMMUNICATE ANY SCHEDULE AND BUDGET RISKS.ABILITY TO CREATE DOCUMENTATION SUCH AS, BUT NOT LIMITED TO: SOPS, HOW-TO’S, AND PROCESS TRAINING, ETC. \nOTHER DUTIES AND RESPONSIBILITIESCOMPLY WITH ALL SAFETY POLICIES, PRACTICES AND PROCEDURES REPORTING ALL UNSAFE ACTIVITIES TO MANAGEMENT AND/OR HUMAN RESOURCES.CONTRIBUTE TO BUILDING A POSITIVE TEAM SPIRIT AND ONETEAM IT CULTURE WHILE EMBODYING COMPANY VALUES AT ALL TIMES.CHAMPION A POSITIVE TEAM SPIRIT AND CULTURE BUILT ON INTEGRITY, INCLUSION, TRANSPARENCY, AND ACCOUNTABILITY.PERFORM OTHER RELATED DUTIES, AS DIRECTED BY IT LEADERSHIP TEAM.PROTECT CONFIDENTIAL INFORMATION BY NOT COMMUNICATING, DISCLOSING TO, OR USING FOR BENEFIT OF 3RD PARTIES.TRAVEL - 10% THROUGHOUT THE AMERICAS. \nKNOWLEDGE, SKILLS & EDUCATIONTHE CANDIDATE MUST BE ABLE TO PERFORM EACH ESSENTIAL DUTY SATISFACTORILY. THE REQUIREMENTS ARE REPRESENTATIVE OF THE KNOWLEDGE, SKILLS, AND/OR ABILITIES REQUIRED.\nEDUCATION AND EXPERIENCE:  BACHELOR OF SCIENCE (BS) DEGREE IN COMPUTER SCIENCE, MANAGEMENT OF INFORMATION SYSTEMS, PROJECT MANAGEMENT, ENGINEERING, OR RELATED FIELD. A MINIMUM OF 5 YEARS OF RELEVANT WORK IN IT, ENGINEERING, AND / OR PROJECT MANAGEMENT IS REQUIRED. CANDIDATES SHOULD HAVE PRACTICAL EXPERIENCE IN THE BASICS OF PROJECT MANAGEMENT: ESTIMATION, PROJECT PLANNING, RESOURCE PLANNING, ISSUE MANAGEMENT, RISK MANAGEMENT, CHANGE MANAGEMENT, COMMUNICATION PLANNING. PMP CERTIFICATION IS PREFERRED.  SPECIAL SKILLS/TRAINING/CERTIFICATIONS: PROJECT MANAGEMENT PROFICIENCY: KNOWLEDGE IN ALL PHASES OF PROJECT MANAGEMENT. MUST BE ABLE TO EFFECTIVELY EMPLOY CONTEMPORARY PROJECT MANAGEMENT TOOLS.DOCUMENTATION: GENERAL SKILLS IN CREATING COMPREHENSIVE PROCESS DOCUMENTS (AS-IS, TO-BE), BUSINESS CASES AND BUSINESS REQUIREMENTS DOCUMENTATION, STANDARD OPERATING PROCEDURES (SOPS), AND INSTRUCTIONAL MATERIALS (HOW TO'S).COMPUTER SKILLS: PROFICIENCY IN OFFICE 365 APPLICATIONS, INCLUDING WORD, EXCEL, POWERPOINT, SHAREPOINT, VISIO, AND PROJECT. ADVANCED SKILLS WITH SPECIALIZED SCHEDULING APPLICATIONS WITH EMPHASIS ON PRIMAVERA P6, MICROSOFT PROJECT, AND MS POWER BI. EXPERIENCE WITH CRM (MICROSOFT DYNAMICS), WINDCHILL, SHAREPOINT SPO, AND SAP IS DESIRABLE. \nPHYSICAL DEMANDS & WORK ENVIRONMENT THE PHYSICAL DEMANDS AND WORK ENVIRONMENT CHARACTERISTICS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY AN EMPLOYEE TO SUCCESSFULLY PERFORM THE ESSENTIAL FUNCTIONS OF THIS JOB. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS. WHILE PERFORMING THE DUTIES OF THIS JOB, THE EMPLOYEE IS REGULARLY REQUIRED TO SIT, TALK AND HEAR, AND OCCASIONALLY REQUIRED TO STAND AND WALK. THE EMPLOYEE MUST OCCASIONALLY LIFT AND/OR MOVE UP TO 15 POUNDS. THE NOISE LEVEL IN THE WORK ENVIRONMENT IS USUALLY QUIET. WHY SHOULD YOU APPLY? EXCELLENT BENEFITS (MEDICAL, DENTAL, VISION & 401K MATCHING).EXCELLENT GROWTH AND ADVANCEMENT OPPORTUNITIES.TUITION REIMBURSEMENT AND ON-THE-JOB TRAINING.PAID VACATION, SICK TIME AND HOLIDAYS.COMMITTED TO QUALITY PRODUCTS AND SERVICES.GREAT WORKING ENVIRONMENT AND CULTURE.EMPLOYEE APPRECIATION PROGRAMS AND EVENTS. \nMITSUBISHI IS AN EQUAL EMPLOYMENT OPPORTUNITY (EEO) EMPLOYER ACTIVELY SEEKING TO DIVERSIFY THE WORKFORCE AND IS COMMITTED TO A POLICY OF EQUAL EMPLOYMENT OPPORTUNITY. THEREFORE, ALL QUALIFIED APPLICANTS REGARDLESS OF RACE, COLOR, RELIGION, GENDER, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, VETERAN STATUS OR ANY OTHER LEGALLY RECOGNIZED PROTECTED BASIS UNDER APPLICABLE LAW, ARE STRONGLY ENCOURAGED TO APPLY.",
    "job_skill_set": [
      "project management",
      "resource planning",
      "Office 365",
      "documentation",
      "process documentation",
      "communication",
      "teamwork",
      "leadership",
      "problem solving",
      "strategic planning",
      "relationship building",
      "proactivity",
      "adaptability",
      "PMP certification",
      "risk management",
      "change management",
      "communication planning",
      "Primavera P6",
      "Microsoft Project",
      "MS Power BI",
      "CRM (Microsoft Dynamics)",
      "Windchill",
      "SharePoint SPO",
      "SAP",
      "business case documentation",
      "mentoring",
      "confidentiality"
    ],
    "short_keywords": [
      "365",
      "adaptability",
      "bi",
      "building",
      "business",
      "case",
      "certification",
      "change",
      "communication",
      "confidentiality",
      "crm",
      "documentation",
      "dynamics",
      "information",
      "informationtechnology",
      "leadership",
      "management",
      "manager",
      "mentoring",
      "microsoft",
      "ms",
      "office",
      "p6",
      "planning",
      "pmo",
      "pmp",
      "power",
      "primavera",
      "proactivity",
      "problem",
      "process",
      "project",
      "relationship",
      "resource",
      "risk",
      "sap",
      "senior",
      "sharepoint",
      "solving",
      "spo",
      "strategic",
      "teamwork",
      "technology",
      "windchill"
    ]
  },
  {
    "job_id": "3901628270",
    "job_title": "Information Technology Technician",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "PC/SMARTPHONE:SETUP AND TROUBLESHOOTING/DAILY SUPPORT FOR STAFF.PCS ARE MAINLY WINDOWS.SMART PHONES ARE MAINLY IPHONE, BUT THEY HAVE BYOL DEVICES AS WELL.M365 APPLICATIONS AND CATO VPN IS WORKING ON THE DEVICE. (CATO VPN IS NOT WORKING ON BYOL DEVICE)INTUNE DEVICE REGISTRATION OR ACCOUNT CREATION SUPPORT IS REQUIRED.CATO VPN SOFTWARE INSTALLATION SUPPORT IS REQUIRED.M365 TENANT IS MANAGED BY TEAM IN JAPAN.PC/SMART PHONE TROUBLE SHOOTING SUPPORT IS REQUIRED IN CASE OF ANY ISSUE.ONLY TIER1 SUPPORT IS REQUIRED. IN CASE THERE IS M365 OR CATO VPN RELATED ISSUE, CANDIDATE CAN ASK JAPAN TEAM FOR HELP IF NEEDED.THEY ARE USING JIRA AND CONFLUENCE ON THE DEVICE.\nNETWORK:INSTALLATION WORK AND OPERATION SUPPORTTHEY ARE PLANNING TO HAVE 2 NEW OFFICES IN BAY AREA OR LA AREA IN THE NEAR FUTURE.NETWORK DESIGN FOR THE NEW OFFICES WILL BE DONE BY JAPAN SIDE BUT THEY NEED SOMEONE WHO CAN SUPPORT IMPLEMENTATION FROM US SIDE.TROUBLE SHOOTING SUPPORT WILL BE REQUIRED AFTER THE IMPLEMENTATION.\nOTHER CONDITIONS:JAPANESE AND ENGLISH SPEAKER IS REQUIRED AS HE/SHE NEEDS TO WORK WITH JAPAN IT TEAM WHO CAN ONLY SPEAK JAPANESE.THEY WOULD LIKE TO HAVE ON-SITE SUPPORT FROM HIM/HER FOR 2 DAYS/WEEK.IT SHOULD BE REMOTE SUPPORT FOR THE REST OF THE WEEK.THEY WOULD LIKE TO START HAVING THE SUPPORT AS SOON AS POSSIBLE.",
    "job_skill_set": [
      "Windows",
      "Network Installation",
      "Troubleshooting",
      "Communication",
      "Team Collaboration",
      "iPhone",
      "M365 Applications",
      "CATO VPN",
      "Intune",
      "JIRA",
      "Confluence",
      "Bilingual (Japanese and English)",
      "On-site Support",
      "Remote Support"
    ],
    "short_keywords": [
      "and",
      "applications",
      "bilingual",
      "cato",
      "collaboration",
      "communication",
      "confluence",
      "english",
      "information",
      "informationtechnology",
      "installation",
      "intune",
      "iphone",
      "japanese",
      "jira",
      "m365",
      "network",
      "onsite",
      "remote",
      "support",
      "team",
      "technician",
      "technology",
      "troubleshooting",
      "vpn",
      "windows"
    ]
  },
  {
    "job_id": "3900077466",
    "job_title": "Information Technology Support Technician",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "ABOUT US: WITH OVER 400 EMPLOYEES AND AN ANNUAL TURNOVER OF MORE THAN EUR 98.3 MILLION, SOFTING HAS DEVELOPED INTO AN INTERNATIONALLY SUCCESSFUL COMPANY. OUR HARDWARE AND SOFTWARE SOLUTIONS FOR DATA COMMUNICATION IN THE AUTOMOTIVE, INDUSTRIAL AND IT NETWORKS DIVISIONS ARE NOW THE GLOBAL STANDARD.\nSINCE 1989, ONLINE DEVELOPMENT, INC. (OLDI) HAS BEEN DESIGNING, DEVELOPING, AND MANUFACTURING SOLUTIONS FOR THE INDUSTRIAL AUTOMATION MARKET. WE HAVE BUILT OUR REPUTATION BY CREATING HUNDREDS OF UNIQUE DESIGNS THAT HAVE INTRODUCED NEW TECHNOLOGIES INTO THE INDUSTRIAL MARKET. WE PARTNER WITH LEADING GLOBAL COMPANIES TO CREATE SOLUTIONS THAT CONNECT AUTOMATION WITH BUSINESS ENTERPRISE SYSTEMS INCLUDING THE INTERNET OF THINGS (IOT) AND APPLIANCE TRANSACTION MODULES (ATM) FOR BOTH ENTERPRISE AND CONTROLLER-LEVEL DATA EXCHANGE.TO SUPPORT OUR IT TEAM IN KNOXVILLE, TN IN THE FIELD OF IT INFRASTRUCTURE AND IT-BASED BUSINESS PROCESS SUPPORT, WE ARE LOOKING FOR AN IT SUPPORT TECHNICIAN (M/F/D).\nPOSITION OVERVIEW: AS AN IT SUPPORT TECHNICIAN (M/F/D), YOU WILL WORK IN-PERSON TO TAKE ON INDEPENDENT TASKS TO SUPPORT THE IT TEAM IN KNOXVILLE, TN. YOU WILL NEED TO BECOME FAMILIAR WITH VARIOUS PROCESSES, WORKING METHODS AND PROCEDURES DEFINED TOGETHER WITH THE GLOBAL SOFTING IT TEAM.\nOUR IT TEAM IN KNOXVILLE, TN SUPPORTS THE BUSINESS UNITS OPERATING IN THE USA IN THE AREAS OF IT INFRASTRUCTURE, IT NETWORKS, IT APPLICATIONS, BUSINESS APPLICATIONS, IT SECURITY, IT SERVICES AND THEIR FURTHER DEVELOPMENT. YOU WILL SUPPORT YOUR COLLEAGUES IN IT (GLOBAL AND LOCAL) WITH ANY PROBLEMS THAT ARISE AND SUPPORT THEM IN IMPROVING AND INCREASING THE EFFICIENCY OF OUR IT INFRASTRUCTURE TO OPTIMALLY SUPPORT OUR BUSINESS. YOU WILL THUS PLAY A VITAL ROLE IN ENSURING THE SMOOTH OPERATION OF OUR INTERNAL IT SYSTEMS AND PROVIDING TECHNICAL SUPPORT TO OUR EMPLOYEES. \nKEY RESPONSIBILITIES:PROVIDE TECHNICAL SUPPORT TO EMPLOYEES REGARDING HARDWARE, SOFTWARE, AND NETWORK ISSUES, BOTH IN PERSON AND REMOTELY.DIAGNOSE AND RESOLVE TECHNICAL PROBLEMS RELATED TO DESKTOPS, LAPTOPS, PRINTERS, MOBILE DEVICES, AND OTHER IT EQUIPMENT.INSTALL, CONFIGURE, AND MAINTAIN OPERATING SYSTEMS, SOFTWARE APPLICATIONS, AND PERIPHERAL DEVICES.PROTECT THE IT INFRASTRUCTURE AGAINST CYBER-ATTACKS BY MONITORING PROTECTION MECHANISMS.SET UP AND TROUBLESHOOT NETWORK CONNECTIONS, INCLUDING LAN AND WIRELESS NETWORKS.HELP WITH THE ONBOARDING AND OFFBOARDING PROCESS FOR EMPLOYEES.PERFORM REGULAR MAINTENANCE TASKS SUCH AS SYSTEM UPDATES, ANTIVIRUS SCANS, AND DATA BACKUPS.COLLABORATE WITH OTHER IT TEAM MEMBERS TO IMPLEMENT IT PROJECTS AND INITIATIVES, SUCH AS SOFTWARE UPGRADES, SYSTEM MIGRATIONS, AND INFRASTRUCTURE IMPROVEMENTS.DOCUMENT TECHNICAL PROCEDURES, SYSTEM CONFIGURATIONS, AND SUPPORT TICKETS TO MAINTAIN AN ACCURATE RECORD OF IT ACTIVITIES.PROVIDE TRAINING AND GUIDANCE TO EMPLOYEES ON IT-RELATED TOPICS, INCLUDING BEST PRACTICES FOR DATA SECURITY AND SOFTWARE USAGE.ASSIST MANAGEMENT OF IT ASSETS, INCLUDING HARDWARE, SOFTWARE LICENSES, AND PERIPHERALS.STAY UP TO DATE WITH THE LATEST TECHNOLOGY & SECURITY TRENDS AND DEVELOPMENTS.QUALIFICATIONS:PROVEN EXPERIENCE WORKING IN A RELATED JOB FUNCTION (3)+ YEARS IS PREFERRED. EXPERIENCE IN AN ENTERPRISE ENVIRONMENT IS A PLUS.STRONG KNOWLEDGE OF COMPUTER HARDWARE AND OPERATING SYSTEMS (WINDOWS IS REQUIRED, LINUX IS A PLUS)FAMILIARITY WITH NETWORKING CONCEPTS AND PROTOCOLS, INCLUDING TCP/IP, DNS, DHCP, AND VLANS.EXPERIENCE WITH TROUBLESHOOTING AND RESOLVING ISSUES RELATED TO MICROSOFT OFFICE 365, ACTIVE DIRECTORY, ETC. IS A PLUS.EXCELLENT COMMUNICATION AND INTERPERSONAL SKILLS, WITH THE ABILITY TO INTERACT EFFECTIVELY WITH EMPLOYEES AT ALL LEVELS OF THE ORGANIZATION.BEING A TEAM PLAYER WILLING TO TAKE ON ASSIGNMENTS THAT ARE NOT ALWAYS WITHIN CORE COMPETENCY.STRONG PROBLEM-SOLVING ABILITIES AND ATTENTION TO DETAIL.CERTIFICATIONS SUCH AS COMPTIA A+, NETWORK+, OR MICROSOFT CERTIFIED IT PROFESSIONAL (MCITP) ARE A PLUS.DATABASE KNOWLEDGE IS A PLUS (MS SQL AND ORACLE)EXPERIENCE IN WRITING PYTHON AND SQL SCRIPTS IS A PLUS",
    "job_skill_set": [
      "hardware support",
      "software support",
      "network troubleshooting",
      "operating systems (Windows, Linux)",
      "Microsoft Office 365",
      "database knowledge (MS SQL, Oracle)",
      "SQL scripting",
      "communication",
      "interpersonal skills",
      "teamwork",
      "problem-solving",
      "attention to detail",
      "adaptability",
      "training and guidance",
      "TCP/IP",
      "DNS",
      "DHCP",
      "VLANs",
      "Active Directory",
      "CompTIA A+",
      "Network+",
      "Microsoft Certified IT Professional (MCITP)",
      "Python scripting"
    ],
    "short_keywords": [
      "365",
      "a",
      "active",
      "adaptability",
      "and",
      "attention",
      "certified",
      "communication",
      "comptia",
      "database",
      "detail",
      "dhcp",
      "directory",
      "dns",
      "guidance",
      "hardware",
      "information",
      "informationtechnology",
      "interpersonal",
      "it",
      "knowledge",
      "linux",
      "mcitp",
      "microsoft",
      "ms",
      "network",
      "office",
      "operating",
      "oracle",
      "problemsolving",
      "professional",
      "python",
      "scripting",
      "skills",
      "software",
      "sql",
      "support",
      "systems",
      "tcpip",
      "teamwork",
      "technician",
      "technology",
      "to",
      "training",
      "troubleshooting",
      "vlans",
      "windows"
    ]
  },
  {
    "job_id": "3900964493",
    "job_title": "Information Technology Technician",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "IT TECHNICIAN - 6 MONTH CONTRACT - ONSITE, PORTLAND OREGON\nWE ARE PARTNERED WITH A PORTLAND LOCAL STOP ANIMATION STUDIO IN FINDING A NEW IT TECHNICIAN TO JOIN THEIR TEAM!\nRESPONSIBILITIES:UNBOX AND ORGANIZE HARDWARE INVENTORY EFFICIENTLY TO ENSURE AVAILABILITY AND ACCESSIBILITY.RACK, STACK, AND CABLE SERVERS ACCORDING TO ESTABLISHED STANDARDS AND PROTOCOLS.ASSIST WITH DESKTOP HARDWARE SETUPS TO FACILITATE SMOOTH OPERATIONS FOR END-USERS.WORK WITHIN A DATA CENTER ENVIRONMENT, MAINTAINING CLEANLINESS AND ADHERING TO SAFETY PROTOCOLS.PROVIDE BASIC TIER 1 SUPPORT TO INTERNAL AND EXTERNAL USERS, ADDRESSING HARDWARE-RELATED ISSUES PROMPTLY AND EFFECTIVELY.\nMAINZ BRADY GROUP IS A TECHNOLOGY STAFFING FIRM WITH OFFICES IN CALIFORNIA, OREGON AND WASHINGTON. WE SPECIALIZE IN INFORMATION TECHNOLOGY AND ENGINEERING PLACEMENTS ON A CONTRACT, CONTRACT-TO-HIRE AND DIRECT HIRE BASIS. MAINZ BRADY GROUP IS THE RECIPIENT OF MULTIPLE ANNUAL EXCELLENCE AWARDS FROM THE TECHSERVE ALLIANCE, THE LEADING ASSOCIATION FOR IT AND ENGINEERING STAFFING FIRMS IN THE U.S.MAINZ BRADY GROUP IS AN EQUAL OPPORTUNITY EMPLOYER. WE ARE COMMITTED TO DIVERSITY & INCLUSION AND INCORPORATE NON-DISCRIMINATION BEST PRACTICES IN ALL OF OUR STAFFING PROCESSES. MAINZ BRADY GROUP DOES NOT DISCRIMINATE ON THE BASIS OF RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, GENDER EXPRESSION, AGE, DISABILITY OR ANY OTHER PROTECTED CLASS.",
    "job_skill_set": [
      "organization",
      "communication",
      "problem solving",
      "attention to detail",
      "teamwork",
      "hardware inventory management",
      "server rack and stack",
      "desktop hardware setup",
      "data center maintenance",
      "tier 1 support"
    ],
    "short_keywords": [
      "1",
      "and",
      "attention",
      "center",
      "communication",
      "data",
      "desktop",
      "detail",
      "hardware",
      "information",
      "informationtechnology",
      "inventory",
      "maintenance",
      "management",
      "organization",
      "problem",
      "rack",
      "server",
      "setup",
      "solving",
      "stack",
      "support",
      "teamwork",
      "technician",
      "technology",
      "tier",
      "to"
    ]
  },
  {
    "job_id": "3901938160",
    "job_title": "Information Technology Auditor",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "POSITION: THE IT AUDITOR WILL BE RESPONSIBLE FOR DEFINING AND IMPLEMENTING A LEADING PRACTICE IT INTERNAL CONTROLS WITHIN STERICYCLE'S IT ENVIRONMENT AND DRIVING A CONTROL CONSCIOUS AND COMPLIANT ORGANIZATION. \nREQUIREMENTS: 5+ YEARS OF RELEVANT WORK EXPERIENCE IN AN ENTERPRISE COMPANY.STRONG UNDERSTANDING OF REGULATORY CONCERNS ESPECIALLY IT SARBANES-OXLEY (IT SOX).STRONG UNDERSTANDING OF IT GENERAL CONTROL’S AND RISK ASSOCIATED WITH EACH AREA.FAMILIAR WITH LEADING PRACTICE IT CONTROLS FRAMEWORKS AND AUDIT METHODOLOGIES AND IT INDUSTRY STANDARDS (E.G., COSO 2013, COBIT, ISO, CMM, ITIL, PCI, NIST, SSAE 18 SOC, ETC.).\nPLUSSES:PREVIOUS INTERNAL OR EXTERNAL AUDIT EXPERIENCE A PLUS SAP FUNCTIONAL KNOWLEDGE A PLUS",
    "job_skill_set": [
      "Analytical Thinking",
      "Attention to Detail",
      "Communication",
      "Problem Solving",
      "Team Collaboration",
      "IT Internal Controls",
      "Regulatory Compliance",
      "IT Sarbanes-Oxley (IT SOX)",
      "IT General Controls",
      "Risk Assessment",
      "IT Controls Frameworks",
      "Audit Methodologies",
      "COSO 2013",
      "COBIT",
      "ISO Standards",
      "CMM",
      "ITIL",
      "PCI Compliance",
      "NIST Standards",
      "SSAE 18 SOC",
      "SAP Functional Knowledge"
    ],
    "short_keywords": [
      "18",
      "2013",
      "analytical",
      "assessment",
      "attention",
      "audit",
      "auditor",
      "cmm",
      "cobit",
      "collaboration",
      "communication",
      "compliance",
      "controls",
      "coso",
      "detail",
      "frameworks",
      "functional",
      "general",
      "information",
      "informationtechnology",
      "internal",
      "iso",
      "it",
      "itil",
      "knowledge",
      "methodologies",
      "nist",
      "pci",
      "problem",
      "regulatory",
      "risk",
      "sap",
      "sarbanesoxley",
      "soc",
      "solving",
      "sox",
      "ssae",
      "standards",
      "team",
      "technology",
      "thinking",
      "to"
    ]
  },
  {
    "job_id": "3891014898",
    "job_title": "Information Technology Help Desk",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "AKKODIS IS SEEKING A IT SPECIALIST FOR POSITION WITH A CLIENT LOCATED IN LADSON,SC.PAY RATE - $23-$25/HR \nWE NEED SOMEONE WHO HAS EXPERIENCE IN MICROSOFT OFFICE/365, HARDWARE AND SOFTWARE TROUBLESHOOTING, CUSTOMER SERVICE, WORKING / TROUBLESHOOTING FOR CUSTOMER. HELPDESK PROFESSIONAL WILL BE RESPONSIBLE FOR STANDARD TROUBLESHOOTING OF THE HARDWARE AND OS OF THE PC'S SOME HANDS AND EYES SUPPORT OF THE NETWORK EQUIPMENT, INVENTORY CONTROL, AND OTHER DUTIES AS REQUESTED BY TEAM MANAGER.\nIF YOU ARE INTERESTED IN THIS IT HELPDESK JOB IN LADOSN, SC, PLEASE CONTACT NISHU LAL AT 925.786.7863 OR NISHU.LAL@AKKODISGROUP.COM.\nEQUAL OPPORTUNITY EMPLOYER/VETERANS/DISABLED\nBNEFITS AND 401K PLAN. OUR PROGRAM PROVIDES EMPLOYEES THE FLEXIBILITY TO CHOOSE THE TYPE OF COVERAGE THAT MEETS THEIR INDIVIDUAL NEEDS. AVAILABLE PAID LEAVE MAY INCLUDE PAID SICK LEAVE, WHERE REQUIRED BY LAW; ANY OTHER PAID LEAVE REQUIRED BY FEDERAL, STATE OR LOCAL LAW; AND HOLIDAY PAY UPON MEETING ELIGIBILITY CRITERIA. DISCLAIMER: THESE BENEFIT OFFERINGS DO NOT APPLY TO CLIENT-RECRUITED JOBS AND JOBS WHICH ARE DIRECT HIRE TO A CLIENT\nTO READ OUR CANDIDATE PRIVACY INFORMATION STATEMENT, WHICH EXPLAINS HOW WE WILL USE YOUR INFORMATION, PLEASE VISIT HTTPS://WWW.MODIS.COM/EN-US/CANDIDATE-PRIVACY/\nTHE COMPANY WILL CONSIDER QUALIFIED APPLICANTS WITH ARREST AND CONVICTION RECORDS",
    "job_skill_set": [
      "Microsoft Office/365",
      "hardware troubleshooting",
      "software troubleshooting",
      "helpdesk support",
      "network equipment support",
      "customer service",
      "communication",
      "problem solving",
      "teamwork",
      "inventory control"
    ],
    "short_keywords": [
      "communication",
      "control",
      "customer",
      "desk",
      "equipment",
      "hardware",
      "help",
      "helpdesk",
      "information",
      "informationtechnology",
      "inventory",
      "microsoft",
      "network",
      "office365",
      "problem",
      "service",
      "software",
      "solving",
      "support",
      "teamwork",
      "technology",
      "troubleshooting"
    ]
  },
  {
    "job_id": "3901346547",
    "job_title": "Information Technology System Analyst",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "SUPPORT ALL IT HARDWARE AND APPLICATIONS IN AN INDUSTRIAL MANUFACTURING AND OFFICE ENVIRONMENT. AS PART OF THE IT TEAM YOU WILL HELP REMOTELY SUPPORT OTHER LOCATIONS AS WELL. HELP TO DEVELOP IT SOLUTIONS USED THROUGHOUT THE BUSINESS TO IMPROVE PROCESS TIMES AND REDUCE COSTS. DEFINE, ANALYZE, SUPPORT, TEST AND ADMINISTER BUSINESS RELATED APPLICATIONS THAT ARE DESIGNED TO MEET DEFINED PROJECT REQUIREMENTS. PARTICIPATE ON SMALL TEAMS AND PERFORM ASSIGNMENTS TO ACCOMPLISH DEPARTMENT GOALS.\nCOLLABORATES WITH OTHER TECHNICAL ANALYSTS, SENIOR TECHNICAL ANALYSTS AND END USERS.ESSENTIAL FUNCTIONS:SUPPORT AND DEPLOY APPROPRIATE IT SOLUTIONS THROUGHOUT THE BUSINESS. SOLUTIONS ARE BUILT IN HOUSE OR ARE ENTERPRISE SOLUTIONS IMPLEMENTED AS PART OF A STANDARD OFFERING FROM CORPORATE.SUPPORTS AND DEPLOYS NEW HARDWARE THAT INCLUDES LAPTOPS, SHOPFLOOR PCS, PRINTERS (LABEL AND LASER).SUPPORT NETWORK AND INFRASTRUCTURE UPDATES AND HELP DEPLOY NETWORK RESOURCES WITH HELP FROM OTHER TEAM MEMBERS. SUPPORTS ALL TECHNICAL SHOP FLOOR APPLICATIONS AND END POINTS.UNDERSTANDING OF APP DEVELOPMENT USING MICROSOFT VISUAL TOOLS. (.NET, C#, BLAZOR OR TELERIK A PLUS)RECOMMEND MODIFICATIONS TO IT SYSTEMS TO IMPROVE AND SIMPLIFY BUSINESS SYSTEMS AND REDUCE OPERATING COSTS.ESTABLISH AND DEVELOP METHODOLOGIES FOR PROPER UTILIZATION OF IT TECHNOLOGY. (DEVOPS AND AGILE A PLUS).EVALUATE AND MODIFY EXISTING APPLICATIONS TO ACCOMMODATE CHANGES IN BUSINESS OR EQUIPMENT CONFIGURATIONS.POSSIBLE TRAVEL TO REMOTE LOCATIONS TO ASSIST IN THE SUPPORT AND IMPLEMENTATION OF IT SOLUTIONS.PROVIDE AFTER-HOUR TECHNICAL SUPPORT AS NEEDED.KEY RESPONSIBILITIES:THIS POSITION MAY BE ASSIGNED (BUT IS NOT LIMITED TO) THE FOLLOWING KEY IT DISCIPLINES AND/OR SERVICES:1. HELP DESK REPRESENTATIVE TO CLOSE TICKETS SUBMITTED BY DIVISION PERSONNEL.2. SUPPORT ALL TYPES OF IT HARDWARE (LAPTOPS, PCS, PRINTERS, WIRELESS, NETWORK RESOURCES, ETC.)3. SUPPORT ALL SOFTWARE APPLICATIONS (ONE OFF SOLUTIONS, NEW TECH, & CORPORATE PURCHASED/ENTERPRISE SOLUTIONS)4. REFRESH TRACKING OF ALL HARDWARE SO THEY REMAIN ON WARRANTEE.5. LAN/WAN SUPPORT WITH DIRECTION FROM THE INFRASTRUCTURE AND SECURITY TEAM MEMBER6. BE ABLE TO LEAD AND MANAGE PROJECTS7. BUSINESS SYSTEMS UNDERSTANDING (IBM MAINFRAME A PLUS)8. SQL STORED PROCEDURES, QUERY, AND DB DESIGN UNDERSTANDING A PLUS\n4 YEAR UNIVERSITY / COLLEGE DEGREE – INFORMATION SYSTEMS OR OTHER RELATED FIELD3 YEARS OF RELATED EXPERIENCE.KNOWLEDGE OF COMMENSURATE TECHNOLOGY FOR ASSIGNED AREA OF RESPONSIBILITY.STRONG INTERPERSONAL SKILLS, RELATES WELL WITH ALL LEVELS OF THE ORGANIZATION.STRONG WRITTEN AND VERBAL COMMUNICATION SKILLS. \nPARKER IS AN EQUAL OPPORTUNITY AND AFFIRMATIVE ACTION EMPLOYER. PARKER IS COMMITTED TO ENSURING EQUAL EMPLOYMENT OPPORTUNITIES FOR ALL JOB APPLICANTS AND EMPLOYEES. EMPLOYMENT DECISIONS ARE BASED UPON JOB RELATED REASONS REGARDLESS OF RACE, ETHNICITY, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, AGE, NATIONAL ORIGIN, DISABILITY, GENDER IDENTITY, GENETIC INFORMATION, VETERAN STATUS, OR ANY OTHER STATUS PROTECTED BY LAW. HOWEVER, U.S. CITIZENSHIP, PERMANENT RESIDENCY OR OTHER APPROPRIATE STATUS IS REQUIRED FOR CERTAIN POSITIONS, IN ACCORD WITH U.S. IMPORT & EXPORT REGULATIONS.\n(“MINORITY / FEMALE / DISABILITY / VETERAN / VEVRAA FEDERAL CONTRACTOR”)IF YOU WOULD LIKE MORE INFORMATION ABOUT EQUAL EMPLOYMENT OPPORTUNITY AS AN APPLICANT UNDER THE LAW, PLEASE GO TO KNOW YOUR RIGHTS: WORKPLACE DISCRIMINATION IS ILLEGAL (EEOC.GOV) AND GENETIC INFORMATION DISCRIMINATION",
    "job_skill_set": [
      "IT hardware support",
      "application support",
      "network support",
      ".NET",
      "C#",
      "SQL",
      "LAN/WAN support",
      "project management",
      "business systems understanding",
      "help desk support",
      "interpersonal skills",
      "communication",
      "team collaboration",
      "problem solving",
      "analytical skills",
      "adaptability",
      "Microsoft Visual Tools",
      "Blazor",
      "Telerik",
      "DevOps",
      "Agile",
      "DB design"
    ],
    "short_keywords": [
      "adaptability",
      "agile",
      "analyst",
      "analytical",
      "application",
      "blazor",
      "business",
      "c",
      "collaboration",
      "communication",
      "db",
      "design",
      "desk",
      "devops",
      "hardware",
      "help",
      "information",
      "informationtechnology",
      "interpersonal",
      "it",
      "lanwan",
      "management",
      "microsoft",
      "net",
      "network",
      "problem",
      "project",
      "skills",
      "solving",
      "sql",
      "support",
      "system",
      "systems",
      "team",
      "technology",
      "telerik",
      "tools",
      "understanding",
      "visual"
    ]
  },
  {
    "job_id": "3901351909",
    "job_title": "Information Technology Assistant",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "WE ARE SEEKING A MOTIVATED AND ENTHUSIASTIC INDIVIDUAL TO JOIN OUR IT TEAM AS AN ENTRY-LEVEL IT ASSISTANT. THIS ROLE OFFERS AN EXCELLENT OPPORTUNITY FOR SOMEONE LOOKING TO KICK-START THEIR CAREER IN THE FIELD OF INFORMATION TECHNOLOGY. THE SUCCESSFUL CANDIDATE WILL WORK CLOSELY WITH OUR IT PROFESSIONALS TO PROVIDE TECHNICAL SUPPORT AND ASSISTANCE TO OUR EMPLOYEES.\nKEY RESPONSIBILITIES:PROVIDE FIRST-LINE TECHNICAL SUPPORT TO EMPLOYEES VIA PHONE, EMAIL, OR IN PERSON, RESOLVING IT-RELATED ISSUES PROMPTLY AND EFFECTIVELY.ASSIST IN THE INSTALLATION, CONFIGURATION, AND MAINTENANCE OF HARDWARE, SOFTWARE, AND PERIPHERAL DEVICES, INCLUDING DESKTOPS, LAPTOPS, PRINTERS, AND MOBILE DEVICES.TROUBLESHOOT NETWORK CONNECTIVITY ISSUES AND ASSIST WITH BASIC NETWORK ADMINISTRATION TASKS.ASSIST IN THE SETUP AND MAINTENANCE OF USER ACCOUNTS AND ACCESS PERMISSIONS.HELP MANAGE IT INVENTORY, INCLUDING TRACKING HARDWARE AND SOFTWARE ASSETS.PARTICIPATE IN IT PROJECTS AND INITIATIVES AS REQUIRED, PROVIDING SUPPORT AND CONTRIBUTING TO THEIR SUCCESSFUL COMPLETION.STAY UP-TO-DATE WITH EMERGING TECHNOLOGIES AND TRENDS IN THE IT FIELD, AND ASSIST IN EVALUATING THEIR POTENTIAL IMPACT ON THE ORGANIZATION.\nQUALIFICATIONS:BACHELOR'S DEGREE IN INFORMATION TECHNOLOGY, COMPUTER SCIENCE, OR A RELATED FIELD (OR EQUIVALENT WORK EXPERIENCE).STRONG PASSION FOR TECHNOLOGY AND A DESIRE TO LEARN AND DEVELOP NEW SKILLS.EXCELLENT COMMUNICATION AND INTERPERSONAL SKILLS, WITH THE ABILITY TO EFFECTIVELY INTERACT WITH EMPLOYEES AT ALL LEVELS OF THE ORGANIZATION.BASIC UNDERSTANDING OF COMPUTER HARDWARE, SOFTWARE, AND NETWORKING CONCEPTS.ABILITY TO WORK WELL BOTH INDEPENDENTLY AND AS PART OF A TEAM, IN A FAST-PACED AND DYNAMIC ENVIRONMENT.PRIOR EXPERIENCE IN A TECHNICAL SUPPORT ROLE OR RELEVANT INTERNSHIPS/CO-OP PLACEMENTS WOULD BE AN ASSET, BUT NOT REQUIRED.",
    "job_skill_set": [
      "technical support",
      "hardware installation",
      "software installation",
      "network troubleshooting",
      "user account management",
      "IT inventory management",
      "computer hardware knowledge",
      "computer software knowledge",
      "networking concepts",
      "communication",
      "interpersonal skills",
      "teamwork",
      "adaptability",
      "motivation",
      "problem solving",
      "desire to learn",
      "emerging technologies evaluation"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "assistant",
      "communication",
      "computer",
      "concepts",
      "desire",
      "emerging",
      "evaluation",
      "hardware",
      "information",
      "informationtechnology",
      "installation",
      "interpersonal",
      "inventory",
      "it",
      "knowledge",
      "learn",
      "management",
      "motivation",
      "network",
      "networking",
      "problem",
      "skills",
      "software",
      "solving",
      "support",
      "teamwork",
      "technical",
      "technologies",
      "technology",
      "to",
      "troubleshooting",
      "user"
    ]
  },
  {
    "job_id": "3903442852",
    "job_title": "Senior Information Technology Application Analyst",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOB DETAILS\nARE YOU INTERESTED IN SHAPING THE FUTURE OF HEALTHCARE AND PROVIDING EXCEPTIONAL HEALTH EXPERIENCES TO OUR COMMUNITY? JOIN THE CHRISTIANACARE FAMILY FOR ENDLESS PERSONAL AND PROFESSIONAL GROWTH OPPORTUNITIES WHILE COLLABORATING ALONGSIDE OUR DEVELOPMENT AND CLINICAL EXPERTS TO CREATE INNOVATIVE SOLUTIONS THAT POSITIVELY IMPACT OUR COMMUNITY'S HEALTH AND WELL-BEING.\n\n\n\nTHE SENIOR IT APPLICATION ANALYST POSITION IS AN ADVANCED POSITION AND IS RESPONSIBLE FOR MEDIUM TO LARGE APPLICATIONS AND SPECIFIC FEATURE/FUNCTIONS OF LARGER SYSTEMS. THIS INCLUDES PARTICIPATION AND ALL ASPECTS OF SUPPORT, MAINTENANCE, CONFIGURATION MANAGEMENT AND SYSTEM UPGRADES. EMPHASIS FOR THE POSITION WILL BE ON COMPLEX APPLICATIONS. MENTORING OF OTHER AND TAKING ON MORE LEADERSHIP ROLES. \n\n\n\nPRINCIPAL DUTIES AND RESPONSIBILITIES:\n\n\n\nMAINTAINS AND SUPPORTS EXISTING COMPUTER APPLICATIONS:\nPROACTIVELY MONITOR CUSTOMER SATISFACTION WITH APPLICATIONS TO ENSURE THEY CONTINUE TO MEET THEIR NEEDS. COMMUNICATE SYSTEM CHANGES AND ISSUES.WORK WITH THE CUSTOMER TO IDENTIFY, PRIORITIZE, AND SCHEDULE ENHANCEMENTS AND PROBLEM RESOLUTION.LOGS, MONITORS, DOCUMENTS AND RESOLVES APPLICATION SOFTWARE PROBLEMS EITHER DIRECTLY OR WITH THE ASSISTANCE OF OTHERS (E.G. INFRASTRUCTURE STAFF, OTHER APPLICATION STAFF, THE VENDOR, ETC.)EVALUATE DOCUMENTED RESOLUTIONS AND ANALYZE ROOT CAUSE TRENDS FOR WAYS TO PREVENT REPEATED FUTURE PROBLEMS.PERFORM PREVENTATIVE MAINTENANCE, INCLUDING THE INSTALLATION OF SERVICE PACKS, PATCHES, HOT FIXES, ETC.MONITORS VENDOR SOFTWARE RELEASES AND TESTS/IMPLEMENTS UPGRADES OR MAINTENANCE PATCHES TO ENSURE CURRENT VERSION IS SUPPORTABLE.LIAISON WITH IT INFRA-STRUCTURE REGARDING HARDWARE, OPERATING SYSTEM, INTERFACE AND NETWORK REQUIREMENTS TO ENSURE SYSTEM RELIABILITY, PERFORMANCE AND RECOVERABILITY. FULLY DOCUMENT BACKUP AND RECOVERY PROCESSES AND TEST THESE TO ENSURE RELIABILITY AS THE SYSTEM SETUPS CHANGE.\n\n\n\nPARTICIPATES IN THE IMPLEMENTATION OF NEW COMPUTER APPLICATIONS:\nDEVELOPS APPROPRIATE WORKPLANS FOR IMPLEMENTATION OF NEW APPLICATIONS. THIS INCLUDES ALL TASKS NECESSARY TO SUCCESSFULLY IMPLEMENT SOFTWARE APPLICATIONS INTO OUR ENVIRONMENT INCLUDING INFRASTRUCTURE, APPLICATIONS, INTERFACES AND COORDINATION WITH CUSTOMERS AND/OR SYSTEMS ANALYST.COORDINATES WITH IT INFRASTRUCTURE GROUPS TO ENSURE APPLICATION IMPLEMENTATIONS ARE EXECUTED ACCORDING TO PLAN.IDENTIFY AND LEARN APPROPRIATE SOFTWARE APPLICATIONS USED AND SUPPORTED BY THE ORGANIZATION. ASSIST IN THE ASSESSING OF NEW APPLICATIONS FOR FIT INTO OUR TECHNICAL ENVIRONMENT BALANCING CUSTOMER NEED WITH TECHNICAL FEASIBILITY. USE THIS KNOWLEDGE TO ENSURE THE IMPACTS OF NEW APPLICATIONS ON EXISTING ARE ADDRESSED.DEVELOPS BACKUP STRATEGIES FOR APPLICATIONS AND TESTS THEIR VIABILITY. ALSO DEVELOPS AND IMPLEMENTS APPLICATIONS IN A WAY THAT ENSURES WE CAN RECOVER FROM DISASTERS.WITH THE HELP OF IT INFRASTRUCTURE STAFF, DEVELOPS APPROPRIATE TESTS ENVIRONMENTS SO FUTURE RELEASES OF SOFTWARE CAN BE SUCCESSFULLY IMPLEMENTED WITH APPROPRIATE CHANGE CONTROL.MANAGES HEALTHY VENDOR RELATIONSHIPS THAT ENSURE IMPLEMENTATIONS AND PROBLEMS ASSOCIATED WITH IMPLEMENTATION ARE RESOLVED.COORDINATES AND PLANS ALL LEVELS OF TESTING INCLUDING UNIT TESTING, INTEGRATED TESTING, USER ACCEPTANCE TESTING AND TRAINING.PLANS AND IMPLEMENTS DATA CONVERSIONS AND OTHER GO-LIVE STEPS AS REQUIRED.CREATES AND MAINTAINS DOCUMENTATION FOR APPLICATION AND CUSTOMER SERVICE CENTER SUPPORT.\n\n\n\nASSESSES USER DEPARTMENT COMPUTER APPLICATIONS / SOLUTIONS:\nPROVIDES TECHNICAL APPLICATION GUIDANCE AS NEW SOFTWARE SOLUTIONS ARE ASSESSED AND IMPLEMENTED IN OUR TECHNICAL ENVIRONMENT. THIS EFFORT IS CLOSELY COORDINATED WITH IT INFRASTRUCTURE STAFF.\nASSESSES VARIOUS SOFTWARE VENDORS FOR BEST FIT INTO OUR TECHNICAL ENVIRONMENT AS PART OF THE OVERALL SOFTWARE EVALUATION PROCESS (THIS INCLUDES APPLICATIONS THAT RUN INTERNALLY OR FROM EXTERNAL SITES).ASSESSES CUSTOMER NEEDS AND GUIDES THEM ON HOW TO PURSUE NEW INITIATIVES.\n\n\n\nLEADERSHIP:\nPROVIDES GUIDANCE AND LEADERSHIP TO OTHER APPLICATION ANALYSTS ON APPLICATIONS. RESPONSIBLE FOR MENTORING OTHERS TO IMPLEMENT AND MAINTAIN APPLICATIONS. ENSURES SUFFICIENT BACKUP FOR THEIR RESPONSIBILITIES IS ESTABLISHED. THIS GUIDANCE IS PROVIDED FOR SIMPLE TO COMPLEX APPLICATIONS.TAKES RESPONSIBILITY FOR LEADING OTHERS TO PURSUE AND SOLVE DIFFICULT PROBLEMS. THIS INCLUDES LEADING OTHER APPLICATION ANALYST, SPECIALTY GROUPS, VENDORS AND CUSTOMERS. THIS LEADERSHIP IS PROVIDED FOR SIMPLE TO COMPLEX APPLICATIONS.PROVIDES TECHNICAL APPLICATION PROJECT LEADERSHIP FOR SIMPLE TO COMPLEX APPLICATIONS.\n\n\n\nEDUCATION AND EXPERIENCE REQUIREMENTS:\nBACHELOR'S DEGREE IN, COMPUTER SCIENCE OR RELATED FIELDS, OR EXPERIENCE CONSISTENT WITH THE APPLICATION ANALYST JOB RESPONSIBILITIES.FOUR TO SIX YEARS OF EXPERIENCE IN INFORMATION TECHNOLOGY.A COMBINATION OF EDUCATION AND EXPERIENCE MAY BE SUBSTITUTED.\n\n\n\nCHRISTIANACARE OFFERS:\nFULL MEDICAL, DENTAL, VISION, LIFE INSURANCE, ETC.TWO RETIREMENT PLANNING OFFERINGS, INCLUDING 403(B) WITH COMPANY CONTRIBUTIONSGENEROUS PAID TIME OFF WITH ANNUAL ROLL-OVER AND OPPORTUNITIES TO CASH OUT12 WEEK PAID PARENTAL LEAVETUITION ASSISTANCEINCREDIBLE WORK/LIFE BENEFITS INCLUDING ANNUAL MEMBERSHIP TO CARE.COM, ACCESS TO BACKUP CARE SERVICES FOR DEPENDENTS THROUGH CARE@WORK, RETIREMENT PLANNING SERVICES, FINANCIAL COACHING, FITNESS AND WELLNESS REIMBURSEMENT, AND GREAT DISCOUNTS THROUGH SEVERAL VENDORS FOR HOTELS, RENTAL CARS, THEME PARKS, SHOWS, SPORTING EVENTS, MOVIE TICKETS AND MUCH MORE!\n\n\n\n\n\n\nPOST END DATEJUN 24, 2024\n\nEEO POSTING STATEMENTCHRISTIANA CARE HEALTH SYSTEM IS AN EQUAL OPPORTUNITY EMPLOYER, FIRMLY COMMITTED TO PROHIBITING DISCRIMINATION, WHOSE STAFF IS REFLECTIVE OF ITS COMMUNITY, AND CONSIDERS QUALIFIED APPLICANTS FOR OPEN POSITIONS WITHOUT REGARD TO RACE, COLOR, SEX, RELIGION, NATIONAL ORIGIN, SEXUAL ORIENTATION, GENETIC INFORMATION, GENDER IDENTITY OR EXPRESSION, AGE, VETERAN STATUS, DISABILITY, PREGNANCY, CITIZENSHIP STATUS, OR ANY OTHER CHARACTERISTIC PROTECTED UNDER APPLICABLE FEDERAL, STATE, OR LOCAL LAW.\n\n\n\n\n\n\n",
    "job_skill_set": [
      "system upgrades",
      "software implementation",
      "data conversion",
      "technical guidance",
      "vendor management",
      "backup and recovery processes",
      "root cause analysis",
      "documentation",
      "disaster recovery",
      "application evaluation",
      "IT infrastructure coordination",
      "application development",
      "leadership",
      "communication",
      "problem solving",
      "collaboration",
      "customer service orientation",
      "analytical thinking",
      "adaptability",
      "project management",
      "teamwork",
      "application support",
      "configuration management",
      "preventative maintenance",
      "testing (unit, integrated, user acceptance)",
      "customer satisfaction monitoring",
      "mentoring"
    ],
    "short_keywords": [
      "acceptance",
      "adaptability",
      "analysis",
      "analyst",
      "analytical",
      "and",
      "application",
      "backup",
      "cause",
      "collaboration",
      "communication",
      "configuration",
      "conversion",
      "coordination",
      "customer",
      "data",
      "development",
      "disaster",
      "documentation",
      "evaluation",
      "guidance",
      "implementation",
      "information",
      "informationtechnology",
      "infrastructure",
      "integrated",
      "it",
      "leadership",
      "maintenance",
      "management",
      "mentoring",
      "monitoring",
      "orientation",
      "preventative",
      "problem",
      "processes",
      "project",
      "recovery",
      "root",
      "satisfaction",
      "senior",
      "service",
      "software",
      "solving",
      "support",
      "system",
      "teamwork",
      "technical",
      "technology",
      "testing",
      "thinking",
      "unit",
      "upgrades",
      "user",
      "vendor"
    ]
  },
  {
    "job_id": "3898167161",
    "job_title": "Director of Information Technology",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "WE ARE WORKING WITH THE EXECUTIVE TEAM OF A HIGHLY SUCCESSFUL COMPANY IN THE MEMPHIS-AREA TO MAKE A SUCCESSION HIRE FOR THEIR NEXT VP - IT. BUSINESS ACUMEN SKILLS WITH A COLLABORATIVE MINDSET TO DEVELOP SOLUTIONS THROUGHOUT THE ORGANIZATION. HIGH VISIBILITY. DISTRIBUTION INDUSTRY EXPERIENCE REQUIRED; CLOUDSUITE EXPERIENCE PREFERRED. COMPETITIVE COMP AND RELO ASSISTANCE OFFERED.\nLEAD THE IT DEPARTMENT WHILE SERVICING ALL IT MATTERS OF THE ORGANIZATION.COLLABORATE WITH ALL DEPARTMENTS TO UNDERSTAND HOW IT COULD PROVIDE GREATER SUPPORT.PROPOSE SOFTWARE, SERVICES AND HARDWARE PURCHASES.DRIVE EFFICIENCIES THROUGH CONSOLIDATION OF SUBSCRIPTIONS AND PLATFORMS.MAINTAIN ONGOING SYSTEM RISK ANALYSIS AND RISK MITIGATION PRACTICES.\nEXPERIENCE:5+ YEARS IN IT MANAGEMENT IN A MULTI-LOCATION ENVIRONMENTWAREHOUSE MANAGEMENT SYSTEMSSIGNIFICANT DEVELOPMENT AND INTEGRATION EXPERIENCE WITH APIS, BODS, WEB SERVICES, ETC.",
    "job_skill_set": [
      "Business Acumen",
      "Collaboration",
      "Problem Solving",
      "Communication",
      "Leadership",
      "Strategic Thinking",
      "IT Management",
      "CloudSuite",
      "Warehouse Management Systems",
      "API Development",
      "Integration Experience",
      "Risk Analysis",
      "Risk Mitigation",
      "Software Purchasing",
      "Hardware Purchasing",
      "Subscription Management"
    ],
    "short_keywords": [
      "acumen",
      "analysis",
      "api",
      "business",
      "cloudsuite",
      "collaboration",
      "communication",
      "development",
      "director",
      "experience",
      "hardware",
      "information",
      "informationtechnology",
      "integration",
      "it",
      "leadership",
      "management",
      "mitigation",
      "of",
      "problem",
      "purchasing",
      "risk",
      "software",
      "solving",
      "strategic",
      "subscription",
      "systems",
      "technology",
      "thinking",
      "warehouse"
    ]
  },
  {
    "job_id": "3902357305",
    "job_title": "Information Technology Project Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "LOCAL LAW FIRM SEEKING AN IT PROJECT MANAGER TO JOIN THEM ON A LONG TERM CONSULTING BASIS, HYBRID WORK MODEL IN PHILADELPHIA. CLIENT IS UPDATING THEIR INTERNAL APPLICATION AND MOVING TO THE CLOUD, MICROSOFT PRODUCTS TO AZURE CLOUD IN A GLOBAL ENTERPRISE ENVIRONMENT. \nCANDIDATE SHOULD BE EXPERIENCE WITH CREATING PROJECT PLANS, ROADMAPS, MANAGING TIMELINES, SDLC/AGILE -- MICROSOFT PRODUCT KNOWLEDGE IS HIGHLY DESIRED.\nCANDIDATE SHOULD HAVE EXPERIENCE WITH AS MANY OF THESE PRODUCTS AS POSSIBLE, MS EXCHANGE, ON-PREM / CLOUDO365SHAREPOINT, ON-PREM / CLOUDINTUNE AZURE AD ONEDRIVE MS TEAMSJIRANICE TO HAVES, JIRA, IMANAGE, WORKDAY, ENGAGE, ETC.\nUSC/GC HOLDERS ONLY, NO THIRDS PLEASE.",
    "job_skill_set": [
      "Project Management",
      "Communication",
      "Team Management",
      "Problem Solving",
      "Adaptability",
      "Microsoft Azure",
      "SDLC",
      "Agile",
      "Microsoft Exchange",
      "Office 365",
      "SharePoint",
      "Intune",
      "Azure Active Directory",
      "OneDrive",
      "MS Teams",
      "JIRA",
      "iManage",
      "Workday",
      "Engage",
      "Time Management"
    ],
    "short_keywords": [
      "365",
      "active",
      "adaptability",
      "agile",
      "azure",
      "communication",
      "directory",
      "engage",
      "exchange",
      "imanage",
      "information",
      "informationtechnology",
      "intune",
      "jira",
      "management",
      "manager",
      "microsoft",
      "ms",
      "office",
      "onedrive",
      "problem",
      "project",
      "sdlc",
      "sharepoint",
      "solving",
      "team",
      "teams",
      "technology",
      "time",
      "workday"
    ]
  },
  {
    "job_id": "3901662645",
    "job_title": "Senior Information Technology Auditor",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOB TITLE: SENIOR IT AUDITOR\nJOB LOCATION: BOSTON, MA (FINANCIAL DISTRICT)HYBRID SCHEDULEINDUSTRY: ASSET MANAGEMENT FIRM WITH 150 EMPLOYEES AND MANAGE JUST UNDER A TRILLION IN ASSETS UNDER MANAGEMENT. \nWHY OPEN: NEWLY CREATED POSITION\nREQUIRED:3+ YEARS OF IT AUDIT EXPERIENCE (IDEALLY CLOSER TO 5+)CIA, CISA OR CISM CERTIFICATION (OR WORKING TOWARDS AT LEAST ONE OF THEM)\nPLUSES:FINANCIAL SERVICE/INVESTMENT INDUSTRY EXPERIENCE \nSENIOR TECHNOLOGY AUDITOR TO BECOME AN INTEGRAL MEMBER OF THE INTERNAL AUDIT TEAM. THE SR. TECHNOLOGY AUDITOR WILL BE RESPONSIBLE FOR THE EXECUTION OF TECHNOLOGY AUDITS AND ASSISTING IN OPERATIONAL AUDITS IN ACCORDANCE WITH THE INTERNAL AUDIT PLAN. THIS ROLE REPORTS TO THE DIRECTOR OF TECHNOLOGY AUDIT.\nRESPONSIBILITIES:ANALYZE BUSINESS PROCESS, PROCEDURES, AND RISKS AND EVALUATE INTERNAL CONTROLSCOMMUNICATE EFFECTIVELY WITH THE TECHNOLOGY TEAM AND TECHNOLOGY LIAISONS WHERE APPLICABLE TO MANAGE EXPECTATIONS AND ENSURE COOPERATION TO ACHIEVE OBJECTIVESDEVELOP AND EXECUTE IT AUDIT PROGRAMS, TESTING PROCEDURES, AND DATA ANALYSIS TO EVALUATE THE DESIGN AND OPERATING EFFECTIVENESS OF CONTROLSIDENTIFY CONTROL DEFICIENCIES AND AREAS FOR IMPROVEMENT AND PROVIDE PRACTICAL AND ACTIONABLE RECOMMENDATIONS TO ENHANCE TECHNOLOGY CONTROLS AND PROCESSESPREPARE DETAILED REPORTS AND DISCUSS RESULTS WITH THE AUDITEE AND INTERNAL AUDIT TEAMCOMPLETE ASSIGNED ENGAGEMENTS AND REPORTS WITHIN COMMUNICATED DEADLINESMONITOR AND TRACK THE IMPLEMENTATION OF AUDIT RECOMMENDATIONS, FOLLOWING UP WITH STAKEHOLDERS TO ENSURE TIMELY RESOLUTION OF IDENTIFIED ISSUESCOLLABORATE WITH OTHER AUDITORS, TECHNICAL SPECIALISTS, AND BUSINESS STAKEHOLDERS TO UNDERSTAND TECHNOLOGY RISKS AND CONTROLS ACROSS COMPANYKEEP UP TO DATE WITH NEW TECHNOLOGIES, REGULATIONS, AND INDUSTRY STANDARDS TO ENSURE AUDIT PROCEDURES REMAIN RELEVANT AND EFFECTIVEPARTICIPATE IN AD HOC PROJECTS, INVESTIGATIONS, AND OTHER TECHNOLOGY OR NON-TECHNOLOGY RELATED INITIATIVES AS ASSIGNEDSKILLS YOU BRING:3-5+ YEARS OF EXPERIENCE IN IT AUDIT OR INFORMATION TECHNOLOGY WITH A FOCUS ON RISK MANAGEMENT, SYSTEM DEVELOPMENT AND/OR SECURITY BACHELOR’S DEGREE EXPERIENCE IN OPERATIONAL AUDIT PREFERREDEXPERIENCE IN ASSESSING EMERGING TECHNOLOGY RISKS, SUCH AS CLOUD COMPUTING, ARTIFICIAL INTELLIGENCE, AND CYBERSECURITYEXPERIENCE WITH LINUX, SQL, NETWORK ENVIRONMENTS, SSDLC/CHANGE MANAGEMENT-RELATED PROCESSES AND CONTROLS, CLOUD MIGRATION, CODE SECURITY, AND DATA MANAGEMENT A PLUSUNDERSTANDING OF INTERNAL CONTROL CONCEPTS AND EXPERIENCE IN APPLYING THEM TO PLAN, PERFORM, MANAGE, AND REPORT ON THE EVALUATION OF VARIOUS BUSINESS PROCESSES/AREAS/FUNCTIONSAWARE OF CHANGES IN IT AUDIT PRACTICES, REGULATORY REQUIREMENTS, AND IT RISK FRAMEWORKS (E.G., COBIT, NIST SP 800, NIST CSF, CSC) AND THEIR IMPACTKEY COMPETENCIES:STRONG PROJECT MANAGEMENT AND ANALYTICAL SKILLSATTENTION TO DETAIL AND ACCURACYPLANNING AND ORGANIZING (DEADLINE-ORIENTED); ABILITY TO EFFECTIVELY BALANCE PRIORITIESABILITY TO COMMUNICATE CLEARLY AND CONCISELY, BOTH ORAL AND WRITTENHIGHLY COLLABORATIVE INCLUDING WITH CROSS-FUNCTIONAL TEAMSINITIATIVE TO WORK INDIVIDUALLY BUT ALSO WELL WITHIN A TEAM BASED ENVIRONMENT",
    "job_skill_set": [
      "Risk Management",
      "SQL",
      "Cybersecurity",
      "Internal Controls",
      "Communication",
      "Project Management",
      "Analytical Skills",
      "Attention to Detail",
      "Planning and Organizing",
      "Collaboration",
      "Initiative",
      "IT Audit",
      "CIA Certification",
      "CISA Certification",
      "CISM Certification",
      "Data Analysis",
      "Linux",
      "Cloud Computing",
      "COBIT",
      "NIST SP 800",
      "NIST CSF",
      "SSDLC",
      "Change Management",
      "Code Security",
      "Data Management"
    ],
    "short_keywords": [
      "800",
      "analysis",
      "analytical",
      "and",
      "attention",
      "audit",
      "auditor",
      "certification",
      "change",
      "cia",
      "cisa",
      "cism",
      "cloud",
      "cobit",
      "code",
      "collaboration",
      "communication",
      "computing",
      "controls",
      "csf",
      "cybersecurity",
      "data",
      "detail",
      "information",
      "informationtechnology",
      "initiative",
      "internal",
      "it",
      "linux",
      "management",
      "nist",
      "organizing",
      "planning",
      "project",
      "risk",
      "security",
      "senior",
      "skills",
      "sp",
      "sql",
      "ssdlc",
      "technology",
      "to"
    ]
  },
  {
    "job_id": "3901945176",
    "job_title": "Senior Information Technology Program Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "WE ARE LOOKING FOR A PROGRAM MANAGER FOR A CONTRACT IN PORTLAND, OR - HYBRID. MUST BE LOCAL TO PORTLAND, OR. NO H1BS, DIRECT W2 HIRE ONLY. \nDESCRIPTIONFERC ORDER 898 IMPLEMENTATION. THIS RESOURCE IS NEEDED TO DRIVE THE IMPLEMENTATION OF FERC ORDER 898, WHICH OVERHAULS THE FERC UNIFORM SYSTEM OF ACCOUNTS AND IS ANTICIPATED TO HAVE SIGNIFICANT ENTITY-WIDE IMPACTS. THIS ROLE REQUIRES HEAVY PROJECT MANAGEMENT AND SYSTEM IMPLEMENTATION EXPERIENCE AND AT LEAST SOME BASIC TECHNICAL ACCOUNTING KNOWLEDGE.\nTEAM AND WORK ENVIRONMENTACCOUNTING AND FINANCE SYSTEMS PROJECT IMPLEMENTATION MANAGER. INCLUDES PROJECT MANAGEMENT, TRACKING AND REPORTING, AD HOC ANALYSIS – LEAD SCOPE/DESIGN/IMPLEMENTATION. WILL COVER MULTIPLE DEPARTMENT LEADS (~10). PROJECT IMPACT TO ~1,500 EMPLOYEES.PRIMARILY PROJECT MANAGEMENT, COVERING SEVERAL PROJECT STREAMS AND THEIR INTERACTIONS – INCLUDES MEETINGS ACROSS ACCOUNTING, FINANCE, PROCUREMENT, IT, REGULATORY, COMPLIANCE GROUPS. TRACK PROJECT STATUS AND ISSUES. HIGHLY COLLABORATIVE ENVIRONMENT; HOWEVER, IS EXPECTED TO INDEPENDENTLY PLAN/ALIGN/EXECUTE WITH GUIDANCE FROM MANAGEMENT.\nREQUIRED SKILLSTOP 3 MUST-HAVES (HARD AND/OR SOFT SKILLS):1. PROJECT MANAGEMENT EXPERIENCE AT LARGE ENTITIES2. SYSTEM IMPLEMENTATION EXPERIENCE3. ACCOUNTING EXPOSURE/EXPERIENCE TOP 3 NICE-TO-HAVES (HARD AND/OR SOFT SKILLS)1. ASSET ACCOUNTING EXPERIENCE2. EXPERIENCE AT PUBLIC COMPANIES SUBJECT TO SARBANES-OXLEY (SOX)3. EXPERIENCE IN COMPLEX IT ENVIRONMENTS",
    "job_skill_set": [
      "project management",
      "system implementation",
      "accounting knowledge",
      "asset accounting",
      "sarbanes-oxley compliance",
      "IT environment experience",
      "collaboration",
      "independent planning",
      "communication",
      "problem solving",
      "reporting",
      "ad hoc analysis"
    ],
    "short_keywords": [
      "accounting",
      "ad",
      "analysis",
      "asset",
      "collaboration",
      "communication",
      "compliance",
      "environment",
      "experience",
      "hoc",
      "implementation",
      "independent",
      "information",
      "informationtechnology",
      "it",
      "knowledge",
      "management",
      "manager",
      "planning",
      "problem",
      "program",
      "project",
      "reporting",
      "sarbanesoxley",
      "senior",
      "solving",
      "system",
      "technology"
    ]
  },
  {
    "job_id": "3888944107",
    "job_title": "Information Technology Support Specialist (Active TS/SCI /wPoly)",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOB DESCRIPTION:\n\nTYPE OF REQUISITION:\n\nREGULAR\n\nCLEARANCE LEVEL MUST CURRENTLY POSSESS:\n\nTOP SECRET SCI + POLYGRAPH\n\nCLEARANCE LEVEL MUST BE ABLE TO OBTAIN:\n\nTOP SECRET SCI + POLYGRAPH\n\nSUITABILITY:\n\nPUBLIC TRUST/OTHER REQUIRED:\n\nJOB FAMILY:\n\nHELP DESK\n\nSKILLS:\n\nJOB QUALIFICATIONS:\n\nCOMPUTER REPAIRS, HELP DESK SUPPORT, INFORMATION TECHNOLOGY (IT), REMOTE SUPPORT, TROUBLESHOOTING HARDWARE\n\nCERTIFICATIONS:\n\nNONE - NONE\n\nEXPERIENCE:\n\n3 + YEARS OF RELATED EXPERIENCE\n\nUS CITIZENSHIP REQUIRED:\n\nYES\n\nJOB DESCRIPTION:\n\nTRANSFORM TECHNOLOGY INTO OPPORTUNITY AS AN INFORMATION TECHNOLOGY SUPPORT SPECIALIST WITH GDIT. A CAREER IN ENTERPRISE IT MEANS CONNECTING AND ENHANCING THE SYSTEMS THAT MATTER MOST. AT GDIT YOU’LL BE AT THE FOREFRONT OF INNOVATION AND PLAY A MEANINGFUL PART IN IMPROVING HOW AGENCIES OPERATE.\n\nAT GDIT, PEOPLE ARE OUR DIFFERENTIATOR. AS AN INFORMATION TECHNOLOGY SUPPORT SPECIALIST YOU WILL HELP ENSURE TODAY IS SAFE AND TOMORROW IS SMARTER. OUR WORK DEPENDS ON AN INFORMATION TECHNOLOGY SUPPORT SPECIALIST JOINING OUR TEAM TO PROVIDE TECHNICAL SUPPORT AND TROUBLESHOOTING SERVICES FOR INCOMING QUERIES AND ISSUES RELATED TO COMPUTER SYSTEMS, SOFTWARE, AND HARDWARE. RESPOND TO QUERIES EITHER IN PERSON OR OVER THE PHONE.\n\nHOW AN INFORMATION TECHNOLOGY SUPPORT SPECIALIST WILL MAKE AN IMPACT\n\nPROVIDES TECHNICAL SUPPORT AND TROUBLESHOOTING TO NETWORK, DESKTOP, AND/OR SYSTEMS HARDWARE AND SOFTWAREMAY COACH AND PROVIDE GUIDANCE TO LESS-EXPERIENCED PROFESSIONALSAPPLIES BASIC DIAGNOSTIC TECHNIQUES TO IDENTIFY PROBLEMS, INVESTIGATE CAUSES, AND RECOMMEND SOLUTIONSPROVIDES REMOTE SUPPORT ACCESS THROUGH DESKTOP MIRRORING AND OTHER REMOTE ACCESS APPLICATIONS FOR WORLDWIDE SITESIDENTIFY, INVESTIGATE, RESOLVE, AND FOLLOW-UP PROBLEMS BROUGHT TO THE HELPDESK BY USERS OF CLOUD INFRASTRUCTURE\n\nWHAT YOU’LL NEED TO SUCCEED:\n\nREQUIRED EXPERIENCE: 3+ YEARS OF RELATED EXPERIENCEREQUIRED TECHNICAL SKILLS: INSTALLS, MODIFIES, AND REPAIRS COMPUTER HARDWARE AND SOFTWARE BOTH IN PERSON AND USING REMOTE ACCESS TOOLSREQUIRED: IAT LEVEL 1 CERTIFICATE IS REQUIRED WITHIN 6 MONTHS OF START DATESECURITY CLEARANCE LEVEL: TS/SCI W/POLYREQUIRED SKILLS AND ABILITIES: MAINTAINS CURRENT KNOWLEDGE OF RELEVANT TECHNOLOGY AS ASSIGNEDLOCATION: ON-SITE IN ANNAPOLIS JUNCTION, MDUS CITIZENSHIP REQUIREDSHIFT: MONDAY - FRIDAY 2PM-10PM\n\nGDIT IS YOUR PLACE:\n\n401K WITH COMPANY MATCHCOMPREHENSIVE HEALTH AND WELLNESS PACKAGESINTERNAL MOBILITY TEAM DEDICATED TO HELPING YOU OWN YOUR CAREERPROFESSIONAL GROWTH OPPORTUNITIES INCLUDING PAID EDUCATION AND CERTIFICATIONSCUTTING-EDGE TECHNOLOGY YOU CAN LEARN FROM\n\n#GREENWAY\n\n#ITPOLYMD\n\n#GDPOLY\n\nSCHEDULED WEEKLY HOURS:\n\n40\n\nTRAVEL REQUIRED:\n\nLESS THAN 10%\n\nTELECOMMUTING OPTIONS:\n\nONSITE\n\nWORK LOCATION:\n\nUSA MD ANNAPOLIS JUNCTION\n\nADDITIONAL WORK LOCATIONS:\n\nWE ARE GDIT. A GLOBAL TECHNOLOGY AND PROFESSIONAL SERVICES COMPANY THAT DELIVERS CONSULTING, TECHNOLOGY AND MISSION SERVICES TO EVERY MAJOR AGENCY ACROSS THE U.S. GOVERNMENT, DEFENSE AND INTELLIGENCE COMMUNITY. OUR 30,000 EXPERTS EXTRACT THE POWER OF TECHNOLOGY TO CREATE IMMEDIATE VALUE AND DELIVER SOLUTIONS AT THE EDGE OF INNOVATION. WE OPERATE ACROSS 30 COUNTRIES WORLDWIDE, OFFERING LEADING CAPABILITIES IN DIGITAL MODERNIZATION, AI/ML, CLOUD, CYBER AND APPLICATION DEVELOPMENT. TOGETHER WITH OUR CLIENTS, WE STRIVE TO CREATE A SAFER, SMARTER WORLD BY HARNESSING THE POWER OF DEEP EXPERTISE AND ADVANCED TECHNOLOGY.\n\nWE CONNECT PEOPLE WITH THE MOST IMPACTFUL CLIENT MISSIONS, CREATING AN UNPARALLELED WORK EXPERIENCE THAT ALLOWS THEM TO SEE THEIR IMPACT EVERY DAY. WE CREATE OPPORTUNITIES FOR OUR PEOPLE TO LEAD AND LEARN SIMULTANEOUSLY. FROM SECURING OUR NATION’S MOST SENSITIVE SYSTEMS, TO ENABLING DIGITAL TRANSFORMATION AND CLOUD ADOPTION, OUR PEOPLE ARE THE ONES WHO MAKE CHANGE REAL.\n\nGDIT IS AN EQUAL OPPORTUNITY/AFFIRMATIVE ACTION EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, OR VETERAN STATUS, OR ANY OTHER PROTECTED CLASS.",
    "job_skill_set": [
      "help desk support",
      "information technology (IT)",
      "troubleshooting software",
      "communication",
      "problem solving",
      "coaching",
      "guidance",
      "teamwork",
      "adaptability",
      "computer repairs",
      "remote support",
      "troubleshooting hardware",
      "desktop mirroring",
      "cloud infrastructure",
      "installing computer hardware",
      "modifying computer hardware",
      "repairing computer software",
      "investigation",
      "follow-up"
    ],
    "short_keywords": [
      "active",
      "adaptability",
      "cloud",
      "coaching",
      "communication",
      "computer",
      "desk",
      "desktop",
      "followup",
      "guidance",
      "hardware",
      "help",
      "information",
      "informationtechnology",
      "infrastructure",
      "installing",
      "investigation",
      "it",
      "mirroring",
      "modifying",
      "problem",
      "remote",
      "repairing",
      "repairs",
      "software",
      "solving",
      "specialist",
      "support",
      "teamwork",
      "technology",
      "troubleshooting",
      "tssci",
      "wpoly"
    ]
  },
  {
    "job_id": "3885389087",
    "job_title": "Information Technology Business Partner",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "TECHNOLOGY BUSINESS PARTNERSTATUS: FULL-TIMELOCATION: WASHINGTON - SEATTLE, TACOMA GREATER AREA (HYBRID)COMPENSATION: $95,000.00 - $115,000.00 EMPLOYEE PERKS:TUITION ASSISTANCEMENTORSHIP OPPORTUNITIESEMPLOYEE ASSISTANCE PROGRAM FEATURING FREE COUNSELING SERVICES, FINANCIAL COACHING, LEGAL SERVICES, AND MORE.GENEROUS EMPLOYEE REFERRAL PROGRAMPAID TIME OFF/SICK LEAVE (ROLLS OVER ANNUALLY)401K RETIREMENT PLAN WITH EMPLOYER CONTRIBUTIONSCOMPREHENSIVE BENEFITS PACKAGE WITH MEDICAL COVERAGE, VOLUNTARY DENTAL, VISION, AND LIFE INSURANCE, SHORT-TERM DISABILITY, AND AD&D COVERAGE AVAMERE UNDERSTANDS THE IMPORTANCE OF AFFORDABLE AND ACCESSIBLE HEALTHCARE FOR OUR TEAM MEMBERS AND IS VERY EXCITED TO PARTNER WITH SEIU 503 AND THE ESSENTIAL WORKER HEALTHCARE TRUST TO OFFER AN EXCELLENT HEALTH INSURANCE BENEFIT PLAN AT A SIGNIFICANTLY REDUCED COST TO THE EMPLOYEE. STARTING IN 2023, OUR FULL-TIME OREGON TEAM MEMBERS WILL BE ABLE TO PARTICIPATE IN A PPO OR HMO PLAN WITH DEDUCTIBLES AS LOW AS $800.00 WITH SIGNIFICANTLY REDUCED PREMIUM COSTS. EMPLOYEES WILL BE ELIGIBLE TO START USING THEIR BENEFITS WITHIN THEIR FIRST MONTH OF HIRE – NO 60+ DAY WAITING PERIOD! VISION, DENTAL, STD, LTD, AD&D, AND OTHER BENEFITS ARE AVAILABLE FOR ENROLLMENT AS WELL. JOB SUMMARYTHE TECHNOLOGY BUSINESS PARTNER (TBP) WILL PLAY A KEY ROLE IN ALIGNING TECHNOLOGY STRATEGIES AND INITIATIVES WITH BUSINESS OBJECTIVES. REPORTING DIRECTLY TO THE CIO, THIS ROLE REQUIRES A CRITICAL THINKER WHO CAN EFFECTIVELY PARTNER WITH REGIONAL LEADERS AND ADMINISTRATORS TO DRIVE ORGANIZATIONAL PERFORMANCE THROUGH THE EFFECTIVE DEPLOYMENT OF TECHNOLOGY. THE TECHNOLOGY BUSINESS PARTNER IS ALSO A KEY PLAYER IN THE SPECIFICATION AND EFFECTIVE USE OF OUR ENTERPRISE APPLICATIONS. THIS POSITION IS SUPPORTING OUR WA REGION FACILITIES. WE HAVE LOCATIONS IN TACOMA, ISSAQUAH, BELLINGHAM, BURIEN, SEATTLE, SEQUIM, SHORELINE AND PORT ORCHARD, ESSENTIAL DUTIES AND JOB RESPONSIBILITIESBRING THE ‘VOICE OF THE CUSTOMER’ BACK TO THE ENTERPRISE TECHNOLOGY GROUP BY SPENDING TIME AT EACH FACILITY ON A REGULAR BASIS AND MEETING FACE-TO-FACE WITH REGIONAL LEADERS. THROUGH THIS PROCESS, THE TBP UNDERSTANDS BUSINESS NEEDS AND TRANSLATES THOSE INTO TECHNOLOGY REQUIREMENTS. IT IS EXPECTED THAT THE TBP BUILDS STRONG RELATIONSHIPS WITH ALL LEADERS IN THEIR REGIONS.TO BE AN EFFECTIVE LIAISON, THE TBP WILL NEED TO LEARN THE SKILLED NURSING FACILITY SYSTEMS AND PROCESSES AT A DEEP LEVEL. THIS WILL REQUIRE SPENDING TIME AT THE FACILITY, TALKING TO STAFF MEMBERS, AND SHADOWING THEM TO UNDERSTAND WHERE THEY HIT ROADBLOCKS THAT TECHNOLOGY COULD ADDRESS.BE A SUBJECT MATTER EXPERT IN KEY COMPONENTS OF THE ORGANIZATION’S ENTERPRISE ARCHITECTURE. THE TBP UNDERSTANDS KEY BUSINESS APPLICATIONS (ELECTRONIC MEDICAL RECORD SYSTEMS, FINANCIAL SYSTEMS, HR SYSTEMS, CORPORATE PRODUCTIVITY SYSTEMS ASSOCIATED WITH OUR MICROSOFT SUITE OF TOOLS, ANALYTIC SYSTEMS, ETC.). WHILE A GIVEN TBP MAY NOT HAVE DEEP EXPERTISE IN ALL THOSE SYSTEMS, IT IS EXPECTED THAT BETWEEN THE TWO TBPS, THERE IS STRONG COVERAGE OF EXPERTISE ACROSS THE ORGANIZATION’S BUSINESS APPLICATIONS.BE AN ESCALATION POINT FOR ISSUES THE BUSINESS IS HAVING THAT ARE NOT BEING SATISFACTORILY RESOLVED VIA THE TICKETING SYSTEM.WORKING WITH THE REST OF THE TECHNOLOGY GROUP ORCHESTRATE AS WELL AS PROVIDE DIRECT EFFORT TOWARDS APPLICATION-RELATED TASKS: SELECTION, OPTIMIZATION, CROSS-APPLICATION INTERFACE, BUSINESS ANALYTICS, TRAINING, ETC.SUPPORT OTHER TECHNOLOGY GROUP COMMITTEES RELEVANT TO THE DELIVERY OF TECHNOLOGY SERVICES (E.G., SECURITY COUNCIL, PROJECT TEAMS, RECOMMENDS NEW APPROACHES, POLICIES, AND PROCEDURES TO CONTINUALLY IMPROVE THE EFFICIENCY OF THE TECHNOLOGY GROUP AND SERVICES PERFORMED; SUPPORTS THE TECHNOLOGY GROUP IN IMPLEMENTING PROGRAMS TO HELP IMPROVE THE EMPLOYEE EXPERIENCE. STAY CURRENT ON TECHNOLOGY TRENDS TO ENHANCE ORGANIZATIONAL EFFECTIVENESS.OTHER FUNCTIONS:SUPPORT THE CIO IN OTHER ACTIVITIES AS NEEDED. SUCCESSFUL INCUMBENT EMPLOYEES MUST BE ABLE TO PERFORM THE ESSENTIAL DUTIES OF THE POSITION TO THE SATISFACTION OF THE ORGANIZATION, WITH OR WITHOUT A REASONABLE ACCOMMODATION. REQUIREMENTS AND QUALIFICATIONSMINIMUM QUALIFICATIONSA BACHELOR'S DEGREE IN A TECHNOLOGY OR RELATED FIELD; FIVE (5) YEARS OF EXPERIENCE IN AN ENTERPRISE TECHNOLOGY GROUP; AND AN EQUIVALENT COMBINATION OF EDUCATION AND EXPERIENCE MAY BE CONSIDERED.STRONG TEAM PLAYER WITH EXCELLENT COMMUNICATION AND COLLABORATION SKILLS WHILE ALSO BEING ABLE TO LEAD A WORKING GROUP.EXPERIENCE WORKING WITH END USERS COLLECTING REQUIREMENTS AND COMMUNICATING BEST PRACTICES.STRONG CUSTOMER ORIENTATIONSTRONG IT TECHNOLOGY BACKGROUND.GOOD DATA ANALYSIS SKILLS (EXCEL-BASED)EXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLSSELF-MOTIVATED AND SELF-DIRECTED.STRONG ORGANIZATION SKILLS, DETAIL-ORIENTED, AND EXCELLENT FOLLOW-THROUGH SKILLS.PREFERRED QUALIFICATIONSAPPLICATION CERTIFICATIONS RELEVANT TO THE ROLE. MICROSOFT CERTIFICATIONS ARE PARTICULARLY VALUABLE.PREVIOUS EXPERIENCE IN A HEALTHCARE ENVIRONMENT (OR EXPERIENCE IN AN ORGANIZATION WHERE FRONT-LINE WORKERS ARE A SIGNIFICANT SHARE OF THE OVERALL EMPLOYEE BASE).EXPERIENCE WORKING AS A CONSULTANT.MULTIPLE YEARS OF EXPERIENCE ARCHITECTING MICROSOFT COLLABORATION (TEAMS, EXCHANGE), CONTENT MANAGEMENT (SHAREPOINT, ONEDRIVE, ONENOTE), AND PRODUCTIVITY (WORD, EXCEL, POWERPOINT) SOLUTIONS EXPERIENCE SELECTING AND WORKING WITH SOLUTIONS VENDORS.GOOD UNDERSTANDING OF MICROSOFT LICENSE TIERING AND BUNDLES (E.G., KNOW THE DIFFERENCE BETWEEN O365E3 VS. O365F3 VS. M365E3).REASONABLE UNDERSTANDING OF MICROSOFT EMS (ENTERPRISE MOBILITY AND SECURITY) PRODUCTS GOOD UNDERSTANDING OF COMMON INFRASTRUCTURE COMPONENTS: ACTIVE DIRECTORY, DNS, DHCP, NETWORKING CONCEPTS, MAIL ROUTING, EXCHANGE SERVER, AND WINDOWS 10 MANAGEMENTAVAMERE SKILLED ADVISORS, LLC IS AN EQUAL OPPORTUNITY EMPLOYER AND PARTICIPATES IN E-VERIFY.",
    "job_skill_set": [
      "enterprise technology",
      "data analysis",
      "Microsoft Suite",
      "application selection",
      "healthcare technology",
      "networking concepts",
      "communication",
      "collaboration",
      "customer orientation",
      "problem solving",
      "self-motivation",
      "organization",
      "leadership",
      "relationship building",
      "Microsoft certifications",
      "Active Directory",
      "Exchange Server",
      "Windows 10 management"
    ],
    "short_keywords": [
      "10",
      "active",
      "analysis",
      "application",
      "building",
      "business",
      "certifications",
      "collaboration",
      "communication",
      "concepts",
      "customer",
      "data",
      "directory",
      "enterprise",
      "exchange",
      "healthcare",
      "information",
      "informationtechnology",
      "leadership",
      "management",
      "microsoft",
      "networking",
      "organization",
      "orientation",
      "partner",
      "problem",
      "relationship",
      "selection",
      "selfmotivation",
      "server",
      "solving",
      "suite",
      "technology",
      "windows"
    ]
  }
]