[
  {
    "job_id": "3886896748",
    "job_title": "Human Resources Business Partner",
    "category": "HR",
    "job_description": "ALLIED STONE IS LOOKING FOR A HUMAN RESOURCES BUSINESS PARTNER. \nLOCATION: THIS IS AN ON-SITE POSITION REQUIRING THE EMPLOYEE TO WORK ON-SITE AT THEIR DESIGNATED OFFICE LOCATION IN DALLAS, TX MONDAY - FRIDAY.\nWE ARE LOOKING FOR.....A CORPORATE HUMAN RESOURCES BUSINESS PARTNER (HRBP) WITH EXPERTISE IN HR PROJECT MANAGEMENT. YOU WILL PLAY A CRITICAL ROLE IN ALIGNING HR INITIATIVES WITH ORGANIZATIONAL GOALS AND OBJECTIVES. REPORTING TO THE SENIOR VICE PRESIDENT OF HUMAN RESOURCES, YOU WILL COLLABORATE CLOSELY WITH BUSINESS LEADERS AND HR STAKEHOLDERS TO DRIVE STRATEGIC HR PROJECTS AND INITIATIVES FORWARD.YOU WILL BE RESPONSIBLE FOR.......1. HR PROJECT MANAGEMENT: - LEAD AND MANAGE HR PROJECTS FROM INITIATION TO COMPLETION, ENSURING TIMELY DELIVERY AND ADHERENCE TO PROJECT OBJECTIVES. - DEVELOP PROJECT PLANS, TIMELINES, AND RESOURCES ALLOCATION STRATEGIES TO EFFECTIVELY EXECUTE HR INITIATIVES. - MONITOR PROJECT PROGRESS, IDENTIFY POTENTIAL RISKS, AND IMPLEMENT MITIGATION STRATEGIES TO ACHIEVE PROJECT SUCCESS. - COLLABORATE WITH CROSS-FUNCTIONAL TEAMS AND STAKEHOLDERS TO ENSURE ALIGNMENT AND INTEGRATION OF HR PROJECTS WITH ORGANIZATIONAL PRIORITIES.2. STRATEGIC HR PARTNERSHIP: - SERVE AS A TRUSTED ADVISOR TO THE SVP-HR, BUSINESS LEADERS, AND OTHER MEMBERS OF LEADERSHIP TEAM PROVIDING STRATEGIC HR GUIDANCE AND SUPPORT TO DRIVE BUSINESS PERFORMANCE. - PARTNER WITH KEY STAKEHOLDERS TO UNDERSTAND BUSINESS NEEDS AND DEVELOP HR SOLUTIONS THAT SUPPORT ORGANIZATIONAL OBJECTIVES. - ACTIVELY PARTICIPATE IN BUSINESS PLANNING SESSIONS, OFFERING INSIGHTS AND RECOMMENDATIONS ON HR STRATEGIES AND INITIATIVES. 3. EMPLOYEE RELATIONS: - PROVIDE GUIDANCE AND SUPPORT ON EMPLOYEE RELATIONS MATTERS, INCLUDING PERFORMANCE MANAGEMENT, DISCIPLINARY ACTIONS, AND CONFLICT RESOLUTIONS. - CONDUCT INVESTIGATIONS INTO EMPLOYEE COMPLAINTS OR CONCERNS, ENSURING FAIR AND EQUITABLE RESOLUTION IN COMPLIANCE WITH COMPANY POLICIES AND APPLICABLE LAWS.4. TALENT MANAGEMENT AND DEVELOPMENT: - SUPPORT TALENT MANAGEMENT INITIATIVES, INCLUDING WORKFORCE PLANNING, SUCCESSION PLANNING, AND EMPLOYEE DEVELOPMENT PROGRAMS. - PARTNER WITH MANAGERS TO IDENTIFY TALENT GAPS AND DEVELOP STRATEGIES TO ATTRACT, RETAIN, AND DEVELOP TOP TALENT WITHIN THE ORGANIZATION.5. COMPLIANCE AND POLICY DEVELOPMENT: - STAY INFORMED OF FEDERAL, STATE, AND LOCAL EMPLOYMENT LAWS AND REGULATIONS, ENSURING COMPLIANCE WITH ALL RELEVANT LEGISLATION. - DEVELOP AND IMPLEMENT HR POLICIES AND PROCEDURES TO PROMOTE A POSITIVE AND COMPLIANT WORK ENVIRONMENT.6. OTHERS: - ASSISTING WITH TALENT ACQUISITION AND TOTAL REWARDS AS NEEDED.YOU NEED TO HAVE.....BACHELOR'S DEGREE IN HUMAN RESOURCES, BUSINESS ADMINISTRATION, OR RELATED FIELD; MASTER'S DEGREE PREFERRED.MINIMUM OF SEVEN YEARS OF EXPERIENCE AS AN HR BUSINESS PARTNER OR HR GENERALIST, WITH SOME FOCUS ON HR PROJECT MANAGEMENT.PROVEN TRACK RECORD OF SUCCESSFULLY LEADING AND MANAGING HR PROJECTS FROM CONCEPTION TO IMPLEMENTATION.STRONG UNDERSTANDING OF HR BEST PRACTICES, EMPLOYMENT LAWS, AND REGULATIONS.EXCELLENT COMMUNICATION, INTERPERSONAL, AND RELATIONSHIP-BUILDING SKILLS.ABILITY TO INFLUENCE AND COLLABORATE WITH STAKEHOLDERS AT ALL LEVELS OF THE ORGANIZATION.SHRM-CP OR SHRM-SCP CERTIFICATION PREFERRED.\nALLIED STONE IS COMMITTED TO PROVIDING EQUAL EMPLOYMENT OPPORTUNITIES FOR ALL INDIVIDUALS WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, VETERAN STATUS, OR ANY OTHER CHARACTERISTIC PROTECTED BY APPLICABLE LAW. WE EMBRACE DIVERSITY AND ENCOURAGE A WORK ENVIRONMENT WHERE DIFFERENCES ARE RESPECTED AND VALUED.",
    "job_skill_set": [
      "Communication",
      "Interpersonal Skills",
      "Relationship Building",
      "Collaboration",
      "Strategic Thinking",
      "Problem Solving",
      "HR Project Management",
      "Employee Relations",
      "Talent Management",
      "Compliance",
      "Policy Development",
      "Workforce Planning",
      "Employment Laws",
      "SHRM-CP Certification",
      "SHRM-SCP Certification",
      "Influencing"
    ],
    "short_keywords": [
      "building",
      "business",
      "certification",
      "collaboration",
      "communication",
      "compliance",
      "development",
      "employee",
      "employment",
      "hr",
      "human",
      "influencing",
      "interpersonal",
      "laws",
      "management",
      "partner",
      "planning",
      "policy",
      "problem",
      "project",
      "relations",
      "relationship",
      "resources",
      "shrmcp",
      "shrmscp",
      "skills",
      "solving",
      "strategic",
      "talent",
      "thinking",
      "workforce"
    ]
  },
  {
    "job_id": "3904923211",
    "job_title": "Human Resources and General Affairs Manager",
    "category": "HR",
    "job_description": "POSITION SUMMARY: THE HUMAN RESOURCE AND GENERAL AFFAIRS MANAGER WILL LEAD AND DIRECT THE FUNCTIONS OF THE HUMAN RESOURCE AND GENERAL AFFAIRS DEPARTMENT INCLUDING HIRING, RETENTION, COMPENSATION, BENEFITS, EMPLOYEE LEAVE, AND IMPLEMENTING AND ENFORCING COMPANY POLICIES AND PROCEDURES.\nROLE QUALIFICATIONS:\nDEGREE OR EQUIVALENT IN HUMAN RESOURCES, OR RELATED FIELD.IN HUMAN RESOURCES CERTIFICATION PREFERRED.MINIMUM OF THREE TO FIVE YEARS OF HUMAN RESOURCE MANAGEMENT EXPERIENCE PREFERRED.OR SHRM-CP HIGHLY DESIRED.\nPOSITION RESPONSIBILITIES:\nDEVELOPMENT OF THE HUMAN RESOURCE DEPARTMENTOVERSEES THE IMPLEMENTATION OF HUMAN RESOURCE PROGRAMS THROUGH THE HUMAN RESOURCE STAFF. IDENTIFIES OPPORTUNITIES FOR IMPROVEMENT AND RESOLVES PROBLEMS.OVERSEES AND MANAGES THE WORK OF THE HUMAN RESOURCE STAFF. ENCOURAGES THE ONGOING DEVELOPMENT OF THE HUMAN RESOURCE STAFF.PROVIDES LEADERSHIP FOR HUMAN RESOURCE STRATEGIC PLANNING. ESTABLISHES HR DEPARTMENTAL MEASUREMENTS THAT SUPPORT THE ACCOMPLISHMENT OF THE COMPANY'S STRATEGIC GOALS.MANAGES THE PREPARATION AND MAINTENANCE OF REPORTS AS ARE NECESSARY TO CARRY OUT THE FUNCTIONS OF THE DEPARTMENT. PREPARES PERIODIC REPORTS FOR MANAGEMENT, AS NECESSARY OR REQUESTED, TO TRACK STRATEGIC GOAL ACCOMPLISHMENT.DEVELOPS AND ADMINISTERS PROGRAMS, PROCEDURES, AND GUIDELINES TO HELP ALIGN THE WORKFORCE WITH THE STRATEGIC GOALS OF THE COMPANY.PARTICIPATES IN EXECUTIVE, MANAGEMENT, AND COMPANY STAFF MEETINGS AND ATTENDS OTHER MEETINGS AND SEMINARS.PLANS AND OVERSEES THE COMPANY'S PHILANTHROPIC AND CHARITABLE GIVING.\nTRAINING AND DEVELOPMENTLEADS THE IMPLEMENTATION OF THE PERFORMANCE MANAGEMENT SYSTEM THAT INCLUDES PERFORMANCE DEVELOPMENT PLANS (PDPS) AND EMPLOYEE DEVELOPMENT PROGRAMS.ESTABLISHES AN IN-HOUSE EMPLOYEE TRAINING SYSTEM THAT ADDRESSES COMPANY TRAINING NEEDS INCLUDING TRAINING NEEDS ASSESSMENT, NEW EMPLOYEE ONBOARDING AND/OR ORIENTATION, MANAGEMENT DEVELOPMENT, PRODUCTION CROSS-TRAINING, AND THE MEASUREMENT OF TRAINING IMPACT.ASSISTS MANAGERS WITH THE SELECTION AND CONTRACTING OF EXTERNAL TRAINING PROGRAMS AND CONSULTANTS.\nEMPLOYMENTESTABLISHES AND LEADS THE STANDARD RECRUITING AND HIRING PRACTICES AND PROCEDURES NECESSARY TO RECRUIT AND HIRE A SUPERIOR WORKFORCE.RECRUIT FOR NEW EMPLOYEES USING VARIOUS RECRUITING EFFORTS, INTERVIEW JOB APPLICANTS AND COORDINATE HIRING OF CANDIDATES.\nEMPLOYEE RELATIONSDESIGNS AND IMPLEMENTS HUMAN RESOURCE POLICIES AND PROCEDURES FOR THE COMPANY.DETERMINES AND RECOMMENDS EMPLOYEE RELATIONS PRACTICES NECESSARY TO ESTABLISH A POSITIVE EMPLOYER-EMPLOYEE RELATIONSHIP AND PROMOTE A HIGH LEVEL OF EMPLOYEE MORALE AND MOTIVATION. CONDUCTS INVESTIGATIONS RELATED TO EMPLOYEE COMPLAINTS.MONITORS AND ADVISES MANAGERS AND SUPERVISORS IN THE PROGRESSIVE DISCIPLINE SYSTEM OF THE COMPANY. MONITORS THE IMPLEMENTATION OF A PERFORMANCE IMPROVEMENT PROCESS WITH NON-PERFORMING EMPLOYEES.REVIEWS, GUIDES, AND APPROVES MANAGEMENT RECOMMENDATIONS FOR EMPLOYMENT TERMINATIONS.SUPERVISES THE IMPLEMENTATION OF COMPANY SAFETY AND HEALTH PROGRAMS. MONITORS THE TRACKING OF OSHA-REQUIRED DATA. \nCOMPENSATIONESTABLISHES THE COMPANY WAGE AND SALARY STRUCTURE, PAY POLICIES, AND OVERSEES THE COMPENSATION SYSTEMS WITHIN THE COMPANY INCLUDING BONUSES AND RAISES.LEADS COMPETITIVE MARKET RESEARCH TO ESTABLISH PAY PRACTICES AND PAY BANDS THAT HELP TO RECRUIT AND RETAIN SUPERIOR STAFF.MONITORS BEST PRACTICES IN COMPENSATION AND BENEFITS THROUGH RESEARCH AND UP-TO-DATE INFORMATION ON AVAILABLE PRODUCTS.\nBENEFITSLEADS THE DEVELOPMENT OF BENEFITS AND OTHER BENEFITS TRAINING FOR EMPLOYEES.RECOMMENDS CHANGES IN BENEFITS OFFERED, ESPECIALLY NEW BENEFITS AIMED AT EMPLOYEE SATISFACTION AND RETENTION.\nLAWLEADS COMPANY COMPLIANCE WITH ALL EXISTING GOVERNMENTAL AND LABOR LEGAL AND GOVERNMENT REPORTING REQUIREMENTS INCLUDING ANY RELATED TO THE EQUAL EMPLOYMENT OPPORTUNITY (EEO), THE AMERICANS WITH DISABILITIES ACT (ADA), THE FAMILY AND MEDICAL LEAVE ACT (FMLA), EMPLOYEE RETIREMENT INCOME SECURITY ACT (ERISA), THE DEPARTMENT OF LABOR, WORKERS COMPENSATION, THE OCCUPATIONAL SAFETY AND HEALTH ADMINISTRATION (OSHA), AND OTHER REGULATORY AGENCIES. INSULATE THE COMPANY FROM EXPOSURE TO LAWSUITS.DIRECTS THE PREPARATION OF INFORMATION REQUESTED OR REQUIRED FOR COMPLIANCE WITH LAWS. APPROVES ALL INFORMATION SUBMITTED. SERVES AS THE PRIMARY CONTACT WITH THE COMPANY EMPLOYMENT LAW ATTORNEY AND OUTSIDE GOVERNMENT AGENCIES.PROTECTS THE INTERESTS OF EMPLOYEES AND THE COMPANY IN ACCORDANCE WITH COMPANY HUMAN RESOURCE POLICIES AND GOVERNMENTAL LAWS AND REGULATIONS. MINIMIZES RISK.\nORGANIZATION DEVELOPMENTDESIGNS, DIRECTS, AND MANAGES A COMPANY-WIDE PROCESS OF ORGANIZATION DEVELOPMENT THAT ADDRESSES ISSUES SUCH AS SUCCESSION PLANNING, SUPERIOR WORKFORCE DEVELOPMENT, KEY EMPLOYEE RETENTION, ORGANIZATION DESIGN, AND CHANGE MANAGEMENT.MANAGES EMPLOYEE COMMUNICATION AND FEEDBACK THROUGH SUCH AVENUES AS COMPANY MEETINGS, SUGGESTION PROGRAMS, EMPLOYEE SATISFACTION SURVEYS, AND ONE-ON-ONE MEETINGS.MANAGES A PROCESS OF ORGANIZATIONAL PLANNING THAT EVALUATES COMPANY STRUCTURE, JOB DESIGN, AND PERSONNEL FORECASTING THROUGHOUT THE COMPANY. EVALUATES PLANS AND MAKE CHANGES TO PLANS. MAKES RECOMMENDATIONS TO EXECUTIVE MANAGEMENT.IDENTIFIES AND MONITORS THE ORGANIZATION'S CULTURE SO THAT IT SUPPORTS THE ATTAINMENT OF THE COMPANY'S GOALS AND PROMOTES EMPLOYEE SATISFACTION.PARTICIPATES IN A PROCESS OF ORGANIZATION DEVELOPMENT THAT PLANS, COMMUNICATES, AND INTEGRATES THE RESULTS OF STRATEGIC PLANNING THROUGHOUT THE ORGANIZATION.KEEPS THE CEO AND THE EXECUTIVE TEAM INFORMED OF SIGNIFICANT PROBLEMS THAT JEOPARDIZE THE ACHIEVEMENT OF COMPANY GOALS, AND THOSE THAT ARE NOT BEING ADDRESSED ADEQUATELY AT THE LINE MANAGEMENT LEVEL. ASSUMES OTHER RESPONSIBILITIES AS ASSIGNED BY THE CEO AND/OR CFO.\nREQUIRED SKILLS/ABILITIES: EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS.EXCELLENT INTERPERSONAL, NEGOTIATION, AND CONFLICT RESOLUTION SKILLS.EXCELLENT ORGANIZATIONAL SKILLS AND ATTENTION TO DETAIL.STRONG ANALYTICAL AND PROBLEM SOLVING SKILLS.ABILITY TO PRIORITIZE TASKS AND TO DELEGATE TASKS WHEN APPROPRIATE.ABILITY TO ACT WITH INTEGRITY, PROFESSIONALISM, AND CONFIDENTIALITY.THOROUGH KNOWLEDGE OF EMPLOYMENT-RELATED LAWS AND REGULATIONS.PROFICIENT WITH MICROSOFT OFFICE SUITE OR RELATED SOFTWARE.PROFICIENCY WITH OR THE ABILITY TO QUICKLY LEARN THE ORGANIZATIONS HRIS AND TALENT MANAGEMENT SYSTEMS.\n\nREPORTING TO THIS POSITION: ASSISTANT HR/GA MANAGER, HR/GENERAL AFFAIRS SPECIALIST, GENERAL AFFAIRS SPECIALIST, SAFETY SPECIALIST, ADMINISTRATIVE ASSISTANT/RECEPTIONIST, AND JANITORIAL STAFF.\nPHYSICAL DEMANDS AND WORK ENVIRONMENT: THE PHYSICAL DEMANDS AND WORK ENVIRONMENT CHARACTERISTICS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY A TEAM MEMBER TO SUCCESSFULLY PERFORM THE ESSENTIAL FUNCTIONS OF THIS JOB. REASONABLE ACCOMMODATION MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS.\nDEMANDS:PROLONGED PERIODS OF SITTING AT A DESK AND WORKING ON A COMPUTER. MUST BE ABLE TO LIFT UP TO 15 LBS. AT A TIME. MUST BE ABLE TO ACCESS AND NAVIGATE EACH DEPARTMENT OF THE COMPANY FACILITIES.\nENVIRONMENT: WHILE PERFORMING THE DUTIES OF THIS JOB, THE EMPLOYEE IS OCCASIONALLY EXPOSED TO MOVING MECHANICAL PARTS AND VEHICLES. THE NOISE LEVEL IN THE WORK ENVIRONMENT IS USUALLY QUIET TO MODERATE.",
    "job_skill_set": [
      "Human Resources Management",
      "Employee Relations",
      "Compensation and Benefits Administration",
      "Performance Management Systems",
      "Recruiting and Hiring Practices",
      "Employment Law Compliance",
      "HRIS and Talent Management Systems",
      "Microsoft Office Suite",
      "Organizational Development",
      "Analytical Skills",
      "Communication Skills",
      "Interpersonal Skills",
      "Negotiation Skills",
      "Conflict Resolution Skills",
      "Organizational Skills",
      "Problem Solving",
      "Integrity and Professionalism",
      "Attention to Detail",
      "Prioritization and Delegation",
      "Leadership"
    ],
    "short_keywords": [
      "administration",
      "affairs",
      "analytical",
      "and",
      "attention",
      "benefits",
      "communication",
      "compensation",
      "compliance",
      "conflict",
      "delegation",
      "detail",
      "development",
      "employee",
      "employment",
      "general",
      "hiring",
      "hr",
      "hris",
      "human",
      "integrity",
      "interpersonal",
      "law",
      "leadership",
      "management",
      "manager",
      "microsoft",
      "negotiation",
      "office",
      "organizational",
      "performance",
      "practices",
      "prioritization",
      "problem",
      "professionalism",
      "recruiting",
      "relations",
      "resolution",
      "resources",
      "skills",
      "solving",
      "suite",
      "systems",
      "talent",
      "to"
    ]
  },
  {
    "job_id": "3895849293",
    "job_title": "Human Resources Director",
    "category": "HR",
    "job_description": "OVERVIEW OF CLIENTOUR CLIENT, LOCATED IN DOWNTOWN CHICAGO, IS A MULTI-STATE NON-PROFIT THAT HELPS CHILDREN AND FAMILIES SEE AND CREATE A FUTURE WHERE, REGARDLESS OF THEIR PAST, THEY CAN REACH THEIR FULL POTENTIAL. THEY SERVE OVER 10,000 CHILDREN AND FAMILIES EACH YEAR THROUGH EDUCATION CENTERS, CHILD AND FAMILY SERVICES, BEHAVIORAL HEALTH RESOURCES, AND RESIDENTIAL PROGRAMS TO EMPOWER CHILDREN AND FAMILIES.\nTHIS IS A HYBRID ROLE, WORKING 3 TO 4 DAYS IN THE OFFICE.\nTHE COMPENSATION FOR THIS POSITION IS A BASE SALARY OF $120,000 ANNUALLY. THERE IS CURRENTLY NO BONUS OFFERING.\nJOB SUMMARY REPORTING DIRECTLY TO THE CHIEF PEOPLE OFFICER (CPO), THE HUMAN RESOURCES DIRECTOR WILL MANAGE AN HR TEAM COMPRISED OF HR BUSINESS PARTNERS, IN ADDITION TO OVERSEEING EMPLOYEE RELATIONS, DEI WORK ACROSS THE ORGANIZATION, EMPLOYEE BENEFITS, LEAVE OF ABSENCES, HR REPORTING AND ANALYTICS, REWARDS AND RECOGNITION, PERFORMANCE MANAGEMENT AND DEVELOPMENT PLANNING, COMPENSATION, BENEFITS, HRIS, PAYROLL, HR COMPLIANCE, POLICY DEVELOPMENT AND ADMINISTRATION, AND COORDINATION AND COMPLIANCE OF ALL EMPLOYMENT FILES. THIS ROLE IS CENTRAL TO CREATING A DIVERSE, RESPECTFUL, ENGAGING, AND INCLUSIVE WORK ENVIRONMENT FOR AN ORGANIZATION OF 800+ EMPLOYEES.\nTHE IDEAL CANDIDATE WILL HAVE:BACHELOR’S DEGREE IN HUMAN RESOURCES, BUSINESS ADMINISTRATION, ORGANIZATIONAL DEVELOPMENT, OR RELATED FIELD REQUIRED.MASTER’S DEGREE OR A RELATED ADVANCED DEGREE PREFERRED.RECENT NONPROFIT EXPERIENCE AS A HUMAN RESOURCES LEADER.ABILITY TO TRAVEL THROUGHOUT THE STATES OF ILLINOIS AND FLORIDA UP TO 30% OF THE TIME.A STRONG REPUTATION FOR BEING INNOVATING, KNOWN FOR HAVING IMPRESSIVE RELATIONSHIP MANAGEMENT SKILLS, AS WELL AS BEING CONSISTENTLY RECOGNIZED AS A TRUSTED ADVISOR AND APPROACHABLE RESOURCE.MINIMUM OF 5 YEARS OF EXPERIENCE MANAGING, COACHING, AND DEVELOPING A TEAM OF HUMAN RESOURCES PROFESSIONALS THAT INCLUDE HUMAN RESOURCES GENERALISTS AND/OR HR BUSINESS PARTNERS, PREFERABLY FIELD-BASED.DEEP EMPLOYEE RELATIONS EXPERIENCE AND EXPERTISE.DEMONSTRATED EXPERIENCE UNDERSTANDING KEY ATTRITION DRIVERS AND CREATING AND INTRODUCING IMPACTFUL AND REALISTIC WORKFORCE RETENTION STRATEGIES, SPECIFICALLY ACROSS A HIGHLY DISTRIBUTED, ENTRY-LEVEL WORKFORCE.DEEP EXPERIENCE AND WORKING EXPERTISE IN MANAGING WORKERS' COMPENSATION AND LEAVE OF ABSENCE CASES.ADVANCED LEVEL KNOWLEDGE ON HR-RELATED REPORTING AND ANALYTICS TO INCLUDE ADVANCED WORKING KNOWLEDGE OF MICROSOFT EXCEL.ADVANCED EXPERIENCE SUCCESSFULLY MANAGING HRIS AND PAYROLL PROCESSING.SIGNIFICANT EXPERIENCE LEADING COMPREHENSIVE COMPENSATION MARKET STUDIES AND INTRODUCING REQUIRED ENHANCEMENTS TO THE ORGANIZATION.ADVANCED EXPERIENCE PARTNERING WITH EXTERNAL AND INTERNAL RESOURCES TO IDENTIFY AND INTRODUCE COMPETITIVE AND COMPREHENSIVE HEALTH AND WELLNESS BENEFITS TO AN ORGANIZATION TO INCLUDE ANNUAL OPEN ENROLLMENT.STRONG CHANGE MANAGEMENT, PROCESS MANAGEMENT AND PROJECT MANAGEMENT SKILLS.SIGNIFICANT EXPERIENCE CREATING, INTRODUCING AND MANAGING AN ORGANIZATIONAL-WIDE REWARDS AND RECOGNITION PROGRAM.EXPERIENCE DEVELOPING AND ADMINISTERING RELEVANT HR POLICIES.SIGNIFICANT EXPERIENCE IN HUMAN RESOURCES COMPLIANCE TO INCLUDE MAINTAINING ACCURATE EMPLOYEE FILES/RECORDS.EXPERIENCE SUCCESSFULLY IMPLEMENTING NEW HR TECHNOLOGY AND SYSTEMS TO AN ORGANIZATION.ADVANCED EXPERIENCE MODERNIZING AND INTRODUCING AN ORGANIZATIONAL-WIDE PERFORMANCE MANAGEMENT PROGRAM TO INCLUDE DEVELOPMENT PLANNING AND ASSOCIATED KEY PROCESSES.DEMONSTRATED EXPERIENCE IDENTIFYING AND INTRODUCING IMPACTFUL DIVERSITY, EQUITY, INCLUSION AND BELONGING PROGRAMS THAT LEAD TO STRONGER EMPLOYEE ENGAGEMENT AND RETENTION.SUBSTANTIAL EXPERIENCE ASSESSING, MANAGING, COACHING, AND DEVELOPING DIRECT REPORTS.DEEP EXPERIENCE PARTNERING CLOSELY WITH DEPARTMENT HEADS AND THE HR TEAM TO IDENTIFY KEY ENGAGEMENT DRIVERS AND DEVELOP PROGRAMS THAT ENHANCE EMPLOYEE SATISFACTION AND MOTIVATION.THE NATURAL ABILITY TO COMMAND RESPECT THROUGH FOSTERING POSITIVE RELATIONSHIPS AND PROVIDING VALUABLE GUIDANCE IN CHALLENGING SITUATIONS ACROSS ALL LEVELS OF AN ORGANIZATION.DEMONSTRATED EXPERIENCE BEING ABLE TO NAVIGATE AND RESOLVE CONFLICTS EFFECTIVELY, WHILE ALSO OFFERING INNOVATIVE SOLUTIONS TO CHALLENGES AS THEY ARISE.ADVANCED WRITTEN AND VERBAL BUSINESS COMMUNICATION SKILLS TO INCLUDE BEING HIGHLY CAPABLE OF FACILITATING WORKSHOPS TO LARGE GROUPS.A NATURAL CURIOSITY TO UNDERSTAND AN ORGANIZATION'S STRATEGIC AND OPERATIONAL PRIORITIES.WORKING KNOWLEDGE OF THE LATEST HUMAN RESOURCES TRENDS AND BEST PRACTICES.ABILITY TO WORK COLLABORATIVELY WITH THE CPO TO PLAN, LEAD, DIRECT, DEVELOP, AND COORDINATE THE POLICIES, ACTIVITIES, AND STAFF OF THE HR DEPARTMENT, ENSURING LEGAL COMPLIANCE AND IMPLEMENTATION OF THE ORGANIZATION'S MISSION AND STRATEGY.ABILITY TO MAINTAIN CONFIDENTIALITY AND DISCRETION, AS REQUIRED.RELEVANT HR CERTIFICATION DESIRED – PHR, SPHR, SHRM-CP, SHRM-SCP PREFERRED.VALID DRIVER’S LICENSE AND ACCEPTABLE DRIVING RECORD WITH THE ABILITY TO OBTAIN THE ORGANIZATION'S REQUIRED LEVELS OF COVERAGE FOR AUTO INSURANCE.THE ABILITY TO PASS A COMPREHENSIVE BACKGROUND CHECK TO INCLUDE FINGERPRINTING.THE ABILITY TO PASS A DRUG TEST IN ACCORDANCE WITH LOCAL, STATE AND FEDERAL REGULATIONS.\nESSENTIAL DUTIES AND RESPONSIBILITIES TO INCLUDE:MANAGING THE DAY-TO-DAY ORGANIZATIONAL HR SUPPORT DELIVERED BY DIRECT REPORTS, FOSTERING COMMUNICATIVE AND COLLABORATIVE RELATIONSHIPS WITH COLLEAGUES.SERVING AS A TRUSTED BUSINESS PARTNER TO THE SENIOR LEADERSHIP TEAM, ENSURING CONSISTENT AND TRANSPARENT COMMUNICATION THAT SUPPORTS STRATEGIC PRIORITIES AND BUSINESS NEEDS.LEVERAGING THE REQUIRED SKILLS NEEDED FOR THE ROLE TO PRODUCE EXCEPTIONAL RESULTS IN A VARIETY OF HR-RELATED AREAS.DEVELOPING AND IMPLEMENTING A COMPREHENSIVE EMPLOYEE ENGAGEMENT AND RETENTION STRATEGY ALIGNED WITH THE ORGANIZATION'S GOALS AND VALUES.IMPLEMENTING INITIATIVES THAT PROMOTE EMPLOYEE WELL-BEING, WORK-LIFE BALANCE, AND A SENSE OF BELONGING.CONDUCTING REGULAR SURVEYS, FOCUS GROUPS, AND ONE-ON-ONE INTERVIEWS TO GAUGE EMPLOYEE SATISFACTION AND IDENTIFY AREAS FOR IMPROVEMENT USING DATA-DRIVEN INSIGHTS TO CONTINUALLY ASSESS AND IMPROVE ENGAGEMENT STRATEGIES.OVERSIGHT OF PLANNING, COORDINATING, AND EXECUTING EMPLOYEE ACTIVITIES AND EVENTS THAT ENHANCE EMPLOYEE MORALE, SATISFACTION, AND COMMITMENT AND ALIGN TO THE STRATEGY OF CREATING A HIGHLY ENGAGED CULTURE.PROVIDING LEADERSHIP AND GUIDANCE TO A TEAM OF PROFESSIONALS DEDICATED TO EMPLOYEE ENGAGEMENT, SATISFACTION, ACCOUNTABILITY, AND RETENTION.IMPLEMENTING HUMAN RESOURCES STRATEGIES BY ESTABLISHING DEPARTMENT ACCOUNTABILITIES, INCLUDING EMPLOYMENT PROCESSING, COMMUNICATION, AND COMPENSATION PROGRAM.RESEARCHING, PROPOSING, AND MANAGING THE BENEFITS PROGRAM FOR THE ORGANIZATION, ALONG WITH THE CPO, TO ENSURE THE BEST TOTAL REWARDS ARE BEING OFFERED TO EMPLOYEES.LEADING AND MANAGING THE ANNUAL OPEN ENROLLMENT PROCESS FOR EMPLOYEE BENEFITS, WITH A CORRESPONDING COMMUNICATION STRATEGY.ENSURING COMPLIANCE WITH ALL LOCAL, STATE, AND FEDERAL LAWS, EEO AND OSHA REPORTING, AND COLLABORATING WITH THE CPO AND OUTSIDE COUNSEL AS NEEDED.DIRECT TIMELY PROCESSING OF ALL WORKER’S COMPENSATION, FMLA, LEAVES OF ABSENCE, AND UNEMPLOYMENT CLAIMS BY HR TEAM.OVERSEEING AND APPROVING ALL ASSIGNED HRIS EMPLOYEE-RELATED WORKFLOWS.MONITORING AND OVERSEEING INTERNAL AND EXTERNAL EQUITY AND HR METRICS.REMAINING ABREAST OF HUMAN RESOURCES TRENDS AND THE NONPROFIT SECTOR THROUGH RELEVANT WEBINARS, BOOKS, ARTICLES, BLOGS, AND OTHER SOURCES.ENSURING THE ORGANIZATION COMPLIES WITH FEDERAL, STATE, AND LOCAL LEGAL REQUIREMENTS BY STUDYING EXISTING AND NEW LEGISLATION.OVERSIGHT OF MAINTAINING COMPANY ORGANIZATIONAL CHARTS AND THE EMPLOYEE DIRECTORY.MANAGING REVISIONS AND UPDATES TO THE ORGANIZATION'S EMPLOYEE HANDBOOK, AS NECESSARY.PERFORMING ALL OTHER DUTIES AS ASSIGNED.\nPHYSICAL DEMANDS & WORK ENVIRONMENT: THE PHYSICAL DEMANDS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY AN EMPLOYEE TO SUCCESSFULLY PERFORM THE ESSENTIAL FUNCTIONS OF THIS JOB. THE POSITION REQUIRES VISUAL AND AUDITORY ACUITY WITHIN PROFESSIONALLY DETERMINED NORMAL RANGES, WITH CORRECTION IF NEED; AND MANUAL DEXTERITY SUFFICIENT TO OPERATE A COMPUTER AND OFFICE EQUIPMENT, INCLUDING, BUT NOT LIMITED TO, THE TELEPHONE, COMPUTER, AND PHOTOCOPIER. THE EMPLOYEE IS OCCASIONALLY REQUIRED TO MOVE ITEMS UP TO 50 POUNDS.\nOUR CLIENT IS COMMITTED TO PROVIDING REASONABLE ACCOMMODATIONS TO QUALIFIED INDIVIDUALS WITH DISABILITIES AND ENSURING EQUAL ACCESS TO EMPLOYMENT OPPORTUNITIES. IF YOU REQUIRE ANY ACCOMMODATIONS THROUGHOUT THE HIRING PROCESS PLEASE INFORM THE ASSIGNED RECRUITER OF YOUR NEEDS, AND EVERY EFFORT WILL BE MADE TO ACCOMMODATE THEM.",
    "job_skill_set": [
      "HR management",
      "employee relations",
      "HR reporting and analytics",
      "HRIS management",
      "payroll processing",
      "compliance",
      "policy development",
      "compensation analysis",
      "benefits administration",
      "project management",
      "conflict resolution",
      "Microsoft Excel",
      "open enrollment management",
      "communication",
      "relationship management",
      "problem solving",
      "adaptability",
      "confidentiality",
      "time management",
      "organizational skills",
      "performance management",
      "change management",
      "diversity, equity, and inclusion (DEI) programs",
      "employee engagement strategies",
      "workforce retention strategies",
      "workers' compensation management",
      "advanced HR technology implementation",
      "organizational development",
      "employee satisfaction surveys",
      "rewards and recognition programs",
      "HR certification (PHR, SPHR, SHRM-CP, SHRM-SCP)",
      "leadership",
      "team management",
      "collaboration",
      "innovation",
      "trustworthiness",
      "curiosity",
      "coaching and mentoring",
      "strategic thinking",
      "empathy",
      "facilitation skills",
      "negotiation",
      "motivation"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "advanced",
      "analysis",
      "analytics",
      "and",
      "benefits",
      "certification",
      "change",
      "coaching",
      "collaboration",
      "communication",
      "compensation",
      "compliance",
      "confidentiality",
      "conflict",
      "curiosity",
      "dei",
      "development",
      "director",
      "diversity",
      "empathy",
      "employee",
      "engagement",
      "enrollment",
      "equity",
      "excel",
      "facilitation",
      "hr",
      "hris",
      "human",
      "implementation",
      "inclusion",
      "innovation",
      "leadership",
      "management",
      "mentoring",
      "microsoft",
      "motivation",
      "negotiation",
      "open",
      "organizational",
      "payroll",
      "performance",
      "phr",
      "policy",
      "problem",
      "processing",
      "programs",
      "project",
      "recognition",
      "relations",
      "relationship",
      "reporting",
      "resolution",
      "resources",
      "retention",
      "rewards",
      "satisfaction",
      "shrmcp",
      "shrmscp",
      "skills",
      "solving",
      "sphr",
      "strategic",
      "strategies",
      "surveys",
      "team",
      "technology",
      "thinking",
      "time",
      "trustworthiness",
      "workers",
      "workforce"
    ]
  },
  {
    "job_id": "3905251874",
    "job_title": "Human Resources Manager",
    "category": "HR",
    "job_description": "JOB SUMMARY:MAINTAINS AND ENHANCES THE ORGANIZATION’S HUMAN RESOURCES BY PLANNING, IMPLEMENTING, AND EVALUATING EMPLOYEE RELATIONS AND HUMAN RESOURCES POLICIES, PROGRAMS, AND PRACTICES. ESSENTIAL DUTIES AND RESPONSIBILITIES:MANAGES THE FOLLOWING DEPARTMENTS/FUNCTIONSHUMAN RESOURCES, TO INCLUDE, BUT NOT LIMITED TO:SAFETYSECURITYPAYROLL (ADP)LEGALADMINISTRATION, TO INCLUDE, BUT NOT LIMITED TO:OVERSEE SAFETY COORDINATOR OVER SAFETY MANAGEMENT SYSTEM (SMS) MANAGEMENT REPRESENTATIVEISO 14001 ENVIRONMENTAL MANAGEMENT SYSTEM (EMS) MANAGEMENT REPRESENTATIVEESG, CHILD LABOR AUDIT, HQ DOCUMENTSDEVELOP COMPANY POLICIES AND PROCEDURES. INCORPORATE POLICIES AND PROCEDURES IN TEAM MEMBER HANDBOOK.DEVELOP AND SET POLICIES FOR HIRING AND OVERSEE ADHERENCE TO EEOC AND AFFIRMATIVE ACTION PROGRAMS AND DIVERSITY GOALS SET BY THE COMPANY.ESTABLISHES POLICIES THAT SEEK TO INCREASE RETENTION RATES AND FOSTER EMPLOYEE JOB SATISFACTION AND HIGH MORALE.APPROVES TERMINATIONS, AND EXERCISES CARE THAT REASONS ARE WELL DOCUMENTED AND ARE NOT ARBITRARY OR DISCRIMINATORY.OVERSEES MAINTENANCE, ACCURACY AND COMPLETION OF PERSONNEL RECORDS. ENSURES THAT RULES CONCERNING CONFIDENTIALITY AND RETENTION ARE FOLLOWED.KEEPS ABREAST OF LEGISLATION AFFECTING HUMAN RESOURCES; TRAINS MANAGEMENT AND MONITORS COMPANY POLICIES TO ENSURE COMPLIANCE.OVERSEES PREPARATION OF JOB DESCRIPTIONS AND COMPENSATION PROGRAMS. SEEKS INCENTIVE PROGRAMS THAT ENCOURAGE EXCELLENT PERFORMANCE AND INCREASE RETENTION RATES.REVIEWS BENEFITS AND TRIES TO MAXIMIZE JOB SATISFACTION WHILE KEEPING THE COST OF THE BENEFITS PACKAGE UNDER CONTROL.WORKS WITH TOP MANAGEMENT TO SET LONG-TERM STAFFING GOALS AND STRATEGIES.OVERSEES TRAINING AND SAFETY PROGRAMS IN CONTEXT OF COMPLIANCE WITH GOVERNMENT REGULATIONS.MAKE REGULAR REPORTS TO COMPANY PRESIDENT AND GENERAL MANAGER OF FINANCE.SERVES AS ALTERNATE EMERGENCY COORDINATOR FOR ANY HAZARDOUS WASTE OR SPILL ISSUES.ALTERNATE FOR SAFETY SPECIALIST DURING ABSENCE.ATTEND INITIAL AND ANNUAL RCRA TRAINING AS REQUIRED BY 40 CFR.ALL OTHER DUTIES AS ASSIGNED. SKILLS/REQUIREMENTS:EXCELLENT TIME-MANAGEMENT, PROBLEM-PREVENTION AND PROBLEM-SOLVING SKILLS.EXCELLENT INTERPERSONAL SKILLS, INCLUDING EMAIL, WORD PROCESSING AND SPREADSHEETS.CONDUCT RESEARCH, INCLUDING USE OF COMMERCIAL COMPUTER-BASED RESEARCH SERVICES.PROVEN TRACK RECORD IN HUMAN RESOURCE MANAGEMENT IN A MANUFACTURING ENVIRONMENT, PREFERABLY AUTOMOTIVE MANUFACTURING.COMMUNICATE EFFECTIVELY, VERBALLY AND IN WRITING, TO A DIVERSE AUDIENCE.PLAN, ORGANIZE AND PRIORITIZE WORK.DEMONSTRATE THE HIGHEST LEVEL OF ETHICAL BEHAVIOR.MAINTAIN CONFIDENTIALITY OF SENSITIVE INFORMATION.REMAIN FLEXIBLE IN ORDER TO ADAPT TO CHANGES IN WORK ENVIRONMENT. EDUCATION/TRAINING/EXPERIENCE:BACHELOR’S DEGREE IN BUSINESS ADMINISTRATION OR RELATED FIELD REQUIRED.5-10 YRS. PROVEN EXPERIENCE IN HUMAN RESOURCES MANAGEMENT.PRIOR EXPERIENCE WORKING IN A MANUFACTURING ENVIRONMENT.EXPERIENCE WORKING WITH A DIVERSE WORKFORCE. SOFTWARE SKILLS REQUIRED:  MS WORD X POWERPOINT X EXCEL X SAP X ADP X",
    "job_skill_set": [
      "Human Resource Management",
      "Employee Relations",
      "Policy Development",
      "Payroll (ADP)",
      "Compensation Programs",
      "Time Management",
      "Problem Solving",
      "Interpersonal Skills",
      "Communication",
      "Organizational Skills",
      "ISO 14001",
      "Safety Management",
      "Microsoft Word",
      "Microsoft Excel",
      "Microsoft PowerPoint",
      "SAP",
      "Research Skills",
      "Ethical Behavior",
      "Confidentiality",
      "Flexibility"
    ],
    "short_keywords": [
      "14001",
      "adp",
      "behavior",
      "communication",
      "compensation",
      "confidentiality",
      "development",
      "employee",
      "ethical",
      "excel",
      "flexibility",
      "hr",
      "human",
      "interpersonal",
      "iso",
      "management",
      "manager",
      "microsoft",
      "organizational",
      "payroll",
      "policy",
      "powerpoint",
      "problem",
      "programs",
      "relations",
      "research",
      "resource",
      "resources",
      "safety",
      "sap",
      "skills",
      "solving",
      "time",
      "word"
    ]
  },
  {
    "job_id": "3901167349",
    "job_title": "Human Resources Business Partner",
    "category": "HR",
    "job_description": "HUMAN RESOURCE DIMENSIONS HAS BEEN ENGAGED TO PLACE AN HR BUSINESS PARTNER FOR A CLIENT IN ATLANTA (BUCKHEAD), GEORGIA. THIS WILL BE AN ONSITE ROLE.\nTHIS HR BUSINESS PARTNER POSITION FORMULATES PARTNERSHIPS ACROSS THE HR FUNCTION TO DELIVER VALUE-ADDED SERVICE TO MANAGEMENT AND EMPLOYEES THAT REFLECT THE BUSINESS OBJECTIVES OF THE ORGANIZATION. \nTHIS INDIVIDUAL IS RESPONSIBLE FOR SUPPORTING OUR CLIENT'S MARKETS AND CORPORATE FUNCTIONS IN ONBOARDING/OFFBOARDING, EMPLOYEE RELATIONS, BACKUP FOR BENEFITS ADMINISTRATION, AND TRAINING AND DEVELOPMENT ACROSS ALL COMPANY OPERATIONS.\nIN ADDITION TO RESOLVING CUSTOMER (MANAGEMENT AND EMPLOYEE) PROBLEMS/ ISSUES, THIS INDIVIDUAL MUST HAVE THE ABILITY TO RECOGNIZE “BIG PICTURE” OPPORTUNITIES FOR PROCESS IMPROVEMENT, IDENTIFY THE PROPER COURSE OF ACTION, AND PARTNER WITH THE FIELD AND CORPORATE TO MANAGE THE CHANGE FROM START TO FINISH.\nTHE HRBP MUST HAVE STRONG ATTENTION TO DETAIL, ORGANIZATION, AND PROJECT COORDINATION SKILLS AND CAN MULTI-TASK PRIORITIES AND ASSIGNMENTS. MUST BE ABLE TO WORK INDEPENDENTLY, AND HAVE STRONG COMMUNICATION AND RELATIONSHIP-BUILDING SKILLS. MUST HAVE HRIS EXPERIENCE AS WELL AS ADVANCED LEVEL COMPUTER SKILLS IN MS OFFICE SUITE. MUST HAVE THE ABILITY TO HANDLE CONFIDENTIAL AND SENSITIVE INFORMATION. MUST BE COMPETENT AND CONFIDENT IN INTERACTIONS WITH ALL LEVELS OF EMPLOYEES, CUSTOMERS AND VENDORS.\n RESPONSIBILITIES:EMPLOYEE RELATIONSADVISE MANAGERS ON HR REGULATIONS, PRACTICES, AND COMPANY POLICIES AND PROCEDURES.MANAGES AND RESOLVES COMPLEX EMPLOYEE RELATIONS ISSUES (INCLUDING COMPLAINTS FROM COMPLIANCE HOTLINE). CONDUCTS EFFECTIVE, THOROUGH, AND OBJECTIVE INVESTIGATIONS.SUPPORT, COUNSEL, AND STRATEGIZE WITH MANAGERS ON EMPLOYEE AND/OR PERFORMANCE ISSUES TO HELP ENSURE ACTIONS ARE APPROPRIATE.CONSULT WITH HR LEADERSHIP AND OPERATIONS MANAGEMENT REGARDING EMPLOYEE DISCIPLINE, PERFORMANCE CONCERNS, AND TERMINATIONS TO ENSURE FAIR AND CONSISTENT APPLICATION OF CLIENT PRACTICES.DOCUMENT ALL EMPLOYEE RELATIONS ISSUES THOROUGHLY/TIMELY AND UPDATE EMPLOYEE FILES.AS REQUESTED BY VP OF HR OR LEGAL, CONDUCT THE FULL LIFECYCLE OF INVESTIGATIONS, INCLUDING WITNESS INTERVIEWS, COMPILING DOCUMENTATION, PROVIDING INFORMATION TO INTERNAL AND EXTERNAL COUNSEL, AND WORKING TOWARDS A RESOLUTION. PARTICIPATE IN HEARINGS AS NEEDED.STRATEGIZE WITH MANAGERS AND RECOMMEND ACTIONS TO ADDRESS ISSUES OR NEGOTIATE/ RESOLVE CONFLICTS.CONDUCT MID-YEAR AND ANNUAL REVIEWS/ GOAL SETTING EXERCISES.\nONBOARDING/OFFBOARDING:COORDINATES OFFER LETTERS IN CONJUNCTION WITH RECRUITER OR STAFFING VENDORS.CREATES CORRESPONDENCE REGARDING OFFERS, PROMOTIONS, TRANSFERS, AND SEPARATIONS (OFFER LETTERS, TERMINATION LETTERS, SEPARATION NOTICES, AND OTHER CORRESPONDENCE, ETC.).WORKS WITH MANAGERS AND RECRUITER TO DEVELOP JOB DESCRIPTIONS.PARTNERS WITH RECRUITER TO IMPLEMENT CREATIVE SOURCING STRATEGIES TO IDENTIFY BEST-IN-CLASS TALENT.CONDUCTS EXIT INTERVIEWS AND ANALYZES FEEDBACK TO IDENTIFY TRENDS AND AREAS FOR IMPROVEMENT.COORDINATES NEW HIRE, TRANSFER/PROMOTIONAL, AND SEPARATION PROCESSES FOR PAYROLL PURPOSES, ENSURING ALL DATA AND SIGNATURES ARE OBTAINED.WORK CLOSELY WITH PAYROLL TO ENSURE EMPLOYEE DATA IS UPDATED TIMELY AND ACCURATELY IN THE UKG HR SYSTEM.SERVES AS A BACKUP TO THE RECRUITER WHO MANAGES AND POSTS JOB OPENINGS THROUGH UKG HR SYSTEM AND OTHER SITES (LINKEDIN, ETC.).SERVE AS A BACKUP TO THE HR ASSISTANT WHO MANAGES THE PRE-EMPLOYMENT PROCESS (DRUG SCREEN, BACKGROUND CHECK, CREDIT CHECKS) AND FOLLOW UP TO ENSURE ALL IS COMPLETED TIMELY.\nOTHER RESPONSIBILITIES:SERVES AS A BACKUP TO THE BENEFITS ADMINISTRATOR.CONDUCTS ANNUAL I-9 AUDIT.PROCESSES INDUSTRY SURVEYS AND PARTICIPATES IN BENCHMARKING STUDIES IN CONJUNCTION WITH VP OF HR.PARTICIPATES IN COMPANY-WIDE COMMITTEES OR INITIATIVES.IDENTIFIES OPPORTUNITIES TO IMPROVE WORKFLOW AND/OR ENHANCE HR SERVICE DELIVERY.ASSISTS IN CREATING AND MANAGING EMPLOYEE RELATIONS EVENTS.CREATES AND DELIVERS PRESENTATIONS TO MANAGEMENT AND STAFF ON A VARIETY OF HR-RELATED PROGRAMS.MAINTAINS AWARENESS OF FEDERAL, STATE, AND LOCAL LAWS AND REGULATIONS TO ENSURE COMPLIANCE WITH REPORTING REQUIREMENTS AND CHANGES IN EMPLOYMENT REGULATIONS.PROVIDES A HIGH LEVEL OF CUSTOMER SERVICE AND ANALYTICAL SKILLS TO ASSESS EFFECTIVENESS AND FEASIBILITY.\nEDUCATION/WORK EXPERIENCE:BACHELOR'S DEGREE REQUIRED. BACHELOR’S DEGREE IN HR MANAGEMENT OR BUSINESS ADMINISTRATION STRONGLY PREFERRED.4-7 YEARS OF DYNAMIC EXPERIENCE IN ALL ASPECTS OF HUMAN RESOURCES REQUIRED.MINIMUM OF 3 YEARS OF EMPLOYEE RELATIONS (INCLUDING WORKPLACE INVESTIGATIONS) EXPERIENCE REQUIRED.PRIOR EXPERIENCE IN SUPPORTING BOTH HOURLY AND SALARIED POSITIONS IS REQUIRED.PRIOR EXPERIENCE IN BENEFITS ADMINISTRATION IS STRONGLY PREFERRED.PRIOR EXPERIENCE IN UKG HR SYSTEM IS PREFERRED.\nKNOWLEDGE, SKILLS AND ABILITIES:ABILITY TO INDEPENDENTLY ANALYZE DATA, FORMULATE CONCLUSIONS AND SUMMARIZE FINDINGS.ABILITY TO CONDUCT RESEARCH IN VARIED TOPIC AREAS USING MULTIPLE INFORMATION CHANNELS.ADVANCED MICROSOFT OFFICE SKILLS WITH EMPHASIS ON EXCEL AND POWERPOINT.ABILITY TO LEARN AND APPLY COMPANY POLICY, INTERNAL HR PROCEDURES, AND REGULATORY GUIDELINES WITHIN THE SCOPE OF DUTIES.EXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLS.MUST POSSESS STRONG INTERPERSONAL SKILLS AND AN ABILITY TO WORK AND COMMUNICATE EFFECTIVELY WITH ALL LEVELS OF OPERATIONS.NEED TO PERFORM RESPONSIBILITIES WITH AN ACUTE SENSE OF URGENCY TO MEET THE NEEDS OF OTHERS; RESPOND TO SOLVE PROBLEMS; WILLING TO ACCEPT A VARIETY OF TASKS ASSOCIATED WITH THIS POSITION.DEMONSTRATE SOUND BUSINESS ETHICS; CONSISTENTLY COMPLY WITH ORGANIZATIONAL VALUES; PROTECT CONFIDENTIAL INFORMATION.ABLE TO CLEARLY EXPRESS IDEAS; PRESENT VERBAL INFORMATION IN A STRAIGHTFORWARD MANNER; ASK QUESTIONS IN ORDER TO OPEN CHANNELS OF COMMUNICATION; LISTEN TO UNDERSTAND THE PERSPECTIVE OF OTHERS.ABILITY TO TRAVEL AS OCCASIONAL TRAVEL MAY BE REQUIRED.",
    "job_skill_set": [
      "HRIS",
      "Microsoft Office Suite",
      "Employee Relations",
      "Onboarding",
      "Offboarding",
      "Workplace Investigations",
      "Benefits Administration",
      "Data Analysis",
      "Project Coordination",
      "Compliance Knowledge",
      "Communication",
      "Interpersonal Skills",
      "Problem Solving",
      "Attention to Detail",
      "Organization",
      "Relationship Building",
      "Adaptability",
      "Customer Service",
      "Teamwork",
      "Confidentiality",
      "UKG HR System"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "analysis",
      "attention",
      "benefits",
      "building",
      "business",
      "communication",
      "compliance",
      "confidentiality",
      "coordination",
      "customer",
      "data",
      "detail",
      "employee",
      "hr",
      "hris",
      "human",
      "interpersonal",
      "investigations",
      "knowledge",
      "microsoft",
      "offboarding",
      "office",
      "onboarding",
      "organization",
      "partner",
      "problem",
      "project",
      "relations",
      "relationship",
      "resources",
      "service",
      "skills",
      "solving",
      "suite",
      "system",
      "teamwork",
      "to",
      "ukg",
      "workplace"
    ]
  },
  {
    "job_id": "3901632117",
    "job_title": "Human Resources Business Partner (HRBP)",
    "category": "HR",
    "job_description": "WE’RE LIVING AND WORKING IN THE MIDST OF A DIGITAL REVOLUTION, AND THE DEMAND FOR OPTIMIZED TECHNOLOGY PRACTICES HAS NEVER BEEN MORE CRITICAL FOR BUSINESSES. AT ENTECH, IT’S OUR MISSION TO HELP COMPANIES NAVIGATE THE CHANGING ENVIRONMENT AND ACCELERATE DIGITAL REALIZATION THROUGH THE POWER OF SOLUTIONS, SERVICES, AND PRODUCT PLATFORMS. WITH COMPREHENSIVE END-TO-END OFFERINGS, WE ADVISE, ENGINEER, AND MANAGE, ENSURING OUR CLIENTS PROACTIVELY DRIVE TOWARD SUCCESS IN THIS EVER-EVOLVING DIGITAL LANDSCAPE.\nOUR TEAM IS GROWING, AND WE’RE SEARCHING FOR A HUMAN RESOURCES BUSINESS PARTNER (HRBP) WHO IS A CREATIVE PROBLEM-SOLVER WITH THEIR FINGERTIPS ON THE LATEST INDUSTRY PRACTICES. WE PRIORITIZE AUTHENTIC PARTNERSHIPS IN A COLLABORATIVE ENVIRONMENT, AND WE’RE EXCITED TO WELCOME AN HUMAN RESOURCES BUSINESS PARTNER (HRBP) WHO IS EAGER TO BRING THEIR EXPERTISE TO OUR TEAM. TO BE A SUCCESSFUL HRBP, YOU MUST BE ABLE TO DEAL WITH A VARIETY OF PERSONALITIES, ALONG WITH BEING APPROACHABLE, FAIR, AND HAVE GOOD MULTITASKING ABILITIES. HRBP RESPONSIBILITIES:COLLABORATE WITH SENIOR LEADERSHIP TO ALIGN HR STRATEGIES WITH OVERALL BUSINESS OBJECTIVES AND CONTRIBUTE TO THE ORGANIZATION’S SUCCESS. PARTICIPATE IN WORKFORCE PLANNING, RECRUITMENT, AND ONBOARDING/OFFBOARDING PROCESSES TO ENSURE THE ORGANIZATION HAS THE RIGHT TALENT IN THE RIGHT ROLES. LEAD AND SUPPORT ORGANIZATIONAL CHANGE INITIATIVES, HELPING EMPLOYEES ADAPT TO NEW PROCESSES AND TECHNOLOGIES. UTILIZE HR ANALYTICS TO IDENTIFY TRENDS AND MAKE DATA-DRIVEN RECOMMENDATIONS FOR IMPROVING HR STRATEGIES AND PROCESSES. ENSURE COMPLIANCE WITH LABOUR LAWS, REGULATIONS, AND INDUSTRY STANDARDS, WHILE MITIGATING HR-RELATED RISKS. MANAGE PAYROLL AND BENEFITS PROGRAMS. FOSTER A POSITIVE WORKPLACE CULTURE THAT PROMOTES EMPLOYEE ENGAGEMENT AND SATISFACTION. PARTICIPATE IN SELECT INTERNAL PROJECTS AS NEEDED.  HR ADMINISTRATIVE REQUIREMENTS:BACHELOR’S DEGREE IN HUMAN RESOURCES, BUSINESS ADMINISTRATION, OR A RELATED FIELD (MASTERS DEGREE PREFERRED). 5+ YEARS OF PROVEN EXPERIENCE AS AN HR BUSINESS PARTNER OR SIMILAR ROLE. STRONG KNOWLEDGE OF HR PRINCIPLES, PRACTICES, AND REGULATIONS. EXCELLENT COMMUNICATION AND INTERPERSONAL SKILLS. EXCEPTIONAL PROBLEM-SOLVING AND DECISION-MAKING ABILITIES ABILITY TO BUILD STRONG RELATIONSHIPS AND COLLABORATE EFFECTIVELY ACROSS ALL LEVELS OF THE ORGANIZATION. DEMONSTRATED EXPERIENCE IN CHANGE MANAGEMENT AND ORGANIZATIONAL DEVELOPMENT IS A PLUS.  BENEFITS:MEDICAL, DENTAL, VISION, 401K AND PTO\nENTECH IS AN EQUAL OPPORTUNITY EMPLOYER. WE CELEBRATE DIVERSITY AND ARE COMMITTED TO CREATING AN INCLUSIVE ENVIRONMENT FOR ALL EMPLOYEES. ENTECH DOES NOT OFFER SPONSORSHIP FOR THIS ROLE AT THIS TIME.",
    "job_skill_set": [
      "recruitment",
      "onboarding",
      "compliance with labor laws",
      "benefits administration",
      "HR principles and practices",
      "communication",
      "interpersonal skills",
      "problem-solving",
      "decision-making",
      "collaboration",
      "relationship building",
      "employee engagement",
      "HR analytics",
      "workforce planning",
      "offboarding",
      "change management",
      "organizational development",
      "payroll management",
      "data-driven decision making",
      "multitasking",
      "approachability",
      "fairness"
    ],
    "short_keywords": [
      "administration",
      "analytics",
      "and",
      "approachability",
      "benefits",
      "building",
      "business",
      "change",
      "collaboration",
      "communication",
      "compliance",
      "datadriven",
      "decision",
      "decisionmaking",
      "development",
      "employee",
      "engagement",
      "fairness",
      "hr",
      "hrbp",
      "human",
      "interpersonal",
      "labor",
      "laws",
      "making",
      "management",
      "multitasking",
      "offboarding",
      "onboarding",
      "organizational",
      "partner",
      "payroll",
      "planning",
      "practices",
      "principles",
      "problemsolving",
      "recruitment",
      "relationship",
      "resources",
      "skills",
      "with",
      "workforce"
    ]
  },
  {
    "job_id": "3904710183",
    "job_title": "Human Resources Generalist",
    "category": "HR",
    "job_description": "ARE YOU AN EXPERIENCED HR PROFESSIONAL LOOKING FOR A ROLE WHERE YOU CAN GROW AND ADVANCE WITH A DYNAMIC COMPANY? WE'RE SEEKING A HIGHLY MOTIVATED AND DYNAMIC HR GENERALIST TO JOIN A HIGHLY INNOVATIVE COMPANY IN ROUND ROCK THAT IS LEADING INTEGRATION IN DATA CENTER LIFECYCLES. IN THIS ROLE, YOU WILL PLAY A MEANINGFUL ROLE IN SUPPORTING THEIR EMPLOYEES AND MAINTAINING A PRODUCTIVE AND ENGAGING WORK ENVIRONMENT.\nTHEY ENCOURAGE INITIATIVE, CREATIVITY, AND INNOVATION, AND THERE IS PLENTY OF ROOM TO GROW AS THEY EXPAND THEIR TEAM AND SERVICE OFFERINGS. YOU WILL HAVE THE OPPORTUNITY TO WORK WITH A HARDWORKING TEAM AND MAKE A REAL IMPACT ON THE ORGANIZATION. THIS IS AN INCREDIBLE OPPORTUNITY!\nRESPONSIBILITIES:HANDLE THE END-TO-END RECRUITMENT PROCESS, INCLUDING JOB POSTINGS, RESUME SCREENING, INTERVIEWING, AND ONBOARDING NEW HIRES.CREATE AND IMPLEMENT HR POLICIES AND PROCEDURES IN ACCORDANCE WITH LEGAL REQUIREMENTS AND COMPANY STANDARDS.PROVIDE DIRECTION AND SUPPORT TO MANAGERS AND EMPLOYEES ON HR-RELATED MATTERS, INCLUDING PERFORMANCE MANAGEMENT, DISCIPLINARY ACTIONS, AND CONFLICT RESOLUTION.COORDINATE EMPLOYEE TRAINING AND DEVELOPMENT INITIATIVES TO IMPROVE SKILLS AND PROMOTE CAREER GROWTH.COORDINATE EMPLOYEE BENEFITS PROGRAMS AND ENSURE ACCURATE RECORD-KEEPING AND COMPLIANCE.MAINTAIN HRIS DATABASE AND GENERATE REPORTS AS NEEDED.STAY UP-TO-DATE ON HR STANDARD METHODOLOGIES AND EMPLOYMENT LAWS TO MAINTAIN COMPLIANCE AND ASSIST WITH SPECIAL PROJECTS AND OTHER HR INITIATIVES AS ASSIGNED.\nSKILLS:PROFICIENCY IN USING VARIOUS RECRUITMENT TOOLS AND TECHNIQUES TO ATTRACT TOP TALENT TO OWN THE FULL RECRUITMENT LIFECYCLE, INCLUDING SOURCING, SCREENING, INTERVIEWING, AND ONBOARDING. THIS INCLUDES THE ABILITY TO DEVELOP JOB DESCRIPTIONS AND CONDUCT JOB ANALYSIS.EXPERIENCE CONDUCTING INVESTIGATIONS AND HANDLING EMPLOYEE RELATIONS ISSUES, DEVELOPING AND IMPLEMENTING HR POLICIES AND PROCEDURES WHICH LEAD TO GENERATING HR METRICS AND REPORTS TO SUPPORT DECISION-MAKING.EXPERIENCE ADMINISTERING PERFORMANCE APPRAISAL PROCESSES AND PROVIDING DIRECTION TO MANAGERS AND EMPLOYEES WHICH INCLUDES IDENTIFYING PERFORMANCE ISSUES AND DEVELOPING APPROPRIATE ACTION PLANS FOR IMPROVEMENT.PROFICIENCY IN SETTING SMART (SPECIFIC, MEASURABLE, ACHIEVABLE, RELEVANT, TIME-BOUND) GOALS.ABILITY TO ASSESS TRAINING NEEDS AND DEVELOP TRAINING PLANS TO ENHANCE EMPLOYEE SKILLS AND COMPETENCIES.KNOWLEDGE OF EMPLOYEE BENEFITS PROGRAMS, INCLUDING HEALTH INSURANCE, RETIREMENT PLANS, AND LEAVE POLICIES.STRONG PROBLEM-SOLVING SKILLS TO IDENTIFY ROOT CAUSES OF HR ISSUES AND DEVELOP EFFECTIVE SOLUTIONS.\nQUALIFICATIONS:BACHELOR’S DEGREE IN HUMAN RESOURCES, BUSINESS ADMINISTRATION, OR RELATED FIELD PREFERRED.HR CERTIFICATION PREFERRED: PHR, SHRM-PCP, ETC.PROVEN EXPERIENCE IN HR ROLES, WITH DEMONSTRATED PROFICIENCY IN RECRUITMENT, EMPLOYEE RELATIONS, AND HR ADMINISTRATION.SOLID KNOWLEDGE OF EMPLOYMENT LAWS AND REGULATIONS.EXCELLENT COMMUNICATION AND INTERPERSONAL SKILLS.PROFICIENCY IN HRIS AND MICROSOFT OFFICE SUITE.EXPERIENCE PREPARING AND DELIVERING PRESENTATIONS ON HR-RELATED TOPICS.\nWHY JOIN:UNLOCK YOUR FULL POTENTIAL AND JOIN A WORKPLACE THAT VALUES YOUR WELL-BEING. YOU'LL RECEIVE A COMPETITIVE SALARY, BONUSES, AND A RICH BENEFITS PROGRAM, INCLUDING HEALTH, DENTAL, VISION, LIFE INSURANCE, 401K MATCH, TUITION REIMBURSEMENT, AND SHORT/LONG-TERM DISABILITY, ALL OF WHICH WILL HELP YOU THRIVE BOTH PERSONALLY AND PROFESSIONALLY. THEY ARE DEDICATED TO CREATING A SUPPORTIVE, COLLABORATIVE, AND UPLIFTING ENVIRONMENT THAT EMPOWERS YOU TO ACHIEVE YOUR GOALS. JOIN AND GROW!\nEQUAL OPPORTUNITY EMPLOYER: SPOT ON TALENT IS AN EQUAL OPPORTUNITY EMPLOYER. WE CELEBRATE DIVERSITY AND ARE COMMITTED TO CREATING AN INCLUSIVE ENVIRONMENT FOR ALL EMPLOYEES. WE DO NOT DISCRIMINATE ON THE BASIS OF RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, AGE, DISABILITY, OR ANY OTHER PROTECTED CLASS.",
    "job_skill_set": [
      "recruitment",
      "HR policies and procedures",
      "employee relations",
      "performance management",
      "HRIS",
      "training and development",
      "employment laws",
      "Microsoft Office Suite",
      "data analysis",
      "job analysis",
      "HR metrics",
      "employee benefits programs",
      "communication",
      "problem solving",
      "interpersonal skills",
      "initiative",
      "creativity",
      "teamwork",
      "conflict resolution",
      "adaptability",
      "presentation skills"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "and",
      "benefits",
      "communication",
      "conflict",
      "creativity",
      "data",
      "development",
      "employee",
      "employment",
      "generalist",
      "hr",
      "hris",
      "human",
      "initiative",
      "interpersonal",
      "job",
      "laws",
      "management",
      "metrics",
      "microsoft",
      "office",
      "performance",
      "policies",
      "presentation",
      "problem",
      "procedures",
      "programs",
      "recruitment",
      "relations",
      "resolution",
      "resources",
      "skills",
      "solving",
      "suite",
      "teamwork",
      "training"
    ]
  },
  {
    "job_id": "3862673730",
    "job_title": "AOC Human Resources Project Manager",
    "category": "HR",
    "job_description": "ADMINISTRATIVE OFFICE OF THE COURTSBUSINESS UNIT: 21800AOC HUMAN RESOURCES PROJECT MANAGER #00039282-21800, FULL-TIME, PERM, IN SANTA FE, NM# OF POSITIONS: 1OPENING DATE: 04-10-2024 -CLOSE DATE: --TARGET PAY RANGE/RATE: $33.774 - $38.000 HOURLY OR $70,250 - $79,040 ANNUALLY\nTHE ADMINISTRATIVE OFFICE OF THE COURTS (AOC) IS RECRUITING FOR A FULL-TIME, CLASSIFIED, AOC HUMAN RESOURCES PROJECT MANAGER POSITION #00039282-21800 IN SANTA FE, NEW MEXICO. GENERAL STATEMENT OF DUTIES: ACTING UNDER ADMINISTRATIVE DIRECTION, RESEARCH, PLAN, COORDINATE, DIRECT, AND IMPLEMENT STATEWIDE HUMAN RESOURCES PROJECTS FOR THE ADMINISTRATIVE OFFICE OF THE COURTS HUMAN RESOURCES DIVISION (AOC HRD) AND THE NEW MEXICO JUDICIAL BRANCH. FINALIST(S) MAY BE SUBJECT TO CRIMINAL BACKGROUND CHECK(S).\nEXAMPLES OF JOB DUTIES● THE AOC HUMAN RESOURCE PROJECT MANAGER IS RESPONSIBLE FOR PLANNING, ORGANIZING, INTEGRATING AND COORDINATING STATEWIDE PROJECTS RELATED TO HUMAN RESOURCES.● PARTICIPATES IN SHORT/LONG-TERM PLANNING FOR HUMAN RESOURCES PROJECTS AND INITIATIVES.● ASSISTS WITH IMPLEMENTING AND DEVELOPING THE JUDICIARY’S STATEWIDE HUMAN RESOURCES PROCESSES AND SYSTEMS INCLUDING CLASSIFICATION AND COMPENSATION, STATEWIDE PERSONNEL COMMITTEES, AND EMPLOYEE RELATIONS.● ASSISTS THE DEVELOPMENT AND IMPLEMENTATION OF GOALS, OBJECTIVES, POLICIES, AND PRIORITIES FOR ASSIGNED ACTIVITIES AND PROJECTS; RECOMMENDS, DEVELOPS, IMPLEMENTS AND ADMINISTERS POLICIES, PROCEDURES, TRAINING GUIDES, AND STANDARD OPERATING PROCEDURES.● ASSISTS IN THE DEVELOPMENT OF COMPLEX STATISTICAL REPORTS IN RELATION TO ESTABLISHED GOALS; ASSISTS IN IMPLEMENTING PROJECTS AND PROGRAMS TO INCREASE THE EFFECTIVENESS OF HUMAN RESOURCES ACTIVITIES STATEWIDE AND IS RESPONSIBLE FOR ASSIGNED SPECIAL PROJECTS AND ACTIVITIES.● PROVIDES, ORGANIZES, AND IMPLEMENTS TRAINING FOR STAFF AND HUMAN RESOURCE PERSONNEL; IDENTIFIES AND PROMOTES TRAINING FOR JUDICIAL BRANCH SUPERVISORS, MANAGERS AND STAFF.● ASSISTS IN THE DEVELOPMENT OF TRAINING PROGRAMS, INCLUDING MATERIALS, CURRICULUM, AND TRAINING PLANS; IMPLEMENTS, COORDINATES, AND PRESENTS EDUCATIONAL PROGRAMS AND TRAINING.● INTERPRETS AND PROVIDES GUIDANCE ON THE APPLICATION OF POLICIES, PROCEDURES, RULES, AND LAWS IN A FAIR, EQUITABLE, AND CONSISTENT MANNER.● DEVELOPS AND PREPARES STATISTICAL AND MANAGEMENT REPORTS AND ASSISTS IN THE EVALUATION OF DATA IN RELATION TO ESTABLISHED GOALS.● SERVES AS A LIAISON AND PROVIDES SUPPORT TO HUMAN RESOURCE MANAGERS, COURT STAFF, STATE AGENCIES, AND THE PUBLIC.● RECOMMENDS NEW APPROACHES, POLICIES, AND PROCEDURES TO EFFECT CONTINUAL IMPROVEMENTS IN THE EFFICIENCY OF THE HUMAN RESOURCES DIVISION AND THE SERVICES PROVIDED.● ASSISTS IN STATEWIDE JOB CLASSIFICATION STUDIES, ANALYZES JOB DUTIES AND ORGANIZATIONAL STRUCTURE, AND MAY PREPARE JOB RECLASSIFICATION DOCUMENTATION INCLUDING RECOMMENDATIONS FOR APPROVAL OR DISAPPROVAL.● ASSISTS IN THE DEVELOPMENT OF THE JUDICIAL BRANCH CLASSIFICATION AND COMPENSATION PLAN.● PROVIDES GUIDANCE AND INFORMATION REGARDING PROGRESSIVE DISCIPLINE TO MANAGEMENT, DRAFTS DISCIPLINARY ACTIONS AND ASSISTS MANAGERS AND SUPERVISORS IN ANALYZING THE PROBLEM AND IDENTIFYING THE BEST COURSE OF DISCIPLINARY ACTION.● INVESTIGATES EMPLOYEE COMPLAINTS, PREPARES AND REVIEWS REPORTS OF FINDINGS AND RECOMMENDS APPROPRIATE RESPONSE AND/OR CORRECTIVE ACTION.● INVESTIGATES, PREPARES, AND RESPONDS TO STATEWIDE UNEMPLOYMENT CLAIMS.● OTHER DUTIES AS ASSIGNED.\nCOMPETENCIES/QUALIFICATIONSTHE SUCCESSFUL APPLICANT SHOULD DEMONSTRATE KNOWLEDGE OF PROJECT MANAGEMENT, HUMAN RESOURCES ADMINISTRATION PRACTICES, PERFORMANCE MANAGEMENT, RECRUITMENT, INTERVIEWING AND SELECTION TECHNIQUES, RECORDS MANAGEMENT, EMPLOYMENT LAW, CLASSIFICATION AND COMPENSATION, EMPLOYEE RELATIONS, MEDIATION AND CONFLICT RESOLUTION, INVESTIGATIVE AND INTERVIEWING PROCEDURES AND TECHNIQUES, STATISTICAL DATA COLLECTION, AUDIT AND RECONCILIATION PROCEDURES, BUDGET PROCESSES INCLUDING POSITION ALLOCATION AND ORGANIZATIONAL STRUCTURES, LOSS CONTROL, AND TRAINING TECHNIQUES.\nWORK ENVIRONMENT AND PHYSICAL DEMANDSTHE FOLLOWING FUNCTIONS ARE REPRESENTATIVE, BUT NOT ALL-INCLUSIVE OF THE WORK ENVIRONMENT AND PHYSICAL DEMANDS AN EMPLOYEE MAY EXPECT TO ENCOUNTER IN PERFORMING TASKS ASSIGNED TO THIS JOB. WORK IS PERFORMED IN AN OFFICE OR COURT SETTING. A VALID DRIVER'S LICENSE AND TRAVEL MAY BE REQUIRED. THE ASSIGNED WORK SCHEDULE MAY INCLUDE NIGHTS, WEEKENDS, HOLIDAYS, AND OVERTIME. THE EMPLOYEE MUST REGULARLY INTERACT POSITIVELY WITH CO-WORKERS, CLIENTS, THE PUBLIC, JUDGES, AND JUSTICES.* THIS JOB DESCRIPTION IS ILLUSTRATIVE ONLY AND IS NOT A COMPREHENSIVE LISTING OF ALL FUNCTIONS PERFORMED\nBENEFITS● MEDICAL/DENTAL/VISION/RX, SHORT, AND LONG TERM DISABILITY INSURANCE PROGRAMS, EMPLOYEE ASSISTANCE PROGRAM (EAP) [HTTP://WWW.MYBENEFITSNM.COM/]● STATE PAID LIFE INSURANCE, SUPPLEMENTAL AND DEPENDENT LIFE INSURANCE● OPTIONAL FLEXIBLE SPENDING ACCOUNTS FOR MEDICAL, DAY-CARE, AND TRAVEL EXPENSES● PAID TIME OFF, UP TO EIGHT (8) WEEKS● PAID TIME OFF AND RETIREMENT BUYBACK● ELEVEN (11) PAID HOLIDAYS● UP TO 12 WEEKS OF PAID PARENTAL LEAVE● DEFERRED COMPENSATION 457(B) PLAN● LIFETIME DEFINED BENEFITS RETIREMENT PLAN [HTTP://WWW.NMPERA.ORG/]● FLEXIBLE WORK SCHEDULES AND ALTERNATIVE WORK LOCATIONS*● FREE HEALTH CARE, RX, AND LAB WORK AT THE FACILITY (STAY WELL HEALTH CENTER) IN SANTA FE, NM● BILINGUAL COMPENSATION*● TRAINING AND CAREER DEVELOPMENT OPPORTUNITIES● HIGHER EDUCATION OPPORTUNITIES, EDUCATIONAL LEAVE, AND TUITION REIMBURSEMENT● MAY QUALIFY FOR THE PUBLIC SERVICE LOAN FORGIVENESS PROGRAM (PSLF)● MAY RECEIVE OVERTIME HOLIDAY OR SHIFT DIFFERENTIAL PAY*● MAY RECEIVE PHYSICAL FITNESS LEAVE**THESE BENEFITS VARY BY JOB CLASSIFICATION OR NEED*\nQUALIFICATIONSEDUCATION: BACHELOR'S DEGREE FROM AN ACCREDITED COLLEGE OR UNIVERSITY IN HUMAN RESOURCES, PSYCHOLOGY, BUSINESS ADMINISTRATION, JUDICIAL ADMINISTRATION, PUBLIC ADMINISTRATION, ENGLISH, JOURNALISM, PUBLIC RELATIONS, OR RELATED FIELD.EDUCATION SUBSTITUTION: FOUR (4) YEARS OF DIRECTLY RELATED OR RELEVANT EXPERIENCE MAY SUBSTITUTE ON A YEAR FOR YEAR BASIS.EXPERIENCE: FIVE (5) YEARS OF EXPERIENCE IN HUMAN RESOURCES, EMPLOYMENT LAW, CLASSIFICATION AND COMPENSATION, DISCIPLINE, TRAINING, INVESTIGATIONS, OR PROJECT MANAGEMENT.EXPERIENCE SUBSTITUTION: CURRENT PROFESSIONAL IN HUMAN RESOURCES (PHR) OR SENIOR PROFESSIONAL IN HUMAN RESOURCES (SPHR) CERTIFICATION MAY SUBSTITUTE FOR ONE (1) YEAR OF WORK EXPERIENCE. RELEVANT GRADUATE LEVEL EDUCATION MAY SUBSTITUTE AT A RATE OF THIRTY (30) SEMESTER HOURS’ EQUALS ONE (1) YEAR OF EXPERIENCE.TO APPLY: SUBMIT A NEW MEXICO JUDICIAL BRANCH APPLICATION FOR EMPLOYMENT, OR A RESUME AND A RESUME SUPPLEMENTAL FORM, AND PROOF OF EDUCATION TO:\n\nADMINISTRATIVE OFFICE OF THE COURTSATTN: AOC HUMAN RESOURCES DIVISION202 E. MARCY STREETSANTA FE, NEW MEXICO 87501FAX: 505-479-2641EMAIL: JOBS@NMCOURTS.GOV\nPROOF OF EDUCATION IS REQUIRED.\nAPPLICATIONS CAN BE EMAILED, FAXED, OR MAILED.\nEQUAL OPPORTUNITY EMPLOYER",
    "job_skill_set": [
      "project management",
      "human resources administration",
      "performance management",
      "recruitment",
      "interviewing techniques",
      "records management",
      "employment law",
      "classification and compensation",
      "employee relations",
      "mediation",
      "conflict resolution",
      "audit procedures",
      "training techniques",
      "investigative procedures",
      "communication",
      "teamwork",
      "problem solving",
      "organizational skills",
      "analytical skills",
      "leadership",
      "interpersonal skills",
      "adaptability",
      "attention to detail",
      "time management",
      "statistical data collection",
      "budget processes"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "analytical",
      "and",
      "aoc",
      "attention",
      "audit",
      "budget",
      "classification",
      "collection",
      "communication",
      "compensation",
      "conflict",
      "data",
      "detail",
      "employee",
      "employment",
      "hr",
      "human",
      "interpersonal",
      "interviewing",
      "investigative",
      "law",
      "leadership",
      "management",
      "manager",
      "mediation",
      "organizational",
      "performance",
      "problem",
      "procedures",
      "processes",
      "project",
      "records",
      "recruitment",
      "relations",
      "resolution",
      "resources",
      "skills",
      "solving",
      "statistical",
      "teamwork",
      "techniques",
      "time",
      "to",
      "training"
    ]
  },
  {
    "job_id": "3904084041",
    "job_title": "Human Resources Generalist",
    "category": "HR",
    "job_description": "THE IDEAL CANDIDATE WILL BE RESPONSIBLE FOR RECRUITMENT EFFORTS, NEW HIRE ORIENTATION AND ONBOARDING, EMPLOYEE TERMINATION, PAYROLL AND BENEFITS, COMPANY POLICY AND PROCEDURE ADHERENCE. IN ADDITION, YOU WILL BUILD STRONG RELATIONSHIPS WITH OUR COMPANY'S MANAGERS IN ORDER TO HELP THEM WITH THEIR HUMAN RESOURCE NEEDS.  RESPONSIBILITIESOVERSEE FULL-CYCLE OF RECRUITMENT EFFORTSDEVELOP AND OVERSEE NEW HIRE ORIENTATION, ONBOARDING EFFORTS AND EMPLOYEE TERMINATION PROCESSASSIST WITH PAYROLL AND BENEFITS ADMINISTRATIONENSURES COMPLIANCE WITH COMPANY POLICIES AND PROCEDURES AND LEGAL RESPONSIBILITIES\nQUALIFICATIONS\nBACHELOR'S DEGREE OR EQUIVALENT EXPERIENCE IN BUSINESS, HUMAN RESOURCES, OR RELATED AREA3+ YEARS' OF EXPERIENCE WORKING IN HUMAN RESOURCESSTRONG INTERPERSONAL AND COMMUNICATION SKILLS\nBENORE LOGISTIC SYSTEMS, INC. IS DEDICATED TO DEVELOPING AND IMPLEMENTING CUTTING-EDGE SUPPLY CHAIN SOLUTIONS THAT ENHANCE OUR CLIENTS' COMPETITIVE STANDING AND SURPASS THEIR EXPECTATIONS.\nESTABLISHED IN 1994 IN ERIE, MICHIGAN, BENORE LOGISTIC SYSTEMS, INC. REMAINS UNDER THE LEADERSHIP OF JEFFERY BENORE, SERVING AS CEO AND PRESIDENT, AND JOAN BENORE, HOLDING THE POSITION OF VICE PRESIDENT.\nAS WE APPROACH THREE DECADES OF OPERATION, OUR UNWAVERING COMMITMENT TO EXCELLENCE AND METICULOUS SERVICE HAS PROPELLED US INTO A COMPREHENSIVE SERVICE PROVIDER, OPTIMIZING SUPPLY CHAIN, TRANSPORTATION, WAREHOUSING, AND ON-SITE SERVICES ACROSS THE UNITED STATES.\nOUR CORE PRINCIPLE, ENCAPSULATED IN \"A PARTNERSHIP IN PERFORMANCE,\" UNDERSCORES OUR COMMITMENT TO DELIVERING WORLD-CLASS SERVICE TO OUR ESTEEMED CLIENTELE.\n“AT BENORE LOGISTIC SYSTEMS, INC., WE BELIEVE IN CHALLENGING THE STATUS QUO IN EVERYTHING WE DO. OUR ACTIONS ARE FOCUSED ON BECOMING A BETTER BUSINESS PARTNER TO OUR CUSTOMERS, AN EMPLOYER OF CHOICE, AND EXCEEDING TARGETS FOR SUSTAINABILITY AND SOCIAL RESPONSIBILITY.” – JEFFERY M. BENORE, PRESIDENT AND CEO",
    "job_skill_set": [
      "recruitment",
      "onboarding",
      "benefits administration",
      "compliance",
      "human resources management",
      "policy adherence",
      "interpersonal skills",
      "communication",
      "relationship building",
      "payroll administration"
    ],
    "short_keywords": [
      "adherence",
      "administration",
      "benefits",
      "building",
      "communication",
      "compliance",
      "generalist",
      "hr",
      "human",
      "interpersonal",
      "management",
      "onboarding",
      "payroll",
      "policy",
      "recruitment",
      "relationship",
      "resources",
      "skills"
    ]
  },
  {
    "job_id": "3904388397",
    "job_title": "Senior Human Resources Generalist - Oklahoma City, OK",
    "category": "HR",
    "job_description": "LOGISTICS AT FULL POTENTIAL. \n\nAT GXO, WE’RE CONSTANTLY LOOKING FOR TALENTED INDIVIDUALS AT ALL LEVELS WHO CAN DELIVER THE CALIBER OF SERVICE OUR COMPANY REQUIRES. YOU KNOW THAT A POSITIVE WORK ENVIRONMENT CREATES HAPPY EMPLOYEES, WHICH BOOSTS PRODUCTIVITY AND DEDICATION. ON OUR TEAM, YOU’LL HAVE THE SUPPORT TO EXCEL AT WORK AND THE RESOURCES TO BUILD A CAREER YOU CAN BE PROUD OF.\n\nAS THE SENIOR HUMAN RESOURCES GENERALIST, YOU’LL BE RESPONSIBLE FOR THE FULL SCOPE OF HUMAN RESOURCES (HR) ACTIVITIES, INCLUDING STAFFING, TRAINING AND DEVELOPMENT, COMPENSATION AND BENEFITS ADMINISTRATION, AND MAINTAINING A UNION-FREE WORK ENVIRONMENT. WE’LL LOOK TO YOU TO CHAMPION OUR VALUES, ENSURING A DIFFERENTIATED AND ENGAGED WORKFORCE. IF YOU’RE EXCITED ABOUT THE CHALLENGE OF WORKING FOR A RAPIDLY GROWING GLOBAL COMPANY, WE HAVE AN OPPORTUNITY FOR YOU AT GXO.\n\nPAY, BENEFITS AND MORE.\n\nWE ARE EAGER TO ATTRACT THE BEST, SO WE OFFER COMPETITIVE COMPENSATION AND A GENEROUS BENEFITS PACKAGE, INCLUDING FULL HEALTH INSURANCE (MEDICAL, DENTAL AND VISION), 401(K), LIFE INSURANCE, DISABILITY AND MORE.\n\nWHAT YOU’LL DO ON A TYPICAL DAY:\n\n\nWORK CLOSELY WITH THE OPERATIONS TEAM AND PROVIDE COUNSEL AND GUIDANCE REGARDING POLICIES, PROCEDURES AND STATE AND FEDERAL REGULATORY COMPLIANCE REQUIREMENTSKEEP MANAGEMENT AND OPERATIONS APPRISED OF INTERNAL AND EXTERNAL HR DEVELOPMENTS THAT MAY IMPACT OVERALL EFFECTIVENESSFACILITATE NEW HIRE ORIENTATION AND ENSURE A POSITIVE ONBOARDING EXPERIENCEASSIST SUPERVISORS WITH PERFORMANCE MANAGEMENT, INCLUDING DELIVERING DISCIPLINARY ACTION FOR HOURLY EMPLOYEESMAINTAIN PERSONNEL FILES AND TRAINING MATERIALS, ENSURING DOCUMENTS AND MANUALS ARE KEPT CURRENT, ACCURATE, CONFIDENTIAL AND IN COMPLIANCE WITH COMPANY POLICIES AND GOVERNMENT REGULATIONS \n\n\nWHAT YOU NEED TO SUCCEED AT GXO:\n\nAT A MINIMUM, YOU’LL NEED:\n\n\nBACHELOR’S DEGREE OR EQUIVALENT RELATED WORK OR MILITARY EXPERIENCE2 YEARS OF HR EXPERIENCE, INCLUDING COMPENSATION, HRIS ADMINISTRATION, HR MANAGEMENT, BENEFITS ADMINISTRATION, PAYROLL AND EMPLOYEE RELATIONSEXPERIENCE WORKING IN HRIS AND TIME/ATTENDANCE SYSTEMSEXPERIENCE WITH MICROSOFT OFFICE (WORD, EXCEL AND POWERPOINT)\n\n\nIT’D BE GREAT IF YOU ALSO HAVE:\n\n\nPROFESSIONAL HR CERTIFICATIONBILINGUAL ENGLISH/SPANISHEXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS; ABLE TO PRESENT CLEAN, ORGANIZED AND THOROUGH INFORMATION AND DATA APPROPRIATE FOR INTENDED AUDIENCE\n\n\nWE ENGINEER FASTER, LEANER, SMARTER SUPPLY CHAINS. \n\nGXO IS A LEADING PROVIDER OF CUTTING-EDGE SUPPLY CHAIN SOLUTIONS TO THE MOST SUCCESSFUL COMPANIES IN THE WORLD. WE HELP OUR CUSTOMERS MANAGE THEIR GOODS MOST EFFICIENTLY USING OUR TECHNOLOGY AND SERVICES. OUR GREATEST STRENGTH IS OUR GLOBAL TEAM – ENERGETIC, INNOVATIVE PEOPLE OF ALL EXPERIENCE LEVELS AND TALENTS WHO MAKE GXO A GREAT PLACE TO WORK.\n\nWE ARE PROUD TO BE AN EQUAL OPPORTUNITY/AFFIRMATIVE ACTION EMPLOYER. QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, SEX, DISABILITY, VETERAN OR OTHER PROTECTED STATUS.\n\nGXO ADHERES TO CDC, OSHA AND STATE AND LOCAL REQUIREMENTS REGARDING COVID SAFETY. ALL EMPLOYEES AND VISITORS ARE EXPECTED TO COMPLY WITH GXO POLICIES WHICH ARE IN PLACE TO SAFEGUARD OUR EMPLOYEES AND CUSTOMERS.\n\nALL APPLICANTS WHO RECEIVE A CONDITIONAL OFFER OF EMPLOYMENT MAY BE REQUIRED TO TAKE AND PASS A PRE-EMPLOYMENT DRUG TEST.\n\nTHE ABOVE STATEMENTS ARE INTENDED TO DESCRIBE THE GENERAL NATURE AND LEVEL OF WORK BEING PERFORMED BY PEOPLE ASSIGNED TO THIS CLASSIFICATION. THEY ARE NOT INTENDED TO BE CONSTRUED AS AN EXHAUSTIVE LIST OF ALL RESPONSIBILITIES, DUTIES AND SKILLS REQUIRED OF PERSONNEL SO CLASSIFIED. ALL EMPLOYEES MAY BE REQUIRED TO PERFORM DUTIES OUTSIDE OF THEIR NORMAL RESPONSIBILITIES FROM TIME TO TIME, AS NEEDED. REVIEW GXO'S CANDIDATE PRIVACY STATEMENT HERE.",
    "job_skill_set": [
      "Benefits Administration",
      "Microsoft Office",
      "Bilingual (English/Spanish)",
      "Communication",
      "Teamwork",
      "Problem Solving",
      "Organizational Skills",
      "Counseling and Guidance",
      "Onboarding",
      "HRIS Administration",
      "Compensation Management",
      "Payroll Management",
      "Union Management",
      "Performance Management"
    ],
    "short_keywords": [
      "administration",
      "and",
      "benefits",
      "bilingual",
      "city",
      "communication",
      "compensation",
      "counseling",
      "englishspanish",
      "generalist",
      "guidance",
      "hr",
      "hris",
      "human",
      "management",
      "microsoft",
      "office",
      "ok",
      "oklahoma",
      "onboarding",
      "organizational",
      "payroll",
      "performance",
      "problem",
      "resources",
      "senior",
      "skills",
      "solving",
      "teamwork",
      "union"
    ]
  },
  {
    "job_id": "3904930352",
    "job_title": "Senior Human Resources Manager",
    "category": "HR",
    "job_description": "SENIOR MANAGER HUMAN RESOURCES - LOS ANGELES, CALIFORNIA\nA LEADING MANUFACTURING COMPANY IN THE LOS ANGELES, CALIFORNIA AREA NEEDS A SENIOR MANAGER OF HUMAN RESOURCES. THIS IS A FULL TIME, PERMANENT, DIRECT HIRE POSITION OFFERING COMPETITIVE COMPENSATION, BONUS POTENTIAL, GOOD BENEFITS, PAID HOLIDAYS & PAID VACATION.\nRESPONSIBILITIES:\nWE ARE LOOKING FOR A SENIOR MANAGER, HUMAN RESOURCES WHO WILL BE A STRATEGIC PART OF THE HUMAN RESOURCES TEAM. IN THIS EXCITING OPPORTUNITY IN A FAST PACE MANUFACTURING ENVIRONMENT, YOU WILL UTILIZE YOUR EXTENSIVE EXPERIENCE IN HUMAN RESOURCES MANAGEMENT TO SIGNIFICANTLY IMPACT AND SUPPORT THE OPERATIONS LEADERSHIP TEAM. THE SENIOR MANAGER, HUMAN RESOURCES WILL SERVE AS A TRUSTED ADVISOR AND PARTNER TO BUSINESS LEADERS WITHIN THE ASSIGNED AREAS OF RESPONSIBILITY. THIS ROLE IS RESPONSIBLE FOR THE DELIVERY OF HUMAN RESOURCES SERVICES AND PROGRAMS AND MUST DEMONSTRATE WORKING KNOWLEDGE OF EMPLOYEE RELATIONS, COMPENSATION & BENEFITS, TALENT MANAGEMENT, RISK MANAGEMENT AND OTHER RECOGNIZED HUMAN RESOURCES COMPETENCIES.\n• PROVIDES FOR AND SERVES AS AN EFFECTIVE RESOURCE FOR EMPLOYEES TO ENSURE CLEAR COMMUNICATION AND ALIGNMENT TO COMPANY EMPLOYEE RELATIONS GOALS AND INITIATIVES.• PROVIDE CONSULTATION TO BUSINESS LEADERS & EMPLOYEES ON ASPECTS OF HUMAN RESOURCES PROGRAMS & POLICY.• BUILDS RELATIONSHIPS WITH BUSINESS LEADERS, MANAGERS, AND THE HR TEAM TO HELP DRIVE SUCCESSFUL PEOPLE STRATEGIES AND PROGRAMS.• IDENTIFIES KEY TRAINING NEEDS AND DEVELOPS PROJECT PLANS AND TIMELINES FOR DESIGN AND DELIVERY OF TRAINING.• IDENTIFIES OPPORTUNITIES AND RECOMMENDS/DRIVES CHANGE MANAGEMENT STRATEGIES TO INCREASE PERFORMANCE, REDUCE COST, AND POSITIVELY IMPACT BOTH HR AND THE BUSINESS.• SUPPORTS THE PERFORMANCE MANAGEMENT PROGRAM FOR THE ORGANIZATION TO AID LEADERSHIP WITH GOAL DEPLOYMENT AND CASCADING ORGANIZATIONAL GOALS THROUGHOUT THE EMPLOYEE BASE.• COACH MANAGERS ON THE CREATION AND MANAGEMENT OF INDIVIDUAL DEVELOPMENT PLAN’S FOR EMPLOYEES.• PARTNERS WITH KEY LEADERS TO PERFORM RECRUITING AND TALENT ACQUISITION DUTIES.\nQUALIFICATIONS:\n• BACHELOR'S DEGREE IN BUSINESS, HUMAN RESOURCES OR RELATED FIELD OR EQUIVALENT PRACTICAL EXPERIENCE.• 10+ YEARS’ EXPERIENCE IN HUMAN RESOURCES.• 3+ YEARS’ EXPERIENCE WITHIN A MANUFACTURING ENVIRONMENT.• 3+ YEARS LEADING A TEAM WITH DIRECT REPORTS.• FLUENT IN SPANISH IS REQUIRED• A MASTER’S DEGREE IS PREFERRED.• WORKING KNOWLEDGE OF EMPLOYMENT & LABOR LAW (WITH FOCUS IN CALIFORNIA), BENEFITS PROGRAMS AND THE RESPECTIVE LAWS THAT APPLY.• STRONG INTERPERSONAL AND NEGOTIATION SKILLS, WITH THE ABILITY TO ESTABLISH AND MAINTAIN EFFECTIVE WORKING RELATIONSHIP WITH INDIVIDUALS AT ALL LEVELS WITHIN THE ORGANIZATION.• ADVANCED SKILLS IN MICROSOFT OFFICE SUITE (EXCEL, POWERPOINT, WORD, AND OUTLOOK).\nTO APPLY:\nIF YOU ARE A HIGH PERFORMER AND WOULD LIKE TO WORK FOR AN EQUALLY HIGH PERFORMING COMPANY AND YOU THINK THE ABOVE OPPORTUNITY IS APPROPRIATE FOR YOU, WE INVITE YOU TO SUBMIT YOUR RESUME IN MICROSOFT WORD FORMAT TO: ABARRY@VENTEON.COM",
    "job_skill_set": [
      "human resources management",
      "employee relations",
      "compensation & benefits",
      "talent management",
      "training development",
      "recruiting",
      "labor law",
      "Microsoft Office Suite",
      "interpersonal skills",
      "negotiation skills",
      "communication",
      "relationship building",
      "strategic thinking",
      "coaching",
      "team leadership",
      "risk management",
      "change management",
      "Spanish fluency"
    ],
    "short_keywords": [
      "benefits",
      "building",
      "change",
      "coaching",
      "communication",
      "compensation",
      "development",
      "employee",
      "fluency",
      "hr",
      "human",
      "interpersonal",
      "labor",
      "law",
      "leadership",
      "management",
      "manager",
      "microsoft",
      "negotiation",
      "office",
      "recruiting",
      "relations",
      "relationship",
      "resources",
      "risk",
      "senior",
      "skills",
      "spanish",
      "strategic",
      "suite",
      "talent",
      "team",
      "thinking",
      "training"
    ]
  },
  {
    "job_id": "3904967523",
    "job_title": "Regional Human Resources Generalist",
    "category": "HR",
    "job_description": "JOB DESCRIPTION:OUR REGIONAL HUMAN RESOURCE GENERALISTS ARE SUBJECT MATTER EXPERTS THAT ACT AS BUSINESS PARTNERS TO THEIR REGIONAL TEAMS. THEY LEAD THE EMPLOYEE RELATIONS EFFORTS FOR THEIR REGIONS WHILE MAXIMIZING ASSOCIATE PRODUCTIVITY THROUGH THE OPTIMIZATION OF TALENT. OUR HUMAN RESOURCES GENERALISTS PLAN AND PRIORITIZE TO PROVIDE OPTIMAL SUPPORT TO THEIR PORTFOLIO OF STORES. THEY THRIVE ON MAINTAINING A WORK ENVIRONMENT THAT IS REPRESENTATIVE OF OUR CORE PRINCIPLES AND THAT ALLOWS OUR HIGH PERFORMANCE TEAMS TO EXECUTE WITH EXCELLENCE.\nRESPONSIBILITIES\nPROFIT MAXIMIZATIONMITIGATE RISK AND MAXIMIZE PRODUCTIVITY THROUGH COLLABORATION WITH BUSINESS PARTNERSCOMPILE AND ANALYZE REPORTS AND DATA TO IDENTIFY TRENDS AND MAKE RECOMMENDATIONSIDENTIFY OPPORTUNITIES AND COLLABORATE WITH BUSINESS PARTNERS TO DRIVE CONTINUOUS IMPROVEMENT OPERATIONAL EXECUTIONSUPPORT THE EFFECTIVE ROLLOUT OF HUMAN RESOURCES INITIATIVES.ACT AS A SUBJECT MATTER EXPERT IN COMPANY POLICIES, PROGRAMS AND OPERATIONAL PROCESSES AND THEIR IMPACT ON THE BUSINESSLEAD EMPLOYEE RELATIONS EFFORTSCONDUCT INVESTIGATIONS AND PROVIDE OBJECTIVE, QUALITY GUIDANCE AND RESOLUTIONENSURE COMPLIANCE WITH FEDERAL, STATE AND LOCAL EMPLOYMENT LAWSADDRESS AND RESOLVE EMPLOYEE ISSUES AND/OR CONCERNS ACROSS ALL LEVELSTALENT OPTIMIZATIONSUPPORT RECRUITING STRATEGIES IN EFFORT TO ATTRACT TOP TALENTSUPPORT THE DEVELOPMENT, RETENTION AND PROMOTION OF HIGH PERFORMING TEAMS.SUPPORT THE PERFORMANCE MANAGEMENT PROCESSPROMOTE ORGANIZATIONAL INITIATIVES AND ALIGN TEAM WITH VISION AND PURPOSECUSTOMER EXPERIENCEBUILD RELATIONSHIPS WITH FIELD AND CORPORATE PARTNERSPROVIDE QUALITY DECISION-MAKING THAT ADHERES TO OUR CORE PRINCIPLESSUPPORT REGIONAL ENGAGEMENT STRATEGYPROMOTE A CULTURE OF SAFE AND SECURE STORESCONDUCTS TARGETED AND PURPOSEFUL STORE VISITS\nSUCCESS DRIVERS\nDRIVE FOR RESULTSUSES DATA TO SET PRIORITIES AND TRANSLATES GOALS INTO ACTION PLANSCONSISTENTLY PUSHES SELF AND OTHERS FOR RESULTS; ELIMINATES ROADBLOCKSMANAGES INTERNAL AND EXTERNAL COMMUNICATIONSBUILDING HIGH PERFORMANCE TEAMSSUPPORTS THE ACQUISITION AND RETENTION OF THE RIGHT TALENTTRAINS, COACHES AND PROVIDES FEEDBACKSUPPORTS THE DEVELOPMENT OF TEAMS AND POSITIONING THEM FOR GROWTHCUSTOMER FOCUSACTS WITH CUSTOMERS IN MINDUNDERSTANDS AND TEACHES HOW OPERATIONAL EXECUTION DIRECTLY AFFECTS THE CUSTOMER EXPERIENCEIS DEDICATED TO MEETING THE EXPECTATIONS AND REQUIREMENTS OF INTERNAL AND EXTERNAL CUSTOMERSMANAGING VISION AND PURPOSEMAKES THE COMPANY VISION SHARABLE BY EVERYONECAN INSPIRE AND MOTIVATE ENTIRE UNITSIS FORWARD-LOOKING AND TALKS BEYOND TODAYINTERPERSONAL SAVVYRELATES WELL TO ALL KINDS OF PEOPLE INSIDE AND OUTSIDE OF THE ORGANIZATIONBUILDS CONSTRUCTIVE AND EFFECTIVE RELATIONSHIPSBUILDS APPROPRIATE RAPPORTPLANNING AND PRIORITY SETTINGQUICKLY ZEROS IN ON THE CRITICAL FEW AND PUTS THE TRIVIAL MANY ASIDESPENDS TIME AND THE TIME OF OTHERS ON WHAT IS IMPORTANTSETS OBJECTIVES AND GOALS AND TRANSLATES INTO CONCRETE STEPS FOR ACTION\nQUALIFICATIONS\nEXPERIENCEMINIMUM OF FIVE YEARS’ EXPERIENCE IN HUMAN RESOURCES AND MULTI-UNIT LEADERSHIPEDUCATIONBACHELORS/ASSOCIATES DEGREE PREFERRED OR HIGH SCHOOL GRADUATE/EQUIVALENT, HR CERTIFICATION PREFERRED.PHYSICAL REQUIREMENTSABILITY TO COMMUNICATE WITH CUSTOMERS AND ASSOCIATES. REQUIRES UP TO 40% TRAVEL OVER A LARGE GEOGRAPHICAL AREA AND STANDING AND MOVING FOR AN ENTIRE SHIFT.AVAILABILITYABILITY TO WORK A FLEXIBLE SCHEDULE, INCLUDING EVENINGS, OVERNIGHT SHIFTS AND WEEKENDS AS NECESSARY TO MEET THE NEEDS OF THE BUSINESS. REGULAR TRAVEL IS REQUIRED. REGULAR ATTENDANCE IS AN ESSENTIAL FUNCTION OF THE JOB.ADDITIONAL REQUIREMENTENSURES COMPLIANCE WITH ALL POLICIES, PROCEDURES AND LAWS\nTHE ANTICIPATED SALARY RANGE FOR THIS POSITION IS $78,200 – $117,200 DEPENDING ON LOCATION, KNOWLEDGE, SKILLS, EDUCATION AND EXPERIENCE. THIS POSITION IS ALSO ELIGIBLE FOR AN ANNUAL DISCRETIONARY BONUS. IN ADDITION, WE OFFER COMPREHENSIVE AND COMPETITIVE BENEFITS TO ASSOCIATES (AND THEIR FAMILIES) SUCH AS MEDICAL, DENTAL, VISION, LIFE INSURANCE, SHORT-TERM AND LONG-TERM DISABILITY. ELIGIBLE ASSOCIATES ARE ABLE TO ENROLL IN OUR COMPANY’S 401K PLAN. ASSOCIATES WILL ACCRUE PAID TIME OFF UP TO 236 HOURS PER YEAR (INCLUSIVE OF PTO, FLOATING HOLIDAYS, AND PAID HOLIDAYS). PAID SICK TIME UP TO 80 HOURS PER YEAR UNLESS OTHERWISE REQUIRED BY LAW.\nABOUT HARBOR FREIGHT TOOLS\nWE’RE A FAMILY-OWNED BUSINESS WITH OVER 45 YEARS AS A NATIONAL TOOL RETAILER, AND WITH THE ENERGY, ENTHUSIASM, AND GROWTH POTENTIAL OF A START-UP. WE ARE A $7 BILLION COMPANY WITH OVER 1,450 STORES IN 48 STATES, 27,000+ ASSOCIATES, AND ONE OF THE FASTEST-GROWING RETAILERS IN THE COUNTRY.",
    "job_skill_set": [
      "employee relations",
      "data analysis",
      "compliance",
      "recruiting strategies",
      "performance management",
      "operational execution",
      "communication",
      "teamwork",
      "problem solving",
      "interpersonal skills",
      "planning and prioritization",
      "customer focus",
      "leadership",
      "flexibility",
      "HR certification",
      "multi-unit leadership"
    ],
    "short_keywords": [
      "analysis",
      "and",
      "certification",
      "communication",
      "compliance",
      "customer",
      "data",
      "employee",
      "execution",
      "flexibility",
      "focus",
      "generalist",
      "hr",
      "human",
      "interpersonal",
      "leadership",
      "management",
      "multiunit",
      "operational",
      "performance",
      "planning",
      "prioritization",
      "problem",
      "recruiting",
      "regional",
      "relations",
      "resources",
      "skills",
      "solving",
      "strategies",
      "teamwork"
    ]
  },
  {
    "job_id": "3899534687",
    "job_title": "Human Resources Analyst",
    "category": "HR",
    "job_description": "TITLE: HR ANALYSTLOCATION: REMOTEDURATION : 12-MONTHS\nDESIRED SKILLS:· KNOWLEDGE OF VISIO· GLOBAL PAYROLL EXPERIENCE, ORACLE, WORKFORCE NOW· GLOBAL HR EXPERIENCE\nPOSITION DESCRIPTION: THE HUMAN RESOURCES ANALYST PERFORMS DIVERSE AND CONFIDENTIAL ADMINISTRATIVE SUPPORT FUNCTIONS FOR THE GLOBAL HUMAN RESOURCES DEPARTMENT INCLUDING COMPOSING, SIGNING, AND RELEASING ROUTINE CORRESPONDENCE. USUALLY RELIEVES MANAGEMENT OF ADMINISTRATIVE DETAILS; GATHERS, COMPILES AND REPORTS INFORMATION RELEVANT FOR THE HUMAN RESOURCES DEPARTMENT; MAY MANAGE A NUMBER OF DIFFERENT AND OFTEN CONFLICTING OBJECTIVES, PROJECTS OR ACTIVITIES AT ONE TIME. COMMUNICATES WITH MANAGEMENT TO GATHER OR CONVEY RELEVANT INFORMATION. MAY BE INVOLVED WITH EXPOSURE TO SENSITIVE INFORMATION AND MUST USE CONSIDERABLE TACT, DIPLOMACY AND JUDGMENT. ADVANCED ADMINISTRATIVE AND ANALYTICAL SKILLS ALONG WITH THOROUGH KNOWLEDGE OF A VARIETY OF SOFTWARE PROGRAMS ARE NEEDED.\nREQUIRED SKILLS:· A MINIMUM OF 3-5 YEARS’ WORK EXPERIENCE IN AN ADMINISTRATIVE AND/OR HR ROLE· KNOWLEDGE OF BASIC US HUMAN RESOURCES POLICIES / PROCEDURES· ABILITY TO HANDLE SENSITIVE AND PRIVATE INFORMATION WITH COMPLETE CONFIDENTIALITY AND TACT· STRONG WRITTEN AND VERBAL SKILLS· RELIABLE, DETAIL-ORIENTED AND ORGANIZED· EXCELLENT CUSTOMER SERVICE SKILLS AND FOLLOW-UP WITH A SENSE OF URGENCY· STRONG MICROSOFT OFFICE APPLICATIONS EXPERIENCE, INCLUDING WORD, EXCEL, OUTLOOK AND POWERPOINT· KNOWLEDGE OF ADOBE ACROBAT· ABILITY TO WORK INDEPENDENTLY, WITH MINIMAL SUPERVISION· ABILITY TO PRIORITIZE AND MULTI-TASK· WILLING AND ABLE TO COMPLETE ASSIGNED TASKS WITHIN GIVEN TIMEFRAMES\nRESPONSIBILITIES:· ACCESS ONBASE TO COMPLETE ASSOCIATE UPDATES AND CHANGES · PRODUCE AND PROCESS ON BOARDING DOCUMENTS/PAPERWORK· MAINTAIN EMPLOYEE FILES AND VARIOUS SPREADSHEETS RELATING TO ASSOCIATES·  PROCESS NEW HIRES/TERMINATIONS/CHANGES/TRANSFERS/PROMOTIONS FOR HR AND IN ONBASE· GLOBAL RECRUITING, POST REQUISITIONS AND REVIEW ONLINE JOB POSTINGS / UPDATE REQUISITION SPREADSHEET / SCREEN AND FORWARD RESUMES TO OVERSEAS HR AND/OR HIRING MANAGERS· WEEKLY UPDATES TO HR MANAGER REGARDING TURNOVER AND CURRENT OPEN / CLOSED REQUISITIONS, UPDATE NUMBERS FOR WEEKLY REPORTS TO SENIOR LEADERSHIP TEAM· FORWARD JOB NOTICES AS NEEDED TO HOME OFFICE FOR OPEN POSITIONS· TRACK AND MANAGE HOME OFFICE INTERVIEW SCHEDULES/DOCUMENTATION· ARCHIVE HR DOCUMENTS AND FOLDERS· UPDATE HR PROCESS, PROCEDURES AND POLICIES· APPROVE AND TRACK OVERSEAS LEAVE OF ABSENCE REQUESTS· ASSIST WITH PREPARATION AND REVIEW OF UPDATED OVERSEAS HANDBOOKS / FORMS ETC.\n* HOURS: 40 HOURS CAN BE ANYWHERE BETWEEN 7:30 AM TO 5:30 PM- ONCE TRAINED, THE CONTRACTOR WILL BE ABLE TO WORK FROM HOME WEDNESDAY THROUGH FRIDAY DEPENDING ON BUSINESS NEEDS. UNTIL TRAINED, CONTRACTORS WILL NEED TO WORK IN THE OFFICE MONDAY THROUGH FRIDAY.\nSHAIK MEERAVALITEAM LEADINTERON IT SOLUTIONS LLC | AN E-VERIFIED COMPANYINTERONITSOLUTIONS.COMSHAIK.M@INTERONITSOLUTIONS.COM 4211 PLEASANT VALLEY ROAD #200, CHANTILLY VA 20151CONNECT ME ON LINKEDIN: HTTPS://WWW.LINKEDIN.COM/IN/MEERAVALI-SHAIK-683151179/",
    "job_skill_set": [
      "Global Payroll Experience",
      "Global HR Experience",
      "Microsoft Office (Word, Excel, Outlook, PowerPoint)",
      "OnBase",
      "HR Policies/Procedures",
      "Confidentiality",
      "Communication",
      "Detail-oriented",
      "Organizational Skills",
      "Customer Service",
      "Independence",
      "Prioritization",
      "Multi-tasking",
      "Time Management",
      "Tact and Diplomacy",
      "Analytical Skills",
      "Visio",
      "Oracle",
      "Workforce Now",
      "Adobe Acrobat"
    ],
    "short_keywords": [
      "acrobat",
      "adobe",
      "analyst",
      "analytical",
      "and",
      "communication",
      "confidentiality",
      "customer",
      "detailoriented",
      "diplomacy",
      "excel",
      "experience",
      "global",
      "hr",
      "human",
      "independence",
      "management",
      "microsoft",
      "multitasking",
      "now",
      "office",
      "onbase",
      "oracle",
      "organizational",
      "outlook",
      "payroll",
      "policiesprocedures",
      "powerpoint",
      "prioritization",
      "resources",
      "service",
      "skills",
      "tact",
      "time",
      "visio",
      "word",
      "workforce"
    ]
  },
  {
    "job_id": "3894554212",
    "job_title": "Human Resources Manager ",
    "category": "HR",
    "job_description": "ORGANIZATION- THOMPSON CENTRAL PARK NEW YORK\n\nSUMMARY\n\nAT HYATT, WE BELIEVE OUR GUESTS SELECT HYATT BECAUSE OF OUR CARING AND ATTENTIVE ASSOCIATES WHO ARE FOCUSED ON PROVIDING EFFICIENT SERVICE AND MEANINGFUL EXPERIENCES.\n\nTHE IDEAL CANDIDATE FOR THE HUMAN RESOURCE MANAGER POSITION SHOULD POSSESS EXTENSIVE EXPERIENCE ACROSS ALL FACETS OF HR OPERATIONS. KEY RESPONSIBILITIES ENCOMPASS COMPENSATION MANAGEMENT, RECRUITMENT AND RETENTION STRATEGIES, EMPLOYEE/LABOR RELATIONS, COUNSELING, SAFETY PROTOCOLS, AND TRAINING/DEVELOPMENT INITIATIVES. REPORTING DIRECTLY TO THE DIRECTOR OF HUMAN RESOURCES, THE ROLE INVOLVES DEVELOPING AND FACILITATING TRAINING SESSIONS TO FOSTER STAFF GROWTH, OVERSEEING THE NEW HIRE TRAINING PROGRAM, AND ADMINISTERING COLLEAGUE RECOGNITION PROGRAMS.\n\nHYATT ASSOCIATES WORK IN AN ENVIRONMENT THAT DEMANDS EXCEPTIONAL PERFORMANCE YET REAPS GREAT REWARDS. WHETHER IT'S CAREER OPPORTUNITIES, JOB ENRICHMENT OR A SUPPORTIVE WORK ENVIRONMENT, IF YOU ARE READY FOR THIS CHALLENGE, THEN WE ARE READY FOR YOU.\n\nJOB FUNCTIONS\n\n RESPONSIBLE FOR ALL RECRUITMENT AND EMPLOYMENT EFFORTS FOR THOMPSON CENTRAL PARK NEW YORK. REVIEWS REQUIREMENTS OF PERSONNEL REQUISITION FORMS, SOURCES APPROPRIATE CANDIDATES, SCHEDULES INTERVIEWS, AND CONDUCTS PRELIMINARY INTERVIEWS FOR ALL OPEN POSITIONS.CONSULTS WITH DEPARTMENT MANAGERS TO DETERMINE APPLICANT PROFILES AND ESTABLISH ACCEPTABLE SELECTION CRITERIA.COORDINATES INTERNAL TRANSFER/PROMOTION PROGRAM; INTERVIEWS ALL CANDIDATES AND FOLLOWS UP ACCORDINGLY.MAINTAINS AND RECONCILES REHIRE LIST, IN HOUSE TRANSFER REQUESTS, AND JOB POSTING LISTS.PROCESSES REFERENCE CHECKS AND BACKGROUND TEST ON ALL FINAL CANDIDATES AS NECESSARY.PREPARES AND PRESENTS NEW COLLEAGUE ORIENTATION AND OTHER TRAINING PROGRAMS.MONITOR DEPARTMENT ON-GOING TRAINING. MEET WITH 2 – 3 DEPARTMENTS PER MONTH TO MONITOR TRAINING AND SPOT-CHECKING, ASSIST WITH TRAINING QUESTIONS, PROJECTS, CONCERNS, ETC.CONDUCTS EXIT INTERVIEWS.ASSISTS WITH COLLEAGUE CAREER PROGRESSION PLANNING.ASSIST THE HUMAN RESOURCES DIRECTOR IN THE DEVELOPMENT OF ANNUAL BUDGETS.ATTENDS REQUIRED HOTEL MEETINGS TO KEEP ABREAST OF IN-HOUSE ACTIVITIES.ASSISTS WITH ALL COLLEAGUE EVENTS.COUNSELS’ COLLEAGUES, RESOLVES COMPLAINTS AND CONDUCTS INVESTIGATIONS, AS NECESSARY.OVERSEE TEAM MEMBER RECOGNITION PROGRAM.ASSIST WITH ALL COLLEAGUE RELATED SOCIAL EVENTS.INTERACT WITH ALL LEVELS OF STAFF, RANGING FROM HOURLY COLLEAGUES TO EXECUTIVES.PARTICIPATE WITH MANAGEMENT IN ANALYZING AND ADDRESSING COLLEAGUE SURVEY, GUEST SURVEY AND SHOPPER REPORTS, AS APPROPRIATE. PARTICIPATE IN RECOGNIZING SUCCESS AND ADDRESSING NEEDS.EVALUATES MONTHLY/QUARTERLY/ANNUAL HR INDICATORS FOR AREAS OF RESPONSIBILITY AS INDICATED ABOVEENSURES COMPLIANCE WITH FEDERAL, STATE, CITY LAWS, AND COLLECTIVE BARGAINING AGREEMENT, INCLUDING BUT NOT LIMITED TO ADA, EEO, ETC.PROVIDES COACHING AND COUNSELING ASSISTANCE TO ALL COLLEAGUES AS REQUIRED.DEVELOPS, SUPPORTS, AND PARTICIPATES IN ALL COLLEAGUE RELATIONS INITIATIVES, INCLUDING BUT NOT LIMITED TO CELEBRATIONS, CAFETERIA POSTINGS, RECOGNITION PROGRAMS, AND COLLEAGUE EVENTS.\n\nQUALIFICATIONS\n\nQUALIFICATIONS:\n\n2-4 YEARS OF PROGRESSIVE RESPONSIBILITY, EXPERIENCE, AND TRAINING IN HUMAN RESOURCES.COLLEGE DEGREE WITH A CONCENTRATION IN HUMAN RESOURCES, MANAGEMENT, OR BUSINESS.EXPERIENCE WORKING/MANAGING IN A CULTURALLY DIVERSE ENVIRONMENT.ADVANCED TRAINING OR EDUCATION IN HUMAN RESOURCES.\n\nDESIRABLE: \n\nEXPERIENCE IN HOTEL OPERATIONS/ KNOWLEDGE OF HOTEL ENVIRONMENT.UNION LOCAL 6 EXPERIENCE.\n\n KNOWLEDGE, SKILLS, & ABILITIES ESSENTIAL: \n\nKNOWLEDGE OF APPLICABLE HR LAWS DEMONSTRATED INTERVIEWING SKILLS AND MANAGERIAL EXPERTISE.SENSITIVITY, EMPATHY, AND RESPONSIVENESS TO COLLEAGUE NEEDS AND CONCERNSDEMONSTRATED ABILITY TO USE GOOD JUDGMENT.STRONG ORGANIZATIONAL SKILLSDEMONSTRATED INITIATIVE, ATTENTION TO DETAIL AND FOLLOW THROUGH.ABILITY TO ANALYZE DATA, CURRENT TRENDS, AND PRACTICES. COMPLIES WITH HOTEL STANDARDS, POLICIES, AND RULES \n\nDESIRABLE: \n\nKNOWLEDGE OF HRIS PROFICIENCY IN MS OFFICE APPLICATIONS (WORD, EXCEL, POWERPOINT, ACCESS)PROFICIENCY IN SPANISH\n\nSALARY RANGE - $79,000 - $85,000 ANNUALLY",
    "job_skill_set": [
      "HR operations",
      "compensation management",
      "recruitment",
      "employee relations",
      "safety protocols",
      "training and development",
      "HR laws knowledge",
      "HRIS",
      "communication",
      "empathy",
      "organizational skills",
      "initiative",
      "attention to detail",
      "judgment",
      "teamwork",
      "problem solving",
      "interviewing skills",
      "MS Office",
      "data analysis",
      "bilingual (Spanish)"
    ],
    "short_keywords": [
      "analysis",
      "and",
      "attention",
      "bilingual",
      "communication",
      "compensation",
      "data",
      "detail",
      "development",
      "empathy",
      "employee",
      "hr",
      "hris",
      "human",
      "initiative",
      "interviewing",
      "judgment",
      "knowledge",
      "laws",
      "management",
      "manager",
      "ms",
      "office",
      "operations",
      "organizational",
      "problem",
      "protocols",
      "recruitment",
      "relations",
      "resources",
      "safety",
      "skills",
      "solving",
      "spanish",
      "teamwork",
      "to",
      "training"
    ]
  },
  {
    "job_id": "3902845594",
    "job_title": "Human Resources Generalist",
    "category": "HR",
    "job_description": "EASTERN METAL FRAMING OF NEW JERSEY IS LOOKING FOR A MOTIVATED AND RELIABLE HR GENERALIST TO SUPPORT THE NJ OPERATIONS. THIS ROLE WILL REPORT TO THE HUMAN RESOURCES MANAGER. THIS CANDIDATE WILL BE FOCUSED ON EMPLOYEE RELATIONS, RECRUITMENT AND HR GENERALIST DUTIES AS NEEDED.ESSENTIAL DUTIES & RESPONSIBILITIESHR GENERALISTRESPONSIBILITIES: SUPPORT THE HUMAN RESOURCES DEPARTMENT IN EMPLOYEE RELATIONS AND PROVIDE GENERAL HR SUPPORT TO NJ LOCATION.DEVELOPS A POSITIVE RELATIONSHIP WITH TEAM MEMBERS AT ALL LEVELS ENSURING ABILITY TO PROVIDE CREATIVE HR SOLUTIONS.BUILDS A REPUTATION AS A NEUTRAL AND APPROACHABLE HUMAN RESOURCE PROFESSIONAL.MEET WITH NEW HIRES ON 1ST DAY OF EMPLOYMENT, AFTER THE INITIAL ONLINE ONBOARDING.HANDLES EMPLOYEE RELATIONS ISSUES AND MAKES RECOMMENDATIONS TO RESOLVE CONCERNS AND/OR IMPROVE MORALE. MAINTAIN POSITIVE RELATIONSHIPS BETWEEN EMPLOYEES AND THE ORGANIZATION. PROMPTLY RESPONDS TO ALL REQUESTS RELATING TO UNEMPLOYMENT AND STD. PROVIDE SUPPORT TO EMPLOYEES IN VARIOUS HR-RELATED TOPICS SUCH AS LEAVES, BENEFITS, AND OTHER EMPLOYEE RELATED EMPLOYEE INQUIRIES.CONDUCT AND ANALYZE EXIT INTERVIEWS AND MAKE ACTIONABLE RECOMMENDATIONS BASED ON DATA.MAINTAINS THE HIGHEST LEVEL OF CONFIDENTIALITY AND SENSITIVITY TO ALL HR RELATED MATTERS AND INFORMATION.PERFORM ADDITIONAL HR GENERALIST DUTIES AS NEEDED AND ASSIGNED.RECRUITMENTREVIEW JOB DETAILS AND PREPARE POSTINGS; IN COORDINATION WITH HIRING MANAGER DETERMINE RECRUITMENT STRATEGY INCLUDING PRE-SCREENING QUESTIONS, AND WHERE ADVERTISING WOULD OCCUR TO PROVIDE DIVERSE APPLICANT POOL.SOURCE AND RECRUIT CANDIDATES BY USING DATABASES, SOCIAL MEDIA, NETWORKING, AND ONLINE TOOLS.PROVIDE INITIAL SCREENING OF APPLICANT POOLS, AS WELL AS PHONE SCREENS OR INTERVIEWS WHERE APPLICABLE.\nQUALIFICATIONSBACHELOR'S DEGREE OR EQUIVALENT EXPERIENCE IN BUSINESS, HUMAN RESOURCES, OR RELATED AREA3+ YEARS' OF EXPERIENCE WORKING IN HUMAN RESOURCESSTRONG INTERPERSONAL AND COMMUNICATION SKILLSBILINGUAL (SPANISH) A PLUS.",
    "job_skill_set": [
      "employee relations",
      "recruitment",
      "HR generalist duties",
      "screening",
      "interpersonal skills",
      "communication",
      "problem solving",
      "creativity",
      "approachability",
      "relationship building",
      "adaptability",
      "confidentiality",
      "data analysis",
      "bilingual (Spanish)",
      "job postings"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "approachability",
      "bilingual",
      "building",
      "communication",
      "confidentiality",
      "creativity",
      "data",
      "duties",
      "employee",
      "generalist",
      "hr",
      "human",
      "interpersonal",
      "job",
      "postings",
      "problem",
      "recruitment",
      "relations",
      "relationship",
      "resources",
      "screening",
      "skills",
      "solving",
      "spanish"
    ]
  },
  {
    "job_id": "3906223649",
    "job_title": "Senior Human Resources Business Partner",
    "category": "HR",
    "job_description": "JOB TYPE\n\nFULL-TIME\n\nDESCRIPTION\n\nPAYLOCITY IS AN AWARD-WINNING PROVIDER OF CLOUD-BASED HR AND PAYROLL SOFTWARE SOLUTIONS, OFFERING THE MOST COMPLETE PLATFORM FOR THE MODERN WORKFORCE. THE COMPANY HAS BECOME ONE OF THE FASTEST-GROWING HCM SOFTWARE PROVIDERS WORLDWIDE BY OFFERING AN INTUITIVE, EASY-TO-USE PRODUCT SUITE THAT HELPS BUSINESSES AUTOMATE AND STREAMLINE HR AND PAYROLL PROCESSES, ATTRACT AND RETAIN TALENT, AND BUILD A STRONG WORKPLACE CULTURE.\n\nWHILE TRADITIONAL HR AND PAYROLL PROVIDERS AUTOMATE BASIC HR PROCESSES SUCH AS PAYROLL AND BENEFITS ADMINISTRATION, PAYLOCITY GOES FURTHER BY DEVELOPING TOOLS THAT HR AND BUSINESSES NEED TO COMPETE FOR TALENT AND DELIVER AGAINST THE EXPECTATIONS OF THE MODERN WORKFORCE.\n\nWE GIVE OUR EMPLOYEES WHAT THEY NEED TO SUCCEED, INCLUDING GREAT BENEFITS AND PERKS! WE OFFER MEDICAL, DENTAL, VISION, LIFE, DISABILITY, AND A 401(K) MATCH, AS WELL AS PERKS THAT SUPPORT YOU, YOUR FAMILY, AND YOUR FINANCES. AND IF IT’S CAREER DEVELOPMENT YOU DESIRE, WE PROVIDE THAT, TOO! AT PAYLOCITY, PEOPLE MATTER MOST AND HAVE ALWAYS BEEN AT THE HEART OF OUR BUSINESS.\n\nTHERE ARE JOBS AND THEN THERE ARE CAREERS. SINCE 1997, PAYLOCITY HAS BEEN HIRING TALENTED PEOPLE, GIVING THEM BIG CHALLENGES, AND PROVIDING THE RIGHT RESOURCES TO HELP THEM SUCCEED. OUR AWARD-WINNING CULTURE ENSURES ALL EMPLOYEES FEEL TRULY WELCOME, APPRECIATED, AND FREE TO BE THEMSELVES. WHILE OTHER COMPANIES TALK ABOUT IT, WE MAKE IT HAPPEN. JOIN PAYLOCITY AND LAUNCH YOUR CAREER!\n\nPOSITION OVERVIEW\n\nTHE SENIOR HUMAN RESOURCES BUSINESS PARTNER WILL STRATEGICALLY COACH AND CONSULT WITH THE PRODUCT AND TECHNOLOGY BUSINESS UNIT LEADERSHIP TO FIND THE MOST EFFECTIVE ADDRESS BUSINESS NEEDS. THIS INDIVIDUAL WILL BE RESPONSIBLE FOR DEPLOYMENT OF HR PROGRAMS AND WILL SERVE AS A CONSULTANT TO ALL LEVELS WITHIN THE ORGANIZATION, SERVING AS A BUSINESS AND EMPLOYEE ADVOCATE.\n\nTHE SR. HR BUSINESS PARTNER WILL WORK DIRECTLY WITH DIRECTOR AND VP LEVEL LEADERSHIP REGARDING CHANGE INITIATIVES, PERFORMANCE DECISIONS/ACTIONS, TALENT MANAGEMENT AND DEVELOPMENT, RETENTION AND ENGAGEMENT, EMPLOYEE COMMUNICATION, DIVERSITY AND VARIOUS OTHER HR PROGRAMS IN SUPPORT OF ACHIEVING BUSINESS GOALS.\n\nPRIMARY RESPONSIBILITIES\n\nTHE BELOW REPRESENTS THE PRIMARY DUTIES OF THE POSITION, OTHERS MAY BE ASSIGNED AS NEEDED. TO PERFORM THIS JOB SUCCESSFULLY, AN INDIVIDUAL MUST BE ABLE TO PERFORM EACH ESSENTIAL DUTY SATISFACTORILY. THE REQUIREMENTS LISTED BELOW ARE REPRESENTATIVE OF THE KNOWLEDGE, SKILL, AND/OR ABILITY REQUIRED. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS.\n\nCOLLABORATE WITH SENIOR MANAGEMENT TO ALIGN HR OBJECTIVES WITH THE OVERALL BUSINESS STRATEGY. BUILD STRONG RELATIONSHIPS WITH BUSINESS LEADERS TO UNDERSTAND THEIR NEEDS AND DRIVE PRODUCTIVITY THROUGH HR SUPPORT AND CONSULTATION CONTINUOUSLY DEVELOP BUSINESS ACUMEN TO PROVIDE HR CONSULTATION THAT IS TIED TO BUSINESS OBJECTIVES DEVELOP AND IMPLEMENT HR STRATEGIES, PROCESSES, AND PROGRAMS TO SUPPORT ORGANIZATIONAL GOALS. LEAD INITIATIVES RELATED TO ORGANIZATIONAL DESIGN, RESTRUCTURING, AND CHANGE MANAGEMENT. IDENTIFY TALENT GAPS AND DEVELOP PLANS TO ADDRESS THEM THROUGH TALENT ATTRACTION, TRAINING, AND SUCCESSION PLANNING. FOSTER A CULTURE OF EMPLOYEE ENGAGEMENT, INCLUSION, AND DIVERSITY WITHIN THE ORGANIZATION. DEVELOP AND IMPLEMENT PERFORMANCE MANAGEMENT PROCESSES TO PROACTIVELY ADDRESS PERFORMANCE AND DEVELOPMENT NEEDS. CO-DESIGN AND FACILITATE LEADERSHIP DEVELOPMENT PROGRAMS TO BUILD MANAGERIAL CAPABILITIES WITHIN THE ORGANIZATION. SERVE AS AN ADVISOR TO LEADERSHIP AND EMPLOYEES ON HR-RELATED ISSUES AND CONCERNS. MEDIATE CONFLICTS AND FACILITATE RESOLUTION ACROSS MULTIPLE LEVELS WITHIN THE ORGANIZATION. CONTINUOUSLY IMPROVE HR PROCESSES AND SYSTEMS TO ENHANCE EFFICIENCY AND EFFECTIVENESS. PARTNER WITH OTHER FUNCTIONAL AREAS SUCH AS TALENT MANAGEMENT, LEARNING & DEVELOPMENT, FINANCE, IT, AND OPERATIONS TO ADDRESS CROSS-FUNCTIONAL ISSUES AND INITIATIVES. ACT AS A CHANGE AGENT WITHIN THE ORGANIZATION, DRIVING CULTURAL AND ORGANIZATIONAL CHANGE INITIATIVES. LEAD OR PARTICIPATE IN STRATEGIC HR PROJECTS SUCH AS MERGERS AND ACQUISITIONS, REORGANIZATIONS, OR NEW INITIATIVES. \n\nEDUCATION AND EXPERIENCE\n\n 7+ YEARS OF EXPERIENCE ACROSS HR GENERALIST AND SPECIALIST AREAS & 2+ YEARS SUPPORTING PRODUCT AND TECHNOLOGY BUSINESS IN AS AN HR BUSINESS PARTNER EXECUTIVE PRESENCE: RESILIENCE, CONSULTATIVE STYLE, & ABILITY TO ARTICULATE COMPLEX IDEAS INTO SIMPLE TERMS PROGRESSIVE APPROACH TO HR PRACTICES EXPERIENCE SUPPORTING TECHNOLOGY OR DIGITAL ORGANIZATIONS EXPERIENCE LEADING OR PARTNERING WITH ORG DESIGN/ORG EFFECTIVENESS, TALENT MANAGEMENT, EMPLOYEE RELATIONS, RECRUITING, AND TOTAL REWARDS BACHELOR’S DEGREE IN BUSINESS, HR, BEHAVIORAL SCIENCES OR RELATED FIELD WELL-DEVELOPED INDUSTRY KNOWLEDGE, MARKET INSIGHT, AND PROVEN ENTERPRISE THINKING DEMONSTRABLE EXPERIENCE DEVELOPING PARTNERSHIPS WITH BUSINESS LEADERS, PARTICULARLY IN HELPING THEM MANAGE SIGNIFICANT ORGANIZATIONAL CHANGE DURING PERIODS OF REALIGNMENT AND GROWTH HOLDING HR PROFESSIONAL CERTIFICATIONS (PHR OR SHRM-CP) PREFERRED TRAVEL UP TO 25%\n\nPAYLOCITY IS AN EQUAL-OPPORTUNITY EMPLOYER. PAYLOCITY IS COMMITTED TO THE FULL INCLUSION OF ALL INDIVIDUALS. WE RECRUIT, TRAIN, COMPENSATE, AND PROMOTE REGARDLESS OF RACE, RELIGION, COLOR, NATIONAL ORIGIN, SEX, DISABILITY, AGE, VETERAN STATUS, AND OTHER PROTECTED STATUS AS REQUIRED BY APPLICABLE LAW. AT PAYLOCITY, WE BELIEVE DIVERSITY MAKES US BETTER.\n\nWE EMBRACE AND ENCOURAGE OUR EMPLOYEES’ DIFFERENCES IN AGE, CULTURE, ETHNICITY, FAMILY OR MARITAL STATUS, GENDER IDENTITY OR EXPRESSION, LANGUAGE, NATIONAL ORIGIN, PHYSICAL AND MENTAL ABILITY, POLITICAL AFFILIATION, RACE, RELIGION OR SPIRITUAL BELIEF, SEXUAL ORIENTATION, SOCIO-ECONOMIC STATUS, VETERAN STATUS, AND OTHER CHARACTERISTICS THAT MAKE OUR EMPLOYEES UNIQUE. WE ACTIVELY CULTIVATE THESE DIFFERENCES THROUGH OUR EMPLOYEE RESOURCE GROUPS (ERGS), EMPLOYEE EXPERIENCES, PERSPECTIVES, TALENTS, AND APPROACHES TO DRIVE INNOVATION IN THE SOFTWARE AND SERVICES WE PROVIDE OUR CUSTOMERS.\n\nWE COMPLY WITH FEDERAL AND STATE DISABILITY LAWS AND MAKE REASONABLE ACCOMMODATIONS FOR APPLICANTS AND EMPLOYEES WITH DISABILITIES. TO REQUEST REASONABLE ACCOMMODATION IN THE JOB APPLICATION OR INTERVIEW PROCESS, PLEASE CONTACT ACCESSIBILITY@PAYLOCITY.COM.\n\nTHIS ROLE CAN BE PERFORMED FROM ANY OFFICE IN THE US. THE PAY RANGE FOR THIS POSITION IS $98,000- $115,000/YR; HOWEVER, BASE PAY OFFERED MAY VARY DEPENDING ON JOB-RELATED KNOWLEDGE, SKILLS, AND EXPERIENCE. THIS POSITION IS ELIGIBLE FOR AN ANNUAL BONUS AND RESTRICTED STOCK UNIT GRANT BASED ON INDIVIDUAL PERFORMANCE IN ADDITION TO A FULL RANGE OF BENEFITS OUTLINED HERE . BASE PAY INFORMATION IS BASED ON MARKET LOCATION. APPLICANTS SHOULD APPLY VIA WWW.PAYLOCITY.COM/CAREERS.",
    "job_skill_set": [
      "Talent management",
      "Performance management",
      "Employee relations",
      "Recruiting",
      "Data analysis",
      "Cloud-based HR software",
      "Communication",
      "Conflict resolution",
      "Relationship building",
      "Problem solving",
      "Team collaboration",
      "HR strategy development",
      "Organizational design",
      "Change management",
      "HR certifications (PHR, SHRM-CP)",
      "Consultative style",
      "Executive presence",
      "Adaptability",
      "Cultural awareness",
      "Coaching"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "awareness",
      "building",
      "business",
      "certifications",
      "change",
      "cloudbased",
      "coaching",
      "collaboration",
      "communication",
      "conflict",
      "consultative",
      "cultural",
      "data",
      "design",
      "development",
      "employee",
      "executive",
      "hr",
      "human",
      "management",
      "organizational",
      "partner",
      "performance",
      "phr",
      "presence",
      "problem",
      "recruiting",
      "relations",
      "relationship",
      "resolution",
      "resources",
      "senior",
      "shrmcp",
      "software",
      "solving",
      "strategy",
      "style",
      "talent",
      "team"
    ]
  },
  {
    "job_id": "3905821383",
    "job_title": "Senior Human Resources Assistant",
    "category": "HR",
    "job_description": "VN-US97-2024-040 SENIOR HR ASSISTANT\nPOSITION TITLE: SENIOR HUMAN RESOURCES ASSISTANTDUTY STATION: IOM, WASHINGTON, D.C., UNITED STATESCLASSIFICATION: G-6 (1 POSITION)TYPE OF APPOINTMENT: FIXED TERM, ONE YEAR WITH POSSIBILITY OF EXTENSION, 100%FULL-TIME. APPOINTMENT IS SUBJECT TO FUNDING CONFIRMATION.CLOSING DATE: APRIL 30, 2024THE CURRENT SALARY FOR THIS POSITION IS $6,329.75 (MONTHLY)\nRESPONSIBILITIES \nPARTICIPATE IN EVALUATION OF STAFFING NEEDS IN THE OFFICE AND ASSIST IN COORDINATION OF RECRUITMENT PROCESSES, INCLUDING BUT NOT LIMITED TO, PROVIDING GUIDANCE TO HIRING MANAGERS ON PREPARATION OF TERMS OF REFERENCE, DRAFTING AND POSTING VACANCY NOTICE/SPECIAL VACANCY NOTICE, SCREENING AND SHORTLISTING APPLICATIONS, DRAFTING INTERVIEW PROTOCOLS, PREPARING AND ADMINISTERING WRITTEN TESTS, TAKING PART IN INTERVIEW PANELS AS ASSIGNED, DRAFTING CANDIDATES ASSESSMENT FORMS, CONDUCTING REFERENCE CHECKS, PREPARING JOB OFFERS, ADMINISTERING RECRUITMENT MAILBOX, ETC.CARRY-OUT AND COORDINATE PRE-EMPLOYMENT ACTIVITIES SUCH AS PREPARATION OF ENTRY ON DUTY (EOD) DOCUMENTATION AND COLLECTION OF SUPPORTING DOCUMENTATION, COORDINATION OF EOD MEDICAL EXAMS AND FOLLOW-UP WITH HEALTH INSURANCE MEDICAL SERVICE (MANILA OR PANAMA) ON MEDICAL CLEARANCE, COORDINATE ENROLLMENT IN INSURANCE PLANS AS APPROPRIATE, COORDINATION AND DELIVERY OF INDUCTION SESSIONS, ARRANGEMENT FOR SECURITY BRIEFING, ETC.PERFORM ASSIGNED ROLE(S) IN ORACLE HR PAYING SPECIAL ATTENTION TO DATA CONSISTENCY AND ACCURACY; INPUT, MAINTAIN AND VERIFY DATA BASED ON APPROVALS AND SUPPORTING DOCUMENTATION; VERIFY ELIGIBILITY FOR ALLOWANCES AND OTHER BENEFITS, MONITOR AND FOLLOW UP ON CONTRACTUAL SITUATION AND ENTITLEMENTS, AND INITIATE AND COORDINATE PROMPT ACTIONS; GENERATE, EDIT AND REVIEW REPORTS, CONTRACT EXTENSIONS, PERSONNEL ACTIONS AND OTHER RELATED DOCUMENTATION.MONITOR ATTENDANCE AND LEAVE ADMINISTRATION; GENERATE, EDIT AND ANALYZE LEAVE-RELATED REPORTS; RESPOND TO QUESTIONS CONCERNING LEAVE ADMINISTRATION; GUIDE STAFF ON REQUEST AND APPROVAL PROCEDURE IN ORACLE.CARRY-OUT AND MONITOR A WIDE RANGE OF HUMAN RESOURCE ACTIONS INCLUDING BUT NOT LIMITED TO PREPARATION OF DOCUMENTATION FOR SEPARATION, CLASSIFICATION, RECLASSIFICATION, PROMOTION, DISCIPLINARY CASES AND COORDINATE WITH THE REGIONAL OFFICE, ADMINISTRATIVE CENTERS AND HUMAN RESOURCE MANAGEMENT IN GENEVA AS APPROPRIATE.PREPARE, COORDINATE AND MONITOR ALL REPORTS ON PERSONNEL MATTERS AND SUBMIT TIMELY TO CONCERNED PARTIES; DRAFT AND REVIEW ROUTINE CORRESPONDENCE, LETTERS, CERTIFICATIONS, ETC.; CREATE AND MAINTAIN A SYSTEMATIC WAY TO ARCHIVE HUMAN RESOURCES DOCUMENTS (ELECTRONIC AND HARD COPIES). UPDATE AND MAINTAIN ELECTRONIC AND PHYSICAL ARCHIVING SYSTEMS IN THE UNIT INCLUDING PERSONNEL FILES WITH ALL SUPPORTING DOCUMENTATION, RECRUITMENT FILES, HUMAN RESOURCES POLICIES, REGULATIONS, GUIDELINES AND MANUALS, INTERNAL CONTROLS, ETC.MONITOR COMPLIANCE WITH THE STAFF EVALUATION SYSTEM AND FOLLOW-UP WITH STAFF AND SUPERVISOR AS NEEDED; FACILITATE COMPLIANCE BY PROVIDING TECHNICAL GUIDANCE ON THE USE OF THE SYSTEM.PLAN AND COORDINATE THE ORGANIZATION OF HUMAN RESOURCES EVENTS INCLUDING STAFF DEVELOPMENT AND TRAINING ACTIVITIES IN COORDINATION WITH THE STAFF DEVELOPMENT AND LEARNING UNIT AND MAINTAIN UPDATED RECORDS. PARTICIPATE IN ASSESSMENTS OF STAFF TRAINING AND DEVELOPMENT NEEDS.PROVIDE INFORMATION TO STAFF ON THEIR ENTITLEMENTS AND RESPONSIBILITIES IN LINE WITH IOM REGULATIONS, INSTRUCTIONS AND PROCEDURES. RESPOND TO STANDARD AND MORE COMPLEX INQUIRIES AND REFER THE MOST SENSITIVE ONES AS APPROPRIATE.IDENTIFY AREAS FOR IMPROVEMENT AND HIGHLIGHT THEM TO THE SUPERVISOR; PROVIDE INPUTS FOR NEW PROCEDURES TO COMPLEMENT OR TO ADAPT EXISTING ONES TAKING INTO CONSIDERATION THE SPECIFIC NEEDS OF THE OFFICE. ASSIST IN ANALYZING AND RESOLVING SENSITIVE CASES BY COLLATING BACKGROUND INFORMATION, PREPARING SUMMARIES AND SHARING BEST PRACTICES. PROVIDES COMMENTS ON INTERPRETATION.PARTICIPATE IN INTER-AGENCY HUMAN RESOURCES RELATED WORKING GROUPS AS ASSIGNED.ASSIST WITH THE ANNUAL MEDICAL INSURANCE CAMPAIGN FOR ELIGIBLE EMPLOYEES AND THEIR DEPENDENTS IN MSP, LOCAL KAISER INSURANCE, LONG TERM DISABILITY INSURANCE. (TASK INCLUDES ARRANGING FOR THE EMPLOYEES' INCLUSION/EXCLUSION IN/FROM THE MSP, TRACKING THE SUBMISSION OF DOCS REQUIRED TO SUPPORT THE PREMIUM CONTRIBUTION CONFIGURATION).PAYROLL PROCESSINGANALYZE, VERIFY, AND PROCESS PAYROLLS FOR ALL EMPLOYEES AND NON-STAFF MEMBERS, ENSURING TIMELY AND ACCURATE PAYMENT OF SALARIES.PREPARE AND SUBMIT ALL THE REQUIRED PAYROLL REPORTS IN ORACLE AND PAYCHEX TO RELEVANT UNITS ON A TIMELY MANNER.STRICTLY ADHERE TO THE SCHEDULES FOR PAYROLL RUNS AND REQUIRE COMPLIANCE BY ALL UNITS INVOLVED THAT ALL PAYROLL RELATED DATA ARE SUBMITTED AND MUST BE RECEIVED BY PAYROLL UNIT ON TIME.VERIFY THAT ALL INPUT ELEMENTS (ENTITLEMENTS, ADVANCES, LOANS, VARIABLE ELEMENTS) ARE PROPERLY CAPTURED AND ENCODED IN ORACLE AND PAYCHEX.VALIDATE PAYROLL RESULTS TO ENSURE ACCURACY OF ALL PAYMENTS AND DEDUCTIONS.ENSURE THAT AMOUNTS INCLUDED ON THE PERSONNEL ACTION TRANSFERS, SEPARATIONS FROM SERVICE, ETC. ARE ACCURATELY PAID AND/OR DEDUCTED FROM STAFF MEMBERS.ENSURE PROJECTIZATION PERCENTAGES AND WBS HAVE BEEN UPDATED. RECONCILE WITH RELEVANT UNIT/S THE PROJECTIZATION DISCREPANCIES TO ENSURE STAFF COSTS ARE CORRECTLY CHARGED TO PROJECTS.ADMINISTER THE PAYMENT OF THE TERMINAL EMOLUMENTS TO ALL SEPARATED STAFF DUE TO RESIGNATION, RETIREMENT, AND END OF CONTRACT. ENSURE RECOVERY OF ALL OUTSTANDING DEBTS.PERFORM THE CROSS-VALIDATION PROCEDURES BEFORE PAYROLL EXIT. • PERIODICALLY CHECK ADHERENCE OF PAYROLL ELEMENTS TO EXISTING RULES AND REGULATIONS, AND RELATED INSTRUCTIONS, AND NOTE DEVIATIONS FOR ESCALATION OR OTHER NECESSARY ACTIONS.COMMUNICATE ALL ORACLE PAYROLL RELATED ISSUES TO ORACLE HELPDESK AND FOLLOW-UP RESOLUTIONS MADE.\nQUALIFICATIONS\nEDUCATIONHIGH SCHOOL DIPLOMA WITH SIX YEARS OF RELEVANT EXPERIENCE; OR,BACHELOR’S DEGREE IN HUMAN RESOURCES, BUSINESS ADMINISTRATION, PSYCHOLOGY OR RELATED FIELD WITH FOUR YEARS OF RELEVANT PROFESSIONAL EXPERIENCE.ACCREDITED UNIVERSITIES ARE THOSE LISTED IN THE UNESCO WORLD HIGHER EDUCATION DATABASE.EXPERIENCEPROFICIENT IN MS OFFICE APPLICATIONS E.G. WORD, EXCEL, POWERPOINT, E-MAIL, OUTLOOK; PREVIOUS EXPERIENCE IN ORACLE IS A DISTINCT ADVANTAGE.ATTENTION TO DETAIL, ABILITY TO ORGANIZE PAPERWORK IN A METHODICAL WAY.DISCREET, DETAILS AND CLIENTS-ORIENTED, PATIENT AND WILLINGNESS TO LEARN NEW THINGS; AND,PRIOR WORK EXPERIENCE WITH INTERNATIONAL HUMANITARIAN ORGANIZATIONS, NON-GOVERNMENT OR GOVERNMENT INSTITUTIONS/ORGANIZATION IN A MULTI-CULTURAL SETTING IS AN ADVANTAGE.SKILLSEXCELLENT COMMUNICATION SKILLS.COMPETENCY IN HR SOFTWARE AND TOOLS.EXCELLENT RESEARCH SKILLS.ABILITY MANAGING CONFLICT RESOLUTION.ABILITY ANALYZING DATA.PROFICIENT TIME-MANAGEMENT SKILLS.ABILITY TO WORK WITH MINIMUM SUPERVISION.LANGUAGEFLUENCY IN ENGLISH IS REQUIRED (ORAL AND WRITTEN).REQUIRED COMPETENCIES\nVALUES - ALL IOM STAFF MEMBERS MUST ABIDE BY AND DEMONSTRATE THESE FIVE VALUES:INCLUSION AND RESPECT FOR DIVERSITY: RESPECTS AND PROMOTES INDIVIDUAL AND CULTURAL DIFFERENCES. ENCOURAGES DIVERSITY AND INCLUSION.INTEGRITY AND TRANSPARENCY: MAINTAINS HIGH ETHICAL STANDARDS AND ACTS IN A MANNER CONSISTENT WITH ORGANIZATIONAL PRINCIPLES/RULES AND STANDARDS OF CONDUCT.PROFESSIONALISM: DEMONSTRATES ABILITY TO WORK IN A COMPOSED, COMPETENT AND COMMITTED MANNER AND EXERCISES CAREFUL JUDGMENT IN MEETING DAY-TO-DAY CHALLENGES.COURAGE: DEMONSTRATES WILLINGNESS TO TAKE A STAND ON ISSUES OF IMPORTANCE.EMPATHY: SHOWS COMPASSION FOR OTHERS, MAKES PEOPLE FEEL SAFE, RESPECTED AND FAIRLY TREATED.\nCORE COMPETENCIES - BEHAVIOURAL INDICATORS – LEVEL 2\nTEAMWORK: DEVELOPS AND PROMOTES EFFECTIVE COLLABORATION WITHIN AND ACROSS UNITS TO ACHIEVE SHARED GOALS AND OPTIMIZE RESULTS.DELIVERING RESULTS: PRODUCES AND DELIVERS QUALITY RESULTS IN A SERVICE-ORIENTED AND TIMELY MANNER. IS ACTION ORIENTED AND COMMITTED TO ACHIEVING AGREED OUTCOMES.MANAGING AND SHARING KNOWLEDGE: CONTINUOUSLY SEEKS TO LEARN, SHARE KNOWLEDGE AND INNOVATE.ACCOUNTABILITY: TAKES OWNERSHIP FOR ACHIEVING THE ORGANIZATION’S PRIORITIES AND ASSUMES RESPONSIBILITY FOR OWN ACTIONS AND DELEGATED WORK.COMMUNICATION: ENCOURAGES AND CONTRIBUTES TO CLEAR AND OPEN COMMUNICATION. EXPLAINS COMPLEX MATTERS IN AN INFORMATIVE, INSPIRING AND MOTIVATIONAL WAY.\nMANAGERIAL COMPETENCIES - BEHAVIORAL INDICATORS – LEVEL 2\nLEADERSHIP: PROVIDES A CLEAR SENSE OF DIRECTION, LEADS BY EXAMPLE AND DEMONSTRATES THE ABILITY TO CARRY OUT THE ORGANIZATION’S VISION. ASSISTS OTHERS TO REALIZE AND DEVELOP THEIR LEADERSHIP AND PROFESSIONAL POTENTIAL.EMPOWERING OTHERS: CREATES AN ENABLING ENVIRONMENT WHERE STAFF CAN CONTRIBUTE THEIR BEST AND DEVELOP THEIR POTENTIAL.BUILDING TRUST: PROMOTES SHARED VALUES AND CREATES AN ATMOSPHERE OF TRUST AND HONESTY.STRATEGIC THINKING AND VISION: WORKS STRATEGICALLY TO REALIZE THE ORGANIZATION’S GOALS AND COMMUNICATES A CLEAR STRATEGIC DIRECTION.HUMILITY: LEADS WITH HUMILITY AND SHOWS OPENNESS TO ACKNOWLEDGING OWN SHORTCOMINGS.\nNOTESTHIS VACANCY DOES NOT OFFER WORK SPONSORSHIP.THIS SELECTION PROCESS MAY BE USED TO STAFF SIMILAR POSITIONS IN VARIOUS DUTY STATIONS. RECOMMENDED CANDIDATES WILL REMAIN ELIGIBLE TO BE APPOINTED IN A SIMILAR POSITION FOR A PERIOD OF 24 MONTHS.THIS POST IS SUBJECT TO LOCAL RECRUITMENT. ONLY THOSE HOLDING A US CITIZENSHIP OR PERMANENT RESIDENCE FOR THE COUNTRY WHERE THIS POSITION IS BASED WILL BE ELIGIBLE FOR CONSIDERATION.APPOINTMENT WILL BE SUBJECT TO CERTIFICATION THAT THE CANDIDATE IS MEDICALLY FIT FOR APPOINTMENT, VERIFICATION OF RESIDENCY, VISA, AND AUTHORIZATIONS BY THE CONCERNED GOVERNMENT, WHERE APPLICABLE. VACCINATION AGAINST COVID-19 WILL BE REQUIRED FOR IOM PERSONNEL WHO ARE HIRED OR OTHERWISE ENGAGED BY IOM. AS PART OF THE MANDATORY MEDICAL ENTRY ON DUTY CLEARANCE, CANDIDATES WILL BE REQUESTED TO PROVIDE EVIDENCE OF FULL VACCINATION.",
    "job_skill_set": [
      "MS Office",
      "Payroll Processing",
      "Recruitment Coordination",
      "HR Software",
      "Documentation Management",
      "Leave Administration",
      "Medical Insurance Coordination",
      "Report Generation",
      "Communication",
      "Teamwork",
      "Attention to Detail",
      "Problem Solving",
      "Client Orientation",
      "Conflict Resolution",
      "Time Management",
      "Empathy",
      "Adaptability",
      "Leadership",
      "Oracle HR",
      "Data Analysis"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "analysis",
      "assistant",
      "attention",
      "client",
      "communication",
      "conflict",
      "coordination",
      "data",
      "detail",
      "documentation",
      "empathy",
      "generation",
      "hr",
      "human",
      "insurance",
      "leadership",
      "leave",
      "management",
      "medical",
      "ms",
      "office",
      "oracle",
      "orientation",
      "payroll",
      "problem",
      "processing",
      "recruitment",
      "report",
      "resolution",
      "resources",
      "senior",
      "software",
      "solving",
      "teamwork",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3905255940",
    "job_title": "Human Resources Generalist - Lincoln, NE",
    "category": "HR",
    "job_description": "AT CASEY'S, WE WORK HARD TO BE THE BEST AND HAVE A GOOD TIME DOING IT. WE STAY TRUE TO OUR ROOTS AND PUT SERVICE FIRST, BUILDING A BETTER FUTURE FOR OURSELVES AND OUR BUSINESS. WE STRIVE TO TREAT PEOPLE THE WAY THEY WANT TO BE TREATED, AND WE TAKE PRIDE IN CARING FOR OUR GUESTS, OUR COMMUNITIES AND EACH OTHER. LOOKING FOR A CULTURE LIKE THIS? JOIN CASEY'S GROWING HUMAN RESOURCES TEAM AS A HUMAN RESOURCES GENERALIST TO SUPPORT OUR TEAMS IN THE LINCOLN, NE AREA.\n\nTHE HUMAN RESOURCES GENERALIST IS RESPONSIBLE FOR EXECUTING A VARIETY OF TRANSACTIONAL CORE HR PROCESSES INCLUDING RECRUITING, EMPLOYEE RELATIONS, PERFORMANCE MANAGEMENT, TALENT DEVELOPMENT, SUCCESSION PLANNING, COMPENSATION, AND RETENTION AND ENGAGEMENT. THIS ROLE'S DUTIES WILL PRIMARILY BE PERFORMED IN AN OFFICE SETTING. OCCASIONAL TRAVEL, INCLUDING OVERNIGHT STAYS, WILL BE REQUIRED.\n\nTHE HR GENERALIST WORKS TO DRIVE AND MONITOR PROJECTS AND INITIATIVES THAT AFFECT COMPLIANCE, EFFICIENCY, AND ACCURACY OF DAILY OPERATIONS. THIS WILL INCLUDE THE DEVELOPMENT AND MAINTENANCE OF EFFECTIVE, PROFESSIONAL, AND INFLUENTIAL RELATIONSHIPS WITH SUPERVISORS, BUSINESS PARTNERS, AND APPLICANTS THROUGHOUT THE COMPANY. COMMUNICATES REGULARLY WITH LEADERS REGARDING IMMEDIATE AND FUTURE STAFFING NEEDS AND COLLABORATES TO IDENTIFY A PLAN TO ASSIST WITH THE PLACEMENT OF QUALIFIED CANDIDATES INTO OPEN POSITIONS. PARTNERS WITH BUSINESS LEADERS AND TALENT ACQUISITION TEAM TO ATTRACT, DEVELOP AND RETAIN TOP TALENT IN THE ORGANIZATION TO SUPPORT BUSINESS STRATEGY.\n\nKEY RESPONSIBILITIES INCLUDE\n\nINTERPRETS AND EXPLAINS HUMAN RESOURCES POLICIES, PROCEDURES, LAWS, STANDARDS, OR REGULATIONS. ACTS AS A KNOWLEDGE MULTIPLIER TO CONSISTENTLY COACH AND DEVELOP BUSINESS PARTNERS AND TEAM MEMBERS.CONSULTS WITH SUPERVISORY PERSONNEL TO ASSIST WITH SOLVING PROBLEMS THROUGH HUMAN RESOURCE AND VALUES-BASED SOLUTIONS WITHIN ESTABLISHED POLICIES, PROCEDURES, AND GUIDELINES. RECOMMENDS APPROPRIATE METHODS AND TECHNIQUES THAT MAY INCLUDE COUNSELING, COACHING, CORRECTIVE ACTION, PERFORMANCE REVIEWS, DEVELOPMENT PLANS, CONFLICT RESOLUTION POLICY, ETC. ESCALATES COMPLEX HR ISSUES AS APPROPRIATE.RESPONDS TO TEAM MEMBER RELATIONS MATTERS TO INCLUDE, BUT NOT LIMITED TO, INTAKE OF ALLEGED HARASSMENT, DISCRIMINATION OR RETALIATION REPORTS, AND POTENTIAL WAGE/HOUR CONCERNS, AND OTHER RELATED MATTERS TO UPHOLD A HEALTHY CULTURE. ESCALATES COMPLEX HR ISSUES AS APPROPRIATE.RECOMMENDS AND ASSISTS WITH THE DEVELOPMENT AND PRESENTATION OF EDUCATIONAL MATERIALS AND TRAINING. THIS MAY INCLUDE MANAGEMENT PRACTICES, HUMAN RESOURCE CONCEPTS AS WELL AS POLICY TRAINING AS NECESSARY. PARTNERS CLOSELY WITH BUSINESS LEADERS TO ENSURE TRAINING PROGRAMS ARE EFFECTIVE AND BEING EXECUTED TO THE STANDARD.ACTS AS A LIAISON TO IDENTIFY OPPORTUNITIES IN THE AREAS OF PROCESSES, PROCEDURES, COMPLIANCE MATTERS AND OTHER ISSUES WITH CONTINUOUS IMPROVEMENT AS A PRIORITY.ANALYZES WORKFORCE DATA, INCLUDING TURNOVER, AND TEAM MEMBER SURVEY REPORTING AND PRESENT RECOMMENDATIONS FOR CONSIDERATION.MAY ASSIST IN RESOLVING REASONABLE DRUG SUSPICION EVALUATION, PAYROLL QUESTIONS, BENEFIT QUESTIONS, NON-ROUTINE VERIFICATIONS OF EMPLOYMENT, AND UNEMPLOYMENT.MAY COORDINATE ON-SITE TEAM MEMBER CAMPAIGNS REGARDING VARIOUS INITIATIVES SUCH AS WELLNESS AND VOLUNTEERISM PROGRAMS.MAY COORDINATE ON-SITE MANDATORY UPDATES/POSTINGS AND ANY OTHER HR-RELATED POSTINGS OR NOTIFICATIONS SUCH AS BENEFITS ENROLLMENT, SCHOLARSHIP PROGRAM, ETC.\n\nWHAT YOU CAN EXPECT WHEN YOU JOIN THE CASEY'S TEAM:\n\nA TRANSFORMATIVE CULTURE PUTTING SERVICE FIRST AND TAKING PRIDE IN CARING FOR OUR GUESTS, OUR COMMUNITIES, AND EACH OTHER.OPPORTUNITIES TO USE CUTTING EDGE TECHNOLOGIES AND ENTERPRISE-WIDE COLLABORATION TO ENABLE OUR STRATEGY AND DRIVE WORLD CLASS SERVICE.THE RIGHT BALANCE BETWEEN WORK AND LIFE, TO DO YOUR BEST WORK AND ENJOY THOSE IMPORTANT PERSONAL MOMENTS. ASK ABOUT OUR OPTIONS FOR WORKPLACE FLEXIBILITY THAT MAY BE AVAILABLE.WE'RE HERE FOR FAMILIES! GREAT BENEFITS INCLUDING CHOICES IN MEDICAL PLANS, DENTAL, VISION, LIFE INSURANCE, EMPLOYEE STOCK PURCHASE PROGRAM, CHARITABLE GIVING PROGRAMS, AND PARENTAL LEAVECOMPETITIVE PAY, 401K COMPANY MATCH UP TO 6%, VACATION & SICK TIME, PAID HOLIDAYS, VOLUNTEER TIME, AND AN ONSITE CAFETERIADRESS FOR YOUR DAY DRESS CODE, JEANS ARE WELCOMED!THE OPPORTUNITY TO WORK FOR A BIG COMPANY THAT HAS NOT LOST OUR SMALL COMPANY FEEL. OUR SENIOR LEADERSHIP TEAM IS ENGAGED, INVOLVED AND ACCESSIBLE!WHAT ARE YOU WAITING FOR? COME BE A PART OF A COMPANY THAT IS GROWING, TRANSFORMING AND IS HERE FOR GOOD!\n\nREQUIREMENTS\n\nBACHELOR'S DEGREE IN BUSINESS, HUMAN RESOURCES OR RELATED FIELD, OR EQUIVALENT WORK-RELATED EXPERIENCE.MUST HAVE AT LEAST THREE YEARS OF PROGRESSIVE EXPERIENCE IN MULTIPLE AREAS OF HUMAN RESOURCES. BASIC KNOWLEDGE OF CIVIL RIGHTS, EQUAL OPPORTUNITY AND OTHER EMPLOYMENT LAWS AND REGULATIONS. STRONG UNDERSTANDING OF CONCEPTS, PRACTICES AND PROCEDURES CONSIDERED BEST PRACTICES FOR HUMAN RESOURCES. GENERAL FAMILIARITY WITH CONCEPTS PERTAINING TO THE FAMILY MEDICAL LEAVE ACT AND OTHER LEAVE POLICIES AS WELL AS DRUG AND ALCOHOL MATTERS AS IT PERTAINS TO EMPLOYMENT. MUST POSSESS THE ABILITY TO ESTABLISH AND MAINTAIN EFFECTIVE WORKING RELATIONSHIPS, AS NECESSITATED BY WORK ASSIGNMENTS.MUST DISPLAY AND PROMOTE HIGH SENSITIVITY TO CONFIDENTIALITY. IN ADDITION, CONSISTENTLY DEMONSTRATES AND PROMOTES EMOTIONAL INTELLIGENCEABILITY TO HANDLE SITUATIONS WITH DISCRETION, GOOD JUDGEMENT, AND AN APPROPRIATE SENSE OF URGENCY.EXCELLENT COMMUNICATION SKILLS (VERBAL, WRITTEN AND PRESENTATION) WITH THE ABILITY TO COMMUNICATE WITH INDIVIDUALS ACROSS ALL LEVELS OF THE ORGANIZATION. MUST HAVE STRONG ATTENTION TO DETAIL, ANALYTICAL REASONING SKILLS AND COGNITIVE ABILITIES.MUST POSSESS A VALID DRIVER'S LICENSE AND HAVE THE PHYSICAL ABILITY TO DRIVE A VEHICLE FOR JOB RELATED TRAVEL.\n\nPREFERRED\n\nCERTIFICATION AS A PROFESSIONAL IN HUMAN RESOURCES (PHR) OR SOCIETY OF HUMAN RESOURCES MANAGEMENT CERTIFIED PROFESSIONAL (SHRM-CP).\n\n",
    "job_skill_set": [
      "human resources",
      "employee relations",
      "talent development",
      "compensation",
      "data analysis",
      "employment laws",
      "confidentiality",
      "communication",
      "analytical reasoning",
      "emotional intelligence",
      "discretion",
      "judgment",
      "relationship building",
      "problem solving",
      "teamwork",
      "coaching",
      "presentation skills",
      "attention to detail",
      "recruiting",
      "performance management",
      "succession planning",
      "driver's license",
      "PHR certification",
      "SHRM-CP certification",
      "urgency"
    ],
    "short_keywords": [
      "analysis",
      "analytical",
      "attention",
      "building",
      "certification",
      "coaching",
      "communication",
      "compensation",
      "confidentiality",
      "data",
      "detail",
      "development",
      "discretion",
      "drivers",
      "emotional",
      "employee",
      "employment",
      "generalist",
      "hr",
      "human",
      "intelligence",
      "judgment",
      "laws",
      "license",
      "lincoln",
      "management",
      "ne",
      "performance",
      "phr",
      "planning",
      "presentation",
      "problem",
      "reasoning",
      "recruiting",
      "relations",
      "relationship",
      "resources",
      "shrmcp",
      "skills",
      "solving",
      "succession",
      "talent",
      "teamwork",
      "to",
      "urgency"
    ]
  },
  {
    "job_id": "3904576579",
    "job_title": "Senior Human Resources Business Partner",
    "category": "HR",
    "job_description": "WHO WE AREWE ARE THE LEADERS IN THE FRESH-PREPARED FOOD MANUFACTURING INDUSTRY. WE ARE FAST DEVELOPING A STRONG PRESENCE IN THE US AS WE CONTINUE TO DISRUPT THE EATING HABITS OF US CONSUMERS. WE ARE PASSIONATE ABOUT THE FOOD WE MAKE AND DEMAND FOR OUR PRODUCTS IS HIGH. YOU MAY NOT KNOW OUR BAKKAVOR NAME BUT OUR CUSTOMERS ARE SOME OF THE BEST-KNOWN GROCERY CHAINS ACROSS THE GLOBE.IN TOTAL, WE HAVE 19,000 EMPLOYEES WORLDWIDE. HERE IN THE US, WE ARE PLAYING AN INSTRUMENTAL PART IN DRIVING CHANGE IN FRESHLY PREPARED FOODS TO SOME OF THE MAJOR RETAILER CHAINS, AND IN THE UK WE ARE THE MARKET LEADER IN ALL CATEGORIES WE SERVE.\nOUR MISSION IS: TO DEVELOP AND PRODUCE INNOVATIVE, COMMERCIALLY SUCCESSFUL, GREAT-TASTING FOOD THAT OFFERS CHOICE, CONVENIENCE, AND FRESHNESS TO PEOPLE AROUND THE WORLD.\nOUR VALUES ARE:RESPECT & TRUST EACH OTHERBE PROUD OF WHAT WE DOKEEP THE CUSTOMER AT THE HEART OF WHAT WE DOGET IT RIGHT, KEEP IT RIGHT\nSUMMARYTHE SENIOR HR BUSINESS PARTNER WORKS WITH THE LEADERSHIP TEAM TO SUPPORT THE EXECUTION OF HUMAN CAPITAL STRATEGIES THAT DELIVER ON CURRENT AND FUTURE BUSINESS PRIORITIES. THIS SITE SENIOR MANAGEMENT ROLE ACTS AS A CONSULTANT WITHIN THE BUSINESS AND A COACH TO THE MANAGEMENT TEAM; ANTICIPATING AND ANALYZING PROBLEMS TO DEVELOP SOLUTIONS THAT DRIVE BUSINESS PERFORMANCE AND EMPLOYEE ENGAGEMENT. THIS POSITION IS RESPONSIBLE FOR A VARIETY OF HUMAN RESOURCES PROGRAMS AND SERVICES THAT DRIVE MEASURABLE VALUE TO THE ORGANIZATION.\nSKILLS/COMPETENCIESCONTENT EXPERTISE (E.G., EMPLOYMENT LAW, PRACTICAL APPLICATION OF POLICIES AND PROCEDURES)COMMUNICATION (E.G., ACTIVE LISTENING, SPEAKING, PERSUASION, WRITING)LEADERSHIP (VISION, ORGANIZATIONAL SAVVY, TEAM BUILDER, ACTION-RESULTS-VALUE DRIVEN)SOCIAL PERCEPTIVENESS, NEGOTIATION, JUDGMENT, AND DECISION MAKINGATTENTION TO DETAIL, SYSTEMS ANALYSIS, CRITICAL THINKING, AND COMPLEX PROBLEM SOLVINGCUSTOMER FOCUS\nESSENTIAL DUTIES AND RESPONSIBILITIES INCLUDE THE FOLLOWING, BUT ARE NOT LIMITED TO:SERVE AS AN ACTIVE MEMBER OF THE SITE LEADERSHIP TEAM AS A DRIVER OF CULTURE, CHANGE, AND ENGAGEMENT.HELPS DEFINE AND CASCADE STRATEGIC BUSINESS AND SITE OBJECTIVES TO ALL LEVELS OF THE ORGANIZATION, SO EVERYONE UNDERSTANDS THEIR PART IN DRIVING OUR COLLECTIVE SUCCESS.ACTS AS A BUSINESS PARTNER BROADLY DEFINING HR TO DETERMINE AREAS WHERE PEOPLE AND TEAMS CAN BE DEVELOPED OR LEVERAGED TO PROVIDE A COMPETITIVE ADVANTAGE.INTERPRETS, COMMUNICATES, AND ENSURES CONSISTENT ADHERENCE TO EMPLOYMENT LAW, HUMAN RESOURCES POLICIES, PRACTICES, AND INFORMATION TO ALL LEVELS OF THE LOCAL ORGANIZATION.FACILITATES ENGAGEMENT BY ENSURING THAT EMPLOYEES’ VOICE IS HEARD VIA ENGAGEMENT SURVEYS, EXIT SURVEYS, PULSE SURVEYS, FOCUS GROUPS, ONE-TO-ONES, ETC.DEVELOPS SITE ENGAGEMENT PLANS AND HELPS DRIVE ACTIONS AT ALL LEVELS FROM GROUP-WIDE INITIATIVES TO SITE INITIATIVES TO GRASSROOTS INITIATIVES. LINKS INITIATIVES BACK TO THE VOICE OF THE EMPLOYEE AND SHARES SUCCESSES.PARTNERS WITH SITE LEADERSHIP TO ESTABLISH A CLEAR PEOPLE PLAN TO ENSURE WE ARE FUTURE-READY TO INCLUDE RESOURCING PLANS, DEVELOPMENT PLANS, AND MITIGATION PLANS FOR KEY RISK AREAS.RESPONSIBLE FOR THE PROCESS, ACCURACY, AND VALIDITY OF THE HRIS AND THE PAYROLL PROCESS FOR THE SITE INCLUDING TIME AND ATTENDANCE MANAGEMENT AND LEAVE MANAGEMENT.ESTABLISHES EFFECTIVE RELATIONSHIPS WITH MANAGERS AND EMPLOYEES TO DRIVE BUSINESS PERFORMANCE, RESOLVE PROBLEMS, AND CREATE A LINE OF SIGHT BETWEEN INDIVIDUAL OBJECTIVES AND COMPANY STRATEGY.CHAMPIONS MANAGES AND DELIVERS THE TRAINING INITIATIVES FOR THE SITE, INCLUDING FRONT-LINE LEADERSHIP TRAINING, COACHING, TEAM BUILDING, WORKPLACE RESPECT, HEALTH AND SAFETY, FOOD SAFETY, AND NEW HIRES ORIENTATIONS.DRIVES BAKKAVOR CORE VALUES AS THE HEART OF THE WAY WE DO BUSINESS.ENSURES COMPLIANCE WITH ALL FEDERAL, STATE, AND LOCAL REQUIREMENTS INCLUDING MAINTAINING ALL REQUIRED DOCUMENTATION.CONDUCTS INTERNAL INVESTIGATIONS, INTERVENTIONS, AND RISK ASSESSMENTS AS NECESSARY TO ENSURE PEOPLE AND PROCESSES ARE COMPLIANT AND CONSISTENT WITH BAKKAVOR VALUES.ASSISTS IN COMMUNICATING THE HEALTH AND BENEFITS PROGRAMS, INCLUDING MEDICAL, DENTAL, LIFE, DISABILITY PLANS 401(K), AND FLEXIBLE SPENDING PLANS.MAINTAINS PROFESSIONALISM UNDER HIGHLY STRESSFUL CONDITIONS AND COLLABORATES WITH EMPLOYEES IN ALL FUNCTIONS AND LEVELS TO ACCOMPLISH TASKS.USES DATA AND ANALYTICS TO IDENTIFY AREAS OF OPPORTUNITY AND RISKS AND ACTIVELY DEVELOPS SPECIFICALLY TARGETED PROGRAMS, INITIATIVES, OR INTERVENTIONS. USES DATA TO ENSURE PROGRAMS AND INITIATIVES ARE EFFECTIVE.PERFORMS OTHER RESPONSIBILITIES AS ASSIGNED\n\nSUPERVISORY RESPONSIBILITYTHIS POSITION MANAGES 2-3 DIRECT REPORTS. THIS POSITION CARRIES OUT SUPERVISORY RESPONSIBILITIES IN ACCORDANCE WITH THE ORGANIZATION’S POLICIES AND APPLICABLE LAWS. RESPONSIBILITIES INCLUDE INTERVIEWING, HIRING, AND TRAINING EMPLOYEES; PLANNING, ASSIGNING, AND DIRECTING WORK; APPRAISING PERFORMANCE; REWARDING AND DISCIPLINING EMPLOYEES; ADDRESSING COMPLAINTS AND RESOLVING PROBLEMS.\nQUALIFICATIONSTO PERFORM THIS JOB SUCCESSFULLY, AN INDIVIDUAL MUST BE ABLE TO PERFORM EACH ESSENTIAL DUTY SATISFACTORILY. THE REQUIREMENTS LISTED BELOW ARE REPRESENTATIVE OF THE KNOWLEDGE, SKILL, AND/OR ABILITY REQUIRED. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM ESSENTIAL FUNCTIONS.\nEDUCATIONBACHELOR’S DEGREE IN HUMAN RESOURCE MANAGEMENT, ORGANIZATIONAL DEVELOPMENT, BUSINESS OR RELATED DEGREE (OR EQUIVALENT EDUCATION AND EXPERIENCE)\nEXPERIENCEFIVE YEARS’ HR HIGH-LEVEL GENERALIST EXPERIENCE; OR EQUIVALENT COMBINATION OF EDUCATION AND EXPERIENCE.EXCELLENT COMMUNICATION, BOTH VERBAL AND WRITTEN WITH EXTRAORDINARY BUSINESS ACUMEN.BI-LINGUAL, SPANISH PREFERREDPROVEN ABILITY TO MANAGE MULTIPLE AREAS INCLUDING HRIS, PAYROLL, TIME AND ATTENDANCE, HEALTH AND BENEFITS, TALENT AND TRAINING, AND EMPLOYEE RELATIONS.EXPERIENCE WORKING IN MANUFACTURING OR CPG INDUSTRIES\nLANGUAGE SKILLSSTRONG COMMUNICATION SKILLS (VERBAL AND WRITTEN), INCLUDING ACTIVE LISTENING SKILLS. )BILINGUAL ENGLISH/SPANISH PREFERRED)ABILITY TO READ, ANALYZE, AND INTERPRET PROFESSIONAL JOURNALS, TECHNICAL PROCEDURES, OR GOVERNMENTAL REGULATIONS.HAS THE ABILITY TO WRITE REPORTS, BUSINESS CORRESPONDENCE, AND PROCEDURE MANUALS.HAS THE ABILITY TO EFFECTIVELY PRESENT INFORMATION AND RESPOND TO QUESTIONS FROM GROUPS OF MANAGERS, CLIENTS, CUSTOMERS, AND PRODUCTION EMPLOYEES.",
    "job_skill_set": [
      "employment law",
      "data analytics",
      "training and development",
      "employee relations",
      "communication",
      "leadership",
      "problem solving",
      "social perceptiveness",
      "negotiation",
      "judgment",
      "decision making",
      "attention to detail",
      "customer focus",
      "team building",
      "active listening",
      "organizational savvy",
      "HRIS",
      "payroll management",
      "time and attendance management",
      "health and benefits administration",
      "bilingual (Spanish)",
      "manufacturing experience"
    ],
    "short_keywords": [
      "active",
      "administration",
      "analytics",
      "and",
      "attendance",
      "attention",
      "benefits",
      "bilingual",
      "building",
      "business",
      "communication",
      "customer",
      "data",
      "decision",
      "detail",
      "development",
      "employee",
      "employment",
      "experience",
      "focus",
      "health",
      "hr",
      "hris",
      "human",
      "judgment",
      "law",
      "leadership",
      "listening",
      "making",
      "management",
      "manufacturing",
      "negotiation",
      "organizational",
      "partner",
      "payroll",
      "perceptiveness",
      "problem",
      "relations",
      "resources",
      "savvy",
      "senior",
      "social",
      "solving",
      "spanish",
      "team",
      "time",
      "to",
      "training"
    ]
  },
  {
    "job_id": "3884810573",
    "job_title": "Human Resources Supervisor (On-site)",
    "category": "HR",
    "job_description": "JOB CATEGORY:\n\nHUMAN RESOURCES\n\nJOB FAMILY:\n\nPLANT HR\n\nJOB DESCRIPTION:\n\nAS A HUMAN RESOURCES SUPERVISOR, YOU WILL BE A KEY HR LEADER IN OUR CARTHAGE, MISSOURI MANUFACTURING PLANT.\n\nAS THE HR SUPERVISOR YOU WILL EXECUTE: RECRUITMENT AND SELECTION, EMPLOYEE RELATIONS, WORK LIFE BALANCE IMPROVEMENT PROJECTS, MAXIMIZE PARTNER MORALE, WAGE AND BENEFIT CHANGES, SAFETY IMPROVEMENTS, TRAINING AND DEVELOPMENT, POLICY ADMINISTRATION, AND REGULATORY COMPLIANCE RELATED TO EMPLOYMENT. THE HR SUPERVISOR WILL BE PART OF A LARGER HR & OPERATIONS LEADERSHIP TEAM, WHO COLLABORATE AND SUPPORT ONE ANOTHER.\n\nTHIS POSITION IS 100% ON-SITE AT THE PLANT.\n\nWHAT YOU’LL DO:\n\nRECRUIT, HIRE AND ONBOARD NEW HIRES.POLICY ADMINISTRATION.PERFORMANCE MANAGEMENT.PARTNER (EMPLOYEE) RELATIONS.ADMINISTER INTERNAL JOB TRANSFERS.PARTNER TRAINING.HR PROCESS IMPROVEMENT.COLLABORATE WITH THE HR TEAM LEADER (MANAGER) TO LEAD PARTNERS AND COLLABORATE WITH THE DC TEAM EFFECTIVELY.WORK WITH THE HR TEAM LEADER TO IMPLEMENT STRATEGIC WORKFORCE PLANNING INITIATIVES.COMMUNICATE HR POLICIES, COMPENSATION, BENEFITS, AND OTHER HR INITIATIVES TO PARTNERS.COLLABORATE WITH HR AMERICAS LEADERSHIP TEAM IN ORDER TO IMPROVE STANDARD POLICIES, PROCESSES, AND THE OVERALL PARTNER EXPERIENCE.MAINTAIN PARTNER AND POSITION INFORMATION IN HR SYSTEMS INCLUDING WORKDAY AND KRONOS.\n\nWHAT YOU NEED TO SUCCEED:\n\nBACHELOR’S IN BUSINESS, HR OR RELATED FIELD; EQUIVALENT EXPERIENCE WILL BE CONSIDERED.1-3 YEARS OF EXPERIENCE IN HUMAN RESOURCES AND/OR LEADERSHIP IS PREFERRED.TECHNICAL EXPERTISE IN HUMAN RESOURCES PRACTICES AND PROCEDURES.STRONG PRESENTATION SKILLS, ABILITY TO COMMUNICATE EFFECTIVELY AND DELIVER PRESENTATIONS IN AN ENGAGING MANNER.ABILITY TO WORK BOTH INDEPENDENTLY AND AS A PART OF A LARGER TEAM.DEMONSTRATED ABILITY TO SERVICE CUSTOMERS.ABILITY TO SOLVE PROBLEMS.WELL-DEVELOPED ANALYTICAL SKILLS.FORWARD THINKING.ABILITY TO EVALUATE THE FINANCIAL IMPACT OF VARIOUS HR & LABOR PRACTICES.ABILITY TO NAVIGATE MICROSOFT OFFICE & APTITUDE TO BECOME AN EXPERT IN WORKDAY, KRONOS, AND OTHER INTERNAL SOFTWARE SYSTEMS.PREFERABLY BILINGUAL IN ENGLISH AND SPANISH.\n\nELIGIBLE PARTNERS WILL RECEIVE:\n\nGET NOT ONE, BUT TWO RETIREMENT BENEFITS. WHEN YOU JOIN OUR EMPLOYEE-OWNED COMPANY, YOU’LL BE PART OF OUR EMPLOYEE STOCK OWNERSHIP PLAN (ESOP) FROM DAY ONE. THAT MEANS IN ADDITION TO AN 8% 401(K) MATCH INTO THE ESOP, SCHREIBER WILL CONTRIBUTE AN EXTRA AMOUNT – ABOUT 10% OF YOUR EARNINGS – TOWARD YOUR RETIREMENT EVERY YEAR. THAT’S A COMPANY CONTRIBUTION OF AROUND 18% IN RETIREMENT SAVINGS ANNUALLY!EARN BONUS PAY. YOU’LL HAVE AN OPPORTUNITY TO EARN INCENTIVE PAY TWICE A YEAR WHEN WE MEET OUR COMPANY GOALS.EARN $ FOR FOCUSING ON YOUR HEALTH. GET UP TO $1,200 FOR YOUR HEALTH SAVINGS ACCOUNT EACH YEAR, PLUS GET REIMBURSED FOR FITNESS MEMBERSHIP, EQUIPMENT OR CLASSES.PURSUE DEVELOPMENT THAT’S RELEVANT TO YOUR ROLE, CAREER GOALS AND THE COMPANY. PLUS, WE OFFER TUITION REIMBURSEMENT IF YOU WANT TO FURTHER YOUR EDUCATION TO GROW IN YOUR ROLE AT SCHREIBER.GET ACCESS TO MEDICAL, PRESCRIPTION DRUG, DENTAL AND VISION BENEFITS STARTING DAY ONE. THIS INCLUDES AN ONSITE NURSE AND MENTAL HEALTH COUNSELOR.EXPERIENCE CARING LIKE YOU’VE NEVER EXPERIENCED IT BEFORE. WE HAVE A PROGRAM THAT’S COMPLETELY ORGANIZED BY AND FOR OTHER PARTNERS WHO NEED EXTRA HELP. IT’S CALLED PARTNERS HELPING PARTNERS. WE HAVE HUNDREDS OF EXAMPLES OF PARTNERS ORGANIZING FUNDRAISERS TO HELP OUT OTHERS GOING THROUGH A HARD TIME.\n\nSOUND LIKE A COMPANY YOU’D LIKE TO BE A PART OF? CLICK APPLY.\n\nNEED EXTRA ASSISTANCE WITH THE APPLICATION PROCESS? CONTACT RECRUITING@SCHREIBERFOODS.COM OR CALL 920-437-7601.\n\nFOR POSITIONS THAT REQUIRE ANY AMOUNT OF TRAVEL: VALID DRIVER'S LICENSE, AUTO INSURANCE (AT LEAST STATE MINIMUM- MORE MIGHT BE REQUIRED), ACCEPTABLE DRIVING RECORD PER SCHREIBER FOODS DISCRETION, AND VEHICLE THAT WILL ENSURE APPLICANT CAN MEET THE TRAVEL NECESSITIES OF THE POSITION ARE REQUIRED.\n\nSCHREIBER REQUIRES THAT AN EMPLOYEE HAVE AUTHORIZATION TO WORK IN THE COUNTRY IN WHICH THE ROLE IS BASED. IN THE EVENT, AN APPLICANT DOES NOT HAVE CURRENT WORK AUTHORIZATION, SCHREIBER WILL DETERMINE, IN ITS SOLE DISCRETION, WHETHER TO SPONSOR AN INDIVIDUAL FOR WORK AUTHORIZATION. HOWEVER, BASED ON IMMIGRATION REQUIREMENTS, NOT ALL ROLES ARE SUITABLE FOR SPONSORSHIP.\n\nAN EQUAL OPPORTUNITY EMPLOYER, ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, OR PROTECTED VETERAN STATUS AND WILL NOT BE DISCRIMINATED AGAINST ON THE BASIS OF DISABILITY.\n\nWANT TO BE ALERTED OF NEW OPENINGS? SIGN IN AND CLICK THE JOB ALERTS BUTTON IN THE UPPER-RIGHT CORNER TO CREATE A JOB ALERT.",
    "job_skill_set": [
      "recruitment",
      "employee relations",
      "policy administration",
      "performance management",
      "HR process improvement",
      "training and development",
      "regulatory compliance",
      "Microsoft Office",
      "communication",
      "teamwork",
      "problem solving",
      "analytical skills",
      "customer service",
      "forward thinking",
      "presentation skills",
      "independence",
      "Workday",
      "Kronos",
      "bilingual (English and Spanish)"
    ],
    "short_keywords": [
      "administration",
      "analytical",
      "and",
      "bilingual",
      "communication",
      "compliance",
      "customer",
      "development",
      "employee",
      "english",
      "forward",
      "hr",
      "human",
      "improvement",
      "independence",
      "kronos",
      "management",
      "microsoft",
      "office",
      "onsite",
      "performance",
      "policy",
      "presentation",
      "problem",
      "process",
      "recruitment",
      "regulatory",
      "relations",
      "resources",
      "service",
      "skills",
      "solving",
      "spanish",
      "supervisor",
      "teamwork",
      "thinking",
      "training",
      "workday"
    ]
  },
  {
    "job_id": "3905202142",
    "job_title": "Human Resources Coordinator",
    "category": "HR",
    "job_description": "JOB TITLE: HR COORDINATORLOCATION: NEW YORK(HYBRID)DURATION: 18+ MONTHS\n\nJOB DESCRIPTION:WE'RE SEEKING A TEMPORARY TEAM MEMBER TO SUPPORT OUR HR STRATEGY AND TRANSFORMATION TEAM IN THE EXECUTION OF STRATEGIC INITIATIVES ACROSS OUR INTERNATIONAL MARKETS.\n\nTOP 3 SKILLS: MINIMUM OF 3 YEARS HR EXPERIENCE, EXPERIENCE WITH HR SYSTEMS(TEAM USES SUCCESSFACTORS BUT EXPERIENCE IN WORKDAY/SAP ALSO WORKS), WORKFORCE PLANNING EXPERIENCE, THRIVE UNDER PRESSURE AND ABLE TO MULTI-TASK, ATTENTION TO DETAIL AND ACCURACY, PROACTIVE, SELF-MOTIVATED, ADVANCED EXCEL/POWERPOINT SKILLS(GURU’S IN EXCEL),\n OTHER SKILLS/NICE TO HAVES: BACKGROUND OR KNOWLEDGE IN FINANCE, INDUSTRY EXPERIENCE/MULTINATIONAL COMPANY IS A PLUS,EXPERIENCE WITH WORKING WITH INTERNATIONAL TEAMS, SPANISH SPEAKING IS A PLUS \nKEY RESPONSIBILITIES:MONITOR AND TRACK DAY-TO-DAY PROJECT ACTIVITIES, DELIVERABLES, AND STRATEGIC INITIATIVES TO ENSURE TIMELY COMPLETION.COLLABORATE WITH HR BUSINESS PARTNERS, FINANCE AND COMPENSATION CENTER OF EXPERTISE (COE) TO UPDATE TRANSFORMATION PROJECT BUDGETS AND FINANCIAL MEASURES.ASSIST IN UPDATING AND MANAGING HR PLANNING FORECASTS AND BUDGETS ALONGSIDE SENIOR HR BUSINESS PARTNERS, FINANCE AND COMPENSATION COE.OVERSEE BUDGET CONTROL, PLANNING PROCESSES, HIRING PROCEDURES, AND OTHER HR-RELATED ACTIVITIES.COORDINATE ANNUAL COMPENSATION BUDGETING, WORKING CLOSELY WITH HR BUSINESS PARTNERS, FINANCE AND COMPENSATION COE.MAINTAIN HIRING REQUESTS AND VALIDATE BUDGETING APPROVALS WITH RELEVANT STAKEHOLDERS.PREPARE INTERNAL COMMUNICATION REPORTS AS NEEDED.SUPPORT HR STAFF IN VALIDATING REQUESTS AND ENSURING ACCURATE COMPLETION OF INTERNAL PROCESSES. \nQUALIFICATIONS AND REQUIREMENTS:BACHELOR’S DEGREE.MINIMUM OF 3 YEARS HR EXPERIENCE, PREFERABLY IN A RELATED INDUSTRY; MULTINATIONAL COMPANY EXPERIENCE IS A PLUS.BACKGROUND OR KNOWLEDGE IN FINANCE IS ADVANTAGEOUS.ABILITY TO THRIVE UNDER PRESSURE AND MANAGE MULTIPLE TASKS SIMULTANEOUSLY.STRONG ATTENTION TO DETAIL AND ACCURACY.PROACTIVE, SELF-MOTIVATED, AND FLEXIBLE ATTITUDE.HIGHLY ANALYTICAL WITH A KEEN EYE FOR DETAIL AND ACCURACY.ADVANCED PROFICIENCY IN MICROSOFT EXCEL AND POWERPOINT SKILLS.",
    "job_skill_set": [
      "HR experience",
      "HR systems (SuccessFactors, Workday, SAP)",
      "advanced Excel",
      "advanced PowerPoint",
      "budget control",
      "financial measures",
      "ability to thrive under pressure",
      "multi-tasking",
      "attention to detail",
      "proactive",
      "self-motivated",
      "flexibility",
      "analytical skills",
      "collaboration",
      "workforce planning",
      "multinational company experience",
      "Spanish speaking"
    ],
    "short_keywords": [
      "ability",
      "advanced",
      "analytical",
      "attention",
      "budget",
      "collaboration",
      "company",
      "control",
      "coordinator",
      "detail",
      "excel",
      "experience",
      "financial",
      "flexibility",
      "hr",
      "human",
      "measures",
      "multinational",
      "multitasking",
      "planning",
      "powerpoint",
      "pressure",
      "proactive",
      "resources",
      "sap",
      "selfmotivated",
      "skills",
      "spanish",
      "speaking",
      "successfactors",
      "systems",
      "thrive",
      "to",
      "under",
      "workday",
      "workforce"
    ]
  },
  {
    "job_id": "3888028986",
    "job_title": "Human Resources Generalist",
    "category": "HR",
    "job_description": "TREW HR IS SEEKING A PROFESSIONAL, HARDWORKING, AND RELIABLE HR GENERALIST TO JOIN OUR GROWING HR CONSULTING TEAM! THIS INDIVIDUAL MUST POSSESS MATURITY AND BE THE SUBJECT MATTER EXPERT ACTING IN A CONSULTATIVE MANNER TO WILLINGLY ASSIST EMPLOYEES OF ALL ORGANIZATIONAL LEVELS WITH HR INQUIRIES. THIS INDIVIDUAL WILL ALSO ACT AS A PROFESSIONAL ADVISOR TO EMPLOYERS TO ENSURE COMPLIANCE WITH FEDERAL AND STATE LABOR AND EMPLOYMENT LAWS AND GUIDELINES. \nTHIS POSITION IS IDEAL FOR SOMEONE WHO ENJOYS VARIETY THROUGHOUT THEIR DAY AND CAN PIVOT QUICKLY FROM ONE PROJECT TO ANOTHER. THIS POSITION REQUIRES ATTENDING NETWORKING EVENTS TO BUILD A BOOK OF CLIENTS. \nESSENTIAL FUNCTIONS HELP ORGANIZE AND MANAGE NEW EMPLOYEE ORIENTATION SCHEDULES, ONBOARDING, AND TRAINING PROGRAMS.ASSIST WITH RECRUITING EFFORTS INCLUDING ADVERTISING, SCHEDULING, CONDUCTING INTERVIEWS AND REFERENCE CHECKS, AND DRAFTING AND SENDING JOB OFFERS ON BEHALF OF CLIENTS. MANAGE AND UPDATE HR DATABASES WITH NEW HIRE INFORMATION, TERMINATIONS, SICK LEAVE ADMINISTRATION AND TRACKING, DISCIPLINARY ACTION, AND TIME OFF APPROVALS.COORDINATE THE MAINTENANCE OF ALL EMPLOYEE RECORDS WHETHER VIA HRIS OR PAPER FILES.ANSWER EMPLOYEES’ QUESTIONS AND PROVIDE REQUESTED INFORMATION RELATING TO THE EMPLOYEE LIFE CYCLE.WILLINGNESS TO TRAIN EMPLOYEES ON TECHNOLOGY SYSTEMS WITHIN THE ORGANIZATIONPROVIDE PROFESSIONAL DAY-TO-DAY AND INTERIM HR SUPPORT TO CLIENTS. PROCESS PAYROLL FOR CLIENTS.MANAGE HR POLICY AND PROCEDURE DEVELOPMENT, IMPLEMENTATION, AND MAINTENANCE FOR CLIENTS.OTHER DUTIES AS ASSIGNED.\nREQUIREMENTSPREVIOUS WORKING EXPERIENCE AS AN HR GENERALIST FOR A MINIMUM OF 5 YEARS.FAMILIARITY WITH LABOR LAWS ACROSS MULTIPLE STATES. ABILITY TO PROVIDE FIVE-STAR PROFESSIONAL SERVICES AT ALL TIMES.EXCELLENT TIME-MANAGEMENT SKILLSACT AS A RELIABLE AND SUPPORTIVE TEAM MEMBER.POSSESS A GROWTH MINDSET.KNOWLEDGE OF THE RECRUITING PROCESSEXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLSORGANIZED WITH ATTENTION TO DETAIL.ABILITY TO CLEARLY COMMUNICATE WITH CLIENTS REGARDING TIMELINES AND PROJECT UPDATES.WILLINGNESS TO ATTEND NETWORKING EVENTS TO BUILD A BOOK OF CLIENTS.FLEXIBILITY WITH TRAVELING TO MULTIPLE OFFICE LOCATIONS AS NEEDED.\nREQUIRED EDUCATION AND EXPERIENCE BACHELOR’S DEGREE IN HUMAN RESOURCES OR SIMILAR RELEVANT FIELD.MINIMUM OF 5 YEARS’ EXPERIENCE WORKING IN A PROFESSIONAL ORGANIZATION OFFERING HIGH-LEVEL SERVICES TO CLIENTS. VAST TECHNOLOGICAL SKILLS INCLUDING HRIS AND PAYROLL SOFTWARE, MICROSOFT OUTLOOK, AND MICROSOFT OFFICE SUITE.\nTHIS POSITION IS LOCATED IN OUR HARRISBURG OFFICE.",
    "job_skill_set": [
      "HRIS",
      "payroll software",
      "Microsoft Office Suite",
      "recruiting",
      "employee onboarding",
      "communication",
      "time management",
      "teamwork",
      "flexibility",
      "attention to detail",
      "consultative skills",
      "professionalism",
      "Microsoft Outlook",
      "labor laws",
      "employee training programs",
      "HR policy development",
      "growth mindset"
    ],
    "short_keywords": [
      "attention",
      "communication",
      "consultative",
      "detail",
      "development",
      "employee",
      "flexibility",
      "generalist",
      "growth",
      "hr",
      "hris",
      "human",
      "labor",
      "laws",
      "management",
      "microsoft",
      "mindset",
      "office",
      "onboarding",
      "outlook",
      "payroll",
      "policy",
      "professionalism",
      "programs",
      "recruiting",
      "resources",
      "skills",
      "software",
      "suite",
      "teamwork",
      "time",
      "to",
      "training"
    ]
  },
  {
    "job_id": "3906086601",
    "job_title": "Human Resources Generalist",
    "category": "HR",
    "job_description": "THE GRAND PRAIRIE TX, HUMAN RESOURCES GENERALIST WILL ASSIST WITH THE ADMINISTRATION OF THE DAY-TO-DAY OPERATIONS OF THE HUMAN RESOURCES FUNCTION AND SUPPORT THE FIELD HUMAN RESOURCES MANAGER WITH HR RELATED MATTERS IN A FAST-PACED 24/7 WAREHOUSE/DISTRIBUTION FACILITIES. THIS ROLE WILL DEMONSTRATE A SENSE OF URGENCY, HIGH LEVEL OF TRUST, CONFIDENTIALITY, GOOD JUDGMENT AND COLLABORATION. THE HR GENERALIST WILL WORK CLOSELY WITH EMPLOYEES AND MANAGERS. THE IDEAL CANDIDATE HAS APPRECIATION FOR THE CONTRIBUTION OF EACH AND EVERY EMPLOYEE TO THE COMPANY'S VISION AND EXCELLENCE IN EXECUTION.\n\nRESPONSIBILITIES:AS ASSIGNED BY THE FIELD HUMAN RESOURCES MANAGER, OVERSEE EMPLOYEE RELATIONS MATTERS, INCLUDING EMPLOYEE RECOGNITION PROGRAMS, DISCIPLINARY MATTERS, PERFORMANCE IMPROVEMENT PLANS, AND EXIT INTERVIEWS.HANDLES EMPLOYMENT-RELATED INQUIRIES FROM APPLICANTS, EMPLOYEES, AND SUPERVISORS, REFERRING COMPLEX AND/OR SENSITIVE MATTERS TO THE APPROPRIATE STAFF.COLLABORATE WITH RECRUITERS TO STAFF JOBS IN A TIMELY AND COST-EFFECTIVE MANNER.MANAGE ONBOARDING PROCESS AND SUPPORT ONBOARDING ACTIVITIES.COMPILES DATA, GENERATES AND DISTRIBUTES REPORTS AS REQUIRED TO SUPPORT COMPLIANCE, COMPENSATION, SYSTEM ADMINISTRATION AND OTHER INTERNAL/EXTERNAL REPORTING REQUIREMENTS. ENSURES THAT ALL PAPERWORK SUCH AS PERSONNEL TRANSACTIONS SUCH AS NEW HIRE FORMS, PROMOTIONS, TRANSFERS, PERFORMANCE REVIEWS, DISCIPLINE, AND TERMINATIONS ARE COMPLETED AND SENT FOR FILING.ANALYZE AND COLLABORATE ON RECOMMENDATIONS BASED ON ENGAGEMENT FOCUS GROUPS, EXIT INTERVIEWS AND OTHER SURVEYS.ENSURE COMPLIANCE WITH FEDERAL, STATE AND LOCAL EMPLOYMENT LAWS AS WELL AS COMPANY POLICIES AND PROCEDURES.ADVISE EMPLOYEES ON COMPANY POLICIES AND PROCEDURES.SUPPORTS THE COMMUNICATION AND ADMINISTRATION OF COMPANY PROGRAMS AND POLICIES.MONITOR FMLA AND OTHER LEAVES OF ABSENCE\nQUALIFICATIONS:REQUIRED EDUCATION: BACHELOR’S DEGREE IN HUMAN RESOURCES, BUSINESS ADMINISTRATION, OR RELATED FIELD EXPERIENCE REQUIRED. SHRM-CP A PLUS.EXPERIENCES: AT LEAST THREE YEARS OF BUSINESS PARTNER EXPERIENCE PREFERREDCOMPETENCIES REQUIRED:INITIATIVETEAMWORKPROBLEM SOLVING, CONFLICT MANAGEMENTSTRONG WRITTEN AND VERBAL COMMUNICATION SKILLSCUSTOMER FOCUSATTENTION TO DETAILBUILDING AND MAINTAINING RELATIONSHIPSADAPTABILITY AND URGENCYLANGUAGE SKILLS: STRONG VERBAL AND WRITTEN COMMUNICATIONS SKILLSBILINGUAL A PLUS\nCOMPENSATION: $62,090 - $65,000/YEAR**THE ACTUAL SALARY OFFER WILL TAKE INTO ACCOUNT MULTIPLE FACTORS INCLUDING SKILLS, EXPERIENCE, EDUCATION AND LOCATION. PLEASE NOTE THAT THE SALARY DETAILS LISTED IN ROLE POSTINGS REFLECT THE BASE SALARY ONLY, NOT TOTAL COMPENSATION, WHICH INCLUDES BONUS AND BENEFITS.\nCANDIDATES ARE ELIGIBLE FOR THE FOLLOWING BENEFITS:• PTO• COMPANY BONUS PLAN• 401(K) SAVE PLAN• ANNUAL FIXED CONTRIBUTION• 8 PAID HOLIDAYS• MEDICAL, DENTAL, VISION, AND LIFE & DISABILITY COVERAGE• VOLUNTARY BENEFITS• ACCIDENT/CRITICAL ILLNESS/HOSPITAL INDEMNITY BENEFITS• TUITION REIMBURSEMENT AND STUDENT LOAN ASSISTANCE• EMPLOYEE ASSISTANCE PROGRAM (EAP)• HEALTH SAVINGS ACCOUNT (HSA) WITH EMPLOYER FUNDING AND WELLNESS INCENTIVES• FLEXIBLE SPENDING ACCOUNT (FSA)• EMPLOYEE REFERRAL PROGRAM",
    "job_skill_set": [
      "HR administration",
      "employee relations",
      "onboarding",
      "compliance",
      "data analysis",
      "report generation",
      "employment law knowledge",
      "communication",
      "teamwork",
      "problem solving",
      "conflict management",
      "customer focus",
      "attention to detail",
      "relationship building",
      "adaptability",
      "initiative",
      "SHRM-CP",
      "bilingual"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "analysis",
      "attention",
      "bilingual",
      "building",
      "communication",
      "compliance",
      "conflict",
      "customer",
      "data",
      "detail",
      "employee",
      "employment",
      "focus",
      "generalist",
      "generation",
      "hr",
      "human",
      "initiative",
      "knowledge",
      "law",
      "management",
      "onboarding",
      "problem",
      "relations",
      "relationship",
      "report",
      "resources",
      "shrmcp",
      "solving",
      "teamwork",
      "to"
    ]
  },
  {
    "job_id": "3906223265",
    "job_title": "Human Resources Assistant",
    "category": "HR",
    "job_description": "$20.97 PER HOUR\n\nAT CORECIVIC, OUR EMPLOYEES ARE DRIVEN BY A DEEP SENSE OF SERVICE, HIGH STANDARDS OF PROFESSIONALISM AND A RESPONSIBILITY TO BETTER THE PUBLIC GOOD. WE ARE CURRENTLY SEEKING A HUMAN RESOURCES ASSISTANT WHO HAS A PASSION FOR PROVIDING THE HIGHEST QUALITY CARE IN AN INSTITUTIONAL, SECURE SETTING. COME JOIN A TEAM THAT IS DEDICATED TO MAKING AN IMPACT FOR THE PEOPLE AND COMMUNITIES WE SERVE.\n\nTHE HUMAN RESOURCES ASSISTANT PERFORMS VARIED AND MODERATELY COMPLEX CLERICAL FUNCTIONS AND RELATED GENERAL OFFICE DUTIES THAT REQUIRE INDEPENDENT JUDGMENT IN THE USE OF WORK METHODS AND PROCEDURES IN THE AREAS OF HUMAN RESOURCES AND PAYROLL ADMINISTRATION. THEY WILL PROVIDE SUPPORT IN THE AREAS OF EMPLOYEE BENEFITS AND SERVICES, EMPLOYEE RELATIONS, COMPLIANCE, SAFETY AND HEALTH, WAGE AND SALARY ADMINISTRATION, PERFORMANCE MANAGEMENT, AND EMPLOYMENT WHICH INCLUDES RECRUITING, SELECTION, AND ORIENTATION.\n\nREVIEW AND PROCESS HUMAN RESOURCES AND PAYROLL DOCUMENTS. VERIFY THAT REQUIRED FORMS ARE ACCURATE AND COMPLETE FOR PROCESSING.MAINTAIN PERSONNEL AND MEDICAL FILES IN COMPLIANCE WITH POLICY AND PROCEDURES. PROCESS PERSONNEL AND PAYROLL DOCUMENTS THROUGH REGULAR USE OF SOFTWARE APPLICATIONS, INCLUDING BUT NOT LIMITED TO, PROMOTIONS, DEMOTIONS, TRANSFERS, AND SALARY CHANGES.ASSIST IN THE IMPLEMENTATION AND ADMINISTRATION OF HUMAN RESOURCES POLICIES, PROCEDURES, AND PROGRAMS. RESPOND TO STAFF INQUIRIES OR REQUESTS REGARDING HR PROGRAMS OR REFERS TO APPROPRIATE STAFF MEMBER OR FACILITY SUPPORT CENTER FOR FURTHER ASSISTANCE AS NEEDED.ASSIST WITH THE IMPLEMENTATION, AND MAINTENANCE OF AN ON-GOING RECRUITING PROGRAM FOR STAFFING NEEDS.\n\n\nQUALIFICATIONS\n\nHIGH SCHOOL DIPLOMA, GED CERTIFICATION OR EQUIVALENT IS REQUIRED.TWO YEARS OF EXPERIENCE IN FULL-TIME CLERICAL OR ADMINISTRATIVE OFFICE WORK IS REQUIRED, PREFERABLY IN HUMAN RESOURCES ADMINISTRATION. ADDITIONAL QUALIFYING EDUCATION AT AN ACCREDITED COLLEGE, BUSINESS SCHOOL OR TECHNICAL INSTITUTE IN OFFICE ADMINISTRATION OR A RELATED FIELD MAY BE SUBSTITUTED FOR THE REQUIRED EXPERIENCE ON A YEAR-FOR-YEAR BASIS UP TO ONE YEAR.EXPERIENCE IN MICROSOFT OFFICE APPLICATIONS OR OTHER SIMILAR SOFTWARE APPLICATIONS IS REQUIRED.KNOWLEDGE OF JD EDWARDS AND KRONOS IS STRONGLY PREFERRED.A VALID DRIVER'S LICENSE IS REQUIRED.MINIMUM AGE REQUIREMENT: MUST BE AT LEAST 21 YEARS OF AGE. \n\n\nCORECIVIC IS A DRUG-FREE WORKPLACE AND EOE-INCLUDING DISABILITY/VETERAN.",
    "job_skill_set": [
      "human resources administration",
      "payroll administration",
      "employee benefits",
      "performance management",
      "recruiting",
      "Kronos",
      "clerical functions",
      "office administration",
      "independent judgment",
      "communication",
      "teamwork",
      "problem solving",
      "attention to detail",
      "customer service",
      "compliance",
      "Microsoft Office",
      "JD Edwards"
    ],
    "short_keywords": [
      "administration",
      "assistant",
      "attention",
      "benefits",
      "clerical",
      "communication",
      "compliance",
      "customer",
      "detail",
      "edwards",
      "employee",
      "functions",
      "hr",
      "human",
      "independent",
      "jd",
      "judgment",
      "kronos",
      "management",
      "microsoft",
      "office",
      "payroll",
      "performance",
      "problem",
      "recruiting",
      "resources",
      "service",
      "solving",
      "teamwork",
      "to"
    ]
  },
  {
    "job_id": "3887485850",
    "job_title": "Human Resources Manager",
    "category": "HR",
    "job_description": "HUMAN RESOURCES MANAGERSALARY: $95,000-$105,000\nOUR CLIENT IN NIAGARA FALLS, NY IS IN SEARCH OF A HUMAN RESOURCES MANAGER TO OVERSEE EMPLOYEE RELATIONS, STAFFING, PERFORMANCE MANAGEMENT, AND HR ADMINISTRATION FOR APPROXIMATELY 200 EMPLOYEES AT A SINGLE SITE.\nRESPONSIBILITIES:FOSTER POSITIVE EMPLOYEE RELATIONS AND ENGAGEMENT THROUGH PROACTIVE COMMUNICATION AND PROGRAMS.COLLABORATE WITH PLANT STAFF TO ENSURE CONSISTENT APPLICATION OF POLICIES AND GUIDELINES.CONDUCT CONFIDENTIAL INVESTIGATIONS REGARDING EMPLOYEE CONCERNS AND COMPLAINTS.INTERPRET AND ENFORCE HR POLICIES AND PROCEDURES.SERVE AS A KEY ADVISOR TO LEADERS ON HR MATTERS.PROVIDE SUPPORT FOR PERFORMANCE MANAGEMENT AND MERIT PLANNING PROCESSES.ENSURE COMPLIANCE WITH FEDERAL AND STATE REQUIREMENTS.MANAGE MULTIPLE ASSIGNMENTS WITH STRONG ORGANIZATIONAL SKILLS.UTILIZE DATA-DRIVEN INSIGHTS TO IMPROVE DECISION-MAKING.FACILITATE LEADERSHIP DEVELOPMENT AND TRAINING PROGRAMS.\nQUALIFICATIONS:BACHELOR'S DEGREE IN HUMAN RESOURCE MANAGEMENT OR RELATED FIELD REQUIRED; ADVANCED DEGREE PREFERRED.PHR OR SPHR CERTIFICATION PREFERRED.7+ YEARS OF HR MANAGEMENT EXPERIENCE, INCLUDING UNIONIZED MANUFACTURING PLANT EXPERIENCE.STRONG KNOWLEDGE OF EMPLOYMENT LAWS AND REGULATIONS.EXCELLENT COMMUNICATION AND INTERPERSONAL SKILLS.PROFICIENCY IN MICROSOFT OFFICE SUITE.\nJOIN THIS EXCITING COMPANY IN SHAPING A POSITIVE WORKPLACE CULTURE!\nTO APPLY, PLEASE SEND YOUR RESUME TO WNYJOBS@CPSRECRUITER.COM TODAY!\nCPS RECRUITMENT IS AN EOE",
    "job_skill_set": [
      "HR Management",
      "Employee Relations",
      "Performance Management",
      "HR Administration",
      "Data Analysis",
      "Employment Laws",
      "Microsoft Office Suite",
      "Unionized Manufacturing Experience",
      "PHR/SPHR Certification",
      "Communication",
      "Interpersonal Skills",
      "Organizational Skills",
      "Collaboration",
      "Problem Solving",
      "Leadership Development",
      "Proactive Engagement"
    ],
    "short_keywords": [
      "administration",
      "analysis",
      "certification",
      "collaboration",
      "communication",
      "data",
      "development",
      "employee",
      "employment",
      "engagement",
      "experience",
      "hr",
      "human",
      "interpersonal",
      "laws",
      "leadership",
      "management",
      "manager",
      "manufacturing",
      "microsoft",
      "office",
      "organizational",
      "performance",
      "phrsphr",
      "proactive",
      "problem",
      "relations",
      "resources",
      "skills",
      "solving",
      "suite",
      "unionized"
    ]
  },
  {
    "job_id": "3900944058",
    "job_title": "Human Resource Specialist",
    "category": "HR",
    "job_description": "DISCOVER YOUR PURPOSE!\n\nDISCOVERY SENIOR LIVING RANKS PROMINENTLY AMONG THE 5 LARGESTSENIOR HOUSING PROVIDERS IN THE US, AND IS NATIONALLY RENOWNED FOR DESIGNING,DEVELOPING, MARKETING, AND OPERATING A MULTI-BRAND PORTFOLIO OF UPSCALE, LUXURYSENIOR-LIVING COMMUNITIES. WITH OVER 250 COMMUNITIES IN NEARLY 40STATES, AND 15,000 DEDICATED EMPLOYEES, DISCOVERY SENIOR LIVING, WITH MULTIPLENATIONAL BRANDS, IS ONE THE LARGEST AND FASTEST GROWING SENIOR LIVING COMPANIESIN THE UNITED STATES. RECOGNIZED AS A GREAT PLACE TO WORK, DISCOVERY CONTINUESITS RAPID GROWTH TRAJECTORY TO LEAD THE INDUSTRY IN PROVIDING DESIRABLECOMMUNITIES AND EXCEPTIONAL LIFESTYLE AND VALUE FOR OUR RESIDENTS ALL WHILERETAINING OUR FAMILY-FIRST CULTURE. WE’RE A 30-YEAR-OLD INNOVATIVE COMPANY WITHA RICH HISTORY OF DELIVERING EXCEPTIONAL SERVICE AND QUALITY CARE IN DESIRABLE,ENRICHING RESIDENTIAL ENVIRONMENTS.\n\nDISCOVERY SENIOR LIVING IS HIRING A HUMAN RESOURCE SPECIALIST FOR OUR COMMUNITY DISCOVERY VILLAGE AT BOYNTON BEACH!\n\nTHE HUMAN RESOURCE SPECIALIST IS RESPONSIBLE FOR POSTING OPEN POSITIONS, ONBOARDING AND ORIENTATION OF TEAM MEMBERS, PAYROLL AND ASSISTS WITH VARIOUS HUMAN RESOURCE RELATED TASKS.\n\nRESPONSIBILITIES\n\nPOSTS ALL OPEN POSITIONS FOR THE COMMUNITY AND MONITORS APPLICANT FLOW.COMMUNICATES REGULARLY WITH ED AND DEPARTMENT HEADS ON THE STATUS OF RECRUITMENT EFFORTS.INITIATES ALL REQUIRED BACKGROUND CHECKS POST OFFER.UPON OFFER ACCEPTANCE, INITIATES ELECTRONIC ONBOARDING ENSURING THE NEW HIRE COMPLETES THE INFORMATION TIMELY.ENSURES THE NEW HIRE MATERIALS/FORMS AND DOCUMENTS ARE PROFESSIONAL AND APPROPRIATE MEETING DISCOVERY AND REGULATORY REQUIREMENTS.ENSURES ALL NEW HIRES COMPLETE REQUIRED NEW HIRE DOCUMENTATION AND TRAINING TIMELY AND ACCORDING TO REGULATORY REQUIREMENTS.CONDUCTS A PROFESSIONAL AND THOROUGH ORIENTATION WITH NEW HIRES, ENSURING A SMOOTH TRANSITION INTO THE COMMUNITY AND DEPARTMENT.MONITORS ONLINE LEARNING PORTAL CLASSES FOR THE NEW HIRE ENSURING THE NEW HIRE UNDERSTANDS HOW TO ACCESS AND COMPLETES THE TRAINING TIMELY.MONITORS AND FOLLOWS UP ON ALL PPD TESTING REQUIREMENTS, ALL LICENSE RENEWALS, BACKGROUND CHECKS AND I-9S.RESPONDS TIMELY TO ALL ACTIVE AND TERMED TEAM MEMBER QUESTIONS.PROVIDES HUMAN RESOURCE POLICY GUIDANCE TO BOTH TEAM MEMBERS AND LEADERSHIP. ENSURES HUMAN RESOURCE RELATED POLICIES ARE CONSISTENTLY FOLLOWED.COLLABORATES WITH REGIONAL HR DIRECTOR REGARDING PERFORMANCE MANAGEMENT PROBLEMS (DISCIPLINARY ACTIONS). ENSURES ED AND REGIONAL HR DIRECTOR ARE APPRISED OF SERIOUS ALLEGATIONS AND CONCERNS SUCH AS DISCRIMINATION AND HARASSMENT.STRICTLY MAINTAINS CONFIDENTIALITY RELATED TO EMPLOYMENT MATTERS.ENSURES TEAM MEMBER APPRECIATION ACTIVITIES ARE CARRIED OUT CONSISTENTLY AND MAINTAINS A PULSE ON TEAM MEMBER FEEDBACK/OPINIONS.RUNS TEAM MEMBER REPORTS MONTHLY AND MONITORS STATUS OF CURRENT TEAM MEMBERS. ENSURES APPROPRIATE DOCUMENTATION IS SUBMITTED BY DEPARTMENT HEAD FOR ALL CHANGES.ENSURES DOCUMENTED APPROVALS ARE SUBMITTED BY DEPARTMENT HEADS ON CHANGE FORMS. UPDATES AND MAINTAINS ACCURATE TEAM MEMBER INFORMATION IN THE HRIS. ENSURES DEPARTMENT HEADS HAVE REVIEWED AND UPDATED THEIR TEAM MEMBERS’ HOURS EACH PAYROLL AND PULLS APPLICABLE PAYROLL REPORTS/FILES AND FORWARDS TO PAYROLL PARTNER TIMELY.PROVIDES ANNIVERSARY REPORTS TO DEPARTMENT HEADS ON A MONTHLY BASIS AND ENSURES REVIEWS ARE ISSUED TIMELY.ENSURES TEAM MEMBER INJURIES ARE DOCUMENTED AND FORWARDED TO W/C PARTNER TIMELY. MONITORS STATUS OF INJURY/LIGHT DUTY AND ENSURES APPROPRIATE MEDICAL DOCUMENTATION IS SUBMITTED TIMELY.CONDUCTS EXIT INTERVIEWS AND PREPARES MONTHLY/QUARTERLY SUMMARY FOR ED.RESPONDS TO UNEMPLOYMENT CLAIM DETAIL REQUESTS AND SUBMITS REQUIRED DOCUMENTATION TIMELY.ASSISTS WITH PREPARATION AND MONITORS ALL MONTHLY BILLING AND COLLECTION PROCESSES UTILIZING ESTABLISHED POLICIES, PROCEDURES AND TRACKING SYSTEMS.CONTRIBUTES AND ASSISTS WITH THE COMPILATION OF INFORMATION FOR WEEKLY REPORTS.\n\nSUPERVISORY RESPONSIBILITIES\n\nCARRIES OUT SUPERVISORY RESPONSIBILITIES IN ACCORDANCE WITH THE ORGANIZATION'S POLICIES AND APPLICABLE LAWS. RESPONSIBILITIES INCLUDE INTERVIEWING, HIRING, AND TRAINING EMPLOYEES; PLANNING, ASSIGNING, AND DIRECTING WORK; APPRAISING PERFORMANCE; REWARDING AND DISCIPLINING EMPLOYEES.\n\nQUALIFICATIONS\n\nASSOCIATES DEGREE PREFERRED.ONE TO THREE YEARS RELATED EXPERIENCE AND/OR TRAINING; OR EQUIVALENT COMBINATION OF EDUCATION AND EXPERIENCESTRONG JUDGEMENT AND DECISION MAKING SKILLSKNOWLEDGE AND EXPERIENCE STATE AND FEDERAL EMPLOYMENT REGULATIONSPROFICIENCY WITH MICROSOFT OFFICESTRONG ORGANIZATIONAL AND MULTI-TASKING SKILLS ARE A MUST\n\nBENEFITS\n\nIN ADDITION TO A REWARDING CAREER AND COMPETITIVE SALARY, DISCOVERY ALSO OFFERS A COMPREHENSIVE BENEFIT PACKAGE. ELIGIBLE TEAM MEMBERS ARE OFFERED A COMPREHENSIVE BENEFIT PACKAGE INCLUDING MEDICAL, DENTAL, VISION, LIFE AND DISABILITY INSURANCES, PAID TIME OFF AND PAID HOLIDAYS. TEAM MEMBERS ARE ELIGIBLE TO PARTICIPATE IN OUR OUTSTANDING 401(K) PLAN WITH COMPANY MATCH OUR EMPLOYEE ASSISTANCE PROGRAM.\n\nEOE D/V\n\nJOB CODE: 1002464",
    "job_skill_set": [
      "HRIS",
      "Payroll Management",
      "Background Checks",
      "Onboarding",
      "Employment Regulations",
      "Multi-tasking",
      "Reporting",
      "Communication",
      "Judgment",
      "Decision Making",
      "Organizational Skills",
      "Teamwork",
      "Confidentiality",
      "Problem Solving",
      "Microsoft Office"
    ],
    "short_keywords": [
      "background",
      "checks",
      "communication",
      "confidentiality",
      "decision",
      "employment",
      "hr",
      "hris",
      "human",
      "judgment",
      "making",
      "management",
      "microsoft",
      "multitasking",
      "office",
      "onboarding",
      "organizational",
      "payroll",
      "problem",
      "regulations",
      "reporting",
      "resource",
      "skills",
      "solving",
      "specialist",
      "teamwork"
    ]
  },
  {
    "job_id": "3904726452",
    "job_title": "Sr. Manager, Human Resources Business Partner (HRBP)",
    "category": "HR",
    "job_description": "DESCRIPTION\n\nABOUT NEIGHBORWORKS AMERICA\n\nHAVE YOU EVER WORKED FOR AN ORGANIZATION WHERE THE TOTAL REWARDS PACKAGE INCLUDED A 401(K) MATCH UP TO 12%? DO YOU IMAGINE A COLLABORATIVE, DIVERSE AND FLEXIBLE HYBRID WORK ENVIRONMENT FOR YOURSELF? HAVE YOU DREAMED ABOUT BEING PART OF AN ORGANIZATION THAT INVESTS IN YOUR PROFESSIONAL DEVELOPMENT AND CAREER GROWTH?\n\nYOU FOUND US! AT NEIGHBORWORKS AMERICA, YOU WOULD BE SURROUNDED BY TEAMS AND PEOPLE WHO CHALLENGE YOU, ENCOURAGE YOU AND INSPIRE YOU TO SUPPORT OUR MISSION-ORIENTED WORK. THIS OPPORTUNITY OFFERS AN IMPRESSIVE TOTAL REWARDS PACKAGE THAT INCLUDES\n\nA 401(K) MATCH OF UP TO 12%,11 PAID AND OBSERVED HOLIDAYS,A SUBSTANTIAL LEAVE PACKAGE (INCLUDING 40 HOURS OF PAID VOLUNTEER LEAVE),INDUSTRY LEADING BENEFITS, ANDACCESS TO OUR STAFF TRAINING AND EDUCATION (STEP) PROGRAM, WHICH PROVIDES TRAINING AND EDUCATIONAL RESOURCES TO ALL NEIGHBORWORKS AMERICA STAFF.\n\nOUR BENEFITS ARE DESIGNED TO CONVEY COMPANY CULTURE AND CORE VALUES: ACCOUNTABILITY, COLLABORATION, INCLUSION, STEWARDSHIP AND INTEGRITY. THEY’RE ALSO INTENDED TO SUPPORT OUR STAFF IN A WAY THAT ENCOURAGES THEM TO GIVE THEIR BEST IN A BALANCE OF WORK AND PERSONAL LIFE.\n\nAT NEIGHBORWORKS, OUR PEOPLE ARE HUMBLE, PASSIONATE AND CREATIVE. WE LEAD WITH EMPATHY, ENCOURAGE CURIOSITY AND EMBRACE AMBIGUITY. FOR MORE THAN 45 YEARS, NEIGHBORHOOD REINVESTMENT CORP., A NATIONAL, NONPARTISAN NONPROFIT KNOWN AS NEIGHBORWORKS AMERICA, HAS STRIVED TO MAKE EVERY COMMUNITY A PLACE OF OPPORTUNITY. OUR NETWORK OF EXCELLENCE INCLUDES NEARLY 250 MEMBERS IN EVERY STATE, THE DISTRICT OF COLUMBIA AND PUERTO RICO. NEIGHBORWORKS OFFERS GRANT FUNDING, PEER EXCHANGE, TECHNICAL ASSISTANCE, EVALUATION TOOLS, AND ACCESS TO TRAINING AS THE NATION'S LEADING TRAINER OF HOUSING AND COMMUNITY DEVELOPMENT PROFESSIONALS. NEIGHBORWORKS NETWORK ORGANIZATIONS PROVIDE RESIDENTS IN THEIR COMMUNITIES WITH AFFORDABLE HOMES, OWNED AND RENTED; FINANCIAL COUNSELING AND COACHING; COMMUNITY BUILDING THROUGH RESIDENT ENGAGEMENT; AND COLLABORATION IN THE AREAS OF HEALTH, EMPLOYMENT, AND EDUCATION.\n\nWORK AT A GLANCE: CLIENT-FOCUSED SENIOR LEVEL HR GENERALIST \n\nREPORTING TO THE SENIOR VICE PRESIDENT OF HUMAN RESOURCES (SVP, HR), THE SENIOR MANAGER, HUMAN RESOURCES BUSINESS PARTNER (SM, HRBP) WILL BE RESPONSIBLE FOR SERVING AS A STRONG BUSINESS PARTNER TO OUR INTERNAL CLIENTS AND IS EXPECTED TO DELIVER EFFECTIVE STRATEGIC AND TACTICAL HR SOLUTIONS AND RECOMMENDATIONS FOR PEOPLE-RELATED ISSUES, CONCERNS, AND OPPORTUNITIES. THIS ROLE SERVES AS A CONNECTOR BETWEEN HR AND THE BUSINESS. THE SELECTED CANDIDATE WILL SERVE AS THE OBJECTIVE FIRST-LINE HR EXPERT TO MANAGERS AND EMPLOYEES. THIS ROLE WILL SERVE AS A BUSINESS PARTNER TO THE ORGANIZATION AND IS RESPONSIBLE FOR MANAGING ONE HRBP. THE SM, HRBP COLLABORATES WITH OTHER INTERNAL HUMAN RESOURCES PROFESSIONALS ON ALL HR MATTERS IN SUPPORT OF THE HR STRATEGY AND ORGANIZATIONAL GOALS OF NEIGHBORWORKS® AMERICA.WORKS CLOSELY WITH THE SVP, HR, NEIGHBORWORKS AMERICA OFFICERS, AND OTHER SENIOR LEADERSHIP TO MANAGE, DEVELOP, AND DRIVE THE IMPLEMENTATION OF HR STRATEGIES AND CHANGE MANAGEMENT INITIATIVES THAT ALIGN WITH THE BUSINESS PRIORITIES AND GOALS.COACHES BUSINESS LEADERS AND PEOPLE MANAGERS ON HR POLICIES AND PROCESSES, INCLUDING TALENT PLANNING, LEARNING AND DEVELOPMENT, AND PERFORMANCE MANAGEMENT TO PROMOTE ENGAGEMENT AND A CULTURE OF CONTINUOUS GROWTH AND DEVELOPMENT.MANAGES THE HRIS PERFORMANCE AND ANALYTICS TEAM TO PROVIDE DATA THAT INFLUENCES ORGANIZATIONAL DECISION-MAKING WITH THE USE OF RELEVANT, VALUE-ADDED METRICS AND DATA.\nSUPERVISOR: SENIOR VICE PRESIDENT OF HUMAN RESOURCES\n\nDIRECT REPORTS: 1\n\nFISCAL RESPONSIBILITIES: NONE\n\nPOSITION REQUIREMENTS\n\nREQUIRED MINIMUM QUALIFICATIONS\n\nEDUCATION: COLLEGE LEVEL DEGREE, CERTIFICATION(S) AND/OR EQUIVALENT RELEVANT WORK EXPERIENCE\n\nEXPERIENCE\n\nTEN (10) YEARS OF PROGRESSIVE HUMAN RESOURCES EXPERIENCE AS AN HR BUSINESS PARTNER, WORKING IN A DYNAMIC ENVIRONMENT OR IN AN EQUIVALENT ROLE EFFECTIVELY PARTNERING WITH AND DELIVERING QUALITY HR SERVICES TO INTERNAL CLIENTS/STAKEHOLDERS.FIVE (5) YEARS’ EXPERIENCE MANAGEMENT EXPERIENCE, PREFERABLY MANAGING HR BUSINESS PARTNERS.\n\nTECHNOLOGY: PROFICIENCY WITH MICROSOFT OFFICE APPLICATIONS (OUTLOOK, WORD, EXCEL, POWERPOINT AND ACCESS) REQUIRED.PREVIOUS EXPERIENCE WITH HRIS AND PERFORMANCE MANAGEMENT SYSTEMS (PMS).\n\nWORKING CONDITIONS\n\nTRAVEL: UP TO 10%PHYSICAL/SENSORY DEMANDS: FAST-PACED WORKING ENVIRONMENT WITH EXTENSIVE COMPUTER USAGEHYBRID: THIS ROLE REPORTS INTO THE OFFICE 2 DAYS PER WEEK.\n\nNEIGHBORWORKS AMERICA STAFF ARE EXPECTED TO DEMONSTRATE EXCELLENCE IN THE FOLLOWING:\n\nSENSITIVITY TO RACIAL, GENDER, SEXUAL ORIENTATION AND CULTURAL DIFFERENCES.RESPECTFUL, TIMELY AND EFFECTIVE COMMUNICATIONS WITH INTERNAL AND EXTERNAL STAKEHOLDERS.EFFECTIVE LISTENING AS WELL AS SEEKING AND ACCEPTING FEEDBACK.SUCCESSFUL TEAMWORK.ANALYTIC, THOUGHTFUL, AND STRATEGIC THINKING.CONSIDERATION OF NEIGHBORWORKS’ MISSION, OBJECTIVES, AND GOALS TO DEMONSTRATE THE UNDERSTANDING THAT ONE’S IMPACT, DECISIONS AND BEHAVIOR HAS AMONG COLLEAGUES AND ON THE ORGANIZATION.\n\nHR’S PURPOSE\n\nHR DEVELOPS AND IMPLEMENTS INNOVATIVE HUMAN RESOURCES PROGRAMS THAT ENABLE NEIGHBORWORKS AMERICA TO ATTRACT, DEVELOP AND RETAIN THE BEST AND BRIGHTEST DIVERSE TALENT TO ACHIEVE NEIGHBORWORKS’ MISSION. AS A STRATEGIC PARTNER WITH MANAGEMENT, HR\n\nDEVELOPS CREATIVE RECRUITMENT PLANS;DEVELOPS AND IMPLEMENTS COMPETITIVE COMPREHENSIVE TOTAL COMPENSATION INCLUDING BENEFITS, INCENTIVES, AWARDS AND SALARIES.PROVIDES EMPLOYEE DEVELOPMENT, LEADERSHIP AND PROGRAMS TO HELP EMPLOYEES RETAIN TECHNICAL SKILLS; ANDIMPLEMENTS QUALITY-OF-LIFE INITIATIVES THAT PROVIDE INCREASED FLEXIBILITY FOR MANAGERS AND EMPLOYEES AND ALLOW NEIGHBORWORKS TO COMPETE FOR AND RETAIN HIGHLY SKILLED EMPLOYEES.\n\nEOE STATEMENT WE ARE AN EQUAL EMPLOYMENT OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, NATIONAL ORIGIN, DISABILITY STATUS, PROTECTED VETERAN STATUS OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW.",
    "job_skill_set": [
      "HR Business Partnering",
      "Human Resources Management",
      "Performance Management Systems",
      "HRIS Proficiency",
      "Talent Planning",
      "Learning and Development",
      "Change Management",
      "Recruitment Strategies",
      "Communication",
      "Teamwork",
      "Empathy",
      "Strategic Thinking",
      "Cultural Sensitivity",
      "Feedback Acceptance",
      "Problem Solving",
      "Adaptability",
      "Collaboration",
      "Microsoft Office Suite",
      "Data Analysis",
      "Creativity"
    ],
    "short_keywords": [
      "acceptance",
      "adaptability",
      "analysis",
      "and",
      "business",
      "change",
      "collaboration",
      "communication",
      "creativity",
      "cultural",
      "data",
      "development",
      "empathy",
      "feedback",
      "hr",
      "hrbp",
      "hris",
      "human",
      "learning",
      "management",
      "manager",
      "microsoft",
      "office",
      "partner",
      "partnering",
      "performance",
      "planning",
      "problem",
      "proficiency",
      "recruitment",
      "resources",
      "sensitivity",
      "solving",
      "sr",
      "strategic",
      "strategies",
      "suite",
      "systems",
      "talent",
      "teamwork",
      "thinking"
    ]
  },
  {
    "job_id": "3891805744",
    "job_title": "Human Resources Administrator",
    "category": "HR",
    "job_description": "SUMMARY:  WE ARE SEEKING A HIGHLY MOTIVATED, FLEXIBLE, ORGANIZED, AND DETAIL ORIENTED HUMAN RESOURCES ADMINISTRATOR TO JOIN OUR TEAM. YOU WILL BE THE PRIMARY POINT OF CONTACT FOR HR ADVICE, ONBOARDING, EMPLOYEE RELATIONS, LEAVE MANAGEMENT, OFFBOARDING, TRAVEL, AND GENERAL ADMINISTRATION IN THE REGION.  WHAT YOU WILL DO:  COMPLETE THE FORM I-9 PROCESS. ISSUE IDENTITY CARDS AND ASSETS TO THE NEW JOINERS. ORIENT THE NEW JOINERS ON RELEVANT POLICIES, PROCESSES, AND PROCEDURES. SCHEDULE THE BACKGROUND VERIFICATION AND DRUG SCREENS AS REQUIRED. CREATE AND MAINTAIN THE EMPLOYEE HANDBOOK FOR NORTH AMERICA REGION. HANDLE THE EMPLOYEE INSURANCE PROCESS AND RELATED DOCUMENTATION. MAINTAIN UP-TO-DATE EMPLOYEE RECORDS. ACCURATELY TRACK, DOCUMENT, AND REPORT THE LEAVE BALANCE OF EMPLOYEES. MONITOR THE HR MAILBOX AND PROMPTLY RESPOND TO EMPLOYEE INQUIRIES. ADDRESS THE QUERIES AND GRIEVANCES OF EMPLOYEES. OFFER A SMOOTH OFFBOARDING EXPERIENCE THROUGH PROPER COMMUNICATION AND COORDINATION. INITIATE AND/OR DRIVE PROCESS AND SYSTEM IMPROVEMENT PROJECTS. MANAGE ALL ASPECTS OF GENERAL ADMINISTRATION INCLUDING, BUT NOT LIMITED TO, ASSET MANAGEMENT, OFFICE SPACE/INSURANCE RENEWAL, CHECK COLLECTION AND DEPOSIT, FEDEX SHIPMENT, TRAVEL, AND GENERAL CLIENT RELATIONS. ENSURE COMPLIANCE WITH FEDERAL, STATE, AND LOCAL EMPLOYMENT LAWS AND REGULATIONS.  WHAT YOU WILL BRING:  BACHELOR’S DEGREE WITH 3-5 YEARS OF RELEVANT EXPERIENCE. EXTENSIVE KNOWLEDGE OF OFFICE MANAGEMENT SYSTEMS AND PROCEDURES. PROFICIENCY IN THE MICROSOFT OFFICE SUITE.  WHAT COULD DIFFERENTIATE YOU:  STRONG VERBAL AND WRITTEN COMMUNICATION SKILLS. EXCELLENT INTERPERSONAL SKILLS AND ABILITY TO INTERACT WITH ALL LEVELS OF EMPLOYEES. PROVEN APTITUDE FOR PROCESS AND SYSTEM DESIGN. AWARENESS OR PRIOR EXPERIENCE RELATED TO AGILE HR IMPLEMENTATION. HIGH LEVEL OF ORGANIZATIONAL SKILLS, PROBLEM-SOLVING ABILITY, AND ATTENTION TO DETAIL. HIGH DEGREE OF INITIATIVE, FLEXIBILITY, AND ADAPTABILITY. ABILITY TO ACT WITH INTEGRITY, PROFESSIONALISM, AND CONFIDENTIALITY.  NOTE: THIS POSITION DESCRIPTION INCORPORATES THE CORE RESPONSIBILITIES OF THE JOB. IT RECOGNIZES THAT OTHER RELATED DUTIES NOT SPECIFICALLY MENTIONED MIGHT ALSO BE PERFORMED, AND THAT NOT ALL RESPONSIBILITIES MAY BE CARRIED OUT, DEPENDING ON THE OPERATIONAL NEEDS.  ABOUT TRUNDL:  TRUNDL IS AN ISO/IEC 27001:2022 CERTIFIED PLATINUM ENTERPRISE ATLASSIAN SOLUTION PARTNER WITH OFFICES IN THE US, CANADA, AND INDIA. ATLASSIAN PARTNERS PROVIDE STRATEGIC CONSULTING AND HANDS-ON SUPPORT TO ATLASSIAN'S 250,000+ WORLDWIDE CUSTOMERS. WE SERVE A WIDE RANGE OF COMPANIES AND ATLASSIAN USE CASES.  BENEFITS:  DENTAL INSURANCE VISION INSURANCE HEALTH INSURANCE LIFE INSURANCE PAID TIME OFF  SCHEDULE:  DAY SHIFT MONDAY TO FRIDAY  WORK LOCATION:  THE INCUMBENT IS REQUIRED TO WORK FROM OUR OFFICE IN SAN JOSE, CALIFORNIA.  PAY:  UP TO USD 80,000  EEO STATEMENT:  TRUNDL IS AN EQUAL OPPORTUNITY EMPLOYER. WE VALUE DIVERSITY AND ARE COMMITTED TO PROVIDING A WORKPLACE FREE FROM DISCRIMINATION. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, NATIONAL ORIGIN, AGE, DISABILITY, OR ANY OTHER PROTECTED STATUS UNDER APPLICABLE LAWS.",
    "job_skill_set": [
      "HR Management",
      "Onboarding",
      "Employee Relations",
      "Documentation",
      "Microsoft Office Suite",
      "Process Improvement",
      "Compliance",
      "Background Verification",
      "Communication",
      "Interpersonal Skills",
      "Organizational Skills",
      "Problem Solving",
      "Attention to Detail",
      "Initiative",
      "Integrity",
      "Professionalism",
      "Confidentiality",
      "Leave Management",
      "Office Management Systems",
      "Flexibility"
    ],
    "short_keywords": [
      "administrator",
      "attention",
      "background",
      "communication",
      "compliance",
      "confidentiality",
      "detail",
      "documentation",
      "employee",
      "flexibility",
      "hr",
      "human",
      "improvement",
      "initiative",
      "integrity",
      "interpersonal",
      "leave",
      "management",
      "microsoft",
      "office",
      "onboarding",
      "organizational",
      "problem",
      "process",
      "professionalism",
      "relations",
      "resources",
      "skills",
      "solving",
      "suite",
      "systems",
      "to",
      "verification"
    ]
  },
  {
    "job_id": "3900077027",
    "job_title": "Human Resources Manager",
    "category": "HR",
    "job_description": "THE IDEAL CANDIDATE WILL SUPPORT THE FULL SCOPE OF HUMAN RESOURCES RESPONSIBILITIES AND PARTNER WITH THE ORGANIZATION ON STRATEGIC INITIATIVES. THEY WILL MAINTAIN AND ENHANCE THE ORGANIZATION'S HUMAN RESOURCES BY PLANNING, IMPLEMENTING, AND EVALUATING HUMAN RESOURCES POLICIES, PROGRAMS, AND PRACTICES.  RESPONSIBILITIESRECRUITMENT AND ONBOARDING OF EMPLOYEESMANAGE EMPLOYEE PERFORMANCE, RELATIONS, PERFORMANCE, MENTORING, COACHING, ETC.DEVELOP AND DRIVE AN EMPLOYEE-ORIENTED CULTUREPROVIDE ANALYSIS AND RECOMMENDATIONS FOR ORGANIZATIONAL CHANGEMANAGE LEGAL COMPLIANCE TO MITIGATE RISKCOLLABORATE WITH MANAGERS TO PROVIDE COACHING THROUGH TALENT MANAGEMENT AND SUCCESSION PLANNING PROGRAMS / MANAGEMENT OF SUCCESSION PLANNING PROGRAMSPROVIDE ANALYSIS FOR COMPANY WAGE RATESIDENTIFY AND FORMULATE TRAINING POLICIES AND PROGRAMSSUPERVISE AND DIRECT HUMAN RESOURCES STAFFOTHER DUTIES AS ASSIGNED\nQUALIFICATIONS\nBACHELOR'S DEGREE OR RELEVANT EXPERIENCE5+ YEARS' EXPERIENCE IN HUMAN RESOURCESEXPERIENCE SUPPORTING AN HOURLY WORKFORCESHRM CERTIFICATION PREFERREDABILITY TO WORK IN A FAST PACED ENVIRONMENTEXPERIENCE WITH HRIS SYSTEMS",
    "job_skill_set": [
      "HR policies",
      "Recruitment",
      "Onboarding",
      "Employee performance management",
      "Legal compliance",
      "HRIS systems",
      "Training programs",
      "Data analysis",
      "Communication",
      "Collaboration",
      "Coaching",
      "Mentoring",
      "Problem solving",
      "Adaptability",
      "Strategic thinking",
      "Cultural development",
      "Succession planning",
      "HR certification"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "certification",
      "coaching",
      "collaboration",
      "communication",
      "compliance",
      "cultural",
      "data",
      "development",
      "employee",
      "hr",
      "hris",
      "human",
      "legal",
      "management",
      "manager",
      "mentoring",
      "onboarding",
      "performance",
      "planning",
      "policies",
      "problem",
      "programs",
      "recruitment",
      "resources",
      "solving",
      "strategic",
      "succession",
      "systems",
      "thinking",
      "training"
    ]
  },
  {
    "job_id": "3902862891",
    "job_title": "Human Resources Generalist",
    "category": "HR",
    "job_description": "HUMAN RESOURCES GENERALISTOUR HR GENERALIST PRIMARY RESPONSIBILITY WILL BE TO OVERSEE EMPLOYEE RELATIONS MATTERS AND MANAGE LEAVE ADMINISTRATION PROCESSES, WHILE ENSURING COMPLIANCE WITH COMPANY POLICIES AND LEGAL REGULATIONS. THE HR GENERALIST WILL ALSO PROVIDE HR SUPPORT AND COLLABORATE CLOSELY WITH THE DIRECTOR OF HUMAN RESOURCES TO MAINTAIN A POSITIVE WORK ENVIRONMENT AND SUPPORT THE NEEDS OF OUR DIVERSE WORKFORCE.\n RESPONSIBILITIES SERVE AS THE MAIN POINT OF CONTACT FOR EMPLOYEE RELATIONS ISSUES, INCLUDING INVESTIGATIONS, CONFLICT RESOLUTION, AND DISCIPLINARY ACTIONS.CONDUCT THOROUGH INVESTIGATIONS INTO EMPLOYEE COMPLAINTS OR CONCERNS, ENSURING FAIR AND CONSISTENT OUTCOMES.PROVIDE GUIDANCE AND SUPPORT TO MANAGERS AND EMPLOYEES ON HR POLICIES, PROCEDURES, AND BEST PRACTICES.DEVELOP AND IMPLEMENT STRATEGIES TO PROMOTE POSITIVE EMPLOYEE RELATIONS AND FOSTER A CULTURE OF OPEN COMMUNICATION AND COLLABORATION.MANAGE ALL ASPECTS OF LEAVE ADMINISTRATION, INCLUDING FMLA, ADA ACCOMMODATIONS, AND OTHER MEDICAL OR PERSONAL LEAVES.COORDINATE LEAVE REQUESTS, INCLUDING INTAKE, DOCUMENTATION, AND TRACKING OF LEAVE USAGE.COMMUNICATE EFFECTIVELY WITH EMPLOYEES, MANAGERS, AND EXTERNAL PARTNERS TO ENSURE COMPLIANCE WITH LEAVE POLICIES AND LEGAL REQUIREMENTS.MAINTAIN ACCURATE RECORDS AND DOCUMENTATION RELATED TO EMPLOYEE LEAVES AND ACCOMMODATIONS.ASSIST WITH VARIOUS HR FUNCTIONS, INCLUDING RECRUITMENT, BENEFITS ADMINISTRATIONS, ONBOARDING, PERFORMANCE MANAGEMENT, AND HRIS DATA MANAGEMENT.COLLABORATE WITH THE HR TEAM TO DEVELOP AND IMPLEMENT HR INITIATIVES AND PROGRAMS AIMED AT ENHANCING EMPLOYEE ENGAGEMENT AND RETENTION.STAY INFORMED ABOUT CHANGES IN EMPLOYMENT LAWS AND REGULATIONS AND ENSURE ORGANIZATIONAL COMPLIANCE.SUPPORT SPECIAL PROJECTS AND INITIATIVES AS ASSIGNED BY THE DIRECTOR OF HUMAN RESOURCES. BENEFITS401(K) MATCHINGDENTAL INSURANCEHEALTH INSURANCELIFE INSURANCEPAID TIME OFFRETIREMENT PLANVISION INSURANCE\n PREFERRED SKILLS / ABILITIES:STRONG UNDERSTANDING OF EMPLOYMENT LAWS AND REGULATIONS, INCLUDING FMLA, ADA, AND OTHER RELEVANT STATUTES.EXCELLENT COMMUNICATION AND INTERPERSONAL SKILLS, WITH THE ABILITY TO HANDLE SENSITIVE AND CONFIDENTIAL INFORMATION WITH DISCRETION.PROVEN ABILITY TO MANAGE MULTIPLE PRIORITIES AND DEADLINES WHILE MAINTAINING A HIGH LEVEL OF ACCURACY AND ATTENTION TO DETAIL.PROFICIENCY IN HRIS SYSTEMS AND MICROSOFT OFFICE SUITE.DEMONSTRATED PROBLEM-SOLVING SKILLS AND THE ABILITY TO WORK INDEPENDENTLY AS WELL AS PART OF A TEAM.\n EDUCATION AND EXPERIENCE:BACHELOR'S DEGREE IN HUMAN RESOURCES, BUSINESS ADMINISTRATION, OR RELATED FIELD PREFERRED. HR CERTIFICATION (E.G., SHRM-CP, PHR) PREFERRED.MINIMUM OF 3-5 YEARS OF HR EXPERIENCE, WITH A FOCUS ON EMPLOYEE RELATIONS AND LEAVE ADMINISTRATION.\n WHO WE ARECALIFORNIA RETINA CONSULTANTS (CRC) IS PART OF RETINA CONSULTANTS OF AMERICA (RCA), THE LARGEST NETWORK OF LEADING RETINA SPECIALISTS WITH THE MISSION OF SAVING SIGHT AND IMPROVING PATIENT LIVES THROUGH INNOVATION AND THE HIGHEST QUALITY CARE. THROUGH RCA'S PHYSICIAN-CENTERED PRACTICE MANAGEMENT MODEL, PHYSICIANS CONTINUE TO DRIVE CLINICAL AND PRACTICE CULTURE WHILE BENEFITING FROM THE AVAILABLE BUSINESS EXPERTISE, RESOURCES AND SHARED BEST PRACTICES. \nEQUAL OPPORTUNITY EMPLOYERCALIFORNIA RETINA CONSULTANTS IS PROUD TO BE AN EQUAL EMPLOYMENT OPPORTUNITY AND AN AFFIRMATIVE ACTION EMPLOYER. WE ARE COMMITTED TO CREATING AN INCLUSIVE WORK ENVIRONMENT THAT CELEBRATES DIVERSITY. \n ALL OFFERS ARE CONTINGENT UPON SATISFACTORY BACKGROUND CHECK AND PRE-EMPLOYMENT DRUG SCREEN.",
    "job_skill_set": [
      "employee relations",
      "Microsoft Office Suite",
      "recruitment",
      "data management",
      "confidential information handling",
      "communication",
      "interpersonal skills",
      "problem-solving",
      "attention to detail",
      "teamwork",
      "independence",
      "collaboration",
      "time management",
      "leave administration",
      "HRIS systems",
      "employment laws",
      "FMLA",
      "ADA",
      "benefits administration",
      "performance management",
      "conflict resolution"
    ],
    "short_keywords": [
      "ada",
      "administration",
      "attention",
      "benefits",
      "collaboration",
      "communication",
      "confidential",
      "conflict",
      "data",
      "detail",
      "employee",
      "employment",
      "fmla",
      "generalist",
      "handling",
      "hr",
      "hris",
      "human",
      "independence",
      "information",
      "interpersonal",
      "laws",
      "leave",
      "management",
      "microsoft",
      "office",
      "performance",
      "problemsolving",
      "recruitment",
      "relations",
      "resolution",
      "resources",
      "skills",
      "suite",
      "systems",
      "teamwork",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3904923034",
    "job_title": "Human Resources Manager",
    "category": "HR",
    "job_description": "WE ARE LOOKING FOR AN AMBITIOUS HUMAN RESOURCE MANAGER (HR MANAGER) TO SERVE AS THE LEADER OF A HUMAN RESOURCES TEAM. THIS IS A GREAT OPPORTUNITY FOR AN INDIVIDUAL LOOKING FOR A FAST-PACED WORK ENVIRONMENT WITH MANY OPPORTUNITIES FOR GROWTH. \nRESPONSIBILITIES: SUGGEST AND IMPLEMENT ADVANCED, BEST PRACTICES HR STRATEGIES AND PROCEDURESMANAGE AND OVERSEE THE WHOLE RECRUITING AND HIRING PROCESSOVERSEE PAYROLL SUBMISSIONS AND PAYMENTSSTRUCTURE COMPETITIVE BENEFITS PACKAGES, AND MEASURE THEIR SUCCESSPROMOTE HEALTHY RELATIONSHIPS BETWEEN STAFF AND MANAGEMENT THROUGH MEDIATION AND HANDLING LABOR DISPUTESADMINISTER PERFORMANCE REVIEW PROGRAM TO ENSURE EFFECTIVENESS, COMPLIANCE, AND EQUITY WITHIN ORGANIZATIONFACILITATE EMPLOYEE ON-BOARDING AND OFF-BOARDINGRESPONSIBLE FOR COLLECTING AND ANALYZING EMPLOYEE DATA AND MAINTAINING ACCURATE AND COMPLETE EMPLOYEE RECORDSEDUCATE, TRAIN AND SUPERVISE EMPLOYEES ON THE COMMON HR TOPICSTRACK AND ANALYZE RELEVANT HR METRICSCREATE REPORTS FOR SENIOR MANAGEMENT \nQUALIFICATIONS:\nPREVIOUS EXPERIENCE WORKING IN HR MANAGEMENTIN-DEPTH KNOWLEDGE OF HR OPERATIONS AND ANALYTICSFAMILIARITY WITH LABOR LAW RULES AND REGULATIONSIMPECCABLE COMMUNICATION, INTERPERSONAL AND LEADERSHIP SKILLS EXCELLENT ORGANIZATIONAL AND TIME-MANAGEMENT SKILLSBA IN HUMAN RESOURCES OR SIMILAR RELEVANT FIELDS",
    "job_skill_set": [
      "HR management",
      "recruiting",
      "payroll management",
      "benefits structuring",
      "performance review administration",
      "employee onboarding",
      "data analysis",
      "HR operations",
      "labor law knowledge",
      "report creation",
      "communication",
      "interpersonal skills",
      "leadership",
      "organizational skills",
      "time management",
      "mediation"
    ],
    "short_keywords": [
      "administration",
      "analysis",
      "benefits",
      "communication",
      "creation",
      "data",
      "employee",
      "hr",
      "human",
      "interpersonal",
      "knowledge",
      "labor",
      "law",
      "leadership",
      "management",
      "manager",
      "mediation",
      "onboarding",
      "operations",
      "organizational",
      "payroll",
      "performance",
      "recruiting",
      "report",
      "resources",
      "review",
      "skills",
      "structuring",
      "time"
    ]
  },
  {
    "job_id": "3901367788",
    "job_title": "Human Resources Coordinator",
    "category": "HR",
    "job_description": "DO YOU WANT TO WORK FOR A COMPANY WITH AN INCREDIBLY INNOVATIVE CULTURE? HOW ABOUT BEING A PART OF A HUMAN RESOURCES RECRUITING TEAM THAT VALUES THEIR CANDIDATE AND BUSINESS PARTNER EXPERIENCE? DO YOU LIKE CREATING CAREER PATHS FOR PEOPLE WITH A TREMENDOUS WORK ETHIC AND PASSION? IF SO, THIS IS THE PERFECT ROLE FOR YOU!WE ARE CURRENTLY SEEKING AN HR COORDINATOR TO DO JUST THAT FOR A FORTUNE 500 COMPANY. THE IDEAL CANDIDATE WILL HAVE A CUSTOMER SERVICE MINDSET AND BE A PEOPLE PERSON THAT CAN STAY ORGANIZED IN A VERY FAST-PACED ENVIRONMENT.\nYOU ARE:· SELF-DRIVEN; YOU HAVE INTEGRITY, SUPERIOR ORGANIZATIONAL SKILLS, AND GREAT FOLLOW-THROUGH ON TASKS.· BRAND AMBASSADOR; YOU’RE SELF-AWARE, WELL-SPOKEN ON THE PHONE, AND ELOQUENT IN EMAILS. YOU’RE RESPECTFUL OF THE CANDIDATE.· CHARISMATIC; YOU HAVE A PASSION FOR SOLVING PEOPLE'S PROBLEMS AND YOU’RE OBSESSIVE ABOUT CANDIDATE EXPERIENCE AND CAREER IMPROVEMENT.· NATURALLY CURIOUS; YOU CRAVE KNOWLEDGE AND THE OPPORTUNITY TO LEARN. YOU’RE CONTINUOUSLY LOOKING FOR WAYS TO IMPROVE.· FLEXIBLE + TEAM PLAYER; YOU’RE SHARP AS A TACK WITH THE ABILITY TO THINK OUTSIDE-THE-BOX. YOU’RE ABLE TO ADAPT TO CHANGE AND DON’T GET OVERWHELMED EASILY.\nYOU WILL:· ESCORT APPLICANTS AND CANDIDATES THROUGHOUT THE INTERVIEW PROCESS.· WORK IN OUTLOOK AND OTHER SYSTEMS TO SCHEDULE LARGE VOLUMES OF INTERVIEWS.· PARTNER WITH RECRUITERS TO BUILD RAPPORT; MAKE EACH CANDIDATE A TOP PRIORITY.· EFFECTIVELY SELL THE CULTURE AND VALUE OF THE COMPANY.· COMMUNICATE EFFECTIVELY VIA EMAIL, IN PERSON, AND PHONE.\nYOU HAVE:· BACHELOR’S DEGREE· EXPERIENCE USING AN APPLICANT TRACKING SYSTEM (ATS), CRM, OR OTHER COMPLEX PLATFORMS· 1+ YEARS STAFFING, ADMINISTRATIVE, OR HIGH TOUCH CUSTOMER SERVICE EXPERIENCE· ADVANCED KNOWLEDGE AND USE OF GOOGLE SUITE (MICROSOFT OFFICE WILL BE FINE TOO)· ABILITY TO MULTI-TASK AND NAVIGATE MULTIPLE SYSTEMS· ABILITY TO TAKE FEEDBACK AND CONTINUOUSLY PUSH YOURSELF· HIGH ATTENTION TO DETAIL· A PROCESS-DRIVEN MINDSET\nDIGITAL INTELLIGENCE SYSTEMS, LLC (DISYS) IS AN EQUAL OPPORTUNITY EMPLOYER THAT RECRUITS AND HIRES QUALIFIED CANDIDATES WITHOUT REGARD TO RACE, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, AGE, NATIONAL ORIGIN, ANCESTRY, CITIZENSHIP, DISABILITY, OR VETERAN STATUS.",
    "job_skill_set": [
      "Applicant Tracking System (ATS)",
      "Customer Relationship Management (CRM)",
      "Microsoft Office",
      "Organizational Skills",
      "Multi-tasking",
      "Customer Service Mindset",
      "Communication",
      "Problem Solving",
      "Adaptability",
      "Teamwork",
      "Self-Driven",
      "Attention to Detail",
      "Continuous Learning",
      "Google Suite"
    ],
    "short_keywords": [
      "adaptability",
      "applicant",
      "ats",
      "attention",
      "communication",
      "continuous",
      "coordinator",
      "crm",
      "customer",
      "detail",
      "google",
      "hr",
      "human",
      "learning",
      "management",
      "microsoft",
      "mindset",
      "multitasking",
      "office",
      "organizational",
      "problem",
      "relationship",
      "resources",
      "selfdriven",
      "service",
      "skills",
      "solving",
      "suite",
      "system",
      "teamwork",
      "to",
      "tracking"
    ]
  },
  {
    "job_id": "3895540768",
    "job_title": "Human Resource Generalist",
    "category": "HR",
    "job_description": "IT’S MORE THAN WHAT YOU DO: IT’S HOW YOU DO IT. THAT’S WHY O’MELVENY IS COUNSEL OF CHOICE TO AN EVER-EXPANDING LIST OF MARKET LEADERS. OPPORTUNITY AT O’MELVENY MEANS WORKING ALONGSIDE DYNAMIC AND TEAM-ORIENTED COLLEAGUES ON EVOLVING LEGAL AND BUSINESS ISSUES AND OPPORTUNITIES FOR PROMINENT CLIENTS AROUND THE WORLD. IT’S A PLACE TO BUILD A REWARDING CAREER BY TACKLING NEW CHALLENGES; BEING APPRECIATED, INCLUDED, AND SUPPORTED; AND CREATING LASTING CONNECTIONS.\n\nWITH APPROXIMATELY 800 LAWYERS ON THREE CONTINENTS, MORE THAN 80 PRACTICE AND INDUSTRY SERVICE AREAS, AND STRONG CULTURAL TIES TO ALL OF OUR 18 LOCATIONS, O’MELVENY IS A GLOBAL LAW FIRM WITH A LOCAL FEEL. AT OUR CORE, YOU’LL FIND A DEDICATION TO EXCELLENCE, A DRIVE TO LEAD AND INNOVATE, AND A DEEP SENSE OF CIVIC RESPONSIBILITY.\n\nAT O'MELVENY, WE KNOW OUR COMMITMENT TO DE&I CAN BE A TRUE DIFFERENTIATOR AND A KEY COMPONENT OF OUR SUCCESS. CREATING A TRULY INCLUSIVE ENVIRONMENT WHILE PROVIDING ADVANCEMENT AND LEADERSHIP OPPORTUNITIES FOR OUR LAWYERS AND BUSINESS PROFESSIONALS IS A STRATEGIC PRIORITY. IT’S WHO WE ARE. THE DIVERSE PERSPECTIVES AND EXPERIENCES THAT OUR PEOPLE BRING TO THEIR WORK DRIVE INNOVATION AND EXCELLENCE. WE ARE PROUD OF OUR ACHIEVEMENTS, BUT DE&I IS A WORK IN PROGRESS. IT ALWAYS WILL BE BECAUSE OUR PROFESSION, OUR COLLEAGUES, OUR CLIENTS, OUR COMMUNITIES, AND THEIR ISSUES KEEP CHANGING. SO MUST WE.\n\nTHE FIRM’S DE&I STRATEGY IS RISE (REPRESENTATION | INCLUSION | SOCIAL JUSTICE | EQUITY) AND WE EXPECT EVERY MEMBER OF OUR FIRM TO RISE TO THE CHALLENGE OF MAKING THE PROMISE OF DE&I REAL IN EVERY ASPECT OF OUR FIRM, INCLUDING IN THEIR INTERACTIONS WITH OTHERS AND THROUGH THE EXECUTION OF THEIR ROLE.\n\nSO, TELL US. WHAT DO YOU WANT TO ACHIEVE? VISIT US AT WWW.OMM.COM/OUR-FIRM/OUR-DNA ; READ OUR INSIGHTS 2024 REPORT; EXPLORE OUR FIRM AT-A-GLANCE ; AND FIND US ON LINKEDIN , X , FACEBOOK , INSTAGRAM , AND YOUTUBE .\n\nO'MELVENY HAS AN IMMEDIATE OPENING FOR A HUMAN RESOURCES GENERALIST IN OUR NEWPORT BEACH OFFICE. THE HUMAN RESOURCES GENERALIST IS RESPONSIBLE FOR PROVIDING SUPPORT TO ALL AREAS OF THE FIRMWIDE HUMAN RESOURCES DEPARTMENT, WHICH INCLUDES HR POLICIES AND PROCEDURES, REGULATORY COMPLIANCE, AND EMPLOYEE RELATIONS. THIS POSITION IS ALSO RESPONSIBLE FOR PROVIDING STRATEGIC SUPPORT ON KEY HR INITIATIVES AND PROJECTS.\n\nTHE SALARY RANGE IN CA FOR THIS ROLE IS $80,000 - $100,000 AND REPRESENTS THE FIRM’S GOOD FAITH MINIMUM AND MAXIMUM RANGE FOR THIS ROLE AT THE TIME OF POSTING.\n\nESSENTIAL DUTIES AND RESPONSIBILITIES\n\n PARTICIPATES IN ANNUAL AUDITS OF INTERNAL PROCESSES, DOCUMENTATION, AND JOB DESCRIPTIONS; ENSURES ACCURACY OF RESPONSIBILITIES, CONSISTENCY AND COMPLIANCE WITH FLSA AND APPLICABLE STATE LAWS.  PROPOSES CHANGES TO EXISTING POLICIES AND PROCEDURES TO ENSURE CONTINUED COMPLIANCE WITH FEDERAL, STATE AND, LOCAL LAWS.  MANAGES AND STREAMLINES THE LIFECYCLE PROCESSES OF AN EMPLOYEE, WHICH INCLUDES ONBOARDING, TRAINING, PERFORMANCE MANAGEMENT, DEVELOPMENT, AND TERMINATIONS IN ACCORDANCE WITH FIRM OBJECTIVES, AS WELL AS FEDERAL AND STATE REQUIREMENTS.  ENSURES IMMIGRATION CASE FILES AND FORM I-9S ARE MAINTAINED AND IN COMPLIANCE WITH FEDERAL REQUIREMENTS.  MAINTAINS EMPLOYEE PERSONNEL FILES AND INDEPENDENT CONTRACTOR AGREEMENTS.  DEVELOPS RESOURCES AND TOOLS TO IMPROVE OPERATIONAL EFFICIENCY FOR THE FIRMWIDE HUMAN RESOURCES DEPARTMENT.  ASSISTS DIRECTORS WITH VARIOUS HR PROJECTS AS NEEDED.  PERFORMS OTHER DUTIES AND RESPONSIBILITIES AS ASSIGNED. \n\nKNOWLEDGE, SKILLS AND EXPERIENCE\n\n 3 TO 5 YEARS OF HUMAN RESOURCES EXPERIENCE, PREFERABLY IN PROFESSIONAL SERVICES, DEMONSTRATING A BROAD RANGE OF EXPOSURE TO THE MAJOR HR DISCIPLINES.  EXCELLENT INTERPERSONAL SKILLS, INCLUDING THE ABILITY TO WORK EFFECTIVELY IN A CONSENSUS-DRIVEN ORGANIZATION AND TO CREATE CONSENSUS-BASED SUPPORT.  STRONG WORK ETHIC, WITH A WILLINGNESS TO ACCEPT A WIDE VARIETY OF ASSIGNMENTS AS REQUIRED AND WORK CLOSELY WITH LAW STUDENTS, ASSOCIATES, PARTNERS, COLLEAGUES AND TEAM MEMBERS.  EXCELLENT ORGANIZATIONAL SKILLS AND ATTENTION TO DETAIL.  SUPERIOR PRESENTATION, WRITING, AND VERBAL COMMUNICATION SKILLS.  STRONG TIME MANAGEMENT SKILLS WITH A PROVEN ABILITY TO PRIORITIZE TASKS AND MEET TIME-SENSITIVE DEADLINES.  OUTSTANDING RELATIONSHIP-BUILDING SKILLS WITH THE ABILITY TO COLLABORATE EQUALLY WELL WITH SENIOR ADMINISTRATIVE MANAGERS AND STAFF, PARTNERS AND ASSOCIATES ACROSS THE FIRM.  ABILITY TO ACT WITH INTEGRITY, PROFESSIONALISM, AND CONFIDENTIALITY.  EXTENSIVE KNOWLEDGE AND PROFICIENCY WITH MS WORD, EXCEL (ADVANCED KNOWLEDGE PREFERRED), OUTLOOK AND OTHER MS OFFICE APPLICATIONS.  EXPERIENCE WITH HUMAN RESOURCE INFORMATION SYSTEMS (HRIS), PREFERABLY WORKDAY.  KNOWLEDGE OF APPLICANT TRACKING SYSTEMS (ATS) AND/OR OTHER TALENT MANAGEMENT SYSTEMS IS PREFERRED.  PROFESSIONAL HUMAN RESOURCE CERTIFICATION PREFERRED.  BACHELOR’S DEGREE REQUIRED. \n\nFOR MORE INFORMATION, OR TO BE CONSIDERED FOR THIS POSITION, PLEASE APPLY ONLINE AT WWW.OMM.COM. RESPONSE WILL BE GIVEN TO CANDIDATES WHO CLOSELY MEET OUR QUALIFICATIONS. EOE M/F/D/V. NO DIRECT PHONE OR EMAIL INQUIRIES, PLEASE.",
    "job_skill_set": [
      "employee relations",
      "performance management",
      "development",
      "MS Word",
      "MS Excel",
      "Bachelor’s degree",
      "interpersonal skills",
      "teamwork",
      "organizational skills",
      "attention to detail",
      "writing skills",
      "verbal communication",
      "time management",
      "relationship-building",
      "professionalism",
      "HR policies and procedures",
      "regulatory compliance",
      "onboarding",
      "terminations",
      "immigration compliance",
      "MS Outlook",
      "HRIS (Workday)",
      "ATS",
      "professional HR certification",
      "presentation skills",
      "integrity",
      "confidentiality"
    ],
    "short_keywords": [
      "and",
      "ats",
      "attention",
      "bachelors",
      "certification",
      "communication",
      "compliance",
      "confidentiality",
      "degree",
      "detail",
      "development",
      "employee",
      "excel",
      "generalist",
      "hr",
      "hris",
      "human",
      "immigration",
      "integrity",
      "interpersonal",
      "management",
      "ms",
      "onboarding",
      "organizational",
      "outlook",
      "performance",
      "policies",
      "presentation",
      "procedures",
      "professional",
      "professionalism",
      "regulatory",
      "relations",
      "relationshipbuilding",
      "resource",
      "skills",
      "teamwork",
      "terminations",
      "time",
      "to",
      "verbal",
      "word",
      "workday",
      "writing"
    ]
  },
  {
    "job_id": "3898160952",
    "job_title": "Human Resources Manager",
    "category": "HR",
    "job_description": "SUMMARY THE HUMAN RESOURCES MANAGER IS RESPONSIBLE FOR PARTNERING IN THE OVERALL PEOPLE STRATEGY FOR THE ORGANIZATION. AREAS OF FOCUS WILL INCLUDE CULTURE INITIATIVES, EMPLOYEE RELATIONS, BENEFITS STRATEGY, PERFORMANCE MANAGEMENT, EMPLOYMENT LAW COMPLIANCE, TALENT ACQUISITION STRATEGY, AND LEADING SPECIAL PROJECTS AND PROGRAMS.  ESSENTIAL RESPONSIBILITIES DEVELOP AND MAINTAIN STRONG HR PARTNER RELATIONSHIPS WITH THE BUSINESS AND KEY STAKEHOLDERS SPECIFICALLY IN OPERATIONS AND CUSTOMER SERVICE. COACH LEADERS AND PROVIDE INSIGHTS INTO BEST PRACTICES RELATED TO EMPLOYEE RELATIONS MATTERS. DIRECTLY OVERSEE BENEFITS STRATEGY FOR ORGANIZATION AND PROVIDE OVERSIGHT TO HR TEAM WHO PERFORM BENEFITS ADMINISTRATION AND AUDIT FUNCTIONS. PARTNER WITH VICE PRESIDENT HR ON CULTURE INITIATIVES, DEI GOALS, LEADERSHIP DEVELOPMENT, BUDGET MANAGEMENT, EXECUTIVE LEADERSHIP SUPPORT, PROFESSIONAL STAFF EMPLOYEE RELATIONS, AND STRATEGIC COMPENSATION PLANNING. LEAD TALENT ACQUISITION STRATEGY AND OVERSEE STAFF WHO PROVIDE EXPERTISE WITHIN RECRUITMENT AND ONBOARDING. DIRECTLY SUPERVISE THE PAYROLL SPECIALIST AND COLLABORATE ON PAYROLL PROCESS IMPROVEMENT AND VENDOR MANAGEMENT. PROVIDE LEADERSHIP ON CONTINUOUS IMPROVEMENT OF HR PROCESSES WITH A FOCUS ON COST MANAGEMENT AND EFFICIENCY GAINS. LEAD DEVELOPMENT AND IMPLEMENTATION OF HR PROJECTS, POLICIES, AND PROGRAMS. PARTICIPATE IN INTERNAL AND EXTERNAL PROFESSIONAL DEVELOPMENT TO STAY CURRENT ON HR TRENDS AND LAWS TO ENSURE COMPLIANCE WITH BEST PRACTICES AND LEGAL REQUIREMENTS. MAINTAIN A POSITIVE AND PROFESSIONAL WORKING RELATIONSHIP WITH PEERS, MANAGEMENT, AND SUPPORT RESOURCES, WITH A CONSTANT COMMITMENT TO TEAMWORK AND EXEMPLARY CUSTOMER SERVICE. CONDUCTS SELF IN THE PRESENCE OF CUSTOMERS AND COMMUNITY SO AS TO PRESENT A PROFESSIONAL IMAGE OF SHP.  COMPETENCIES REQUIRED ABILITY TO MANAGE MULTIPLE COMPETING PRIORITIES AND WHILE WORKING EFFECTIVELY BOTH INDEPENDENTLY AND AS PART OF A COLLABORATIVE TEAM ABILITY TO PROVIDE EXCELLENT CUSTOMER SERVICE TO EMPLOYEES ACT AS A PROACTIVE PROBLEM SOLVER WITH THE ABILITY TO RESEARCH VARIOUS MATTERS AND BRING FORTH SOLUTION-ORIENTED RECOMMENDATIONS HAVE A DEMONSTRATED ABILITY TO COLLABORATE AND BUILD RELATIONSHIPS WITH LEADERS MUST BE EXTREMELY PROFESSIONAL AND WORK WELL IN A FAST-PACED ENVIRONMENT MAINTAIN A HIGH LEVEL OF RESPECT FOR CONFIDENTIALITY PROFICIENT IN MICROSOFT OFFICE SUITE  SUPERVISORY RESPONSIBILITIES CARRY OUT SUPERVISORY RESPONSIBILITIES IN ACCORDANCE WITH THE ORGANIZATION’S POLICIES AND APPLICABLE LAWS. RESPONSIBILITIES INCLUDE INTERVIEWING, HIRING AND TRAINING EMPLOYEES; PLANNING, ASSIGNING, AND DIRECTING WORK; APPRAISING PERFORMANCE; REWARDING AND DISCIPLINING EMPLOYEES; ADDRESSING COMPLAINTS AND RESOLVING PROBLEMS.  EDUCATION AND EXPERIENCE BACHELOR’S DEGREE IN HUMAN RESOURCES OR RELATED FIELD WITH 5-8 YEARS OF HR EXPERIENCE. OR; AN EQUIVALENT COMBINATION OF EDUCATION AND EXPERIENCE SUFFICIENT TO SUCCESSFULLY PERFORM THE ESSENTIAL RESPONSIBILITIES AND DUTIES OF THE JOB AS LISTED ABOVE. EXTENSIVE EXPERIENCE IN EMPLOYEE RELATIONS REQUIRED WITH FOCUS IN OPERATIONS STAFF PREFERRED BUT NOT REQUIRED.  EQUIPMENT AND SOFTWARE BAMBOOHR BSWIFT MOZART MILLENNIUM PAYROLL SOFTWARE KRONOS JIRA MICROSOFT OFFICE PRODUCTS ",
    "job_skill_set": [
      "employee relations",
      "talent acquisition",
      "payroll management",
      "communication",
      "teamwork",
      "problem solving",
      "relationship building",
      "customer service",
      "leadership",
      "professionalism",
      "time management",
      "performance management",
      "employment law compliance",
      "benefits administration",
      "Microsoft Office Suite",
      "BambooHR",
      "BSWIFT",
      "Mozart",
      "Millennium Payroll Software",
      "Kronos",
      "JIRA",
      "confidentiality",
      "adaptability"
    ],
    "short_keywords": [
      "acquisition",
      "adaptability",
      "administration",
      "bamboohr",
      "benefits",
      "bswift",
      "building",
      "communication",
      "compliance",
      "confidentiality",
      "customer",
      "employee",
      "employment",
      "hr",
      "human",
      "jira",
      "kronos",
      "law",
      "leadership",
      "management",
      "manager",
      "microsoft",
      "millennium",
      "mozart",
      "office",
      "payroll",
      "performance",
      "problem",
      "professionalism",
      "relations",
      "relationship",
      "resources",
      "service",
      "software",
      "solving",
      "suite",
      "talent",
      "teamwork",
      "time"
    ]
  },
  {
    "job_id": "3901348324",
    "job_title": "Senior Director Human Resources",
    "category": "HR",
    "job_description": "JOIN US IN THIS EXCITING ROLE OF SENIOR HUMAN RESOURCES DIRECTOR AT SOURCEBOOKS, THE 7TH LARGEST BOOK PUBLISHER IN THE U.S.!\nPICTURE THIS: YOU'RE NOT JUST MANAGING HR SERVICES, TICKING BOXES, AND ENFORCING POLICIES. YOU'RE NURTURING THE VERY HEARTBEAT OF OUR ORGANIZATION. YOU’LL GET TO LEAD ORGANIZATIONAL PLANNING THAT DEFIES CONVENTION.\nIN THIS ROLE, YOU’LL WORK ON EMPLOYEE ENGAGEMENT STRATEGIES THAT IGNITE PASSION. YOU'RE NOT JUST SITTING BEHIND A DESK: SOURCEBOOKS IS A WORKPLACE THAT FOSTERS GROWTH AND CREATIVITY FOR ALL EMPLOYEES, AND AS OUR NEW SENIOR HUMAN RESOURCES DIRECTOR, YOU’LL GET TO BE A PART OF OUR STORY.\nYOU’LL LEAD THE CHARGE IN MAINTAINING AND EVOLVING OUR ENVIRONMENT WHERE EVERY EMPLOYEE FEELS EMPOWERED AND INSPIRED.\nBUT WAIT, THERE'S MORE: THIS IS A CHANCE TO BE PART OF SOMETHING BIGGER. AT SOURCEBOOKS, WE’RE REDEFINING WHAT A BOOK PUBLISHER LOOKS LIKE IN THE 21ST CENTURY. THIS IS AN OPPORTUNITY TO JOIN A TEAM OF PASSIONATE BOOK LOVERS WHO ARE REWRITING THE RULES. SO IF YOU'RE READY TO IGNITE YOUR PASSION AND MAKE A REAL IMPACT, THEN WE WANT TO HEAR FROM YOU. PLEASE BE SURE TO INCLUDE A STRONG COVER LETTER ABOUT YOUR INTEREST IN SOURCEBOOKS. \nTHIS IS A HYBRID POSITION (2/3 DAYS A WEEK) AT OUR OFFICE IN NAPERVILLE, ILLINOIS.\nDIRECTOR OF HUMAN RESOURCES RESPONSIBILITIES:PROVIDE STRATEGIC COUNSEL TO SENIOR-LEVEL LEADERS IN THE AREAS OF ORGANIZATIONAL EFFECTIVENESS, ORG DESIGN, TALENT MANAGEMENT, COLLEAGUE DEVELOPMENT, PERFORMANCE MANAGEMENT, AND COACHING.PARTNER WITH SENIOR MANAGEMENT TO IDENTIFY AND PROACTIVELY DEVELOP TALENT THROUGH FORMAL TRAINING, MENTORING, COACHING, AND \"STRETCH\" ASSIGNMENTS.PROVIDE SUPPORT TO MULTIPLE AREAS OF BUSINESS, WORKING CROSS-FUNCTIONALLY AND ASSISTING LEADERS AT MANY LEVELS IN OPTIMIZING THE PERFORMANCE OF THEIR TEAMS, ALIGNING ON SHARED GOALS AND IMPERATIVES, AND RESOLVING ISSUES.DEVELOP AND IMPLEMENT HR STRATEGY THAT DRIVES EMPLOYEE ENGAGEMENT.OVERSEE THE TALENT PLANNING PROCESSES WITH TALENT ACQUISITIONS ASSOCIATE DIRECTOR AND TRAINING AND DEVELOPMENT ASSOCIATE DIRECTOR TO ENSURE PLANS ARE IN PLACE AND EXECUTED TO GROW TALENT IN THE ORGANIZATION AND ENSURE VIABLE SUCCESSORS FOR KEY ROLES.IMPLEMENT CREATIVE SOLUTIONS TO INCREASE EMPLOYEE ENGAGEMENT AND ENSURE RETENTION OF TALENT.PROVIDE INPUT AND COUNSEL IN THE DEVELOPMENT OF HUMAN RESOURCES POLICIES AND PROGRAMS.LEADS COMPANY COMPLIANCE WITH ALL EXISTING GOVERNMENTAL AND LABOR LEGAL AND GOVERNMENT REPORTING REQUIREMENTS INCLUDING ANY RELATED TO THE EQUAL EMPLOYMENT OPPORTUNITY (EEO), THE AMERICANS WITH DISABILITIES ACT (ADA), THE FAMILY AND MEDICAL LEAVE ACT (FMLA), EMPLOYEE RETIREMENT INCOME SECURITY ACT (ERISA), THE DEPARTMENT OF LABOR, WORKER COMPENSATION, THE OCCUPATIONAL SAFETY AND HEALTH ADMINISTRATION (OSHA), AND SO FORTH.DIRECTS THE PREPARATION OF INFORMATION REQUESTED OR REQUIRED FOR COMPLIANCE WITH LAWS. APPROVES ALL INFORMATION SUBMITTED. SERVES AS THE PRIMARY CONTACT WITH THE COMPANY EMPLOYMENT LAW ATTORNEY AND OUTSIDE GOVERNMENT AGENCIES.PROTECTS THE INTERESTS OF EMPLOYEES AND THE COMPANY IN ACCORDANCE WITH COMPANY HR POLICIES AND GOVERNMENTAL LAWS AND REGULATIONS. MINIMIZES RISK.\nREQUIRED SKILLS/QUALIFICATIONS:BACHELOR’S DEGREE IN HUMAN RESOURCES IN INDUSTRIAL RELATIONS, ORGANIZATIONAL DEVELOPMENT, OR OTHER RELATED DISCIPLINE REQUIRED. 12+ YEARS OF BROAD AND PROGRESSIVE HR LEADERSHIP FOR A COMPANY 250+ IN SIZE.MUST BE ABLE TO ROLL UP YOUR SLEEVES AND EXECUTE WHILE ALSO DEMONSTRATING STRATEGIC PROWESS.DEEP KNOWLEDGE ACROSS HUMAN RESOURCES, ORGANIZATIONAL DESIGN, LEADERSHIP DEVELOPMENT, COMPENSATION, TALENT MANAGEMENT AND DEI.EXPERIENCE MANAGING IN A MATRIXED ENVIRONMENT THAT CONTINUOUSLY PRIORITIZES OPERATIONAL EXCELLENCE.EXCELLENT COMMUNICATION SKILLS, INCLUDING THE ABILITY TO MANAGE RELATIONSHIPS EFFECTIVELY AND DIPLOMATICALLY.PROVEN PROBLEM-SOLVING AND CRITICAL-THINKING SKILLS.MISSION + MISSION DRIVEN LEADERSHIP; EXPERIENCE ENGAGING EMPLOYEES WITH THE CULTURE IN MEANINGFUL WAYS.DEMONSTRATED KNOWLEDGE OF APPLICABLE LAWS AND REGULATIONS RELATED TO HUMAN RESOURCES.STRONG BUSINESS ACUMEN AND AN IN-DEPTH UNDERSTANDING OF THE HR AND FINANCIAL IMPLICATIONS OF BUSINESS DECISIONS.DECISIVE AND LOGICAL AT THOROUGHLY EVALUATING ISSUES AND EXECUTES AT A HIGH LEVEL.PROVEN ABILITY TO MULTI-TASK AND MEET ESTABLISHED DEADLINES.\n\nFULL-TIME EMPLOYEES ARE ELIGIBLE FOR OUR COMPREHENSIVE BENEFITS PROGRAM. OUR RANGE OF BENEFITS INCLUDE, BUT ARE NOT LIMITED TO, MEDICAL/PRESCRIPTION DRUG INSURANCE, DENTAL, VISION, HEALTH CARE/DEPENDENT CARE FLEXIBLE SPENDING ACCOUNT, HEALTH SAVINGS ACCOUNT 401(K), SHORT AND LONG-TERM DISABILITY INSURANCE, LIFE/AD&D INSURANCE, & GENEROUS PAID TIME OFF.\nSOURCEBOOKS IS A FAST-GROWING ENTREPRENEURIAL COMPANY SEEKING IMPACT PLAYERS AND DIFFERENCE MAKERS. WE CREATE BOOKS THAT TRANSCEND CATEGORIES AND DEFY ODDS; WITH HUNDREDS OF NATIONAL BESTSELLERS AND AWARDS TO SHOW FOR IT. WE ARE A COMPANY OF ENTHUSIASTIC, BOOK-LOVING EMPLOYEES WHO ARE DEDICATED TO CONNECTING BOOKS TO READERS IN NEW AND INNOVATIVE WAYS. EVERY DAY, WE ARE TRANSFORMING THE PUBLISHING INDUSTRY WITH BOLD THINKING AND UNPRECEDENTED RESULTS. STORY BY STORY, BOOK BY BOOK, WE HAVE TOUCHED OVER 100 MILLION LIVES. JOIN US AS WE STRIVE TO CHANGE 100 MILLION MORE.\nSOURCEBOOKS VALUES THE ARRAY OF TALENTS AND PERSPECTIVES THAT A DIVERSE WORKFORCE BRINGS. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, NATIONAL ORIGIN, RELIGION, AGE, COLOR, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, DISABILITY, OR PROTECTED VETERAN STATUS.",
    "job_skill_set": [
      "human resources",
      "organizational design",
      "talent management",
      "employee engagement",
      "compliance",
      "leadership development",
      "performance management",
      "problem solving",
      "critical thinking",
      "business acumen",
      "knowledge of HR laws",
      "training and development",
      "data analysis",
      "communication",
      "relationship management",
      "multi-tasking",
      "teamwork",
      "adaptability",
      "strategic planning",
      "matrix management",
      "coaching",
      "decisiveness",
      "creativity",
      "mission-driven leadership",
      "diplomacy",
      "influence"
    ],
    "short_keywords": [
      "acumen",
      "adaptability",
      "analysis",
      "and",
      "business",
      "coaching",
      "communication",
      "compliance",
      "creativity",
      "critical",
      "data",
      "decisiveness",
      "design",
      "development",
      "diplomacy",
      "director",
      "employee",
      "engagement",
      "hr",
      "human",
      "influence",
      "knowledge",
      "laws",
      "leadership",
      "management",
      "matrix",
      "missiondriven",
      "multitasking",
      "of",
      "organizational",
      "performance",
      "planning",
      "problem",
      "relationship",
      "resources",
      "senior",
      "solving",
      "strategic",
      "talent",
      "teamwork",
      "thinking",
      "training"
    ]
  },
  {
    "job_id": "3904574976",
    "job_title": "Human Resources Business Partner",
    "category": "HR",
    "job_description": "JOB DESCRIPTION:\n\nHUMAN RESOURCES BUSINESS PARTNER  POSITION ID: 70238246 ORG UNIT: CF HUMAN RESOURCES LOCATION: SELKIRK, NY NY INTERNAL SALARY RANGE:$81,750 - $106,820 CHEMISTRY THAT MATTERS™A CAREER AT SABIC PROVIDES YOU WITH AN OPPORTUNITY TO LEAVE A LASTING POSITIVE IMPACT TO THE WORLD AND YOURSELF. FROM EXCELLENT HEALTH AND WELL-BEING BENEFITS TO OUR COMPREHENSIVE LEARNING PROGRAMS. WE OFFER A WIDE RANGE OF BENEFITS AND OFFERINGS THAT RECOGNIZE THAT OUR PEOPLE HAVE UNIQUE MOTIVATIONS AND AMBITIONS. IT’S ALL ABOUT MATCHING WHAT MATTERS TO YOU WITH WHAT MATTERS TO US. LET’S EXPLORE WHAT MATTERS! AS ONE OF THE WORLD’S LARGEST DIVERSIFIED CHEMICAL COMPANIES, WE ACTIVATE THE POWER OF HUMAN CAPITAL TO ADDRESS SOCIETY’S FUTURE CHALLENGES. THROUGH PARTNERSHIPS, WE ENABLE LIFE-SAVING MEDICAL INNOVATIONS AND HELP FIGHT WORLD HUNGER. WE ARE DRIVING THE CIRCULAR ECONOMY FOR THE BENEFIT OF COMMUNITIES AND OUR PLANET THROUGH SUSTAINABILITY INITIATIVES, SUCH AS OUR TRUCIRCLE™ PORTFOLIO. OUR SUCCESS IS BUILT UPON THE COLLECTIVE EXCELLENCE OF OUR 32,000 EMPLOYEES IN 50+ COUNTRIES. OUR VALUES – INSPIRE, ENGAGE, CREATE, AND DELIVER – ARE THE FOUNDATION OF OUR SUCCESS. TO LEARN MORE ABOUT THESE AND HOW WE STRIVE TO BE THE IMPACT, CLICK HERE.OUR PURPOSE IS \"CHEMISTRY THAT MATTERS\". THIS IS WHAT DRIVES US TO DO WHAT WE DO. \"CHEMISTRY\" GOES BEYOND APPLYING SCIENCE AND TECHNOLOGY TO ENHANCE THE SUPPLY OF ESSENTIAL MATERIALS TO THE WORLD. IT IS HOW WE WORK, TO BUILD LONG-LASTING RELATIONSHIPS OF TRUST. “WHAT MATTERS” IS MAKING A MEANINGFUL IMPACT FOR THE WORLD – THROUGH THE CUSTOMERS AND COMMUNITIES WE COLLABORATE WITH, SO THAT WE SUCCEED AND GROW TOGETHER.IT IS ALL ABOUT MATCHING WHAT MATTERS TO YOU WITH WHAT MATTERS TO US. WE ARE MINDFUL ABOUT THE IMPORTANCE OF THE TEAM WE ARE BUILDING AND HOW OUR TEAM MEMBERS IMPACT TO OUR CULTURE. WE BELIEVE THAT GOOD IDEAS COME FROM ANYWHERE, BEING INCLUSIVE TO DIVERSE PERSPECTIVES IS STIMULATING, ENCOURAGES INNOVATION AND IS CRITICAL TO OUR MISSION. LET US EXPLORE THIS TOGETHER! FOR AN OVERVIEW OF OUR BENEFITS HERE AT SABIC, PLEASE VISIT: WWW.YOURSABICBENEFITS.COM JOB SUMMARY THE HUMAN RESOURCES BUSINESS PARTNER (HRBP) COLLABORATES WITH LEADERS & EMPLOYEES IN THE ASSIGNED CLIENT GROUP TO DETERMINE AND DELIVER IMPACTFUL HR SOLUTIONS TO ADDRESS BUSINESS CHALLENGES. FOCUSES DELIVERY OF PROGRAMS, POLICIES & PROCESSES ACROSS ALL HR AREAS SUCH AS RECRUITING, PERFORMANCE MANAGEMENT, SUCCESSION PLANNING, CAREER DEVELOPMENT, C&B, LEADERSHIP COACHING AND DEVELOPMENT, EMPLOYEE RELATIONS AND ORGANIZATION CHANGE INTERVENTIONS. HOW YOU CAN BE THE IMPACTDEVELOP AND IMPLEMENT APPROPRIATE HR PLANS IN LINE WITH THE HR STRATEGY, FOR ALLOCATED FUNCTION/CLIENT GROUP.WORK WITH LOCAL LEADERS TO ENSURE PLANS ARE IN LINE WITH FUNCTIONAL BUSINESS STRATEGY AND NEEDS, AMENDING AND REVIEWING AS REQUIRED.REVIEW KEY PERFORMANCE TARGETS AND THEIR RELATED TALENT IMPLICATIONS WITH BUSINESS LEADERS. DEVELOP AND DELIVER PLANS FOR APPROPRIATE ACTION.PROVIDE ASSISTANCE AND GUIDANCE TO MANAGERS AND EMPLOYEES ON A BROAD RANGE OF HUMAN RESOURCE POLICIES, PROGRAMS, AND PRACTICES.FACILITATES THE TALENT REVIEW PROCESS AND COACH MANAGERS.FACILITATE THE OPERATIONS ASPECTS OF THE ANNUAL SALARY PLANNING PROCESS FOR THE CLIENT GROUP, INCLUDING TRAINING, COMMUNICATION, AND GUIDANCE TO MANAGERS.LEADS THE DIFFERENT STEPS IN THE RECRUITMENT PROCESS, SUCH AS RESUME REVIEWS, INTERVIEWS CONDUCTED AND OFFERS RELEASED, TO EXECUTE AND MEET THE DEPARTMENT TARGETS AND MEET STAKEHOLDER REQUIREMENTS, SUCH AS NUMBER OF SHORTLISTS, OFFER ACCEPTANCE.DRIVE A CULTURE OF SAFETY, INCLUSIVENESS, PRODUCTIVITY AND ENGAGEMENT THROUGH AN ARRAY OF EMPLOYEE RELATIONS PROGRAMS. WHAT MATTERS TO SABICBACHELOR’S DEGREE IN BUSINESS ADMINISTRATION, HR MANAGEMENT, OR RELATED FIELD. MASTER'S PREFERREDAT LEAST 3-5 YEARS’ EXPERIENCE AS A HRBP IN MANUFACTURING, CHEMICAL INDUSTRY PREFERRED PHR/SPHR OR SHRM CERTIFICATION PREFERREDPROGRESSIVE PROFESSIONAL EXPERIENCE WITH PRIOR EXPERIENCE COACHING AND INFLUENCING HIGH PERFORMING TEAMSSTRONG WRITTEN AND VERBAL COMMUNICATION SKILLS WITH ABILITY TO DEVELOP RELATIONSHIPS AND INFLUENCE AT ALL LEVELS OF THE ORGANIZATIONGOOD KNOWLEDGE OF EMPLOYMENT LAW, LABOR AND EMPLOYEE RELATIONS AND HUMAN RESOURCE (HR) POLICIES AND PRACTICES  ELIGIBILITY REQUIREMENTSYOU MUST SUBMIT YOUR APPLICATION FOR EMPLOYMENT ONLINE TO BE CONSIDERED. PLEASE SUBMIT YOUR RESUME USING THE “APPLY NOW/APPLY” OPTION ON THIS PAGEYOU MUST BE 18 YEARS OR OLDERAPPLICANTS MUST BE CURRENTLY AUTHORIZED TO WORK FOR SABIC IN THE UNITED STATES ON A FULL-TIME BASIS  WORK AVAILABILITYREGULAR, PREDICTABLE ATTENDANCE IS AN ESSENTIAL FUNCTION OF THIS POSITION. APPLICANTS MUST BE REGULARLY AVAILABLE AND WILLING TO WORK MONDAY – FRIDAY DURING ASSIGNED HOURS OF OPERATION AND SUCH OTHER HOURS AS THE COMPANY DETERMINES ARE NECESSARY OR DESIRABLE TO MEET BUSINESS NEEDS.WE ARE PROUD TO BE A DIVERSE AND AN EQUAL OPPORTUNITY EMPLOYER. WE ARE FULLY COMMITTED TO A CULTURE OF RESPECT AND INCLUSION.",
    "job_skill_set": [
      "HR Management",
      "Recruiting",
      "Performance Management",
      "Employee Relations",
      "Labor Law",
      "Coaching",
      "Succession Planning",
      "Compensation and Benefits (C&B)",
      "Organizational Change",
      "Communication",
      "Bachelor's Degree",
      "PHR/SPHR or SHRM Certification",
      "Relationship Building",
      "Influencing",
      "Teamwork",
      "Problem Solving",
      "Adaptability",
      "Cultural Awareness",
      "Engagement",
      "Safety Awareness",
      "Master's Degree"
    ],
    "short_keywords": [
      "adaptability",
      "and",
      "awareness",
      "bachelors",
      "benefits",
      "building",
      "business",
      "cb",
      "certification",
      "change",
      "coaching",
      "communication",
      "compensation",
      "cultural",
      "degree",
      "employee",
      "engagement",
      "hr",
      "human",
      "influencing",
      "labor",
      "law",
      "management",
      "masters",
      "or",
      "organizational",
      "partner",
      "performance",
      "phrsphr",
      "planning",
      "problem",
      "recruiting",
      "relations",
      "relationship",
      "resources",
      "safety",
      "shrm",
      "solving",
      "succession",
      "teamwork"
    ]
  },
  {
    "job_id": "3905878233",
    "job_title": "Human Resources Business Partner",
    "category": "HR",
    "job_description": "ABOUT THE ROLETHE HR BUSINESS PARTNER IS A HIGH-IMPACT ROLE THAT IS A BOTH STRATEGIC TO CRITICAL BUSINESS LEADERS AS WELL AS AN OPERATIONAL HR MANAGER FOR THE DEPARTMENTS IT SUPPORTS. AS A STRATEGIC BUSINESS PARTNER, YOU WILL BE INVOLVED IN HELPING DETERMINE THE RIGHT TALENT PROGRAMS TO ENACT THE COMPANY'S RAPID GROWTH AND TRANSFORMATION. THE HRBP HAS A STRATEGIC MINDSET AND WILLINGNESS TO \"ROLL UP THEIR SLEEVES” TO ENSURE OUR PEOPLE STRATEGY AND FRAMEWORK ARE ALIGNED AND RELEVANT TO THE GROWTH AMBITIONS OF THE COMPANY. FURTHERMORE, THE SUCCESSFUL CANDIDATE WILL HAVE HIGHLY DEVELOPED SKILLS IN THE AREAS OF COE PARTNERSHIP, CHANGE LEADERSHIP, TALENT ATTRACTION, TALENT MANAGEMENT, ORGANIZATIONAL DESIGN/DEVELOPMENT, ORGANIZATIONAL CULTURE, AND EMPLOYEE ENGAGEMENT AND RETENTION. THE HRBP WILL ALSO BUILD COLLABORATIVE PARTNERSHIPS WITH HR COE LEADERS TO PLAN, IMPROVE, AND EXECUTE THE DELIVERY OF HR SERVICES ACROSS MULTIPLE DEPARTMENTS (E.G., ANNUAL TALENT ASSESSMENT, REWARDS, EXECUTIVE SUCCESSION, TALENT PLANNING PROCESSES).\nKEY RESPONSIBILITIESBUSINESS PARTNERSHIPS: ESTABLISH AND CULTIVATE POSITIVE WORKING RELATIONSHIPS WITH THE CPO, VP, AND HR COE PEERS. ASSESS NEEDS FOR THE FUNCTION AND MAKE RECOMMENDATIONS IN SUPPORT OF PEOPLE AND/OR CHANGE MANAGEMENT, INCLUSIVE OF BUSINESS TRANSFORMATION, ORGANIZATIONAL DESIGN, EVOLUTION, AND DEVELOPMENT.ORG DESIGN/INTEGRATION: ASSESS THE FUNCTIONAL STRUCTURE, PROCESSES, TOOLS, AND METRICS REQUIRED TO ACHIEVE CURRENT GOALS AND ENABLE FUTURE BUSINESS GROWTH, AND FACILITATE SEAMLESS MERGERS & ACQUISITIONS. BUILD AND SUSTAIN HIGH PERFORMING TEAMS WITHIN THE BUSINESS.EXPERIENCE & CULTURE: IN COLLABORATION WITH BUSINESS LEADERS AND PEOPLE MANAGERS, IDENTIFY, DEVELOP, AND DEPLOY EMPLOYEE EXPERIENCE PROGRAMS AND CAMPAIGNS THAT UNIFY AND HARMONIZE COMPANY CULTURE. FOSTER RETENTION, ENGAGEMENT, AND A SENSE OF BELONGING ACROSS A GEOGRAPHICALLY DISPERSED AND CULTURALLY/ETHNICALLY DIVERSE EMPLOYEE POPULATION. COACH/GUIDE LEADERS AND ASSOCIATES TO ENSURE CONSISTENCY BETWEEN STATED CORPORATE VALUES AND BEHAVIORS.\nQUALIFICATIONSBACHELOR'S DEGREE REQUIRED.7+ YEARS OF EXPERIENCE IN HR OR RELATED FIELD.UNION EXPERIENCE REQUIRED.PREVIOUS CONSTRUCTION INDUSTRY EXPERIENCE A PLUS BUT NOT REQUIRED.DEMONSTRATED ABILITY TO MANAGE ALL HR RELATED M&A ACTIVITY TO SUPPORT AGGRESSIVE GROWTH GOALS.DEMONSTRATED ABILITY TO UNDERSTAND BUSINESS GOALS AND EXPERIENCE USING THAT UNDERSTANDING TO RECOMMEND NEW APPROACHES, POLICIES AND PROCEDURES TO EFFECT CONTINUAL IMPROVEMENTS IN BUSINESS OBJECTIVES, PRODUCTIVITY AND DEVELOPMENT OF HR WITHIN THE COMPANY.\nCOMPENSATIONTHE STARTING BASE PAY FOR THIS ROLE IS BETWEEN $115,000 AND $130,000. THE ACTUAL BASE PAY IS DEPENDENT UPON MANY FACTORS, SUCH AS TRAINING, TRANSFERABLE SKILLS, WORK EXPERIENCE, BUSINESS NEEDS, AND MARKET DEMANDS. THE BASE PAY RANGE IS SUBJECT TO CHANGE AND MAY BE MODIFIED IN THE FUTURE. THIS ROLE MAY ALSO BE ELIGIBLE FOR BONUSES AND BENEFITS.",
    "job_skill_set": [
      "HR Management",
      "Talent Management",
      "Change Leadership",
      "Organizational Design",
      "Employee Engagement",
      "Data Analysis",
      "Strategic Thinking",
      "Collaboration",
      "Coaching",
      "Communication",
      "Problem Solving",
      "Relationship Building",
      "Cultural Awareness",
      "Adaptability",
      "Mergers & Acquisitions",
      "Union Experience",
      "Construction Industry Knowledge"
    ],
    "short_keywords": [
      "acquisitions",
      "adaptability",
      "analysis",
      "awareness",
      "building",
      "business",
      "change",
      "coaching",
      "collaboration",
      "communication",
      "construction",
      "cultural",
      "data",
      "design",
      "employee",
      "engagement",
      "experience",
      "hr",
      "human",
      "industry",
      "knowledge",
      "leadership",
      "management",
      "mergers",
      "organizational",
      "partner",
      "problem",
      "relationship",
      "resources",
      "solving",
      "strategic",
      "talent",
      "thinking",
      "union"
    ]
  },
  {
    "job_id": "3901963384",
    "job_title": "Human Resource Business Partner, Mansfield",
    "category": "HR",
    "job_description": "ABOUT US\n\nWHO WE ARE:\n\nSAMSONITE IS THE WORLDWIDE LEADER IN SUPERIOR TRAVEL BAGS, LUGGAGE, AND ACCESSORIES COMBINING NOTABLE STYLE WITH THE LATEST DESIGN TECHNOLOGY AND THE UTMOST ATTENTION TO QUALITY AND DURABILITY. FOR MORE THAN 100 YEARS, SAMSONITE HAS LEVERAGED ITS RICH HERITAGE TO CREATE UNPARALLELED PRODUCTS THAT FULFILL THE TRAVEL LIFESTYLE NEEDS OF CONSCIOUS MOVERS EVERYWHERE. WITH A PORTFOLIO OF BRANDS INCLUDING SAMSONITE, TUMI, AMERICAN TOURISTER, HIGH SIERRA, GREGORY, EBAGS, HARTMANN, AND LIPAULT PARIS, OUR PRODUCTS ARE SOLD IN OVER 100 COUNTRIES IN NORTH AMERICA, ASIA, EUROPE AND LATIN AMERICA THROUGH OUR COMPANY-OPERATED RETAIL STORE, WEBSITES AND A VARIETY OF RETAIL PARTNERS.\n\nJOB DESCRIPTION\n\nYOUR ROLE AT SAMSONITE:\n\nTHE HUMAN RESOURCES BUSINESS PARTNER (HRBP) WILL BUILD TRUSTED RELATIONSHIPS ACROSS THE ORGANIZATION, CHAMPIONING PROGRAMS, POLICIES, AND PROCEDURES VITAL TO SAMSONITE’S WORKFORCE AND BUSINESS OBJECTIVES. LEVERAGING ADEPT NAVIGATION SKILLS AND COLLABORATIVE PROWESS, THE HRBP WILL ENGAGE WITH EMPLOYEES AT EVERY LEVEL, OFFERING GUIDANCE AND COACHING ON DIVERSE, PEOPLE-CENTRIC MATTERS. A SUCCESSFUL HRBP WILL SERVE AS AN ADVOCATE FOR EMPLOYEES WHILE FACILITATING POSITIVE CHANGE WITHIN A DYNAMIC ENVIRONMENT. THEIR TRACK RECORD OF DRIVING IMPACTFUL OUTCOMES IN FAST-PACED SETTINGS UNDERSCORES THEIR ABILITY TO EFFECT MEANINGFUL TRANSFORMATIONS.\n\nPARTNERS WITH MANAGERS TO PROACTIVELY TO PROVIDE DAY TO DAY SUPPORT OF EMPLOYEES UTILIZING HR EXPERTISE AND PERSPECTIVEOFFERS STRATEGIC COUNSEL AND COLLABORATIVE GUIDANCE TO MANAGERS ON MATTERS OF EMPLOYEE RELATIONS, ENCOMPASSING COACHING, MENTORING, CAREER ADVANCEMENT AND DISCIPLINARY MEASURESSERVE AS A TRUSTED ADVISOR TO LEADERS AND CAN ADJUST BETWEEN STRATEGY AND TACTICAL EXECUTION SEAMLESSLYCHAMPION, MANAGE AND FACILITATE THE OVERALL PERFORMANCE SUMMARY CYCLE AND GOAL SETTING CYCLES.PARTNERS WITH SHARED SERVICE TEAMS TO PROVIDE PAYROLL, BENEFITS AND COMPENSATION SOLUTIONS THAT DRIVE BUSINESS OBJECTIVES IN PARTNERSHIP WITH LEADERSHIP, DEVELOPS LOCAL INITIATIVES THAT DRIVE EMPLOYEE ENGAGEMENT, INCREASE MORALE, IMPROVE WORKPLACE RELATIONSHIPS, BOOST PRODUCTIVITY AS WELL AS ATTRACT AND RETAIN TOP TALENT PARTNERS WITH THE HR SHARED SERVICES TEAM ON TALENT ACQUISITION NEEDS AND MANAGES THE OPEN ROLES PROCESS RECOMMEND AND IMPLEMENT PROCESS IMPROVEMENTS AS NEEDEDCOLLABORATES WITH DEPARTMENT MANAGEMENT ON PROMOTIONS, TRANSFERS, AND NEW HIRES ANALYZES DATA TRENDS AND METRICS TO INFORM BUSINESS DECISIONS VOLUNTARILY RECOMMENDS RESOURCEFUL, ALTERNATIVE, OR ORIGINAL IDEAS/PROCEDURES. MUST BE A SELF-STARTER WHO SHOWS INITIATIVE, AGILITY, RESOURCEFULNESS, AND FLEXIBILITY.COLLABORATES WITH COLLEAGUES IN THE HUMAN RESOURCES DEPARTMENT TO DEVELOP PROGRAMS AND SOLUTIONS MEDIATE AND RESOLVE EMPLOYEE RELATIONS ISSUES; CONDUCT THOROUGH AND OBJECTIVE INVESTIGATIONS WHEN NECESSARY THIS INDIVIDUAL WILL ANTICIPATE HR-RELATED NEEDS, PROACTIVELY COMMUNICATE, AND DEVELOP COORDINATED SOLUTIONSPARTICIPATE IN AND LEAD VARIOUS EMPLOYEE LED COMMITTEES INCLUDING SOCIAL, COMMUNITY, GREEN AND DIVERSITY TEAMS. ENSURE REGULATORY COMPLIANCE WITH LEGAL REQUIREMENTS PERTINENT TO THE DAY-TO-DAY MANAGEMENT OF EMPLOYEES; COLLABORATE WITH THE LEGAL DEPARTMENT WHEN NECESSARY INTERPRET HUMAN RESOURCES POLICY TO EMPLOYEES AND MANAGEMENT MANAGE HR COORDINATOR ROLE\n\nWE'RE EXCITED IF YOU HAVE\n\n BACHELOR’S DEGREE IN BUSINESS, HUMAN RESOURCES MANAGEMENT, ORGANIZATIONAL PSYCHOLOGY OR RELATED FIELD 5+ YEARS’ EXPERIENCE AS AN HRBP OR HR MANAGER PREVIOUS EXPERIENCE IN HUMAN RESOURCES, PROFESSIONAL DEVELOPMENT AND TRAINING CURRENT, IN-DEPTH KNOWLEDGE OF LEGAL REQUIREMENTS RELATED TO HUMAN RESOURCES, EMPLOYEE MANAGEMENT, FEDERAL AND STATE EMPLOYMENT LAWS EXCELLENT COMMUNICATION, ORGANIZATION, AND INTERPERSONAL SKILLS\n\nPREFERRED SKILLS AND INDUSTRY EXPERIENCE\n\nEXPERIENCE WITH AAP AND EEOC PROGRAMS DESIRABLE BUT NOT REQUIREDEXPERIENCE MANAGING STAFF DESIRABLE BUT NOT REQUIREDEXPERIENCE WITH CANADIAN HR PRACTICES WOULD BE BENEFICIAL\n\nABOUT THE TEAM\n\nWHY YOU'LL LOVE WORKING HERE:\n\nOUR EMPLOYEES MATTER. AS A PEOPLE-FOCUSED BUSINESS, WE WORK HARD TO PROVIDE MEANINGFUL REWARDS AND DEVELOPMENT OPPORTUNITIES FOR OUR EMPLOYEES, RECOGNIZING PERFORMANCE, AND CREATING A SUPPORTIVE WORKING ENVIRONMENT FOR THEM, WHEREVER THEY ARE BASED.VIBRANT CULTURE. WE ARE COMMITTED TO A DIVERSE AND RICH CULTURE, WELCOMING PEOPLE FROM ALL WALKS OF LIFE. OUR LONG-STANDING COMMITMENT TO DIVERSITY AND INCLUSION EMPOWERS US TO BRING OUR AUTHENTIC SELVES AND UNIQUE DIFFERENCES TO WORK EVERY DAY.SOCIALLY RESPONSIBLE. WE WANT TO MINIMIZE OUR PRODUCTS' IMPACT ON THE ENVIRONMENT AND HELP CREATE POSITIVE JOURNEYS WORLDWIDE. WE DO THIS BY CREATING THE BEST PRODUCTS USING THE MOST SUSTAINABLE AND INNOVATIVE MATERIALS, METHODS, AND MODELS. \n\nWHAT WE VALUE\n\nAT SAMSONITE, WE DO MORE THAN CREATE THE BAGS THAT MOVE WITH OUR CONSUMER, WE INSPIRE AND CELEBRATE THE MOMENTS THAT MOVE THEM. WE BELIEVE WE HAVE A RESPONSIBILITY TO THE WORLD IN HOW WE OPERATE, THE PRODUCTS WE SELL, THE COMMUNITIES WHERE WE LIVE AND WORK, AND HOW WE TREAT THE PEOPLE WE EMPLOY. WE'RE AS DIVERSE AS TRAVEL ITSELF, AND LIKE TRAVEL, YOUR JOURNEY WITH SAMSONITE PRESENTS THE OPPORTUNITY TO BE A PART OF SOMETHING BIGGER AND EXPLORE YOUR PASSIONS. THIS IS WHY WE OFFER VARIOUS PATHS FOR PROFESSIONALS AND CELEBRATE THE KNOWLEDGE AND SKILLS THEY BRING TO OUR TEAM. WE ARE COMMITTED TO A RESPECTFUL WORKPLACE THAT ALLOWS OUR TEAM MEMBERS TO BRING THEIR BEST SELVES TO THE WORKPLACE DAILY.\n\nSAMSONITE IS AN EQUAL OPPORTUNITY EMPLOYER AND IS COMMITTED TO PROMOTING AND MAINTAINING A WORK ENVIRONMENT IN WHICH ALL APPLICANTS, ASSOCIATES, CUSTOMERS, AND OTHER INDIVIDUALS ARE TREATED WITH DIGNITY AND RESPECT FREE FROM UNLAWFUL HARASSMENT, DISCRIMINATION, OR RETALIATION.",
    "job_skill_set": [
      "Human Resources Management",
      "Employee Relations",
      "Legal Compliance",
      "Data Analysis",
      "Talent Acquisition",
      "Performance Management",
      "Coaching and Mentoring",
      "Organizational Psychology",
      "Training and Development",
      "Payroll Management",
      "Benefits Administration",
      "Communication",
      "Interpersonal Skills",
      "Collaboration",
      "Problem Solving",
      "Initiative",
      "Agility",
      "Resourcefulness",
      "Flexibility",
      "Trust Building",
      "Change Management",
      "EEOC Programs",
      "AAP Programs",
      "Canadian HR Practices"
    ],
    "short_keywords": [
      "aap",
      "acquisition",
      "administration",
      "agility",
      "analysis",
      "and",
      "benefits",
      "building",
      "business",
      "canadian",
      "change",
      "coaching",
      "collaboration",
      "communication",
      "compliance",
      "data",
      "development",
      "eeoc",
      "employee",
      "flexibility",
      "hr",
      "human",
      "initiative",
      "interpersonal",
      "legal",
      "management",
      "mansfield",
      "mentoring",
      "organizational",
      "partner",
      "payroll",
      "performance",
      "practices",
      "problem",
      "programs",
      "psychology",
      "relations",
      "resource",
      "resourcefulness",
      "resources",
      "skills",
      "solving",
      "talent",
      "training",
      "trust"
    ]
  },
  {
    "job_id": "3904085727",
    "job_title": "Associate Partner, Human Resources , NASC",
    "category": "HR",
    "job_description": "DESCRIPTION\n\nAT AMAZON, WE ARE COMMITTED TO BEING EARTH’S SAFEST PLACE TO WORK, BEST EMPLOYER AND MOST CUSTOMER-CENTRIC COMPANY. OUR HUMAN RESOURCES TEAMS CARE DEEPLY ABOUT THE EMPLOYEE EXPERIENCE AND SUPPORT ASSOCIATES AND MANAGERS TO FOCUS ON PEOPLE THROUGH ENGAGEMENT, TECHNOLOGY AND INNOVATION. THE ASSOCIATE PARTNER (AP) ROLE IN OUR PEOPLE EXPERIENCE AND TECHNOLOGY (PXT) TEAM CAN PROVIDE YOU WITH THE FUNDAMENTALS OF HR AT AMAZON AND HELP YOU BECOME WELL-VERSED IN THE PROCESSES AND POLICIES THAT HELP US DELIVER ON OUR PROMISES TO OUR ASSOCIATES AND CUSTOMERS.\n\nTHE AMAZON PXT TEAM IS SEEKING AN ASSOCIATE PARTNER WHO IS OBSESSED WITH DELIVERING AN EXEMPLARY ASSOCIATE EXPERIENCE WITH EVERY INTERACTION. SUCCESSFUL CANDIDATES WILL BE APPROACHABLE, ACTION-ORIENTED, FLEXIBLE PROBLEM SOLVERS WITH GREAT VERBAL AND WRITTEN COMMUNICATION SKILLS AND EXCEPTIONAL ATTENTION TO DETAIL. ASSOCIATE PARTNERS PROVIDE FRIENDLY AND WELCOMING HR SUPPORT TO OUR ASSOCIATES REGARDING A BROAD RANGE OF BENEFITS, POLICY AND PAYROLL TOPICS WHILE MAINTAINING AN APPROPRIATE LEVEL OF CONFIDENTIALITY. THIS IS A GREAT TIME TO JOIN A GROWING TEAM WITH AMPLE OPPORTUNITY TO EXPAND YOUR PROFESSIONAL SKILLS WHILE MAKING A POSITIVE IMPACT FOR OUR ASSOCIATES EACH DAY.\n\nKEY JOB RESPONSIBILITIES\n\n RESPOND ACCURATELY AND PROFESSIONALLY TO QUESTIONS AND CONCERNS FROM ASSOCIATES THROUGH MULTIPLE CHANNELS (IN-PERSON, EMAIL, PHONE, ETC.) IN A TIMELY MANNER ESCALATE AND TAKE PARTNERS WHEN DISCREPANCIES OR ISSUES ARISE WITH ASSOCIATE INTERACTIONS SUCH AS LEAVE OF ABSENCE, ACCOMMODATIONS, OR OTHER EMPLOYEE RELATIONS ISSUES ENTER AND REVIEW ASSOCIATE DATA WITHIN HRIS AND PAYROLL SYSTEMS TIMELY AND ACCURATELY PROVIDE SUBJECT MATTER EXPERTISE TO ASSOCIATES AND LEADERSHIP ON PEOPLE PRACTICES, SYSTEMS, AND RESOURCES COMPILE, ASSESS AND USE AND DATA REGARDING CRITICAL BUSINESS METRICS SUCH AS: ATTENDANCE, ATTRITION, ENGAGEMENT, LABOR FILL, ETC. ADVOCATE FOR THE EMPLOYEE EXPERIENCE BY PARTNERING EFFECTIVELY WITH LEADERS, PARTNERS, AND CORE TEAMS TO PROVIDE WORLD-CLASS SERVICE TO AMAZON ASSOCIATES, INCLUDING EDUCATING THEM ON HOW AND WHEN TO USE SELF-SERVICE TOOLS DRAFT AND DISTRIBUTE COMMUNICATIONS TO ASSOCIATES AND LEADERS PLAN, COORDINATE AND IMPLEMENT ASSOCIATE ACTIVITIES THAT CREATE AN INCLUSIVE ENVIRONMENT ASSIST MANAGERS IN RESPONDING TO ASSOCIATE QUESTIONS REGARDING TIME/ATTENDANCE, BENEFITS, POLICIES, ACCOMMODATIONS, LOA\n\nAMAZON OPERATIONS IS A 24/7 ENVIRONMENT AND SHIFTS MAY CHANGE DUE TO BUSINESS NEEDS. ABILITY TO WORK FLEXIBLE SCHEDULES, INCLUDING WEEKENDS, EVENINGS AND ROTATING SCHEDULES BASED ON BUSINESS NEEDS IS NEEDED FOR THIS ROLE.\n\nAMAZON DOES NOT SPONSOR FOR IMMIGRATION, INCLUDING FOR H-1B, TN, AND OTHER NON-IMMIGRANT VISAS, FOR THIS ROLE.\n\nWE ARE OPEN TO HIRING CANDIDATES TO WORK OUT OF ONE OF THE FOLLOWING LOCATIONS:\n\nNORTHBOROUGH, MA, USA\n\nBASIC QUALIFICATIONS\n\n A HIGH SCHOOL DEGREE OR EQUIVALENT EXPERIENCE IN CONFIDENTIAL ENVIRONMENTS BASIC KNOWLEDGE OF MICROSOFT OFFICE INCLUDING OUTLOOK, WORD, AND EXCEL\n\nPREFERRED QUALIFICATIONS\n\n 1+ YEARS OF EXPOSURE TO HUMAN RESOURCES FUNCTIONS ABILITY TO MAINTAIN STRICT CONFIDENTIALITY REGARDING PAYROLL, BENEFITS, AND ASSOCIATE ISSUES INTERMEDIATE SKILLS IN MICROSOFT EXCEL INCLUDING THE ABILITY TO USE THE FOLLOWING FUNCTIONS: PIVOT TABLES, VLOOKUPS AND FORMULAS HUMAN RESOURCES OR CUSTOMER SERVICE TRAINING AND EXPERIENCE INCLUDING OUTSTANDING INTERPERSONAL SKILLS, ABILITY TO DISPLAY PATIENCE AND HELPFULNESS AT ALL TIMES AN ASSOCIATE’S DEGREE FROM AN ACCREDITED COLLEGE ABILITY TO HANDLE AND PRIORITIZE MULTIPLE PROJECTS AND DEADLINES\n\nAMAZON IS COMMITTED TO A DIVERSE AND INCLUSIVE WORKPLACE. AMAZON IS AN EQUAL OPPORTUNITY EMPLOYER AND DOES NOT DISCRIMINATE ON THE BASIS OF RACE, NATIONAL ORIGIN, GENDER, GENDER IDENTITY, SEXUAL ORIENTATION, PROTECTED VETERAN STATUS, DISABILITY, AGE, OR OTHER LEGALLY PROTECTED STATUS. FOR INDIVIDUALS WITH DISABILITIES WHO WOULD LIKE TO REQUEST AN ACCOMMODATION, PLEASE VISIT HTTPS://WWW.AMAZON.JOBS/EN/DISABILITY/US.\n\n\nCOMPANY - AMAZON.COM SERVICES LLC\n\nJOB ID: A2608940",
    "job_skill_set": [
      "Microsoft Office",
      "HRIS",
      "Payroll Systems",
      "Data Analysis",
      "Microsoft Excel",
      "Communication",
      "Problem Solving",
      "Interpersonal Skills",
      "Confidentiality",
      "Flexibility",
      "Attention to Detail",
      "Customer Service",
      "Time Management",
      "Teamwork",
      "Pivot Tables",
      "VLOOKUPs"
    ],
    "short_keywords": [
      "analysis",
      "associate",
      "attention",
      "communication",
      "confidentiality",
      "customer",
      "data",
      "detail",
      "excel",
      "flexibility",
      "hr",
      "hris",
      "human",
      "interpersonal",
      "management",
      "microsoft",
      "nasc",
      "office",
      "partner",
      "payroll",
      "pivot",
      "problem",
      "resources",
      "service",
      "skills",
      "solving",
      "systems",
      "tables",
      "teamwork",
      "time",
      "to",
      "vlookups"
    ]
  },
  {
    "job_id": "3903453711",
    "job_title": "Human Resources Manager",
    "category": "HR",
    "job_description": "AT NEDERMAN, OUR MISSION IS TO PROTECT PEOPLE, PLANET, AND PRODUCTION FROM HARMFUL EFFECTS OF INDUSTRIAL PROCESSES. BY DOING THAT, WE CONTRIBUTE TO EFFICIENT PRODUCTION, ENVIRONMENTAL BENEFITS, AND SAFER WORKPLACES. CLEAN AIR IS A CORNERSTONE OF SUSTAINABLE PRODUCTION. NEDERMAN IS COMMITTED TO PROVIDING OUR CUSTOMERS WITH LEADING ENGINEERING, DESIGN AND TURN-KEY AIR FILTRATION SOLUTIONS AND SERVICES. WE VALUE EMPLOYEES WHO ARE HIGHLY MOTIVATED, WELL ORGANIZED AND HAVE A DESIRE TO BE PART OF A COLLABORATIVE CULTURE, AND WITH A PASSION FOR HANDLING CHALLENGING AND DIVERSE ASSIGNMENTS. OUR IDEAL CANDIDATE WILL BE AN ENTHUSIASTIC SELF-STARTER WHO THRIVES IN A FAST-PACED, PRO-ACTIVE, AND GROWTH-ORIENTED ENVIRONMENT THAT CAN PRIORITIZE AND MAINTAIN OVERSIGHT OF MULTIPLE TASKS SIMULTANEOUSLY. THEY WILL BE COMFORTABLE ROLLING UP THEIR SLEEVES AND DIGGING INTO THE DETAILS AS THEY WORK TO BROADEN THEIR BUSINESS ACUMEN AND LEADERSHIP SKILLS FOR FUTURE PERSONAL GROWTH AND DEVELOPMENT WITHIN THE CORPORATION. JOB SUMMARY: THE PRIMARY RESPONSIBILITY OF THE HUMAN RESOURCES MANAGER IS TO PROVIDE LEADERSHIP AND MANAGEMENT OF KEY HUMAN RESOURCE FUNCTIONS. THE POSITION WILL BE RESPONSIBLE FOR LEADING CHANGE MANAGEMENT INCLUDING INVOLVEMENT IN THE DESIGN, MANAGEMENT AND IMPLEMENTATION OF KEY HUMAN RESOURCES PROGRAMS. THE POSITION WILL ALSO BE RESPONSIBLE FOR DEFINING AND INTERPRETING POLICIES AND PROCEDURES AS WELL AS PROVIDING HUMAN RESOURCES ADMINISTRATION AND SUPPORT TO EMPLOYEES AND MANAGERS.  WHAT YOU WILL DO: PROVIDE HUMAN RESOURCE SUPPORT FOR NEDERMAN EMPLOYEES LOCATED THROUGH THE USA INCLUDING GUIDANCE AND COUNSEL TO SENIOR MANAGEMENT AND EMPLOYEES.PROVIDE HR FUNCTIONAL LEADERSHIP AND MANAGE ALL HUMAN RESOURCES ACTIVITIES INCLUDING THE DEVELOPMENT AND OVERSIGHT OF PROGRAMS AND INITIATIVES IN THE AREAS OF RECRUITING, COMPENSATION, STAFFING, PERFORMANCE MANAGEMENT, STAFF DEVELOPMENT, AAP, AND EMPLOYEE RELATIONS.DRIVE AND SUPPORT CHANGE INITIATIVES IN THE BUSINESS FROM AN HR PERSPECTIVE.INITIATE AND DRIVE DESIGN, MANAGEMENT AND IMPLEMENTATION OF KEY HUMAN RESOURCES PROGRAMS.SUPPORT THE HR SHARED SERVICES HEADQUARTERS IN CHARLOTTE IN KEY HR PROCESSES.SUPPORT BENEFIT ADMINISTRATION TEAM.SUPPORT FOR THE ONGOING USE AND ADMINISTRATION OF THE HUMAN RESOURCES IT SYSTEMS.PROVIDE POLICY GUIDANCE TO HUMAN RESOURCES MANAGEMENT, ENSURING A CONSISTENT, NON-DISCRIMINATORY AND EQUITABLE APPLICATION OF COMPANY PRACTICES.CONDUCT STUDIES AND NEEDS ANALYSIS TO PRIORITIZE PROGRAM DEVELOPMENT REQUIREMENTS.COORDINATE HUMAN RESOURCES-RELATED COMMUNICATION ACTIVITIES.COORDINATE AND LEAD EMPLOYEE ENGAGEMENT ACTIVITIES.OTHER DUTIES AS ASSIGNED. WE BELIEVE YOU HAVE:YOUR EXPERIENCE & EDUCATION BACHELOR’S DEGREE IN HUMAN RESOURCES, BUSINESS OR OTHER RELATED DISCIPLINE REQUIRED. PROFESSIONAL HR CERTIFICATION (SHRM-CP OR PHR) HIGHLY DESIRABLE.MINIMUM OF 5 TO 7 YEARS OF HUMAN RESOURCES OR RELATED EXPERIENCE. YOUR SKILLS & TRAITS: STRONG ANALYTICAL SKILLS; FOCUS ON RESULTS, AND BUSINESS PROCESSES.ABILITY TO INTERACT WITH SENIOR MANAGEMENT AND TO COLLABORATE WITH WIDELY DISPERSED FIELD ORGANIZATION.MUST BE DETAIL-ORIENTED, WORK WELL UNDER PRESSURE, AND HAVE THE FLEXIBILITY TO DEAL WITH MULTIPLE CHANGING PRIORITIES AND TO MEET REQUIRED DEADLINES.ABILITY TO ANALYZE DATA AND PROVIDE COMPREHENSIVE REPORTS IS ESSENTIAL.STRONG HR PROJECT MANAGEMENT SKILLS, WORKING KNOWLEDGE OF ALL HR DISCIPLINES AND PROCESS IMPROVEMENT REQUIRED.PROVEN SUCCESS IN PROJECT MANAGEMENT OF COMPLEX AND VARIED HR PROJECTS.EXPERIENCE FROM DRIVING CHANGE INITIATIVE AND DESIGN, MANAGEMENT AND IMPLEMENTATION OF KEY HUMAN RESOURCES PROGRAMS.EXPERIENCE FROM WORKING CLOSELY WITH A MANAGEMENT TEAM.ADVANCED PC SKILLS TO INCLUDE WINDOWS SUITE SOFTWARE AND MICROSOFT TEAMS, OUTLOOK, WORD, EXCEL, ETC.ABILITY TO EFFECTIVELY WORK INDEPENDENTLY. WHAT WE OFFER IS MORE THAN JUST A JOB…AN OPPORTUNITY TO BE PART OF A TRULY INNOVATIVE AND FAST-GROWING INTERNATIONAL COMPANY.A TEAM-FOCUSED WORK ENVIRONMENT WHERE YOUR EFFORTS WILL NOT GO UNNOTICED OR UNAPPRECIATED.COMPETITIVE COMPENSATION AND BENEFITS WITH A PERFORMANCE-BASED BONUS.EXCELLENT BENEFITS INCLUDING PTO, HEALTH CARE INSURANCE, 401K, DISABILITY, AND LIFE INSURANCE. APPLICANTS FOR EMPLOYMENT ARE TO BE CONSIDERED FOR EMPLOYMENT BASED ON THE INDIVIDUAL APPLICANT’S QUALIFICATIONS AND WITHOUT REGARD TO RACE, COLOR, CREED, GENDER, AGE, DISABILITY, NATIONAL ORIGIN, RELIGION, VETERAN STATUS, UNIFORM SERVICE MEMBER STATUS, MARITAL STATUS, SEXUAL ORIENTATION, CITIZENSHIP STATUS, GENETIC INFORMATION, OR ON ACCOUNT OF MEMBERSHIP IN ANY PROTECTED CATEGORY UNDER FEDERAL, STATE, AND LOCAL LAWS.",
    "job_skill_set": [
      "Human Resources Management",
      "Data Analysis",
      "HR IT Systems Administration",
      "Recruiting",
      "Compensation Management",
      "Performance Management",
      "Employee Relations",
      "Policy Interpretation",
      "Microsoft Office Suite",
      "HR Program Development",
      "Staff Development",
      "Needs Analysis",
      "Analytical Skills",
      "Detail-Oriented",
      "Collaboration",
      "Communication",
      "Results-Oriented",
      "Ability to Work Under Pressure",
      "Independent Work",
      "Leadership",
      "Organizational Skills",
      "Change Management",
      "Project Management",
      "Employee Engagement Activities",
      "Professional HR Certification (SHRM-CP or PHR)",
      "Flexibility"
    ],
    "short_keywords": [
      "ability",
      "activities",
      "administration",
      "analysis",
      "analytical",
      "certification",
      "change",
      "collaboration",
      "communication",
      "compensation",
      "data",
      "detailoriented",
      "development",
      "employee",
      "engagement",
      "flexibility",
      "hr",
      "human",
      "independent",
      "interpretation",
      "it",
      "leadership",
      "management",
      "manager",
      "microsoft",
      "needs",
      "office",
      "or",
      "organizational",
      "performance",
      "phr",
      "policy",
      "pressure",
      "professional",
      "program",
      "project",
      "recruiting",
      "relations",
      "resources",
      "resultsoriented",
      "shrmcp",
      "skills",
      "staff",
      "suite",
      "systems",
      "to",
      "under",
      "work"
    ]
  },
  {
    "job_id": "3906251112",
    "job_title": "Director, Human Resources",
    "category": "HR",
    "job_description": "JOB DETAILS\n\nJOB LOCATION\n\nMADISON - MADISON, WI\n\nTRAVEL PERCENTAGE\n\nNON-DRIVING\n\nJOB SHIFT\n\nAM\n\nJOB CATEGORY\n\nHUMAN RESOURCES\n\nDESCRIPTION\n\n AGRACE IS A NONPROFIT, COMMUNITY HEALTH CARE ORGANIZATION THAT IS NATIONALLY RECOGNIZED AS A LEADER IN THE HOSPICE INDUSTRY. WELL KNOWN FOR END-OF-LIFE CARE, AGRACE ALSO SERVES PEOPLE ACROSS SOUTHERN WISCONSIN WHO ARE AGING, SERIOUSLY ILL OR GRIEVING. \n\n AGRACE HAS A STRONG CULTURE OF EMPLOYEE ENGAGEMENT. IN 2023, AGRACE WAS NAMED THE #1 TOP WORKPLACE BY THE WISCONSIN STATE JOURNAL AND ENERGAGE, AND #79 OF THE TOP 100 COMPANIES IN THE COUNTRY AMONG THOSE WITH AN EMPLOYEE BASE OF 500 TO 999 WORKERS! \n\n WHO YOU'LL WORK WITH (AND WHAT THEY HAVE TO SAY) \n\nTHE DIRECTOR, HUMAN RESOURCES WORKS COLLABORATIVELY WITH LEADERS ACROSS THE ORGANIZATION, AND HUMAN RESOURCES STAFF. THE DIRECTOR, HUMAN RESOURCES ALSO SERVES AS A MEMBER OF LEADERSHIP COUNCIL AND MANAGMENT TEAM.\n\n\"AGRACE IS DIFFERENT THAN ANY OTHER PLACE I HAVE EVER WORKED BECAUSE OF THE RESOURCES THAT WE PROVIDE, THE KINDNESS THAT IS CONTAGIOUS IN THE EMPLOYEES, THE SUPPORT, AND THE SHOW OF APPRECIATION FOR EACH OTHER IS UNMATCHED.\" -HUMAN RESOURCES EMPLOYEE, 2023 ANNUAL ENGAGEMENT SURVEY\n\n HOW YOU’LL MAKE A DIFFERENCE IN THIS ROLE (ESSENTIAL FUNCTIONS) \n\nTHE DIRECTOR, HUMAN RESOURCES IS RESPONSIBLE FOR PROVIDING LEADERSHIP AND DIRECTION TO ALL ASPECTS OF THE HUMAN RESOURCES FUNCTIONS THAT SPAN THE ENTIRE EMPLOYEE LIFE CYCLE TO INCLUDE TALENT ACQUISITION, EMPLOYEE RELATIONS, RETENTION, PERFORMANCE MANAGEMENT, TOTAL REWARDS (COMPENSATION & BENEFITS), HRIS, CHANGE MANAGEMENT AND ORGANIZATIONAL DESIGN. THIS POSITION DEVELOPS AND IMPLEMENTS PROGRAMS, POLICIES, AND PROCEDURES THAT SUPPORT AGRACE’S MISSION AND GOALS TO BE THE EMPLOYER OF CHOICE BY LEVERAGING THE ORGANIZATION’S SOCIALLY CONSCIOUS AND INCLUSIVE CULTURE. THE DIRECTOR, HUMAN RESOURCES SERVES AS A MEMBER OF LEADERSHIP COUNCIL AND MANAGEMENT TEAM.\n\nHUMAN RESOURCES OVERSIGHT\n\n ENSURE HR OPERATIONS ARE CONDUCTED IN A COLLABORATIVE MANNER THROUGHOUT THE AGENCY.  CONDUCT OPERATIONS IN A MANNER THAT ACHIEVES ALL KEY PERFORMANCE METRICS.  DEVELOP AND IMPLEMENT HR STRATEGIES, POLICIES, AND PRACTICES TO ADVANCE THE ORGANIZATION, FOSTERING AND ENSURING DEI CONSIDERATIONS ARE EMBEDDED IN ALL RELEVANT ASPECTS.  OVERSEE THE TALENT ACQUISITION AND RETENTION PROGRAMS THAT INCORPORATE INDUSTRY BEST PRACTICES.  DEVELOP INITIATIVES TO CONTINUOUSLY ENHANCE AGRACE’S EMPLOYER BRAND TO ATTRACT HIGHLY QUALIFIED APPLICANTS.  ENSURE THE RECRUITMENT AND ONBOARDING EXPERIENCES ARE STANDARDIZED AND SCALABLE ACROSS AGRACE’S SERVICE AREA.  OVERSEE THE EFFECTIVE MANAGEMENT OF EMPLOYEE RELATIONS ISSUES BY ADVISING AND COACHING HR BUSINESS PARTNERS AND MANAGERS IN CONVERSATIONS REGARDING PERFORMANCE EXPECTATIONS, ASSISTING WITH THE DEVELOPMENT OF PERFORMANCE IMPROVEMENT PLANS (PIPS), DISCIPLINARY ACTION AND TERMINATION.  PROVIDE CONSULTATIVE SUPPORT FOR WORKFORCE ISSUES THAT IMPACT THE OVERALL OPERATIONAL STRATEGIES OF THE ORGANIZATION AND ASSIST LEADERS IN ORGANIZATIONAL DESIGN.  INTERPRET IMPACT OF BROAD SCOPE ORGANIZATIONAL CHANGES FOR STAFF AND DEVELOPS CHANGE STRATEGIES TO ENSURE SUCCESSFUL IMPLEMENTATION, SUPPORT, AND RETENTION OF STAFF.  ANALYZE AND UNDERSTAND CURRENT WORKFORCE NEEDS USING ANALYTICS AND DEVELOPS STRATEGIES TO SUPPORT OBJECTIVES.  ADMINISTER ALL ASPECTS OF THE TOTAL REWARDS PROGRAM INCLUDING COMPENSATION AND BENEFITS PROGRAMMING TO MEET THE EVOLVING WORK-LIFE NEEDS OF EMPLOYEES.  DIRECT COMPENSATION ANALYSES AND DEVELOPS RECOMMENDATIONS TO ENSUE COMPENSATION LEVELS ARE COMPETITIVE, RETAINS AND REWARDS HIGH-PERFORMING EMPLOYEES.  ADMINISTER AND REGULARLY EVALUATE ALL EMPLOYEE BENEFIT PLANS INCLUDING HEALTH AND WELFARE PLANS, EXECUTIVE BENEFIT PLANS, EMPLOYEE ASSISTANCE PLAN, FMLA AND WORKER’S COMPENSATION PROGRAMS TO ENSURE PLANS ARE COMPETITIVE AND REFLECT BEST PRACTICES AND FOLLOW ALL STATE AND FEDERAL LAWS AND REGULATIONS.  MANAGE RELATIONSHIPS WITH BENEFIT PLAN VENDORS AND COORDINATE ANNUAL BENEFIT PLAN NEGOTIATION OF CONTRACTS, ENSURE OFFERINGS THAT ARE AFFORDABLE AND MEETS THE NEEDS OF EMPLOYEES.  OVERSEE ANNUAL ENROLLMENT PROCESS INCLUDING THE DEVELOPMENT OF THE COMMUNICATION PLAN AND EMPLOYEE EDUCATION.  ENSURE ALL EMPLOYMENT CONTRACTS, POLICIES, PRACTICES MEET STATE AND FEDERAL LAW, ADEQUATELY PROTECT AGRACE, AND ARE OF A GENERALLY HIGH QUALITY.  ASSIST IN THE PREPARATION OF EXECUTIVE AND LEADERSHIP COMPENSATION ANALYSES IN CONJUNCTION WITH THE VICE PRESIDENT, HUMAN RESOURCES.  COLLABORATIVELY WORK WITH MANAGEMENT AND EMPLOYEES TO UNDERSTAND THEIR PRIORITIES AND CHALLENGES; DEFINE PERFORMANCE GAPS, LEARNING NEEDS AND ORGANIZATIONAL ISSUES; AND PROPOSE AND EXECUTE SOLUTIONS THAT ADDRESS THEM. \n\n\nHR BUSINESS PARTNER FOR DESIGNATED TEAMS\n\n PROVIDE CONSULTATION AND GUIDANCE TO MANAGERS ON STAFFING, EMPLOYEE-RELATED DEPARTMENTAL POLICIES AND PROCEDURES, EMPLOYEE RELATIONS/PERFORMANCE MANAGEMENT, TRAINING, ENGAGEMENT, AND STAFF DEVELOPMENT INITIATIVES.  LEAD OR PARTICIPATE IN INVESTIGATIONS, UNEMPLOYMENT RESPONSES AND HEARINGS, DISCIPLINARY MEETINGS, PERFORMANCE IMPROVEMENT PLANS, ETC.  FUNCTION AS LIAISON FOR EMPLOYEE BENEFITS QUESTIONS, LEAVE OF ABSENCE/ADA NEEDS, OR RETURN TO WORK ISSUES.  MAINTAIN IN-DEPTH KNOWLEDGE OF EMPLOYMENT-RELATED LAWS AND REGULATIONS; EVALUATES THEIR IMPACT UPON OPERATIONS, AND RECOMMENDS POLICY AND PROCEDURAL IMPROVEMENTS TO MANAGEMENT, AS APPROPRIATE. \n\n\nMANAGE STAFF\n\n ENSURES HR MANAGERS ARE EFFECTIVE AND SUCCESSFUL.  HIRE, TRAIN, ENGAGE AND RETAIN DEPARTMENT STAFF.  ASSIGN, DIRECT, AND VERIFY THE WORK OF DIRECT REPORTS.  ASSESS STAFF PERFORMANCE AND PROVIDE FEEDBACK, COACHING, CORRECTION, AND DEVELOPMENT OPPORTUNITIES.  FACILITATE HR TEAM CROSS TRAINING TO ENSURE CROSS FUNCTIONAL KNOWLEDGE AND AREAS OF SPECIALTY ALWAYS HAVE BACK-UP FOR COVERAGE. \n\n\nOTHER DUTIES\n\n PARTICIPATE IN INTERNAL WORK GROUPS, MEETINGS, AND COMMITTEES RELATIVE TO POSITION RESPONSIBILITIES.  ENSURE COMPLIANCE WITH AGRACE POLICIES AND PROTOCOLS, STATE, FEDERAL, AND OTHER REGULATIONS.  DEVELOP AND ADHERE TO ANNUAL DEPARTMENT OPERATING BUDGET.  ASSIST IN DEVELOPMENT OF THE BEST PEOPLE OBJECTIVES WITHIN THE ANNUAL OPERATING PLAN.  LEAD THE DEVELOPMENT OF THE DEPARTMENTAL ANNUAL OPERATION PLAN. \n\n\nTHE ABOVE ARE NOT TO BE CONSTRUED AS EXCLUSIVE OR ALL-INCLUSIVE. OTHER DUTIES MAY BE REQUIRED AND ASSIGNED.\n\nQUALIFICATIONS\n\n  YOU BRING (EXPERIENCE & QUALIFICATIONS)  \n\n BACHELOR’S DEGREE IN HUMAN RESOURCES, BUSINESS, OR RELATED FIELD, OR OTHER BACHELOR’S DEGREE PLUS EQUIVALENT HR MANAGEMENT EXPERIENCE WITH INCREASING RESPONSIBILITY.  5 YEARS’ RELATED EXPERIENCE IN HR LEADERSHIP, OR ANY COMBINATION OF EDUCATION AND EXPERIENCE THAT PROVIDES EQUIVALENT KNOWLEDGE, SKILLS, AND ABILITIES.  PHR/SPHR CERTIFICATION PREFERRED.  TECHNICAL EXPERTISE IN ALL HR FUNCTIONAL AREAS.  THOROUGH KNOWLEDGE OF HR EMPLOYMENT, BENEFIT AND COMPENSATION LAWS AND REGULATIONS INCLUDING THOSE SUCH AS: FLSA, HIPAA, EEOC, ERISA, OSHA, STATE WORKERS’ COMPENSATION, FMLA, ADA/ADAA, ACA AND STATE AND FEDERAL WAGE AND HOUR PRACTICES FOR IL AND WI.  EXPERIENCE WITH ORGANIZATIONAL DESIGN AND CHANGE MANAGEMENT  EXTENSIVE KNOWLEDGE OF WORKFORCE METRICS AND TRENDS  COACHING, CONSTRUCTIVELY INFLUENCING AND CONSULTING WITH MANAGERS AND EMPLOYEES  EXPERIENCE WITH MARKET PAY ANALYSIS, JOB EVALUATION AND PROGRAM ANALYSIS AND DESIGN.  EXPERIENCE DESIGNING AND IMPLEMENTING SUCCESSFUL BENEFIT PROGRAMS.  EXPERIENCE IN EMPLOYEE RELATIONS, COACHING AND PROVIDING FEEDBACK IN A PRODUCTIVE MANNER.  ABILITY TO ANALYZE, SYNTHESIZE AND MEASURE DATA TO COMMUNICATE FINDINGS AT ALL EMPLOYEE LEVELS.  ADVANCED COMPUTER SKILLS TO INCLUDE THE MICROSOFT OFFICE SUITE INCLUDING EXPERIENCE USING HRIS SYSTEMS AND PAYROLL SYSTEMS.  STRONG PROBLEM SOLVING AND DECISION-MAKING SKILLS.  EXCELLENT INTERPERSONAL SKILLS WITH THE ABILITY TO INFLUENCE, EDUCATE AND PRESENT TO EMPLOYEES AT THE MANAGEMENT AND EXECUTIVE LEVEL AS WELL AS TO THE BOARD, AS NEEDED.  EXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLS AND LISTENING SKILLS.  ABILITY TO BE FLEXIBLE AND EFFECTIVELY MANAGE PRIORITIES, MULTIPLE TASKS AND MEET DEADLINES.  ABILITY TO WORK EFFECTIVELY AND COOPERATIVELY WITH OTHERS  EXPERIENCE USING INDUSTRY SPECIFIC SOFTWARE  ABILITY TO COMMUNICATE FINANCIAL/BUSINESS/TECHNICAL/CLINICAL INFORMATION TO ALL LEVELS OF THE ORGANIZATION  EXPERIENCE DEVELOPING POLICY AND PROCEDURE  EXPERIENCE IN PROJECT MANAGEMENT, STRATEGIC PLANNING AND EXECUTION, BUDGETING, AND CONTROLLING COSTS  ABILITY TO ENGAGE STAFF IN AGRACE’S STRATEGIC AND ANNUAL OPERATING PLANS AND PROJECTS AND TO ENSURE STRATEGIES AND IMPROVEMENTS REMAIN IN PRACTICE  ABILITY TO MAINTAIN CONFIDENTIALITY ABOUT PATIENTS, FAMILIES, CAREGIVERS, STAFF, DONORS, AND ORGANIZATIONAL INTELLECTUAL PROPERTY.  VALID DRIVER’S LICENSE, AUTO INSURANCE, AND ACCESS TO A RELIABLE VEHICLE  ABILITY TO USE PROPER BODY MECHANICS AND STANDARD PRECAUTIONS  ABILITY TO BE FLEXIBLE IN TIME AND TASK TO MEET ORGANIZATIONAL NEEDS \n\n\n STUDIES HAVE SHOWN THAT WOMEN, COMMUNITIES OF COLOR AND HISTORICALLY UNDERREPRESENTED TALENT ARE LESS LIKELY TO APPLY TO JOBS UNLESS THEY MEET ALL QUALIFICATIONS. AT AGRACE WE ARE DEDICATED TO BUILDING A DIVERSE, EQUITABLE, AND INCLUSIVE WORKPLACE. IF YOU’RE EXCITED ABOUT THIS ROLE BUT YOUR EXPERIENCE DOESN’T ALIGN PERFECTLY WITH EVERY QUALIFICATION, WE WOULD STILL LOVE TO TALK ABOUT ROLES AT AGRACE. \n\n AGRACE HOSPICECARE IS AN EQUAL OPPORTUNITY EMPLOYER AND DOES NOT DISCRIMINATE AGAINST ANY EMPLOYEE OR APPLICANT FOR EMPLOYMENT BECAUSE OF RACE, COLOR, SEX, AGE, NATIONAL ORIGIN, RELIGION, SEXUAL ORIENTATION, GENDER IDENTITY, STATUS AS A VETERAN, AND BASIS OF DISABILITY OR ANY OTHER FEDERAL, STATE OR LOCAL PROTECTED CLASS.",
    "job_skill_set": [
      "HR leadership",
      "Talent acquisition",
      "Employee relations",
      "Performance management",
      "Compensation and benefits",
      "HRIS",
      "Policy development",
      "Project management",
      "Budgeting",
      "OSHA",
      "Leadership",
      "Communication",
      "Interpersonal skills",
      "Problem solving",
      "Decision making",
      "Coaching",
      "Teamwork",
      "Confidentiality",
      "Engagement",
      "Listening skills",
      "Influencing",
      "Strategic planning",
      "Time management",
      "Consulting",
      "Change management",
      "Organizational design",
      "Workforce analytics",
      "Market pay analysis",
      "Job evaluation",
      "Benefit program design",
      "Microsoft Office Suite",
      "Industry-specific software",
      "FLSA",
      "HIPAA",
      "EEOC",
      "ERISA",
      "FMLA",
      "ADA/ADAA",
      "ACA",
      "State and federal wage and hour practices",
      "Flexibility"
    ],
    "short_keywords": [
      "aca",
      "acquisition",
      "adaadaa",
      "analysis",
      "analytics",
      "and",
      "benefit",
      "benefits",
      "budgeting",
      "change",
      "coaching",
      "communication",
      "compensation",
      "confidentiality",
      "consulting",
      "decision",
      "design",
      "development",
      "director",
      "eeoc",
      "employee",
      "engagement",
      "erisa",
      "evaluation",
      "federal",
      "flexibility",
      "flsa",
      "fmla",
      "hipaa",
      "hour",
      "hr",
      "hris",
      "human",
      "industryspecific",
      "influencing",
      "interpersonal",
      "job",
      "leadership",
      "listening",
      "making",
      "management",
      "market",
      "microsoft",
      "office",
      "organizational",
      "osha",
      "pay",
      "performance",
      "planning",
      "policy",
      "practices",
      "problem",
      "program",
      "project",
      "relations",
      "resources",
      "skills",
      "software",
      "solving",
      "state",
      "strategic",
      "suite",
      "talent",
      "teamwork",
      "time",
      "wage",
      "workforce"
    ]
  },
  {
    "job_id": "3903813606",
    "job_title": "Human Resources Specialist",
    "category": "HR",
    "job_description": "JOB DESCRIPTION:BE ABLE TO CONDUCT NEW HIRE ORIENTATIONS/ ON BOARDING ACTIVITIES / MONITORING PROGRESS OF NEW HIRESBE ABLE TO WORK WITH THE TALENT ACQUISITION TEAMSBE ABLE TO HANDLE PAYROLL QUESTIONSRESPONSIBLE FOR UNION DUES / DOCUMENTATIONBE ABLE TO FILE AND CONDUCT DETAIL RECORD MANAGEMENTRESPONSIBLE FOR THE ADMINISTRATIVE COORDINATION AND SUPPORT OF THE HUMAN RESOURCES DEPARTMENT AND ASSISTING IN THE DEVELOPMENT, IMPLEMENTATION AND ADMINISTRATION OF CORPORATE HUMAN RESOURCES POLICIES, PROGRAMS AND PROCEDURES.RESPONSIBLE FOR ADMINISTERING MULTIPLE AREAS OF HUMAN RESOURCES AND REWARDS PROGRAMS INCLUDING HR EMPLOYMENT ISSUES RELATED TO CONTRACTS, RETIREMENT, ETC.PERSONNEL RECORDS MAINTENANCE PERTAINING TO BENEFITS, COMPENSATION, LEAVE OF ABSENCE, RETIREMENT, ETC.STATISTICAL REPORTING TO INTERNAL MANAGEMENT AND EXTERNAL AGENCIES COMPENSATION & BENEFITS PROGRAM IMPLEMENTATION AND ADMINISTRATIONMAY HELP SELECT EXTERNAL HR VENDORS.\nROLE IS FULLY ONSITE, MUST BE LOCAL/COMMUTABLE TO LINCOLN, IL\nPOSITION WILL BE COVERING FOR EMPLOYEE WHO IS ON LEAVE – HOWEVER THERE IS A CHANCE THE POSITION COULD MOVE TO A DIRECT POSITION.",
    "job_skill_set": [
      "new hire orientation",
      "payroll management",
      "record management",
      "statistical reporting",
      "vendor management",
      "communication",
      "teamwork",
      "organizational skills",
      "problem solving",
      "attention to detail",
      "adaptability",
      "HR policies implementation",
      "benefits administration",
      "compensation management"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "attention",
      "benefits",
      "communication",
      "compensation",
      "detail",
      "hire",
      "hr",
      "human",
      "implementation",
      "management",
      "new",
      "organizational",
      "orientation",
      "payroll",
      "policies",
      "problem",
      "record",
      "reporting",
      "resources",
      "skills",
      "solving",
      "specialist",
      "statistical",
      "teamwork",
      "to",
      "vendor"
    ]
  },
  {
    "job_id": "3901967275",
    "job_title": "Human Resources Project Manager",
    "category": "HR",
    "job_description": "HYBRID ROLEONSITE: REQUIRED TO WORK ONSITE AT OFFICE 1-2 DAYS/WEEK (UP TO 5 DAYS/WEEK DURING BUSY PERIODS IN MAY/JUNE)HOURS PER WEEK: 30-40 HOURS DEPENDING ON WORKLOAD\nMUST HAVES: 5+ YOE IN HR PROJECT MANAGEMENT SMARTSHEETS, OR SIMILAR TOOLS CREATING HR TRAINING PROGRAMS CREATING HR COMMUNICATIONS FOR ENTERPRISE ORGANIZATIONS WORKING WITH CONFIDENTIAL INFORMATION SKILL / EXPERIENCE REQUIRED: EXPERIENCE WITH HR PROJECT MANAGEMENT EXPERIENCE MANAGING COMPLEX EMPLOYEE EVENTS ABILITY TO WORK WITH SENIOR LEADERS ABILITY TO WORK WITH HIGHLY CONFIDENTIAL INFORMATION DESCRIPTION: PROVIDE HR PROJECT MANAGEMENT FOR AN OPERATING MODEL TRANSFORMATION, INCLUDING EMPLOYEE EVENTS, NEW TEAM FORMATION, AND ENGAGEMENT WITH LEADERS PROVIDES PROJECT MANAGEMENT AND HR BUSINESS PARTNER STAFF SUPPORT TO OPTIMIZE OPERATING MODEL TRANSFORMATION DEVELOP AND MAINTAIN PROJECT DOCUMENTATION, INCLUDING PROJECT PLANS, STATUS REPORTS, ISSUE LOGS, AND CHANGE CONTROL DOCUMENTATION. DEVELOPMENT MATERIALS TO SUPPORT CHANGE MANAGEMENT, LEARNING & DEVELOPMENT, TEAMING, AND ONBOARDING MANAGE PROJECT RISKS AND ISSUES, AND DEVELOP MITIGATION STRATEGIES TO ENSURE PROJECT SUCCESS. CONDUCT REGULAR MEETINGS WITH PROJECT TEAMS TO PROVIDE UPDATES ON PROJECT STATUS, DISCUSS CHALLENGES, AND MAKE RECOMMENDATIONS FOR IMPROVEMENT. MANAGES STAKEHOLDER EXPECTATIONS AND PROVIDES GUIDANCE AND ADVICE THROUGHOUT PROJECT DURATION. FOSTERS AND MAINTAINS GOOD RELATIONSHIPS WITH HR COLLEAGUES TO ENSURE THAT PROCESSES ARE MAINTAINED AND SUPPORTED FOLLOWING PROJECT COMPLETION. OTHER RELATED DUTIES AS ASSIGNED NICE TO HAVES:SHRM-CP CERTIFICATIONPMP CERTIFICATION",
    "job_skill_set": [
      "Creating HR Training Programs",
      "Project Documentation",
      "SHRM-CP Certification",
      "Confidentiality",
      "Communication",
      "Teamwork",
      "Problem Solving",
      "Leadership",
      "Adaptability",
      "HR Project Management",
      "Smartsheets",
      "Creating HR Communications",
      "Managing Complex Employee Events",
      "Change Management",
      "Risk Management",
      "Stakeholder Management",
      "PMP Certification"
    ],
    "short_keywords": [
      "adaptability",
      "certification",
      "change",
      "communication",
      "communications",
      "complex",
      "confidentiality",
      "creating",
      "documentation",
      "employee",
      "events",
      "hr",
      "human",
      "leadership",
      "management",
      "manager",
      "managing",
      "pmp",
      "problem",
      "programs",
      "project",
      "resources",
      "risk",
      "shrmcp",
      "smartsheets",
      "solving",
      "stakeholder",
      "teamwork",
      "training"
    ]
  },
  {
    "job_id": "3898162673",
    "job_title": "Human Resources Manager",
    "category": "HR",
    "job_description": "ABOUT US:WE ARE A RENOWNED AND PRESTIGIOUS FINE DINING RESTAURANT GROUP WITH MULTIPLE ESTABLISHMENTS IN NEW YORK CITY. OUR RESTAURANTS ARE KNOWN FOR THEIR EXCEPTIONAL CUISINE, ELEGANT AMBIANCE, AND IMPECCABLE SERVICE. AS A LEADER IN THE HOSPITALITY INDUSTRY, WE ARE COMMITTED TO PROVIDING OUR GUESTS WITH UNFORGETTABLE DINING EXPERIENCES AND OUR EMPLOYEES WITH A SUPPORTIVE AND REWARDING WORK ENVIRONMENT.POSITION OVERVIEW:WE ARE SEEKING A TALENTED AND EXPERIENCED HUMAN RESOURCES MANAGER TO JOIN OUR TEAM IN NEW YORK CITY. THE HUMAN RESOURCES MANAGER WILL PLAY A KEY ROLE IN SUPPORTING OUR RESTAURANTS' OPERATIONS BY OVERSEEING ALL ASPECTS OF HUMAN RESOURCES MANAGEMENT, INCLUDING RECRUITMENT, EMPLOYEE RELATIONS, TRAINING AND DEVELOPMENT, PERFORMANCE MANAGEMENT, AND COMPLIANCE.RESPONSIBILITIES:MANAGE THE FULL CYCLE OF RECRUITMENT AND ONBOARDING PROCESSES FOR ALL RESTAURANT POSITIONS, INCLUDING FRONT-OF-HOUSE AND BACK-OF-HOUSE STAFF.DEVELOP AND IMPLEMENT EFFECTIVE HR POLICIES, PROCEDURES, AND PROGRAMS TO SUPPORT ORGANIZATIONAL OBJECTIVES AND ENSURE COMPLIANCE WITH EMPLOYMENT LAWS AND REGULATIONS.PROVIDE GUIDANCE AND SUPPORT TO MANAGERS AND EMPLOYEES ON HR-RELATED MATTERS, INCLUDING EMPLOYEE RELATIONS, CONFLICT RESOLUTION, AND PERFORMANCE IMPROVEMENT.DESIGN AND DELIVER TRAINING PROGRAMS TO ENHANCE EMPLOYEE SKILLS, KNOWLEDGE, AND PERFORMANCE, WITH A FOCUS ON DELIVERING EXCEPTIONAL CUSTOMER SERVICE.OVERSEE PERFORMANCE MANAGEMENT PROCESSES, INCLUDING GOAL SETTING, PERFORMANCE REVIEWS, AND DISCIPLINARY ACTIONS AS NEEDED.MAINTAIN ACCURATE AND UP-TO-DATE EMPLOYEE RECORDS AND HR SYSTEMS, ENSURING CONFIDENTIALITY AND DATA SECURITY.STAY INFORMED ABOUT INDUSTRY TRENDS AND BEST PRACTICES IN HR MANAGEMENT AND IMPLEMENT INNOVATIVE STRATEGIES TO ATTRACT, RETAIN, AND DEVELOP TOP TALENT.QUALIFICATIONS:BACHELOR'S DEGREE IN HUMAN RESOURCES, BUSINESS ADMINISTRATION, OR RELATED FIELD REQUIRED; HR CERTIFICATION (E.G., PHR, SHRM-CP) PREFERRED.MINIMUM 3-5 YEARS OF EXPERIENCE IN HUMAN RESOURCES MANAGEMENT, PREFERABLY IN THE HOSPITALITY INDUSTRY OR FINE DINING RESTAURANTS.STRONG KNOWLEDGE OF EMPLOYMENT LAWS, REGULATIONS, AND BEST PRACTICES, WITH THE ABILITY TO ENSURE COMPLIANCE AND MITIGATE RISK.EXCELLENT COMMUNICATION, INTERPERSONAL, AND RELATIONSHIP-BUILDING SKILLS, WITH THE ABILITY TO EFFECTIVELY INTERACT WITH DIVERSE GROUPS OF PEOPLE.PROVEN ABILITY TO MANAGE MULTIPLE PRIORITIES AND DEADLINES IN A FAST-PACED ENVIRONMENT, WITH A FOCUS ON DELIVERING RESULTS.HIGH LEVEL OF INTEGRITY, PROFESSIONALISM, AND DISCRETION, WITH A COMMITMENT TO MAINTAINING CONFIDENTIALITY AND HANDLING SENSITIVE INFORMATION APPROPRIATELY.PROFICIENCY IN HRIS SYSTEMS, MS OFFICE SUITE, AND OTHER HR-RELATED SOFTWARE APPLICATIONS.SALARY RANGE:$80,000 - $90,000 PER YEAR, DEPENDING ON EXPERIENCE AND QUALIFICATIONSBENEFITS:COMPETITIVE SALARYHEALTH INSURANCERETIREMENT SAVINGS PLANPAID TIME OFFEMPLOYEE DINING DISCOUNTSOPPORTUNITIES FOR PROFESSIONAL GROWTH AND DEVELOPMENTIF YOU ARE A DYNAMIC HR PROFESSIONAL WITH A PASSION FOR HOSPITALITY AND A COMMITMENT TO EXCELLENCE, WE INVITE YOU TO APPLY FOR THIS EXCITING OPPORTUNITY TO JOIN OUR TEAM. PLEASE SUBMIT YOUR RESUME AND COVER LETTER OUTLINING YOUR QUALIFICATIONS AND INTEREST IN THE POSITION.",
    "job_skill_set": [
      "recruitment",
      "employee relations",
      "training and development",
      "performance management",
      "HRIS systems",
      "MS Office Suite",
      "HR-related software",
      "communication",
      "interpersonal skills",
      "relationship-building",
      "conflict resolution",
      "integrity",
      "professionalism",
      "discretion",
      "time management",
      "results-oriented",
      "compliance",
      "employment laws",
      "data security"
    ],
    "short_keywords": [
      "and",
      "communication",
      "compliance",
      "conflict",
      "data",
      "development",
      "discretion",
      "employee",
      "employment",
      "hr",
      "hris",
      "hrrelated",
      "human",
      "integrity",
      "interpersonal",
      "laws",
      "management",
      "manager",
      "ms",
      "office",
      "performance",
      "professionalism",
      "recruitment",
      "relations",
      "relationshipbuilding",
      "resolution",
      "resources",
      "resultsoriented",
      "security",
      "skills",
      "software",
      "suite",
      "systems",
      "time",
      "training"
    ]
  },
  {
    "job_id": "3906222901",
    "job_title": "Senior Analyst, Human Resources Technology",
    "category": "HR",
    "job_description": "WHY JOIN US? \n\nOUR PURPOSE IS TO DESIGN FOR THE GOOD OF HUMANKIND. IT’S THE IDEAL WE STRIVE TOWARD EACH DAY IN EVERYTHING WE DO. BEING A PART OF MILLERKNOLL MEANS BEING A PART OF SOMETHING LARGER THAN YOUR WORK TEAM, OR EVEN YOUR BRAND. WE ARE REDEFINING MODERN FOR THE 21ST CENTURY. AND OUR SUCCESS ALLOWS MILLERKNOLL TO SUPPORT CAUSES THAT ALIGN WITH OUR VALUES, SO WE CAN BUILD A MORE SUSTAINABLE, EQUITABLE, AND BEAUTIFUL FUTURE FOR EVERYONE.\n\nGENERAL PURPOSE\n\nTHE SENIOR ANALYST, HUMAN RESOURCES TECHNOLOGY WILL BE RESPONSIBLE FOR MANAGING HR APPLICATION (WORKDAY) PROCESSES AND CONFIGURATION TO BEST ACHIEVE MILLERKNOLL OBJECTIVES. WILL LEAD EFFORTS IN THE DESIGN AND DEVELOPMENT OF HR APPLICATIONS AND DATA MANAGEMENT SOLUTIONS BASED ON BUSINESS NEEDS AND CAPABILITIES. IDENTIFIES HR APPLICATION REQUIREMENTS AND ANALYZE, DETERMINE, AND DELIVER THE TECHNOLOGY SOLUTIONS. REQUIRES ABILITY TO COMMUNICATE EFFECTIVELY WITH STAKEHOLDERS TO STRATEGICALLY ALIGN AND OPERATIONALIZE PROGRAMS AT A GLOBAL, REGIONAL, AND LOCAL LEVEL. PROVIDES SUPPORT TO FUNCTIONAL AREAS BY CREATING AND COMMUNICATING SOLUTIONS TO COMPLEX PROBLEMS AND PROJECTS.\n\nESSENTIAL FUNCTIONS\n\nDEVELOP FUNCTIONALITY, RESOLVE CONFIGURATION AND SYSTEM ISSUES, AND PROVIDE REPORTING AND ANALYTICS TO MEET BUSINESS NEEDS. OPERATES AS LEAD IN THE TIME TRACKING, ABSENCE, AND SCHEDULING FUNCTIONAL AREAS WITHIN WORKDAY FOR CONFIGURATION. PROVIDES SUPPORT FOR PAYROLL IN PARTNERSHIP WITH PAYROLL LEAD. SERVES AS A BUSINESS ANALYST AND LIAISON TO KEY STAKEHOLDERS. PROACTIVELY GATHERS BUSINESS REQUIREMENTS AND TRANSLATES THEM TO FUNCTIONAL SYSTEM SPECIFICATIONS. PROVIDES ADVANCED FUNCTIONAL AND TECHNICAL SYSTEM SUPPORT. PARTNERS WITH HRBP AND FUNCTIONAL STAKEHOLDERS AND IT TO PROACTIVELY IDENTIFY, TROUBLESHOOT AND RESOLVE COMPLEX SYSTEM ISSUES. DATA-DRIVEN, ABLE TO ANALYZE DATA WITH STRONG ATTENTION TO DETAIL AND ACCURACY, PASSIONATE ABOUT TELLING THE STORY BEHIND THE DATA. ABLE TO CREATE BASIC REPORTS TO SUPPORT KEY STAKEHOLDERS. POSSESSES AN ANALYTICAL MINDSET AND A “PEOPLE FIRST” MENTALITY WITH DEMONSTRATED ABILITY TO WORK THROUGH COMPLEX, AMBIGUOUS PROBLEMS USING DATA AND CREATING CONFIGURATION SOLUTIONS BASED ON THAT DATA. WORK WITH VARIOUS HR SUBJECT MATTER EXPERTS AND IT TO SUPPORT, TROUBLESHOOT AND ENHANCE THE INTEGRATION SYSTEMS RELATED TO WORKDAY. PERFORMS ADDITIONAL RESPONSIBILITIES AS REQUESTED TO ACHIEVE BUSINESS OBJECTIVES. \n\nQUALIFICATIONS\n\nTO PERFORM THIS JOB SUCCESSFULLY, AN INDIVIDUAL MUST BE ABLE TO PERFORM EACH ESSENTIAL DUTY SATISFACTORILY. THE REQUIREMENTS LISTED BELOW ARE REPRESENTATIVE OF THE KNOWLEDGE, SKILL, AND/OR ABILITY REQUIRED. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS.\n\nEDUCATION/EXPERIENCE\n\nBACHELOR’S DEGREE IN COMPUTER SCIENCE, INFORMATION SYSTEMS, OR RELEVANT ACADEMIC DISCIPLINE; MASTER’S DEGREE PREFERRED. MINIMUM 8 YEARS OF PROFESSIONAL HR, IT & IS EXPERIENCE. 1-3 YEARS OF PRIOR PARTICIPATION ON PROJECT TEAMS. MINIMUM 5 YEARS WORKDAY EXPERIENCE SUPPORTING ABSENCE, TIME TRACKING, SCHEDULING, OR PAYROLL FUNCTIONS. ADVANCED EXCEL SKILLS. \n\nSKILLS AND ABILITIES\n\nABILITY TO LEARN AND INTEGRATE NEW TECHNOLOGIES AS BUSINESS NEEDS CHANGE. EXPERT KNOWLEDGE OF HOW CURRENT TRENDS AND TECHNOLOGY MAY BE USED TO SUPPORT BUSINESS PARTNERS. ANTICIPATE TECHNOLOGY SOLUTIONS TO SOLVE CURRENT AND FUTURE BUSINESS NEEDS. ADVANCED UNDERSTANDING OF AND ABILITY TO STRATEGICALLY CONNECT THE NEEDS OF MULTIPLE FUNCTIONAL AREAS. POSSESS STRONG ANALYTICAL SKILLS WITH THE ABILITY TO UNDERSTAND AND INTERPRET DATA. IN DEPTH KNOWLEDGE OF IT AND FUNCTIONAL AREA STRATEGIES AND HOW THEY ARE INTEGRATED. MUST BE ABLE TO PERFORM ALL ESSENTIAL FUNCTIONS OF THE POSITION WITH OR WITHOUT REASONABLE ACCOMMODATIONS. \n\nPHYSICAL DEMANDS\n\nTHE PHYSICAL DEMANDS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY AN EMPLOYEE TO SUCCESSFULLY PERFORM THE ESSENTIAL FUNCTIONS OF THIS JOB. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS. MUST BE ABLE TO PERFORM ALL ESSENTIAL FUNCTIONS OF THE POSITION WITH OR WITHOUT ACCOMMODATIONS.\n\nWHO WE HIRE?\n\nSIMPLY PUT, WE HIRE EVERYONE. MILLERKNOLL IS COMPRISED OF PEOPLE OF ALL ABILITIES, GENDER IDENTITIES AND EXPRESSIONS, AGES, ETHNICITIES, SEXUAL ORIENTATIONS, VETERANS FROM EVERY BRANCH OF MILITARY SERVICE, AND MORE. HERE, YOU CAN BRING YOUR WHOLE SELF TO WORK. WE’RE COMMITTED TO EQUAL OPPORTUNITY EMPLOYMENT, INCLUDING VETERANS AND PEOPLE WITH DISABILITIES.\n\nA STARTING COMPENSATION RANGE FOR THIS ROLE IS $88,600.00 - $111,750.00. RELEVANT SALARY CONSIDERATIONS WILL INCLUDE CANDIDATE QUALIFICATIONS AND EXPERIENCE, OTHER BUSINESS/ORGANIZATIONAL NEEDS AND MARKET FACTORS . YOU MAY ALSO BE ELIGIBLE TO RECEIVE A GEOGRAPHIC PREMIUM, ANNUAL DISCRETIONARY INCENTIVE AND EQUITY AWARDS WHICH ARE SUBJECT TO THE RULES GOVERNING THESE PROGRAMS. THE COMPANY OFFERS A FULL SPECTRUM OF BENEFITS INCLUDING MEDICAL, PRESCRIPTION DRUG, DENTAL, VISION, HEALTH SAVINGS ACCOUNT, DEPENDENT DAY CARE SAVINGS ACCOUNT, LIFE INSURANCE, DISABILITY AND OTHER INSURANCE PLANS, PAID TIME OFF (INCLUDING VACATION AND PARENTAL LEAVE), HOLIDAYS, 401(K), AND SHORT/LONG TERM DISABILITY, IN ADDITION TO OTHER SPECIAL PERKS RESERVED FOR OUR ASSOCIATES.\n\nTHIS ORGANIZATION PARTICIPATES IN E-VERIFY EMPLOYMENT ELIGIBILITY VERIFICATION. IN GENERAL, MILLERKNOLL POSITIONS ARE CLOSED WITHIN 45 DAYS AND ARE OPEN FOR APPLICATIONS FOR A MINIMUM OF 5 DAYS. WE ENCOURAGE OUR PROSPECTIVE CANDIDATES TO SUBMIT THEIR APPLICATION(S) EXPEDIENTLY SO AS NOT TO MISS OUT ON OUR OPPORTUNITIES. WE FREQUENTLY POST NEW OPPORTUNITIES AND ENCOURAGE PROSPECTIVE CANDIDATES TO CHECK BACK OFTEN FOR NEW POSTINGS.",
    "job_skill_set": [
      "Data Analysis",
      "Excel",
      "HR Technology",
      "Reporting and Analytics",
      "Project Management",
      "Technical Support",
      "Communication",
      "Problem Solving",
      "Analytical Mindset",
      "Stakeholder Management",
      "Attention to Detail",
      "Team Collaboration",
      "Adaptability",
      "Customer Focus",
      "Workday",
      "Configuration Management"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "analyst",
      "analytical",
      "analytics",
      "and",
      "attention",
      "collaboration",
      "communication",
      "configuration",
      "customer",
      "data",
      "detail",
      "excel",
      "focus",
      "hr",
      "human",
      "management",
      "mindset",
      "problem",
      "project",
      "reporting",
      "resources",
      "senior",
      "solving",
      "stakeholder",
      "support",
      "team",
      "technical",
      "technology",
      "to",
      "workday"
    ]
  },
  {
    "job_id": "3895801271",
    "job_title": "Human Resources Generalist",
    "category": "HR",
    "job_description": "WE ARE LOOKING FOR AN EXPERIENCED HR PROFESSIONAL TO JOIN OUR HR TEAM AT PHYSICIANS EAST! THIS IS A GREAT OPPORTUNITY FOR AN HR PROFESSIONAL TO GROW THEIR HR CAREER WHILE KNOWING THAT YOU ARE HELPING MAKE A DIFFERENCE IN OUR COMMUNITY BY SUPPORTING THE BEST PROVIDERS AND MEDICAL PROFESSIONALS IN EASTERN NORTH CAROLINA. COME SEE WHY WE ARE A GREAT PLACE TO WORK... AND WE OFFER SOME PRETTY GREAT BENEFITS THAT INCLUDE: COMPREHENSIVE MEDICAL AND PRESCRIPTION DRUG PLANREDUCED CO-PAYS AND/ OR FREE SERVICES WHEN UTILIZING OUR PROVIDERS!CONVENIENT ONSITE EMPLOYEE PHARMACY THAT OFFERS REDUCED CO-PAYS!DENTAL INSURANCEVISION INSURANCECRITICAL ILLNESS, AND OTHER SUPPLEMENTAL INSURANCE PLANS AVAILABLE WITH PAYROLL DEDUCTION!EMPLOYEE ASSISTANCE PROGRAM AT NO COST TO EMPLOYEE AND COVERED DEPENDENTS! COMPETITIVE LONG-TERM AND SHORT-TERM DISABILITY PLANS! LIFE INSURANCE PROVIDED AT NO COST TO THE EMPLOYEE WITH OPTIONS TO PURCHASE ADDITIONAL PROTECTION FOR YOU AND YOUR FAMILY! 401(K) WITH GENEROUS COMPANY MATCHING CONTRIBUTIONS! PROFIT SHARING PROGRAM! FLEX SPENDING ACCOUNTCOMPANY PAID SHORT TERM DISABILITY INSURANCECOMPANY PAID LONG TERM DISABILITY INSURANCEGENEROUS PTO PROGRAM TO PROVIDE OUR EMPLOYEES WITH ESSENTIAL WORK/ LIFE BALANCE! PAID HOLIDAYS IN ADDITION TO ACCRUED PTO!CONVENIENT PARKING ONSITE AND CLOSE TO WHERE YOU WORK! EMPLOYEE DISCOUNTS PROGRAMS TO SAVE YOU MONEY!\n\nABOUT THE ROLEYOU WILL BE RESPONSIBLE FOR HUMAN RESOURCES-RELATED DUTIES AT THE PROFESSIONAL LEVEL AND MAY CARRY OUT RESPONSIBILITIES IN SOME OR ALL THE FOLLOWING FUNCTIONAL AREAS: BENEFITS ADMINISTRATION, LEAVE ADMINISTRATION, PAYROLL-RELATED ITEMS, EMPLOYEE RELATIONS, TRAINING, EMPLOYMENT, AND EMPLOYMENT EQUITY PROGRAMS.KNOWLEDGE, SKILLS, AND ABILITIES REQUIRED: MAINTAINS THE INTEREST OF BOTH EMPLOYEES AND THE PRACTICE CONFIDENTIALLY AND IN ACCORDANCE WITH PRACTICE’S HUMAN RESOURCES POLICIES AND STATE/ FEDERAL EMPLOYMENT LAWS AND REGULATIONS.ADMINISTER COMPANY BENEFITS, INCLUDING WORKERS COMPENSATION, SHORT AND LONG-TERM DISABILITY AND FMLA. PROVIDES DAY-TO-DAY BENEFITS ADMINISTRATION SERVICES AND ASSISTS EMPLOYEES WITH ANY CLAIM OR RELATED ISSUES.DEVELOPS, MANAGES, AND PARTICIPATES IN NEW EMPLOYEE ORIENTATION AND TRAINING PROGRAMS. ENSURES COMPLIANCE WITH DATA PRIVACY REGULATIONS AND BEST PRACTICES.ASSIST THE DIRECTOR IN CONDUCTING EFFECTIVE, THOROUGH, AND OBJECTIVE INVESTIGATIONS RESOLVING SOMETIMES COMPLEX EMPLOYEE RELATIONS ISSUES.WORKS WITH THE DIRECTOR OF HUMAN RESOURCES OR OTHERS ON LARGE-SCALE COMPLEX PROJECTS.ASSIST IN DEVELOPING AND EXECUTING PERSONNEL PROCEDURES AND POLICIES, PROVIDING GUIDANCE AND INTERPRETATION FOR BUSINESS OPERATIONS.PARTICIPATE IN DEVELOPMENT OF HR OBJECTIVES AND SYSTEMS, INCLUDING HR METRICS, QUERIES, AND STANDARD REPORTS FOR ONGOING PRACTICE REQUIREMENTS.SUGGEST AND HELP DESIGN NEW PROCEDURES AND POLICIES TO CONTINUALLY IMPROVE EFFICIENCY OF THE HR DEPARTMENT AND ORGANIZATION, AND TO IMPROVE EMPLOYEE EXPERIENCE.ADMINISTERS AND MONITORS THE PROCESSING OF ALL BENEFITS DOCUMENTATION TO ENSURE COMPLIANCE WITH POLICY, PROCEDURE, AND REGULATORY REQUIREMENTS; PROVIDES INPUT INTO THE DESIGN, IMPLEMENTATION, AND/OR MODIFICATION OF DOCUMENTATION, AS APPROPRIATE. WORKS CLOSELY WITH PAYROLL TO ENSURE COMPLIANCE WITH AFFORDABLE CARE ACT (ACA).UNDERSTANDS AND COMPLIES WITH ALL EXISTING GOVERNMENTAL AND/OR GOVERNMENT REPORTING REQUIREMENTS. OVERSEES AND ADMINISTERS LEAVE REQUESTS AND ACCOMMODATIONS REQUIRING SPECIALIZED ATTENTION, PARTICULARLY THOSE ARISING UNDER THE FAMILY AND MEDICAL LEAVE ACT (FMLA), THE AMERICANS WITH DISABILITIES ACT (ADA, ADAA), STATE AND LOCAL LEAVE LAWS, AND SHORT-TERM OR LONG-TERM DISABILITY PLANS.HANDLES THE FMLA LEAVE ADMINISTRATION PROCESS FROM THE EMPLOYEE’S INITIAL NOTICE OF THE NEED FOR LEAVE TO THE RETURN TO WORK. THIS INCLUDES GATHERING AND COMPLETING ALL REQUIRED PAPERWORK, DETERMINING LEAVE ELIGIBILITY, DESIGNATING LEAVE AS FMLA-QUALIFYING, REQUESTING MEDICAL CERTIFICATION AS NEEDED, AND ACCOUNTING FOR INTERMITTENT AND REDUCED SCHEDULE LEAVE USE.MAINTAINS REASONABLE COMMUNICATION WITH EMPLOYEES ON LEAVE TO FACILITATE SMOOTH AND TIMELY RETURN TO WORK, RELAYS COMMUNICATION BETWEEN EMPLOYEES AND THEIR MANAGERS DURING LEAVE WITHIN REASON.ADVISES MANAGERS AND EMPLOYEES ON THE INTERACTION OF LEAVE LAWS WITH PAID TIME OFF, WORKERS COMPENSATION, AND SHORT-TERM AND LONG-TERM DISABILITY BENEFITS.OVERSEES THE RETURN-TO-WORK PROCESS FOR EMPLOYEES RETURNING FROM EXTENDED FMLA, WORKERS COMPENSATION, OR OTHER LEAVE(S).PARTICIPATE IN PROFESSIONAL DEVELOPMENT ACTIVITIES AND MAINTAINS PROFESSIONAL AFFILIATIONS.PARTICIPATES IN ADMINISTRATIVE STAFF MEETINGS AND ATTENDS OTHER MEETINGS AND SEMINARS.ASSISTS TO ESTABLISH DEPARTMENTAL MEASUREMENTS THAT SUPPORT THE ACCOMPLISHMENT OF THE COMPANY'S STRATEGIC GOALS.PERFORMS OTHER RELATED DUTIES AND SPECIAL PROJECTS AS ASSIGNED. ADDITIONAL CANDIDATE REQUIREMENTS:UNDERGRADUATE DEGREE IN A RELATED FIELD OF STUDY REQUIRED. AT LEAST 2-4 YEARS OF PROGRESSIVE EXPERIENCE IN A HUMAN RESOURCES CAPACITY.STRONG KNOWLEDGE OF STATE AND FEDERAL EMPLOYMENT LAWS AND PRACTICES AND EXPERIENCE IN THE ADMINISTRATION OF BENEFITS PROGRAMS, EMPLOYEE LEAVE PROGRAMS, EMPLOYEE RELATIONS AND OTHER RELATED HR FUNCTIONAL AREAS. MUST POSSESS HRIS EXPERIENCE TO INCLUDE EXCELLENT COMPUTER SKILLS IN A MICROSOFT WINDOWS OFFICE ENVIRONMENT, WHICH INCLUDES WORD, EXCEL AND POWERPOINT.  ADDITIONAL PREFERRED ELIGIBILITY QUALIFICATIONS:PHR, OR SHRM-CP CERTIFICATION PREFERRED.ADP WORKFORCE NOW EXPERIENCE STRONGLY PREFERRED.  PROFESSIONAL CHARACTERISTICS:MUST BE ABLE TO MAINTAIN A HIGH LEVEL OF CONFIDENTIALITY, INTEGRITY, AND INITIATIVE.STRONG PRESENTATION SKILLS REQUIRED ALONG WITH ABILITY TO CLEARLY ARTICULATE COMPLEX HR AND PRACTICE RELATED TOPICS TO EMPLOYEES.MUST HAVE A STRONG SENSE OF TEAM COMMITMENT, WHICH INCLUDES MEETING DEADLINES, PUNCTUALITY AND EXCELLENT FOLLOW-THROUGH AND FEEDBACK.MUST BE ABLE TO PERFORM IN A FAST-PACED ENVIRONMENT AND EFFECTIVELY MANAGE MULTIPLE PRIORITIES AND TASKS SIMULTANEOUSLY. ABILITY TO FORM POSITIVE AND COLLABORATIVE RELATIONSHIPS WITH STAFF, PEERS, AND PHYSICIANS AT ALL LEVELS WITHIN THE COMPANY.MUST POSSESS EXCEPTIONAL INTERPERSONAL COMMUNICATION SKILLS AND CAN CREATE A FAVORABLE IMPRESSION FOR THE PRACTICE TO ALL STAFF, PATIENTS, AND THE PUBLIC. AFFIRMATIVE ACTION/EEO STATEMENTPHYSICIANS EAST, P.A.IS AN EQUAL OPPORTUNITY EMPLOYER AND WILL NOT DISCRIMINATE AGAINST ANY APPLICANT OR EMPLOYEE ON THE BASIS OF AGE, RACE, COLOR, ETHNICITY, RELIGION, CREED, SEX (INCLUDING GENDER, PREGNANCY, SEXUAL ORIENTATION, AND GENDER IDENTITY, WHICH INCLUDES STATUS AS A TRANSGENDER INDIVIDUAL), NATIONAL ORIGIN OR ANCESTRY, CITIZENSHIP, PAST, CURRENT, OR PROSPECTIVE SERVICE IN THE UNIFORMED SERVICES, GENETIC INFORMATION (INCLUDING FAMILY MEDICAL HISTORY), PHYSICAL OR MENTAL DISABILITY, OR OTHER LEGALLY PROTECTED STATUS. REASONABLE ACCOMMODATION WILL BE MADE FOR PERSONS WITH DISABILITIES DURING THE APPLICATION PROCESS AND/OR AT THE TIME OF EMPLOYMENT. REQUESTS FOR ACCOMMODATION SHOULD BE MADE TO THE HUMAN RESOURCES DEPARTMENT AS EARLY AS POSSIBLE IN THE APPLICATION/EMPLOYMENT PROCESS. CONTACT HR OFFICE AT: CAREERS@PHYSICIANSEAST.COM DISCLAIMERPLEASE NOTE THIS JOB DESCRIPTION IS NOT DESIGNED TO COVER OR CONTAIN A COMPREHENSIVE LISTING OF ACTIVITIES, DUTIES OR RESPONSIBILITIES THAT ARE REQUIRED OF THE EMPLOYEE FOR THIS JOB. DUTIES, RESPONSIBILITIES, AND ACTIVITIES MAY CHANGE AT ANY TIME WITH OR WITHOUT NOTICE.",
    "job_skill_set": [
      "HRIS",
      "Employee Relations",
      "Training Program Development",
      "Employment Law Knowledge",
      "Confidentiality",
      "Communication",
      "Teamwork",
      "Problem Solving",
      "Initiative",
      "Presentation Skills",
      "Interpersonal Skills",
      "Time Management",
      "Collaboration",
      "Adaptability",
      "Microsoft Office (Word, Excel, PowerPoint)",
      "Benefits Administration",
      "Leave Administration",
      "Payroll Management",
      "FMLA Compliance",
      "ADA Compliance",
      "Data Privacy Regulations",
      "HR Metrics",
      "ADP Workforce Now",
      "Investigative Skills"
    ],
    "short_keywords": [
      "ada",
      "adaptability",
      "administration",
      "adp",
      "benefits",
      "collaboration",
      "communication",
      "compliance",
      "confidentiality",
      "data",
      "development",
      "employee",
      "employment",
      "excel",
      "fmla",
      "generalist",
      "hr",
      "hris",
      "human",
      "initiative",
      "interpersonal",
      "investigative",
      "knowledge",
      "law",
      "leave",
      "management",
      "metrics",
      "microsoft",
      "now",
      "office",
      "payroll",
      "powerpoint",
      "presentation",
      "privacy",
      "problem",
      "program",
      "regulations",
      "relations",
      "resources",
      "skills",
      "solving",
      "teamwork",
      "time",
      "training",
      "word",
      "workforce"
    ]
  },
  {
    "job_id": "3902933509",
    "job_title": "Plant Human Resources Manager",
    "category": "HR",
    "job_description": "ARLINGTON RESOURCES, A CORNERSTONE STAFFING SOLUTIONS COMPANY, SPECIALIZES IN THE PLACEMENT OF HUMAN RESOURCES PROFESSIONALS FOR DIRECT PLACEMENT, TEMPORARY SERVICES AND HUMAN RESOURCES CONSULTING. SINCE 1997, ARLINGTON RESOURCES HAS SUCCESSFULLY PARTNERED WITH COMPANIES OF ALL SIZES FROM START-UP TO FORTUNE 100. WITH OUR SPECIALIZATION OF FILLING HUMAN RESOURCES JOBS IN CHICAGO IL, THE ARLINGTON RESOURCES TEAM HAS ESTABLISHED RELATIONSHIPS WITH THE HIGHEST CALIBER OF PROFESSIONALS IN THE FIELD.\nOUR CLIENT IN BELLWOOD, IL IS SEEKING A PLANT HUMAN RESOURCES MANAGER TO JOIN THEIR TEAM!\nRESPONSIBILITIES:WILL BE FLEXIBLE TO WORK ONSITE AND SUPPORT A LARGE, 24/7 MANUFACTURING FACILITYSERVE AS AN HR BUSINESS PARTNER ON WORKFORCE PLANNING, SUCCESSION PLANNING, TALENT ACQUISITION, EMPLOYEE RELATIONS, TALENT MANAGEMENT, COMPENSATION AND BENEFITS ADMINISTRATION, RECOGNITION PROGRAMS, COMPLIANCE AND TRAINING.MANAGEMENT OF HR ANALYTICS, SAFETY, ENGAGEMENT AND SALARY SURVEYS \nQUALIFICATIONS:BACHELOR'S DEGREE REQUIRED7+ YEARS OF PROGRESSIVE HR EXPERIENCE WITH AT LEAST 3 YEARS OF SUPERVISORY EXPERIENCESTRONG PROJECT MANAGEMENT SKILLS A MUSTPREVIOUS EXPERIENCE IN MANUFACTURING OR DISTRIBUTION\nTO APPLY PLEASE SEND YOUR RESUME AS AN E-MAIL ATTACHMENT IN MS WORD FORMAT TO HOPE@ARLINGTONRESOURCES.COM AND REFERENCE JOB#16584 OR APPLY VIA LINKEDIN!\nALL APPLICANTS WILL BE AFFORDED EQUAL OPPORTUNITY WITHOUT DISCRIMINATION BECAUSE OF RACE, COLOR, RELIGION, SEX, MARITAL STATUS, NATIONAL ORIGIN OR ANCESTRY, AGE, PHYSICAL OR MENTAL HANDICAP UNRELATED TO ABILITY OR AN UNFAVORABLE DISCHARGE FROM MILITARY SERVICE.",
    "job_skill_set": [
      "HR Management",
      "Talent Acquisition",
      "Employee Relations",
      "HR Analytics",
      "Compliance",
      "Compensation and Benefits Administration",
      "Training",
      "Communication",
      "Teamwork",
      "Problem Solving",
      "Flexibility",
      "Leadership",
      "Interpersonal Skills",
      "Analytical Thinking",
      "Adaptability",
      "Project Management",
      "Manufacturing Experience",
      "Succession Planning",
      "Safety Management",
      "Engagement Strategies",
      "Salary Surveys"
    ],
    "short_keywords": [
      "acquisition",
      "adaptability",
      "administration",
      "analytical",
      "analytics",
      "and",
      "benefits",
      "communication",
      "compensation",
      "compliance",
      "employee",
      "engagement",
      "experience",
      "flexibility",
      "hr",
      "human",
      "interpersonal",
      "leadership",
      "management",
      "manager",
      "manufacturing",
      "planning",
      "plant",
      "problem",
      "project",
      "relations",
      "resources",
      "safety",
      "salary",
      "skills",
      "solving",
      "strategies",
      "succession",
      "surveys",
      "talent",
      "teamwork",
      "thinking",
      "training"
    ]
  },
  {
    "job_id": "3905217845",
    "job_title": "Human Resources Manager",
    "category": "HR",
    "job_description": "A NATIONAL LEADER IN CUSTOMIZABLE SOLID SURFACE SHOWER AND RESTROOM PRODUCTS FOR COMMERCIAL USE. LEARN WHY OUR AMERICAN-MADE PRODUCTS ARE THE TOP CHOICE FOR HEALTH CARE, HOSPITALITY, HIGHER EDUCATION, MULTI-FAMILY, PUBLIC HOUSING, MILITARY AND GOVERNMENT PROJECTS.\nESSENTIAL FUNCTIONS AND KEY RESPONSIBILITIES:MANAGE AND/OR CREATE EMPLOYEE JOB DESCRIPTIONSMANAGE RECRUITING EFFORTSMANAGE EMPLOYMENT PROCESSES, INCLUDING HIRING, ONBOARDING, ORIENTATION, TRAINING, PROMOTION, TRANSFER, PERFORMANCE EVALUATIONS, DISCIPLINE & CORRECTIVE ACTION, TERMINATION, AND EXITMANAGE COMPENSATION AND ADMINISTER BENEFITSCREATE AND DISTRIBUTE EMPLOYEE COMMUNICATIONSPROMOTE EMPLOYEE RETENTIONWORK CLOSELY WITH OTHER MANAGERS AND DEPARTMENT HEADS TO UNDERSTAND STAFFING NEEDSMAINTAIN COMPLIANCE WITH ALL FEDERAL, STATE AND LOCAL HUMAN RESOURCES REGULATIONS AND PROGRAMS\nGENERAL REQUIREMENTS:ABLE TO QUICKLY RECALL INFORMATIONWORK IN A FAST-PACED ENVIRONMENTABLE TO THINK AND ACT INDEPENDENTLYATTENTION TO DETAILSTRONG VERBAL AND WRITTEN COMMUNICATION SKILLSSTRONG PRESENTATION SKILLS\nEDUCATION AND/OR EXPERIENCEBACHELOR’S DEGREE PREFERREDFIVE YEARS PROVEN HR AND LEADERSHIP EXPERIENCE, PREFERABLY IN A MANUFACTURING ENVIRONMENTSTRONG WORKING KNOWLEDGE OF FEDERAL/STATE/LOCAL LABOR REGULATIONSFINANCE EXPERIENCE IN COMMERCIAL CONSTRUCTION OR MANUFACTURING DESIREDEXPERIENCE WITH EOS PREFERREDMICROSOFT OFFICE SOFTWARE TO INCLUDE WORD, EXCEL, OUTLOOK; PAYCHEX",
    "job_skill_set": [
      "employee job descriptions",
      "recruiting",
      "employment processes",
      "compensation management",
      "benefits administration",
      "compliance with HR regulations",
      "Microsoft Office",
      "labor regulations",
      "communication",
      "presentation skills",
      "attention to detail",
      "independence",
      "problem solving",
      "teamwork",
      "adaptability",
      "time management",
      "Paychex",
      "EOS",
      "finance experience"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "attention",
      "benefits",
      "communication",
      "compensation",
      "compliance",
      "descriptions",
      "detail",
      "employee",
      "employment",
      "eos",
      "experience",
      "finance",
      "hr",
      "human",
      "independence",
      "job",
      "labor",
      "management",
      "manager",
      "microsoft",
      "office",
      "paychex",
      "presentation",
      "problem",
      "processes",
      "recruiting",
      "regulations",
      "resources",
      "skills",
      "solving",
      "teamwork",
      "time",
      "to",
      "with"
    ]
  },
  {
    "job_id": "3890896173",
    "job_title": "Human Resources Coordinator",
    "category": "HR",
    "job_description": "HUMAN RESOURCES COORDINATOR | $25-30 AN HOUR | TOP COMPANIES IN LOS ANGELES | TEMP, TEMP-HIRE\nOUR CLIENTS WITHIN THE FINANCE, ENTERTAINMENT, AND CREATIVE INDUSTRIES HERE IN LOS ANGELES HAVE MULTIPLE POSITIONS OPEN FOR HR COORDINATORS. THE HR COORDINATOR WILL SUCCESSFULLY MANAGE HR ADMINISTRATIVE PAPERWORK, HR PROCESSES, UPDATES, BUSINESS OBJECTIVE REPORTS, EMPLOYEE, AND CONSULTANT ONBOARDING/OFFBOARDING.\n RESPONSIBILITIESPROVIDE FULL-SCOPE HR SUPPORT TO BUSINESS LEADERS INCLUDING EMPLOYEE ENGAGEMENT AND EXPERIENCE, ORGANIZATIONAL DESIGN, CHANGE MANAGEMENT, EMPLOYEE COMMUNICATIONS, TALENT MANAGEMENT AND PEOPLE DEVELOPMENT AND EMPLOYEE RELATIONS SUPPORTPROVIDE A PLEASANT EXPERIENCE FOR EVERY CANDIDATE FROM APPLICATION STAGE TO OFFER WHILE EVALUATINGSKILL LEVEL, DRIVING THE INTERVIEW PROCESS, RUNNING REFERENCE CHECKS, MAKING SALARYRECOMMENDATIONS, AND CLOSING OF CANDIDATE OFFERSSERVE AS FIRST POINT OF CONTACT FOR ONBOARDING NEW HIRES AND CONDUCT NEW HIRE ORIENTATIONS, HANDLE ONBOARDING AND PAYROLL PAPERWORK, AND INPUT NEW HIRES IN OUR SYSTEMS\nREQUIREMENTSBA/BS DEGREE PREFERRED2+ YEARS IF RECENT AND RELEVANT HR EXPERIENCE REQUIREDBASIC KNOWLEDGE OF COMMONLY USED CONCEPTS, PRACTICES, AND PROCEDURES WITHIN HR AND RECRUITINGSTRONG COMPUTER SKILLS (MS WORD, MS EXCEL, AND MS OUTLOOK)\nPLEASE SUBMIT YOUR RESUME TO APPLY.\nYOU CAN USE WORKGRADES TO COLLECT AND MANAGE YOUR REFERENCES FOR FREE AND SHARE THEM WITH US OR ANYONE ELSE YOU CHOOSE BY VISITING WORKGRADES.COM/HOME/CANDIDATE. CANDIDATES WITH REFERENCES ARE ALWAYS PREFERRED BY OUR CLIENTS. NOW IS THE MOST IMPORTANT TIME TO STAND OUT FROM THE CROWD. WE SUGGEST THAT YOU ENSURE YOU HAVE UPDATED YOUR LINKEDIN PROFILE AND THAT YOU START COLLECTING YOUR REFERENCES EARLY.\nWE WILL CONSIDER QUALIFIED CANDIDATES WITH CRIMINAL HISTORIES IN A MANNER CONSISTENT WITH THE REQUIREMENTS OF",
    "job_skill_set": [
      "HR administrative paperwork",
      "employee onboarding",
      "employee offboarding",
      "talent management",
      "people development",
      "employee communications",
      "business objective reports",
      "interview process management",
      "reference checks",
      "salary recommendations",
      "communication",
      "problem solving",
      "teamwork",
      "attention to detail",
      "customer service",
      "adaptability",
      "time management",
      "organizational skills",
      "MS Word",
      "MS Excel",
      "MS Outlook",
      "organizational design",
      "change management"
    ],
    "short_keywords": [
      "adaptability",
      "administrative",
      "attention",
      "business",
      "change",
      "checks",
      "communication",
      "communications",
      "coordinator",
      "customer",
      "design",
      "detail",
      "development",
      "employee",
      "excel",
      "hr",
      "human",
      "interview",
      "management",
      "ms",
      "objective",
      "offboarding",
      "onboarding",
      "organizational",
      "outlook",
      "paperwork",
      "people",
      "problem",
      "process",
      "recommendations",
      "reference",
      "reports",
      "resources",
      "salary",
      "service",
      "skills",
      "solving",
      "talent",
      "teamwork",
      "time",
      "to",
      "word"
    ]
  },
  {
    "job_id": "3902875974",
    "job_title": "Director of Human Resources",
    "category": "HR",
    "job_description": "POSITION: DIRECTOR OF HUMAN RESOURCES\nREPORTS TO: CHIEF OPERATING OFFICER\nSTATUS: FULL-TIME; EXEMPT\nCOMPENSATION: ANNUAL SALARY $85,000 - $100,000 DEPENDING ON EXPERIENCE AND CERTIFICATIONS\nBENEFITS: MEDICAL, DENTAL, VISION, AND LIFE INSURANCE; EMPLOYEE ASSISTANCE PROGRAM; 403(B) RETIREMENT PLAN; PAID HOLIDAYS, SICK, AND VACATION\nLOCATION: SACRAMENTO, CA (THIS POSITION MAY BECOME ELIGIBLE FOR 1-2 DAYS OF REMOTE WORK AFTER 6-MONTHS OF SATISFACTORY ON-SITE PERFORMANCE)\nJOB SUMMARY: THE DIRECTOR OF HUMAN RESOURCES IS RESPONSIBLE FOR DEVELOPING AND MAINTAINING A POSITIVE WORKPLACE CULTURE AND EXECUTING HUMAN RESOURCES STRATEGIES IN SUPPORT OF THE CENTER'S MISSION, VISION, VALUES, AND CULTURE, SPECIFICALLY IN THE AREAS OF TALENT MANAGEMENT AND RETENTION; CHANGE MANAGEMENT; DIVERSITY, EQUITY, INCLUSION, AND BELONGING; ORGANIZATIONAL AND PERFORMANCE MANAGEMENT; TRAINING AND DEVELOPMENT; COMPENSATION; AND SUCCESSION PLANNING. THIS POSITION IS THE CENTER’S SOLE HR PROFESSIONAL AND ACTS AS A LIAISON BETWEEN MANAGERS AND EMPLOYEES ON ALL HUMAN RESOURCES-RELATED MATTERS, FACILITATES KEY COMMUNICATIONS, AND LEADS OR FACILITATES ONGOING HUMAN RESOURCES-RELATED DAY TO DAY FUNCTIONS AND ACTIVITIES FOR A RAPIDLY GROWING 50+ FTE ORGANIZATION. THIS POSITION IS SUPPORTED IN PART BY THE OFFICE MANAGER, WORKS CLOSELY WITH THE SENIOR LEADERSHIP TEAM AND IS HIGHLY COLLABORATIVELY WITH ALL MEMBERS OF THE FINANCE & OPERATIONS TEAM INCLUDING THE CHIEF OPERATING OFFICER, SENIOR ACCOUNTANT, GRANT FINANCE DIRECTOR, DATA MANAGER, FACILITIES COORDINATOR & CUSTODIAN, EXECUTIVE ASSISTANT, AND EXTERNAL CONTRACTORS.\nESSENTIAL FUNCTIONS:1. LEAD THE CREATION AND MAINTENANCE OF A PRODUCTIVE ORGANIZATIONAL CULTURE THAT IS GROUNDED IN VALUES INCLUDING EQUITY AND INCLUSION.2. MANAGE ALL HUMAN RESOURCE FUNCTIONS FOR THE ORGANIZATION INCLUDING SERVING AS THE PRIMARY INTERFACE WITH BENEFIT PROVIDERS, HRIS SYSTEMS, PAYROLL PROVIDERS, LEGAL COUNSEL, AND OTHER RISK MANAGEMENT PROFESSIONALS.3. LEAD TALENT DEVELOPMENT AND EMPLOYEE ENGAGEMENT.STRATEGIC LEADERSHIP AND ORGANIZATIONAL CULTURE:1. LEAD A COMPREHENSIVE HR STRATEGY AND PROGRAMS THAT THAT SUPPORT THE CENTER’S STAFF, PROGRAMS, AND DEPARTMENTS.2. IN PARTNERSHIP WITH THE DEPUTY CHIEF PROGRAM OFFICER AND THE EMPLOYEE DRIVEN EQUITY COMMITTEE, OVERSEE AND IMPLEMENT ORGANIZATION-WIDE EFFORTS TO CHAMPION DIVERSITY, EQUITY, INCLUSION, AND BELONGING INITIATIVES.3. CONTINUOUSLY EXAMINE POLICIES, PROCEDURES, AND CULTURAL NORMS WITH A RACIAL JUSTICE AND INTERSECTIONAL LENS, AND MAKE RECOMMENDATIONS ON CHANGES THAT WILL CREATE AN INCLUSIVE AND SUPPORTIVE CENTER FOR EMPLOYEES, VOLUNTEERS, CLIENTS, AND COMMUNITY MEMBERS.4. DEVELOP COMPENSATION, BENEFIT, PROFESSIONAL DEVELOPMENT, AND OPERATIONAL STRATEGIES THAT SUPPORT THE ORGANIZATION’S GOAL OF BECOMING A WORKPLACE OF CHOICE WITH HIGH EMPLOYEE SATISFACTION. 5. FORMULATE AND RECOMMEND HUMAN RESOURCES POLICIES ON ANY TOPIC ASSOCIATED WITH EMPLOYEE RELATIONS OR UPDATES TO COMPLY WITH UPDATES TO CURRENT LAWS OR REGULATIONS.6. WORK WITH SENIOR LEADERSHIP TO DEVELOP AND ESTABLISH A PLAN FOR MANAGEMENT SUCCESSION IN ALIGNMENT WITH THE STRATEGY AND OBJECTIVES OF THE ORGANIZATION.7. MAKE RECOMMENDATIONS RELATED TO HOW WORK IS CHANGING AND THE ORGANIZATIONAL AND CULTURAL TRANSFORMATION NEEDED TO HELP ALL EMPLOYEES ADJUST QUICKLY AND CHAMPION CHANGE.\nHUMAN RESOURCE MANAGEMENT:1. RESPONSIBLE FOR ALL HUMAN RESOURCES OPERATIONAL FUNCTIONS, INCLUDING DAY TO DAY IMPLEMENTATION OF HUMAN RESOURCE PLANNING, RECRUITMENT AND HIRING, COMPENSATION AND BENEFITS, LEAVES OF ABSENCE, PERFORMANCE MANAGEMENT AND EVALUATIONS, PROFESSIONAL DEVELOPMENT AND TRAINING, EMPLOYEE AND LABOR RELATIONS, CORRECTIVE ACTIONS AND TERMINATIONS, HR COMPLIANCE, WORKPLACE SAFETY, AND EMPLOYEE SATISFACTION.2. SERVE AS THE LEAD FOR EMPLOYEE RELATIONS ISSUES INCLUDING EMPLOYEE COMPLAINTS AND/OR GRIEVANCES; COUNSEL AND FACILITATE COMMUNICATION AMONGST EMPLOYEES AND MANAGERS, COMPLETE OR COORDINATE INVESTIGATIONS WITH EXTERNAL INVESTIGATORS AS NECESSARY, AND PREPARE AND MAINTAIN RELATED DOCUMENTATION.3. DEVELOP STANDARD OPERATING PROCEDURES FOR HUMAN RESOURCES FUNCTIONS AND SUPPORT CONSISTENT IMPLEMENTATION AND COMPLIANCE ACROSS THE AGENCY.4. PROVIDE NECESSARY EDUCATION AND MATERIALS TO MANAGERS AND EMPLOYEES INCLUDING WORKSHOPS, MANUALS, EMPLOYEE HANDBOOKS, STANDARDIZED REPORTS, AND CONDUCT NEW EMPLOYEE ORIENTATIONS AND OTHER AD HOC TRAININGS.5. RESPONSIBLE FOR COMPLIANCE, MAINTENANCE, AND CONFIDENTIALITY OF EMPLOYEE AND OTHER HUMAN RESOURCE RELATED RECORDS IN ACCORDANCE WITH PROPER PERSONNEL PRACTICE, ORGANIZATION POLICY, CONTRACTUAL AGREEMENT, AND/OR STATUTE.6. PARTNER WITH OFFICE MANAGER TO ENSURE THE ACCURACY OF PAYROLL AND TIMESHEET RECORDS, BENEFITS ACCRUAL AND DEDUCTIONS. SERVE AS BACKUP PAYROLL ADMINISTRATOR.7. SERVE AS PRIMARY CONTACT TO WORKERS’ COMPENSATION CARRIER AND ADMINISTRATORS, ENSURE TIMELY REPORTING, MAINTAIN AND MONITOR ALL WORKERS’ COMPENSATION CASE FILES, FOLLOW UP ON OPEN CASES, AND MANAGE INDUSTRIAL LEAVES OF ABSENCE.8. SERVE AS THE ORGANIZATION’S COMPLIANCE OFFICER TO ENSURE ALL STATE AND FEDERAL EMPLOYMENT AND REPORTING REQUIREMENTS ARE MET, INCLUDING BUT NOT LIMITED TO, EQUAL EMPLOYMENT OPPORTUNITY COMMISSION (EEOC), AMERICANS WITH DISABILITIES ACT (ADA), EMPLOYEE RETIREMENT INCOME SECURITY ACT, (ERISA) THE DEPARTMENT OF LABOR, WORKERS’ COMPENSATION, THE OCCUPATIONAL SAFETY AND HEALTH ADMINISTRATION AND CAL/OSHA.9. ENSURE OPERATION CONTROLS AND OVERSEES ALL ASPECTS OF SURVEYS AND AUDITS RELATED TO HUMAN RESOURCES, INCLUDING BUT NOT LIMITED TO THE WORKERS’ COMPENSATION PROGRAM, AUDITS AND THE 403(B) RETIREMENT PLAN AUDIT, ANNUAL FINANCIAL AUDIT, AND ALL COMPENSATION AND BENEFITS SURVEYS AND COMPLIANCE REQUIREMENTS.\nTALENT DEVELOPMENT AND EMPLOYEE ENGAGEMENT:1. COLLABORATE WITH ORGANIZATIONAL LEADERS ON STAFF PLANNING, DEVELOPMENT OF NEW POSITION DESCRIPTIONS, TARGETED STRATEGIES THAT ATTRACT QUALIFIED CANDIDATES, AND INCLUSIVE SEARCH PROCESSES.2. LEAD RECRUITMENT, HIRING, AND ONBOARDING OF NEW EMPLOYEES INCLUDING POSTING AND ADVERTISING NEW POSITIONS, MANAGING THE SEARCH PROCESS, AND CONDUCTING EMPLOYEE ORIENTATION PROGRAMS.3. DEVELOP AND MANAGE EMPLOYEE PROFESSIONAL DEVELOPMENT PROGRAMS INCLUDING LEGAL COMPLIANCE AND POSITION REQUIRED TRAININGS, MANAGEMENT SKILL DEVELOPMENT, AND EMPLOYEE INTEREST DRIVEN EXTERNAL OPPORTUNITIES; MAINTAIN AND SERVE AS ADMINISTRATOR OF A LEARNING MANAGEMENT SYSTEM TO TRACK AND REPORT.4. RESEARCH AND RESOLVE QUESTIONS FROM MANAGERS AND EMPLOYEES AS THEY RELATE TO LEGAL COMPLIANCE, HR POLICIES, PRACTICES, PROCEDURES, OR PROGRAMS.5. COACH MANAGERS REGARDING COMMUNICATION APPROACHES, FEEDBACK, RECOGNITION AND INTERACTION RESPONSIBILITIES WITH DIRECT REPORTS, MAKING CERTAIN THAT MANAGERS ARE SUPPORTED IN COMMUNICATING WITH STAFF SUCCESSFULLY, ETHICALLY, HONESTLY, AND LEGALLY.6. LEAD THE ANNUAL PERFORMANCE EVALUATION PROCESS, TRAINING STAFF, AND MANAGERS ON HOW TO COMPLETE EVALUATIONS. 7. TRACK AND ANALYZE DATA RELATED TO HIRING, EMPLOYEE COMPLAINTS AND SATISFACTION, EXITS, ETC. IDENTIFYING TRENDS AND MAKING DATA DRIVEN RECOMMENDATIONS TO SENIOR LEADERS.8. COLLABORATE WITH THE LEADERSHIP TEAM TO DEVELOP SYSTEMS AND DOCUMENTATION THAT SUPPORT INSTITUTIONAL RESILIENCY AND CONTINUOUS LEARNING SUCH AS AN ANNUAL REVIEW OF JOB DESCRIPTIONS, DEVELOPMENT OF POSITION-BASED JOB MANUALS AND STANDARD OPERATING PROCEDURES, CROSS-TRAINING, EMERGENCY PREPAREDNESS PLANNING.\nGENERAL DUTIES:1. FUNCTIONS AS A STRATEGIC MEMBER OF THE LEADERSHIP TEAM REGARDING KEY ORGANIZATIONAL AND MANAGEMENT ISSUES.2. SUPPORT PLANNING, FACILITATION, AND EVALUATION EFFORTS FOR STAFF AND BOARD RETREATS AND OTHER EMPLOYEE ENGAGEMENT EVENTS. 3. FACILITATE OR PARTICIPATE IN STAFF MEETINGS, PLANNING MEETINGS, COMMITTEE MEETINGS, AND OTHER MEETINGS AS NEEDED. 4. COLLABORATE WITH THE COMMUNITY ENGAGEMENT & VOLUNTEER SERVICES MANAGER TO SUPPORT A SUCCESSFUL VOLUNTEER RESOURCE PROGRAM AND MAINTAIN COMPLIANCE WITH ORGANIZATIONAL POLICIES AND PROCEDURES.5. PARTICIPATE IN A ROTATING LEADER ON-CALL PROGRAM TO SUPPORT ON-SITE STAFF IN CASE OF AFTER-HOURS EMERGENCIES.6. HANDLE A VARIETY OF SPECIAL PROJECTS AND OTHER RELATED DUTIES, AS ASSIGNED.THIS JOB DESCRIPTION IS NOT DESIGNED TO COVER OR CONTAIN A COMPREHENSIVE LISTING OF ACTIVITIES, DUTIES OR RESPONSIBILITIES THAT ARE REQUIRED OF THE EMPLOYEE. DUTIES, RESPONSIBILITIES AND ACTIVITIES MAY CHANGE, OR NEW ONES MAY BE ASSIGNED AT ANY TIME WITH OR WITHOUT NOTICE. \n...VIEW ORIGINAL JOB PAGE FOR THE REST OF THE INFORMATION.",
    "job_skill_set": [
      "human resources management",
      "talent management",
      "change management",
      "organizational management",
      "performance management",
      "training and development",
      "compensation management",
      "HRIS systems",
      "legal compliance",
      "employee relations",
      "payroll administration",
      "data analysis",
      "employee engagement",
      "recruitment and hiring",
      "confidentiality",
      "communication",
      "collaboration",
      "leadership",
      "strategic thinking",
      "problem solving",
      "coaching",
      "adaptability",
      "interpersonal skills",
      "conflict resolution",
      "organizational skills",
      "empathy",
      "facilitation",
      "diversity, equity, inclusion",
      "succession planning",
      "risk management",
      "workplace safety",
      "cultural competency"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "analysis",
      "and",
      "change",
      "coaching",
      "collaboration",
      "communication",
      "compensation",
      "competency",
      "compliance",
      "confidentiality",
      "conflict",
      "cultural",
      "data",
      "development",
      "director",
      "diversity",
      "empathy",
      "employee",
      "engagement",
      "equity",
      "facilitation",
      "hiring",
      "hr",
      "hris",
      "human",
      "inclusion",
      "interpersonal",
      "leadership",
      "legal",
      "management",
      "of",
      "organizational",
      "payroll",
      "performance",
      "planning",
      "problem",
      "recruitment",
      "relations",
      "resolution",
      "resources",
      "risk",
      "safety",
      "skills",
      "solving",
      "strategic",
      "succession",
      "systems",
      "talent",
      "thinking",
      "training",
      "workplace"
    ]
  }
]