[
  {
    "job_id": "3902934493",
    "job_title": "Information Technology Specialist 2 (NY HELPs) - 2921",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "MINIMUM QUALIFICATIONS\n\nOPEN COMPETITIVE: A BACHELOR'S OR HIGHER-LEVEL DEGREE INCLUDING OR SUPPLEMENTED BY 15 SEMESTER CREDIT HOURS IN COMPUTER SCIENCE.\n\nOR\n\nA BACHELOR'S OR HIGHER-LEVEL DEGREE IN ANY FIELD AND ONE YEAR OF EXPERIENCE IN INFORMATION TECHNOLOGY; OR 60 SEMESTER CREDIT HOURS INCLUDING OR SUPPLEMENTED BY 15 SEMESTER CREDIT HOURS IN COMPUTER SCIENCE AND ONE YEAR OF PROFESSIONAL EXPERIENCE IN INFORMATION TECHNOLOGY.\n\nOR\n\nTWO YEARS OF PROFESSIONAL EXPERIENCE IN INFORMATION TECHNOLOGY.\n\nTRANSFER: OPEN TO NYS EMPLOYEES WITH ONE YEAR OF PERMANENT COMPETITIVE SERVICE AS AN INFORMATION TECHNOLOGY SPECIALIST 2 OR INFORMATION TECHNOLOGY SPECIALIST 2 PROGRAMMING, G-18; OR IN A TITLE G-16 OR ABOVE DEEMED ADMINISTRATIVE UNDER SECTION 52.6 OF THE CIVIL SERVICE LAW.\n\n55B/C APPOINTMENT: THIS POSITION IS ELIGIBLE FOR 55B/C DESIGNATION AND CANDIDATES ARE ENCOURAGED TO APPLY.\n\nNYS HELPS: THIS TITLE IS PART OF THE NEW YORK HIRING FOR EMERGENCY LIMITED PLACEMENT STATEWIDE PROGRAM (NY HELPS).\n\nDUTIES DESCRIPTION\n\nTHE INCUMBENT FOR THIS POSITION WILL BE PART OF A GROUP WITHIN THE WEBNY PLATFORM TEAM THAT HELPS TO ENSURE ALL WEBSITES DEVELOPED AND DELIVERED ARE FUNCTIONALLY ACCESSIBLE TO ALL USERS REGARDLESS OF ABILITY. THE DUTIES OF THE POSITION INCLUDE:\n\n TEST WEBSITES FOR ACCESSIBILITY ISSUES PROVIDE GUIDANCE AND SUPPORT TO DEVELOPERS TO DEVELOP WEBSITES, OR COMPONENTS OF WEBSITES, THAT ADHERE TO ACCESSIBILITY COMPLIANCE PROVIDE GUIDANCE AND SUPPORT TO CONTENT EDITORS TO GENERATE CONTENT THAT ADHERE TO ACCESSIBILITY COMPLIANCE EVALUATE AND RESPOND TO ACCESSIBILITY ISSUES AS REPORTED BY TESTING TOOLS OR VENDORS\n\nTASKS WILL INCLUDE\n\n USE ACCESSIBILITY TESTING AND/OR MONITORING TOOLS TO ASSESS WEBSITE COMPLIANCE CREATE ACCESSIBILITY REPORTS TO SHARE UPDATES ON OUR PROGRESS RESEARCH RESOURCES TO AIDE DEVELOPERS IN THEIR REMEDIATION EFFORTS CREATE USER STORIES TO DOCUMENT ACCESSIBILITY ISSUES AND PROVIDE ALL ELEMENTS NEEDED BY DEVELOPERS FOR REMEDIATION IDENTIFY AND POST ACCESSIBILITY RESOURCES FOR OUR VARIOUS AUDIENCES (CLIENT AGENCIES, QA TEAM, DEVELOPMENT TEAM, DESIGN TEAM, ETC.) PROVIDE VERBAL AND PREPARE WRITTEN COMMUNICATION TO OTHER TEAM MEMBERS AND POSSIBLY TO CLIENTS, AND ATTEND MEETINGS AS NEEDED CREATE PRESENTATION MATERIALS AS NEEDED TO REPORT ON STATUS OF ACCESSIBILITY ISSUES; SUPPORT ANY TASKS RELATED TO TRAINING AND AUDIT FUNCTIONS AS NEEDED\n\nDAILY TASK WILL REQUIRE THE USE OF THE FOLLOWING MS OFFICE APPLICATIONS\n\nWORDPOWERPOINTEXCELOUTLOOKTEAMSSHAREPOINT\n\nADDITIONAL COMMENTS\n\nSOME POSITIONS MAY REQUIRE FINGERPRINTING.\n\nSOME POSITIONS MAY REQUIRE UP TO 25% TRAVEL AND/OR LIFTING UP TO 50 LBS. SOME POSITIONS ARE PENDING CIVIL SERVICE APPROVAL. DETAILS OF POSITION(S) WILL BE DESCRIBED FURTHER IF YOU ARE SELECTED FOR AN INTERVIEW.\n\nPOSITIONS LOCATED IN NEW YORK CITY, WILL RECEIVE AN ADDITIONAL $3,400 DOWNSTATE ADJUSTMENT LOCATION PAY WITH REGULAR ANNUAL SALARY. POSITIONS LOCATED IN THE MID-HUDSON WILL RECEIVE AN ADDITIONAL $1,650 ADJUSTMENT LOCATION PAY.\n\nFOR THE DURATION OF THE NY HELPS PROGRAM, THIS TITLE MAYBE FILLED VIA A NON- COMPETITIVE APPOINTMENT, WHICH MEANS NO EXAMINATION IS REQUIRED BUT ALL CANDIDATES MUST MEET THE MINIMUM QUALIFICATIONS OF THE TITLE FOR WHICH THEY APPLY. AT THIS TIME, AGENCIES MAY RECRUIT AND HIRE EMPLOYEES BY MAKING TEMPORARY APPOINTMENTS. IN MAY 2024, IF A TEMPORARY NY HELPS EMPLOYEE IS SATISFACTORILY PERFORMING IN THE POSITION, THE APPOINTMENT WILL BE CHANGED FROM TEMPORARY PENDING CIVIL SERVICE COMMISSION ACTION TO PERMANENT NON-COMPETITIVE AND THE OFFICIAL PROBATIONARY PERIOD WILL BEGIN.\n\nAT A FUTURE DATE (WITHIN ONE YEAR OF PERMANENT APPOINTMENT), IT IS EXPECTED EMPLOYEES HIRED UNDER NY HELPS WILL HAVE THEIR NON-COMPETITIVE EMPLOYMENT STATUS CONVERTED TO COMPETITIVE STATUS, WITHOUT HAVING TO COMPETE IN AN EXAMINATION. EMPLOYEES WILL THEN BE AFFORDED WITH ALL OF THE SAME RIGHTS AND PRIVILEGES OF COMPETITIVE CLASS EMPLOYEES OF NEW YORK STATE. WHILE SERVING PERMANENTLY IN A NY HELPS TITLE, EMPLOYEES MAY TAKE PART IN ANY PROMOTION EXAMINATION FOR WHICH THEY ARE QUALIFIED.\n\nWE ARE RECRUITING FOR POSITIONS WITHIN THIS ROLE.\n\nBENEFITS OF WORKING FOR NYS GENEROUS BENEFITS PACKAGE, WORTH 65% OF SALARY, INCLUDING:\n\nHOLIDAY & PAID TIME OFF\n\n THIRTEEN (13) PAID HOLIDAYS ANNUALLY UP TO THIRTEEN (13) DAYS OF PAID VACATION LEAVE ANNUALLY UP TO FIVE (5) DAYS OF PAID PERSONAL LEAVE ANNUALLY UP TO THIRTEEN (13) DAYS OF PAID SICK LEAVE ANNUALLY FOR PEF. UP TO THREE (3) DAYS OF PROFESSIONAL LEAVE ANNUALLY TO PARTICIPATE IN PROFESSIONAL DEVELOPMENT\n\nHEALTH CARE BENEFITS\n\n ELIGIBLE EMPLOYEES AND DEPENDENTS CAN PICK FROM A VARIETY OF AFFORDABLE HEALTH INSURANCE PROGRAMS FAMILY DENTAL AND VISION BENEFITS AT NO ADDITIONAL COST\n\nADDITIONAL BENEFITS\n\n NEW YORK STATE EMPLOYEES’ RETIREMENT SYSTEM (ERS) MEMBERSHIP NYS DEFERRED COMPENSATION ACCESS TO NY 529 AND NY ABLE COLLEGE SAVINGS PROGRAMS, AS WELL AS U.S. SAVINGS BONDS PUBLIC SERVICE LOAN FORGIVENESS (PSLF) AND MANY MORE.\n\n",
    "job_skill_set": [
      "computer science",
      "MS Office (Word, PowerPoint, Excel, Outlook, Teams, SharePoint)",
      "website compliance",
      "content generation",
      "report creation",
      "research",
      "communication",
      "teamwork",
      "problem solving",
      "guidance and support",
      "presentation skills",
      "attention to detail",
      "accessibility testing tools"
    ],
    "short_keywords": [
      "2",
      "2921",
      "accessibility",
      "and",
      "attention",
      "communication",
      "compliance",
      "computer",
      "content",
      "creation",
      "detail",
      "excel",
      "generation",
      "guidance",
      "helps",
      "information",
      "informationtechnology",
      "ms",
      "ny",
      "office",
      "outlook",
      "powerpoint",
      "presentation",
      "problem",
      "report",
      "research",
      "science",
      "sharepoint",
      "skills",
      "solving",
      "specialist",
      "support",
      "teams",
      "teamwork",
      "technology",
      "testing",
      "to",
      "tools",
      "website",
      "word"
    ]
  },
  {
    "job_id": "3904051866",
    "job_title": "Information Technology Specialist (PLCYPLN)",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "SUMMARY\n\nATF IS A LAW ENFORCEMENT AGENCY IN THE U.S. DEPARTMENT OF JUSTICE THAT PROTECTS OUR COMMUNITIES FROM VIOLENT CRIMINALS/CRIMINAL ORGANIZATIONS, ILLEGAL USE/TRAFFICKING OF FIREARMS, ILLEGAL USE/STORAGE OF EXPLOSIVES, ACTS OF ARSON/BOMBINGS, ACTS OF TERRORISM, AND ILLEGAL DIVERSION OF ALCOHOL/TOBACCO PRODUCTS. WE PARTNER WITH COMMUNITIES, INDUSTRIES, LAW ENFORCEMENT, AND PUBLIC SAFETY AGENCIES TO SAFEGUARD THE PUBLIC THROUGH INFORMATION SHARING, TRAINING, RESEARCH, & TECHNOLOGY. VISIT\n\nTHIS JOB IS OPEN TO THE PUBLIC.\n\nCLARIFICATION FROM THE AGENCY\n\nYOUR APPLICATION WILL BE CONSIDERED IF YOU ARE A: CURRENT OR FORMER CAREER/CAREER-CONDITIONAL; REINSTATEMENT ELIGIBLE; SPECIAL APPOINTING AUTHORITY (I.E., MILITARY SPOUSE, LAND AND BASE MANAGEMENT, 30% VETERAN, SCH A) ELIGIBLE; VEOA ELIGIBLE VETERAN; ICTAP ELIGIBLE; OR OPM INTERCHANGE AGREEMENT ELIGIBLE.\n\nDUTIES\n\nTHIS POSITION IS LOCATED UNDER THE OFFICE OF PUBLIC AND GOVERNMENTAL AFFAIRS, INFORMATION AND PRIVACY GOVERNANCE DIVISION IN ANYWHERE IN THE U.S. (REMOTE JOB).\n\nTHE PRIMARY PURPOSE OF THIS POSITION IS TO SERVE AS AN IT SPECIALIST (POLICY AND PLANNING) PROVIDING EXPERT GUIDANCE ON THE DEVELOPMENT, DELIVERY, AND SUPPORT OF IT SYSTEMS AND SERVICES AND WORK IN CLOSE COORDINATION WITH THE PRIVACY BRANCH CHIEF TO HELP GUIDE, MANAGE, AND DEVELOP ATF'S PRIVACY PROGRAM, ENSURING SUFFICIENT CONSIDERATION AND PROTECTION OF PRIVACY IN THE COLLECTION, MAINTENANCE, USE, SHARING, AND DISPOSAL OF PERSONAL INFORMATION ABOUT INDIVIDUALS ACROSS ALL ATF PROGRAMS AND ACTIVITIES.\n\nAS A INFORMATION TECHNOLOGY SPECIALIST (PLCYPLN), GS-2210-13, YOUR TYPICAL WORK ASSIGNMENTS MAY INCLUDE:\n\nLEVERAGING THE NIST CYBERSECURITY FRAMEWORK TO CONDUCT COMPREHENSIVE TECHNICAL AND CONTROL ASSESSMENTS;ADVISING ON PRIVACY POLICIES, LEGISLATIVE FRAMEWORKS, REGULATIONS, AND ATF'S POLICY INITIATIVES, CONTRACTS, AND DATA-SHARING ARRANGEMENTS;CONDUCTING TECHNICAL SYSTEM REVIEWS, COLLABORATING THE RESPONSE TO DATA BREACHES INVOLVING PII, AND IDENTIFYING AND MITIGATING PRIVACY RISKS ASSOCIATED WITH NEW TECHNOLOGIES OR OUTDATED SYSTEMS;OVERSEEING PRIVACY NOTIFICATIONS, FACILITATING THE RELEASE AND USE OF PROTECTED PRIVACY INFORMATION AND MANAGING PRIVACY TRAINING AND AWARENESS INITIATIVES;COLLABORATING WITH PEERS, PRIVACY AND LEGAL PROFESSIONALS ON COMPLEX PRIVACY ISSUES.\n\nREQUIREMENTS\n\nCONDITIONS OF EMPLOYMENT\n\nTHE TIME-IN-GRADE REQUIREMENT MUST BE MET BY THE CLOSING DATE OF THIS ANNOUNCEMENT. THE QUALIFICATION REQUIREMENTS LISTED BELOW MUST BE MET BY THE CLOSING DATE OF THE ANNOUNCEMENT.\n\nTHIS IS A NON-BARGAINING UNIT POSITION.\n\nMOBILITY PLAN: NEW EMPLOYEES HIRED PURSUANT TO THIS VACANCY ANNOUNCEMENT MUST SIGN A MOBILITY AGREEMENT. THE PURPOSE OF ATF'S MOBILITY POLICY IS TO ENHANCE CAREER DEVELOPMENT AND PROGRESSION, AND ACHIEVE MISSION AND BUSINESS EFFECTIVENESS. TO ACCOMPLISH THESE OBJECTIVES, THE MOBILITY PLAN WILL FACILITATE THE MOVEMENT OF EMPLOYEES THROUGH SPECIAL SHORT-TERM ASSIGNMENTS OR PERMANENT REASSIGNMENTS THROUGHOUT THE BUREAU. APPLICANTS WHO DECLINE TO SIGN A MOBILITY AGREEMENT, AS REQUIRED, WILL BE REMOVED FROM THE HIRING PROCESS.\n\nKEY REQUIREMENTS\n\nMUST BE A U.S. CITIZEN OR NATIONAL.SUITABLE FOR FEDERAL EMPLOYMENT DETERMINED BY BACKGROUND INVESTIGATION.MUST BE REGISTERED OR EXEMPT FROM THE SELECTIVE SERVICE. SEE MAY BE REQUIRED TO SERVE A ONE YEAR PROBATIONARY PERIOD.\n\nQUALIFICATIONS\n\nBASIC REQUIREMENTS: EXPERIENCE MUST BE IT RELATED; THE EXPERIENCE MAY BE DEMONSTRATED BY PAID OR UNPAID EXPERIENCE AND/OR COMPLETION OF SPECIFIC, INTENSIVE TRAINING (FOR EXAMPLE, IT CERTIFICATION), AS APPROPRIATE.\n\nGS-5 THROUGH GS-15 (OR EQUIVALENT): FOR ALL POSITIONS INDIVIDUALS MUST HAVE IT-RELATED EXPERIENCE DEMONSTRATING EACH OF THE FOUR COMPETENCIES LISTED BELOW. THE EMPLOYING AGENCY IS RESPONSIBLE FOR IDENTIFYING THE SPECIFIC LEVEL OF PROFICIENCY REQUIRED FOR EACH COMPETENCY AT EACH GRADE LEVEL BASED ON THE REQUIREMENTS OF THE POSITION BEING FILLED.\n\nATTENTION TO DETAIL - IS THOROUGH WHEN PERFORMING WORK AND CONSCIENTIOUS ABOUT ATTENDING TO DETAIL.CUSTOMER SERVICE - WORKS WITH CLIENTS AND CUSTOMERS (THAT IS, ANY INDIVIDUALS WHO USE OR RECEIVE THE SERVICES OR PRODUCTS THAT YOUR WORK UNIT PRODUCES, INCLUDING THE GENERAL PUBLIC, INDIVIDUALS WHO WORK IN THE AGENCY, OTHER AGENCIES, OR ORGANIZATIONS OUTSIDE THE GOVERNMENT) TO ASSESS THEIR NEEDS, PROVIDE INFORMATION OR ASSISTANCE, RESOLVE THEIR PROBLEMS, OR SATISFY THEIR EXPECTATIONS; KNOWS ABOUT AVAILABLE PRODUCTS AND SERVICES; IS COMMITTED TO PROVIDING QUALITY PRODUCTS AND SERVICES.ORAL COMMUNICATION - EXPRESSES INFORMATION (FOR EXAMPLE, IDEAS OR FACTS) TO INDIVIDUALS OR GROUPS EFFECTIVELY, TAKING INTO ACCOUNT THE AUDIENCE AND NATURE OF THE INFORMATION (FOR EXAMPLE, TECHNICAL, SENSITIVE, CONTROVERSIAL); MAKES CLEAR AND CONVINCING ORAL PRESENTATIONS; LISTENS TO OTHERS, ATTENDS TO NONVERBAL CUES, AND RESPONDS APPROPRIATELY.PROBLEM SOLVING - IDENTIFIES PROBLEMS; DETERMINES ACCURACY AND RELEVANCE OF INFORMATION; USES SOUND JUDGMENT TO GENERATE AND EVALUATE ALTERNATIVES, AND TO MAKE RECOMMENDATIONS.\n\nAND\n\nIN ADDITION TO THE BASIC REQUIREMENTS, YOU MUST MEET THE SPECIALIZED EXPERIENCE.\n\nDUTIES\n\nGS-13 - YOU QUALIFY IF YOU POSSESS ONE YEAR OF SPECIALIZED EXPERIENCE, EQUIVALENT TO THE GS-12 GRADE LEVEL IN THE FEDERAL, STATE, OR LOCAL GOVERNMENT OR EQUIVALENT PUBLIC OR PRIVATE SECTOR EXPERIENCE, PERFORMING THE FOLLOWING DUTIES:\n\nIMPLEMENTING AND ASSESSING PRIVACY COMPLIANCE AND RISK MANAGEMENT PROGRAMS AND ENSURING ADHERENCE TO PRIVACY LAWS, REGULATIONS, AND POLICIES; ANDIDENTIFYING, ANALYZING, AND DEVELOPING SOLUTIONS FOR PRIVACY ISSUES AND CHALLENGES, AND RECOMMENDING RECOMMENDATIONS TO AUGMENT THE PRIVACY PROGRAM; ANDPERFORMING ADVISORY AND LIAISON FUNCTIONS RELATED TO PRIVACY MATTERS AND ADVISING MANAGEMENT ON THE PRIVACY IMPLICATIONS OF NEW TECHNOLOGIES AND INITIATIVES; ANDDRAFTING AND REVIEWING PRIVACY COMPLIANCE DOCUMENTS, SUCH AS PIAS AND SORNS, ENSURING ACCURACY AND COMPLIANCE WITH DOCUMENT CONTROL AND SECURITY MEASURES TO PROTECT INFORMATION AND SAFEGUARD PRIVACY; ANDNEGOTIATING WITH MANAGEMENT FOR ACCEPTANCE AND IMPLEMENTATION OF RECOMMENDATIONS TO ENHANCE PRIVACY PROGRAM EFFECTIVENESS.\n\nSUBSTITUTION OF EDUCATION IN LIEU OF SPECIALIZED EXPERIENCE MAY NOT BE USED FOR THIS GRADE LEVEL.\n\nPLEASE DO NOT CUT AND PASTE THE POSITION DESCRIPTION, SPECIALIZED EXPERIENCE, OR OCCUPATIONAL ASSESSMENT QUESTIONNAIRE FROM THIS ANNOUNCEMENT INTO YOUR RESUME, AS THIS WILL NOT BE CONSIDERED A DEMONSTRATION OF YOUR QUALIFICATIONS FOR THIS POSITION.\n\nEXPERIENCE MUST BE IN THE NORMAL LINE OF PROGRESSION OR MUST BE RELATED TO THE WORK OF THE POSITION ADVERTISED AND MUST BE REFLECTED IN RESUME.\n\nTHE CAREER TRANSITION ASSISTANCE PLAN (CTAP). THE CTAP PROVIDES ELIGIBLE SURPLUS AND DISPLACED COMPETITIVE SERVICE EMPLOYEES IN THE DEPARTMENT OF JUSTICE WITH SELECTION PRIORITY OVER OTHER CANDIDATES FOR COMPETITIVE SERVICE VACANCIES. IF YOUR DEPARTMENT OF JUSTICE COMPONENT HAS NOTIFIED YOU IN WRITING THAT YOU ARE A SURPLUS OR DISPLACED EMPLOYEE ELIGIBLE FOR CTAP CONSIDERATION, YOU MAY RECEIVE SELECTION PRIORITY IF: 1) THIS VACANCY IS WITHIN YOUR CTAP ELIGIBILITY, 2) YOU APPLY UNDER THE INSTRUCTIONS IN THIS ANNOUNCEMENT, AND 3) YOU ARE FOUND WELL-QUALIFIED FOR THIS VACANCY. TO BE WELL QUALIFIED, YOU MUST SATISFY ALL QUALIFICATION REQUIREMENTS FOR THE VACANT POSITION AND SCORE 85 OR BETTER ON ESTABLISHED RANKING CRITERIA. YOU MUST PROVIDE A COPY OF YOUR WRITTEN NOTIFICATION OF CTAP ELIGIBILITY WITH YOUR APPLICATION. ADDITIONAL INFORMATION ABOUT CTAP ELIGIBILITY IS AT:\n\nINTERAGENCY CAREER TRANSITION ASSISTANCE PLAN (ICTAP). THE ICTAP PROVIDES ELIGIBLE DISPLACED FEDERAL COMPETITIVE SERVICE EMPLOYEES WITH SELECTION PRIORITY OVER OTHER CANDIDATES FOR COMPETITIVE SERVICE VACANCIES. IF YOUR AGENCY HAS NOTIFIED YOU IN WRITING THAT YOU ARE A DISPLACED EMPLOYEE ELIGIBLE FOR ICTAP CONSIDERATION, YOU MAY RECEIVE SELECTION PRIORITY IF: 1) THIS VACANCY IS WITHIN YOUR ICTAP ELIGIBILITY; 2) YOU APPLY UNDER THE INSTRUCTIONS IN THIS ANNOUNCEMENT; AND 3) YOU ARE FOUND WELL-QUALIFIED FOR THIS VACANCY. TO BE WELL QUALIFIED, YOU MUST SATISFY ALL QUALIFICATION REQUIREMENTS FOR THE VACANT POSITION AND SCORE 85 OR BETTER ON ESTABLISHED RANKING CRITERIA. YOU MUST PROVIDE PROOF OF ELIGIBILITY WITH YOUR APPLICATION TO RECEIVE SELECTION PRIORITY. SUCH PROOF MAY INCLUDE A COPY OF YOUR WRITTEN NOTIFICATION OF ICTAP ELIGIBILITY OR A COPY OF YOUR SEPARATION PERSONNEL ACTION FORM. ADDITIONAL INFORMATION ABOUT ICTAP ELIGIBILITY IS AT:\n\nVETERANS EMPLOYMENT OPPORTUNITY ACT (VEOA): VEOA ALLOWS ELIGIBLE VETERANS TO APPLY AND COMPETE FOR POSITIONS ANNOUNCED UNDER MERIT PROMOTION PROCEDURES WHEN THE HIRING AGENCY IS RECRUITING FROM OUTSIDE ITS OWN WORKFORCE. TO BE ELIGIBLE FOR A VETERAN EMPLOYMENT OPPORTUNITIES ACT (VEOA) APPOINTMENT, A VETERAN MUST BE HONORABLY SEPARATED AND EITHER A PREFERENCE ELIGIBLE OR HAVE SUBSTANTIALLY COMPLETED THREE (3) OR MORE YEARS OF CONTINUOUS ACTIVE MILITARY SERVICE. IF YOU ARE APPLYING FOR A MERIT PROMOTION ANNOUNCEMENT AND WISH TO BE CONSIDERED UNDER THE VEOA, YOU MUST SUBMIT A COPY OF THE MEMBER COPY 4 OF YOUR DD-214, IN ADDITION TO ANY OTHER REQUIRED DOCUMENTS LISTED ON THIS ANNOUNCEMENT.\n\nEDUCATION\n\nTHIS POSITION DOES NOT HAVE AN EDUCATION QUALIFICATION REQUIREMENT.\n\nADDITIONAL INFORMATION\n\nADDITIONAL VACANCIES MAY BE FILLED FROM THIS VACANCY ANNOUNCEMENT.\n\nNOTICE TO PROSPECTIVE EMPLOYEES OF ETHICAL OBLIGATIONS FROM ATF'S HUMAN RESOURCES OPERATIONS DIVISION. PLEASE CLICK ON THE FOLLOWING LINK TO READ IMPORTANT INFORMATION.\n\nSELECTIVE SERVICE: IF YOU ARE A MALE APPLICANT BORN AFTER DECEMBER 31, 1959, YOU MUST CERTIFY THAT YOU HAVE REGISTERED WITH THE SELECTIVE SERVICE SYSTEM, OR ARE EXEMPT FROM HAVING TO DO SO UNDER THE SELECTIVE SERVICE LAW. SEE\n\nEEO STATEMENT: THE UNITED STATES GOVERNMENT DOES NOT DISCRIMINATE IN EMPLOYMENT ON THE BASIS OF RACE, COLOR, RELIGION, SEX, NATIONAL ORIGIN, POLITICAL AFFILIATION, SEXUAL ORIENTATION, MARITAL STATUS, STATUS AS A PARENT, GENETIC INFORMATION, DISABILITY, AGE, MEMBERSHIP OR NON-MEMBERSHIP IN AN EMPLOYEE ORGANIZATION, OR ON THE BASIS OF PERSONAL FAVORITISM. APPLICANTS WHO BELIEVE THEY HAVE BEEN SUBJECTED TO DISCRIMINATION, OR RETALIATION FOR PARTICIPATING IN EEO ACTIVITY OR FOR OPPOSING DISCRIMINATION, SHOULD CONTACT THE ATF'S OFFICE OF EQUAL EMPLOYMENT OPPORTUNITY AT (202) 648-8760 WITHIN 45 CALENDAR DAYS OF WHEN THE ALLEGED HARM OCCURRED.\n\nPLEASE CLICK ON THE FOLLOWING LINK TO READ IMPORTANT INFORMATION.\n\nDIVERSITY STATEMENT: \"AS THE FEDERAL AGENCY WHOSE MISSION IS TO ENSURE THE FAIR AND IMPARTIAL ADMINISTRATION OF JUSTICE FOR ALL AMERICANS, THE DEPARTMENT OF JUSTICE IS COMMITTED TO FOSTERING A DIVERSE AND INCLUSIVE WORK ENVIRONMENT. TO BUILD AND RETAIN A WORKFORCE THAT REFLECTS THE DIVERSE EXPERIENCES AND PERSPECTIVES OF THE AMERICAN PEOPLE, WE WELCOME APPLICANTS FROM THE MANY COMMUNITIES, IDENTITIES, RACES, ETHNICITIES, BACKGROUNDS, ABILITIES, RELIGIONS, AND CULTURES OF THE UNITED STATES WHO SHARE OUR COMMITMENT TO PUBLIC SERVICE.\"\n\nREASONABLE ACCOMMODATION (RA) REQUESTS: IF YOU BELIEVE YOU HAVE A DISABILITY (I.E., PHYSICAL OR MENTAL), COVERED BY THE REHABILITATION ACT OF 1973 AS AMENDED, THAT WOULD INTERFERE WITH COMPLETING THE USA HIRE COMPETENCY BASED ASSESSMENTS, YOU WILL BE GRANTED THE OPPORTUNITY TO REQUEST RA IN YOUR ONLINE APPLICATION. REQUESTS FOR RA FOR THE USA HIRE COMPETENCY BASED ASSESSMENTS AND APPROPRIATE SUPPORTING DOCUMENTATION FOR RA MUST BE RECEIVED PRIOR TO STARTING THE USA HIRE COMPETENCY BASED ASSESSMENTS. DECISIONS ON REQUESTS FOR RA ARE MADE ON A CASE-BY-CASE BASIS. IF YOU MEET THE MINIMUM QUALIFICATIONS OF THE POSITION, AFTER NOTIFICATION OF THE ADJUDICATION OF YOUR REQUEST, YOU WILL RECEIVE AN EMAIL INVITATION TO COMPLETE THE USA HIRE COMPETENCY BASED ASSESSMENTS. YOU MUST COMPLETE ALL ASSESSMENTS WITHIN 48 HOURS OF RECEIVING THE URL TO ACCESS THE USA HIRE COMPETENCY BASED ASSESSMENTS, IF YOU RECEIVE THE LINK AFTER THE CLOSE OF THE ANNOUNCEMENT. TO DETERMINE IF YOU NEED RA, PLEASE REVIEW THE PROCEDURES FOR REQUESTING A REASONABLE ACCOMMODATION FOR ONLINE ASSESSMENTS\n\n\"FEDERAL REGULATIONS STATE NO ATF EMPLOYEE, HIS/HER SPOUSE, OR HIS/HER MINOR CHILD SHALL HAVE, DIRECTLY OR INDIRECTLY, ANY FINANCIAL INTEREST, INCLUDING COMPENSATED EMPLOYMENT, STOCK, OR PROPRIETARY INTEREST IN THE ALCOHOL, TOBACCO, FIREARMS OR EXPLOSIVES INDUSTRIES. YOU SHOULD BE AWARE THAT YOU MAY BE ASKED TO RELINQUISH ANY OWNERSHIP OF OR INTERESTS IN THE ALCOHOL, TOBACCO, FIREARMS OR EXPLOSIVES INDUSTRIES BEFORE A DETERMINATION CAN BE MADE WHETHER ACCESS TO ATF INFORMATION, INFORMATION TECHNOLOGY SYSTEMS, AND/OR FACILITIES CAN BE AUTHORIZED.\"",
    "job_skill_set": [
      "NIST Cybersecurity Framework",
      "Risk Management",
      "Technical System Reviews",
      "IT Systems Support",
      "Attention to Detail",
      "Customer Service",
      "Oral Communication",
      "Problem Solving",
      "Collaboration",
      "Advisory Skills",
      "Privacy Compliance",
      "Data Breach Response",
      "Privacy Policy Development",
      "Privacy Training Management",
      "Document Control",
      "Technical Writing",
      "Negotiation"
    ],
    "short_keywords": [
      "advisory",
      "attention",
      "breach",
      "collaboration",
      "communication",
      "compliance",
      "control",
      "customer",
      "cybersecurity",
      "data",
      "detail",
      "development",
      "document",
      "framework",
      "information",
      "informationtechnology",
      "it",
      "management",
      "negotiation",
      "nist",
      "oral",
      "plcypln",
      "policy",
      "privacy",
      "problem",
      "response",
      "reviews",
      "risk",
      "service",
      "skills",
      "solving",
      "specialist",
      "support",
      "system",
      "systems",
      "technical",
      "technology",
      "to",
      "training",
      "writing"
    ]
  },
  {
    "job_id": "3904955205",
    "job_title": "Information Technology Asset Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "QUALIFICATIONS:• STRONG FINANCIAL, COMMUNICATION AND PRESENTATION SKILLS DEMONSTRATING THE ABILITY TO ADAPT TO SHIFTING PRIORITIES WHILE MAINTAINING A HIGH LEVEL OF SERVICE.• GENERAL KNOWLEDGE OF PROCUREMENT LIFECYCLE AND ASSOCIATED PROCESSES.• UNDERSTANDING OF ASSET MANAGEMENT LIFE CYCLE AND RELATED APPLICATIONSHAVE SOME EXPERIENCE USING SEVICENOW AND ARIBA APPLICATIONS.\nRESPONSIBILITIES:• PARTICIPATE IN TRAINING FOR USE OF ASSET MANAGEMENT TOOLING TO ENSURE ADHERENCE TO POLICY, STANDARDS, PROCESSES, AND STRATEGIC PRIORITIES FOR THE BANK’S IT ASSETS.• MAINTAIN CURRENT INFORMATION RELATED TO BANK’S IT ASSETS, PERIODICALLY REVIEW SYSTEM INFORMATION WITH THE BUSINESS OWNERS AND CERTIFY ANNUALLY THE ACCURACY AND CURRENCY OF THE INFORMATION MAINTAINED IN THE ASSET MANAGEMENT SYSTEMS OF RECORD.• PROVIDE METRICS AND REPORTING ON THE TECHNOLOGY ASSETS.• PARTICIPATE IN NEW AND ONGOING ITAM INITIATIVES.",
    "job_skill_set": [
      "communication",
      "metrics reporting",
      "adaptability",
      "attention to detail",
      "team collaboration",
      "financial analysis",
      "presentation skills",
      "procurement lifecycle knowledge",
      "asset management lifecycle knowledge",
      "ServiceNow",
      "Ariba"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "ariba",
      "asset",
      "attention",
      "collaboration",
      "communication",
      "detail",
      "financial",
      "information",
      "informationtechnology",
      "knowledge",
      "lifecycle",
      "management",
      "manager",
      "metrics",
      "presentation",
      "procurement",
      "reporting",
      "servicenow",
      "skills",
      "team",
      "technology",
      "to"
    ]
  },
  {
    "job_id": "3898156760",
    "job_title": "Strategic Director Information Technology",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "ABOUT COMMUNITY STATE BANKARE YOU PASSIONATE ABOUT SERVING YOUR COMMUNITY AND HELPING YOUR NEIGHBORS? ARE YOU TALENTED, CREATIVE OR HARD-WORKING? ALL OF THE ABOVE? DO YOU WANT TO WORK IN A FUN AND REWARDING ENVIRONMENT? AS A MEMBER OF THE CSB TEAM, NOT ONLY WILL YOU EXPERIENCE OUR SUPPORTIVE WORK CULTURE, BUT YOU WILL ALSO RECEIVE THE OPPORTUNITIES, TOOLS AND ENCOURAGEMENT CRITICAL FOR PROFESSIONAL GROWTH.\nPURPOSE: THE STRATEGIC DIRECTOR INFORMATION TECHNOLOGY IS RESPONSIBLE FOR ASSISTING IN MANAGING THE BANK’S COMPUTER SYSTEMS, COMPUTER NETWORK, AND ALL TECHNOLOGY-RELATED SYSTEMS.\nESSENTIAL DUTIES AND RESPONSIBILITIES: THE FOLLOWING DUTIES ARE NORMAL FOR THIS POSITION. THESE ARE NOT TO BE CONSTRUED AS EXCLUSIVE OR ALL-INCLUSIVE. OTHER DUTIES MAY BE REQUIRED AND ASSIGNED.\nMANAGES ALL ASPECTS OF IT OPERATIONS OF THE INFORMATION TECHNOLOGY DEPARTMENT, INCLUDING DIRECTING STAFF WHO SUPPORT ADMINISTRATIVE COMPUTING, NETWORKING, USER SERVICES, TELECOMMUNICATIONS, AND OTHER INFORMATION TECHNOLOGY FUNCTIONS.\nASSESSES AND RECOMMENDS TECHNOLOGICAL SOLUTIONS.\nIS ACCOUNTABLE FOR THE SUCCESSFUL IMPLEMENTATION OF TECHNICAL SOLUTIONS.\nANALYZES BUSINESS REQUIREMENTS/PROBLEMS/GAPS, INVESTIGATES ALTERNATIVES, AND PROPOSES RECOMMENDATIONS TO IMPROVE/AUTOMATE BUSINESS PROCESSES.\nAUTHORS INTERNAL DOCUMENTATION, SUCH AS PROCESS/SYSTEM FLOW DIAGRAMS, INSTALLATION/CONFIGURATION/SETUP DOCUMENTS, AND RELEASE NOTES.\nPROVIDES THOROUGH AND TIMELY ANALYSES OF TECHNOLOGY SYSTEMS, WITH ONGOING RECOMMENDATIONS TO MANAGEMENT.\nCOMPLETES AND KEEPS UP-TO-DATE TECHNOLOGY INVENTORY RECORDS.\nREMEDIES MINOR EXCEPTIONS IN A TIMELY MANNER.\nESTABLISHES AND DIRECTS THE STRATEGIC AND TACTICAL GOALS, POLICIES, AND PROCEDURES FOR THE INFORMATION TECHNOLOGY DEPARTMENT.\nPARTICIPATES IN VENDOR CONTRACT NEGOTIATIONS FOR ALL NEW COMPUTER EQUIPMENT AND SOFTWARE PURCHASED FOR THE CORPORATION.\nWORKS WITH NETWORK VENDOR(S) TO DESIGN, ESTABLISH, AND MAINTAIN A NETWORK INFRASTRUCTURE FOR LOCAL AND WIDE AREA CONNECTIVITY AND REMOTE ACCESS.\nSUPERVISES INFORMATION SYSTEM AND COMMUNICATIONS NETWORK.\nWORKS CLOSELY WITH OTHER C-LEVEL EXECUTIVES TO CREATE STRATEGIC PLANS FOR THE BUSINESS’ FUTURE GROWTH.\nENSURES THE SECURITY OF THE ORGANIZATION’S IT ASSETS.\nFACILITATES COMMUNICATION BETWEEN STAFF, MANAGEMENT, VENDORS, AND OTHER TECHNOLOGY RESOURCES WITHIN THE ORGANIZATION.\nOTHER ACTIVITIESPROMOTES CSB AS A RELATIONSHIP BANK WITH A COMMUNITY FOCUS BY BEING INVOLVED IN COMMUNITY PROJECTS/ACTIVITIES.STAYS CURRENT ON ALL LAWS AND REGULATIONS.BELIEVES IN AND SUPPORTS OUR MISSION, VISION, AND VALUES.\nQUALIFICATION REQUIREMENTS: TO PERFORM THIS JOB SUCCESSFULLY, AN INDIVIDUAL MUST BE ABLE TO PERFORM EACH ESSENTIAL DUTY SATISFACTORILY. THE REQUIREMENTS LISTED BELOW ARE REPRESENTATIVE OF THE KNOWLEDGE, SKILL, AND ABILITY REQUIRED.\nEDUCATION: BACHELOR’S DEGREE IN INFORMATION TECHNOLOGIES, OR EQUIVALENT WORK EXPERIENCE.\nEXPERIENCE: 5 YEARS OF RELEVANT EXPERIENCE.\nSKILLS: STRONG MATH SKILLS, STRONG COMMUNICATION SKILLS, PROFICIENT IN EXCEL, WORD, AND FINANCIAL SYSTEMS, DETAIL-ORIENTED, DEPENDABLE, AND ABLE TO MULTITASK, ABLE TO COMMUNICATE WELL AT ALL LEVELS AND EFFECTIVELY ENGAGE SENIOR LENDERS.\nHUMAN RELATIONS: REQUIRES THE ABILITY TO COMMUNICATE EFFECTIVELY BOTH ORALLY AND IN WRITING WITH VARIOUS LEVELS OF STAFF AND OUTSIDE CONTACTS.\nRESPONSIBILITY AND DECISION-MAKING: REGULAR JUDGMENTS ARE MADE WITH THE GUIDANCE OF GENERAL POLICIES AND PROCEDURES.\nSUPERVISION OF OTHERS: HAS DIRECT SUPERVISORY RESPONSIBILITIES. PROVIDES SIGNIFICANT INPUT INTO HIRING AND TERMINATION OF DIRECT REPORTS.\nPHYSICAL DEMANDS: THE PHYSICAL DEMANDS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY THE ASSOCIATE TO SUCCESSFULLY PERFORM THE ESSENTIAL FUNCTIONS OF THIS JOB. MUST BE ABLE TO VISIT MULTIPLE OFFICES. MUST BE ABLE TO LIFT 25 LBS.\nWORK ENVIRONMENT: THE OVERALL WORKING CONDITIONS ARE RELATIVELY SAFE AND COMFORTABLE, TYPICAL OF AN OFFICE ENVIRONMENT.",
    "job_skill_set": [
      "technical solution implementation",
      "business process analysis",
      "documentation authoring",
      "proficient in Word",
      "mathematical skills",
      "communication",
      "team leadership",
      "problem solving",
      "multitasking",
      "dependability",
      "detail-oriented",
      "relationship building",
      "community involvement",
      "IT operations management",
      "network infrastructure design",
      "technology inventory management",
      "vendor contract negotiation",
      "security management",
      "proficient in Excel",
      "financial systems knowledge"
    ],
    "short_keywords": [
      "analysis",
      "authoring",
      "building",
      "business",
      "communication",
      "community",
      "contract",
      "dependability",
      "design",
      "detailoriented",
      "director",
      "documentation",
      "excel",
      "financial",
      "implementation",
      "in",
      "information",
      "informationtechnology",
      "infrastructure",
      "inventory",
      "involvement",
      "it",
      "knowledge",
      "leadership",
      "management",
      "mathematical",
      "multitasking",
      "negotiation",
      "network",
      "operations",
      "problem",
      "process",
      "proficient",
      "relationship",
      "security",
      "skills",
      "solution",
      "solving",
      "strategic",
      "systems",
      "team",
      "technical",
      "technology",
      "vendor",
      "word"
    ]
  },
  {
    "job_id": "3904724867",
    "job_title": "Director of Information Technology",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "AT INVESTCO, WE ARE TEAM OF PROFESSIONALS WHO MANAGE, DIRECT, AND GROW A LARGE PORTFOLIO OF OPERATING BUSINESSES AND REAL ESTATE ASSETS INCLUDING RESIDENTIAL, COMMERCIAL, INDUSTRIAL, AND AGRICULTURAL PROPERTIES. WE’VE BEEN IN BUSINESS SINCE 1983 WITH A LASER FOCUS ON CREATING AND BUILDING LASTING VALUE FOR GENERATIONS. COME JOIN OUR TEAM!\nTHE DIRECTOR OF IT IS RESPONSIBLE FOR THE OVERALL LEADERSHIP OF INFORMATION TECHNOLOGY, TOOLS AND PROCESSES AT INVESTCO AND OUR AFFILIATED COMPANIES TO INCLUDE CORPORATE AND FIELD LOCATIONS. THIS ONSITE ROLE IS RESPONSIBLE FOR PLANNING, ORGANIZING, AND OVERSEEING ALL IT PROJECTS AND DRIVING THE STRATEGIC VISION SERVING AS A PARTNER FOR STAKEHOLDERS ACROSS OUR ORGANIZATIONS TO ACHIEVE COMPANY OBJECTIVES AND GOALS.\n\nRESPONSIBILITIES\nLEAD A TEAM OF IT PROFESSIONALS, PROVIDING GUIDANCE, MENTORSHIP, AND PERFORMANCE MANAGEMENT TO DRIVE HIGH LEVELS OF PRODUCTIVITY AND EMPLOYEE ENGAGEMENT.DEVELOP AND IMPLEMENT AN IT STRATEGY ALIGNED WITH THE COMPANY’S OVERALL OBJECTIVES, ENSURING TECHNOLOGY INITIATIVES SUPPORT AND ENHANCE BUSINESS PROCESSES AND GOALSCOMMUNICATE STRATEGY TO PERSONNEL, OPERATIONS, AND LEADERSHIP TO ENSURE ALIGNMENTGROW THE BREADTH AND DEPTH OF DEPARTMENT EXPERTISE TO MEET SHORT AND LONG-TERM COMPANY OBJECTIVESSERVE AS CHAMPION FOR THE MANAGEMENT, GOVERNANCE, AND QUALITY OF DATA AS WELL AS FOR VENDOR RELATIONSHIPSMAINTAIN ONGOING KNOWLEDGE OF INDUSTRY TRENDS AND ABILITY TO UTILIZE THAT KNOWLEDGE TO DETERMINE THE MOST EFFICIENT WAYS TO MEET BUSINESS NEEDSREGULARLY ENGAGE WITH LEADERSHIP TO FOSTER TRUST AND CULTIVATE STRONG RELATIONSHIPSSERVE AS TRUSTED ADVISOR ACROSS THE BUSINESS, PROVIDING STRATEGIC GUIDANCE AND INSIGHTS ON TECHNOLOGY-RELATED MATTERS.OVERSEE THE DESIGN, IMPLEMENTATION, AND MAINTENANCE OF THE COMPANY’S IT INFRASTRUCTURE, INCLUDING NETWORKS, SERVERS, SYSTEMS, AND SOFTWARE APPLICATIONS OF CORPORATE AND SITE LOCATIONS.OVERSEE HARDWARE AND SOFTWARE DEPLOYMENT MANAGEMENT.ENSURE CAPABILITIES ARE IN PLACE TO PROTECT SENSITIVE INFORMATION AND SYSTEM-CRUCIAL DATALEAD OVERALL APPLICATION MANAGEMENT.LEAD OVERALL ASSESSMENT & MITIGATION OF IT RISKS.OVERSEE PLANNING AND MANAGING DISASTER RECOVERY.ESTABLISH AND ENFORCE IT SECURITY POLICIES FOR DATA ACCESS, DEVICES, INCIDENT RESPONSE, AND OTHER SECURITY CHALLENGES TO ENSURE COMPLIANCE AND ALIGNMENT WITH BEST PRACTICES.STAY CURRENT WITH EMERGING TECHNOLOGIES AND TRENDS IN THE IT INDUSTRY, EVALUATING THEIR POTENTIAL IMPACT ON THE BUSINESS AND MAKING RECOMMENDATIONS FOR ADOPTION WITH BEST PRACTICES.RESPONSIBLE FOR PREPARING AND PRESENTATION OF THE GLOBAL TECHNOLOGY BUDGET. COORDINATING WITH APPROPRIATE COMPANY LEADERS ON IT BUDGET ALLOCATIONS.RESPONSIBLE FOR BUDGETING AND CALCULATING THE ROI OF IT SYSTEMS AND RISK MANAGEMENT.\n\nQUALIFICATIONS\n10+ YEARS OF PROGRESSIVE EXPERIENCE, WITH PROVEN TRACK RECORD OF SUCCESSBACHELOR’S DEGREE IN INFORMATION TECHNOLOGY OR RELATED DISCIPLINE IS REQUIRED.TECHNICAL CERTIFICATIONS A PLUS (I.E., PMP, ITIL, CISSP)ABILITY TO THINK AND PLAN BOTH STRATEGICALLY AND TACTICALLYPROVEN TRACK RECORD OF DRIVING STRATEGIC IT INITIATIVES AND DELIVERING MEASURABLE BUSINESS RESULTS.BUDGET MANAGEMENT SKILLSTECHNOLOGY TEAM LEADERSHIP EXPERIENCECURRENT WITH TECHNOLOGY INNOVATION TRENDS, APPLYING VALUE-ADD SOLUTIONS WITH THE HIGHEST ROISTRONG INTERPERSONAL & COMMUNICATIONS SKILLS WITH THE ABILITY TO ADAPT TO CHANGE.EXTENSIVE KNOWLEDGE OF SERVER AND NETWORKING TECHNOLOGIESEXPERIENCE WITH VARIOUS SOFTWARE APPLICATION, HARDWARE AND OPERATING SYSTEMS. YARDI EXPERIENCE A PLUS\n\nWE ARE AN EQUAL OPPORTUNITY EMPLOYER. WE CONSIDER APPLICANTS FOR ALL POSITIONS WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, NATIONAL ORIGIN, AGE, DISABILITY, SEXUAL ORIENTATION, MARITAL OR VETERAN STATUS, OR ANY OTHER LEGALLY PROTECTED STATUS.",
    "job_skill_set": [
      "IT strategy development",
      "budget management",
      "project management",
      "networking technologies",
      "server management",
      "software applications",
      "disaster recovery planning",
      "IT security policies",
      "technical certifications (PMP, ITIL, CISSP)",
      "ROI calculation for IT systems",
      "leadership",
      "communication",
      "interpersonal skills",
      "strategic thinking",
      "adaptability",
      "mentorship",
      "relationship building",
      "trust cultivation",
      "data governance",
      "Yardi software"
    ],
    "short_keywords": [
      "adaptability",
      "applications",
      "budget",
      "building",
      "calculation",
      "certifications",
      "cissp",
      "communication",
      "cultivation",
      "data",
      "development",
      "director",
      "disaster",
      "for",
      "governance",
      "information",
      "informationtechnology",
      "interpersonal",
      "it",
      "itil",
      "leadership",
      "management",
      "mentorship",
      "networking",
      "of",
      "planning",
      "pmp",
      "policies",
      "project",
      "recovery",
      "relationship",
      "roi",
      "security",
      "server",
      "skills",
      "software",
      "strategic",
      "strategy",
      "systems",
      "technical",
      "technologies",
      "technology",
      "thinking",
      "trust",
      "yardi"
    ]
  },
  {
    "job_id": "3901378554",
    "job_title": "Information Technology Sourcing Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "****MUST BE ABLE TO WORK 3 DAYS ONSITE PER WEEK IN ONE OF THE CLIENT'S SERVICE CENTERS. THERE ARE MANY DIFFERENT LOCATIONS FOR THE SERVICE CENTERS IN MICHIGAN. APPLICANTS WHO CAN WORK ONSITE IN JACKSON, MI ARE PREFERRED.\nSUMMARY:THE IT SOURCING MANAGER NEGOTIATES WITH SUPPLIERS TO OBTAIN GOODS, MATERIALS, AND SERVICES AT THE BEST PRICES (TOTAL COST OF OWNERSHIP) BY DEVELOPING AND IMPLEMENTING STRATEGIES FOR COST REDUCTION, SUPPLIER CONSOLIDATION, QUALITY IMPROVEMENTS AND PROCESS EFFICIENCIES. USING STRATEGIC SOURCING STRATEGIES AND EXTENSIVE KNOWLEDGE OF THEIR COMMODITY INDUSTRY, WE ASSIST IN EFFECTING MORE EFFICIENT SOURCING PROCESSES TO SAVE COSTS AND MAXIMIZE PROFITABILITY. DUTIES:COMPLETES IT [SOFTWARE, SERVICES, TELECOM, CYBER, HARDWARE] NON-STRATEGIC SERVICE AND MATERIAL (EQUIPMENT) PURCHASE REQUESTS BY VERIFYING SPECIFICATIONS AND/OR SCOPE OF WORK; DETERMINING IF A REQUEST FOR INFORMATION (RFI), REQUEST FOR PROPOSAL (RFP) OR REQUEST FOR QUOTE (RFQ) IS NEEDED; ADMINISTER THE (RFI, RFP OR RFQ); NEGOTIATE COST EFFECTIVE AGREEMENTS WITH KEY SUPPLIERS BASED ON OUR CORE VALUES OF PROCUREMENT SAFETY/QUALITY/COST/DELIVERY/MORALE.\"WORK WITH OUR SUPPLIERS, INTERNAL STAKEHOLDERS AND LEGAL COUNCIL TO NEGOTIATE CONTRACTUAL TERMS AND CONDITIONS REDUCING RISK TO THE COMPANY. SOURCING MANAGER NEGOTIATES FAVORABLE TERMS WITH THE SUPPLIER (DRIVEN BY COMPANY STANDARDS) UNTIL AGREEMENT EXECUTION.IN ADDITION, COORDINATE CONTRACT CHANGE REQUESTS AS NEEDED. COLLABORATE WITH SUPPLIER QUALITY AND PERFORMANCE, STRATEGIC SOURCING AND BUSINESS PARTNERS TO DEVELOP SUPPLIERS, IMPROVE EFFECTIVENESS AND DRIVE DOWN COSTS. SUPPORT THE FRAMEWORK, METRICS, AND GOALS FOR CONTINUOUS IMPROVEMENT TO ACHIEVE PROCESS EXCELLENCE AND STAY CURRENT WITH INDUSTRY INNOVATIONS. THE SOURCING MANAGER WORKS WITH DEPARTMENT MANAGERS, IN THE DEVELOPMENT OF LEADING PRACTICES FOR PROCUREMENT AND ISSUE RESOLUTION THROUGHOUT THE ORGANIZATION.USE APPROPRIATE VERIFICATION TECHNIQUES (PORTFOLIO ANALYSES, MARKET/COMPETITIVE DATA) NOT ONLY TO MANAGE CONTRACTUAL OBLIGATIONS, BUT ALSO TO IDENTIFY OPPORTUNITIES FOR COST SAVINGS.MANAGE RELATIONSHIPS WITH KEY INTERNAL STAKEHOLDERS AND SUPPLIERS TO PROCURE HIGH QUALITY PRODUCTS AND SERVICES THAT ARE DELIVERED ON-TIME, WITHIN SCOPE AND WITHIN BUDGET.PROACTIVELY MANAGE CONTRACTS TO FULLY EXECUTED STATUS (INCLUDES SPEND AND END DATES).ENSURE COMMERCIAL, LEGAL AND CONTRACTUAL COMPLIANCES IN ALL PROCUREMENT TRANSACTIONS INCLUDING COMPANY PROCESSES, POLICIES AND PROCEDURES.OTHER NON-ESSENTIAL DUTIES AS ASSIGNED OR MAY BE NECESSARY\nSKILLS:PREVIOUS EXPERIENCE IN AN INFORMATION TECHNOLOGY SUPPORT ROLE.KNOWLEDGE OF BUSINESS LAW, COMMERCIAL TERMS AND CONDITIONS, AND RELATED LEGAL ISSUES. NEGOTIATIONS AND COMPETITIVE PROCESS ENGAGEMENT RECOGNIZING TCO.IT CONTRACT DEVELOPMENT AND MANAGEMENT. EXPERIENCE IN SUPPLY CHAIN INCLUDING 2+ YEARS INFORMATION TECHNOLOGY SERVICES/SOURCING, RFX END TO END WITH A FOCUS ON SAAS, PAAS AND IAAS CONTRACTING.ABILITY TO PROVIDE GUIDANCE TO DEVELOP AND EVOLVE SOURCING MANAGEMENT PROCESSES, DEVELOP METRICS, AND ENGAGE SUPPLIERS ON OPERATIONAL, STRATEGIC, AND FINANCIAL ISSUES. THE SOURCING MANAGER IS KNOWLEDGEABLE ABOUT PROCUREMENT PROCESSES AND ESCALATION MECHANISMS. DEMONSTRATE ADVANCED ABILITY TO INFLUENCE STAKEHOLDERS, DELIVER CUSTOMER SERVICE, AND RESOLVE ISSUES EFFECTIVELY AND EFFICIENTLY. CREATING, ANALYZING, ALIGNING, AND EDITING INFORMATION TECHNOLOGY CONTRACTS INCLUDING SUPPLIER PAPER. EXCELS IN CRITICAL THOUGHT DISCIPLINE- FACT BASED MEASURES AND OBSERVATIONS RELATED TO PRODUCTION OF RATIONAL EVALUATIONS/PROPOSALS.KNOWLEDGE AND UNDERSTANDING OF THE COMPLETE PROCUREMENT CYCLE, INCLUDING EXPERIENCE COMPLETING REQUEST FOR QUOTE (RFQ) AND REQUEST FOR PROPOSAL (RFP) PACKAGES. ABILITY TO ANALYZE FLAT FILES, DATA, SCOPE AND STATEMENTS OF WORK (SOW) TO UNDERSTAND KEY REQUIREMENTS TO CREATE, ALIGN, AND EDIT SOURCING PACKAGES AND CONTRACTS. EXCELLENT COMMUNICATION, BOTH WRITTEN AND VERBAL, SUPPLIER MANAGEMENT, NEGOTIATION, AND ANALYTICAL SKILLSETS. PROVEN EXPERIENCE CREATING, ANALYZING, NEGOTIATING AND EDITING CONTRACTS WITH COMPANY STANDARDS AND REFLECTIVE OF BUSINESS PARTNER INTERESTS. PROFICIENCY WITH MS OFFICE SUITE INCLUDING ADVANCED EXCEL, POWERBI, SERVICE NOW, AND SAP.",
    "job_skill_set": [
      "negotiation",
      "data analysis",
      "communication",
      "stakeholder management",
      "problem solving",
      "customer service",
      "critical thinking",
      "influence",
      "team collaboration",
      "process improvement",
      "contract management",
      "supply chain management",
      "procurement processes",
      "MS Office Suite",
      "PowerBI",
      "Service Now",
      "SAP",
      "IT sourcing",
      "RFX processes",
      "SaaS",
      "PaaS",
      "IaaS",
      "business law knowledge"
    ],
    "short_keywords": [
      "analysis",
      "business",
      "chain",
      "collaboration",
      "communication",
      "contract",
      "critical",
      "customer",
      "data",
      "iaas",
      "improvement",
      "influence",
      "information",
      "informationtechnology",
      "it",
      "knowledge",
      "law",
      "management",
      "manager",
      "ms",
      "negotiation",
      "now",
      "office",
      "paas",
      "powerbi",
      "problem",
      "process",
      "processes",
      "procurement",
      "rfx",
      "saas",
      "sap",
      "service",
      "solving",
      "sourcing",
      "stakeholder",
      "suite",
      "supply",
      "team",
      "technology",
      "thinking"
    ]
  },
  {
    "job_id": "3898161973",
    "job_title": "Information Technology Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "CRAWFORD TECHNOLOGIES, ONE OF THE CANADA'S FASTEST GROWING COMPANIES, IS SEEKING A MANAGER OF INFORMATION TECHNOLOGY TO JOIN OUR TEAM. REPORTING TO THE DIRECTOR OF TECHNICAL SERVICES, THE IT MANAGER WILL BE RESPONSIBLE FOR MANAGING THE IT TEAM, IT SECURITY, HELPDESK, SYSTEMS AND NETWORK ADMINISTRATION, AND MAINTAINING IT ASSETS, INCLUDING ON-PREM DATACENTERS, CLOUD, DESKTOPS, LAPTOPS, SERVERS, PERIPHERALS, NETWORK EQUIPMENT, AND SOFTWARE APPLICATIONS.\nKEY RESPONSIBILITIESLEAD, MANAGE, AND DEVELOP A TEAM OF SYSTEMS ADMINISTRATORS TO DESIGN, DEPLOY, AND MANAGE CORPORATE IT INFRASTRUCTURE AND PRODUCTION HYBRID CLOUD AND ON-PREM INFRASTRUCTURE.FORMULATES, DEVELOPS, VALIDATES, AND IMPLEMENTS IT POLICIES, PROCEDURES, AND BEST PRACTICES.ANALYZES NEW TECHNOLOGIES, PARTICIPATES IN, AND DRIVES THE TECHNICAL ASPECTS OF STRATEGIC DECISIONS REGARDING IT FOR THE ENTERPRISE.DELEGATES RESPONSIBILITIES EFFECTIVELY WITHIN THE IT TEAM TO MANAGE ACTIVE DIRECTORY, MICROSOFT365, VIRTUAL ENVIRONMENTS, CLOUD ENVIRONMENTS, BACKUP SOLUTIONS.LEAD AND MANAGE END USER SUPPORT WITH THE HELPDESK SYSTEM.MANAGE THE IT BUDGET AND IS RESPONSIBLE FOR ALL IT-RELATED PURCHASES.\nSKILLS, KNOWLEDGE, EXPERTISE AND EDUCATION 8+ YEARS’ EXPERIENCE IN NETWORK ENGINEERING AND IT SYSTEMS ADMINISTRATION5 YEARS MANAGEMENT EXPERIENCEEXPERIENCE IN THE MOST CURRENT TECHNOLOGIES AND PRODUCTS USED IN THE INDUSTRY.PROJECT MANAGEMENT EXPERIENCE, INCLUDING ORGANIZING AND EXECUTING PROJECTS.ABILITY TO MANAGE MICROSOFT WINDOWS, LINUX, AND UNIX-BASED ENVIRONMENTS.UNDERSTANDING OF NETWORK MONITORING TOOLSKNOWLEDGE OF ENTERPRISE IT INFRASTRUCTURE, MANAGEMENT, MONITORING, AND SECURITYBACKGROUND IN COMPLIANCE WITH PCI, HITRUST, AND SOC2BACHELOR’S DEGREE IN COMPUTER SCIENCE, INFORMATION TECHNOLOGY OR ANOTHER RELATED FIELD AND OR COMBINATION OF EDUCATION AND EXPERTISE. \nBENEFITSCOMPETITIVE SALARY (COMMENSURATE WITH EXPERIENCE AND POSITION AND ELIGIBLE COMMISSION) EXCELLENT BENEFITSMEDICALDENTALVISIONSHORT TERM DISABILITYLONG TERM DISABILITYGROUP AND VOLUNTARY LIFESICK TIME PAYVACATION PAYHOLIDAY PAYBE PART OF A RAPIDLY GROWING SOFTWARE COMPANY HOW LONG WILL THE ROLE BE OPEN FOR? UNTIL FILLED.\nPRIOR TO SUBMITTING AN APPLICATION/RESUME, REVIEW THE JOB DESCRIPTIONS COMPLETE LIST OF JOB DUTIES AND QUALIFICATIONS.\n WE THANK ALL APPLICANTS FOR THEIR INTEREST IN JOINING OUR TEAM. THOSE SHORT LISTED WILL BE CONTACTED.\n SHOULD YOU NEED ANY ASSISTANCE IN THE APPLICATION PROCESS, PLEASE CONTACT CSTEINBOCK@CRAWFORDTECH.COM.",
    "job_skill_set": [
      "IT security",
      "project management",
      "IT policies and procedures",
      "team leadership",
      "communication",
      "analytical thinking",
      "delegation",
      "problem solving",
      "organizational skills",
      "IT management",
      "network engineering",
      "systems administration",
      "Microsoft Windows",
      "Linux",
      "Unix",
      "Active Directory",
      "Microsoft 365",
      "cloud environments",
      "network monitoring tools",
      "IT budget management",
      "compliance (PCI, HITRUST, SOC2)",
      "hybrid cloud infrastructure",
      "helpdesk systems",
      "strategic decision making"
    ],
    "short_keywords": [
      "365",
      "active",
      "administration",
      "analytical",
      "and",
      "budget",
      "cloud",
      "communication",
      "compliance",
      "decision",
      "delegation",
      "directory",
      "engineering",
      "environments",
      "helpdesk",
      "hitrust",
      "hybrid",
      "information",
      "informationtechnology",
      "infrastructure",
      "it",
      "leadership",
      "linux",
      "making",
      "management",
      "manager",
      "microsoft",
      "monitoring",
      "network",
      "organizational",
      "pci",
      "policies",
      "problem",
      "procedures",
      "project",
      "security",
      "skills",
      "soc2",
      "solving",
      "strategic",
      "systems",
      "team",
      "technology",
      "thinking",
      "tools",
      "unix",
      "windows"
    ]
  },
  {
    "job_id": "3901965564",
    "job_title": "Information Technology Support Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "IT SUPPORT SPECIALIST THAT WILL BE RESPONSIBLE FOR TROUBLESHOOTING TIER I/II ISSUES FOR WINDOWS AND MACS, WHILE ALSO ADMINISTERING ACTIVE DIRECTORY, O365 AND TROUBLESHOOTING SOFTWARE/HARDWARE ISSUES THAT ARISE.  \nWORKSITE ADDRESS: CULVER CITY, CAONSITE/REMOTE: 100% ONSITEPAY RATE: $30-32/HR.START DATE: ASAPHOURS: 8-5PM PSTDURATION: 1-3 MO. CTH\nMUST HAVES:WINDOWS/MAC (SOME EXPOSURE)AZURE (AD)O365/OUTLOOKVOIP\nNOTES FROM MANAGER: WORKING ALONGSIDE THE MANAGER, PROVIDING SUPPORT FOR 80 END USERS ON SITE AND REMOTE USERS AS WELLWINDOWS, SOME MAC (FAMILIARITY WITH IOS, ANDROID)ROLL OUTS/PROJECTS (WILL TRAIN)ABILITY TO PROVIDE SUPPORT FOR 100 END USERSEXPERIENCE WITH AZURE ACTIVE DIRECTORY/O365/OUTLOOKWILL BE ONBOARDING/SET-UP OF WORKSTATIONS AND APPLICATIONS FOR END USERSPROVIDE WHITE-GLOVE SUPPORTRING CENTRAL/VOIP TROUBLESHOOTING AND SUPPORTINGACCESS POINTS/SWITCHES – KNOWLEDGE BASE ON HOW TO REPORT ISSUES OR LIGHT TROUBLESHOOTINGSWITCHING/ROUTING, NETWORK BACKBONE KNOWLEDGEBREAK/FIX FROM TIME TO TIMEFUNDAMENTAL UNDERSTATING OF NETWORK SYSTEMSSALESFORCE A PLUSGOOGLE WORKSPACE A PLUS",
    "job_skill_set": [
      "Windows",
      "Mac",
      "VOIP",
      "Networking",
      "Troubleshooting",
      "Hardware Support",
      "Software Support",
      "Switching/Routing",
      "Communication",
      "Teamwork",
      "Problem Solving",
      "Customer Service",
      "Adaptability",
      "Azure Active Directory",
      "O365",
      "Outlook",
      "Salesforce",
      "Google Workspace",
      "Access Points"
    ],
    "short_keywords": [
      "access",
      "active",
      "adaptability",
      "azure",
      "communication",
      "customer",
      "directory",
      "google",
      "hardware",
      "information",
      "informationtechnology",
      "mac",
      "networking",
      "o365",
      "outlook",
      "points",
      "problem",
      "salesforce",
      "service",
      "software",
      "solving",
      "specialist",
      "support",
      "switchingrouting",
      "teamwork",
      "technology",
      "troubleshooting",
      "voip",
      "windows",
      "workspace"
    ]
  },
  {
    "job_id": "3905201407",
    "job_title": "Information Technology Support Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "IT SUPPORT SPECIALIST THIS ROLE IS ONSITE AND WILL BE REQUIRED TO TRAVEL TO VARIOUS CLIENT SITES AROUND MANHATTAN AS NEEDED. \nRESPONSIBILITIES:FOR HARDWARE & RELATED SOFTWARE SECURITY AND CONFIGURATION FUNCTIONS TO MEET BUSINESS NEEDS.PROVIDING CRITICAL SUPPORT FOR SUPPORTED MISSION CRITICAL BUSINESS APPLICATIONSISSUE RESOLUTION: PERFORM ANALYSIS AND PROVIDE PRIMARY ISSUE RESOLUTION FOR ASSIGNED RESOURCES AND PROJECTS.COORDINATE WITH SOFTWARE VENDORS WHEN RELEVANTANALYZE THE EFFECTIVENESS AND EFFICIENCY OF EXISTING SYSTEMS AND DEVELOP STRATEGIES FOR IMPROVING OR FURTHER LEVERAGING THESE SYSTEMS.PERFORM DATA CLEANSING ACTIVITIES IN THE APPLICABLE DATABASES.REPORTS, DASHBOARDS AND PROCESSES TO CONTINUOUSLY MONITOR DATA QUALITY AND INTEGRITY.SUPPORT FOR DESKTOP, DESK PHONES, CELL PHONES, LAPTOPS, IPADS AS NEEDED FOR NEW EMPLOYEES.\nEXPERIENCE:8-10 YEARS OF EXPERIENCE IN IT SUPPORTEXPERIENCE WITH MICROSOFT WINDOWS 10 AND 11 EXPERIENCE WITH VMWARE, TEAMS, ONEDRIVE, AZUREEXPERIENCE SCRIPTING IN POWERSHELL IS A PLUSEXPERIENCE WITH ACTIVE DIRECTORY CONFIGURATION, PRINTER SERVER MANAGEMENT, LAN AND WAN NETWORKS.EXPERIENCE WITH TROUBLESHOOTING PRINCIPLES, METHODOLOGIES AND ISSUE RESOLUTION TECHNIQUES.ABILITY TO TAKE INITIATIVE, SUCCESSFULLY HANDLE AND PRIORITIZE MULTIPLE COMPETING ASSIGNMENTS, AND EFFECTIVELY MANAGE DEADLINES.EXPERIENCE IN COMPUTER HARDWARE, OPERATING SYSTEMS, APPLICATIONS, AND NETWORKS.",
    "job_skill_set": [
      "Microsoft Windows 10",
      "VMware",
      "Printer Server Management",
      "LAN",
      "WAN",
      "Troubleshooting",
      "Computer Hardware",
      "Operating Systems",
      "Applications",
      "Networks",
      "Initiative",
      "Time Management",
      "Prioritization",
      "Problem Solving",
      "Communication",
      "Coordination",
      "Microsoft Windows 11",
      "Microsoft Teams",
      "OneDrive",
      "Azure",
      "PowerShell",
      "Active Directory",
      "Data Cleansing"
    ],
    "short_keywords": [
      "10",
      "11",
      "active",
      "applications",
      "azure",
      "cleansing",
      "communication",
      "computer",
      "coordination",
      "data",
      "directory",
      "hardware",
      "information",
      "informationtechnology",
      "initiative",
      "lan",
      "management",
      "microsoft",
      "networks",
      "onedrive",
      "operating",
      "powershell",
      "printer",
      "prioritization",
      "problem",
      "server",
      "solving",
      "specialist",
      "support",
      "systems",
      "teams",
      "technology",
      "time",
      "troubleshooting",
      "vmware",
      "wan",
      "windows"
    ]
  },
  {
    "job_id": "3884811465",
    "job_title": "Information Technology Support Technician",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "\n\nJOB TITLE: IT SUPPORT ANALYST\nLONG TERM CONTRACT\nMISSION HILLS CA - ONSITE \n\n\nTHIS IS A LONG TERM CONTRACT AND MAY EXTEND AS NEEDED\nABLE LIFT 50 LB OR MORE (PRINTERS OR OTHER EQUIPMENT AS NEEDED)\nDRIVE TO SUPPORT AND\\OR COVER TECH THAT MAY CALL OUT ON THE LAST MINS\nCAN TRANSPORT EQUIPMENT FROM ONE SITE TO NEXT SITE.\nWORK HOURS 8 AM AND END 5 PM WITH 1 HOUR LUNCH.\nAS NEEDED, WORK AFTER HOURS (CUT OVER IS 5PM AND START LATE LIKE 12PM TO WHEN PROJECT END) WILL GET FULL 8 HOURS.\nAS NEEDED, COME IN NEXT DAY BEFORE 6AM GO-LIVE SUPPORT.\nAS NEEDED, WORK ON THE SATURDAY OR SUNDAY AND TAKE 1 OR 2 DAYS OFF DURING THE WEEK TO MAKE 40 HOURS WEEK\n\n\n\n\n\n\nWITH REGARDS, \nSENTHIL \n\nSECUREKLOUD TECHNOLOGIES INC., \n\nDIRECT : 214-613-0887 \n\nEMAIL : SENTHILBABU.S@SECUREKLOUD.COM \n\nLINKEDIN : LINKEDIN.COM/IN/SENTHIL-BABU-R-57059754\n\nWEBSITE : WWW.SECUREKLOUD.COM",
    "job_skill_set": [
      "Technical Support",
      "Troubleshooting",
      "Onsite Support",
      "Time Management",
      "Communication",
      "Adaptability",
      "Teamwork",
      "Problem Solving",
      "Customer Service",
      "Equipment Handling",
      "Driving"
    ],
    "short_keywords": [
      "adaptability",
      "communication",
      "customer",
      "driving",
      "equipment",
      "handling",
      "information",
      "informationtechnology",
      "management",
      "onsite",
      "problem",
      "service",
      "solving",
      "support",
      "teamwork",
      "technical",
      "technician",
      "technology",
      "time",
      "troubleshooting"
    ]
  },
  {
    "job_id": "3901166220",
    "job_title": "Information Technology Manager @ Remote",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "HIHOPE THIS EMAIL FINDS YOU WELL !HCL IS HIRING FOR FULLTIME POSITION FOR IT MANAGER.PLEASE SHARE UPDATED RESUME AT MOHAMMAD.MUDASSIR@HCL.COM\nTITLE : IT MANAGERLOCATION : REMOTEFULLTIME/DIRECT HIRE\nAS COMMUNITY MANAGER, YOU ARE THE INTERFACE BETWEEN THE TECHNICAL ORGANISATION AND THE END USER COMMUNITY. THIS ROLE INCLUDES THE FOLLOWING RESPONSIBILITIES:\nRESPONSIBLE FOR THE CREATION AND STRATEGY OF PROGRAMS BETWEEN THE IT SERVICE TEAM AND THE END USER COMMUNITY, ENSURING THAT THE PRODUCTS ARE DELIVERED AND CONSUMED AS INTENDED.BUILD A TRUSTED BRAND PRESENCE, BOTH VIRTUALLY AND IN PERSON, BY MODERATING SESSIONS AND EVENTS, CREATING IMPACTFUL CONTENT, AND RESEARCHING AND ADOPTING TRENDS.HAVE EXCELLENT COMMUNICATION AND INTERPERSONAL SKILLSTECHNICAL UNDERSTANDING AROUND THE CAPABILITIES OF THE MICROSOFT 365 SUITE, AND THE ABILITY TO DEMONSTRATE IT AND INFLUENCE WITHIN GROUPS.ACT AS A LIAISON BETWEEN THE BUSINESS AND THE IT ORGANIZATION, RELAYING THE REQUIREMENTS AND FEEDBACK FROM BOTH SIDES.BUILD A CULTURE AROUND COLLABORATION AND CONTINUOUS LEARNING.PERFORM ADMINISTRATIVE TASKS TO MAINTAIN PROGRAMS/EVENTS THAT DRIVE ADOPTION AND IMPROVE USER EXPERIENCE.CREATION OF CONTENT TO HELP IMPROVE ADOPTION AND USER EXPERIENCEPRODUCT OWNER FOR AN APPLICATION THAT ASSISTS IN ADOPTION AND USER EXPERIENCE.IDENTIFY AND MONITOR THE ADOPTION OF MICROSOFT 365 SUITE AND PROGRAMS TO ASSIST IN ADOPTION.\n\n\n\n\n\n\n\n\nEDUCATION AND QUALIFICATIONS / SKILLS AND COMPETENCIES\nPROFESSIONAL EDUCATION OR STUDY IN PROJECT MANAGEMENT, INFORMATION TECHNOLOGY, COMMUNICATIONS/MARKETING OR EQUIVALENTHANDS-ON EXPERIENCE WITH STAKEHOLDER ENGAGEMENT.MANAGING CUSTOMER ISSUES & ESCALATIONS EXTENSIVE EXPERIENCE WITH CUSTOMER ENGAGEMENT METHODOLOGIES AND SERVICE LIFECYCLE EXCELLENT COORDINATION AND ORGANIZATIONAL SKILLSCHANGE MANAGEMENT EXPERIENCETEAM PLAYERADVANCED COMMUNICATION AND PRESENTATION SKILLSFLUENT IN ENGLISH MANDATORY. GERMAN BENEFICIAL. \n\n\nWORK EXPERIENCE3 – 5 YEARS WORKING EXPERIENCE WITH CUSTOMER ENGAGEMENT. ROLLING OUT PRODUCTS AND SERVICES. EXPERIENCE OF WORKING WITHIN A GLOBAL TEAM AND DIFFERENT TIME-ZONE/CULTURES WILL BE DESIRED.",
    "job_skill_set": [
      "Microsoft 365 Suite",
      "Project Management",
      "Administrative Tasks",
      "Communication",
      "Interpersonal Skills",
      "Teamwork",
      "Organizational Skills",
      "Stakeholder Engagement",
      "Presentation Skills",
      "Collaboration",
      "Continuous Learning",
      "Customer Engagement Methodologies",
      "Change Management",
      "Content Creation"
    ],
    "short_keywords": [
      "365",
      "administrative",
      "change",
      "collaboration",
      "communication",
      "content",
      "continuous",
      "creation",
      "customer",
      "engagement",
      "information",
      "informationtechnology",
      "interpersonal",
      "learning",
      "management",
      "manager",
      "methodologies",
      "microsoft",
      "organizational",
      "presentation",
      "project",
      "remote",
      "skills",
      "stakeholder",
      "suite",
      "tasks",
      "teamwork",
      "technology"
    ]
  },
  {
    "job_id": "3904583433",
    "job_title": "Information Technology Compliance Analyst",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "THE IT COMPLIANCE SPECIALIST WILL BE INSTRUMENTAL IN SUPPORTING OUR CLIENT'S EFFORTS TO ENSURE COMPLIANCE WITH FEDERAL IT SECURITY REGULATIONS AND STANDARDS. THE IDEAL CANDIDATE WILL HAVE A STRONG FOUNDATION IN NIST 800 SERIES SPECIAL PUBLICATIONS AND OTHER RELEVANT IT SECURITY FRAMEWORKS. THIS ROLE REQUIRES A PROACTIVE APPROACH TO DEVELOPING, UPDATING, AND MAINTAINING IT COMPLIANCE DOCUMENTATION AND CONDUCTING THOROUGH IT RISK ASSESSMENTS AND MITIGATION STRATEGIES.\nKEY RESPONSIBILITIES:DEVELOP AND MAINTAIN IT COMPLIANCE DOCUMENTATION.PERFORM COMPREHENSIVE IT COMPLIANCE AND RISK ASSESSMENTS, PROVIDING RECOMMENDATIONS FOR CORRECTIVE ACTIONS AND FOLLOW-UPS.ASSIST IN CONDUCTING SECURITY CONTROL SELF-ASSESSMENTS, PREPARING SYSTEM SECURITY PLAN DOCUMENTATION, AND ANALYZING SECURITY CONTROL DEFICIENCIES.ENGAGE IN CONTINUOUS MONITORING ACTIVITIES, INCLUDING RECURRING ACCESS REVIEWS AND SECURITY-RELATED DOCUMENTATION PREPARATION.SUPPORT AD HOC RISK ASSESSMENTS AND COMPLIANCE REVIEWS FOR SOFTWARE/HARDWARE AS NEEDED.OPTIONALLY, PARTICIPATE IN INDEPENDENT SECURITY CONTROLS TESTING, DEPENDING ON SKILLS AND QUALIFICATIONS.\nQUALIFICATIONS:BACHELOR’S DEGREE IN INFORMATION TECHNOLOGY, INFORMATION SECURITY, COMPUTER SCIENCE, OR A RELATED FIELD.3-5 YEARS OF RELEVANT EXPERIENCE IN IT SECURITY OR COMPLIANCE.STRONG WORKING KNOWLEDGE OF NIST 800 SERIES SPECIAL PUBLICATIONS AND FAMILIARITY WITH FISMA OR SIMILAR IT SECURITY PROGRAMS.EXPERIENCE WITH RISK ASSESSMENTS, SECURITY PLANNING, AND TESTING AND EVALUATION ACTIVITIES.CERTIFICATION IN A RELATED TECHNICAL DISCIPLINE IS DESIRABLE.\nSKILLS:EXCELLENT ANALYTICAL AND ORGANIZATIONAL SKILLS.ABILITY TO INTERPRET AND APPLY IT SECURITY POLICIES AND STANDARDS EFFECTIVELY.STRONG COMMUNICATION SKILLS, CAPABLE OF WORKING COLLABORATIVELY WITH IT SECURITY TEAMS AND BUSINESS UNITS.INNOVATIVE, RESOURCEFUL, AND RESULTS-DRIVEN.",
    "job_skill_set": [
      "NIST 800 Series",
      "Risk Assessments",
      "Security Planning",
      "IT Security Frameworks",
      "Analytical Skills",
      "Organizational Skills",
      "Communication Skills",
      "Collaboration",
      "Innovative Thinking",
      "Resourcefulness",
      "Results-Driven",
      "IT Compliance Documentation",
      "Security Control Self-Assessments",
      "FISMA",
      "Certification in IT Security"
    ],
    "short_keywords": [
      "800",
      "analyst",
      "analytical",
      "assessments",
      "certification",
      "collaboration",
      "communication",
      "compliance",
      "control",
      "documentation",
      "fisma",
      "frameworks",
      "in",
      "information",
      "informationtechnology",
      "innovative",
      "it",
      "nist",
      "organizational",
      "planning",
      "resourcefulness",
      "resultsdriven",
      "risk",
      "security",
      "selfassessments",
      "series",
      "skills",
      "technology",
      "thinking"
    ]
  },
  {
    "job_id": "3889755354",
    "job_title": "Information Technology Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "\nINFORMATION TECHNOLOGY MANAGER\nFULL-TIMEJOB TYPE: SALARIED\nJOB DESCRIPTIONBE THE DRIVING FORCE BEHIND OUR DIGITAL LANDSCAPE, ENSURING SEAMLESS OPERATIONS AND INNOVATIVE SOLUTIONS TO PROPEL OUR ORGANIZATION FORWARD. WITH YOUR LEADERSHIP AND TECHNICAL EXPERTISE, YOU'LL ORCHESTRATE A SYMPHONY OF TECHNOLOGY, HARNESSING ITS POWER TO ENHANCE EFFICIENCY, SECURITY, AND SUCCESS ACROSS OUR ENTIRE PROPERTY.OVERSEE THE DESIGN, IMPLEMENTATION, AND MAINTENANCE OF THE PROPERTY'S IT INFRASTRUCTURE, INCLUDING NETWORKS, SERVERS, HARDWARE, AND SOFTWARE SYSTEMS.MANAGE AND MENTOR THE IT TEAM, INCLUDING HIRING, TRAINING, AND PERFORMANCE MANAGEMENT, TO ENSURE THE EFFECTIVE OPERATION OF IT SYSTEMS AND SUPPORT SERVICES.DEVELOP AND IMPLEMENT IT SECURITY POLICIES AND PROCEDURES TO PROTECT THE ORGANIZATION'S DATA AND SYSTEMS FROM SECURITY THREATS, ENSURING COMPLIANCE WITH REGULATORY REQUIREMENTS AND INDUSTRY STANDARDS.LEAD IT PROJECTS, FROM PLANNING AND BUDGETING TO EXECUTION AND EVALUATION, ENSURING PROJECTS ARE COMPLETED ON TIME, WITHIN BUDGET, AND MEET BUSINESS OBJECTIVES.PROVIDE TECHNICAL SUPPORT TO END-USERS, TROUBLESHOOTING ISSUES, AND RESOLVING PROBLEMS TO MINIMIZE DOWNTIME AND ENSURE PRODUCTIVITY, AS WELL AS CONDUCTING TRAINING SESSIONS TO EDUCATE USERS ON IT SYSTEMS AND BEST PRACTICES.QUALIFICATIONSSEVERAL YEARS OF EXPERIENCE IN IT ROLES, WITH PROGRESSIVELY INCREASING RESPONSIBILITIES, DEMONSTRATING EXPERTISE IN MANAGING IT INFRASTRUCTURE, SYSTEMS, AND PROJECTS.STRONG LEADERSHIP, COMMUNICATION, AND INTERPERSONAL SKILLS, WITH THE ABILITY TO EFFECTIVELY MANAGE IT TEAMS, COLLABORATE WITH OTHER DEPARTMENTS AND COMMUNICATE COMPLEX TECHNICAL CONCEPTS TO NON-TECHNICAL STAKEHOLDERS.BACHELOR'S DEGREE IN INFORMATION TECHNOLOGY, COMPUTER SCIENCE, OR A RELATED DISCIPLINE, PROVIDING FOUNDATIONAL KNOWLEDGE IN IT PRINCIPLES, SYSTEMS, AND TECHNOLOGIES PREFERRED.ADDITIONAL INFORMATIONWHILE EACH PROPERTY IS UNIQUE, ALL SHARE A CRAFTED APPROACH TO LUXURY AND BRING THE SOUL OF THE LOCALE TO LIFE THROUGH CAPTIVATING DESIGN, EXCEPTIONAL CUISINE AND SPAS, AND GRACIOUS YET UNOBTRUSIVE SERVICE. WITH HOTELS AND RESORTS ACROSS THREE CONTINENTS, WE INVITE GUESTS TO CREATE UNFORGETTABLE STORIES IN SOME OF THE WORLD’S MOST DESIRABLE DESTINATIONS. PLEASE VISIT OUR WEBSITE TO LEARN MORE ABOUT OUR COLLECTION. FOLLOW US ON INSTAGRAM, TIKTOK, LINKEDIN, FACEBOOK AND PINTEREST\n\n",
    "job_skill_set": [
      "IT infrastructure management",
      "network management",
      "server management",
      "software systems implementation",
      "IT security policies",
      "project management",
      "technical support",
      "troubleshooting",
      "data protection",
      "regulatory compliance",
      "leadership",
      "communication",
      "interpersonal skills",
      "team management",
      "collaboration",
      "problem solving",
      "training and mentoring",
      "time management",
      "budgeting",
      "user education"
    ],
    "short_keywords": [
      "and",
      "budgeting",
      "collaboration",
      "communication",
      "compliance",
      "data",
      "education",
      "implementation",
      "information",
      "informationtechnology",
      "infrastructure",
      "interpersonal",
      "it",
      "leadership",
      "management",
      "manager",
      "mentoring",
      "network",
      "policies",
      "problem",
      "project",
      "protection",
      "regulatory",
      "security",
      "server",
      "skills",
      "software",
      "solving",
      "support",
      "systems",
      "team",
      "technical",
      "technology",
      "time",
      "training",
      "troubleshooting",
      "user"
    ]
  },
  {
    "job_id": "3895201206",
    "job_title": "Information Technology Support Engineer",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "HI \n\nHOPE YOU ARE DOING WELL |WE HAVE AN URGENT BELOW POSITION .IF YOU ARE INTERESTED PLEASE SHARE YOUR UPDATED RESUME WITH THE RATE EXPECTATION.\nJOB TITLE : IT SUPPORT ENGINEER L2LOCATION: SANTA CLARA, CA(ONSITE)IMPLEMENTATION: HCL\nDURATION: 6+MONTHS CONTRACTVISA- US CITIZEN, GREEN CARD, H1BJOB DESCRIPTION\n HANDLE TIERED TICKETS AND ESCALATIONS, PROVIDING ON-SITE AND REMOTE ASSISTANCE FOR WINDOWS, MAC, LINUX, IOS, AND ANDROID PLATFORMS AS NEEDE IT INVENTORY: RESPONSIBLE FOR PROCURING, MANAGING, AND TRACKING IT ASSETS, INCLUDING INVENTORY AND CONSUMABLES, WHILE CONTRIBUTING TO DEMAND PLANNING STRATEGIES.COMPLIANCE AND VENDOR ENGAGEMENT: COLLABORATE WITH ENGINEERING FOR AUDIT COMPLIANCE, ENSURING ADHERENCE TO STANDARDS IN HARDWARE MANAGEMENT, AND OVERSEE VENDOR ENGAGEMENTS, MEETING KPIS AND SERVICE LEVEL AGREEMENT.CONTINUOUS IMPROVEMENT INITIATIVES: IDENTIFY RECURRING ISSUES, DOCUMENT PROCESSES FOR GLOBAL ADOPTION, MANAGE IT DEPLOYMENT FOR OFFICE BUILD-OUTS, AND EXPLORE NEW TECHNOLOGIES/METHODOLOGIES TO ENHANCE OPERATIONS.USER-CENTRIC SOLUTIONS: ANTICIPATE LOCAL USER NEEDS, CREATE SYSTEMS TO STREAMLINE REQUESTS, AND DEVELOP TOOLS TO REDUCE TICKET SUBMISSIONS WHEREVER POSSIBLE.\nBACHELOR'S DEGREE OR EQUIVALENT EXPERIENCE IN INFORMATION SYSTEMS OR RELATED FIELDPROVEN HISTORY OF ADMINISTRATION AND SUPPORT OF ENTERPRISE WINDOWS ENVIRONMENTS, ANALYZING, TROUBLESHOOTING, AND RESOLVING ISSUES THEN CREATING MITIGATION STRATEGIES.STRONG JUDGMENT, PROBLEM-SOLVING, AND DECISION-MAKING ABILITIESEXCEPTIONAL COMMUNICATION SKILLS AND THE ABILITY TO GROW RELATIONSHIPS AND RAPPORT.THE ABILITY TO TRANSLATE BETWEEN TECHNICAL DETAILS AND THE REAL-WORLD IMPACT THEY HAVE.\nNICE TO HAVE :\nPHENOMENAL PERSONAL AND INTERPERSONAL SKILLSHIGHLY MOTIVATED, ORGANIZED, SELF-STARTER WITH EXPERIENCE IN A LARGE ENTERPRISE ENVIRONMENT.PROVEN WINDOWS 10/11, OFFICE 365, ANDROID, IOS, MAC, AND LINUX EXPERIENCEPOWERSHELL OR OTHER SCRIPTING AND AUTOMATION SKILLSEXPERIENCE MANAGING MEDIUM TO LARGE SCALE IT PROJECTS.\nTHANKS AND REGARDS\n ANAND MOHAN RAAS INFOTEK CORPORATION. 262 CHAPMAN ROAD, SUITE 105A, NEWARK, DE-19702 DIRECT NO: 302-565-0209: EXT:148 EMAIL:ANAND.MOHAN@RAASINFOTEK.COM",
    "job_skill_set": [
      "Windows",
      "Problem-solving",
      "Office 365",
      "Troubleshooting",
      "Documentation",
      "Communication",
      "Interpersonal skills",
      "Self-starter",
      "Organizational skills",
      "Relationship building",
      "Mac",
      "Linux",
      "iOS",
      "Android",
      "IT asset management",
      "Compliance",
      "Vendor engagement",
      "Powershell",
      "IT project management",
      "Scripting",
      "Judgment",
      "Decision-making",
      "User-centric approach",
      "Motivation"
    ],
    "short_keywords": [
      "365",
      "android",
      "approach",
      "asset",
      "building",
      "communication",
      "compliance",
      "decisionmaking",
      "documentation",
      "engagement",
      "engineer",
      "information",
      "informationtechnology",
      "interpersonal",
      "ios",
      "it",
      "judgment",
      "linux",
      "mac",
      "management",
      "motivation",
      "office",
      "organizational",
      "powershell",
      "problemsolving",
      "project",
      "relationship",
      "scripting",
      "selfstarter",
      "skills",
      "support",
      "technology",
      "troubleshooting",
      "usercentric",
      "vendor",
      "windows"
    ]
  },
  {
    "job_id": "3901350702",
    "job_title": "Information Technology Business Consultant",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "IT BUSINESS CONSULTANT/BUSINESS ANALYST\n6-12 MONTH C2HHYBRID (3 DAYS ONSITE/2 REMOTE) - GOODLETTSVILLE, TN\nOVERVIEW:PRIMARILY SUPPORT THE OPPORTUNITY IDENTIFICATION PROCESS FOR ALL NEW IT REQUESTS VIA THE IT BUSINESS INTEGRATION & STRATEGY TEAM. THIS IS DONE BY DOCUMENTING NEW AND EXISTING BUSINESS PROCESSES AND OPPORTUNITY SPECIFIC BUSINESS NEEDS BY PARTNERING ACROSS ALL BUSINESS UNITS AND LEVELS OF THE ORGANIZATION. THEY ARE ADDITIONALLY RESPONSIBLE FOR MARKET RESEARCH, DESIGN-THINKING WORKSHOP FACILITATION, AND HELPING TRANSLATE BUSINESS NEEDS AND IDEAS INTO ACTIONABLE ITEMS FOR DELIVERY TEAMS.\n\nJOB DUTIES:PARTNER WITH EXECUTIVE LEVEL CLIENTS, HELPING STAKEHOLDERS ENVISION THEIR PRODUCTS, WHO THEY'RE FOR, AND THE IMPACT THEY'LL HAVE – CAPTURING THE BUSINESS DEMANDS AND NEED.CRAFT DETAILED DOCUMENTATION INCLUSIVE OF HIGH LEVEL BUSINESS NEEDS, RESEARCH STUDIES, AND KEY INSIGHTSCREATION OF DETAILED PROCESS FLOWS SHOWCASING THE INNER WORKINGS OF CRITICAL BUSINESS PROCESSES ACROSS THE ORGANIZATIONPLAN AND FACILITATE CLIENT AND TEAM WORKSHOPS IN VARYING SIZES ON BROAD RANGING RETAIL SPECIFIC TOPICSENGAGE IN PRODUCT/MARKET RESEARCH AND CRAFTING RESEARCH DELIVERABLES WITH UNIQUE KEY INSIGHTS AND LEARNINGS FOR STAKEHOLDERS TO USE\n\nREQUIREMENTS:3+ YEARS OF EXPERIENCE IN BUSINESS ANALYSIS, MARKET RESEARCH, AND PROCESS FLOW DOCUMENTATION STRONG COMMUNICATION AND PRESENTATION SKILLSEXPERIENCE IN STRATEGIC PLANNING IN PRODUCT DEVELOPMENT, USER INSIGHTS, AND PRODUCT STRATEGY JIRA AND CONFLUENCE BACHELOR’S DEGREE PREVIOUS EXPERIENCE IN RETAIL INDUSTRY",
    "job_skill_set": [
      "business analysis",
      "market research",
      "strategic planning",
      "documentation",
      "communication",
      "presentation",
      "collaboration",
      "facilitation",
      "problem solving",
      "stakeholder engagement",
      "process flow documentation",
      "JIRA",
      "Confluence",
      "design thinking"
    ],
    "short_keywords": [
      "analysis",
      "business",
      "collaboration",
      "communication",
      "confluence",
      "consultant",
      "design",
      "documentation",
      "engagement",
      "facilitation",
      "flow",
      "information",
      "informationtechnology",
      "jira",
      "market",
      "planning",
      "presentation",
      "problem",
      "process",
      "research",
      "solving",
      "stakeholder",
      "strategic",
      "technology",
      "thinking"
    ]
  },
  {
    "job_id": "3901656812",
    "job_title": "Financial Systems Administrator, Information Technology",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "DESCRIPTION\nWHO WE ARE IREX IS A GLOBAL DEVELOPMENT AND EDUCATION ORGANIZATION. WE STRIVE FOR A MORE JUST, PROSPEROUS, AND INCLUSIVE WORLD—WHERE INDIVIDUALS REACH THEIR FULL POTENTIAL, GOVERNMENTS SERVE THEIR PEOPLE, AND COMMUNITIES THRIVE. WITH A PROJECTED ANNUAL PORTFOLIO OF MORE THAN $150 MILLION AND MORE THAN 750 STAFF WORLDWIDE, WE WORK WITH PARTNERS IN MORE THAN 100 COUNTRIES IN FOUR AREAS ESSENTIAL TO PROGRESS: CULTIVATING LEADERS, EMPOWERING YOUTH, STRENGTHENING INSTITUTIONS, AND INCREASING ACCESS TO QUALITY EDUCATION AND INFORMATION. REPORTING TO THE CHIEF TECHNOLOGY OFFICER (CTO), THE FINANCIAL SYSTEMS ADMINISTRATOR IS RESPONSIBLE FOR THE MANAGEMENT, SUPPORT, AND SEAMLESS INTEGRATION OF IREX’S FINANCIAL APPLICATIONS. THEIR EXPERTISE WILL BE INSTRUMENTAL IN ENSURING THESE SYSTEMS OPERATE EFFICIENTLY, MEET OUR BUSINESS NEEDS, AND ALIGN WITH IREX’S TECHNOLOGICAL STRATEGIES. THE FINANCIAL SYSTEMS ADMINISTRATOR WILL PLAY A CRUCIAL ROLE IN ENHANCING OUR FINANCIAL TECHNOLOGY INFRASTRUCTURE, IMPROVING SYSTEM INTEGRATIONS, AND PROVIDING EXCEPTIONAL SUPPORT TO OUR USERS. THIS POSITION REQUIRES A BLEND OF TECHNICAL PROWESS, FINANCIAL ACUMEN, AND STRONG LEADERSHIP SKILLS TO DRIVE INNOVATION AND OPERATIONAL EXCELLENCE IN OUR FINANCIAL SYSTEMS MANAGEMENT. WE ARE DOERS. OUR DECADES OF ON-THE-GROUND EXPERIENCE HELP US CREATE GREATER IMPACT, PRACTICAL RECOMMENDATIONS, AND LASTING PARTNERSHIPS. ARE YOU THE NEXT MEMBER OF OUR TEAM? YOUR BACKGROUND & SKILLS BACHELOR’S DEGREE IN FINANCE, ACCOUNTING, COMPUTER SCIENCE, INFORMATION SYSTEMS, OR A RELATED FIELD. AT LEAST 10 YEARS OF EXPERIENCE IN A TECHNICAL ROLE WITHIN FINANCIAL OPERATIONS, WITH A STRONG EMPHASIS ON SYSTEM IMPLEMENTATION, DATA ANALYSIS, AND PROCESS OPTIMIZATION. ADVANCED PROFICIENCY IN FINANCIAL MANAGEMENT AND ACCOUNTING SOFTWARE SUCH AS DELTEK COSTPOINT, SAP CONCUR, AND QUICKBOOKS. EXPERIENCE WITH DATABASE MANAGEMENT AND REPORTING TOOLS IS HIGHLY PREFERRED. FAMILIARITY WITH U.S. GOVERNMENT FINANCIAL REGULATIONS (E.G., USAID, DOS) AND THEIR APPLICATION IN SOFTWARE AND TECHNICAL PROCESSES WITHIN INTERNATIONAL PROJECTS. POSSESSES STRONG ANALYTICAL SKILLS, ADEPT AT LEVERAGING FINANCIAL SOFTWARE AND DATA ANALYSIS TOOLS TO ENHANCE EFFICIENCY, ACCURACY, AND COMPLIANCE IN FINANCIAL OPERATIONS. DEMONSTRATES A PROVEN ABILITY TO LEAD AND MANAGE TECHNICAL PROJECTS WITHIN THE FINANCIAL DOMAIN, ENSURING TIMELY AND BUDGET-COMPLIANT DELIVERY. EXCELS IN CROSS-FUNCTIONAL TEAMWORK, PROVIDING TECHNICAL SOLUTIONS TO FINANCIAL CHALLENGES, AND EFFECTIVELY COMMUNICATING COMPLEX INFORMATION TO NON-TECHNICAL STAKEHOLDERS. PROFICIENT IN IDENTIFYING AND IMPLEMENTING EMERGING TECHNOLOGIES AND DIGITAL PLATFORMS TO OPTIMIZE FINANCIAL PROCESSES AND FOSTER COLLABORATION. EXHIBITS EXCEPTIONAL INTERPERSONAL SKILLS, WITH A KEEN SENSITIVITY TO CULTURAL DIFFERENCES, FOSTERING EFFECTIVE COLLABORATION IN A GLOBAL SETTING. TAKES A PROACTIVE APPROACH, ANTICIPATING POTENTIAL CHALLENGES AND OPPORTUNITIES, AND TAKING INITIATIVE TO ADDRESS THEM PROACTIVELY TO DRIVE POSITIVE CHANGE. EMBRACES A CONTINUOUS LEARNING MINDSET, WITH A COMMITMENT TO ONGOING PERSONAL AND PROFESSIONAL GROWTH, STAYING ABREAST OF INDUSTRY TRENDS AND ACTIVELY SEEKING OPPORTUNITIES FOR DEVELOPMENT. YOU MUST HAVE UNRESTRICTED AUTHORIZATION TO WORK IN THE UNITED STATES. YOUR DAILY TASKS OVERSEE THE INTEGRATION OF THE FINANCIAL SYSTEM WITH OTHER BUSINESS APPLICATIONS (SUCH AS ERP, HR SYSTEMS, ETC.) TO ENSURE SEAMLESS DATA FLOW AND OPERATIONAL EFFICIENCY ACROSS PLATFORMS. ENSURE ACCURATE AND TIMELY SYNCHRONIZATION OF DATA BETWEEN THE FINANCIAL SYSTEM AND OTHER BUSINESS APPLICATIONS. THIS INCLUDES MANAGING DATA TRANSFERS AND MAINTAINING DATA CONSISTENCY ACROSS SYSTEMS. ENSURE THE ACCURACY AND INTEGRITY OF FINANCIAL DATA WITHIN THE SYSTEMS. THIS INCLUDES DATA ENTRY, UPDATING RECORDS, AND PERFORMING REGULAR AUDITS TO IDENTIFY AND CORRECT DISCREPANCIES. COLLABORATE WITH IREX IT AND THIRD-PARTY VENDORS TO IMPLEMENT SYSTEM UPGRADES AND ENHANCEMENTS, ENSURING THE FINANCIAL SYSTEM STAYS UP TO DATE WITH THE LATEST TECHNOLOGY AND BUSINESS REQUIREMENTS. MONITOR THE FINANCIAL SYSTEM TO ENSURE IT COMPLIES WITH RELEVANT LAWS, REGULATIONS, AND INTERNAL POLICIES. IMPLEMENT AND MAINTAIN SECURITY MEASURES TO PROTECT SENSITIVE FINANCIAL DATA. CONTINUOUSLY IDENTIFY AND IMPLEMENT IMPROVEMENTS IN FINANCIAL PROCESSES AND SYSTEM WORKFLOWS TO ENHANCE EFFICIENCY AND ACCURACY. ASSIST IN THE PLANNING AND COORDINATION OF FINANCIAL SYSTEM PROJECTS, WORKING UNDER THE GUIDANCE OF A PROJECT MANAGER OR SENIOR TEAM MEMBER. WORK WITH THE VENDORS AND PARTNERS ON TIMELY INVOICING/SYSTEM UPDATES ASSIST IN THE PREPARATION AND MANAGEMENT OF BUDGETS, UTILIZING THE FINANCIAL SYSTEM FOR ACCURATE TRACKING AND REPORTING. KEEP CLOSE TRACK OF FINANCIAL SYSTEMS BUDGET AND PAYMENT STATUS CLOSELY WORK WITH OCFO TEAM ON SYSTEM IMPROVEMENTS AND ENHANCEMENTS. SUPPORT FP&A STAFF WITH AD-HOC/SPECIFIC FINANCIAL SYSTEMS’ NEEDS/ASKS. OTHER SUPPORT DUTIES AS NEEDED. IREX WILL MAKE REASONABLE ACCOMMODATIONS IN COMPLIANCE WITH THE AMERICANS WITH DISABILITIES ACT OF 1990, AND THE AMERICANS WITH DISABILITIES ACT AMENDMENTS OF 2008. WE CONDUCT BACKGROUND CHECKS ON ALL SUCCESSFUL CANDIDATES. THIS POSITION IS ELIGIBLE FOR TELEWORK. THE ELIGIBLE EMPLOYEE IS A REGULAR, FULL-TIME DC-BASED STAFF WHO WORKS FROM A WORKSITE OUTSIDE THE DC OFFICE FOR ONE OR MORE DAYS A WEEK. THIS POSITION IS NOT ELIGIBLE FOR IMMIGRATION SPONSORSHIP.  NO PHONE CALLS PLEASE EOE – EQUAL OPPORTUNITY EMPLOYER WE ARE AN EQUAL OPPORTUNITY EMPLOYER, INCLUDING DISABILITY/VETS.",
    "job_skill_set": [
      "data analysis",
      "system implementation",
      "reporting tools",
      "project management",
      "security measures",
      "leadership",
      "communication",
      "teamwork",
      "analytical skills",
      "interpersonal skills",
      "proactive approach",
      "continuous learning",
      "financial management software",
      "database management",
      "financial regulations",
      "ERP systems",
      "budget management",
      "data synchronization",
      "financial systems integration",
      "Deltek Costpoint",
      "SAP Concur",
      "QuickBooks",
      "cultural sensitivity"
    ],
    "short_keywords": [
      "administrator",
      "analysis",
      "analytical",
      "approach",
      "budget",
      "communication",
      "concur",
      "continuous",
      "costpoint",
      "cultural",
      "data",
      "database",
      "deltek",
      "erp",
      "financial",
      "implementation",
      "information",
      "informationtechnology",
      "integration",
      "interpersonal",
      "leadership",
      "learning",
      "management",
      "measures",
      "proactive",
      "project",
      "quickbooks",
      "regulations",
      "reporting",
      "sap",
      "security",
      "sensitivity",
      "skills",
      "software",
      "synchronization",
      "system",
      "systems",
      "teamwork",
      "technology",
      "tools"
    ]
  },
  {
    "job_id": "3889487969",
    "job_title": "Information Technology Project Coordinator",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOB ID 2405173\n\nLOCATION ALEXANDRIA, VA, US\n\nDATE POSTED 2024-04-08\n\nCATEGORY INFORMATION TECHNOLOGY\n\nSUBCATEGORY BUS PROC ANALYST\n\nSCHEDULE FULL-TIME\n\nSHIFT DAY JOB\n\nTRAVEL NO\n\nMINIMUM CLEARANCE REQUIRED SECRET\n\nCLEARANCE LEVEL MUST BE ABLE TO OBTAIN NONE\n\nPOTENTIAL FOR REMOTE WORK NO\n\nDESCRIPTION\n\nSAIC IS SEEKING AN IT PROJECT COORDINATOR LOCATED ON-SITE AT THE MARK CENTER IN ALEXANDRIA, VA.\n\nRESPONSIBILITIES INCLUDE\n\n DIRECTLY SUPPORTS THE MANPOWER MANAGEMENT OFFICE (MMO) WITHIN THE ORGANIZATIONAL AND MANAGEMENT POLICY DIRECTORATE (O&MPD) UNDER THE OFFICE OF THE DIRECTOR OF ADMINISTRATION AND MANAGEMENT (ODA&M). SERVES AS THE TECHNICAL EXPERT FOR THE SUSTAINMENT AND DEVELOPMENT OF SYSTEM INFRASTRUCTURE AND SCHEDULING OF PRODUCTS AND SERVICES RELATED TO THE TRANSITION, SUSTAINMENT, AND ENHANCEMENT OF THE AUTHORITATIVE DATA SYSTEM FOR THE ODA&M MMO. PROVIDES SUBJECT MATTER EXPERTISE IN THE FULFILLMENT OF IT SYSTEM STRATEGIC PLANNING, DESIGN, TRANSITION, OPERATIONS, AND CONTINUAL IMPROVEMENT OF IT SERVICES. PREPARES NECESSARY IT AUTHORIZATION DOCUMENTS, PLANS, AND CERTIFICATIONS FOR THE OPERATIONS, MAINTENANCE, AND DEVELOPMENT OF IT SYSTEMS SUPPORTING THE MMO MISSION, TO INCLUDE PREPARING OFFICIAL DOCUMENTATION AND REQUESTS FOR APPROVAL (I.E., AUTHORIZATION TO PROCEED (ATP), SYSTEM OF RECORD NOTICE (SORN), AUTHORIZATION TO OPERATE (ATO)). COORDINATES WITH NETWORKS HOST, AUTHORIZATION OFFICIALS, AND IT STAKEHOLDERS, REGARDING THE MANAGEMENT AND UPKEEP OF THE ATOS AND RISK MANAGEMENT FRAMEWORKS, AND OTHER VITAL ARTIFACTS. ORGANIZES AND MONITORS MULTIPLE INTERCONNECTED PROJECTS. LIAISE WITH PRIMARY AND PERIPHERAL SERVICE PROVIDERS, VENDORS, MISSION PARTNERS, AND RELEVANT STAKEHOLDERS TO RESOLVE ISSUES IN A TIMELY MANNER.CREATES AND MANAGES ASSOCIATED KEY PERFORMANCE INDICATORS (KPIS), METRICS, AND REPORTS FOR IT SYSTEMS SUPPORTING THE MMO MISSION; RECOMMENDS OPPORTUNITIES FOR IMPROVEMENT OR EFFICIENCY. DEVELOPS AND MAINTAINS THE SYSTEM LIFECYCLE PLAN BASED ON DEPARTMENT AND MMO PRIORITIES. COORDINATES EFFORTS WITH USER COMMUNITY STAKEHOLDERS TO REFINE SYSTEM REQUIREMENTS, MATURE TECHNICAL SPECIFICATION, AND PRIORITIZE CUSTOMER-RECOMMENDED FEATURES. MONITORS AND MANAGES SYSTEM INTERCONNECTIONS WITH OTHER DOD PLATFORMS. SUPPORTS SYSTEM CHANGE CONTROL BOARD (CCB) DECISIONS AND SUBSEQUENT IMPLEMENTATION. EXPERIENCE WITH BEST PRACTICES FOR IT SERVICE MANAGEMENT (ITSM), DOD ENTERPRISE SERVICE MANAGEMENT FRAMEWORK (DESMF), INFORMATION TECHNOLOGY INFRASTRUCTURE LIBRARY (ITIL), AND ISO 20000 INTERNATIONAL STANDARDS.\n\nQUALIFICATIONS\n\nEDUCATION, EXPERIENCE AND REQUIREMENTS\n\n BACHELOR'S DEGREE IN A RELEVANT FIELD OF STUDY PLUS AT LEAST 5 YEARS’ EXPERIENCE PROVIDING SERVICES TO SENIOR GENERAL/FLAG OFFICER RANKS AND/OR SES LEVELS WITHIN THE DOD. 5 YEARS OF IT EXPERIENCE ON LARGE-SCALE FEDERAL PROGRAMS WITH HANDS-ON EXPERIENCE WITH PROJECT MANAGEMENT OFFICE PROCESSES AND PROCEDURES. HIGHLY PROFICIENT WITH THE MICROSOFT OFFICE SUITE OF APPLICATIONS, ESPECIALLY WORD, EXCEL, POWERPOINT, SHAREPOINT, AND TEAMS. PROFESSIONALISM, TACT, AND EXPERIENCE WORKING WITH SENIOR DOD LEADERSHIP. ABILITY TO PRODUCE QUALITY WORK INDEPENDENTLY OR IN A GROUP SETTING, PROVIDE SOLUTIONS TO CUSTOMER ISSUES, AND SOLVE PROBLEMS QUICKLY. ABILITY TO PROVIDE ON-SITE SUPPORT IN THE MARK CENTER, MONDAY THROUGH FRIDAY.\n\nSAIC ACCEPTS APPLICATIONS ON AN ONGOING BASIS AND THERE IS NO DEADLINE.\n\nCOVID POLICY SAIC DOES NOT REQUIRE COVID-19 VACCINATIONS OR BOOSTERS. CUSTOMER SITE VACCINATION REQUIREMENTS MUST BE FOLLOWED WHEN WORK IS PERFORMED AT A CUSTOMER SITE.",
    "job_skill_set": [
      "IT project management",
      "IT service management (ITSM)",
      "Microsoft Office Suite",
      "key performance indicators (KPIs)",
      "project coordination",
      "communication",
      "problem solving",
      "teamwork",
      "professionalism",
      "tact",
      "independence",
      "customer service",
      "stakeholder management",
      "DOD Enterprise Service Management Framework (DESMF)",
      "Information Technology Infrastructure Library (ITIL)",
      "ISO 20000 standards",
      "system lifecycle planning",
      "risk management frameworks",
      "data system management"
    ],
    "short_keywords": [
      "20000",
      "communication",
      "coordination",
      "coordinator",
      "customer",
      "data",
      "desmf",
      "dod",
      "enterprise",
      "framework",
      "frameworks",
      "independence",
      "indicators",
      "information",
      "informationtechnology",
      "infrastructure",
      "iso",
      "it",
      "itil",
      "itsm",
      "key",
      "kpis",
      "library",
      "lifecycle",
      "management",
      "microsoft",
      "office",
      "performance",
      "planning",
      "problem",
      "professionalism",
      "project",
      "risk",
      "service",
      "solving",
      "stakeholder",
      "standards",
      "suite",
      "system",
      "tact",
      "teamwork",
      "technology"
    ]
  },
  {
    "job_id": "3895275234",
    "job_title": "Senior Information Technology System Administrator",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOB DESCRIPTION\n\nAT BOEING, WE INNOVATE AND COLLABORATE TO MAKE THE WORLD A BETTER PLACE. FROM THE SEABED TO OUTER SPACE, YOU CAN CONTRIBUTE TO WORK THAT MATTERS WITH A COMPANY WHERE DIVERSITY, EQUITY AND INCLUSION ARE SHARED VALUES. WE’RE COMMITTED TO FOSTERING AN ENVIRONMENT FOR EVERY TEAMMATE THAT’S WELCOMING, RESPECTFUL AND INCLUSIVE, WITH GREAT OPPORTUNITY FOR PROFESSIONAL GROWTH. FIND YOUR FUTURE WITH US.\n\nTHE BOEING COMPANY’S SITE OPERATIONS ORGANIZATION IS CURRENTLY SEEKING A SENIOR INFORMATION TECHNOLOGY SYSTEM ADMINISTRATOR TO JOIN THE TEAM IN EL SEGUNDO, CA.\n\nTHIS POSITION WILL DESIGN, INSTALL, OPERATE, SECURE, AND MAINTAIN DEDICATED PROGRAM INFORMATION TECHNOLOGY INFRASTRUCTURE THAT IS REQUIRED TO DELIVER PRODUCTS TO OUR CUSTOMERS.\n\nPOSITION RESPONSIBILITIES:\n\n\nLEAD INFORMATION TECHNOLOGY PROJECTS THAT PROVIDE DEDICATED PROGRAM INFRASTRUCTUREWORK DIRECTLY WITH PROGRAMS TO ENSURE INFORMATION TECHNOLOGY INFRASTRUCTURE SOLUTIONS MEET THE PROGRAM REQUIREMENTS AND SCHEDULESPERFORM A MULTI-DISCIPLINED RANGE OF TECHNICAL SYSTEMS AND APPLICATION ACTIVITIESDESIGN, INSTALL, CONFIGURE, TROUBLESHOOT AND PROVIDE MAINTENANCE OF SYSTEMS HARDWARE, SOFTWARE AND COMPONENTSENSURE INFORMATION TECHNOLOGY INFRASTRUCTURE CONFORMS WITH STANDARD ARCHITECTURAL OBJECTIVESPROVIDE TECHNICAL SOLUTIONS TO A WIDE RANGE OF DIFFICULT PROBLEMSDEVELOP SOLUTIONS THAT ARE IMAGINATIVE, THOROUGH, PRACTICABLE, AND CONSISTENT WITH ORGANIZATION OBJECTIVESDETERMINE AND DEVELOP APPROACHES TO SOLUTIONSRECEIVE GENERAL DIRECTION FOR WORK THAT IS REVIEWED UPON COMPLETION FOR ADEQUACY IN MEETING OBJECTIVESCONTRIBUTE TO THE COMPLETION OF SPECIFIC PROGRAMS AND PROJECTSINTERACT FREQUENTLY WITH INTER-ORGANIZATIONAL PERSONNEL AND EXTERNAL CUSTOMERSREPRESENT THE ORGANIZATION BY PROVIDING SOLUTIONS TO DIFFICULT TECHNICAL ISSUES ASSOCIATED WITH SPECIFIC PROJECTS\n\n\nTHIS POSITION IS EXPECTED TO BE 100% ONSITE. THE SELECTED CANDIDATE WILL BE REQUIRED TO WORK ONSITE AT ONE OF THE LISTED LOCATION OPTIONS.\n\nTHIS POSITION REQUIRES AN ACTIVE U.S. TOP SECRET/SCI SECURITY CLEARANCE (U.S. CITIZENSHIP REQUIRED). (A U.S. SECURITY CLEARANCE THAT HAS BEEN ACTIVE IN THE PAST 24 MONTHS IS CONSIDERED ACTIVE.)\n\nTHIS POSITION REQUIRES A CURRENT TIER 5 (T5), FORMERLY KNOWN AS A SINGLE SCOPE BACKGROUND INVESTIGATION (SSBI) (U.S. CITIZENSHIP REQUIRED) OR REQUIRES CANDIDATE AGREED TO ENTER A CONTINUOUS EVALUATION PROGRAM.\n\nBASIC QUALIFICATIONS (REQUIRED SKILLS/EXPERIENCE):\n\n\nACTIVE COMPTIA SECURITY+ CERTIFIED (OR SIMILAR CERTIFICATION MEETING DOD DIRECTIVE 8570.01 CERTIFICATION REQUIREMENTS)5+ YEARS OF EXPERIENCE WITH WINDOWS SERVER AND DESKTOP OPERATING SYSTEMS (SERVER 2016-2022, WINDOWS 10)5+ YEARS OF EXPERIENCE WITH OPERATING SYSTEM (WINDOWS AND/OR LINUX) INSTALLATION, SETUP, AND BASIC TROUBLESHOOTING5+ YEARS OF EXPERIENCE IN TROUBLESHOOTING SERVERS, DATA STORAGE DEVICES, ORACLE DATABASES, AND LABORATORY NETWORK5+ YEARS OF EXPERIENCE IN CONFIGURING NETWORK STORAGE SYSTEMSABILITY TO OBTAIN COUNTER INTELLIGENCE POLYGRAPH\n\n\nPREFERRED QUALIFICATIONS (DESIRED SKILLS/EXPERIENCE):\n\n\nACTIVE COUNTER INTELLIGENCE POLYGRAPH3+ YEARS OF EXPERIENCE WITH A BROAD RANGE OF BASIC SYSTEMS AND APPLICATION SUPPORT3+ YEARS OF EXPERIENCE WITH MAINTAINING/CONFIGURING AD TO INCLUDE APPLYING DOMAIN GROUP POLICIES3+ YEARS OF EXPERIENCE WITH POWERSHELL AND LINUX SCRIPTS TO ENABLE CONSISTENT, HIGH-QUALITY INTEGRATION OF HARDWARE ASSETS3+ YEARS OF EXPERIENCE WITH SCRIPTS TO AUTOMATE DEPLOYMENT AND CONFIGURATION OF OPERATING SYSTEMS3+ YEARS OF EXPERIENCE CREATING AND MAINTAINING MULTIPLE VIRTUAL SERVERS BASED ON VMWARE3+ YEARS OF EXPERIENCE EVALUATING AND EFFECTIVELY COMMUNICATING COMPLEX SYSTEM PROBLEMS AND RESOLUTION\n\n\nTYPICAL EDUCATION & EXPERIENCE:\n\nEDUCATION/EXPERIENCE TYPICALLY ACQUIRED THROUGH ADVANCED TECHNICAL EDUCATION (E.G. BACHELOR) AND TYPICALLY 9 OR MORE YEARS' RELATED WORK EXPERIENCE OR AN EQUIVALENT COMBINATION OF TECHNICAL EDUCATION AND EXPERIENCE (E.G. PHD+4 YEARS' RELATED WORK EXPERIENCE, MASTER+7 YEARS' RELATED WORK EXPERIENCE, 13 YEARS' RELATED WORK EXPERIENCE, ETC.)\n\nRELOCATION:\n\nTHIS POSITION OFFERS RELOCATION BASED ON CANDIDATE ELIGIBILITY.\n\nDRUG FREE WORKPLACE:\n\nBOEING IS A DRUG FREE WORKPLACE WHERE POST OFFER APPLICANTS AND EMPLOYEES ARE SUBJECT TO TESTING FOR MARIJUANA, COCAINE, OPIOIDS, AMPHETAMINES, PCP, AND ALCOHOL WHEN CRITERIA IS MET AS OUTLINED IN OUR POLICIES.\n\nWORK SHIFT:\n\nTHIS POSITION WILL BE FOR FIRST SHIFT.\n\nAT BOEING, WE STRIVE TO DELIVER A TOTAL REWARDS PACKAGE THAT WILL ATTRACT, ENGAGE AND RETAIN THE TOP TALENT. ELEMENTS OF THE TOTAL REWARDS PACKAGE INCLUDE COMPETITIVE BASE PAY AND VARIABLE COMPENSATION OPPORTUNITIES.\n\nTHE BOEING COMPANY ALSO PROVIDES ELIGIBLE EMPLOYEES WITH AN OPPORTUNITY TO ENROLL IN A VARIETY OF BENEFIT PROGRAMS, GENERALLY INCLUDING HEALTH INSURANCE, FLEXIBLE SPENDING ACCOUNTS, HEALTH SAVINGS ACCOUNTS, RETIREMENT SAVINGS PLANS, LIFE AND DISABILITY INSURANCE PROGRAMS, AND A NUMBER OF PROGRAMS THAT PROVIDE FOR BOTH PAID AND UNPAID TIME AWAY FROM WORK.\n\nTHE SPECIFIC PROGRAMS AND OPTIONS AVAILABLE TO ANY GIVEN EMPLOYEE MAY VARY DEPENDING ON ELIGIBILITY FACTORS SUCH AS GEOGRAPHIC LOCATION, DATE OF HIRE, AND THE APPLICABILITY OF COLLECTIVE BARGAINING AGREEMENTS.\n\nPAY IS BASED UPON CANDIDATE EXPERIENCE AND QUALIFICATIONS, AS WELL AS MARKET AND BUSINESS CONSIDERATIONS.\n\nSUMMARY PAY RANGE: $116,450 – $157,550\n\nAPPLICATIONS FOR THIS POSITION WILL BE ACCEPTED THROUGH APRIL 24TH, 2024.\n\nEXPORT CONTROL REQUIREMENTS: U.S. GOVERNMENT EXPORT CONTROL STATUS: THIS POSITION MUST MEET EXPORT CONTROL COMPLIANCE REQUIREMENTS. TO MEET EXPORT CONTROL COMPLIANCE REQUIREMENTS, A “U.S. PERSON” AS DEFINED BY 22 C.F.R.\n\n\n120.15 IS REQUIRED. “U.S. PERSON” INCLUDES U.S. CITIZEN, LAWFUL PERMANENT RESIDENT, REFUGEE, OR ASYLEE.\n\n\nEXPORT CONTROL DETAILS: US BASED JOB, US PERSON REQUIRED\n\nEQUAL OPPORTUNITY EMPLOYER:\n\nBOEING IS AN EQUAL OPPORTUNITY EMPLOYER. EMPLOYMENT DECISIONS ARE MADE WITHOUT REGARD TO RACE, COLOR, RELIGION, NATIONAL ORIGIN, GENDER, SEXUAL ORIENTATION, GENDER IDENTITY, AGE, PHYSICAL OR MENTAL DISABILITY, GENETIC FACTORS, MILITARY/VETERAN STATUS OR OTHER CHARACTERISTICS PROTECTED BY LAW.",
    "job_skill_set": [
      "CompTIA Security+",
      "Windows Server",
      "Windows 10",
      "Linux",
      "Oracle Databases",
      "Network Storage Systems",
      "PowerShell",
      "VMware",
      "Scripting",
      "System Troubleshooting",
      "Active Directory",
      "Problem Solving",
      "Communication",
      "Teamwork",
      "Leadership",
      "Project Management",
      "Adaptability",
      "Creativity",
      "Technical Solutions Development"
    ],
    "short_keywords": [
      "10",
      "active",
      "adaptability",
      "administrator",
      "communication",
      "comptia",
      "creativity",
      "databases",
      "development",
      "directory",
      "information",
      "informationtechnology",
      "leadership",
      "linux",
      "management",
      "network",
      "oracle",
      "powershell",
      "problem",
      "project",
      "scripting",
      "security",
      "senior",
      "server",
      "solutions",
      "solving",
      "storage",
      "system",
      "systems",
      "teamwork",
      "technical",
      "technology",
      "troubleshooting",
      "vmware",
      "windows"
    ]
  },
  {
    "job_id": "3884429179",
    "job_title": "Information Technology Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "THE IDEAL CANDIDATE WILL HAVE 3+ YEARS EXPERIENCE WITH UPGRADING OR ADMINISTRATION OF ERP ADMINISTRATION AS WELL AS HELP DESK NEEDS FOR A MANUFACTURING OR DISTRIBUTION COMPANY. EXPERIENCE WITH MOVING ON PREM SERVERS TO MS AZURE IS REQUIRED.  RESPONSIBILITIESMANAGE TECHNOLOGIES AND PROVIDE ADMINISTRATIVE ASSISTANCE FOR VARIOUS SYSTEMSUNDERSTAND VARIOUS IT TROUBLESHOOTING AND PROVIDE TECHNICAL SUPPORTCONTROL AND MONITOR DATA, NETWORK ACCESS AND BACKUP SYSTEMSNEGOTIATE AND COMMUNICATE WITH THIRD-PARTY SOFTWARE PROVIDERS FOR NEW SOFTWARE'S AND TROUBLESHOOTING\nQUALIFICATIONSBACHELOR'S DEGREE IN COMPUTER SCIENCE OR RELEVANT FIELD5+ YEARS OF EXPERIENCE IN RELATED FIELDEXPERIENCE IN INFORMATION TECHNOLOGY SPACE AND SOLVING VARIOUS SOFTWARE AND HARDWARE PROBLEMSSTRONG TECHNICAL PROBLEM SOLVING AND COMMUNICATION SKILLSABILITY TO WORK ONSITE MON-FRI FROM 8AM-5PM\n",
    "job_skill_set": [
      "ERP Administration",
      "Technical Support",
      "Data Management",
      "Network Access Control",
      "Backup Systems Management",
      "Troubleshooting",
      "Software Negotiation",
      "Communication",
      "Problem Solving",
      "Teamwork",
      "MS Azure"
    ],
    "short_keywords": [
      "access",
      "administration",
      "azure",
      "backup",
      "communication",
      "control",
      "data",
      "erp",
      "information",
      "informationtechnology",
      "management",
      "manager",
      "ms",
      "negotiation",
      "network",
      "problem",
      "software",
      "solving",
      "support",
      "systems",
      "teamwork",
      "technical",
      "technology",
      "troubleshooting"
    ]
  },
  {
    "job_id": "3895274480",
    "job_title": "Mid-Level Information Technology System Administrator",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOB DESCRIPTION\n\nAT BOEING, WE INNOVATE AND COLLABORATE TO MAKE THE WORLD A BETTER PLACE. FROM THE SEABED TO OUTER SPACE, YOU CAN CONTRIBUTE TO WORK THAT MATTERS WITH A COMPANY WHERE DIVERSITY, EQUITY AND INCLUSION ARE SHARED VALUES. WE’RE COMMITTED TO FOSTERING AN ENVIRONMENT FOR EVERY TEAMMATE THAT’S WELCOMING, RESPECTFUL AND INCLUSIVE, WITH GREAT OPPORTUNITY FOR PROFESSIONAL GROWTH. FIND YOUR FUTURE WITH US.\n\nTHE BOEING COMPANY’S SITE OPERATIONS ORGANIZATION IS CURRENTLY SEEKING A MID-LEVEL INFORMATION TECHNOLOGY SYSTEM ADMINISTRATOR TO JOIN THE TEAM IN EL SEGUNDO, CA.\n\nTHIS POSITION WILL DESIGN, INSTALL, OPERATE, SECURE, AND MAINTAIN DEDICATED PROGRAM INFORMATION TECHNOLOGY INFRASTRUCTURE THAT IS REQUIRED TO DELIVER PRODUCTS TO OUR CUSTOMERS.\n\nPOSITION RESPONSIBILITIES:\n\n\nLEAD INFORMATION TECHNOLOGY PROJECTS THAT PROVIDE DEDICATED PROGRAM INFRASTRUCTUREWORK DIRECTLY WITH PROGRAMS TO ENSURE INFORMATION TECHNOLOGY INFRASTRUCTURE SOLUTIONS MEET THE PROGRAM REQUIREMENTS AND SCHEDULESPERFORM A MULTI-DISCIPLINED RANGE OF TECHNICAL SYSTEMS AND APPLICATION ACTIVITIESDESIGN, INSTALL, CONFIGURE, TROUBLESHOOT AND PROVIDE MAINTENANCE OF SYSTEMS HARDWARE, SOFTWARE AND COMPONENTSENSURE INFORMATION TECHNOLOGY INFRASTRUCTURE CONFORMS WITH STANDARD ARCHITECTURAL OBJECTIVESPROVIDE TECHNICAL SOLUTIONS TO A WIDE RANGE OF DIFFICULT PROBLEMSDEVELOP SOLUTIONS THAT ARE IMAGINATIVE, THOROUGH, PRACTICABLE, AND CONSISTENT WITH ORGANIZATION OBJECTIVESDETERMINE AND DEVELOP APPROACHES TO SOLUTIONSRECEIVE GENERAL DIRECTION FOR WORK THAT IS REVIEWED UPON COMPLETION FOR ADEQUACY IN MEETING OBJECTIVESCONTRIBUTE TO THE COMPLETION OF SPECIFIC PROGRAMS AND PROJECTSINTERACT FREQUENTLY WITH INTER-ORGANIZATIONAL PERSONNEL AND EXTERNAL CUSTOMERSREPRESENT THE ORGANIZATION BY PROVIDING SOLUTIONS TO DIFFICULT TECHNICAL ISSUES ASSOCIATED WITH SPECIFIC PROJECTS\n\n\nTHIS POSITION IS EXPECTED TO BE 100% ONSITE. THE SELECTED CANDIDATE WILL BE REQUIRED TO WORK ONSITE AT ONE OF THE LISTED LOCATION OPTIONS.\n\nTHIS POSITION REQUIRES AN ACTIVE U.S. TOP SECRET/SCI SECURITY CLEARANCE (U.S. CITIZENSHIP REQUIRED). (A U.S. SECURITY CLEARANCE THAT HAS BEEN ACTIVE IN THE PAST 24 MONTHS IS CONSIDERED ACTIVE.)\n\nTHIS POSITION REQUIRES A CURRENT TIER 5 (T5), FORMERLY KNOWN AS A SINGLE SCOPE BACKGROUND INVESTIGATION (SSBI) (U.S. CITIZENSHIP REQUIRED) OR REQUIRES CANDIDATE AGREED TO ENTER A CONTINUOUS EVALUATION PROGRAM.\n\nBASIC QUALIFICATIONS (REQUIRED SKILLS/EXPERIENCE):\n\n\nACTIVE COMPTIA SECURITY+ CERTIFIED (OR SIMILAR CERTIFICATION MEETING DOD DIRECTIVE 8570.01 CERTIFICATION REQUIREMENTS)3+ YEARS OF EXPERIENCE WITH WINDOWS SERVER AND DESKTOP OPERATING SYSTEMS (SERVER 2016-2022, WINDOWS 10)3+ YEARS OF EXPERIENCE WITH OPERATING SYSTEM (WINDOWS AND/OR LINUX) INSTALLATION, SETUP, AND BASIC TROUBLESHOOTING3+ YEARS OF EXPERIENCE IN TROUBLESHOOTING SERVERS, DATA STORAGE DEVICES, ORACLE DATABASES, AND LABORATORY NETWORK3+ YEARS OF EXPERIENCE IN CONFIGURING NETWORK STORAGE SYSTEMSABILITY TO OBTAIN COUNTER INTELLIGENCE POLYGRAPH\n\n\nPREFERRED QUALIFICATIONS (DESIRED SKILLS/EXPERIENCE):\n\n\nACTIVE COUNTER INTELLIGENCE POLYGRAPH3+ YEARS OF EXPERIENCE WITH A BROAD RANGE OF BASIC SYSTEMS AND APPLICATION SUPPORT3+ YEARS OF EXPERIENCE WITH MAINTAINING/CONFIGURING AD TO INCLUDE APPLYING DOMAIN GROUP POLICIES3+ YEARS OF EXPERIENCE WITH POWERSHELL AND LINUX SCRIPTS TO ENABLE CONSISTENT, HIGH-QUALITY INTEGRATION OF HARDWARE ASSETS3+ YEARS OF EXPERIENCE WITH SCRIPTS TO AUTOMATE DEPLOYMENT AND CONFIGURATION OF OPERATING SYSTEMS3+ YEARS OF EXPERIENCE CREATING AND MAINTAINING MULTIPLE VIRTUAL SERVERS BASED ON VMWARE3+ YEARS OF EXPERIENCE EVALUATING AND EFFECTIVELY COMMUNICATING COMPLEX SYSTEM PROBLEMS AND RESOLUTION\n\n\nTYPICAL EDUCATION & EXPERIENCE: \n\nEDUCATION/EXPERIENCE TYPICALLY ACQUIRED THROUGH ADVANCED TECHNICAL EDUCATION (E.G. BACHELOR) AND TYPICALLY 5 OR MORE YEARS' RELATED WORK EXPERIENCE OR AN EQUIVALENT COMBINATION OF TECHNICAL EDUCATION AND EXPERIENCE (E.G. PHD, MASTER+3 YEARS' RELATED WORK EXPERIENCE, 9 YEARS' RELATED WORK EXPERIENCE, ETC.).\n\nRELOCATION:\n\nTHIS POSITION OFFERS RELOCATION BASED ON CANDIDATE ELIGIBILITY.\n\nDRUG FREE WORKPLACE:\n\nBOEING IS A DRUG FREE WORKPLACE WHERE POST OFFER APPLICANTS AND EMPLOYEES ARE SUBJECT TO TESTING FOR MARIJUANA, COCAINE, OPIOIDS, AMPHETAMINES, PCP, AND ALCOHOL WHEN CRITERIA IS MET AS OUTLINED IN OUR POLICIES.\n\nWORK SHIFT:\n\nTHIS POSITION WILL BE FOR FIRST SHIFT.\n\nAT BOEING, WE STRIVE TO DELIVER A TOTAL REWARDS PACKAGE THAT WILL ATTRACT, ENGAGE AND RETAIN THE TOP TALENT. ELEMENTS OF THE TOTAL REWARDS PACKAGE INCLUDE COMPETITIVE BASE PAY AND VARIABLE COMPENSATION OPPORTUNITIES.\n\nTHE BOEING COMPANY ALSO PROVIDES ELIGIBLE EMPLOYEES WITH AN OPPORTUNITY TO ENROLL IN A VARIETY OF BENEFIT PROGRAMS, GENERALLY INCLUDING HEALTH INSURANCE, FLEXIBLE SPENDING ACCOUNTS, HEALTH SAVINGS ACCOUNTS, RETIREMENT SAVINGS PLANS, LIFE AND DISABILITY INSURANCE PROGRAMS, AND A NUMBER OF PROGRAMS THAT PROVIDE FOR BOTH PAID AND UNPAID TIME AWAY FROM WORK.\n\nTHE SPECIFIC PROGRAMS AND OPTIONS AVAILABLE TO ANY GIVEN EMPLOYEE MAY VARY DEPENDING ON ELIGIBILITY FACTORS SUCH AS GEOGRAPHIC LOCATION, DATE OF HIRE, AND THE APPLICABILITY OF COLLECTIVE BARGAINING AGREEMENTS.\n\nPAY IS BASED UPON CANDIDATE EXPERIENCE AND QUALIFICATIONS, AS WELL AS MARKET AND BUSINESS CONSIDERATIONS.\n\nSUMMARY PAY RANGE: $116,450 – $157,550\n\nAPPLICATIONS FOR THIS POSITION WILL BE ACCEPTED THROUGH APRIL 24TH, 2024.\n\nEXPORT CONTROL REQUIREMENTS: U.S. GOVERNMENT EXPORT CONTROL STATUS: THIS POSITION MUST MEET EXPORT CONTROL COMPLIANCE REQUIREMENTS. TO MEET EXPORT CONTROL COMPLIANCE REQUIREMENTS, A “U.S. PERSON” AS DEFINED BY 22 C.F.R.\n\n\n120.15 IS REQUIRED. “U.S. PERSON” INCLUDES U.S. CITIZEN, LAWFUL PERMANENT RESIDENT, REFUGEE, OR ASYLEE.\n\n\nEXPORT CONTROL DETAILS: US BASED JOB, US PERSON REQUIRED\n\nEQUAL OPPORTUNITY EMPLOYER:\n\nBOEING IS AN EQUAL OPPORTUNITY EMPLOYER. EMPLOYMENT DECISIONS ARE MADE WITHOUT REGARD TO RACE, COLOR, RELIGION, NATIONAL ORIGIN, GENDER, SEXUAL ORIENTATION, GENDER IDENTITY, AGE, PHYSICAL OR MENTAL DISABILITY, GENETIC FACTORS, MILITARY/VETERAN STATUS OR OTHER CHARACTERISTICS PROTECTED BY LAW.",
    "job_skill_set": [
      "CompTIA Security+",
      "Windows Server",
      "Linux",
      "Oracle Databases",
      "Network Storage Systems",
      "VMware",
      "Troubleshooting",
      "System Installation",
      "System Configuration",
      "System Maintenance",
      "Problem Solving",
      "Communication",
      "Teamwork",
      "Project Management",
      "Adaptability",
      "Attention to Detail",
      "Customer Interaction",
      "Windows 10",
      "PowerShell",
      "Scripting",
      "Active Directory",
      "Creativity"
    ],
    "short_keywords": [
      "10",
      "active",
      "adaptability",
      "administrator",
      "attention",
      "communication",
      "comptia",
      "configuration",
      "creativity",
      "customer",
      "databases",
      "detail",
      "directory",
      "information",
      "informationtechnology",
      "installation",
      "interaction",
      "linux",
      "maintenance",
      "management",
      "midlevel",
      "network",
      "oracle",
      "powershell",
      "problem",
      "project",
      "scripting",
      "security",
      "server",
      "solving",
      "storage",
      "system",
      "systems",
      "teamwork",
      "technology",
      "to",
      "troubleshooting",
      "vmware",
      "windows"
    ]
  },
  {
    "job_id": "3901937694",
    "job_title": "Information Technology Project Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "THE IT PROJECT MANAGER ROLE IS ESSENTIAL FOR ENSURING THE SUCCESSFUL EXECUTION OF CRITICAL IT PROJECTS AND ONGOING PROJECT INITIATIVES AMIDST COMPETING PRIORITIES. YOU WILL PLAY A CENTRAL ROLE IN COORDINATING THESE EFFORTS, ENSURING ALIGNMENT WITH AGENCY STRATEGIES, MANAGING PROJECT DOCUMENTATION, AND FOSTERING COLLABORATION AMONG STAKEHOLDERS. ADDITIONALLY, YOU WILL LEAD BUSINESS ANALYSIS EFFORTS, DEVELOP VITAL DOCUMENTATION SUCH AS RFPS AND SOWS, AND CONTRIBUTE TO STRATEGIC PLANNING INITIATIVES. \nRESPONSIBILITIES: THE IT PROJECT MANAGER WILL OVERSEE THE DIRECTION, COORDINATION, AND SUCCESSFUL COMPLETION OF IT PROJECTS IN ALIGNMENT WITH AGENCY STRATEGIES AND GOALS. THIS ROLE INVOLVES COORDINATING COMPLEX ASSIGNMENTS, MANAGING PROJECT DOCUMENTATION, AND ENSURING ADHERENCE TO DEPARTMENTAL POLICIES AND INDUSTRY STANDARDS. RESPONSIBILITIES INCLUDE FACILITATING COMMUNICATION AND COLLABORATION AMONG STAKEHOLDERS, MANAGING PROJECT BUDGETS, AND PROVIDING STRATEGIC GUIDANCE TO THE PROJECT TEAM. THE CANDIDATE WILL LEAD BUSINESS ANALYSIS EFFORTS, DEVELOP RFPS AND SOWS, AND CONTRIBUTE TO AGENCY-WIDE STRATEGIC PLANNING INITIATIVES. STRONG COMMUNICATION, LEADERSHIP, AND PROJECT MANAGEMENT SKILLS ARE ESSENTIAL FOR SUCCESS IN THIS ROLE.\nREQUIRED SKILLS AND QUALIFICATIONS:3+ YEARS OF IT EXPERIENCE, WITH SENSITIVITY AND COMMITMENT TO BUSINESS PROBLEM SOLVING2+ YEARS OF DEMONSTRATED COMPETENCY IN A PROJECT MANAGEMENT ROLE INVOLVING THE EXECUTION OF MULTIPLE PROJECTS OR A LARGE PROJECT2+ YEARS OF EXPERIENCE UTILIZING PROJECT MANAGEMENT METHODOLOGIES, TOOLS, AND TECHNIQUES.2+ YEARS OF EXPERIENCE GATHERING AND DOCUMENTING BUSINESS REQUIREMENTS, ANALYZING AND MAPPING BUSINESS PROCESSES, COORDINATING ASSIGNMENTS AS A PROJECT MANAGER REQUIRING THE COLLABORATION OF MULTIPLE INDIVIDUALS AND/OR CROSS-FUNCTIONAL GROUPS, WHILE ESTABLISHING AND MAINTAINING A HIGH LEVEL OF CUSTOMER TRUST AND CONFIDENCE. ABILITY TO MANAGE MULTIPLE PROJECTS SIMULTANEOUSLY AND ADAPT TO CHANGING PRIORITIES.EXPERIENCE IN AND KNOWLEDGE OF CURRENT AND EMERGING TECHNOLOGIES, AND OF HOW OTHER ENTERPRISES ARE USING THEM TO DRIVE DIGITAL BUSINESS. EXPERIENCE WORKING IN SENSITIVE POLITICAL ENVIRONMENTS AND INTERACTIVE WITH SENIOR LEADERSHIP. PREFERRED:EXPERIENCE WORKING IN STATE ENTITIES.EXPERIENCE IN LEADING A TEAM.FAMILIARITY WITH PROJECT MANAGEMENT METHODOLOGIES SUCH AS AGILE AND SCRUM. EDUCATION:BACHELOR’S DEGREE IN COMPUTER SCIENCE, INFORMATION TECHNOLOGY, PROJECT MANAGEMENT, BUSINESS ADMINISTRATION, OR RELATED FIELD.ADDITIONAL EXPERIENCE IN THE AREAS LISTED MAY BE SUBSTITUTED FOR THE REQUIRED EDUCATION AS DETERMINED RELEVANT BY THE AGENCY.",
    "job_skill_set": [
      "project management",
      "business analysis",
      "documentation",
      "budget management",
      "IT experience",
      "business requirements gathering",
      "emerging technologies",
      "communication",
      "leadership",
      "collaboration",
      "problem solving",
      "adaptability",
      "customer trust",
      "Agile",
      "Scrum",
      "process mapping"
    ],
    "short_keywords": [
      "adaptability",
      "agile",
      "analysis",
      "budget",
      "business",
      "collaboration",
      "communication",
      "customer",
      "documentation",
      "emerging",
      "experience",
      "gathering",
      "information",
      "informationtechnology",
      "it",
      "leadership",
      "management",
      "manager",
      "mapping",
      "problem",
      "process",
      "project",
      "requirements",
      "scrum",
      "solving",
      "technologies",
      "technology",
      "trust"
    ]
  },
  {
    "job_id": "3891077803",
    "job_title": "Information Technology Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "SR. MANAGER (TECHNOLOGY BUSINESS MANAGEMENT)COPPELL, TX\nOPTOMI, IN PARTNERSHIP WITH A LEADING LOGISTICS COMPANY SERVING THE BANKING AND FINANCE INDUSTRY, IS SEEKING A SR. MANAGER (TECHNOLOGY BUSINESS MANAGEMENT) IN A HYBRID POSITION IN COPPELL, TX. CANDIDATES MUST HAVE BACKGROUNDS IN BOTH IT AND FINANCE. THIS CANDIDATE WILL HAVE EXPERIENCE WITH IT INFRASTRUCTURE PREFERABLY. CANDIDATES MUST HAVE A BACKGROUND/UNDERSTANDING IN TECHNOLOGY BUSINESS MANAGEMENT (TBM).\nEXPERIENCE OF THE RIGHT CANDIDATE:BACHELOR'S DEGREE IN FINANCE, BUSINESS ADMINISTRATION, MANAGEMENT INFORMATION SYSTEMS, OR RELATED FIELD; BUT PREFERABLY AN MBA OR GRADUATE DEGREE IN BUSINESS RELATED FIELDMINIMUM OF 7 YEARS OF RELEVANT EXPERIENCESTRONG QUANTITATIVE AND ANALYTICAL SKILLS FOR FINANCIAL MODELING AND ANALYSISREQUIRES BROAD EXPERIENCE IN THE FINANCIAL SERVICES INDUSTRY.STRONG TO EXPERT LEVEL SKILLS AND EXPERIENCE IN FORMULAIC LOGIC SUCH AS MS EXCEL IF STATEMENTS, VLOOKUP, PIVOT TABLES, MACROS, ETC.KNOWLEDGE AND APPLICATION OF RELATIONAL DATABASE CONCEPTSGOOD WITH DATA ANALYTICS AND DATA MINING. EXCELLENT COMMUNICATION AND PRESENTATION SKILLS TO EXECUTIVE MANAGEMENT AUDIENCESMANAGEMENT EXPERIENCEEXECUTIVE INTERACTIONSINFRASTRUCTURE BACKGROUNDMUST HAVE FINANCIAL EXPERIENCE - FAMILIARITY WITH BUDGETARY PLANNING AND COST REPORTINGMUST HAVE PROVEN LEADERSHIP EXPERIENCE - KNOWLEDGE OF APPROACHES, TOOLS, AND TECHNIQUES FOR GAINING THE COOPERATION AND SUPPORT OF OTHERS.MUST HAVE STRONG INTERPERSONAL RELATIONSHIPS SKILLS - KNOWLEDGE OF APPROACHES, TOOLS AND TECHNIQUES FOR WORKING WITH INDIVIDUALS AND GROUPS IN A CONSTRUCTIVE AND COLLABORATIVE MANNERITILCERTIFIED IS A PLUS\nRESPONSIBILITIES OF THE RIGHT CANDIDATE:OPERATIONALIZE AND IMPROVE THE TECHNOLOGY BUSINESS MANAGEMENT (TBM) SOLUTION.TRANSLATE EXECUTIVE VISION INTO TECHNICAL REQUIREMENTS AND SUBSEQUENT DELIVERABLES.GATHER FUNCTIONAL AND BUSINESS REQUIREMENTS AND RAPIDLY TRANSLATE THAT INFORMATION INTO A WORKING SET OF OPERATIONAL AND FINANCIAL MODELS, DASHBOARDS, AND MANAGEMENT REPORTS.COLLABORATE WITH IT EXECUTIVES AND FINANCE ON IT TOTAL COST OF OWNERSHIP, FINANCIAL METRICS, AND COST TRANSPARENCY INITIATIVES.IMPORT, TRANSFORM, AND RATIONALIZE DATA FROM SYSTEMS OF RECORD SUCH AS GENERAL LEDGER, FIXED ASSETS, CLARITY, SERVICE NOW, HP ALM, VMWARE, BDNA, ETC.OPERATIONALIZE DATA MONTHLY BY LOADING, VALIDATING, AND REVIEWING ON A TIMELY BASIS.PROVIDING MANAGEMENT BENCHMARKING, REPORTING AND ANALYTICS SERVICES FOR THE LEADERSHIP TEAMPROVIDE KEY FINDINGS FOR TRANSFORMATIONAL OPPORTUNITIES.COLLABORATE WITH STRATEGIC SOURCING AND IT LEADERS TO PROVIDE GUIDANCE ON CONSOLIDATION AND STANDARDIZATION OPPORTUNITIES.",
    "job_skill_set": [
      "IT Infrastructure",
      "Technology Business Management (TBM)",
      "Relational Database Concepts",
      "Budgetary Planning",
      "Communication",
      "Leadership",
      "Interpersonal Skills",
      "Collaboration",
      "Analytical Thinking",
      "Problem Solving",
      "Financial Modeling",
      "Data Analytics",
      "Data Mining",
      "MS Excel",
      "Cost Reporting",
      "ITIL Certification",
      "Presentation Skills"
    ],
    "short_keywords": [
      "analytical",
      "analytics",
      "budgetary",
      "business",
      "certification",
      "collaboration",
      "communication",
      "concepts",
      "cost",
      "data",
      "database",
      "excel",
      "financial",
      "information",
      "informationtechnology",
      "infrastructure",
      "interpersonal",
      "it",
      "itil",
      "leadership",
      "management",
      "manager",
      "mining",
      "modeling",
      "ms",
      "planning",
      "presentation",
      "problem",
      "relational",
      "reporting",
      "skills",
      "solving",
      "tbm",
      "technology",
      "thinking"
    ]
  },
  {
    "job_id": "3904502170",
    "job_title": "Information Technology Support Technician",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOB TYPE: DIRECT HIRE (PERMANENT) LOCATION: EGG HARBOR TOWNSHIP, NJ (ONSITE)COMPENSATION: $55,000 - $75,000 | BASED ON EXPERIENCE*\n\n\nRESPONSIBILITIESPROVIDE TIER 2 AND 3 TECHNICAL SUPPORT TO USERS, RESOLVING COMPLEX ISSUES AND ENSURING A HIGH LEVEL OF CUSTOMER SATISFACTION; ENSURING TIMELY AND EFFECTIVE TECHNICAL SUPPORT.MANAGE AND PRIORITIZE INCOMING SUPPORT REQUESTS, ADDRESSING ESCALATIONS AND ENSURING SWIFT ISSUE RESOLUTION.COLLABORATE WITH IT LEADERSHIP TO IMPROVE HELP DESK PROCESSES AND IMPLEMENT BEST PRACTICES.\n\nQUALIFICATIONSPROVEN HANDS-ON EXPERIENCE IN A HELP DESK OR IT SUPPORT ROLE, 3+ YEARS.MUST HAVE DESKSIDE/IN-PERSON SUPPORT EXPERIENCE, REMOTE-ONLY EXPERIENCE NOT ACCEPTED.FAMILIARITY WITH VARIOUS HELP DESK SOFTWARE AND TICKETING SYSTEMS.STRONG PROBLEM-SOLVING AND TROUBLESHOOTING CAPABILITIES.EXCELLENT COMMUNICATION AND INTERPERSONAL SKILLS.TECHNICAL PROFICIENCY IN RELEVANT TECHNOLOGIES, INCLUDING MICROSOFT OFFICE 365, ACTIVE DIRECTORY, WINDOWS & MAC OPERATING SYSTEMS, AND GENERAL NETWORKING UNDERSTANDING.\n\nNICE TO HAVE COMPETENCIESCERTIFICATION IN IT-RELATED FIELDS (E.G., COMPTIA A+, HDI SUPPORT CENTER MANAGER, OR OTHERS) IS ADVANTAGEOUS.KNOWLEDGE OF ITIL BEST PRACTICES IS A PLUS.\n\nDESCRIPTIONTHIS INDIVIDUAL WILL PLAY A KEY ROLE IN SUPPORTING THE DAILY OPERATIONS OF THE HELP DESK TEAM, ENSURING THE DELIVERY OF EXCEPTIONAL TECHNICAL CARE TO END-USERS. YOUR RESPONSIBILITIES WILL INCLUDE MANAGING AND PRIORITIZING TIER 2 AND 3 SUPPORT REQUESTS, PROVIDING GUIDANCE TO OTHER TEAM MEMBERS, AND RESOLVING ESCALATED ISSUES. YOU'LL COLLABORATE WITH EXECUTIVE IT LEADERSHIP TO IMPROVE PROCESSES, CONTRIBUTE TO THE DEVELOPMENT OF TRAINING PROGRAMS, AND MAINTAIN A HIGH LEVEL OF CUSTOMER SATISFACTION. WITH A FOCUS ON PROACTIVE PROBLEM-SOLVING, YOU WILL LEAD BY EXAMPLE, FOSTERING A POSITIVE AND COLLABORATIVE WORK ENVIRONMENT WITHIN THE HELP DESK TEAM. ADDITIONALLY, YOU'LL STAY INFORMED ABOUT THE LATEST TECHNOLOGIES AND INDUSTRY BEST PRACTICES TO ENHANCE THE TEAM'S OVERALL PERFORMANCE.\n\n\nWORK AUTHORIZATION REQUIREMENTSCANDIDATES MUST BE US CITIZENS OR PERMANENT GREEN CARD HOLDERS. WE CANNOT ACCEPT OR SPONSOR ANY VISAS AT THIS TIME.",
    "job_skill_set": [
      "IT Certifications (e.g., CompTIA A+)",
      "Problem-Solving",
      "Communication",
      "Interpersonal Skills",
      "Collaboration",
      "Customer Satisfaction Focus",
      "Leadership",
      "Training Development",
      "Proactive Approach",
      "Tier 2 and 3 Technical Support",
      "Help Desk Software",
      "Ticketing Systems",
      "Microsoft Office 365",
      "Active Directory",
      "Windows Operating Systems",
      "Mac Operating Systems",
      "Networking",
      "ITIL Best Practices"
    ],
    "short_keywords": [
      "2",
      "3",
      "365",
      "a",
      "active",
      "and",
      "approach",
      "best",
      "certifications",
      "collaboration",
      "communication",
      "comptia",
      "customer",
      "desk",
      "development",
      "directory",
      "eg",
      "focus",
      "help",
      "information",
      "informationtechnology",
      "interpersonal",
      "it",
      "itil",
      "leadership",
      "mac",
      "microsoft",
      "networking",
      "office",
      "operating",
      "practices",
      "proactive",
      "problemsolving",
      "satisfaction",
      "skills",
      "software",
      "support",
      "systems",
      "technical",
      "technician",
      "technology",
      "ticketing",
      "tier",
      "training",
      "windows"
    ]
  },
  {
    "job_id": "3901939506",
    "job_title": "Information Technology Project Coordinator",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "IT PROJECT COORDINATOR12 MONTHSREMOTEVANDERBILT UNIVERSITY MEDICAL CENTER\nTECHNICAL CAPABILITIESCOORDINATION (INTERMEDIATE): PERFORMS PROJECT TRACKING AND REPORTING RELATIVE TO TASK COMPLETION DATES, DEPENDENCY EFFECTS, PROBLEM ANTICIPATION, SCHEDULE CONFLICTS, AND ASSIGNMENT TO APPROPRIATE STAFF FOR RESOLUTION. MANAGES PRIORITIZATION PROCEDURES FOR CHANGING SCOPE [I.E., CHANGE MANAGEMENT] AND PROJECT ACCEPTANCE PROCEDURES. MEASURES PROGRESS TOWARD GOALS AND REVISES PROJECT OBJECTIVES AND DOCUMENTS APPLYING CHANGE CONTROL PROCEDURES. ESCALATES ISSUES TO DEPARTMENT LEADERSHIP PROMPTLY AND ASSISTS IN RESOLVING ISSUES WHERE APPROPRIATE.PLANNING (INTERMEDIATE): DEMONSTRATES ABILITY TO FORECAST COMPLEX RESOURCE NEEDS, IDENTIFY AND BREAK WORK DOWN INTO DISCRETE AND MEASURABLE TASKS, SET PRIORITIES, DEFINE DEPENDENCIES, SCHEDULE ACTIVITIES, PREPARE ACCEPTANCE CRITERIA AND ORGANIZE WORK FOR ONE OR MORE LARGE PROJECTS. PLANS FOR AND ANTICIPATES EVENTS OUTSIDE OF IMMEDIATE RESPONSIBILITY. ANTICIPATES PROBLEMS AND OBSTACLES BEFORE THEY ARISE. SETS PRIORITIES WITH A PROPER SENSE OF URGENCY AND IMPORTANCE. DEVELOPS CREATIVE IDEAS AND TAKES INNOVATIVE ACTION TO ACHIEVE PLANNED GOALS AND OBJECTIVES. IS PROFICIENT IN THE USE OF PROJECT MANAGEMENT TOOLS.COMMUNICATIONS (INTERMEDIATE): DEMONSTRATES MASTERY OF PROJECT COMMUNICATIONS IN PRACTICAL APPLICATIONS OF A DIFFICULT NATURE. EFFECTIVELY TRANSMITS TECHNICAL AND BUSINESS IDEAS AND INFORMATION TO OTHERS, INCLUDING NON-TECHNICAL AUDIENCES. SHARES KNOWLEDGE, IDEAS AND INFORMATION OPENLY, AND EFFECTIVELY SELLS NEW IDEAS AND INFLUENCES OTHERS. POSSESSES SUFFICIENT KNOWLEDGE, TRAINING, AND EXPERIENCE TO BE CAPABLE OF SUCCESSFULLY DELIVERING PROJECT COMMUNICATIONS WITHOUT REQUIRING SUPPORT AND INSTRUCTION FROM OTHERS.ISSUES MANAGEMENT (INTERMEDIATE): DEMONSTRATES MASTERY OF ISSUES MANAGEMENT IN PRACTICAL APPLICATIONS OF A DIFFICULT NATURE. ADEPT AT IDENTIFYING ISSUES BEFORE THEY BECOME PROBLEMS AND ASSIGNING THOSE ISSUES TO THE RIGHT PEOPLE AT THE RIGHT TIME. POSSESSES SUFFICIENT KNOWLEDGE, TRAINING, AND EXPERIENCE TO BE CAPABLE OF SUCCESSFULLY MANAGING INTERNAL PROJECT ISSUES WITHOUT REQUIRING SUPPORT AND INSTRUCTION FROM OTHERS. ABLE TO ANTICIPATE AND RESOLVE UNPLANNED PROJECT ISSUES AS THEY ARISE.",
    "job_skill_set": [
      "communication",
      "problem solving",
      "issue management",
      "project management",
      "change management",
      "resource forecasting",
      "task breakdown",
      "project tracking",
      "project reporting",
      "project management tools",
      "prioritization",
      "creativity",
      "influencing"
    ],
    "short_keywords": [
      "breakdown",
      "change",
      "communication",
      "coordinator",
      "creativity",
      "forecasting",
      "influencing",
      "information",
      "informationtechnology",
      "issue",
      "management",
      "prioritization",
      "problem",
      "project",
      "reporting",
      "resource",
      "solving",
      "task",
      "technology",
      "tools",
      "tracking"
    ]
  },
  {
    "job_id": "3903839993",
    "job_title": "Audit Director - Information Technology",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "SMBC GROUP IS A TOP-TIER GLOBAL FINANCIAL GROUP. HEADQUARTERED IN TOKYO AND WITH A 400-YEAR HISTORY, SMBC GROUP OFFERS A DIVERSE RANGE OF FINANCIAL SERVICES, INCLUDING BANKING, LEASING, SECURITIES, CREDIT CARDS, AND CONSUMER FINANCE. THE GROUP HAS MORE THAN 130 OFFICES AND 80,000 EMPLOYEES WORLDWIDE IN NEARLY 40 COUNTRIES. SUMITOMO MITSUI FINANCIAL GROUP, INC. (SMFG) IS THE HOLDING COMPANY OF SMBC GROUP, WHICH IS ONE OF THE THREE LARGEST BANKING GROUPS IN JAPAN. SMFG’S SHARES TRADE ON THE TOKYO, NAGOYA, AND NEW YORK (NYSE: SMFG) STOCK EXCHANGES.\n\nIN THE AMERICAS, SMBC GROUP HAS A PRESENCE IN THE US, CANADA, MEXICO, BRAZIL, CHILE, COLOMBIA, AND PERU. BACKED BY THE CAPITAL STRENGTH OF SMBC GROUP AND THE VALUE OF ITS RELATIONSHIPS IN ASIA, THE GROUP OFFERS A RANGE OF COMMERCIAL AND INVESTMENT BANKING SERVICES TO ITS CORPORATE, INSTITUTIONAL, AND MUNICIPAL CLIENTS. IT CONNECTS A DIVERSE CLIENT BASE TO LOCAL MARKETS AND THE ORGANIZATION’S EXTENSIVE GLOBAL NETWORK. THE GROUP’S OPERATING COMPANIES IN THE AMERICAS INCLUDE SUMITOMO MITSUI BANKING CORP. (SMBC), SMBC NIKKO SECURITIES AMERICA, INC., SMBC CAPITAL MARKETS, INC., SMBC RAIL SERVICES LLC, MANUFACTURERS BANK, JRI AMERICA, INC., SMBC LEASING AND FINANCE, INC., BANCO SUMITOMO MITSUI BRASILEIRO S.A., AND SUMITOMO MITSUI FINANCE AND LEASING CO., LTD.\n\nTHE ANTICIPATED SALARY RANGE FOR THIS ROLE IS BETWEEN $175,000.00 AND $225,000.00. THE SPECIFIC SALARY OFFERED TO AN APPLICANT WILL BE BASED ON THEIR INDIVIDUAL QUALIFICATIONS, EXPERIENCES, AND AN ANALYSIS OF THE CURRENT COMPENSATION PAID IN THEIR GEOGRAPHY AND THE MARKET FOR SIMILAR ROLES AT THE TIME OF HIRE. THE ROLE MAY ALSO BE ELIGIBLE FOR AN ANNUAL DISCRETIONARY INCENTIVE AWARD. IN ADDITION TO CASH COMPENSATION, SMBC OFFERS A COMPETITIVE PORTFOLIO OF BENEFITS TO ITS EMPLOYEES.\n\nROLE DESCRIPTION\n\nSMBC IS SEEKING AN EXPERIENCED PROFESSIONAL (10 YEARS) TO JOIN OUR IT APPLICATION AUDIT TEAM FOR THE AMERICAS DIVISION, SPECIALIZING ON THE DELIVERY OF INTEGRATED AUDITS, FOCUSING ON SCOPING AND EXECUTING IT AUDIT PROCEDURES FOR KEY BUSINESS APPLICATIONS SUPPORTING BUSINESS PROCESS AUDITS.\n\nTHE INDIVIDUAL WILL EVALUATE IT-RELATED GOVERNANCE, PROCESSES, RISKS AND CONTROLS TO PROVIDE REASONABLE ASSURANCE AS TO THE ADEQUACY OF THE CONTROL ENVIRONMENT WITHIN THE AMERICAS, AND ENTITIES RELIANT UPON THE AMERICAS' SERVICES.\n\nAUDIT ACTIVITY INCLUDES THE ANNUAL RISK ASSESSMENT AND PLANNING; SCHEDULED AUDIT EXECUTION COVERING BOTH EXISTING APPLICATIONS IN PRODUCTION AND NEW DEVELOPMENT/IMPLEMENTATIONS; ISSUE VALIDATION; CONTINUOUS MONITORING. THE DEPARTMENT IS ALSO EXPANDING THE USE OF DATA AND ANALYTICS IN VARIOUS AUDIT ACTIVITIES.\n\nROLE OBJECTIVES: DELIVERY\n\nTHE ROLE REQUIRES THE CANDIDATE TO PLAN AND PERFORM INTERNAL AUDITS OVER TECHNOLOGY AREAS WITHIN SMBC'S AMERICAS DIVISION, PRIMARILY FOCUSING ON APPLICATION-SPECIFIC RISKS AND CONTROLS IN INTEGRATED BUSINESS AUDITS, ALONG WITH SOME EXPOSURE TO INFRASTRUCTURE AND CYBERSECURITY AUDITS. THE INDIVIDUAL IS RESPONSIBLE FOR THE SUPERVISION OF RESPECTIVE AUDIT TEAM STAFF AND DAY-TO-DAY OVERSIGHT AND REPORTING OF AUDIT ACTIVITIES FOR ASSIGNED PORTFOLIO INCLUDING: (I) EXECUTION OF EFFICIENT, HIGH QUALITY, AND TIMELY AUDIT REVIEWS; (II) ISSUE VALIDATION, CONTINUOUS MONITORING, AND ANNUAL RISK ASSESSMENTS FOR AUDITABLE ENTITIES (AES); AND (III) DEVELOPMENT OF RESPECTIVE PORTFOLIO'S AUDIT PLAN. SPECIFIC RESPONSIBILITIES INCLUDE:\n\nDEFINES, PLANS AND SCHEDULES IT AUDIT ACTIVITIES IN SUPPORT OF BUSINESS AUDITS, TO INCLUDE INTERNAL CONTROLS IN KEY TECHNOLOGY RISK AREAS TO ENSURE COMPLIANCE WITH INTERNAL POLICIES, LAWS AND REGULATIONS, AND REGULATORY EXPECTATIONS (FFIEC AND SUPERVISION AND REGULATION LETTERS)MANAGES TIMELY AND QUALITY EXECUTION OF AUDITS FOR ASSIGNED PORTFOLIO.MANAGES TIMELY AND QUALITY PERFORMANCE OF (1) AUDIT ISSUE VALIDATION; (2) CONTINUOUS MONITORING ACTIVITIES; (3) ANNUAL RISK ASSESSMENT AND AUDIT PLANNING.PROVIDES SUPERVISION AND ON-THE-JOB TRAINING TO STAFF, TO ENSURE AUDIT EXECUTION IS IN LINE WITH IIA AND OTHER RELEVANT STANDARDS, INCLUDING COMPLETION OF CLEAR AND CONCISE AUDIT WORK-PAPERS AND AUDIT REPORTS SUMMARIZING SCOPE, METHODOLOGY, AND SIGNIFICANT CONCLUSIONS OF AUDIT PROCEDURES PERFORMED WITHIN PRESCRIBED TIME FRAMES.COORDINATES AUDIT ACTIVITIES WITH BUSINESS AUDIT MANAGEMENT.ESTABLISHES AND BUILDS RELATIONSHIPS WITH KEY IT AND BUSINESS STAKEHOLDERS.PERFORMS STAFF DEVELOPMENT AND PEOPLE MANAGEMENT ACTIVITIES.POSSESSES STRONG PROJECT MANAGEMENT SKILLS WITH AN ABILITY TO OVERSEE MULTIPLE AUDITS, ISSUE VALIDATION, ANNUAL RISK ASSESSMENT, AUDIT PLANNING, AND CONTINUOUS MONITORING AND DELIVER WITHIN REQUIRED DEADLINES CAN EXECUTE A VARIETY OF TASKS AND PROPERLY PRIORITIZE DELIVERABLES.HAS EXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLS TO SUPPORT AND REVIEW THE AUDIT EXECUTION TEAM'S DELIVERY OF CLEAR AND CONCISE WORKPAPERS AND SUPPORT EFFECTIVE INTERACTION WITH IAD NY MANAGEMENT AND AUDIT CLIENTS ACROSS THE ORGANIZATION.EXHIBITS INITIATIVE AND CRITICAL THINKING TO EFFECTIVELY CHALLENGE DECISIONS MADE BY THE TEAM.EXHIBITS AN APPROPRIATE LEVEL OF PROFESSIONAL SKEPTICISM AND ENCOURAGES THEIR TEAM TO DO THE SAME.DEMONSTRATES AND SUPPORTS AN ATTITUDE OF CONTINUOUS LEARNING IN APPLICABLE RISK/FUNCTIONAL AREAS (FOR THEMSELVES AND THEIR TEAM, RESPECTIVELY).SHOWS INITIATIVE TO IDENTIFY AND COMMUNICATE ANY OPPORTUNITIES FOR IMPROVEMENT IN EXECUTION OF AUDITS OR IAD NY'S METHODOLOGY.\n\nROLE OBJECTIVES: INTERPERSONAL\n\nPROACTIVELY FOSTER RELATIONSHIPS WITH TECHNOLOGY AND BUSINESS MANAGEMENT DESIGN AUTHORITY AND/OR IMPLEMENTATION AUTHORITY (AS APPROPRIATE) TO ESTABLISH AND MAINTAIN OPEN AND CONSTRUCTIVE DIALOGUE. FORGE STRONG PARTNERSHIPS WITH COLLEAGUES IN OTHER INFRASTRUCTURE AND CONTROL FUNCTIONS INCLUDING LEGAL, COMPLIANCE, DATA SECURITY AND RISK MANAGEMENT TO PROMOTE FRONT-TO-BACK COLLABORATION ACROSS RISK ASSESSMENT AND FINDINGS REMEDIATION. PARTNER WITH AUDIT COLLEAGUES IN OTHER BUSINESS VERTICALS AND/OR GEOGRAPHIES TO SHARE BEST PRACTICES AND DRIVE GREATER CONSISTENCY. SEEK OUT OPPORTUNITIES TO ENGAGE WITH STAKEHOLDERS OUTSIDE OF FORMAL AUDIT PERIODS TO DRIVE DEEPER RELATIONSHIPS.\n\nROLE OBJECTIVES: EXPERTISE\n\nMINIMUM 10 YEARS IT AUDIT EXPERIENCE, AT A BANK OR FINANCIAL INSTITUTION IS REQUIRED; IN-DEPTH UNDERSTANDING OF BUSINESS PROCESSES IN AT LEAST THREE OF THE FOLLOWING: COMMERCIAL BANKING; BROKER-DEALER SALES AND TRADING; FINANCIAL AND REGULATORY REPORTING; AML AND BSA; HUMAN RESOURCES AND OPERATIONS, IS A MUST.\n\n IDENTIFYING AND TESTING KEY RISKS AND CONTROLS WITHIN APPLICATIONS IS REQUIRED, SUCH AS COMPLETENESS AND ACCURACY OF INPUT AND UPDATE; INTERFACES; ACCESS CONTROLS AND SEGREGATION OF DUTIES; APPLICATION SECURITY SCANNING AND FAMILIARITY WITH OWASP TOP 10 GUIDANCE ARE REQUIRED. THE DEPARTMENT IS ALSO EXPANDING THE USE OF DATA AND ANALYTICS IN VARIOUS AUDIT ACTIVITIES.\n\nRESPONSIBILITIES\n\nTHE ROLE REQUIRES THE CANDIDATE TO PLAN AND PERFORM INTERNAL AUDITS OVER TECHNOLOGY AREAS WITHIN SMBC'S AMERICAS DIVISION, PRIMARILY FOCUSING ON APPLICATION-SPECIFIC RISKS AND CONTROLS IN INTEGRATED BUSINESS AUDITS, ALONG WITH SOME EXPOSURE TO INFRASTRUCTURE AND CYBERSECURITY AUDITS.THE INDIVIDUAL IS RESPONSIBLE FOR THE SUPERVISION OF RESPECTIVE AUDIT TEAM STAFF AND DAY-TO-DAY OVERSIGHT AND REPORTING OF AUDIT ACTIVITIES FOR ASSIGNED PORTFOLIO INCLUDING: (I) EXECUTION OF EFFICIENT, HIGH QUALITY, AND TIMELY AUDIT REVIEWS; (II) ISSUE VALIDATION, CONTINUOUS MONITORING, AND ANNUAL RISK ASSESSMENTS FOR AUDITABLE ENTITIES (AES); AND (III) DEVELOPMENT OF RESPECTIVE PORTFOLIO'S AUDIT PLAN.DEFINES, PLANS AND SCHEDULES IT AUDIT ACTIVITIES IN SUPPORT OF BUSINESS AUDITS, TO INCLUDE INTERNAL CONTROLS IN KEY TECHNOLOGY RISK AREAS TO ENSURE COMPLIANCE WITH INTERNAL POLICIES, LAWS AND REGULATIONS, AND REGULATORY EXPECTATIONS (FFIEC AND SUPERVISION AND REGULATION LETTERS).MANAGES TIMELY AND QUALITY PERFORMANCE OF (1) AUDIT ISSUE VALIDATION; (2) CONTINUOUS MONITORING ACTIVITIES; (3) ANNUAL RISK ASSESSMENT AND AUDIT PLANNING.PROVIDES SUPERVISION AND ON-THE-JOB TRAINING TO STAFF, TO ENSURE AUDIT EXECUTION IS IN LINE WITH IIA AND OTHER RELEVANT STANDARDS, INCLUDING COMPLETION OF CLEAR AND CONCISE AUDIT WORK-PAPERS AND AUDIT REPORTS SUMMARIZING SCOPE, METHODOLOGY, AND SIGNIFICANT CONCLUSIONS OF AUDIT PROCEDURES PERFORMED WITHIN PRESCRIBED TIMEFRAMES. COORDINATES AUDIT ACTIVITIES WITH BUSINESS AUDIT MANAGEMENT.ESTABLISHES AND BUILDS RELATIONSHIPS WITH KEY IT AND BUSINESS STAKEHOLDERS.PERFORMS STAFF DEVELOPMENT AND PEOPLE MANAGEMENT ACTIVITIES.POSSESSES STRONG PROJECT MANAGEMENT SKILLS WITH AN ABILITY TO OVERSEE MULTIPLE AUDITS, ISSUE VALIDATION, ANNUAL RISK ASSESSMENT, AUDIT PLANNING, AND CONTINUOUS MONITORING AND DELIVER WITHIN REQUIRED DEADLINES.CAN EXECUTE A VARIETY OF TASKS AND PROPERLY PRIORITIZE DELIVERABLES.HAS EXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLS TO SUPPORT AND REVIEW THE AUDIT EXECUTION TEAM'S DELIVERY OF CLEAR AND CONCISE WORKPAPERS AND SUPPORT EFFECTIVE INTERACTION WITH IAD NY MANAGEMENT AND AUDIT CLIENTS ACROSS THE ORGANIZATION.EXHIBITS INITIATIVE AND CRITICAL THINKING TO EFFECTIVELY CHALLENGE DECISIONS MADE BY THE TEAM.EXHIBITS AN APPROPRIATE LEVEL OF PROFESSIONAL SKEPTICISM AND ENCOURAGES THEIR TEAM TO DO THE SAME.DEMONSTRATES AND SUPPORTS AN ATTITUDE OF CONTINUOUS LEARNING IN APPLICABLE RISK/FUNCTIONAL AREAS (FOR THEMSELVES AND THEIR TEAM, RESPECTIVELY).SHOWS INITIATIVE TO IDENTIFY AND COMMUNICATE ANY OPPORTUNITIES FOR IMPROVEMENT IN EXECUTION OF AUDITS OR IAD NY'S METHODOLOGY.\n\nQUALIFICATIONS AND SKILLS\n\nMINIMUM 10 YEARS IT AUDIT EXPERIENCE, AT A BANK OR FINANCIAL INSTITUTION IS REQUIRED; IN-DEPTH UNDERSTANDING OF BUSINESS PROCESSES IN AT LEAST THREE OF THE FOLLOWING: COMMERCIAL BANKING; BROKER-DEALER SALES AND TRADING; FINANCIAL AND REGULATORY REPORTING; AML AND BSA; HUMAN RESOURCES AND OPERATIONS, IS A MUST INCLUDING:\n\nA GOOD UNDERSTANDING OF RISKS AND CONTROLS WITHIN A TECHNICAL ENVIRONMENT IS REQUIRED, AS WELL AS THE ABILITY TO CLEARLY IDENTIFY, DOCUMENT AND TEST THESE CONTROLS; THIS TEAM EVALUATES APPLICATIONS AS PART OF AN OVERALL BUSINESS PROCESS; THE ABILITY TO IDENTIFY AND ASSESS COMPENSATING CONTROLS (IN THE EVENT OF IT-RELATED WEAKNESSES) IS DESIRED.BACHELOR'S DEGREE IS REQUIRED, AND CISA, CISSP, CIA AND/OR OTHER RELEVANT CERTIFICATIONS IS PREFERRED.IDENTIFYING AND TESTING KEY RISKS AND CONTROLS WITHIN APPLICATIONS IS REQUIRED, SUCH AS COMPLETENESS AND ACCURACY OF INPUT AND UPDATE; INTERFACES; ACCESS CONTROLS AND SEGREGATION OF DUTIES; APPLICATION SECURITY SCANNING AND FAMILIARITY WITH OWASP TOP 10 GUIDANCE ARE REQUIRED. KNOWLEDGE OF SYSTEM DEVELOPMENT LIFECYCLE (SDLC) AND COMMON FRAMEWORKS, INCLUDING AGILE DEVELOPMENT, IS PREFERRED.UNDERSTANDING OF COMMON BANKING APPLICATIONS, INCLUDING CLOUD-BASED, IS PREFERRED.KNOWLEDGE OF DATA GOVERNANCE; RECORDS MANAGEMENT; END USER COMPUTING; AND BUSINESS CONTINUITY/OPERATIONAL RESILIENCE PROCESSES AND TECHNIQUES IS DESIRABLE.ABILITY TO MULTITASK AND WORK IN A TEAM ENVIRONMENT IS CRUCIAL.ABILITY TO UNDERSTAND, INTERPRET, AND APPLY GENERAL AND SPECIFIC ADMINISTRATIVE AND DEPARTMENTAL POLICIES AND PROCEDURES, AS WELL AS APPLICABLE FEDERAL & STATE (CA AND NY) LAWS AND REGULATIONS IS REQUIRED.OVERALL UNDERSTANDING OF AUDIT TECHNIQUES, INTERNAL CONTROLS, AUDIT PRINCIPLES AND ABILITY TO MANAGE AND EXECUTE AUDITS, FROM PLANNING TO AUDIT CLOSING IS REQUIRED.STRONG CRITICAL THINKING, ANALYTICAL AND ORGANIZATIONAL SKILLS.STRONG ORAL AND WRITTEN COMMUNICATION SKILLS, INCLUDING ABILITY TO WRITE CLEAR AND CONCISE AUDIT RECOMMENDATIONS AND REPORTS.WORKING KNOWLEDGE OF MICROSOFT OFFICE SUITE (OUTLOOK, EXCEL, WORD, POWERPOINT).\n\nADDITIONAL REQUIREMENTS\n\nRESPONSIBLE FOR FOSTERING A CULTURE OF DIVERSITY AND INCLUSION, HOLDING LEADERS ACCOUNTABLE FOR CREATING AN INCLUSIVE ENVIRONMENT THROUGH AWARENESS AND PRACTICE OF EQUITY IN RECRUITING, DEVELOPING, AND PROMOTING DIVERSE TALENT.\n\nSMBC'S EMPLOYEES PARTICIPATE IN A HYBRID WORKFORCE MODEL THAT PROVIDES EMPLOYEES WITH AN OPPORTUNITY TO WORK FROM HOME, AS WELL AS, FROM AN SMBC OFFICE. SMBC REQUIRES THAT EMPLOYEES LIVE WITHIN A REASONABLE COMMUTING DISTANCE OF THEIR OFFICE LOCATION. PROSPECTIVE CANDIDATES WILL LEARN MORE ABOUT THEIR SPECIFIC HYBRID WORK SCHEDULE DURING THEIR INTERVIEW PROCESS.\n\nWE ARE AN EQUAL EMPLOYMENT OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, GENDER, NATIONAL ORIGIN, DISABILITY STATUS, PROTECTED VETERAN STATUS OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW. SMBC PROVIDES REASONABLE ACCOMMODATIONS FOR EMPLOYEES AND APPLICANTS WITH DISABILITIES CONSISTENT WITH APPLICABLE LAW. IF YOU NEED A REASONABLE ACCOMMODATION DURING THE APPLICATION PROCESS, PLEASE LET US KNOW AT ACCOMMODATIONS@SMBCGROUP.COM\n\nSMBC’S EMPLOYEES PARTICIPATE IN A HYBRID WORKFORCE MODEL THAT PROVIDES EMPLOYEES WITH AN OPPORTUNITY TO WORK FROM HOME, AS WELL AS, FROM AN SMBC OFFICE. SMBC REQUIRES THAT EMPLOYEES LIVE WITHIN A REASONABLE COMMUTING DISTANCE OF THEIR OFFICE LOCATION. PROSPECTIVE CANDIDATES WILL LEARN MORE ABOUT THEIR SPECIFIC HYBRID WORK SCHEDULE DURING THEIR INTERVIEW PROCESS.\n\nWE ARE AN EQUAL EMPLOYMENT OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, GENDER, NATIONAL ORIGIN, DISABILITY STATUS, PROTECTED VETERAN STATUS OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW. SMBC PROVIDES REASONABLE ACCOMMODATIONS FOR EMPLOYEES AND APPLICANTS WITH DISABILITIES CONSISTENT WITH APPLICABLE LAW. IF YOU NEED A REASONABLE ACCOMMODATION DURING THE APPLICATION PROCESS, PLEASE LET US KNOW AT ACCOMMODATIONS@SMBCGROUP.COM.",
    "job_skill_set": [
      "Project Management",
      "Microsoft Office Suite",
      "Communication",
      "Critical Thinking",
      "Teamwork",
      "Leadership",
      "Initiative",
      "Organizational Skills",
      "Interpersonal Skills",
      "Problem Solving",
      "IT Audit",
      "Risk Assessment",
      "Internal Controls",
      "Data Analytics",
      "Application Security",
      "Compliance",
      "Audit Techniques",
      "SDLC",
      "Agile Development",
      "Data Governance",
      "Business Continuity",
      "OWASP Top 10",
      "Financial Regulations",
      "Technical Environment Understanding",
      "Professional Skepticism",
      "Continuous Learning"
    ],
    "short_keywords": [
      "10",
      "agile",
      "analytics",
      "application",
      "assessment",
      "audit",
      "business",
      "communication",
      "compliance",
      "continuity",
      "continuous",
      "controls",
      "critical",
      "data",
      "development",
      "director",
      "environment",
      "financial",
      "governance",
      "information",
      "informationtechnology",
      "initiative",
      "internal",
      "interpersonal",
      "it",
      "leadership",
      "learning",
      "management",
      "microsoft",
      "office",
      "organizational",
      "owasp",
      "problem",
      "professional",
      "project",
      "regulations",
      "risk",
      "sdlc",
      "security",
      "skepticism",
      "skills",
      "solving",
      "suite",
      "teamwork",
      "technical",
      "techniques",
      "technology",
      "thinking",
      "top",
      "understanding"
    ]
  },
  {
    "job_id": "3885109989",
    "job_title": "Director of Information Technology",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "WE ARE LOOKING TO FILL AN EXECUTIVE-LEVEL TECHNOLOGY POSITION WITH A FORTUNE 500 COMPANY LOCATED IN CHICAGO, IL. \nVISA STATUS:US CITIZENS AND GREEN CARD HOLDERS ONLY\nLOCATION:CHICAGO ILREMOTE FOR EXCEPTIONAL CANDIDATES\nQUALIFICATIONS:BS/MASTER’S/PH.D. DEGREE IN COMPUTER SCIENCE, INFORMATION ENGINEERING, OR A SIMILAR FIELD15+ YEARS OF PROGRESSIVE INFORMATION TECHNOLOGY EXPERIENCE WITH INCREASING LEVELS OF RESPONSIBILITIES10+ YEARS OF PROVEN EXPERIENCE AS A DIRECTOR OF SOFTWARE DEVELOPMENT AT A FORTUNE 500 COMPANY6+ YEARS OF HANDS-ON PROJECT MANAGEMENT AND PROFESSIONAL SOFTWARE DEVELOPMENT USING C#, JAVA, OR C++, PLUS AN UNDERSTANDING OF RDBMS DESIGN AND OPTIMIZATION PRACTICES.KNOWLEDGE OF IT SECURITY PRACTICES, DISTRIBUTED SYSTEMS, CONTAINERIZATION, COMMON AUTOMATION TOOLS (JENKINS/SOS JOB SCHEDULER, ETC.), CICD TOOLSETS (GIT, ATLASSIAN, GITLAB, ETC.), AND THE MICROSOFT VISUAL STUDIO/DOTNET DEVELOPMENT ENVIRONMENTS.EXPERIENCE AUTOMATING INFRASTRUCTURE PROVISIONING, DEVOPS, AND CONTINUOUS INTEGRATION/DELIVERY.DEEP TECHNICAL BACKGROUND DEVELOPED FROM EXPERIENCE WORKING WITH VARIOUS APPLICATIONS AND TECHNOLOGIES TO EVALUATE DESIGN ALTERNATIVES AND THEIR TIME/COST/PERFORMANCE TRADEOFFS.COMPREHENSIVE UNDERSTANDING OF SOFTWARE DEVELOPMENT LIFE CYCLE. PASSIONATE ABOUT STAYING CURRENT ON MODERN SOLUTIONS AND BEST PRACTICES.",
    "job_skill_set": [
      "IT Security Practices",
      "Distributed Systems",
      "Project Management",
      "Leadership",
      "Communication",
      "Problem Solving",
      "Adaptability",
      "C#",
      "Java",
      "C++",
      "RDBMS Design",
      "Containerization",
      "Automation Tools (Jenkins, SOS Job Scheduler)",
      "CI/CD Toolsets (Git, Atlassian, GitLab)",
      "Microsoft Visual Studio/.NET",
      "Infrastructure Provisioning Automation",
      "DevOps",
      "Software Development Life Cycle",
      "Passion for Learning"
    ],
    "short_keywords": [
      "adaptability",
      "atlassian",
      "automation",
      "c",
      "cicd",
      "communication",
      "containerization",
      "cycle",
      "design",
      "development",
      "devops",
      "director",
      "distributed",
      "for",
      "git",
      "gitlab",
      "information",
      "informationtechnology",
      "infrastructure",
      "it",
      "java",
      "jenkins",
      "job",
      "leadership",
      "learning",
      "life",
      "management",
      "microsoft",
      "of",
      "passion",
      "practices",
      "problem",
      "project",
      "provisioning",
      "rdbms",
      "scheduler",
      "security",
      "software",
      "solving",
      "sos",
      "studionet",
      "systems",
      "technology",
      "tools",
      "toolsets",
      "visual"
    ]
  },
  {
    "job_id": "3905850996",
    "job_title": "Information Technology Support Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "LABATT FOOD SERVICE IS HIRING A FULL-TIME IT HELP DESK OPERATIONS SUPPORT SPECIALIST FOR THE SAN ANTONIO OFFICE.\nIT OPERATIONS UTILIZES PROBLEM SOLVING SKILLS TO RESOLVE USER REQUESTS AND OTHER IT RELATED TASKS. THE MAIN RESPONSIBILITIES OF THIS ROLE ARE TO PROVIDE TECHNICAL SUPPORT AND MANAGE A HIGH VOLUME OF REQUESTS BY EMPLOYEES IN A MULTI-OFFICE ENVIRONMENT.\nRESPONSIBILITIESPROVIDE TECHNICAL SUPPORT AND SOLVE THE BASIC AND MORE ADVANCED ROUTINE USER HARDWARE AND SOFTWARE ISSUESCREATE AND ADMINISTER NEW USER ACCOUNTS, PERMISSIONS, AND ACCESS RIGHTSCONFIGURE, DEPLOY AND MAINTAIN ESSENTIAL INTERNAL INFRASTRUCTURE INCLUDING LAPTOPS, PHONES, PRINTERS, CAMERAS, NETWORK SWITCHES, ACCESS POINTS, AND SERVERSPERFORM REGULAR VULNERABILITY SCANS AND SECURITY MONITORING TO IDENTIFY AND MITIGATE ISSUES WITHIN THE NETWORKRECOMMEND, SCHEDULE AND PERFORM SOFTWARE UPGRADES, PATCHES AND CONFIGURATIONSBUILD KNOWLEDGE BASE ARTICLES FOR COMMON OR HIGH-IMPACT ISSUES AND THEIR RESOLUTIONSPARTICIPATE IN AN ON CALL ROTATION TO SUPPORT A 24X7 CRITICAL FACILITY INFRASTRUCTURE\nREQUIREMENTSBACHELOR’S DEGREE IN COMPUTER ENGINEERING (CE), COMPUTER SCIENCE (CS) OR COMPUTER INFORMATION SYSTEMS (CIS)ABILITY TO COMMUNICATE EFFECTIVELY, INCLUDING LISTENING, WRITING AND ATTENTION TO DETAILFAMILIARITY WITH VIRTUAL AND PHYSICAL SERVERS AND WINDOWS OPERATING SYSTEMSSOME EXPERIENCE IN A HELPDESK, NETWORK OR SYSTEM ADMINISTRATOR ROLE IS PREFERRED BUT NOT REQUIRED.",
    "job_skill_set": [
      "technical support",
      "problem solving",
      "user account management",
      "hardware troubleshooting",
      "software troubleshooting",
      "network configuration",
      "security monitoring",
      "vulnerability scanning",
      "knowledge base creation",
      "Windows operating systems",
      "server management",
      "software upgrades",
      "communication",
      "attention to detail",
      "teamwork",
      "adaptability"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "attention",
      "base",
      "communication",
      "configuration",
      "creation",
      "detail",
      "hardware",
      "information",
      "informationtechnology",
      "knowledge",
      "management",
      "monitoring",
      "network",
      "operating",
      "problem",
      "scanning",
      "security",
      "server",
      "software",
      "solving",
      "specialist",
      "support",
      "systems",
      "teamwork",
      "technical",
      "technology",
      "to",
      "troubleshooting",
      "upgrades",
      "user",
      "vulnerability",
      "windows"
    ]
  },
  {
    "job_id": "3889743825",
    "job_title": "Director of Information Technology",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "DIRECTOR, IT INFRASTRUCTURE | HYBRID - BOSTON | 175 TO 200K + BONUS\nDO YOU WANT TO SPEARHEAD DIGITAL MODERNIZATION PROJECTS WITHIN CLOUD SERVICES?\nDO YOU WANT TO WORK FOR A COMPANY THAT WILL SUPPORT YOUR DEVELOPMENT AND PROVIDE THE OPPORTUNITY TO UPSKILL WITH CERTIFICATES?\nA LEADING BIOTECH IN THE BOSTON AREA IS ON THE HUNT FOR A NEW SENIOR MANAGER OF INFRASTRUCTURE. THEIR MISSION IS TO PROVIDE CLIENTS WITH THE BEST POSSIBLE RESOURCES TO HELP ACHIEVE THEIR FINANCIAL AND BUSINESS GOALS, STRIVING TO BE THE LEADING PROVIDER OF INNOVATIVE SOLUTIONS AND SERVICES.\nYOU WILL WORK DIRECTLY ALONGSIDE SENIOR MANAGEMENT AND EXECUTIVES TO ROADMAP THEIR ON-PREM AND CLOUD SERVICES, AND UNDERGO A HUGE DIGITAL MODERNIZATION PROJECT. YOU WILL NEED MENTOR AND LEADERSHIP SKILLS TO ENSURE THE TEAM REPORTING TO YOU THRIVES WITHIN THE ROLE AND DEVELOPS PROFESSIONALLY.\nEXPERIENCE NEEDED:CLOUD, SERVER, NETWORKING.CYBERSECURITY.LEADERSHIP & MANAGEMENT EXPERIENCE.FULL PROJECT LIFECYCLE EXPERIENCE.\nWHAT YOU WILL RECEIVE:HYBRID WORK SCHEDULE.FULL HEALTH COVERAGE.UNLIMITED PTO.\nIF THIS SOUNDS LIKE THE OPPORTUNITY FOR YOU, DON’T HESITATE TO GET IN CONTACT WITH ME BEFORE IT’S TOO LATE AT R.BRAY@FRANKLINFITCH.COM",
    "job_skill_set": [
      "cloud services",
      "server management",
      "networking",
      "cybersecurity",
      "project management",
      "leadership",
      "mentoring",
      "communication",
      "team development"
    ],
    "short_keywords": [
      "cloud",
      "communication",
      "cybersecurity",
      "development",
      "director",
      "information",
      "informationtechnology",
      "leadership",
      "management",
      "mentoring",
      "networking",
      "of",
      "project",
      "server",
      "services",
      "team",
      "technology"
    ]
  },
  {
    "job_id": "3884438195",
    "job_title": "Information Technology Technician",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "STAVIS SEAFOODS, A PROFAND COMPANY, AN ANCHOR OF THE NEW ENGLAND SEAFOOD COMMUNITY SINCE 1929, SHIPS MORE THAN 37 MILLION POUNDS OF FRESH AND FROZEN SEAFOOD ANNUALLY AND IMPORTS FROM MORE THAN 50 COUNTRIES WORLDWIDE. STAVIS HAS ONE OF THE MOST DIVERSE INVENTORIES OF SEAFOOD ITEMS IN THE INDUSTRY AND CAN SHIP VIA LAND, AIR AND SEA AROUND THE GLOBE. \nIN 2018 STAVIS SEAFOODS WAS ACQUIRED BY PROFAND. HEADQUARTERED IN SPAIN, PROFAND’S MISSION IS TO CREATE A MULTINATIONAL COMPANY WITHIN THE GLOBAL FISHING SECTOR, PROCESSING AND MANUFACTURING THE HIGHEST QUALITY SEAFOOD UNDER A FULLY INTEGRATED AND SUSTAINABLE MODEL FROM EXTRACTION TO SALE, WHILE ALSO ENSURING THE HIGHEST SAFETY AND PROFITABILITY. \nTHE IT TECHNICIAN'S ROLE WILL DIAGNOSE, REPAIR AND MAINTAIN HARDWARE AND SOFTWARE COMPONENTS. WILL INSTALL AND CONFIGURE COMPUTER HARDWARE AND PROVIDE IT SUPPORT FOR THE ORGANIZATION. ALSO, WILL ROUTINELY INTERACT WITH VARIOUS DEPARTMENTS AND LEVELS, LISTEN TO THEIR TECHNICAL NEEDS AND IMPLEMENT IT SOLUTIONS TO RESOLVE THE ISSUES.\nRESPONSIBILITIES: \nSETTING UP ACCOUNTS FOR NEW USERS.INSTALLING AND CONFIGURING HARDWARE AND SOFTWARE COMPONENTS.REPAIRING AND REPLACING EQUIPMENT AS NECESSARY.INSTALLING AND CONFIGURING COMPUTER HARDWARE, SOFTWARE, SYSTEMS, NETWORKS, PRINTERS AND SCANNERS.MAINTAINING AND UPDATING THE INVENTORY & LICENSE LISTS BY TRACKING INVENTORY (SUCH AS CHARGER CORDS, HEADSETS, CAMERAS, LAPTOPS, KEYBOARDS, MONITORS).PROVIDING THE REQUESTED HARDWARE TO EMPLOYEES, WHEN NEEDED.PROVIDING QUICK AND EFFECTIVE ASSISTANCE WITH INFORMATION TECHNOLOGY SYSTEMS.GUIDE EMPLOYEES REMOTELY AND ON SITE THROUGH SYSTEMS CONFIGURATION, TROUBLESHOOTING, AND MAINTENANCE.TRAVELLING BETWEEN FACILITIES IF NEEDED, TO PROVIDE IT SUPPORT.\nEXPERIENCE:\n+3 YEARS OF EXPERIENCE WORKING IN A HELP DESK OR TECHNICAL SUPPORT ROLE.STRONG KNOWLEDGE OF WINDOWS OPERATING SYSTEMS AND SERVER ADMINISTRATION.PROFICIENCY IN TROUBLESHOOTING HARDWARE, SOFTWARE, AND NETWORK ISSUES.SKILLED IN DATABASE PROGRAMMING AND SOFTWARE INSTALLATION.PROFICIENT WITH MICROSOFT WINDOWS AND MAC IOS.FAMILIAR WITH A RANGE OF SOFTWARE AND HARDWARE\nWHAT DO WE OFFER?\nFULL TIME POSITION IN A COMPANY WITH ALMOST 100 YEARS OF EXPERIENCE IN THE SEAFOOD BUSINESS. TRAINING AND PROFESSIONAL DEVELOPMENT.EMPLOYEE BENEFITS.\n STAVIS SEAFOODS, A PROFAND COMPANY CELEBRATES DIVERSITY AND INCLUSION, RECOGNIZING THAT HAVING DIFFERENT PROFESSIONAL AND PERSONAL PROFILES IS WHAT ADDS VALUE TO OUR COMPANY. AS A MULTINATIONAL COMPANY WE AIM TO ENSURE EQUAL OPPORTUNITIES, REGARDLESS OF AGE, RACE, GENDER, DISABILITY, RELIGION OR SEXUAL ORIENTATION.",
    "job_skill_set": [
      "hardware installation",
      "software installation",
      "troubleshooting",
      "network configuration",
      "Windows operating systems",
      "server administration",
      "database programming",
      "Microsoft Windows",
      "inventory management",
      "communication",
      "problem solving",
      "customer service",
      "teamwork",
      "adaptability",
      "attention to detail",
      "Mac IOS"
    ],
    "short_keywords": [
      "adaptability",
      "administration",
      "attention",
      "communication",
      "configuration",
      "customer",
      "database",
      "detail",
      "hardware",
      "information",
      "informationtechnology",
      "installation",
      "inventory",
      "ios",
      "mac",
      "management",
      "microsoft",
      "network",
      "operating",
      "problem",
      "programming",
      "server",
      "service",
      "software",
      "solving",
      "systems",
      "teamwork",
      "technician",
      "technology",
      "to",
      "troubleshooting",
      "windows"
    ]
  },
  {
    "job_id": "3905256349",
    "job_title": "Manager of Information Technology",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "FIRSTPRO IS SEEKING A LEAD/MANAGER OF IT FOR A FULLTIME ROLE LOCATED IN NORTH EAST PHILADELPHIA. \nTHIS IS 5 DAYS A WEEK ONSITE IN NE PHILLY.\n*NO SPONSORSHIP; US CITIZENS OR GREEN CARD HOLDERS ONLY\nEXPERIENCE MANAGING A TEAMEXPERIENCE WITH VENDOR RELATIONSABILITY TO WORK IN AND MAINTAIN ACTIVE AND OPEN DIRECTORY SYSTEMSASSIST WITH TIER 2 AND 3 END USER AND DESKTOP SUPPORT250 END USERSSETUP AND CONFIGURE CISCO NETWORK INFRASTRUCTURE (ROUTING AND SWITCHING)FAMILIARITY WITH CISCO IOS AND COMMAND LINERESEARCH AND IMPLEMENT IT SECURITY BEST PRACTICES AND KEEP UP WITH INDUSTRY STANDARDSABILITY TO WORK WITH OPENBSD/FREENAS/ZFS BASED STORAGE SYSTEMSMANAGE OFFICE 365 AND G SUITE EMAIL SYSTEMSCONFIGURE NETWORK DEVICES SUCH AS FIREWALLS, L2/L3 SWITCHES, WAPS, VOIP PHONES AND OTHER IT EQUIPMENT",
    "job_skill_set": [
      "team management",
      "vendor relations",
      "Active Directory",
      "desktop support",
      "Cisco networking",
      "IT security best practices",
      "network device configuration",
      "firewalls",
      "L2/L3 switches",
      "WAPs",
      "communication",
      "problem solving",
      "adaptability",
      "leadership",
      "collaboration",
      "Cisco IOS",
      "OpenBSD",
      "FreeNAS",
      "ZFS",
      "Office 365",
      "G Suite",
      "VOIP phones"
    ],
    "short_keywords": [
      "365",
      "active",
      "adaptability",
      "best",
      "cisco",
      "collaboration",
      "communication",
      "configuration",
      "desktop",
      "device",
      "directory",
      "firewalls",
      "freenas",
      "g",
      "information",
      "informationtechnology",
      "ios",
      "it",
      "l2l3",
      "leadership",
      "management",
      "manager",
      "network",
      "networking",
      "of",
      "office",
      "openbsd",
      "phones",
      "practices",
      "problem",
      "relations",
      "security",
      "solving",
      "suite",
      "support",
      "switches",
      "team",
      "technology",
      "vendor",
      "voip",
      "waps",
      "zfs"
    ]
  },
  {
    "job_id": "3903432676",
    "job_title": "Health Information Technology Specialist - Oncology",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "***THIS IS 100% REMOTE OPPORTUNITY, WORKING EAST COAST HOURS.***\n\nON BEHALF OF OUR CLIENT, YOU WILL BE RESPONSIBLE FOR IDENTIFYING OPPORTUNITIES FOR IMPROVEMENT WITHIN ELECTRONIC HEALTH RECORD (EHR) SYSTEMS WITH GOALS RELATED TO PATIENT CARE, ACCESS, TREATMENT PROCESSES, PATIENT IDENTIFICATION, AND ULTIMATELY TO IMPROVE THE END USER’S EXPERIENCE.\n\nAS A HEALTH IT SPECIALIST, YOU WILL PROVIDE SUPPORT TO THE HEALTHCARE TEAM; PHYSICIANS, CLINICIANS, HEALTHCARE WORKERS, AFFILIATES, AND PARTNERS BY PROVIDING CONTINUOUS TROUBLESHOOTING AND IDENTIFYING OPPORTUNITIES FOR CLINICAL INFORMATION SYSTEM IMPROVEMENTS.\n\nESSENTIAL FUNCTIONS OF THE JOB INCLUDE BUT ARE NOT LIMITED TO:\n\nASSIST PRIORITY IDN’S AND HEALTH SYSTEMS IN IDENTIFYING POTENTIAL GAPS/BARRIERS WITHIN EHR SYSTEMSPROBLEM SOLVE AND PROVIDE POTENTIAL SOLUTIONS AND RESOLUTION OF EHR GAPSWORKS COLLABORATIVELY WITH CUSTOMERS INCLUDING END USERS, LICENSED CLINICIANS, IT, INFORMATICS TEAM, EHR MANAGER AND ANALYST TO ENSURE PATIENT SAFETY GAPS ARE IDENTIFIED AS IT PERTAINS TO PRODUCTALIGN RESOURCES IN ORDER TO DEVELOP COMPREHENSIVE PLANS BY PRIORITY INSTITUTIONCOMPLETE NEEDS ASSESSMENT WITH INSTITUTIONAL CUSTOMERS IN ORDER TO ADDRESS PATIENT SAFETY GAPS IN THE EHR DEVELOP AND IMPLEMENT COMPREHENSIVE CUSTOMER SPECIFIC PLANSWILL ACT AS MATRIX TEAM HEALTH IT SPECIALIST SUBJECT MATTER EXPERT TO BOTH INTERNAL AND EXTERNAL STAKEHOLDERSRESPONSIBLE FOR IDENTIFICATION AND SHARING OF HEALTH IT INSIGHTS WITH APPROPRIATE STAKEHOLDERS (MARKETING/ACCESS/SALES)ASSIST CUSTOMERS IN OPTIMIZING EHR SYSTEMS IN ORDER TO ADDRESS GAPS IN PATIENT CARE INCLUDING INPATIENT, OUTPATIENT, AND EMERGENCY DEPARTMENT \n\nMINIMUM REQUIRED\n\nBACHELOR'S DEGREE FROM AN ACCREDITED COLLEGE/UNIVERSITY REQUIRED;MINIMUM OF 5 YEARS WORKING IN DESIGN, BUILD, AND/OR TESTING EXPERTISE AND EXPERIENCE WITH EHR SOFTWARE, INCLUDING: EPIC BEACON, CERNER, IKNOWMED, ONCOEMR TECH, PREFERRED; AND/OR WITHIN A HEALTH SYSTEM INFORMATICS GROUP OR TEAM AT LEADERSHIP LEVEL, OR SIMILAR ROLE WITHIN A PHARMACEUTICAL COMPANY REQUIRED\n\nQUALIFICATIONS\n\nCLINICAL IT EXPERIENCE, PHARMACY IT, OR NURSING INFORMATICS, PREFERREDIN DEPTH KNOWLEDGE OF HEALTHCARE AND CLINICAL INFORMATICS, INTEROPERABILITY, SOFTWARE BUILD (INCLUDING PACS), AND/OR OPTIMIZATION TECHNIQUESABILITY TO DISCOVER ISSUES, PRIORITIZE AND PROBLEM SOLVE TO RESOLUTIONIDENTIFY POTENTIAL GAPS/BARRIERS WITHIN EHR SYSTEMS AT PRIORITY IDNS AND HEALTH SYSTEMSTEAM PLAYER WITH THE WILLINGNESS/ABILITY TO WORK IN A MATRIX ENVIRONMENTEXCELLENT PRESENTATION SKILLSSTRONG ORAL AND WRITTEN COMMUNICATION SKILLSENTHUSIASTIC, POSITIVE ATTITUDE, FLEXIBILITYABILITY TO CONSISTENTLY TRAVEL OVERNIGHT \n\nPREFERRED\n\nPHARM. D, OR MASTER’S DEGREE\n\nPRECISION IS REQUIRED BY LAW IN SOME STATES OR CITIES TO INCLUDE A REASONABLE ESTIMATE OF THE COMPENSATION RANGE FOR THIS ROLE. THIS COMPENSATION RANGE TAKES INTO ACCOUNT THE WIDE RANGE OF FACTORS THAT ARE CONSIDERED IN MAKING COMPENSATION DECISIONS INCLUDING BUT NOT LIMITED TO: SKILL SETS, EXPERIENCE AND TRAINING, LICENSURE AND CERTIFICATIONS, AND OTHER BUSINESS AND ORGANIZATIONAL NEEDS. THE DISCLOSED RANGE ESTIMATE HAS NOT BEEN ADJUSTED FOR THE APPLICABLE GEOGRAPHIC DIFFERENTIAL ASSOCIATED WITH THE LOCATION AT WHICH THE POSITION MAY BE FILLED. AT PRECISION, IT IS NOT TYPICAL FOR AN INDIVIDUAL TO BE HIRED AT OR NEAR THE TOP OF THE RANGE FOR THEIR ROLE AND COMPENSATION DECISIONS ARE DEPENDENT ON THE FACTS AND CIRCUMSTANCES OF EACH CASE. THIS ROLE IS ALSO ELIGIBLE FOR A DISCRETIONARY ANNUAL BONUS, HEALTH INSURANCE, RETIREMENT SAVINGS BENEFITS, LIFE INSURANCE AND DISABILITY BENEFITS, PARENTAL LEAVE, AND PAID TIME OFF FOR SICK LEAVE AND VACATION, AMONG OTHER BENEFITS.\n\nREASONABLE ESTIMATE OF THE CURRENT RANGE\n\n$125,000 — $205,100 USD\n\nANY DATA PROVIDED AS A PART OF THIS APPLICATION WILL BE STORED IN ACCORDANCE WITH OUR PRIVACY POLICY. FOR CA APPLICANTS, PLEASE ALSO REFER TO OUR CA PRIVACY NOTICE .\n\nPRECISION MEDICINE GROUP IS AN EQUAL OPPORTUNITY EMPLOYER. EMPLOYMENT DECISIONS ARE MADE WITHOUT REGARD TO RACE, COLOR, AGE, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, VETERAN STATUS OR OTHER CHARACTERISTICS PROTECTED BY LAW. © 2020 PRECISION MEDICINE GROUP, LLC\n\nIF YOU ARE AN INDIVIDUAL WITH A DISABILITY AND REQUIRE A REASONABLE ACCOMMODATION TO COMPLETE ANY PART OF THE APPLICATION PROCESS OR ARE LIMITED IN THE ABILITY OR UNABLE TO ACCESS OR USE THIS ONLINE APPLICATION PROCESS AND NEED AN ALTERNATIVE METHOD FOR APPLYING, YOU MAY CONTACT PRECISION MEDICINE GROUP AT QUESTIONFORHR@PRECISIONMEDICINEGRP.COM .\n\n",
    "job_skill_set": [
      "problem solving",
      "communication",
      "teamwork",
      "flexibility",
      "positive attitude",
      "customer service",
      "EHR software",
      "clinical informatics",
      "interoperability",
      "software build",
      "troubleshooting",
      "needs assessment",
      "Epic Beacon",
      "Cerner",
      "IKNOWMED",
      "OncoEMR Tech",
      "presentation skills"
    ],
    "short_keywords": [
      "assessment",
      "attitude",
      "beacon",
      "build",
      "cerner",
      "clinical",
      "communication",
      "customer",
      "ehr",
      "epic",
      "flexibility",
      "health",
      "iknowmed",
      "informatics",
      "information",
      "informationtechnology",
      "interoperability",
      "needs",
      "oncoemr",
      "oncology",
      "positive",
      "presentation",
      "problem",
      "service",
      "skills",
      "software",
      "solving",
      "specialist",
      "teamwork",
      "tech",
      "technology",
      "troubleshooting"
    ]
  },
  {
    "job_id": "3901345936",
    "job_title": "Information Technology Security Analyst",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "IT SECURITY 2 (GENERAL ANALYST)THE IT SECURITY GENERAL ANALYST SUPPORT THE SECURITY OPERATIONS CONTROLCENTER (SOCC). THE SOCC IS A 24/7/365 OPERATION THAT REQUIRES SHIFTROTATIONS, WEEKEND, AFTER HOURS, OR ON-CALL SUPPORT TO MEET PROGRAMREQUIREMENTS.RESPONSIBILITIESA. RESPONSIBLE FOR TIER 1 SECURITY CONFIGURATION HARDENING, INCIDENT DETECTION/INVESTIGATION AND REPORTING TO MANAGEMENT AND CUSTOMER SECURITYCONTACTS.B. MONITOR SECURITY EVENTS TO IDENTIFY ANOMALIES FOR POSSIBLE INCIDENTS WITHINTHE NETWORK.C. MANAGES SECURITY INFORMATION AND EVENT MANAGEMENT (SIEM)INFRASTRUCTURE AND APPLICATIONS, INCLUDING WORKFLOW MANAGEMENT, THREATHUNTING ASSIGNMENTS, THREAT INTELLIGENCE INGESTS, RULE/ALERT CREATION ANDOPERATIONAL MAINTENANCE.D. USE DEVELOPED SKILLS, TOOLS, AND EXTERNAL RESOURCES TO VALIDATE SECURITY-RELATED EVENTS TO DETERMINE VALIDITY, EXPOSURE OR FALSE POSITIVE CONDITIONS.E. ABILITY TO RETRIEVE, CORRELATE AND ANALYZE EVENT HISTORY, CONFIGURATION FILESAND SYSTEM LOGS TO ASSESS PRESENCE OF ANOMALOUS EVENTS.F. PRODUCE TIME-CRITICAL, TECHNICAL REPORTS TO MANAGEMENT OUTLINING INCIDENTAND POTENTIAL MITIGATION.G. COMMUNICATE WITH SOC AND NETWORK OPERATIONS CENTER (NOC) STAFFABOUT POTENTIAL INCIDENTS, INDICATORS AND/OR WARNINGS.H. TROUBLESHOOT AND EFFECT RESTORATION OF SERVICE-IMPACTING ISSUES AFFECTINGCUSTOMER VPN PERFORMANCE.I. HANDLE TROUBLE CALLS FROM CUSTOMERS AND INTERNAL NETWORK USERS.J. APPLY BASELINE SECURITY CONFIGURATIONS TO NETWORK EQUIPMENT TO HARDEN ORUPDATE TO MEET APPROVED REQUIREMENT BASELINES.K. ABILITY TO PROVIDE ON-CALL SUPPORT ON A ROTATIONAL BASIS AS NEEDED ONWEEKNIGHTS AND WEEKENDS.L. ABILITY TO WORK IN A FAST-PACED OPERATIONAL ENVIRONMENT TO MAINTAINAVAILABILITY AND RESILIENCY OF NETWORK SECURITY SERVICES TO CUSTOMERS.\nREQUIRED QUALIFICATIONS:A. BACHELOR’S DEGREE IN IT OR RELATED FIELD, AND MINIMUM 2 YEARS RELATEDEXPERIENCE; OR A MASTERS’ DEGREE IN IT OR RELATED FIELD.B. MINIMUM OF (1) YEARS' EXPERIENCE IN THE INFORMATION SECURITY FIELD.C. MINIMUM OF (1) YEARS' EXPERIENCE IN THE NETWORK ENGINEERING FIELDS(FIREWALLS, ROUTERS, SWITCHES, VPN).D. ABILITY TO OBTAIN A FAA PUBLIC TRUST SUITABILITY –E. ABILITY TO WORK ONSITE. REMOTE WORK IS NOT POSSIBLE.F. ABILITY TO SUPPORT ON CALL SCHEDULE ROTATIONS. ON CALL REQUIRES THIS CANDIDATETO REPORT ONSITE WITH A RESPONSE TIME OF ONE HOUR MAXIMUM.G. ABILITY TO SUPPORT SHIFT ROTATIONS AND DIFFERENT SCHEDULES WHICH MAY INCLUDEDAY, WEEKEND, EVENING, OR OVERNIGHT SHIFTS.H. ABILITY TO TRAVEL TO DISASTER RECOVERY SITE AND SUPPORT AS NEEDED.4. PREFERRED ADDITIONAL QUALIFICATIONA. UNDERSTANDING OF VARIOUS OPERATING SYSTEMS (E.G., WINDOWS, LINUX, ETC.).B. UNDERSTANDING OF SYSTEM LOGS AND BE FAMILIAR WITH LOG ANALYSIS.C. UNDERSTANDING OF PREDOMINANT CYBER-ATTACK VECTORS (BUFFER OVERFLOW,PHISHING, ETC.).",
    "job_skill_set": [
      "network engineering",
      "technical reporting",
      "communication",
      "problem solving",
      "teamwork",
      "security configuration hardening",
      "incident detection",
      "SIEM",
      "threat hunting",
      "event correlation",
      "log analysis",
      "VPN troubleshooting",
      "operating systems (Windows, Linux)",
      "adaptability",
      "time management",
      "customer service",
      "attention to detail",
      "ability to work under pressure"
    ],
    "short_keywords": [
      "ability",
      "adaptability",
      "analysis",
      "analyst",
      "attention",
      "communication",
      "configuration",
      "correlation",
      "customer",
      "detail",
      "detection",
      "engineering",
      "event",
      "hardening",
      "hunting",
      "incident",
      "information",
      "informationtechnology",
      "linux",
      "log",
      "management",
      "network",
      "operating",
      "pressure",
      "problem",
      "reporting",
      "security",
      "service",
      "siem",
      "solving",
      "systems",
      "teamwork",
      "technical",
      "technology",
      "threat",
      "time",
      "to",
      "troubleshooting",
      "under",
      "vpn",
      "windows",
      "work"
    ]
  },
  {
    "job_id": "3901979568",
    "job_title": "Information Technology System Administrator",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "LHH RECRUITMENT SOLUTIONS IS LOOKING FOR A IT SYSTEM ADMINISTRATOR (WINDOWS) FOR A RAPIDLY GROWING LEND-TECH COMPANY. TO SUPPORT THIS GROWTH, WE ARE SEEKING AN EXPERIENCED IT SYSTEM ADMINISTRATOR TO JOIN OUR TEAM.\nTHIS IS A ON-SITE 5 DAYS A WEEK DIRECT HIRE/W2 POSITION IN LAS VEGAS. NV. \nRESPONSIBILITIES\nAS THE IT SYSTEM ADMINISTRATOR, YOU WILL PLAY A KEY ROLE IN OVERSEEING THE TECHNICAL INFRASTRUCTURE IMPLEMENTATION IN THELAS VEGAS OFFICE. INVOLVES MANAGING AND RESOLVING DAILY SYSTEM AND DESKTOP ISSUES FOR OUR RAPIDLY EXPANDING USER BASE OF 75 EMPLOYEES. YOU WILL ALSO BE RESPONSIBLE FOR THE OVERALL TECHNICAL INFRASTRUCTURE, COVERING DESKTOPS, NETWORKING, PRINTERS, PHONES, AND OTHER EQUIPMENT. ADDITIONAL RESPONSIBILITIES INCLUDE PROCURING AND DEPLOYING COMPUTING EQUIPMENT, ACTIVE DIRECTORY USER MANAGEMENT, MICROSOFT 365 LICENSE MANAGEMENT, AND IMPLEMENTING EFFICIENT ONBOARDING AND TERMINATION PROCESSES. YOUR ROLE EXTENDS TO INVENTORY MANAGEMENT OF HARDWARE AND SOFTWARE ASSETS, AS WELL AS OVERSEEING THE ENTERPRISE SECURITY FRAMEWORK AND DISASTER RECOVERY PLANNING.\nREQUIREMENTS: \nBACHELOR’S DEGREE OR EQUIVALENT TRAINING AND WORK EXPERIENCE 5+ YEARS OF HANDS-ON SYSTEMS ADMINISTRATION EXPERIENCE 3+ YEARS OF STRONG WINDOWS ADMINISTRATION 3+ YEARS OF ACTIVE DIRECTORY MANAGEMENT 3+ YEARS OF EXPERIENCE WITH HARDWARE SUPPORT (IMAGE, TROUBLESHOOT, AND ANSWER QUESTIONS ON LAPTOPS)3+ YEARS OF MANAGING MICROSOFT 365, WITH A FOCUS ON EXCHANGE, TEAMS, AND ONEDRIVE.3+ YEARS OF SOLID CLOUD IAAS MANAGEMENT EXPERIENCE, ESPECIALLY ON AWS OR AZURE.3+ YEARS OF NETWORK ADMINISTRATION, COVERING BOTH ON-PREMISES AND VIRTUAL ENVIRONMENTS.CERTIFICATION IN AWS OR AZURE IS REQUIRED. NICE TO HAVE: MACOSX SUPPORT (DESIRED) AND LINUX (A PLUS).NICE TO HAVE: HUBSPOT AND SAKARI EXPERIENCE IS ADVANTAGEOUS.NICE TO HAVE: PREVIOUS EXPERIENCE IN THE FINANCIAL SERVICES INDUSTRY IS BENEFICIAL.\nEXPECTED SALARY RANGE IS: 80-90K4% OF BASE SALARY CONTRIBUTION FROM COMPANY TO 401K (FULLY VESTED)90% STANDARD MEDICAL, DENTAL, AND VISION COVERAGE FOR EMPLOYEECOVERED CERTIFICATION COURSES",
    "job_skill_set": [
      "Network Administration",
      "Hardware Support",
      "Disaster Recovery Planning",
      "Technical Infrastructure Management",
      "Phone Systems Management",
      "Problem Solving",
      "Communication",
      "Teamwork",
      "Adaptability",
      "Time Management",
      "Customer Service Orientation",
      "Attention to Detail",
      "Organizational Skills",
      "Windows Administration",
      "Active Directory Management",
      "Microsoft 365 Management",
      "Cloud IaaS Management (AWS/Azure)",
      "Inventory Management",
      "Microsoft 365 License Management",
      "Onboarding Processes",
      "Terminal Processes",
      "Printer Management",
      "MacOS Support",
      "Linux Support",
      "HubSpot Experience",
      "Sakari Experience"
    ],
    "short_keywords": [
      "365",
      "active",
      "adaptability",
      "administration",
      "administrator",
      "attention",
      "awsazure",
      "cloud",
      "communication",
      "customer",
      "detail",
      "directory",
      "disaster",
      "experience",
      "hardware",
      "hubspot",
      "iaas",
      "information",
      "informationtechnology",
      "infrastructure",
      "inventory",
      "license",
      "linux",
      "macos",
      "management",
      "microsoft",
      "network",
      "onboarding",
      "organizational",
      "orientation",
      "phone",
      "planning",
      "printer",
      "problem",
      "processes",
      "recovery",
      "sakari",
      "service",
      "skills",
      "solving",
      "support",
      "system",
      "systems",
      "teamwork",
      "technical",
      "technology",
      "terminal",
      "time",
      "to",
      "windows"
    ]
  },
  {
    "job_id": "3901939618",
    "job_title": "Information Technology Support Specialist",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "NOW HIRING FOR A NOBLESVILLE, IN INFORMATION TECHNOLOGY SPECIALIST.\nFOR OVER 20 YEARS, THAT'S GOOD HR HAS PAIRED EMPLOYERS AND JOB SEEKERS IN INDIANAPOLIS AND SURROUNDING AREAS. WE SPECIALIZE IN HANDPICKED PLACEMENTS FOR ACCOUNTING, HR, MEDICAL CODING, EXECUTIVE ASSISTANTS, BOOKKEEPERS, ANALYSTS, RECEPTIONISTS, CUSTOMER SERVICE SPECIALISTS, PROJECT MANAGERS, AND MORE. FROM ENTRY LEVEL TO MANAGEMENT, WE MAKE ARTFUL EMPLOYMENT PLACEMENTS.\nSALARY RANGE: $48,000-$52,000/YEAR\nJOB TYPE: DIRECT HIRE\nRESPONSIBILITIES:INSTALL AND SUPPORT IT FACILITIES AND SUPPORT EMPLOYEE IT RELATED ISSUESRESPONSIBLE FOR IT RELATED INVENTORY MANAGEMENTACT AS THE FIRST POINT OF CONTACT FOR EMPLOYEES ON IT ISSUES TO PROVIDE SUPPORT ON PCS, PRINTERS, PHONES, TVS, ETC.ASSIST IN MAINTAINING DEPARTMENTAL KPISMANAGE IT ONBOARDING FOR NEW HIRES\n\nQUALIFICATIONS:TWO OR MORE YEARS OF EXPERIENCE REQUIREDTRAINING IN VOCATIONAL SCHOOL, RELATED ON THE JOB TRAINING EXPERIENCE OR AN ASSOCIATES DEGREE IN INFORMATION TECHNOLOGY REQUIREDEXPERIENCE WORKING WITH VPN PREFERREDMUST BE PROFICIENT IN MICROSOFT OFFICE SUITE (OUTLOOK, WORD, EXCEL, POWERPOINT) AND ADOBEMUST BE ABLE TO OPERATE A PRINTER, COPY MACHINE, SCANNER AND OTHER OFFICE EQUIPMENTMUST HAVE KNOWLEDGE OF ELECTRONIC EQUIPMENT AND COMPUTER HARDWARE AND SOFTWAREA VALID INDIANA DRIVER'S LICENSE MAY BE REQUIRED\nTHIS IS AN IN OFFICE POSITION. \n\nTHAT'S GOOD HR IS AN AWARD-WINNING STAFFING FIRM FOCUSED ON THE LOCAL INDIANAPOLIS MARKET.\nWHETHER YOU'RE LOOKING FOR A TEMPORARY, PART-TIME, OR FULL-TIME POSITION, OUR SEASONED TEAM WORKS TO CONNECT YOU TO THE RIGHT JOB AT THE RIGHT TIME. LEARN MORE ABOUT US HERE.\nSEE WHAT WE CAN DO FOR YOU-APPLY TODAY!\nSEE A POSITION OR TWO YOU ARE INTERESTED IN? YOU ONLY NEED TO APPLY ONCE WITH THAT'S GOOD HR. WE'LL REVIEW YOUR RESUME WITH ALL OPEN POSITIONS IN MIND.",
    "job_skill_set": [
      "IT support",
      "VPN",
      "computer hardware",
      "computer software",
      "inventory management",
      "communication",
      "problem solving",
      "customer service",
      "teamwork",
      "adaptability",
      "Microsoft Office Suite",
      "office equipment operation"
    ],
    "short_keywords": [
      "adaptability",
      "communication",
      "computer",
      "customer",
      "equipment",
      "hardware",
      "information",
      "informationtechnology",
      "inventory",
      "it",
      "management",
      "microsoft",
      "office",
      "operation",
      "problem",
      "service",
      "software",
      "solving",
      "specialist",
      "suite",
      "support",
      "teamwork",
      "technology",
      "vpn"
    ]
  },
  {
    "job_id": "3905223995",
    "job_title": "Information Technology Project Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "COMPANY DESCRIPTIONECONOMIC IMPACT CATALYST (EIC) IS A SAAS TECHNOLOGY COMPANY THAT PROVIDES ECONOMIC DEVELOPERS WITH THE TOOLS THEY NEED TO EMPOWER ENTREPRENEURS AND IMPROVE OPPORTUNITIES WITHIN THEIR COMMUNITIES. LOCATED IN CLEARWATER, FL, EIC AIMS TO CATALYZE WEALTH BUILDING AND AUTONOMY FOR INDIVIDUALS WHILE MAKING A POSITIVE IMPACT ON THE LOCAL ECONOMY.\nROLE DESCRIPTIONTHIS IS A FULL-TIME ON-SITE ROLE FOR AN INFORMATION TECHNOLOGY PROJECT MANAGER AT ECONOMIC IMPACT CATALYST. THE PROJECT MANAGER WILL BE RESPONSIBLE FOR OVERSEEING AND MANAGING IT PROJECTS, ENSURING THEIR SUCCESSFUL COMPLETION WITHIN THE DEFINED SCOPE, TIMELINE, AND BUDGET. THE DAY-TO-DAY TASKS OF THE ROLE INCLUDE PROJECT PLANNING, PROGRAM MANAGEMENT, AND EFFECTIVE COMMUNICATION WITH STAKEHOLDERS.\nQUALIFICATIONSSTRONG ANALYTICAL SKILLS AND ABILITY TO SOLVE COMPLEX PROBLEMSEXPERIENCE IN PROGRAM MANAGEMENT AND SUCCESSFULLY DELIVERING IT PROJECTSPROFICIENCY IN INFORMATION TECHNOLOGY AND UNDERSTANDING OF TECHNICAL CONCEPTSEXCELLENT COMMUNICATION AND INTERPERSONAL SKILLSEXPERTISE IN PROJECT PLANNING AND ABILITY TO CREATE DETAILED PROJECT PLANSSTRONG ORGANIZATIONAL AND TIME MANAGEMENT SKILLSRELEVANT CERTIFICATIONS SUCH AS PMP OR ITIL ARE PREFERREDEXPERIENCE IN THE ECONOMIC DEVELOPMENT INDUSTRY IS A PLUSBACHELOR'S DEGREE IN COMPUTER SCIENCE, INFORMATION TECHNOLOGY, OR A RELATED FIELD",
    "job_skill_set": [
      "project management",
      "program management",
      "analytical skills",
      "IT project delivery",
      "information technology",
      "project planning",
      "ITIL certification",
      "technical concepts understanding",
      "communication",
      "interpersonal skills",
      "organizational skills",
      "time management",
      "problem solving",
      "PMP certification",
      "computer science"
    ],
    "short_keywords": [
      "analytical",
      "certification",
      "communication",
      "computer",
      "concepts",
      "delivery",
      "information",
      "informationtechnology",
      "interpersonal",
      "it",
      "itil",
      "management",
      "manager",
      "organizational",
      "planning",
      "pmp",
      "problem",
      "program",
      "project",
      "science",
      "skills",
      "solving",
      "technical",
      "technology",
      "time",
      "understanding"
    ]
  },
  {
    "job_id": "3886831114",
    "job_title": "Information Technology Field Engineer",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "VISION RT IS A RAPIDLY EXPANDING MEDTECH COMPANY AT THE FOREFRONT OF TRANSFORMING RADIATION THERAPY. WE ARE THE INVENTORS OF SURFACE GUIDED RADIATION THERAPY (SGRT), WHICH HARNESSES ADVANCED 3D CAMERA SYSTEMS AND SOPHISTICATED AI, COMPUTER VISION, AND MACHINE LEARNING SOFTWARE. OUR MISSION IS TO ENHANCE THE SAFETY, PRECISION, AND COMFORT OF RADIATION THERAPY FOR PATIENTS. NOTABLY, OUR INNOVATIVE SOLUTIONS ARE DEPLOYED ACROSS ALL 15 OF THE PRESTIGIOUS \"BEST HOSPITALS FOR CANCER,\" AS RECOGNIZED BY US NEWS & WORLD REPORT\n\nCOMPANY VIDEO: HTTPS://YOUTU.BE/CI5BRRRP4H0\nWITH AROUND 300 EMPLOYEES GLOBALLY, AND OFFICES IN THE UK, POLAND & US, WE OPERATE AUTONOMOUSLY AS PART OF THE DANISH COMPANY DEMANT A/S, ONE OF THE LARGEST HEALTHCARE COMPANIES IN THE WORLD.\n\n\nTHE ROLE WE HAVE AN EXCITING OPPORTUNITY FOR A PROACTIVE CUSTOMER-FOCUSED FIELD SERVICE ENGINEER TO JOIN OUR TEAM. AS A FIELD SERVICE ENGINEER, YOU WILL BE RESPONSIBLE FOR PROVIDING FIRST-CLASS SERVICE TO OUR CUSTOMERS IN INDIANA. THIS POSITION IS A FIELD ROLE AND YOU WILL BE TRAVELLING 70-80% OF THE TIME TO DIFFERENT HOSPITALS IN THE STATE, YOU ALSO MAY BE REQUIRED TO TRAVEL ALL OVER THE US TO COVER PTO AND ALSO EVENTS AND TRADE SHOWS.\nKEY RESPONSIBILITIES WILL INCLUDEINSTALL, SUPPORT, AND MAINTAIN VISION RT PRODUCT RANGEPERFORM SITE SURVEYS ENSURING ALL ASPECTS OF INSTALLATION REQUIREMENTS ARE MET IN LINE WITH VISION RT PROCESSES AND PROCEDURESPROVIDE REACTIVE BREAKDOWN SUPPORT (REMOTE AND ON SITE)PROVIDE PLANNED MAINTENANCE/ UPGRADE SUPPORT (REMOTE AND ON SITE)PLAN AND PERFORM INSTALLATIONS IN LINE WITH VISION RT INSTALLATION PROCESSES & PROCEDURESLIAISE WITH CUSTOMERS AND OUR INSTALLERSTRAVELLING TO DIFFERENT HOSPITALS THROUGHOUT INDIANA AND OCCASIONALLY OTHER STATES THROUGHOUT THE US (I.E CALIFORNIA, TEXAS, FLORIDA, NEW YORK, ETC)\nESSENTIAL SKILLS & EXPERIENCESTRONG IT BACKGROUND REQUIRED INCLUDING; SUPPORTING MICROSOFT ENVIRONMENT WORKSTATIONS, DEVICE NETWORKING AND DATABASE TROUBLESHOOTING, SUPPORTING EXTERNAL AND INTERNAL CUSTOMERS IN THE FIELD SERVICE ENGINEERS TERRITORY, PC HARDWARE SKILLS INCLUDING REPLACING PC COMPONENTS AND DIAGNOSTICS.HIGHLY MOTIVATED CUSTOMER FOCUSED ENGINEER WITH EXCELLENT CUSTOMER FACING AND TECHNICAL PROBLEM-SOLVING SKILLSCOMFORTABLE INTERFACING WITH CLIENTS AND OTHER STAKEHOLDERS AT ALL LEVELS OF THEIR ORGANIZATIONRESULTS ORIENTATED WITH A “CAN DO” ATTITUDE AND CLEAR ENTHUSIASM FOR EXCELLING IN CUSTOMER SATISFACTIONEXCELLENT FAULT-FINDING SKILLS; TROUBLE SHOOTING UTILIZING EVENT VIEWER; ERROR LOGS; DEBUGEXPERIENCED FIELD ENGINEER WITH ELECTROMECHANICAL AND IT SKILLS, IDEALLY FROM MEDICAL OR IT INDUSTRYABILITY TO DRILL AND MOUNT, MECHANICAL BRACKETRY IN RAISED CEILINGSABILITY TO READ AND WORK WITH TECHNICAL DRAWINGS AND ARCHITECTS’ DRAWINGS\n\nDESIRABLE SKILLS & EXPERIENCEA+ AND MICROSOFT CERTIFICATIONS A PLUSSQL KNOWLEDGE IS PREFERREDMEDICAL DEVICES, IDEALLY MEDICAL IMAGING OR RADIOTHERAPY",
    "job_skill_set": [
      "Microsoft Environment Support",
      "Microsoft Certifications",
      "Customer Focus",
      "Communication",
      "Motivation",
      "Enthusiasm",
      "Interfacing with Clients",
      "Teamwork",
      "Device Networking",
      "Database Troubleshooting",
      "PC Hardware Skills",
      "Electromechanical Skills",
      "Technical Drawings Interpretation",
      "SQL Knowledge",
      "Medical Devices Knowledge",
      "A+ Certification",
      "Problem Solving",
      "Results Orientation",
      "Fault-Finding Skills"
    ],
    "short_keywords": [
      "a",
      "certification",
      "certifications",
      "clients",
      "communication",
      "customer",
      "database",
      "device",
      "devices",
      "drawings",
      "electromechanical",
      "engineer",
      "enthusiasm",
      "environment",
      "faultfinding",
      "field",
      "focus",
      "hardware",
      "information",
      "informationtechnology",
      "interfacing",
      "interpretation",
      "knowledge",
      "medical",
      "microsoft",
      "motivation",
      "networking",
      "orientation",
      "pc",
      "problem",
      "results",
      "skills",
      "solving",
      "sql",
      "support",
      "teamwork",
      "technical",
      "technology",
      "troubleshooting",
      "with"
    ]
  },
  {
    "job_id": "3901948361",
    "job_title": "Information Technology Service Desk Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "SUMMARY: THE SUPERVISOR, IT SERVICE MANAGEMENT ROLE IS TO OVERSEE SERVICE DESK STAFF AND ENSURE END USERS ARE RECEIVING THE APPROPRIATE ASSISTANCE AS DEFINED WITHIN GUIDELINES AND SERVICE LEVEL AGREEMENT (SLA). THIS INCLUDES COORDINATION OF HELPDESK FUNCTIONS, AND INTERFACE WITH BUSINESS CHANNEL PARTNERS AS AN ESCALATION POINT OF CONTACT. THE SUPERVISOR, IT SERVICE MANAGEMENT IS RESPONSIBLE FOR MONITORING AND TRACKING THE PRIORITIZATION OF SERVICE REQUESTS, PROVIDE FIRSTHAND DESKTOP LEVEL SUPPORT AND CONTRIBUTE TO END USER RESOLUTIONS.ESSENTIAL JOB FUNCTIONS:MANAGE, TRAIN, COACH AND MENTOR SERVICE DESK STAFF. MANAGE THE PROCESSING OF INCOMING CALLS AND INTERACTIONS ACCORDING TO CALL GUIDELINES AND SERVICE DESK SOP (STANDARD OPERATING PROCEDURE).ENSURE STAFF ADHERE TO SERVICE DESK ETIQUETTE THROUGHOUT ALL METHODS OF COMMUNICATION (EMAIL, CHAT, PHONE, TEAMS).ENSURE STAFF COMPLY WITH SERVICE DESK POLICIES AND PROCEDURES, AND COMPLETE REQUIRED AND ASSIGNED COMPLIANT COURSES.IDENTIFY, RECOMMEND, DEVELOP, AND IMPLEMENT END USER TRAINING PROGRAMS TO INCREASE COMPUTER LITERACY AND SELF-SUFFICIENCY.ASSESS NEED FOR ANY SUPPORT SYSTEM / PROCESS IMPROVEMENTS (MINOR OR SIGNIFICANT) AND MAKE RECOMMENDATIONS.OVERSEE THE IMPLEMENTATION, AND ADMINISTRATION OF SERVICE DESK STAFF TRAINING PROCEDURES AND POLICIES.ACTIVELY MONITORS STAFF PERFORMANCE, MANAGE STAFF SCHEDULING, CONDUCT QUARTERLY PERFORMANCE REVIEW, MAKES STAFF RECOMMENDATIONS RELATIVE TO PERFORMANCE GOALS, IMPROVEMENT, AND CAREER DEVELOPMENT.OVERSEE DEVELOPMENT AND DISSEMINATION OF HELP SHEETS, FAQS, AND KNOWLEDGEBASE ARTICLES (KB) FOR END USERS.CONDUCT INTERVIEWS, SCREEN NEW HIRES AND COMPLETE ONBOARDING OR TERMINATION PROCESSES.ENSURE STAFF PROVIDE TIMELY AND EFFECTIVE RESOLUTION IN RESPONSE TO END USER REQUESTS.TRACK AND ANALYZE TRENDS IN SERVICE DESK REQUESTS AND GENERATE STATISTICAL REPORTS.MAINTAIN REGULAR AND PUNCTUAL ATTENDANCE.",
    "job_skill_set": [
      "Service Desk Management",
      "Desktop Support",
      "Training and Development",
      "Performance Monitoring",
      "Statistical Reporting",
      "SOP Compliance",
      "Knowledgebase Management",
      "Leadership",
      "Communication",
      "Coaching",
      "Problem Solving",
      "Time Management",
      "Teamwork",
      "Customer Service Orientation"
    ],
    "short_keywords": [
      "and",
      "coaching",
      "communication",
      "compliance",
      "customer",
      "desk",
      "desktop",
      "development",
      "information",
      "informationtechnology",
      "knowledgebase",
      "leadership",
      "management",
      "manager",
      "monitoring",
      "orientation",
      "performance",
      "problem",
      "reporting",
      "service",
      "solving",
      "sop",
      "statistical",
      "support",
      "teamwork",
      "technology",
      "time",
      "training"
    ]
  },
  {
    "job_id": "3901346483",
    "job_title": "Information Technology Procurement Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "THE PROCUREMENT MANAGER - INFORMATION TECHNOLOGY AT INTRADO IS A PIVOTAL ROLE THAT ORCHESTRATES THE PROCUREMENT OPERATIONS WITHIN THE IT SPECTRUM. TASKED WITH STEERING THE PROCUREMENT STRATEGY, THIS ROLE IS INSTRUMENTAL IN ACHIEVING COST EFFICIENCIES AND OPTIMIZING SUPPLIER ENGAGEMENT THROUGH METICULOUS MANAGEMENT OF THE PROCUREMENT LIFECYCLE. THE INCUMBENT WILL SPEARHEAD INITIATIVES FOR COST REDUCTION AND AVOIDANCE, WHILE ALSO ENSURING SUPPLIER DIVERSITY AND RATIONALIZATION. ADEPT AT CONDUCTING COMPREHENSIVE MARKET ANALYSIS, THE PROCUREMENT MANAGER WILL CRAFT AND OVERSEE THE EXECUTION OF RFPS, PINPOINT STRATEGIC SUPPLIERS, AND NEGOTIATE CONTRACTS THAT ALIGN WITH INTRADO'S FINANCIAL AND OPERATIONAL OBJECTIVES. THIS ROLE DEMANDS A PROACTIVE APPROACH TO TRANSLATING COMPLEX ANALYSES INTO ACTIONABLE STRATEGIES, ENSURING THAT PROCUREMENT ACTIVITIES BOLSTER CORPORATE GOALS. AS A SUBJECT MATTER EXPERT, THE PROCUREMENT MANAGER WILL SERVE AS A CONSULTATIVE AUTHORITY, GUIDING THE COMPANY THROUGH THE INTRICACIES OF SOURCING AND PROCUREMENT WITH A FOCUS ON DELIVERING VALUE AND FOSTERING ROBUST SUPPLIER RELATIONSHIPS.\nWHAT YOU'LL DO (JOB RESPONSIBILITIES):DEVELOP AND EXECUTE STRATEGIC PLANS TO IMPROVE PROCUREMENT PROCESSES, REDUCE COSTS, AND OPTIMIZE VALUE IN IT ACQUISITIONS.LEAD THE NEGOTIATION AND MANAGEMENT OF CONTRACTS WITH IT VENDORS, ENSURING COMPLIANCE WITH COMPANY POLICIES AND LEGAL REQUIREMENTS.ANALYZE MARKET TRENDS AND TECHNOLOGICAL ADVANCEMENTS TO INFORM PROCUREMENT STRATEGIES AND IDENTIFY POTENTIAL NEW SUPPLIERS.COLLABORATE WITH IT DEPARTMENT HEADS TO UNDERSTAND THEIR PROCUREMENT NEEDS AND TAILOR SOURCING STRATEGIES ACCORDINGLY.OVERSEE THE ENTIRE PROCUREMENT LIFECYCLE, FROM REQUISITION TO PAYMENT, ENSURING EFFICIENCY AND ACCURACY IN ORDER PROCESSING.MANAGE AND MENTOR PROCUREMENT TEAM MEMBERS, FOSTERING A CULTURE OF CONTINUOUS IMPROVEMENT AND PROFESSIONAL DEVELOPMENT.IMPLEMENT AND OVERSEE COMPLIANCE WITH PROCUREMENT POLICIES AND PROCEDURES, ENSURING ETHICAL PRACTICES AND ADHERENCE TO BUDGETS.MONITOR SUPPLIER PERFORMANCE AGAINST SERVICE LEVEL AGREEMENTS AND KEY PERFORMANCE INDICATORS, TAKING CORRECTIVE ACTION AS NECESSARY.ENGAGE IN RISK MANAGEMENT FOR IT PROCUREMENT ACTIVITIES, IDENTIFYING POTENTIAL ISSUES AND DEVELOPING MITIGATION STRATEGIES.REPORT TO SENIOR MANAGEMENT ON PROCUREMENT ACTIVITIES, SAVINGS ACHIEVED, AND CHALLENGES FACED, PROVIDING ACTIONABLE INSIGHTS FOR DECISION-MAKING.STAY ABREAST OF LEGAL AND REGULATORY CHANGES AFFECTING IT PROCUREMENT AND ADJUST PRACTICES TO MAINTAIN COMPLIANCE.\nWHAT YOU BRING (QUALIFICATIONS):MINIMUM EDUCATION:BACHELOR'S DEGREE IN BUSINESS ADMINISTRATION, INFORMATION TECHNOLOGY, SUPPLY CHAIN MANAGEMENT, OR A RELATED FIELD IS PREFERRED. EQUIVALENT PROFESSIONAL EXPERIENCE IN A SIMILAR ROLE MAY BE CONSIDERED.MINIMUM EXPERIENCE:A MINIMUM OF 5 YEARS OF EXPERIENCE IN TECHNOLOGY SOURCING OR PROCUREMENT, WITH A FOCUS ON IT AND TELECOMMUNICATIONS.DEMONSTRABLE EXPERIENCE IN A MANAGERIAL PROCUREMENT ROLE, OVERSEEING IT-RELATED ACQUISITIONS.PROFICIENCY IN CREATING AND MANAGING PRESENTATIONS USING MICROSOFT POWERPOINT.KNOWLEDGE, SKILLS & ABILITIES: DEMONSTRATED ABILITY TO COLLABORATE EFFECTIVELY WITH VARIOUS LEVELS OF MANAGEMENT, INCLUDING EXECUTIVE TEAMS.SOLID EXPERIENCE IN CONDUCTING RFPS AND RFXS WITHIN THE IT SECTOR.IN-DEPTH KNOWLEDGE OF TELECOMMUNICATIONS AND IT PROCUREMENT.EXCEPTIONAL ORGANIZATIONAL AND INTERPERSONAL SKILLS.ADVANCED ANALYTICAL AND PROBLEM-SOLVING ABILITIES.EXCELLENT COMMUNICATION SKILLS, BOTH VERBAL AND WRITTEN, WITH A PROVEN TRACK RECORD OF INFLUENCING DECISIONS.ADEPT AT WORKING IN A TEAM ENVIRONMENT AND FOSTERING COLLABORATION AMONG PEERS.PROFICIENT IN PROCESS MANAGEMENT AND DOCUMENTATION, WITH A FOCUS ON EFFICIENCY AND ACCURACY.STRATEGIC MINDSET WITH THE ABILITY TO ANTICIPATE FUTURE NEEDS AND TRENDS IN IT PROCUREMENT.EXPERIENCE IN CONTRACT NEGOTIATION AND UNDERSTANDING OF CONTRACT TERMS.ABILITY TO MANAGE MULTIPLE CONTRACTS SIMULTANEOUSLY, WITH STRONG NEGOTIATION SKILLS.INTERMEDIATE TO ADVANCED PROFICIENCY IN MICROSOFT OFFICE SUITE (POWERPOINT, EXCEL, WORD).FAMILIARITY WITH PROJECT MANAGEMENT TOOLS SUCH AS SMARTSHEET IS HIGHLY DESIRABLETRAVEL REQUIREMENTS: THIS POSITION MAY REQUIRE LIMITED TRAVEL.\nCOMPENSATION & BENEFITSWANT TO LOVE WHERE YOU WORK? AT INTRADO, WE OFFER A COMPREHENSIVE BENEFITS PACKAGE THAT INCLUDES WHAT YOU’D EXPECT (MEDICAL, DENTAL, VISION, LIFE AND DISABILITY COVERAGE, PAID TIME OFF, A 401(K) RETIREMENT PLAN WITH COMPANY MATCH AND FLEXIBLE SPENDING ACCOUNTS), AND SEVERAL THAT GO ABOVE AND BEYOND – TUITION REIMBURSEMENT, PAID PARENTAL LEAVE, ACCESS TO A ROBUST LIBRARY OF PERSONAL AND PROFESSIONAL TRAINING RESOURCES, EMPLOYEE DISCOUNTS, CRITICAL ILLNESS, HOSPITAL INDEMNITY AND PET INSURANCES, IDENTITY PROTECTION AND MORE! APPLY TODAY TO JOIN US IN WORK WORTH DOING!\nSTARTING SALARY FOR THIS POSITION IS EXPECTED BETWEEN $90,000-110,000 A YEAR",
    "job_skill_set": [
      "Microsoft PowerPoint",
      "Microsoft Office Suite",
      "process management",
      "project management tools",
      "communication",
      "teamwork",
      "problem solving",
      "leadership",
      "analytical thinking",
      "collaboration",
      "organizational skills",
      "strategic thinking",
      "mentoring",
      "procurement strategy",
      "contract negotiation",
      "market analysis",
      "RFPS and RFXS",
      "IT procurement",
      "supplier management",
      "risk management"
    ],
    "short_keywords": [
      "analysis",
      "analytical",
      "and",
      "collaboration",
      "communication",
      "contract",
      "information",
      "informationtechnology",
      "it",
      "leadership",
      "management",
      "manager",
      "market",
      "mentoring",
      "microsoft",
      "negotiation",
      "office",
      "organizational",
      "powerpoint",
      "problem",
      "process",
      "procurement",
      "project",
      "rfps",
      "rfxs",
      "risk",
      "skills",
      "solving",
      "strategic",
      "strategy",
      "suite",
      "supplier",
      "teamwork",
      "technology",
      "thinking",
      "tools"
    ]
  },
  {
    "job_id": "3900983139",
    "job_title": "Information Technology Consultant",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "CLM/ CONTRACT LIFECYCLE MGMT SME (CONSULTANT) 4-5 MONTH CONTRACTLOCATION: 100% REMOTE USA\nCONDUCT A CURRENT STATE ANALYSIS ON ITS CONTRACTS LIFECYCLE MANAGEMENT (CLM) FUNCTIONS AND PROCESS.THERE IS NO CURRENT CLM SO THEY WILL BE BUILDING FROM SCRATCHPROVIDE A ROADMAP AND STRATEGIC GUIDANCE BASED ON FINDINGS FOR A MODERN DIGITAL FUTURE STATE.PARTICIPATE IN THE VENDOR SELECTION PROCESS FOR A VENDOR FOR A NEW CLM.REVIEW RFP RESPONSES AND PREPARE FOLLOW UP QUESTIONS FOR VENDORS AND PRESENT RECOMMENDATIONSPREPARE/REVISE DEMO SCRIPT - PREPARE DEMO SCRIPT BASED ON CONTRACTS LIFECYCLE MANAGEMENT AND ITS USE CASES FOR VENDORS TO USE IN TAILORED DEMOS.EVALUATE CLIENTS CLM CURRENT STATE TO DOCUMENT AREAS FOR DIGITALIZATION/TRANSFORMATION TO A MODERN, AUTOMATED FUTURE STATE.EVALUATE CLIENTS WORKFLOW AND PROCESS AND MAKE RECOMMENDATIONS ON HOW TO ACHIEVE AN APPROPRIATE AND EFFICIENT ROLL OUT PLAN AND ROADMAPPREPARE/REVISE WRITTEN REQUIREMENTS FOR SUCCESS CRITERIA TO JOINTLY PREPARE IMPLEMENTATION PLANS WITH THE SELECTED VENDOR.PROVIDE DOMAIN EXPERTISE TO ALIGN MODULE CONFIGURATION.PERFORM FUNCTIONAL TESTING AS IT RELATES TO SYSTEMS REQUIREMENTS, ANALYSIS, CONFIGURATION, DESIGN, AND DEPLOYMENT.WORK WITH THE TEAM TO DEFINE THE SUCCESS METRICS (KPIS) AND ENGINEERING PRIORITIZATION FOR PRODUCT STORIES.COLLABORATE WITH CROSS FUNCTIONAL STAKEHOLDERS TO DESIGN AND BUILD REQUIREMENTS FOR THE LAUNCH, WHILE ENSURING COMMUNICATION OF TARGET ACHIEVEMENT AND POTENTIAL OBSTACLESPROVIDE DESIGN REQUIREMENTS AND PARTNER WITH PRODUCT TEAMS AND STAKEHOLDERS TO DELIVER TOWARDS ROADMAP.PROVIDE CONSULTING AND BEST PRACTICES AROUND CLM.TRACK AND REPORT PROGRESS OF DELIVERABLES, MILESTONES, AREAS OF RISK AND POTENTIAL DISRUPTION OR BUSINESS CHALLENGES TO CLIENT STAKEHOLDERS.SOMEONE WHO HAS GROWN UP WITHIN A TECHNOLOGY ENVIRONMENT VS. LEGAL OPS.\nKEYS TO SUCCESSSTRONG DOMAIN KNOWLEDGE WITH CONTRACTS LIFECYCLE MANAGEMENT TOOLS AND PROCESSES EXAMPLE OF TOOLS: IRONCLAD, DOCUSIGN, EDGYLOFT, ICERTIS, ETCHAS BEEN THROUGH THE VENDOR SELECTION PROCESS AND HAS DRIVEN AN RFP FOR CLMHAS DRIVEN MODULE IMPLEMENTATION OR INTEGRATION WITH SALESFORCE CPQ AND CLMWORKED ON DESIGN/CONFIGURATION AND HAS DRIVEN END TO END TESTING\nGENERAL COMMENTSSTRONG DOMAIN KNOWLEDGE WITHIN THE CLM SPACE (CONTRACTS LIFECYCLE MANAGEMENT) IN LARGE ENVIRONMENTS.SOMEONE WHO HAS DRIVEN THE RFP AND SELECTION PROCESS FOR A CLM\n80-90/HR W-2, C2C IS AVAILABLE BUT NOT THROUGH 3RD PARTY VENDORS. IF YOU HAVE YOUR OWN LLC, COOL!\nSKILLS, EXPERIENCE, AND OTHER COMPENSABLE FACTORS WILL BE CONSIDERED WHEN DETERMINING PAY RATE. THE PAY RANGE PROVIDED IN THIS POSTING REFLECTS A W2 HOURLY RATE; OTHER EMPLOYMENT OPTIONS MAY BE AVAILABLE THAT MAY RESULT IN PAY OUTSIDE OF THE PROVIDED RANGE.\nW2 EMPLOYEES OF ELIASSEN GROUP WHO ARE REGULARLY SCHEDULED TO WORK 30 OR MORE HOURS PER WEEK ARE ELIGIBLE FOR THE FOLLOWING BENEFITS: MEDICAL (CHOICE OF 3 PLANS), DENTAL, VISION, PRE-TAX ACCOUNTS, OTHER VOLUNTARY BENEFITS INCLUDING LIFE AND DISABILITY INSURANCE, 401(K) WITH MATCH, AND SICK TIME IF REQUIRED BY LAW IN THE WORKED-IN STATE/LOCALITY.\nPLEASE BE ADVISED- IF ANYONE REACHES OUT TO YOU ABOUT AN OPEN POSITION CONNECTED WITH ELIASSEN GROUP, PLEASE CONFIRM THAT THEY HAVE AN ELIASSEN.COM EMAIL ADDRESS AND NEVER PROVIDE PERSONAL OR FINANCIAL INFORMATION TO ANYONE WHO IS NOT CLEARLY ASSOCIATED WITH ELIASSEN GROUP. IF YOU HAVE ANY INDICATION OF FRAUDULENT ACTIVITY, PLEASE CONTACT INFOSEC@ELIASSEN.COM.",
    "job_skill_set": [
      "Contract Lifecycle Management (CLM)",
      "Vendor Selection Process",
      "Digital Transformation",
      "Requirements Gathering",
      "Process Analysis",
      "Project Management",
      "Stakeholder Communication",
      "Best Practices Consulting",
      "Risk Management",
      "Collaboration",
      "Problem Solving",
      "Communication",
      "Analytical Thinking",
      "Adaptability",
      "Attention to Detail",
      "Strategic Thinking",
      "Leadership",
      "RFP Management",
      "Functional Testing",
      "Salesforce CPQ Integration",
      "Module Configuration",
      "Automation Tools",
      "KPI Definition",
      "Demo Script Preparation"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "analytical",
      "attention",
      "automation",
      "best",
      "clm",
      "collaboration",
      "communication",
      "configuration",
      "consultant",
      "consulting",
      "contract",
      "cpq",
      "definition",
      "demo",
      "detail",
      "digital",
      "functional",
      "gathering",
      "information",
      "informationtechnology",
      "integration",
      "kpi",
      "leadership",
      "lifecycle",
      "management",
      "module",
      "practices",
      "preparation",
      "problem",
      "process",
      "project",
      "requirements",
      "rfp",
      "risk",
      "salesforce",
      "script",
      "selection",
      "solving",
      "stakeholder",
      "strategic",
      "technology",
      "testing",
      "thinking",
      "to",
      "tools",
      "transformation",
      "vendor"
    ]
  },
  {
    "job_id": "3891808184",
    "job_title": "Sr Mgr, IT - Delivery Information Technology,",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "VANTIVE: A NEW COMPANY BUILT ON OUR LEGACY\n\nBAXTER IS ON A JOURNEY TO SEPARATE OUR ~$5B KIDNEY CARE SEGMENT INTO A STANDALONE COMPANY. VANTIVE* WILL BUILD ON OUR NEARLY 70-YEAR LEGACY IN ACUTE THERAPIES AND HOME AND IN-CENTER DIALYSIS TO PROVIDE BEST-IN-CLASS CARE TO THE PEOPLE WE SERVE. WE BELIEVE VANTIVE WILL NOT ONLY BUILD OUR LEADERSHIP IN THE KIDNEY CARE SPACE, IT WILL ALSO OFFER MEANINGFUL WORK TO THOSE WHO JOIN US.\n\nAT VANTIVE, YOU WILL BECOME PART OF A COMMUNITY OF PEOPLE WHO ARE FOCUSED, COURAGEOUS AND DON’T SETTLE FOR THE MEDIOCRE. EACH OF US ARE DRIVEN TO HELP IMPROVE PATIENTS’ LIVES WORLDWIDE. JOIN US AS WE REVOLUTIONIZE KIDNEY CARE AND OTHER VITAL ORGAN SUPPORT.\n\nCOMPLETION OF THE PROPOSED SEPARATION OF KIDNEY CARE FROM BAXTER INTO A STANDALONE COMPANY (TO BE NAMED VANTIVE) REMAINS SUBJECT TO THE SATISFACTION OF CUSTOMARY CONDITIONS.\n\nYOUR ROLE AT BAXTER\n\nTHIS IS WHERE MY EXPERTISE DRIVES BUSINESS INNOVATION\n\nTHE SR MANAGER, IT - DELIVERY INFORMATION TECHNOLOGY ROLE WILL BE FOCUSED ON DELIVERING A QUALITY SOLUTION DELIVERY PROCESS TO INCLUDE APPLICATION DEVELOPMENT AND CONFIGURATIONS THAT ENABLE END-TO-END BUSINESS PROCESSES.\n\nYOU WILL WORK ALONGSIDE THE BUSINESS PROCESS OWNER (BPO) TEAM ON THE PROGRAM TO ENSURE THAT THE BUSINESS OPERATIONS CAN FUNCTION WITH THE NEW TECHNOLOGY SOLUTION. THE PERSON WILL PARTNER WITH BPO TO ENSURE THAT THE SOLUTION WILL MEET PROGRAM GUIDING PRINCIPLES AND BUSINESS REQUIREMENTS TO SUPPORT THE KCO CUSTOMERS, PATIENTS AND INTERNAL CLIENTS.\n\nYOUR TEAM\n\nTEAMS WILL BE ORGANIZED BY PROCESS TOWER AND INCLUDE INTERNAL TEAMS THAT WILL PARTNER WITH SYSTEM INTEGRATION ORGANIZATION THAT WILL BRING EXPERTS AND TEAMS TO ENSURE SUCCESSFUL DEVELOPMENT OF THE BUSINESS PROCESS SOLUTION. THIS ROLE WILL SUPPORT GUIDING PRINCIPLES OF THE PROGRAM TO APPLY SOLUTION STANDARD PROCESSES AND OUT OF THE BOX SOLUTIONS TO ENSURE SPEED IN DELIVERING THE SOLUTION.\n\nTHE TEAM WILL SEE DEVELOPMENT CYCLE THROUGH UNIT TESTING, END TO END TESTING, PERFORMANCE AND UNIT TESTING ALL THE WAY THROUGH TO SUCCESSFUL DEPLOYMENT INTO PRODUCTION. THE TEAM WILL ALSO SUPPORT THE HYPERCARE PROCESS FOR EACH DEPLOYMENT TO ENSURE SUCCESS METRICS ARE MET.\n\nWHAT YOU'LL BE DOING\n\nTHE IDL ROLE IS RESPONSIBLE FOR DESIGNING, DEVELOPING, IMPLEMENTING AND SUPPORTING APPLICATIONS, SYSTEMS AND IT PRODUCTS REQUIRED TO ACHIEVE THE COMPANY'S BUSINESS OBJECTIVES.PROVIDES COLLABORATIVE LEADERSHIP IN MATRIX PROGRAM ORGANIZATION TO ASSIGNED TEAM INCLUDING INTERNAL AND EXTERNAL CONSULTANTS.MANAGE TO SCOPE, SCHEDULE, QUALITY OF DEFINED PROGRAM TIMELINE AND BUDGET.DEVELOP AND IMPLEMENTS POLICIES AND PROCEDURES TO ACHIEVE PROGRAM GOALS.PROVIDE OVERALL LEADERSHIP WITH PARTNERS TO DELIVER ON COMMITMENTS WITHIN PROCESS TOWER.POSITION WILL MANAGE DECISIONS THAT HAVE AN EXTENDED IMPACT ON WORK PROCESSES, OUTCOMES, AND EXTERNAL PARTNERS AND CUSTOMERS / PATIENTS.COLLABORATE WITH INTERNAL AND/OR EXTERNAL LEADERS, INCLUDING SENIOR MANAGEMENT.PROVIDE STRATEGIC CONSULTING ON TECHNICAL AND PROCESS IMPACT TO ORGANIZATION, RELATED TECHNOLOGIES AND IMPLEMENTATION / DEPLOYMENT STRATEGIES.GENERATE SOLUTIONS TO ISSUES DAILY.ENSURES EMPLOYEES AND TEAMMATES OPERATE WITHIN PROGRAM GUIDELINES AND PROVIDE EFFECTIVE MENTORING.PLAN AND COMPLETE SYSTEM IMPLEMENTATIONS THAT ENSURE SUCCESS AND MINIMIZE RISK OF SYSTEM OUTAGES OR OTHER NEGATIVE PRODUCTION IMPACTS.\n\nWHAT YOU'LL BRING\n\nBACHELOR’S DEGREE IN COMPUTER SCIENCE, ENGINEERING, MIS, OR BUSINESS REQUIRED.10+ YEARS OF EXPERIENCE IN ENGINEERING OR RELATED TECHNOLOGY ROLES.PREVIOUS LARGE TRANSFORMATION ERP PROGRAM EXPERIENCE DESIRED.PRIOR LEADERSHIP EXPERIENCE IN MATRIX ENVIRONMENT.PROVEN ABILITY TO SET TECHNOLOGY DIRECTION AND COORDINATE SUCCESSFUL DELIVERY AND/OR SUPPORT OF TECHNOLOGY SOLUTIONS.ABILITY TO DEFINE WORK PROCESSES AND LEAD TEAM MEMBERS IN SUCCESSFUL IMPLEMENTATION.SYSTEMATICALLY DEVELOPS EMPLOYEES THROUGH STRETCH ASSIGNMENTS WITH SPECIFIC COMPETENCY DEVELOPMENT GOALS.SUPPORTS PROMOTION OF OWN PEOPLE WHEN TALENT IS NEEDED ELSEWHERE AND PROVIDES INDIVIDUALS WITH DEVELOPMENT OPPORTUNITIES.COLLABORATING AND INFLUENCING - NEGOTIATES WITH A GENUINE GIVE-AND-TAKE APPROACH, WHERE PARTIES ACT AS TRUE PEERS AND DECISIONS ARE SHARED.FIND OPPORTUNITIES TO BUILD RELATIONSHIPS THAT WILL HELP OTHERS ACHIEVE THEIR GOALS.A CONSULTING BACKGROUND OR EXPERIENCE WITH PROJECT MANAGEMENT CONSIDERED AN ASSET.\n\nBAXTER IS COMMITTED TO SUPPORTING THE NEEDS FOR FLEXIBILITY IN THE WORKPLACE. WE DO SO THROUGH OUR FLEXIBLE WORKPLACE POLICY WHICH INCLUDES A MINIMUM OF 3 DAYS A WEEK ONSITE. THIS POLICY PROVIDES THE BENEFITS OF CONNECTING AND COLLABORATING IN-PERSON IN SUPPORT OF OUR MISSION.\n\nWE UNDERSTAND COMPENSATION IS AN IMPORTANT FACTOR AS YOU CONSIDER THE NEXT STEP IN YOUR CAREER. AT BAXTER, WE ARE COMMITTED TO EQUITABLE PAY FOR ALL EMPLOYEES, AND WE STRIVE TO BE MORE TRANSPARENT WITH OUR PAY PRACTICES. THE ESTIMATED BASE SALARY FOR THIS POSITION IS $144,000 - $198,000 ANNUALLY. THE ESTIMATED RANGE IS MEANT TO REFLECT AN ANTICIPATED SALARY RANGE FOR THE POSITION. WE MAY PAY MORE OR LESS THAN OF THE ANTICIPATED RANGE BASED UPON MARKET DATA AND OTHER FACTORS, ALL OF WHICH ARE SUBJECT TO CHANGE. INDIVIDUAL PAY IS BASED ON UPON LOCATION, SKILLS AND EXPERTISE, EXPERIENCE, AND OTHER RELEVANT FACTORS. THIS POSITION MAY ALSO BE ELIGIBLE FOR DISCRETIONARY BONUSES. FOR QUESTIONS ABOUT THIS, OUR PAY PHILOSOPHY, AND AVAILABLE BENEFITS, PLEASE SPEAK TO THE RECRUITER IF YOU DECIDE TO APPLY AND ARE SELECTED FOR AN INTERVIEW.\n\nTHE SUCCESSFUL CANDIDATE FOR THIS JOB MAY BE REQUIRED TO VERIFY THAT HE OR SHE HAS BEEN VACCINATED AGAINST COVID-19, SUBJECT TO REASONABLE ACCOMMODATIONS FOR INDIVIDUALS WITH MEDICAL CONDITIONS OR RELIGIOUS BELIEFS THAT PREVENT VACCINATION, AND IN ACCORDANCE WITH APPLICABLE LAW.\n\nEQUAL EMPLOYMENT OPPORTUNITY\n\nBAXTER IS AN EQUAL OPPORTUNITY EMPLOYER. BAXTER EVALUATES QUALIFIED APPLICANTS WITHOUT REGARD TO RACE, COLOR, RELIGION, GENDER, NATIONAL ORIGIN, AGE, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, PROTECTED VETERAN STATUS, DISABILITY/HANDICAP STATUS OR ANY OTHER LEGALLY PROTECTED CHARACTERISTIC.\n\nEEO IS THE LAW\n\nEEO IS THE LAW - POSTER SUPPLEMENT\n\nPAY TRANSPARENCY POLICY\n\nREASONABLE ACCOMMODATIONS\n\nBAXTER IS COMMITTED TO WORKING WITH AND PROVIDING REASONABLE ACCOMMODATIONS TO INDIVIDUALS WITH DISABILITIES GLOBALLY. IF, BECAUSE OF A MEDICAL CONDITION OR DISABILITY, YOU NEED A REASONABLE ACCOMMODATION FOR ANY PART OF THE APPLICATION OR INTERVIEW PROCESS, PLEASE CLICK ON THE LINK HERE AND LET US KNOW THE NATURE OF YOUR REQUEST ALONG WITH YOUR CONTACT INFORMATION.\n\nRECRUITMENT FRAUD NOTICE\n\nBAXTER HAS DISCOVERED INCIDENTS OF EMPLOYMENT SCAMS, WHERE FRAUDULENT PARTIES POSE AS BAXTER EMPLOYEES, RECRUITERS, OR OTHER AGENTS, AND ENGAGE WITH ONLINE JOB SEEKERS IN AN ATTEMPT TO STEAL PERSONAL AND/OR FINANCIAL INFORMATION. TO LEARN HOW YOU CAN PROTECT YOURSELF, REVIEW OUR RECRUITMENT FRAUD NOTICE.\n\n126538\n\n",
    "job_skill_set": [
      "system implementation",
      "project management",
      "IT products support",
      "technology direction setting",
      "configuration management",
      "collaboration",
      "leadership",
      "mentoring",
      "relationship building",
      "problem solving",
      "communication",
      "flexibility",
      "application development",
      "ERP systems",
      "business process design",
      "unit testing",
      "performance testing",
      "negotiation",
      "strategic consulting",
      "influencing"
    ],
    "short_keywords": [
      "application",
      "building",
      "business",
      "collaboration",
      "communication",
      "configuration",
      "consulting",
      "delivery",
      "design",
      "development",
      "direction",
      "erp",
      "flexibility",
      "implementation",
      "influencing",
      "information",
      "informationtechnology",
      "it",
      "leadership",
      "management",
      "mentoring",
      "mgr",
      "negotiation",
      "performance",
      "problem",
      "process",
      "products",
      "project",
      "relationship",
      "setting",
      "solving",
      "sr",
      "strategic",
      "support",
      "system",
      "systems",
      "technology",
      "testing",
      "unit"
    ]
  },
  {
    "job_id": "3906249673",
    "job_title": "Information Technology Sourcing Manager",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "SENIOR TECHNOLOGY SOURCING MANAGERLOCATION: GROVEPORT, OH 43195 OR GALLATIN, TN 37066 (HYBRID – ONSITE 2 DAYS A WEEK – WEDNESDAY AND FLEXIBLE DAY)DURATION: 4 MONTHS, POTENTIAL EXTENSION AND HOPING TO CONVERT TALENT TO PERM EMPLOYEE\nIN THIS ROLE YOU WILL SUPPORT OUR KEY TECHNOLOGY PARTNERS NEEDS IN THE ACQUISITION OF SOLUTIONS, PRODUCTS, AND SERVICES AS YOU DRIVE COST SAVINGS AND INNOVATION. YOU WILL COORDINATE CLOSELY WITH SENIOR LEADERS IN OUR TECHNOLOGY ORGANIZATION IN THE PLANNING AND EXECUTION (RFPS AND NEGOTIATIONS) OF CATEGORY STRATEGIES LEADING TO A HIGH STRATEGIC IMPACT FOR ALL CLIENT BRANDS.\nTHE SR. MANAGER WILL BE RESPONSIBLE FOR DEVELOPING VENDOR RELATIONSHIPS, WHILE DRIVING EFFECTIVE OUTCOMES. THIS INDIVIDUAL WILL LEAD CERTAIN TECHNOLOGY CATEGORIES (HW, SW, CLOUD, SERVICES). IN ADDITION, THE INDIVIDUAL WILL DRIVE CROSS-ORGANIZATIONAL PROCESS EFFORTS SPANNING ACROSS TECHNOLOGY, SOURCING, FINANCE AND LEGAL TEAMS BY INFLUENCING KEY VENDOR RELATIONSHIPS AND DRIVING VITAL INITIATIVES.\nWHAT YOU'LL DO:IMPLEMENT AND REFINE SOURCING STRATEGIES THROUGH STRONG TECHNICAL/FUNCTIONAL KNOWLEDGE, IN SUPPORT OF THE BUSINESS' SHORT-TERM AND LONG-TERM PLANSACHIEVE DEFINED CATEGORY PERFORMANCE TARGETS; HOLD VENDORS ACCOUNTABLE TO PERFORMANCE AGREEMENTS AND IMPLEMENT MITIGATION STRATEGIES AS NEEDEDNEGOTIATE STRATEGIC, HIGH IMPACT, MULTI-BRAND DEALS FOR THE CLIENT AS WELL AS LEAD COMPETITIVE RFXS AND SUPPLIER SELECTIONBUILD AND STRENGTHEN STRATEGIC RELATIONSHIPS: SUCCESSFULLY PARTNER ACROSS FUNCTIONS- LEGAL, FINANCE, TECHNOLOGY AND BRANDS AND EXTERNAL SUPPLIERS TO DRIVE RESULTS AND INFLUENCE CHANGEHAVE SIGNIFICANT TECHNOLOGY SAAS, HARDWARE AND TELECOMMUNICATIONS KNOWLEDGE AND LEVERAGE INDUSTRY EXPERTS, AND STAKEHOLDERS TO IDENTIFY AND BENCHMARK BEST PRACTICESBALANCE SPEED AND URGENCY WITH COST SAVINGS IN VENDOR NEGOTIATIONS AND PROACTIVELY CONSIDER NEW ALTERNATIVES TO OPTIMIZE RESULTSSUPPORT THE CREATION AND IMPLEMENTATION OF PROGRAMS TO ASSESS AND PROMOTE SUPPLIER PERFORMANCE AND DEVELOPMENT.WILL COMPETE UP TO 5 TO 6 PROJECTS CONCURRENTLY.WILL COMPLETE POWERPOINT PRESENTATIONS WITH METRICS AND DATA ANALYSIS TO DETERMINE HOW TO SELL THE DEAL TO LEADERSHIP AND BUILD DATA – BASED ON MARKET INTELLIGENCE AND EXPERIENCE.\nQUALIFICATIONS:7+ YEARS OF EXPERIENCE IN TECHNOLOGY AND STRATEGIC SOURCING WITH ENTERPRISE-LEVEL COMPANIES – SALESFORCE, MICROSOFT, SERVICENOW, ORACLE, ETC.BROAD KNOWLEDGE ACROSS SOFTWARE, HARDWARE, SAAS, CLOUD, TELECOMMUNICATIONS, AND PROFESSIONAL SERVICES.BACHELOR'S DEGREE IN TECHNOLOGY, BUSINESS ADMINISTRATION, SUPPLY CHAIN MANAGEMENT, OR RELATED FIELD PREFERRED.EXPERIENCE PLANNING AND LEADING NEGOTIATIONS INCLUDING HANDS ON REVIEW AND DISCUSSION OF BOTH LEGAL AND COMMERCIAL TERMSABILITY TO ASSESS COMPLEX SITUATIONS, AND USE RELATIONSHIP AND ANALYTICAL SKILLS TO MAKE DECISIONS AND RECOMMEND SOLUTIONSLEGAL ACUMEN CONTRACTS - CLM SYSTEMS",
    "job_skill_set": [
      "data analysis",
      "technology knowledge",
      "project management",
      "presentation skills",
      "communication",
      "relationship building",
      "analytical thinking",
      "problem solving",
      "collaboration",
      "adaptability",
      "sourcing strategies",
      "vendor management",
      "negotiation",
      "RFX management",
      "contract management",
      "market intelligence",
      "influencing"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "analytical",
      "building",
      "collaboration",
      "communication",
      "contract",
      "data",
      "influencing",
      "information",
      "informationtechnology",
      "intelligence",
      "knowledge",
      "management",
      "manager",
      "market",
      "negotiation",
      "presentation",
      "problem",
      "project",
      "relationship",
      "rfx",
      "skills",
      "solving",
      "sourcing",
      "strategies",
      "technology",
      "thinking",
      "vendor"
    ]
  },
  {
    "job_id": "3903872917",
    "job_title": "Consultant - Cybersecurity and Information Technology, Health Segment - Campus 2024",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOB FAMILY\n\nCYBER CONSULTING\n\nTRAVEL REQUIRED\n\nUP TO 25%\n\nCLEARANCE REQUIRED\n\nABILITY TO OBTAIN PUBLIC TRUST\n\nWHAT YOU WILL DO\n\nOUR CONSULTANTS HELP OUR CLIENTS IMPROVE THEIR BUSINESS PROCESSES, INTERNAL CONTROLS, OPERATING EFFICIENCY, TRANSPARENCY AND PERFORMANCE MANAGEMENT, AND ABILITY TO COMPLY WITH FEDERAL LAWS AND REGULATIONS. DURING YOUR ASSIGNMENT, YOU WILL BE GIVEN THE OPPORTUNITY TO SUPPORT PROJECTS TO ADDRESS SOME OF THE MOST SIGNIFICANT PROJECT CHALLENGES FACED BY FEDERAL CLIENTS. GUIDEHOUSE PROJECTS ARE EXTREMELY FLUID AND REQUIRE SELF-MOTIVATED INDIVIDUALS WILLING TO DEVELOP SOLUTIONS ON THEIR OWN OR IN A TEAM OF HIGHLY SKILLED PROFESSIONALS. PROJECT MEMBERS ARE PROVIDED THE OPPORTUNITY TO INTERACT WITH OUR CLIENTS' SENIOR MANAGEMENT AND ENHANCE THEIR SKILLS IN THE AREAS OF TECHNICAL COMPETENCY, BUSINESS DEVELOPMENT, CLIENT SERVICE AND PEOPLE DEVELOPMENT.\n\nAS A CONSULTANT, YOU WILL WORK WITH AN EXPERIENCED TEAM TO SUPPORT THE DEVELOPMENT OF CLIENT DELIVERABLES, INTERNAL AND CLIENT PRESENTATIONS, DAY-TO-DAY PROJECT LOGISTICS, AND ANY ADDITIONAL PROJECT TASKS. THIS POSITION PROVIDES INDIVIDUALS THE OPPORTUNITY TO SERVE CLIENTS ACROSS A WIDE VARIETY OF FUNCTIONS INCLUDING STRATEGY, PROCESS IMPROVEMENT, ANALYTICS, ACCOUNTING, INFORMATION TECHNOLOGY, COMMUNICATIONS, AND PROJECT MANAGEMENT\n\nWHAT YOU WILL NEED\n\nMINIMUM YEARS OF EXPERIENCE: 0 YEARSMINIMUM DEGREE STATUS: BACHELOR'S DEGREE (MUST STILL BE ENROLLED IN AN ACCREDITED UNDERGRADUATE DEGREE PROGRAM IN FALL 2023 AND GRADUATE BY SUMMER 2024)ABILITY TO OBTAIN A US GOVERNMENT SECURITY CLEARANCE: INDIVIDUAL MAY BE SUBMITTED FOR CLEARANCE SPECIFIC TO CLIENT POST-OFFER ABILITY TO WORK IN THE BALTIMORE, MD AREA AS NEEDED\n\nWHAT WOULD BE NICE TO HAVE\n\nDEGREE CONCENTRATION IN MANAGEMENT/INFORMATION SYSTEMS, BUSINESS INFORMATION TECHNOLOGY, CYBERSECURITY, COMPUTER SCIENCE, HEALTH INFORMATION TECHNOLOGY, OR RELATED STEM MAJORS IS PREFERRED PREVIOUS INTERNSHIP OR WORK EXPERIENCE PREFERREDNATURALLY CURIOUS PROBLEM-SOLVER, COMFORTABLE WITH AMBIGUITYKNOWLEDGE OF FEDERAL OR COMMERCIAL HEALTHCARE INDUSTRYKNOWLEDGE OF CYBERSECURITY AND PRIVACY CONTROLS AND REGULATIONS (E.G. NIST, FISMA, ETC.)KNOWLEDGE AND UNDERSTANDING OF PROJECT MANAGEMENT PRINCIPLES AND THE PHASES OF PROJECT MANAGEMENT (INITIATION, PLANNING, EXECUTION, MONITORING, CLOSURE)FAMILIARITY WITH OPERATING SYSTEMS (E.G. WINDOWS OR UNIX), VULNERABILITY MANAGEMENT TOOLS (E.G. NESSUS), CONFIGURATION MANAGEMENT TOOLS, AND OTHER TOOLS THAT SUPPORT A SUCCESSFUL CYBER SECURITY PROGRAM FOR AN ORGANIZATION, A PLUSHEIGHTENED ATTENTION TO DETAIL, AND THE ABILITY TO CREATE AND EDIT TECHNICAL AND NON-TECHNICAL WRITTEN WORK PRODUCTS AND GRAPHICAL PRESENTATIONSEXPERIENCE WORKING IN TEAMS TO PRODUCE HIGH-IMPACT WORK PRODUCTS, REPORTS, AND OTHER DELIVERABLES IN A FAST-PACED ENVIRONMENTABILITY TO PARTICIPATE IN CLIENT-FACING DISCUSSIONS AND MEETINGSDESIRE TO SUPPORT PUBLIC SECTOR CLIENTS WITH A HEALTHCARE MISSIONPASSIONATE ABOUT REINVESTING IN THE COMPANY YOU WORK FOR AND REPRESENTING THE COMPANY’S BRAND\n\nWHAT WE OFFER\n\nGUIDEHOUSE OFFERS A COMPREHENSIVE, TOTAL REWARDS PACKAGE THAT INCLUDES COMPETITIVE COMPENSATION AND A FLEXIBLE BENEFITS PACKAGE THAT REFLECTS OUR COMMITMENT TO CREATING A DIVERSE AND SUPPORTIVE WORKPLACE.\n\nBENEFITS INCLUDE\n\nMEDICAL, RX, DENTAL & VISION INSURANCEPERSONAL AND FAMILY SICK TIME & COMPANY PAID HOLIDAYSPOSITION MAY BE ELIGIBLE FOR A DISCRETIONARY VARIABLE INCENTIVE BONUSPARENTAL LEAVE AND ADOPTION ASSISTANCE401(K) RETIREMENT PLANBASIC LIFE & SUPPLEMENTAL LIFEHEALTH SAVINGS ACCOUNT, DENTAL/VISION & DEPENDENT CARE FLEXIBLE SPENDING ACCOUNTSSHORT-TERM & LONG-TERM DISABILITYSTUDENT LOAN PAYDOWNTUITION REIMBURSEMENT, PERSONAL DEVELOPMENT & LEARNING OPPORTUNITIESSKILLS DEVELOPMENT & CERTIFICATIONSEMPLOYEE REFERRAL PROGRAMCORPORATE SPONSORED EVENTS & COMMUNITY OUTREACHEMERGENCY BACK-UP CHILDCARE PROGRAMMOBILITY STIPEND\n\nABOUT GUIDEHOUSE\n\nGUIDEHOUSE IS AN EQUAL EMPLOYMENT OPPORTUNITY / AFFIRMATIVE ACTION EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, NATIONAL ORIGIN, ANCESTRY, CITIZENSHIP STATUS, MILITARY STATUS, PROTECTED VETERAN STATUS, RELIGION, CREED, PHYSICAL OR MENTAL DISABILITY, MEDICAL CONDITION, MARITAL STATUS, SEX, SEXUAL ORIENTATION, GENDER, GENDER IDENTITY OR EXPRESSION, AGE, GENETIC INFORMATION, OR ANY OTHER BASIS PROTECTED BY LAW, ORDINANCE, OR REGULATION.\n\nGUIDEHOUSE WILL CONSIDER FOR EMPLOYMENT QUALIFIED APPLICANTS WITH CRIMINAL HISTORIES IN A MANNER CONSISTENT WITH THE REQUIREMENTS OF APPLICABLE LAW OR ORDINANCE INCLUDING THE FAIR CHANCE ORDINANCE OF LOS ANGELES AND SAN FRANCISCO.\n\nIF YOU HAVE VISITED OUR WEBSITE FOR INFORMATION ABOUT EMPLOYMENT OPPORTUNITIES, OR TO APPLY FOR A POSITION, AND YOU REQUIRE AN ACCOMMODATION, PLEASE CONTACT GUIDEHOUSE RECRUITING AT 1-571-633-1711 OR VIA EMAIL AT RECRUITINGACCOMMODATION@GUIDEHOUSE.COM. ALL INFORMATION YOU PROVIDE WILL BE KEPT CONFIDENTIAL AND WILL BE USED ONLY TO THE EXTENT REQUIRED TO PROVIDE NEEDED REASONABLE ACCOMMODATION.\n\nGUIDEHOUSE DOES NOT ACCEPT UNSOLICITED RESUMES THROUGH OR FROM SEARCH FIRMS OR STAFFING AGENCIES. ALL UNSOLICITED RESUMES WILL BE CONSIDERED THE PROPERTY OF GUIDEHOUSE AND GUIDEHOUSE WILL NOT BE OBLIGATED TO PAY A PLACEMENT FEE.",
    "job_skill_set": [
      "cybersecurity",
      "information technology",
      "project management",
      "federal laws and regulations compliance",
      "data analytics",
      "operating systems (Windows, UNIX)",
      "configuration management tools",
      "health information technology",
      "technical writing",
      "business development",
      "problem solving",
      "teamwork",
      "communication",
      "self-motivation",
      "attention to detail",
      "adaptability",
      "client service",
      "curiosity",
      "passion for public sector",
      "vulnerability management tools (e.g., Nessus)"
    ],
    "short_keywords": [
      "2024",
      "adaptability",
      "analytics",
      "and",
      "attention",
      "business",
      "campus",
      "client",
      "communication",
      "compliance",
      "configuration",
      "consultant",
      "curiosity",
      "cybersecurity",
      "data",
      "detail",
      "development",
      "eg",
      "federal",
      "for",
      "health",
      "information",
      "informationtechnology",
      "laws",
      "management",
      "nessus",
      "operating",
      "passion",
      "problem",
      "project",
      "public",
      "regulations",
      "sector",
      "segment",
      "selfmotivation",
      "service",
      "solving",
      "systems",
      "teamwork",
      "technical",
      "technology",
      "to",
      "tools",
      "unix",
      "vulnerability",
      "windows",
      "writing"
    ]
  },
  {
    "job_id": "3904368255",
    "job_title": "Information Technology Project Coordinator",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "IT PROJECT COORDINATOR - ON-SITE IN SUNNYVALE, CA*LOCAL CANDIDATES ONLY - NON-LOCAL CANDIDATES WILL NOT BE CONSIDERED*\nTERM & START6-MONTH CONTRACT STARTING ASAPON-SITE IN SUNNYVALE, CA (94086)PAY RATE: UP TO $56/HR ($112K ANNUALLY)BUSINESS UNIT: ITLOCAL CANDIDATES ONLYINTERVIEW PROCESS: 2 ZOOM INTERVIEWS ESSENTIAL DUTIESCOLLABORATE WITH PORTFOLIO MANAGERS AND PROJECT MANAGERS TO ENSURE PROJECT TIMELINES ARE ACCURATE AND REALISTICPROVIDE SUPPORT TO ENSURE PROJECTS HAVE REQUIRED DOCUMENTS IN ORDER TO MOBILIZE PROJECTSMONITOR AND REPORT PROJECT STATUS REPORTS AND ENSURE CORRECTIVE ACTIONS ARE DISPLAYEDCOORDINATE AND SCHEDULE DESIGN REVIEWS, PHASE GATES, CHECKLISTS, ETC.ASSIST PROJECT MANAGER IN TRACKING PROJECT BLUEPRINT/ BUILD/ TEST ACTIVITIES BY ASSISTING IN UPDATE/ SYNC OF PROJECT BOX, SMARTSHEET, JIRA, ETC ARTIFACTSASSIST PROJECT/ PORTFOLIO MANAGERS IN SCHEDULING MEETINGS AND PROVIDE MEETING MINUTES, MEETING RECORDING AND FOLLOW UP WITH ACTION ITEMS WITH CROSS-FUNCTIONAL GROUPSASSIST PROJECT MANAGER IN COORDINATING THE UPDATES TO WEEKLY STATUS/ METRICS REPORTSCOORDINATE AND TRACK STATUS OF PROJECT DOCUMENTS WORKING ALONG WITH PROJECT MANAGER, BUSINESS ANALYSTS, BUSINESS PM AND VALIDATION LEAD THROUGH PROJECT LIFECYCLECREATE PIVOT TABLES AND REPORTS FROM VARIOUS SOURCES (ANAPLAN, JIRA, TABLEAU, SMARTSHEET, ETC) QUALIFICATIONSMINIMUM OF 2 YEARS OF DIRECTLY RELATED TO PROJECT MANAGEMENT EXPERIENCEEXCEPTIONAL VERBAL AND WRITTEN SKILLSEXEMPLARY SKILLS IN MICROSOFT OFFICE SUITE (EXCEL AND PPT)PROACTIVE PROBLEM SOLVER AND CAN-DO ATTITUDEEXCEPTIONAL ORGANIZATIONAL SKILLSABILITY TO PRIORITIZE WORKLOAD WITH COMPETING PRIORITIESPASSION TO LEARN NEW TOOLS AND PROJECT MANAGEMENT PROCESSESPROFICIENCY IN SMARTSHEET IS A PLUS",
    "job_skill_set": [
      "project management",
      "Microsoft Office Suite",
      "communication",
      "problem solving",
      "organizational skills",
      "prioritization",
      "collaboration",
      "adaptability",
      "Smartsheet",
      "JIRA",
      "Tableau",
      "Anaplan",
      "pivot tables"
    ],
    "short_keywords": [
      "adaptability",
      "anaplan",
      "collaboration",
      "communication",
      "coordinator",
      "information",
      "informationtechnology",
      "jira",
      "management",
      "microsoft",
      "office",
      "organizational",
      "pivot",
      "prioritization",
      "problem",
      "project",
      "skills",
      "smartsheet",
      "solving",
      "suite",
      "tableau",
      "tables",
      "technology"
    ]
  },
  {
    "job_id": "3884914341",
    "job_title": "Information Technology Financial Analyst",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "REQUIRED QUALIFICATIONS/EXPERIENCE: 7+ YEARS OF EXPERIENCE IN A FINANCIAL PLANNING AND ANALYSIS ROLE UNDERSTANDING DRIVERS OF VARIANCE OF FORECAST RELATIVE TO PLANEXPERIENCE DEVELOPING FORECAST MODELS AND CHALLENGING FORECAST RESULTS PREPARED BY OTHERSEXPERIENCE INTERPRETING HISTORICAL FINANCIAL PERFORMANCE IN RELATION TO FORECASTABILITY TO MANAGE LARGE DATA SETS AND SYNTHETIZE RESULTS FOR EXECUTIVE MANAGEMENTEXPERIENCE WITH ALL MICROSOFT TOOLS, INCLUDING EXCEL AND POWERBI WORKING KNOWLEDGE OF CAPITAL PROJECTS DRIVERS AND ACCOUNTING TREATMENTEXPERIENCE WITH CHANGE MANAGEMENT AND MODERNIZATION\nTASKS AND RESPONSIBILITIES:REPORT MONTHLY ACTUAL RESULTS AND FORECAST TO PORTFOLIO INVESTMENT COUNCIL, PROVIDING AN EXPLANATION OF VARIANCES RELATIVE TO FORECAST AND PLAN, RESPECTIVELYACTIVELY PARTICIPATE IN PORTFOLIO INVESTMENT COUNCIL PROVIDING INSIGHTS INTO THE FINANCIAL PERFORMANCE OF THE PORTFOLIOPROCESS PORTFOLIO APPROPRIATION REQUESTS, ENSURING INFORMATION PROVIDED IS ACCURATE AND COMPLETE AND IN ALIGNMENT WITH APPROVALS SET FORTH BY THE PORTFOLIO INVESTMENT COUNCILACTIVELY PARTICIPATE IN THE MODERNIZATION OF THE FUNCTION INCLUDING PROVIDING FEEDBACK ON AUTOMATION AND LEADING SPECIFIC EFFORTSPROVIDE GUIDANCE TO PORTFOLIO MANAGERS IN THEIR PREPARATION OF THE MONTHLY FORECAST AND SUBMISSION OF APPROPRIATION REQUESTS.\nMUST HAVE SKILLS/ATTRIBUTES: FINANCIAL ANALYSIS, MS EXCEL, POWERBI",
    "job_skill_set": [
      "financial analysis",
      "forecast models",
      "data management",
      "change management",
      "communication",
      "problem solving",
      "teamwork",
      "analytical thinking",
      "leadership",
      "MS Excel",
      "Power BI",
      "capital projects accounting"
    ],
    "short_keywords": [
      "accounting",
      "analysis",
      "analyst",
      "analytical",
      "bi",
      "capital",
      "change",
      "communication",
      "data",
      "excel",
      "financial",
      "forecast",
      "information",
      "informationtechnology",
      "leadership",
      "management",
      "models",
      "ms",
      "power",
      "problem",
      "projects",
      "solving",
      "teamwork",
      "technology",
      "thinking"
    ]
  },
  {
    "job_id": "3903817896",
    "job_title": "Information Technology Solutions Architect",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "***NO C2C******FULL TIME IN OFFICE - THIS IS NOT A REMOTE OR HYBRID POSITION***\nWE ARE SEEKING AN IT SOLUTIONS ARCHITECT TO JOIN A FANTASTIC RETAIL ORGANIZATION. THE IDEAL CANDIDATE WILL HAVE SOME RETAIL EXPERIENCE.\nEXPERIENCEOVER A DECADE OF RELEVANT EXPERIENCE IN IT MANAGEMENT OR SIMILAR ROLES WITHIN INFORMATION TECHNOLOGY SOLUTIONS ARCHITECTUREPREFERABLY 2-3 YEARS OF EXPERIENCE IN THE RETAIL SECTORPROFICIENCY IN DATA INTEGRATION PATTERNS AND TOOLSDEMONSTRATED EXPERIENCE IN CRAFTING SOLUTIONS IN BOTH CLOUD AND HYBRID CLOUD ENVIRONMENTSUNDERSTANDING OF NETWORK AND SECURITY PRINCIPLES CONCERNING INTEGRATION AND DATA FLOW AMONG SYSTEMSSOLID UNDERSTANDING OF SECURITY IN ON-PREMISES AND CLOUD ENVIRONMENTSFAMILIARITY WITH VENDOR MANAGEMENT TOOLS AND INTEGRATION WITH ENTERPRISE ARCHITECTURE (EA) TOOLSFAMILIARITY WITH IT ARCHITECTURAL FRAMEWORKS SUCH AS TOGAF AND ZACHMANKNOWLEDGE OF RETAIL SUPPLY CHAIN AND PLANNING, INCLUDING MERCHANDISING, IS ADVANTAGEOUSPREFERABLY INVOLVED IN AT LEAST TWO IMPLEMENTATIONS OF ENTERPRISE-CLASS SUPPLY CHAIN MANAGEMENT SYSTEMSSTRONG PREFERENCE FOR EXPERIENCE IN SERVICES DESIGN (SOA/MICROSERVICES) AND COTS ENTERPRISE-CLASS APPLICATIONS IN RETAILING\nRESPONSIBILITIESLEAD THE IDENTIFICATION AND RECOMMENDATION OF SUITABLE SOLUTIONS, UPGRADES, REPLACEMENTS, OR DECOMMISSIONING OPTIONS, CONSIDERING BUSINESS AND TECHNOLOGY PRODUCTIVITY, USABILITY, AND TOTAL COST OF OWNERSHIPDEVELOP AND IMPLEMENT SOLUTIONS TO REDUCE THE TIME SPENT ON REACTIVE WORKCOLLABORATE WITH BUSINESS AND TECHNOLOGY EXPERTS TO FORMULATE END-TO-END SOLUTIONS ALIGNING WITH ENTERPRISE STANDARDS AND GUIDELINES SET BY ENTERPRISE ARCHITECTUREESTABLISH A STRONG WORKING RELATIONSHIP BETWEEN IT AND OPERATIONS THROUGH INTERACTIONS WITH BUSINESS LEADERSHIPMODEL SOLUTIONS FROM CONCEPTUAL, LOGICAL, AND PHYSICAL PERSPECTIVES (N+1 VIEWS)CREATE ARTIFACTS DEFINING THE N+1 VIEWS OF THE END-TO-END SOLUTION, INCLUDING CONTEXT, DATA DOMAIN, LOGICAL, PHYSICAL, AND DEPLOYMENT ASPECTSFACILITATE THE REQUIREMENTS REFINEMENT PROCESS, PARTICULARLY FOCUSING ON SERVICE-LEVEL REQUIREMENTSENGAGE WITH OTHER IT DEPARTMENTS TO ENSURE A COMPREHENSIVE UNDERSTANDING OF THE PROPOSED ARCHITECTURE AND INCORPORATE FEEDBACKPARTICIPATE IN DESIGN REVIEWS TO ENSURE ALIGNMENT OF THE DESIGN WITH THE PROPOSED SOLUTION ARCHITECTURECONTRIBUTE TO ENTERPRISE GUIDELINES, STANDARDS, AND PRINCIPLES BY ADOPTING AND PROPAGATING PRECEDENTSCOMMUNICATE ARCHITECTURE DECISIONS UNDERLYING THE SOLUTION ARCHITECTUREPROACTIVELY ENGAGE WITH BUSINESS STAKEHOLDERS TO ADDRESS THEIR IMMEDIATE AND FUTURE REQUIREMENTS THROUGH ITDEVELOP A COMPREHENSIVE UNDERSTANDING OF COMPANY POLICIES, PROCEDURES, AND SAFETY REGULATIONSPERFORM OTHER DUTIES AS ASSIGNED, AS RESPONSIBILITIES MAY EVOLVE\n SKILLSPROFICIENCY IN BRIDGING THE GAP BETWEEN WATERFALL AND AGILE METHODOLOGIESEXCELLENT INTERPERSONAL, WRITTEN, AND VERBAL COMMUNICATION SKILLS, WITH THE ABILITY TO ENGAGE EFFECTIVELY WITH INDIVIDUALS AT ALL LEVELSABILITY TO FOSTER CONSENSUS AROUND PROPOSED SOLUTIONSCAPABLE OF WORKING INDEPENDENTLY AND CONTRIBUTING EFFECTIVELY IN A TEAM ENVIRONMENTANALYTICAL MINDSET WITH STRONG PROBLEM-SOLVING AND CREATIVE RESOLUTION SKILLSSELF-MOTIVATED WITH THE ABILITY TO HANDLE MULTIPLE PROJECTS IN A FAST-PACED ENVIRONMENTSTRONG OPTIMIZATION SKILLS ARE PREFERRED, INCLUDING STOCHASTIC MODELING, OPTIMIZATION ALGORITHMS, AND HOLISTIC PLANNINGABILITY TO COMPREHEND AND DERIVE LOWER-LEVEL ROADMAPS WITH BUSINESS LEADERSHIP TO ESTABLISH REQUIREMENTS' CONTEXTPROFICIENT IN MICROSOFT OFFICE PROGRAMS INCLUDING EXCEL, WORD, POWERPOINT, AND SHAREPOINT\nEDUCATIONBACHELOR'S DEGREE IN COMPUTER SCIENCE, COMPUTER ENGINEERING, SYSTEMS ENGINEERING OR OTHER RELATED ENGINEERING DISCIPLINE OR RELEVANT FIELD OF STUDY REQUIRED.\nAPPLY DIRECTLY TO ELISA.HENDRICK@IS-T.NET",
    "job_skill_set": [
      "IT management",
      "network security principles",
      "Microsoft Office (Excel, Word, PowerPoint, SharePoint)",
      "interpersonal communication",
      "written communication",
      "verbal communication",
      "teamwork",
      "problem solving",
      "analytical mindset",
      "self-motivation",
      "project management",
      "data integration patterns",
      "cloud solutions",
      "hybrid cloud environments",
      "vendor management tools",
      "enterprise architecture",
      "TOGAF",
      "Zachman Framework",
      "supply chain management systems",
      "services design (SOA/Microservices)",
      "COTS enterprise-class applications",
      "consensus building"
    ],
    "short_keywords": [
      "analytical",
      "applications",
      "architect",
      "architecture",
      "building",
      "chain",
      "cloud",
      "communication",
      "consensus",
      "cots",
      "data",
      "design",
      "enterprise",
      "enterpriseclass",
      "environments",
      "excel",
      "framework",
      "hybrid",
      "information",
      "informationtechnology",
      "integration",
      "interpersonal",
      "it",
      "management",
      "microsoft",
      "mindset",
      "network",
      "office",
      "patterns",
      "powerpoint",
      "principles",
      "problem",
      "project",
      "security",
      "selfmotivation",
      "services",
      "sharepoint",
      "soamicroservices",
      "solutions",
      "solving",
      "supply",
      "systems",
      "teamwork",
      "technology",
      "togaf",
      "tools",
      "vendor",
      "verbal",
      "word",
      "written",
      "zachman"
    ]
  },
  {
    "job_id": "3904395033",
    "job_title": "Information Technology Associate",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "PEAK PARTNERS HAS AN ESTABLISHED CONSULTING CLIENT WHO PROVIDES IT HEALTHCARE SERVICES, AND THEY ARE LOOKING FOR AN IT ASSOCIATE. THE IT ASSOCIATE WILL BE RESPONSIBLE FOR ALL ASSIGNED ASSETS AND WORK TASKS INCLUDING MANAGEMENT OF THE COMPANY’S SHAREPOINT AND HELP DESK SUPPORT.PRIMARILY REMOTE POSITION BUT CANDIDATES MUST BE LOCATED WITHIN 30 MILES OF THE BALTIMORE, MD AREA AND ABLE TO TRAVEL FOR URGENT IT ISSUES AS NEEDED. THIS IS A TEMP ROLE WITH PERM EXPECTED IN 6 MONTHS AFTER HIRE.\nRESPONSIBILITIESPROVIDES TECHNOLOGY SUPPORT REMOTELY AND IN-PERSON (WHEN REQUIRED). MANAGES HELPDESK SUPPORT.ASSISTS WITH (OR COORDINATES) THE REPAIR OF END USER HARDWARE AND THE REINSTALLATION OF SOFTWARE AS NECESSARY TO RESOLVE END USER INCIDENTS.RESOLVES INCIDENTS ASSOCIATED WITH COMPANY-STANDARD END USER SOFTWARE AND HARDWARE, INCLUDING MOBILE/HAND-HELD TECHNOLOGIES.SUPPORTS WITH ASSET MANAGEMENT INCLUDING SUPPORT, MAINTENANCE, TRACKING, SECURITY, AND PROCUREMENT.DEVELOPS PROCESSES TO STREAMLINE HELPDESK SUPPORT AND ASSET MANAGEMENT.SUPPORTS HR DEPARTMENT WITH EMPLOYEE ONBOARDING AND OFFBOARDING NEEDS.WORKS WITH ALL OPERATIONS DEPARTMENTS AND PROJECT TEAMS TO SUPPORT THEIR TECHNOLOGY NEEDS, SHAREPOINT SITE MANAGEMENT, AND ACT AS IT SME TO DEVELOP SOLUTIONS.MANAGES IT BUDGET AND PROJECTIONS AND REVIEW WITH SUPERVISOR MONTHLY.\nQUALIFICATIONSBACHELOR’S DEGREE OR COMMENSURATE PROFESSIONAL EXPERIENCE 1-2 YEARS’ WORK EXPERIENCE IN TECHNOLOGY SERVICES AND/OR CONSULTING ENVIRONMENTHIGHLY PROFICIENT WITH SHAREPOINT TOOL AND MANAGEMENTHIGHLY PROFICIENT WITH MICROSOFT OFFICE SUITESTRONG NETWORKING CAPABILITIESEXPERIENCE WITH ASSET MANAGEMENT TOOLSABILITY TO SET-UP LAPTOP USING IMAGINGSTRENGTH IN WORKING WITH VENDORS AND CONTRACTSSTRONG KNOWLEDGE WITH THE FOLLOWING:MICROSOFT DESKTOP OPERATING SYSTEMGENERAL COMPUTER TROUBLESHOOTING SKILLS MICROSOFT AND APPLE LAPTOPS MICROSOFT O365SECURITY CONTROLS SUCH AS VPN NETWORKS & AZUREREMOTE LAPTOP TOOLS SUCH AS GOTOASSISTGOOGLE SUITEEGNYTE, CLOUD STORAGEHELP DESK TICKETING SYSTEMSPATCH MANAGEMENT\nIF YOU THINK YOU HAVE THE QUALIFICATIONS STATED ABOVE AND ARE INTERESTED IN EXPLORING A NEW OPPORTUNITY, WE WILL WELCOME THE CHANCE TO REVIEW YOUR RESUME AND TALK FURTHER.",
    "job_skill_set": [
      "Microsoft Office Suite",
      "Networking",
      "Computer Troubleshooting",
      "Communication",
      "Problem Solving",
      "Teamwork",
      "Vendor Management",
      "Customer Service",
      "SharePoint",
      "Asset Management Tools",
      "Laptop Imaging Setup",
      "Microsoft Desktop Operating System",
      "Microsoft O365",
      "Security Controls (VPN, Azure)",
      "Remote Laptop Tools (GoToAssist)",
      "Google Suite",
      "Cloud Storage (Egnyte)",
      "Help Desk Ticketing Systems",
      "Patch Management",
      "Process Development",
      "Adaptability"
    ],
    "short_keywords": [
      "adaptability",
      "asset",
      "associate",
      "azure",
      "cloud",
      "communication",
      "computer",
      "controls",
      "customer",
      "desk",
      "desktop",
      "development",
      "egnyte",
      "google",
      "gotoassist",
      "help",
      "imaging",
      "information",
      "informationtechnology",
      "laptop",
      "management",
      "microsoft",
      "networking",
      "o365",
      "office",
      "operating",
      "patch",
      "problem",
      "process",
      "remote",
      "security",
      "service",
      "setup",
      "sharepoint",
      "solving",
      "storage",
      "suite",
      "system",
      "systems",
      "teamwork",
      "technology",
      "ticketing",
      "tools",
      "troubleshooting",
      "vendor",
      "vpn"
    ]
  },
  {
    "job_id": "3900951942",
    "job_title": "Information Technology Help Desk",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "JOB POSITION - IT HELP DESKJOB LOCATION - GOLDEN CO\nJOB DESCRIPTION\nAS A TECHNICAL SUPPORT SPECIALIST, YOU WILL PLAY A CRUCIAL ROLE IN PROVIDING SUPPORT TO END USERS, ADDRESSING TECHNICAL ISSUES, AND ENSURING TIMELY RESOLUTION TO MAINTAIN OPERATIONAL EFFICIENCY. THIS IS A TEMPORARY POSITION REQUIRING A CUSTOMER-FOCUSED APPROACH, STRONG PROBLEM-SOLVING SKILLS, AND THE ABILITY TO WORK EFFECTIVELY BOTH INDEPENDENTLY AND AS PART OF A TEAM.\nKEY RESPONSIBILITIES:\nEND USER SUPPORT: PROVIDE TECHNICAL ASSISTANCE TO END USERS VIA TELEPHONE CALLS, EMAIL, AND IN-PERSON REQUESTS, ADDRESSING A VARIETY OF TECHNICAL ISSUES PROMPTLY AND PROFESSIONALLY.\nPROBLEM IDENTIFICATION AND RESOLUTION: IDENTIFY, RESEARCH, AND RESOLVE TECHNICAL PROBLEMS REPORTED BY END USERS, DOCUMENTING AND TRACKING EACH ISSUE TO ENSURE TIMELY RESOLUTION.\nTICKET MANAGEMENT: OPEN SUPPORT TICKETS FOR REPORTED ISSUES, DOCUMENT RELEVANT INFORMATION, AND MONITOR THE TICKETING SYSTEM TO PRIORITIZE AND ADDRESS TASKS EFFICIENTLY.\nUSER ACCOUNT MANAGEMENT: CREATE NEW NETWORK USER ACCOUNTS AND DISABLE NETWORK ACCOUNTS FOLLOWING ESTABLISHED PROCEDURES. UPDATE MICROSOFT EXCHANGE INFORMATION AS REQUIRED BASED ON SUPPLIED INFORMATION.\nQUEUE MANAGEMENT: WORK ON TICKETS ASSIGNED IN THE SUPPORT QUEUE, ENSURING TASKS ARE COMPLETED WITHIN DESIGNATED TIMELINES. ASSIST WITH ASSIGNING TICKETS TO OTHER TEAM MEMBERS AS NEEDED.\nCUSTOMER SERVICE: PROVIDE FRIENDLY, HELPFUL, AND PROFESSIONAL ASSISTANCE TO END USERS, DEMONSTRATING STRONG CUSTOMER SERVICE ORIENTATION AND EFFECTIVE COMMUNICATION SKILLS.\nTRAINING AND CERTIFICATION: PARTICIPATE IN TRAINING SESSIONS TO ACQUIRE NECESSARY CERTIFICATIONS, SUCH AS CJIS CERTIFICATION, AND MAINTAIN UP-TO-DATE KNOWLEDGE OF RELEVANT TECHNOLOGIES AND PROCEDURES.\nREQUIREMENTS:\nASSOCIATE DEGREE IN A RELATED AREA PREFERRED, OR AT LEAST 1 YEAR OF EQUIVALENT EXPERIENCE IN TECHNICAL SUPPORT OR A RELATED FIELD.FAMILIARITY WITH COMMONLY USED CONCEPTS, PRACTICES, AND PROCEDURES WITHIN THE TECHNICAL SUPPORT FIELD.ABILITY TO FOLLOW INSTRUCTIONS AND ADHERE TO PRE-ESTABLISHED GUIDELINES WHILE PERFORMING JOB FUNCTIONS.EXCELLENT COMMUNICATION SKILLS, BOTH VERBAL AND WRITTEN, WITH A FOCUS ON CLARITY AND PROFESSIONALISM.STRONG PROBLEM-SOLVING SKILLS AND ATTENTION TO DETAIL, WITH THE ABILITY TO ASK RELEVANT QUESTIONS TO BETTER UNDERSTAND AND ADDRESS USER ISSUES.CUSTOMER SERVICE ORIENTATION AND A COLLABORATIVE, TEAM-ORIENTED MINDSET.MUST LIVE LOCALLY AND BE AVAILABLE TO WORK FROM HOME ON FRIDAYS.ABILITY TO ATTEND IN-PERSON INTERVIEWS AND COMPLETE REQUIRED CERTIFICATIONS/TRAINING.",
    "job_skill_set": [
      "technical support",
      "ticket management",
      "user account management",
      "Microsoft Exchange",
      "problem identification and resolution",
      "documentation",
      "customer service",
      "communication",
      "problem solving",
      "teamwork",
      "attention to detail",
      "independence",
      "CJIS certification"
    ],
    "short_keywords": [
      "account",
      "and",
      "attention",
      "certification",
      "cjis",
      "communication",
      "customer",
      "desk",
      "detail",
      "documentation",
      "exchange",
      "help",
      "identification",
      "independence",
      "information",
      "informationtechnology",
      "management",
      "microsoft",
      "problem",
      "resolution",
      "service",
      "solving",
      "support",
      "teamwork",
      "technical",
      "technology",
      "ticket",
      "to",
      "user"
    ]
  },
  {
    "job_id": "3905848083",
    "job_title": "Information Technology Consultant",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "COMPANY DESCRIPTIONAQUINAS CONSULTING & STAFFING SOLUTIONS, LLC IS A SPECIALTY STAFFING FIRM THAT PROVIDES FLEXIBLE INFORMATION TECHNOLOGY, ENGINEERING, AND DEFENSE STAFFING SOLUTIONS. WITH BRANCH OFFICES ESTABLISHED ALL OVER THE COUNTRY, AQUINAS ASSISTS ITS CLIENTS IN FINDING INDIVIDUALS WITH HARD-TO-FIND TECHNICAL SKILLS FOR PERMANENT OR CONTRACT POSITIONS. AQUINAS' TEAM OF RECRUITERS CONDUCTS THOROUGH TECHNICAL EVALUATIONS TO IDENTIFY TOP PROFESSIONALS. FOUNDED IN 2000 AND HEADQUARTERED IN CT, AQUINAS HAS EMPLOYEES IN 17 STATES, INCLUDING A HEADQUARTERS IN MILFORD, CT.\nLET'S CONNECT!",
    "job_skill_set": [
      "information technology",
      "communication",
      "teamwork",
      "problem solving",
      "flexibility",
      "client relationship management",
      "technical evaluation",
      "staffing solutions",
      "engineering",
      "defense staffing"
    ],
    "short_keywords": [
      "client",
      "communication",
      "consultant",
      "defense",
      "engineering",
      "evaluation",
      "flexibility",
      "information",
      "informationtechnology",
      "management",
      "problem",
      "relationship",
      "solutions",
      "solving",
      "staffing",
      "teamwork",
      "technical",
      "technology"
    ]
  },
  {
    "job_id": "3902308566",
    "job_title": "Entry-level Information Technology (IT) Role",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "YEAR UP IS A ONE-YEAR OR LESS, INTENSIVE JOB TRAINING PROGRAM THAT PROVIDES YOUNG ADULTS WITH IN-CLASSROOM SKILL DEVELOPMENT, ACCESS TO INTERNSHIPS AND/OR JOB PLACEMENT SERVICES, AND PERSONALIZED COACHING AND MENTORSHIP. YEAR UP PARTICIPANTS ALSO RECEIVE AN EDUCATIONAL STIPEND.\n\nTHE PROGRAM COMBINES TECHNICAL AND PROFESSIONAL TRAINING WITH ACCESS TO INTERNSHIPS AND JOB PLACEMENT SUPPORT THROUGH OUR INDUSTRY-LEADING TALENT PLACEMENT FIRM YUPRO PLACEMENT. IF YOU RECEIVE AN INTERNSHIP, IT MAY BE AT MICROSOFT, ACCENTURE, SALESFORCE, OR SEATTLE CHILDREN'S HOSPITAL AMONG OTHER LEADING ORGANIZATIONS IN THE SEATTLE/BELLEVUE WASHINGTON AREA.\n\nARE YOU ELIGIBLE?YOU CAN APPLY TO YEAR UP IF YOU ARE:- 18-29 YEARS OLD- A HIGH SCHOOL GRADUATE OR GED RECIPIENT- ELIGIBLE TO WORK IN THE U.S.- AVAILABLE MONDAY-FRIDAY THROUGHOUT THE DURATION OF THE PROGRAM- HIGHLY MOTIVATED TO LEARN TECHNICAL AND PROFESSIONAL SKILLS- HAVE NOT OBTAINED A BACHELORʼS DEGREEYEAR.\n\nWHAT WILL YOU GAIN?PROFESSIONAL BUSINESS AND COMMUNICATION SKILLS, INTERVIEWING AND NETWORKING SKILLS, RESUME BUILDING, ONGOING SUPPORT AND GUIDANCE TO HELP YOU LAUNCH YOUR CAREER. SOME COURSEWORK IS ELIGIBLE FOR COLLEGE CREDIT. DURING THE INTERNSHIP PHASE, YEAR UP STUDENTS EARN AN EDUCATIONAL STIPEND OF $525 PER WEEK.\n\nIN-DEPTH CLASSES INCLUDE:- APPLICATION DEVELOPMENT & SUPPORT- BANKING & CUSTOMER SUCCESS- BUSINESS FUNDAMENTALS- HELPDESK/DESKTOP SUPPORT- PROJECT MANAGEMENT SUPPORT- QUALITY ASSURANCE GET THE SKILLS AND OPPORTUNITY YOU NEED TO LAUNCH YOUR PROFESSIONAL CAREER.80% OF YEAR UP GRADUATES ARE EMPLOYED AND/OR ENROLLED IN POSTSECONDARY EDUCATION WITHIN 4 MONTHS OF GRADUATION. PANDOLOGIC. KEYWORDS: IT ASSISTANT, LOCATION: SEATTLE, WA - 98104",
    "job_skill_set": [
      "application development",
      "helpdesk support",
      "desktop support",
      "project management",
      "quality assurance",
      "business fundamentals",
      "communication",
      "networking",
      "motivation",
      "coaching",
      "interviewing skills",
      "resume building"
    ],
    "short_keywords": [
      "application",
      "assurance",
      "building",
      "business",
      "coaching",
      "communication",
      "desktop",
      "development",
      "entrylevel",
      "fundamentals",
      "helpdesk",
      "information",
      "informationtechnology",
      "interviewing",
      "it",
      "management",
      "motivation",
      "networking",
      "project",
      "quality",
      "resume",
      "role",
      "skills",
      "support",
      "technology"
    ]
  },
  {
    "job_id": "3890899146",
    "job_title": "Director of Information Technology",
    "category": "INFORMATION-TECHNOLOGY",
    "job_description": "DIRECTOR OF INFORMATION TECHNOLOGY\nJOB SUMMARY:\nTHE DIRECTOR OF INFORMATION WILL PLAY A PIVOTAL ROLE IN OUR ORGANIZATION’S TECHNOLOGY STRATEGY, OVERSEEING THE MANAGEMENT AND ENHANCEMENT OF OUR IT INFRASTRUCTURE, SYSTEMS, AND PROCESSES. REPORTING TO THE DIRECTOR OF OPERATIONS AND TECHNOLOGY, THE DIRECTOR OF IT WILL LEAD A TEAM RESPONSIBLE FOR ENSURING THE RELIABILITY, SECURITY, AND INNOVATION OF OUR TECHNOLOGY ENVIRONMENT.\nKEY RESPONSIBILITIES:LEAD AND MANAGE THE IT DEPARTMENT, INCLUDING STAFF DEVELOPMENT, PERFORMANCE EVALUATION, AND RESOURCE ALLOCATION.DEVELOP AND EXECUTE THE ORGANIZATION’S IT STRATEGY IN ALIGNMENT WITH OVERALL BUSINESS GOALS.OVERSEE THE PLANNING, IMPLEMENTATION AND MAINTENANCE OF IT SYSTEMS, NETWORKS, HARDWARE, AND SOFTWARE.ENSURE THE SECURITY AND INTEGRITY OF DATA, SYSTEMS, AND TECHNOLOGY ASSETS, INCLUDING DISASTER RECOVERY AND CYBERSECURITY MEASURES.COLLABORATE WITH OTHER DEPARTMENTS TO IDENTIFY TECHNOLOGY NEEDS AND IMPLEMENT SOLUTIONS TO SUPPORT THEIR OBJECTIVES.EVALUATE EMERGING TECHNOLOGIES AND MAKE RECOMMENDATIONS FOR ADOPTION OR ENHANCEMENTS.MANAGE VENDOR RELATIONSHIPS, CONTRACTS, AND SERVICE LEVEL AGREEMENTS.CREATE AND MANAGE THE IT BUDGET, CONTROLLING COSTS WHILE OPTIMIZING TECHNOLOGY INVESTMENTS.ESTABLISH AND ENFORCE IT POLICIES, PROCEDURES, AND BEST PRACTICES.PROVIDE STRATEGIC GUIDANCE ON IT PROJECTS, INCLUDING INFRASTRUCTURE UPDATES, SOFTWARE IMPLEMENTATIONS, AND SYSTEM MIGRATIONS.FACILITATES AND OVERSEES THE TECHNICAL SUPPORT AND HELPDESK ROLES, ENSURING EFFECTIVE AND HELPFUL SUPPORT IS PROVIDED TO END USERS.PERFORMS OTHER DUTIES AS ASSIGNED.\nQUALIFICATIONS AND REQUIREMENTS:BACHELOR’S DEGREE IN INFORMATION TECHNOLOGY, COMPUTER SCIENCE OR RELATED FIELD; MASTER’S DEGREE PREFERRED.PROVEN EXPERIENCE IN IT LEADERSHIP ROLES, WITH A TRACK RECORD OF SUCCESSFUL PROJECT EXECUTION.STRONG UNDERSTANDING OF IT INFRASTRUCTURE, CLOUD COMPUTING, AND CYBERSECURITYEXCEPTIONAL LEADERSHIP AND TEAM MANAGEMENT SKILLSEXCELLENT COMMUNICATION AND INTERPERSONAL ABILITIESABILITY TO TRANSLATE TECHNICAL CONCEPTS INTO BUSINESS TERMS FOR NON-TECHNICAL STAKEHOLDERS.BUDGET MANAGEMENT EXPERIENCE.RELEVANT INDUSTRY CERTIFICATIONS (E.G. ITIL, CISSP) A PLUS\nREPORTING STRUCTURE:REPORTS TO: DIRECTOR OF OPERATIONS AND TECHNOLOGYDIRECT REPORTS: 3 IT TEAM MEMBERS\nLOCATION: IN OFFICE PREFERRED",
    "job_skill_set": [
      "vendor management",
      "project management",
      "technical support management",
      "performance evaluation",
      "leadership",
      "team management",
      "communication",
      "interpersonal skills",
      "problem solving",
      "strategic thinking",
      "collaboration",
      "adaptability",
      "IT strategy development",
      "IT infrastructure management",
      "cybersecurity",
      "cloud computing",
      "budget management",
      "data integrity and security",
      "disaster recovery planning",
      "IT policies and procedures",
      "emerging technologies evaluation",
      "resource allocation",
      "software implementation",
      "system migration",
      "technical translation"
    ],
    "short_keywords": [
      "adaptability",
      "allocation",
      "and",
      "budget",
      "cloud",
      "collaboration",
      "communication",
      "computing",
      "cybersecurity",
      "data",
      "development",
      "director",
      "disaster",
      "emerging",
      "evaluation",
      "implementation",
      "information",
      "informationtechnology",
      "infrastructure",
      "integrity",
      "interpersonal",
      "it",
      "leadership",
      "management",
      "migration",
      "of",
      "performance",
      "planning",
      "policies",
      "problem",
      "procedures",
      "project",
      "recovery",
      "resource",
      "security",
      "skills",
      "software",
      "solving",
      "strategic",
      "strategy",
      "support",
      "system",
      "team",
      "technical",
      "technologies",
      "technology",
      "thinking",
      "translation",
      "vendor"
    ]
  }
]