[
  {
    "job_id": "3905687426",
    "job_title": "Consultant, Financial Services, Consumer Finance l Forensic and Litigation Consulting",
    "category": "FINANCE",
    "job_description": "WHO WE ARE\n\nFTI CONSULTING IS THE WORLD'S LEADING EXPERT-DRIVEN CONSULTING FIRM. OVER THE LAST 40 YEARS, FTI CONSULTING EXPERTS HAVE SERVED AS THE TRUSTED ADVISOR TO FORTUNE 500 COMPANIES AND THE WORLD'S LEADING LAW AND PRIVATE EQUITY FIRMS WHEN THEY ARE FACING THEIR GREATEST OPPORTUNITIES AND CHALLENGES. OUR STRONG PERFORMANCE AND CONTINUED SUCCESS ARE A DIRECT REFLECTION OF THE AMBITION, ENERGY, AND COMMITMENT OF OUR TALENTED PROFESSIONALS ACROSS THE GLOBE TO MAKE A POSITIVE IMPACT FOR OUR CLIENTS AND COMMUNITIES.\n\nAT FTI CONSULTING, YOU'LL BE INSPIRED AND EMPOWERED TO MAKE AN IMPACT ON HEADLINE MATTERS THAT CHANGE HISTORY. WORKING SIDE BY SIDE WITH THE WORLD'S LEADING EXPERTS IN YOUR FIELD, YOU'LL BE SURROUNDED BY AN OPEN COLLABORATIVE CULTURE THAT EMBRACES DIVERSITY, RECOGNITION, PROFESSIONAL DEVELOPMENT AND MOST IMPORTANTLY, YOU.\n\nTHERE'S NEVER BEEN A MORE EXCITING TIME TO JOIN FTI CONSULTING AND THIS IS WHERE YOU WILL DO THE MOST EXCITING AND FULFILLING WORK OF YOUR CAREER.\n\nARE YOU READY TO MAKE AN IMPACT?\n\nABOUT THE ROLE\n\nWE ARE INVOLVED IN COMPLEX, GLOBAL AND HIGH-PROFILE LITIGATION, ARBITRATION AND INVESTIGATIONS COMBINING END-TO-END RISK ADVISORY, INVESTIGATIVE AND DISPUTES EXPERTISE TO DELIVER HOLISTIC SOLUTIONS FOR OUR CLIENTS.\n\nAS A CONSULTANT IN FINANCIAL SERVICES, YOU'LL BE PROVIDING BANK REGULATORY CONSULTING SERVICES AND PERFORMING ANALYSIS FOR VARIOUS CLIENT SITUATIONS.\n\nWHAT YOU'LL DO\n\n PERFORM AND MAY SUPERVISE DAY-TO-DAY ACTIVITIES IN SUPPORT OF FINANCIAL INSTITUTION CONSULTING PROJECTS INCLUDING INTERACTION WITH CLIENT PERSONNEL, OTHER TEAM MEMBERS, AND PROFESSIONALS FROM OTHER FIRMS INVOLVED IN THE ENGAGEMENT.  PERFORM TECHNICAL, INDUSTRY, AND COMPANY RESEARCH UTILIZING ONLINE TOOLS AND PUBLICLY AVAILABLE INFORMATION, DEVELOP WORK PLANS AND EXECUTE STUDIES TO ASSESS COMPLEX QUESTIONS OF FACT, PREPARE REPORTS AND SCHEDULES SUMMARIZING FINDINGS THAT WILL BE DELIVERED TO CLIENTS AND OTHER PARTIES.  APPLY BANKING, COMPLIANCE, FINANCIAL, AND ANALYTICAL SKILLS TO VARIOUS CLIENT SITUATIONS AND PRACTICE DISCIPLINES, INCLUDING DEVELOPMENT AND REVIEW OF CLIENT POLICIES AND PROCEDURES, PROCESSES AND CONTROLS, RISK ASSESSMENTS, CORPORATE GOVERNANCE STRUCTURE, COMPLIANCE WITH BANK REGULATIONS, OPERATION EFFICIENCY, AND MANAGEMENT OF RISK.  MAINTAIN DETAILED WORKING PAPER RECORDS REFLECTING ASSUMPTIONS, METHODOLOGIES, AND SOURCES OF INFORMATION EMPLOYED DURING THE PERFORMANCE OF ALL ANALYTICAL AND REVIEW TASKS.  DELIVER A HIGH-QUALITY PRODUCT WITHIN ESTABLISHED TIMEFRAMES AND BUDGETS. PREPARE WRITTEN ANALYSES AND OTHER REPORTS FOR THIRD PARTIES, AS NECESSARY, ON THE PROJECT SCOPE AND/OR RESULTS OF ACTIVITIES. PREPARE PRESENTATIONS AND QUANTITATIVE EXHIBITS FOR THIRD PARTIES ON THE PROJECT SCOPE AND FINDINGS. \n\nHOW YOU'LL GROW\n\n DEVELOP A COMPLETE UNDERSTANDING OF FTI CONSULTING'S BUSINESS SEGMENT OFFERINGS AND USE THAT KNOWLEDGE TO RECOGNIZE OPPORTUNITIES FOR FTI CONSULTING TO HELP MEET THE NEEDS OF CURRENT AND FUTURE CLIENTS.  DEVELOP NEW BUSINESS RELATIONSHIPS WITH BANKING PROFESSIONALS, ATTORNEYS AND COMPANY PERSONNEL TO GROW FTI CONSULTING'S BUSINESS AND WORK TO FOSTER ON-GOING SALES EFFORTS TO OBTAIN ADDITIONAL OPPORTUNITIES.  ORGANIZE INFORMATION TO FACILITATE EFFECTIVE DATA ACCESS AND ANALYSIS. SUPERVISE MORE JUNIOR TEAM MEMBERS' WORK PRODUCT. \n\nBASIC QUALIFICATIONS\n\nWHAT YOU WILL NEED TO SUCCEED \n\n BACHELOR'S OR MASTER'S DEGREE IN FINANCE, BUSINESS, OR RELATED FIELD.  1 YEAR(S) OF RELEVANT POST-GRADUATE PROFESSIONAL EXPERIENCE IN FINANCIAL SERVICES.  ABILITY TO TRAVEL TO CLIENTS AND FTI OFFICE(S) AS NEEDED.  APPLICANTS MUST BE CURRENTLY AUTHORIZED TO WORK IN THE UNITED STATES ON A FULL-TIME BASIS; THIS POSITION DOES NOT PROVIDE VISA SPONSORSHIP  FAMILIAR WITH CONSUMER PROTECTION RULES AND REGULATIONS OR SERVING IN A COMPLIANCE FUNCTION FOR CONSUMER PRODUCTS \n\nPREFERRED QUALIFICATIONS\n\n PROFESSIONAL WORK EXPERIENCE IN BANKING REGULATIONS.  DESIRE TO WORK TOWARDS CFE, CAMS, CRCM OR OTHER RELEVANT PROFESSIONAL DESIGNATION. \n\nOUR BENEFITS\n\n OUR GOAL IS TO SUPPORT THE WELL-BEING OF YOU AND YOUR FAMILIES-PHYSICALLY, EMOTIONALLY, AND FINANCIALLY. WE OFFER COMPREHENSIVE BENEFITS SUCH AS THE FOLLOWING:  COMPETITIVE TOTAL COMPENSATION, INCLUDING BONUS EARNING POTENTIAL  FULL PACKAGE OF BENEFITS PLANS, INCLUDING MEDICAL, DENTAL, AND VISION COVERAGE ALONG WITH LIFE AND DISABILITY INSURANCE  GENEROUS PAID TIME OFF  COMPANY MATCHED 401(K) RETIREMENT SAVINGS PLAN  POTENTIAL FOR FLEXIBLE WORK ARRANGEMENTS  GENEROUS PAID PARENTAL LEAVE AND FLEX RETURN SUPPORT  FAMILY CARE BENEFITS, INCLUDING BACK-UP CHILD/ELDER CARE  EMPLOYEE WELLNESS PLATFORM  EMPLOYEE RECOGNITION PROGRAMS  PAID TIME OFF FOR VOLUNTEERING IN YOUR COMMUNITY  CORPORATE MATCHING FOR CHARITABLE DONATIONS MOST IMPORTANT TO YOU  MAKE AN IMPACT IN OUR COMMUNITIES THROUGH COMPANY SPONSORED PRO BONO WORK  PROFESSIONAL DEVELOPMENT AND CERTIFICATION PROGRAMS  FREE IN-OFFICE SNACKS AND DRINKS  FREE SMARTPHONE AND CELLULAR PLAN (IF APPLICABLE)  FTI PERKS & DISCOUNTS AT RETAILERS AND BUSINESSES  UPSCALE OFFICES CLOSE TO PUBLIC TRANSPORTATION \n\nABOUT FTI CONSULTING\n\nFTI CONSULTING IS A GLOBAL BUSINESS ADVISORY FIRM DEDICATED TO HELPING CLIENTS WITH THEIR MOST SIGNIFICANT OPPORTUNITIES AND CHALLENGES. WITH MORE THAN 7,600 EMPLOYEES LOCATED IN 31 COUNTRIES, OUR BROAD AND DIVERSE BENCH OF AWARD-WINNING EXPERTS ADVISE THEIR CLIENTS WHEN THEY ARE FACING THEIR MOST SIGNIFICANT OPPORTUNITIES AND CHALLENGES. AT FTI CONSULTING, WE EMBRACE, CULTIVATE AND MAINTAIN A CULTURE OF DIVERSITY, INCLUSION & BELONGING, WHICH ARE FUNDAMENTAL COMPONENTS TO OUR CORE VALUES. FTI CONSULTING IS PUBLICLY TRADED ON THE NEW YORK STOCK EXCHANGE AND HAS BEEN NAMED THE #1 PROFESSIONAL SERVICES FIRM ON FORBES LIST OF AMERICA'S BEST EMPLOYERS AND THE BEST FIRM TO WORK FOR BY CONSULTING MAGAZINE. FOR MORE INFORMATION, VISIT WWW.FTICONSULTING.COM AND CONNECT WITH US ON INSTAGRAM AND LINKEDIN .\n\nFTI CONSULTING IS AN EQUAL OPPORTUNITY EMPLOYER AND DOES NOT DISCRIMINATE ON THE BASIS OF RACE, COLOR, NATIONAL ORIGIN, ANCESTRY, CITIZENSHIP STATUS, PROTECTED VETERAN STATUS, RELIGION, PHYSICAL OR MENTAL DISABILITY, MARITAL STATUS, SEX, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, AGE, OR ANY OTHER BASIS PROTECTED BY LAW, ORDINANCE, OR REGULATION.\n\n",
    "job_skill_set": [
      "compliance",
      "financial analysis",
      "risk assessment",
      "report writing",
      "data analysis",
      "project management",
      "business development",
      "communication",
      "teamwork",
      "problem solving",
      "leadership",
      "adaptability",
      "client relationship management",
      "organizational skills",
      "collaboration",
      "banking",
      "regulatory knowledge",
      "consumer protection regulations"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "and",
      "assessment",
      "banking",
      "business",
      "client",
      "collaboration",
      "communication",
      "compliance",
      "consultant",
      "consulting",
      "consumer",
      "data",
      "development",
      "finance",
      "financial",
      "forensic",
      "knowledge",
      "l",
      "leadership",
      "litigation",
      "management",
      "organizational",
      "problem",
      "project",
      "protection",
      "regulations",
      "regulatory",
      "relationship",
      "report",
      "risk",
      "services",
      "skills",
      "solving",
      "teamwork",
      "writing"
    ]
  },
  {
    "job_id": "3884940248",
    "job_title": "Finance and Admin Manager",
    "category": "FINANCE",
    "job_description": "OBJECTIVES OF THE ROLE:\nTHE FINANCE AND ADMIN MANAGER PROVIDES ADMINISTRATIVE AND STRATEGIC ASSISTANCE TO THE LEADERSHIP TEAM AND TO THE PRESIDENT. THE ROLE CARRIES ACROSS ALL FUNCTIONS OF THE COMPANY AND IS MOSTLY FOCUSED ON WORKING ON AND MANAGING BACK-OFFICE TASKS WHILE ALSO BEING OPEN TO ASSISTING WITH SPECIFIC PROJECTS AND CLIENT FACING WORK WHEN NEEDED.\nTHIS IS A FULL-TIME POSITION WITH A HYBRID IN-THE OFFICE WORK SCHEDULE.\nPRIMARY DUTIES AND RESPONSIBILITIES:UNDER THE DIRECTION OF THE LEADERSHIP TEAM, WORK ON AND UPDATE STRATEGIC INITIATIVES.WORK CLOSELY WITH THE INTERNAL TEAM, CORPORATE AUDITOR AND GOVERNMENT AGENCIES, AND PROVIDE INFORMATION AND ASSISTANCE TO COMPLETE:O ANNUAL AUDITO ANNUAL CORPORATE TAX RETURNSO ANNUAL FHA CERTIFICATIONO ANNUAL FHA QUALITY CONTROL REVIEWO ANNUAL BUDGET AND OPERATING PLANO PREPARE MONTHLY BUDGET TO ACTUAL REPORTS AND EXPLAIN VARIANCESO OTHER PROJECTS ON AN AS NEEDED BASISRESPONSIBLE FOR PROCESSING BILLS, MANAGING PAYROLL, RECONCILING THE LOAN DISBURSEMENT ACCOUNT AND COMPLETE MONTHLY BANK RECONCILIATIONIN CLOSE COOPERATION WITH THE LEADERSHIP TEAM, BE THE POINT PERSON FOR HUMAN RESOURCES AND WORK WITH OUR OUTSIDE PARTNERS ON MATTERS INCLUDING:O WORK WITH RECRUITMENT AGENCIES AND NEW HIRES (UNTIL NEW STAFF START)O HEALTH & INSURANCE COVERAGE RENEWALS AND COMMUNICATIONO CORPORATE HANDBOOK INCLUDING ANNUAL LEGAL UPDATESO 401K PLANO LEGALO PERSONNEL FOLDER UPDATESIN CLOSE COOPERATION WITH THE DIRECTOR PROGRAM MANAGEMENT & OPERATIONS, WORK WITH THIRD-PARTY VENDORS AND ON SPECIAL PROJECTS AS REQUIRED.IN CLOSE COOPERATION WITH THE LEADERSHIP TEAM, BE THE LIAISON WITH OUR MARKETING PARTNERS ON VARIOUS ACTIVITIES INCLUDING:O UPDATES AND IMPROVEMENTS OF WEBSITEO ADVERTISING, DUES, PRESENTATION, AND MEETING PREPARATIONSO IMAGERY AND ADVERTISING MATERIALO QUARTERLY MARKETING BLASTSIN COOPERATION WITH THE LEADERSHIP TEAM, PREPARE MATERIALS AND PRESENTATIONS FOR ANNUAL AND QUARTERLY MEETINGS.ROUTINELY APPLIES “BEST PRACTICES” BY INITIATING NEW STRATEGIES AND MEASUREMENTS THAT HELP TO INCREASE INTERNAL EFFICIENCIES AND IMPROVE THE COMPANY’S PERFORMANCE.ATTENDS CONFERENCES AND OTHER FUNCTIONS, AS NECESSARY.\nQUALIFICATIONS AND SKILLS NEEDED:A BACHELOR’S DEGREE WITH A MAJOR OR SUBSTANTIAL COURSEWORK IN ACCOUNTING, FINANCE OR ECONOMICS IS PREFERRED.3 YEARS OF EXPERIENCE OF WORKING IN A BACK-OFFICE ROLE AT A SMALL PRIVATELY HELD COMPANY IS REQUIRED.EXECUTIVE-LEVEL PRESENTATIONS SKILLS AND ABILITY TO HANDLE HIGH-LEVEL CLIENT INTERACTIONS.STRONG TEAM-WORK SKILLS.DEMONSTRATED STRATEGIC VISION AND ANALYTICAL SKILLS WITH THE ABILITY TO EVALUATE DATA QUICKLY, MAKE SOUND DECISIONS BASED ON IMPERFECT INFORMATION, AND TO TAKE ACTIONS.INDEPENDENT WORKER WITH ABILITY TO ADJUST TO AN EVER-CHANGING ENVIRONMENT.HIGHLY DEVELOPED WRITING, ANALYTICAL AND RESEARCH SKILLS.HIGHLY ORGANIZED AND DETAILED ORIENTED.ABILITY TO KEEP SENSITIVE INFORMATION STRICTLY CONFIDENTIAL.DEDICATION TO SERVING HPCC’S MISSION DRIVEN CLIENTS AND FULFILLING HPCC’S MISSION OF EXPANDING THE STOCK OF AFFORDABLE HOUSING, PARTICULARLY FOR SENIORS.HIGH PROFICIENCY IN MICROSOFT EXCEL, WORD, POWERPOINT, OUTLOOK, QUICKBOOKS, AND ADOBE.",
    "job_skill_set": [
      "accounting",
      "finance",
      "payroll management",
      "budgeting",
      "bank reconciliation",
      "QuickBooks",
      "data analysis",
      "strategic planning",
      "teamwork",
      "communication",
      "analytical skills",
      "independent work",
      "organizational skills",
      "confidentiality",
      "adaptability",
      "client interaction",
      "problem solving",
      "economics",
      "Microsoft Excel",
      "Microsoft Word",
      "Microsoft PowerPoint",
      "Microsoft Outlook",
      "Adobe",
      "presentation skills"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "admin",
      "adobe",
      "analysis",
      "analytical",
      "and",
      "bank",
      "budgeting",
      "client",
      "communication",
      "confidentiality",
      "data",
      "economics",
      "excel",
      "finance",
      "independent",
      "interaction",
      "management",
      "manager",
      "microsoft",
      "organizational",
      "outlook",
      "payroll",
      "planning",
      "powerpoint",
      "presentation",
      "problem",
      "quickbooks",
      "reconciliation",
      "skills",
      "solving",
      "strategic",
      "teamwork",
      "word",
      "work"
    ]
  },
  {
    "job_id": "3901930289",
    "job_title": "Manager, Accounting & Finance | Family Office",
    "category": "FINANCE",
    "job_description": "PRIVATE FAMILY OFFICE SEEKING MANAGER, ACCOUNTING & FINANCE TO OWN GENERAL LEDGER AND FINANCIAL CLOSE ACTIVITIES.\nKEYS TO AN INTERVIEW - MANAGER, ACCOUNTING & FINANCE | FAMILY OFFICECPA HIGHLY PREFERREDAT LEAST 5 YEARS' ACCOUNTING EXPERIENCE. PUBLIC ACCOUNTING FOUNDATION NICE TO HAVE.AT LEAST 2-3 YEARS IN A LEADERSHIP CAPACITYFAMILY OFFICE OR MULTI-ENTITY CORPORATE ACCOUNTING EXPERIENCE PREFERREDABLE TO WORK IN A HYBRID OFFICE SETTING IN THE LOOP (UP TO 3 DAYS PER WEEK)\nKEY RESPONSIBILITIES - MANAGER, ACCOUNTING & FINANCE | FAMILY OFFICEPREPARE AND REVIEW FINANCIAL STATEMENTS, INCLUDING BALANCE SHEETS, INCOME STATEMENTS, AND CASH FLOW STATEMENTS, ENSURING ACCURACY AND COMPLIANCE WITH ACCOUNTING STANDARDS.OVERSEE DAY-TO-DAY ACCOUNTING ACTIVITIES, INCLUDING MAINTAINING THE GENERAL LEDGER, RECORDING TRANSACTIONS, AND RECONCILING ACCOUNTS.ASSIST IN THE DEVELOPMENT OF ANNUAL BUDGETS AND FORECASTS, PROVIDING INSIGHTS AND ANALYSIS TO SUPPORT FINANCIAL PLANNING AND DECISION-MAKING.MANAGE CASH FLOW BY MONITORING LIQUIDITY NEEDS, COORDINATING CASH DISBURSEMENTS AND RECEIPTS, AND OPTIMIZING CASH BALANCES TO MEET FINANCIAL OBLIGATIONS.COLLABORATE WITH TAX ADVISORS TO DEVELOP TAX STRATEGIES, ENSURE COMPLIANCE WITH TAX LAWS AND REGULATIONS, AND COORDINATE THE PREPARATION AND FILING OF TAX RETURNS.OVERSEE THE ACCOUNTING FOR INVESTMENT PORTFOLIOS, INCLUDING RECORDING INVESTMENT TRANSACTIONS, CALCULATING INVESTMENT PERFORMANCE, AND RECONCILING INVESTMENT ACTIVITY.CONDUCT FINANCIAL ANALYSIS TO SUPPORT STRATEGIC DECISION-MAKING, EVALUATE INVESTMENT OPPORTUNITIES, AND ASSESS THE FINANCIAL HEALTH OF THE FAMILY OFFICE'S ASSETS AND INVESTMENTS.IDENTIFY AND MITIGATE FINANCIAL RISKS BY IMPLEMENTING EFFECTIVE INTERNAL CONTROLS, MONITORING COMPLIANCE WITH POLICIES AND PROCEDURES, AND PROACTIVELY ADDRESSING ANY POTENTIAL ISSUES.LEAD AND MENTOR A TEAM OF ACCOUNTING PROFESSIONALS, PROVIDING GUIDANCE, TRAINING, AND PERFORMANCE FEEDBACK TO FOSTER A HIGH-PERFORMING AND COLLABORATIVE WORK ENVIRONMENT.PROVIDE FINANCIAL GUIDANCE AND SUPPORT TO FAMILY MEMBERS AND STAKEHOLDERS, SERVING AS A TRUSTED ADVISOR ON MATTERS RELATED TO WEALTH MANAGEMENT, ESTATE PLANNING, AND FINANCIAL GOALS.TRACK AND RECONCILE TRUST ACCOUNTS. REVIEW AND SHARE TRUST STATEMENTS TO BENEFICIARIES.REPORTING AND BUDGETING FOR PHILANTHROPY COMMITTEE.ADMINISTER TO THE FIRM'S 401K PROGRAM INCLUDING INFORMATION REQUESTS FOR ANNUAL AUDIT.",
    "job_skill_set": [
      "Accounting",
      "Financial Analysis",
      "General Ledger Management",
      "Budgeting and Forecasting",
      "Cash Flow Management",
      "Internal Controls",
      "Team Leadership",
      "Communication",
      "Collaboration",
      "Problem Solving",
      "Mentoring",
      "Analytical Thinking",
      "Attention to Detail",
      "Adaptability",
      "Trustworthiness",
      "CPA",
      "Financial Statements Preparation",
      "Tax Compliance",
      "Investment Accounting",
      "Trust Account Management",
      "401K Administration"
    ],
    "short_keywords": [
      "401k",
      "account",
      "accounting",
      "adaptability",
      "administration",
      "analysis",
      "analytical",
      "and",
      "attention",
      "budgeting",
      "cash",
      "collaboration",
      "communication",
      "compliance",
      "controls",
      "cpa",
      "detail",
      "family",
      "finance",
      "financial",
      "flow",
      "forecasting",
      "general",
      "internal",
      "investment",
      "leadership",
      "ledger",
      "management",
      "manager",
      "mentoring",
      "office",
      "preparation",
      "problem",
      "solving",
      "statements",
      "tax",
      "team",
      "thinking",
      "to",
      "trust",
      "trustworthiness"
    ]
  },
  {
    "job_id": "3904726135",
    "job_title": "Auto Finance & Insurance Manager - City Auto Group",
    "category": "FINANCE",
    "job_description": "5330 WEST IRVING PARK RD., CHICAGO, IL 60641\n\nAUTOMOTIVE FINANCE AND INSURANCE MANAGER\n\nFOR OUR NATIONAL AWARD-WINNING & PREMIER VW STORE!\n\nAUTO F&I EXPERIENCE IS REQUIRED\n\n$180,000 - $240,000+ INCOME! EXCELLENT BENEFITS!\n\nTHE CITY AUTO GROUP IS ONE OF THE FASTEST GROWING PRIVATELY OWNED AUTO GROUPS IN THE MIDWEST! WE TAKE PRIDE IN THE GROWTH AND DEVELOPMENT OF OUR EMPLOYEES, OFFER MARKET LEADING COMPENSATION, FLEXIBLE WORK SCHEDULES, AND A FANTASTIC BENEFITS PACKAGE INCLUDING A 401(K) MATCH! WE ARE A FIRST-GENERATION DEALER GROUP THAT SEES THE CAR BUSINESS THROUGH A VASTLY DIFFERENT LENS THAN OTHERS IN THE INDUSTRY.\n\nCITY VOLKSWAGEN OF CHICAGO IS OUR PREMIER (AND FIRST) STORE AND WAS AWARDED THE NATIONAL VW DEALER OF THE YEAR BY DEALER RATER! DUE TO OUR SUCCESS WE NEED TO HIRE EXPERIENCED FINANCE AND INSURANCE MANAGERS TO ARRANGE VEHICLE FINANCING FOR CUSTOMERS, SELL AFTER-MARKET PRODUCTS AND MORE. AT LEAST 2 YEARS OF AUTOMOTIVE F&I EXPERIENCE IS REQUIRED.  APPLY NOW FOR THIS GREAT OPPORTUNITY TO DRIVE YOUR CAREER FORWARD WITH OUR GROWING ORGANIZATION!\n\nRESPONSIBILITIES - AUTO FINANCE AND INSURANCE MANAGER:\n\nARRANGE VEHICLE FINANCING OPTIONS FOR CUSTOMERS AND SELL AFTER-MARKET PRODUCTS AND EXTENDED WARRANTIESSEEK AND MAINTAIN GOOD WORKING RELATIONSHIPS WITH LENDING INSTITUTIONSMEET DEALERSHIP SALES GOALSMAINTAIN HIGH CUSTOMER SATISFACTION INDEX SCORE\n\n\nREQUIREMENTS - AUTO FINANCE AND INSURANCE MANAGER:\n\nAT LEAST 2 YEARS OF AUTOMOTIVE F&I EXPERIENCE IS REQUIREDPROFICIENT IN STRUCTURING DEALS FOR MAXIMUM PROFITABILITYFULLY VERSED IN LEASING AND SPECIAL FINANCEEXPERIENCED WITH STATE LAW REQUIREMENTS INCLUDING REGISTRATIONS, TAG, TAX, AND TITLE PAPERWORKHIGH ETHICAL STANDARDS AND STRONG ATTENTION TO DETAILSEXCELLENT CUSTOMER SERVICE, COMMUNICATION, AND DECISION-MAKING SKILLSCOMPUTER PROFICIENT, A GOOD WORK ETHIC AND PROFESSIONAL APPEARANCEABLE TO PRIORITIZE TASKS AND HAVE GOOD TIME MANAGEMENT SKILLS\n\n\nWE OFFER EXCELLENT BENEFITS:\n\n$180,000 - $240,000+ PERFORMANCE-BASED POTENTIAL INCOME!401(K) WITH EMPLOYER MATCH!MEDICAL AND DENTAL INSURANCE PAID VACATION AND HOLIDAYS5-DAY WORK WEEK, CLOSED ON SUNDAYSMONTHLY EMPLOYEE RECOGNITION EMPLOYEE DISCOUNTS ON VEHICLES AND MORECAREER GROWTH AND ADVANCEMENT\n\n\nWE ARE AN EQUAL OPPORTUNITY EMPLOYER",
    "job_skill_set": [
      "customer service",
      "computer proficiency",
      "time management",
      "communication",
      "attention to detail",
      "work ethic",
      "relationship building",
      "prioritization",
      "automotive finance",
      "insurance management",
      "deal structuring",
      "leasing",
      "state law compliance",
      "decision-making"
    ],
    "short_keywords": [
      "attention",
      "auto",
      "automotive",
      "building",
      "city",
      "communication",
      "compliance",
      "computer",
      "customer",
      "deal",
      "decisionmaking",
      "detail",
      "ethic",
      "finance",
      "group",
      "insurance",
      "law",
      "leasing",
      "management",
      "manager",
      "prioritization",
      "proficiency",
      "relationship",
      "service",
      "state",
      "structuring",
      "time",
      "to",
      "work"
    ]
  },
  {
    "job_id": "3905843981",
    "job_title": "Senior Finance Manager",
    "category": "FINANCE",
    "job_description": "COMPANY DESCRIPTION EMPIRE AUTOMOTIVE GROUP IS A CAR DEALERSHIP LOCATED IN JAMAICA, NY. WE PROUDLY SERVE HUNTINGTON, WEST ISLIP, NEW ROCHELLE, WHITE PLAINS, MANHASSET, LYNBROOK, QUEENS, LONG ISLAND CITY, AND THE SURROUNDING COMMUNITIES. WE OFFER A WIDE SELECTION OF QUALITY BRAND VEHICLES AND ARE COMMITTED TO PROVIDING EXCELLENT CUSTOMER SERVICE THROUGHOUT THE VEHICLE BUYING AND OWNING JOURNEY.\n ROLE DESCRIPTION THIS IS A FULL-TIME ON-SITE ROLE FOR A SENIOR FINANCE MANAGER. THE SENIOR FINANCE MANAGER WILL BE RESPONSIBLE FOR OVERSEEING THE FINANCIAL OPERATIONS OF THE DEALERSHIP, INCLUDING BUDGETING, FORECASTING, FINANCIAL ANALYSIS, AND REPORTING. THEY WILL ALSO COLLABORATE WITH OTHER DEPARTMENTS TO ENSURE FINANCIAL GOALS ARE MET AND PROVIDE STRATEGIC INSIGHTS TO DRIVE BUSINESS GROWTH.\n QUALIFICATIONS STRONG FINANCIAL ACUMEN AND KNOWLEDGE OF ACCOUNTING PRINCIPLESEXPERTISE IN FINANCIAL ANALYSIS, BUDGETING, AND FORECASTINGEXPERIENCE IN MANAGING FINANCIAL OPERATIONS WITHIN THE AUTOMOTIVE INDUSTRYEXCELLENT COMMUNICATION AND INTERPERSONAL SKILLSABILITY TO WORK EFFECTIVELY IN A FAST-PACED AND DYNAMIC ENVIRONMENTSPANISH SPEAKING IS A PLUS BUT NOT REQUIREDEXPERIANCE USING REYNOLDS AND ROUTE ONE REQUIRED",
    "job_skill_set": [
      "financial analysis",
      "budgeting",
      "accounting principles",
      "financial operations management",
      "communication",
      "interpersonal skills",
      "adaptability",
      "strategic thinking",
      "forecasting",
      "Reynolds and Route One software",
      "automotive industry knowledge"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "analysis",
      "and",
      "automotive",
      "budgeting",
      "communication",
      "finance",
      "financial",
      "forecasting",
      "industry",
      "interpersonal",
      "knowledge",
      "management",
      "manager",
      "one",
      "operations",
      "principles",
      "reynolds",
      "route",
      "senior",
      "skills",
      "software",
      "strategic",
      "thinking"
    ]
  },
  {
    "job_id": "3904407460",
    "job_title": "Finance Director",
    "category": "FINANCE",
    "job_description": "DO YOU WANT TO WORK FOR A GLOBAL POWERHOUSE IN PREPARED FOOD INNOVATION? MY CLIENT ARE THE LEADERS IN REVOLUTIONIZING THE INDUSTRY, MAKING SIGNIFICANT STRIDES ACROSS THE US AND GLOBALLY WITH THEIR PRODUCTS IN MAJOR GROCERY CHAINS. IF YOU HAVE STRONG FOOD AND BEVERAGE BACKGROUND AND EXPERIENCE LEADING COMMERCIAL FINANCE LOOK NO FURTHER. \nPOSITION OVERVIEW: DIRECTOR OF FINANCEWE ARE SEEKING A SEASONED FINANCE DIRECTOR WITH A STRONG BACKGROUND IN THE FOOD MANUFACTURING SECTOR TO LEAD OUR FINANCIAL STRATEGIES AND OPERATIONS. JOIN US IN DRIVING FINANCIAL EXCELLENCE AND CONTRIBUTING TO OUR LONG-TERM SUCCESS.\nYOUR RESPONSIBILITIES:DEVELOP COMPREHENSIVE FINANCIAL PLANS, ANALYZING PERFORMANCE AND MITIGATING RISKS.ENSURE FINANCIAL STABILITY THROUGH VIGILANT MONITORING AND PROACTIVE MEASURES.LEAD AND MENTOR FINANCE TEAMS, SETTING CLEAR OBJECTIVES AND FOSTERING A CULTURE OF EXCELLENCE.OVERSEE AUDIT AND INTERNAL CONTROL PROCESSES TO ENSURE REGULATORY COMPLIANCE.COLLABORATE ON BUSINESS PLANNING, PROVIDING STRATEGIC INSIGHTS AND ANALYTICAL SUPPORT.ENSURE ADHERENCE TO FINANCIAL LAWS AND INDUSTRY BEST PRACTICES.UTILIZE DATA ANALYTICS TO IDENTIFY OPERATIONAL TRENDS AND OPPORTUNITIES.DEVELOP AND MANAGE BUDGETS, FORECASTS, AND FINANCIAL MODELS TO SUPPORT DECISION-MAKING.CONDUCT THOROUGH ANALYSIS OF BUSINESS ACTIVITIES TO DRIVE INFORMED DECISIONS.STREAMLINE REPORTING PROCESSES THROUGH AUTOMATION FOR EFFICIENCY AND ACCURACY.\nMINIMUM QUALIFICATIONS:5+ YEARS OF EXPERIENCE IN A FINANCE DIRECTOR OR SIMILAR ROLE WITHIN THE FOOD MANUFACTURING INDUSTRY.STRONG KNOWLEDGE OF COMMERCIAL FINANCE, ACCOUNTING PRINCIPLES, AND BEST PRACTICES.PROFICIENCY IN FINANCIAL ANALYSIS, FORECASTING, AND FINANCIAL MANAGEMENT SOFTWARE.ADVANCED SKILLS IN MS OFFICE, ESPECIALLY EXCEL AND POWERPOINT.BACHELOR'S DEGREE IN ACCOUNTING, FINANCE, OR A RELATED FIELD; MASTER'S DEGREE PREFERRED.CPA OR RELEVANT PROFESSIONAL QUALIFICATION IS A PLUS.EXCELLENT COMMUNICATION, LEADERSHIP, AND ORGANIZATIONAL SKILLS.PROACTIVE, SELF-MOTIVATED, AND TEAM-ORIENTED MINDSET WITH A FOCUS ON RESULTS.",
    "job_skill_set": [
      "financial analysis",
      "accounting principles",
      "MS Office",
      "Excel",
      "regulatory compliance",
      "leadership",
      "communication",
      "results-oriented",
      "forecasting",
      "financial management software",
      "data analytics",
      "budget management",
      "PowerPoint",
      "audit processes",
      "financial modeling",
      "organizational skills",
      "team-oriented mindset",
      "proactive",
      "self-motivated"
    ],
    "short_keywords": [
      "accounting",
      "analysis",
      "analytics",
      "audit",
      "budget",
      "communication",
      "compliance",
      "data",
      "director",
      "excel",
      "finance",
      "financial",
      "forecasting",
      "leadership",
      "management",
      "mindset",
      "modeling",
      "ms",
      "office",
      "organizational",
      "powerpoint",
      "principles",
      "proactive",
      "processes",
      "regulatory",
      "resultsoriented",
      "selfmotivated",
      "skills",
      "software",
      "teamoriented"
    ]
  },
  {
    "job_id": "3887884760",
    "job_title": "Senior Director of Finance",
    "category": "FINANCE",
    "job_description": "COMPANY OVERVIEW\n\nBUILT IS A GROWTH-STAGE COMPANY AT THE INTERSECTION OF FINTECH AND PROPTECH. WE ARE ON A MISSION TO CHANGE THE WAY THE WORLD GETS BUILT WITH TECHNOLOGY AND SERVICES THAT STREAMLINE THE $1.4T U.S. CONSTRUCTION INDUSTRY.\n\nBUILT’S PLATFORM FOR THE CONSTRUCTION FINANCE INDUSTRY MODERNIZES THE MOVEMENT OF MONEY BETWEEN ALL STAKEHOLDERS WITHIN THE CONSTRUCTION AND REAL ESTATE PROCESS TO MANAGE RISK AND MAXIMIZE PRODUCTIVITY. BUILT PROVIDES SOFTWARE, PAYMENTS, B2B MARKETPLACE, AND DATA SOLUTIONS TO MORE THAN 190 OF THE TOP FINANCIAL INSTITUTIONS AND HUNDREDS OF CONTRACTORS THROUGHOUT NORTH AMERICA.\n\nIN ADDITION TO OUR RECENT $125M SERIES D FUNDING AND $1.5B VALUATION, WE’RE PROUD TO HAVE BEEN NAMED ONE OF FORBES’ BEST STARTUP EMPLOYERS IN AMERICA AND ONE OF THE TENNESSEAN’S 2022 TOP WORKPLACES . BRINGING ON THE “BEST TALENT IN THE WORLD” IS AT THE FOREFRONT OF OUR CONTINUED GROWTH TRAJECTORY—AND WE WANT YOU TO BE PART OF IT.\n\nLINKS\n\n SERIES D FINANCING ROUND  BUILT UPON 2021 SUCCESS \n\nROLE SUMMARY\n\nWE ARE SEEKING AN EXPERIENCED FINANCE LEADER TO JOIN BUILT AS THE SENIOR DIRECTOR OF FINANCE, REPORTING TO BUILT’S CFO AND RESPONSIBLE FOR ALL ASPECTS OF FINANCIAL REPORTING, FINANCIAL PLANNING AND ANALYSIS (FP&A), OPERATIONAL AND STRATEGIC DECISION SUPPORT, MAINTAINING BUILT’S LONG-RANGE PLAN, AND BUILDING A WORLD-CLASS FINANCE PRACTICE AT BUILT. THIS ROLE IS CRUCIAL IN PROVIDING STRATEGIC INSIGHTS AND FINANCIAL GUIDANCE TO SUPPORT OUR COMPANY'S GROWTH OBJECTIVES. THE IDEAL CANDIDATE WILL POSSESS A DEEP UNDERSTANDING OF FINANCIAL MODELING, BUDGETING, FORECASTING, AND ANALYSIS, COUPLED WITH A STRATEGIC MINDSET, AN ACUTE UNDERSTANDING OF HOW TO DRIVE CHANGE THROUGH A PEOPLE-FIRST LEADERSHIP STYLE, A TENACIOUS PURSUIT OF EXCELLENCE, AND HIGH RESPONSIBILITY AS A KEY PARTNER TO THE CEO, EXECUTIVE TEAM, AND BROADER BUSINESS.\n\nIN THIS ROLE YOU WILL\n\nFINANCIAL PLANNING & ANALYSIS: PROVIDING STRATEGIC DIRECTION AND OVERSIGHT FOR ALL FINANCIAL PLANNING, BUDGETING, FORECASTING, AND ANALYSIS ACTIVITIES. DEVELOP AND MAINTAIN SOPHISTICATED FINANCIAL MODELS TO SUPPORT DECISION-MAKING BY EXECUTIVE LEADERSHIP AND THE BOARD OF DIRECTORS.FINANCIAL REPORTING: ENSURE THE ACCURATE AND TIMELY PREPARATION OF FINANCIAL STATEMENTS AND REPORTS, INCLUDING PROFIT AND LOSS, BALANCE SHEET, AND CASH FLOW STATEMENTS. IMPLEMENT BEST PRACTICES IN FINANCIAL REPORTING TO ENHANCE TRANSPARENCY AND COMPLIANCE WITH RELEVANT ACCOUNTING STANDARDS AND REGULATIONS.DECISION SUPPORT: ACT AS A STRATEGIC ADVISOR TO BUSINESS UNITS AND FUNCTIONAL LEADERS, OFFERING INSIGHTS AND ANALYSIS TO SUPPORT OPERATIONAL EFFICIENCY AND STRATEGIC INITIATIVES. CONDUCT IN-DEPTH FINANCIAL ANALYSIS TO IDENTIFY OPPORTUNITIES FOR COST SAVINGS, REVENUE ENHANCEMENT, AND PROCESS IMPROVEMENTS. COLLABORATE WITH CROSS-FUNCTIONAL TEAMS TO ALIGN FINANCIAL PLANNING WITH OPERATIONAL STRATEGIES.STRATEGIC FINANCE: SERVE AS A KEY ADVISOR TO THE CFO AND EXECUTIVE TEAM ON FINANCIAL MATTERS, CONTRIBUTING TO THE FORMULATION OF CORPORATE STRATEGY AND FINANCIAL OBJECTIVES, INCLUDING ORGANIC AND INORGANIC GROWTH.CAPITAL ALLOCATION: LEAD THE DEVELOPMENT AND EXECUTION OF THE ANNUAL BUDGET, WORKING CLOSELY WITH DEPARTMENT HEADS TO ENSURE ALIGNMENT WITH STRATEGIC OBJECTIVES. EMBED FRUGALITY AND WORLD-CLASS RESOURCE ALLOCATION AS A CULTURAL AND OPERATIONAL NORM THROUGH MONTHLY BUDGET VARIANCE ANALYSIS AND SUPPORTING LEADERS AS THEY MANAGE TRADEOFFS IN RESOURCE ALLOCATION.FORECASTING AND SCENARIO ANALYSIS: CONDUCT MONTHLY AND QUARTERLY FORECASTING TO PROJECT FINANCIAL OUTCOMES BASED ON CURRENT AND ANTICIPATED BUSINESS ACTIVITIES. DEVELOP SCENARIO ANALYSIS MODELS TO EVALUATE THE FINANCIAL IMPACT OF STRATEGIC DECISIONS, MACROECONOMIC CONDITIONS, INITIATIVE PERFORMANCE, AND OPERATIONAL TRADEOFFS.FINANCIAL REPORTING AND ANALYSIS: OVERSEE THE GENERATION OF MONTHLY, QUARTERLY, AND ANNUAL FINANCIAL REPORTS, PROVIDING ANALYSIS AND INSIGHTS ON KEY PERFORMANCE INDICATORS (KPIS), FINANCIAL TRENDS, AND BUSINESS DRIVERS. ENSURE STAKEHOLDERS HAVE THE INFORMATION NEEDED TO MAKE INFORMED DECISIONS.BUILDING A WORLD-CLASS FINANCE FUNCTION: CHAMPION THE TRANSFORMATION OF THE FP&A FUNCTION INTO A WORLD-CLASS FINANCE TEAM. IMPLEMENT LEADING-EDGE FINANCIAL SYSTEMS, PROCESSES, AND ANALYTICS TOOLS TO ENHANCE EFFICIENCY, ACCURACY, AND STRATEGIC INSIGHT. FOSTER A CULTURE OF CONTINUOUS IMPROVEMENT, INNOVATION, AND PROFESSIONAL DEVELOPMENT WITHIN THE FINANCE TEAM.BOARD AND INVESTOR COMMUNICATIONS: LEAD THE PREPARATION AND PRESENTATION OF FINANCIAL REPORTS FOR BOARD MEETINGS AND INVESTOR UPDATES. ARTICULATE FINANCIAL STRATEGIES, PERFORMANCE, AND FORECASTS EFFECTIVELY TO ENSURE UNDERSTANDING AND SUPPORT FROM EXTERNAL STAKEHOLDERS.MENTORSHIP AND TEAM DEVELOPMENT: MENTOR AND DEVELOP THE FP&A TEAM, FOSTERING A CULTURE OF HIGH PERFORMANCE, CONTINUOUS IMPROVEMENT, AND PROFESSIONAL GROWTH. ENSURE THE TEAM POSSESSES THE SKILLS, KNOWLEDGE, AND MOTIVATION TO SUPPORT THE ORGANIZATION'S FINANCIAL AND STRATEGIC OBJECTIVES.\n\nWHO YOU ARE\n\nBACHELOR'S OR MASTER’S DEGREE IN FINANCE, ACCOUNTING, OR RELATED FIELD.DEMONSTRATED EXPERTISE IN FINANCIAL PLANNING AND ANALYSIS, IN A LEADERSHIP ROLE AND PREFERABLY WITHIN A HIGH-GROWTH ENTERPRISE SOFTWARE OR TECHNOLOGY COMPANY.PREFERRED PRIOR EXPERIENCE IN INVESTMENT BANKING, VENTURE CAPITAL/PRIVATE EQUITY, OR RELATED FIELDS.PROVEN TRACK RECORD OF DEVELOPING FINANCIAL STRATEGIES, BUILDING FINANCIAL MODELS, AND LEADING BUDGETING AND FORECASTING PROCESSES.DEEP UNDERSTANDING OF HOW TO CONNECT OPERATIONAL COMPONENTS TO FINANCIAL OUTCOMES, BOTH MECHANISTICALLY WITHIN REPORTING, FORECASTING, AND DECISION MAKING, AS WELL AS CONNECTIVITY BETWEEN TEAMS WITHIN AN ORGANIZATION.STRONG ANALYTICAL, PROBLEM-SOLVING, AND DECISION-MAKING SKILLS, WITH THE ABILITY TO INTERPRET COMPLEX DATA AND TRANSLATE IT INTO ACTIONABLE INSIGHTS.EXCELLENT COMMUNICATION AND PRESENTATION SKILLS, WITH THE CAPABILITY TO CONVEY FINANCIAL CONCEPTS TO NON-FINANCIAL STAKEHOLDERS.STRONG MANAGEMENT SKILLS, INCLUDING PROCESS AND PROJECT MANAGEMENT, MANAGING DELIVERABLES ACROSS MULTIPLE CONSTITUENCIES.\n\nBUILT’S SALARY RANGE FOR THIS POSITION IS $225,000-$270,000 USD PER YEAR. THE PAY RANGE IS DESIGNED TO ACCOMMODATE UPWARD MOBILITY IN THE ROLE, THEREFORE IT ENCOMPASSES THE FULL SPAN OF PROFICIENCY LEVELS FOR THIS ROLE AND WE BELIEVE THAT THE MIDPOINT OF THE RANGE IS COMPETITIVE IN THE MARKET. SALARY IS JUST ONE COMPONENT OF BUILT'S TOTAL COMPENSATION PACKAGE FOR EMPLOYEES. YOUR TOTAL REWARDS PACKAGE AT BUILT WILL INCLUDE EQUITY, TOP-NOTCH MEDICAL, DENTAL AND VISION COVERAGE, AN UNLIMITED PTO POLICY, AND OTHER BENEFITS.\n\nPERKS\n\n THE RARE OPPORTUNITY TO RADICALLY DISRUPT AN INDUSTRY  COMPETITIVE BENEFITS INCLUDING: UNCAPPED VACATION, HEALTH, DENTAL & VISION INSURANCE, AND 401K  ROBUST COMPENSATION PACKAGE INCLUDING BASE SALARY AND EQUITY  FLEXIBLE WORKING HOURS, PAID FAMILY LEAVE, ERGS & MENTORSHIP OPPORTUNITIES  LEARNING GRANT PROGRAM TO SUPPORT ONGOING PROFESSIONAL DEVELOPMENT \n\nOUR COMPANY IS MADE UP OF PASSIONATE PEOPLE WHO ARE DRIVEN IN A VARIETY OF DISCIPLINES—AND EACH OF THEM BRINGS THEIR UNIQUE PERSPECTIVE TO EVERYTHING THEY DO. CREATING A SAFE AND INCLUSIVE WORKPLACE IS CRITICAL TO THE SUCCESS OF OUR COMPANY AND OF OUR EMPLOYEES, SO IT’S OUR AIM TO RECRUIT, HIRE AND PROMOTE WITHOUT BIAS AGAINST RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, MARITAL STATUS, VETERAN STATUS OR ANY OTHER STATUS PROTECTED BY APPLICABLE LAW. AS WE LEARN AND AS WE GROW, WE’RE COMMITTED TO ENSURING THAT THESE IDEALS ARE AT THE FOREFRONT OF EVERYTHING WE DO.\n\nGREENHOUSE DISCLOSURE\n\nWHEN YOU APPLY TO A JOB ON THIS SITE, THE PERSONAL DATA CONTAINED IN YOUR APPLICATION WILL BE COLLECTED BY BUILT TECHNOLOGIES (“CONTROLLER”). YOUR PERSONAL DATA WILL BE PROCESSED FOR THE PURPOSES OF MANAGING CONTROLLER’S RECRUITMENT RELATED ACTIVITIES, WHICH INCLUDE SETTING UP AND CONDUCTING INTERVIEWS AND TESTS FOR APPLICANTS, EVALUATING AND ASSESSING THE RESULTS THERETO, AND AS IS OTHERWISE NEEDED IN THE RECRUITMENT AND HIRING PROCESSES.\n\nYOUR PERSONAL DATA WILL BE SHARED WITH GREENHOUSE SOFTWARE, INC., A CLOUD SERVICES PROVIDER LOCATED IN THE UNITED STATES OF AMERICA AND ENGAGED BY CONTROLLER TO HELP MANAGE ITS RECRUITMENT AND HIRING PROCESS ON CONTROLLER’S BEHALF.\n\nYOUR PERSONAL DATA WILL BE RETAINED BY CONTROLLER AS LONG AS CONTROLLER DETERMINES IT IS NECESSARY TO EVALUATE YOUR APPLICATION FOR CURRENT OR FUTURE EMPLOYMENT. YOU HAVE THE RIGHT TO REQUEST ACCESS TO YOUR PERSONAL DATA, TO REQUEST THAT YOUR PERSONAL DATA BE RECTIFIED OR ERASED, AND TO REQUEST THAT PROCESSING OF YOUR PERSONAL DATA BE RESTRICTED. YOU ALSO HAVE TO RIGHT TO DATA PORTABILITY.\n\nIF YOU WOULD LIKE TO CONTACT CONTROLLER TO ASK QUESTIONS SURROUNDING PROCESSING OF YOUR PERSONAL DATA OR TO MAKE A REQUEST, YOU CAN SEND AN EMAIL TO PRIVACY@GETBUILT.COM .\n\nFOR CALIFORNIA RESIDENTS: PLEASE NOTE THAT CONTROLLER DOES NOT SELL YOUR PERSONAL DATA OR SHARE IT WITH THIRD PARTIES OUTSIDE OF GREENHOUSE SOFTWARE, INC.",
    "job_skill_set": [
      "financial reporting",
      "data analysis",
      "financial statements preparation",
      "financial compliance",
      "strategic thinking",
      "communication",
      "problem solving",
      "team development",
      "collaboration",
      "adaptability",
      "innovation",
      "financial planning and analysis",
      "financial modeling",
      "budgeting",
      "forecasting",
      "capital allocation",
      "scenario analysis",
      "financial systems implementation",
      "leadership",
      "project management",
      "mentorship"
    ],
    "short_keywords": [
      "adaptability",
      "allocation",
      "analysis",
      "and",
      "budgeting",
      "capital",
      "collaboration",
      "communication",
      "compliance",
      "data",
      "development",
      "director",
      "finance",
      "financial",
      "forecasting",
      "implementation",
      "innovation",
      "leadership",
      "management",
      "mentorship",
      "modeling",
      "of",
      "planning",
      "preparation",
      "problem",
      "project",
      "reporting",
      "scenario",
      "senior",
      "solving",
      "statements",
      "strategic",
      "systems",
      "team",
      "thinking"
    ]
  },
  {
    "job_id": "3885814238",
    "job_title": "PeopleSoft Finance Techno-Functional Consultant",
    "category": "FINANCE",
    "job_description": "PEOPLESOFT FSCM TECHNO FUNCTIONAL KNOWLEDGE WITH STRONG UNDERSTANDING OF SOFTWARE DEVELOPMENT LIFE CYCLE (SDLC) IMPLEMENTATION EXPERTISE\n\nGATHERING BUSINESS REQUIREMENTS, PERFORMING GAP ANALYSIS, DESIGNING NEW OR MODIFIED BUSINESS PROCESS\n\nAPPLICATION CONFIGURATION, DEVELOP INTERFACES, ENHANCEMENTS, REPORTS AND CONVERSION SPECIFICATIONS, SYSTEM TESTING, INTEGRATION TESTING AND UAT",
    "job_skill_set": [
      "Gap Analysis",
      "Reports Development",
      "Analytical Thinking",
      "Problem Solving",
      "Communication",
      "Collaboration",
      "Attention to Detail",
      "PeopleSoft FSCM",
      "SDLC",
      "Business Requirements Gathering",
      "Application Configuration",
      "Interface Development",
      "Enhancements",
      "Conversion Specifications",
      "System Testing",
      "Integration Testing",
      "UAT"
    ],
    "short_keywords": [
      "analysis",
      "analytical",
      "application",
      "attention",
      "business",
      "collaboration",
      "communication",
      "configuration",
      "consultant",
      "conversion",
      "detail",
      "development",
      "enhancements",
      "finance",
      "fscm",
      "gap",
      "gathering",
      "integration",
      "interface",
      "peoplesoft",
      "problem",
      "reports",
      "requirements",
      "sdlc",
      "solving",
      "specifications",
      "system",
      "technofunctional",
      "testing",
      "thinking",
      "to",
      "uat"
    ]
  },
  {
    "job_id": "3901484445",
    "job_title": "Finance Accounting Manager",
    "category": "FINANCE",
    "job_description": "PERFORM AS AN INTERNAL EXPERT ON ACCOUNTING PRINCIPLES AND UPDATES TO REGULATORY REQUIREMENTS.FOSTER AN ENVIRONMENT OF GROWTH AND DEVELOPMENT THROUGH THE STRONG LEADERSHIP OF DIRECT REPORTS AND BY COMMUNICATING EFFECTIVELY WITH EXEC/C-SUITE LEADERS.UNDERTAKE SPECIAL PROJECTS AIMED AT ACHIEVING CORPORATE PERFORMANCE GOALS.COLLABORATE WITH THE FINANCE DIRECTOR ON QUARTERLY FINANCIAL EARNING REPORTS.PARTNER WITH LEADERSHIP GROUP TO ESTABLISH PIVOTAL PERFORMANCE METRICS FOR ENHANCING OUTCOMES.ACT AS A KEY INTERNAL PARTNER WITH REGARDS TO SPEARHEADING ENHANCEMENTS IN PLANNING, BUDGETING, AND FORECASTING MECHANISMS.ALLOCATE, EXAMINE AND VALIDATE MONTH-END CLOSING ENTRIES AND RECONCILIATIONSENSURE ACCURATE REVENUE RECOGNITION BY ASSESSING MONTHLY SALES, CREDIT MEMOS, AND ARVERIFY THE ACCURACY OF REPORTED COMMISSIONS AND BONUSES, ENSURING PROPER PAYMENT.CONDUCT THOROUGH REVIEW OF ACCOUNT RECEIVABLES, PRESENTING FINDINGS TO MANAGEMENT AND LIAISING WITH SALES TEAMS ON OUTSTANDING BALANCES.COORDINATE AND COMPILE FINANCIAL, BANKING, AND TAX REPORTING PACKAGES IN ACCORDANCE WITH COMPANY POLICIES AND GAAP STANDARDS, INCLUDING ASSIGNMENT OF TASKS AND REVIEW OF OUTPUTS.DEVELOP INTERNAL CONTROL MEASUREMENTS AND PRESENT NARRATIVES TO ASSESS CONTROL EFFECTIVENESS, PROVIDING GUIDANCE ON ENHANCEMENTS IN RESPONSE TO EVOLVING BUSINESS CONDITIONS.ASSIST LEADERSHIP IN FINANCIAL AND TAX AUDIT PROCESSES, INCLUDING TASK ALLOCATION AND REVIEW OF OUTPUTS.\nTHIS IS THE IDEAL OPPORTUNITY FOR SOMEONE STEPPING OUT OF PUBLIC ACCOUNTING FOR THE FIRST TIME AND CURIOUS ABOUT A POSITION WITHIN INDUSTRY. ADDITIONALLY, IF YOU ARE EITHER CPA LICENSED OR CPA TRACKING (IDEALLY MORE THAN 2 EXAMS PASSED) YOU WILL BE CONSIDERED AS AN IDEAL CANDIDATE. PUBLIC ACCOUNTING EXPERIENCE OF 2-3 YEARS IS A MUST HAVE REQUIREMENT.",
    "job_skill_set": [
      "Accounting Principles",
      "Regulatory Requirements",
      "Financial Reporting",
      "GAAP Standards",
      "Budgeting",
      "Forecasting",
      "Internal Controls",
      "Tax Reporting",
      "Public Accounting Experience",
      "Leadership",
      "Communication",
      "Collaboration",
      "Analytical Skills",
      "Problem Solving",
      "Presentation Skills",
      "Task Management",
      "CPA License"
    ],
    "short_keywords": [
      "accounting",
      "analytical",
      "budgeting",
      "collaboration",
      "communication",
      "controls",
      "cpa",
      "experience",
      "finance",
      "financial",
      "forecasting",
      "gaap",
      "internal",
      "leadership",
      "license",
      "management",
      "manager",
      "presentation",
      "principles",
      "problem",
      "public",
      "regulatory",
      "reporting",
      "requirements",
      "skills",
      "solving",
      "standards",
      "task",
      "tax"
    ]
  },
  {
    "job_id": "3904373035",
    "job_title": "Sr Manager Finance (Calhoun, Georgia, United States, 30701)",
    "category": "FINANCE",
    "job_description": "ARE YOU LOOKING FOR MORE?\n\nAT MOHAWK INDUSTRIES, WE’RE COMMITTED TO MORE – MORE CUSTOMER SOLUTIONS, MORE PROCESS IMPROVEMENTS, MORE SUSTAINABLE MANUFACTURING AND MORE OPPORTUNITIES FOR OUR TEAM.\n\nAS A FORTUNE 500, GLOBAL FLOORING LEADER WITH SOME OF THE BEST-KNOWN BRANDS IN THE INDUSTRY, MOHAWK IS A GREAT PLACE TO START OR DEVELOP YOUR CAREER WITH AN EMPHASIS ON MORE OF WHAT’S IMPORTANT TO YOU. WHETHER YOU WANT TO LEAD MORE, INNOVATE MORE, LEARN MORE OR CREATE MORE, YOU CAN FIND YOUR MORE WITH MOHAWK.\n\nWHAT WE NEED\n\nMOHAWK IS LOOKING FOR A SR FINANCE MANAGER WHO WILL OVERSEE AND DIRECT THE FINANCE AND ACCOUNTING ACTIVITIES FOR OUR CORPORATE FUNCTIONS. THE TEAM IS RESPONSIBLE FOR VARIOUS ACTIVITIES IN BOTH FINANCE AND ACCOUNTING, RANGING FROM BUDGETING, FINANCIAL CLOSE AS WELL AS BUSINESS PARTNERING WITH THE CORPORATE FUNCTIONAL LEADERS THROUGH REPORTING AND ANALYSIS.\n\nTHE SR FINANCE MANAGER WILL WORK WITH LEADERSHIP FROM DIFFERENT AREAS TO ENGAGE AS A BUSINESS PARTNER ON MULTIPLE ASPECTS; SUPPORTING WITH ESTABLISHING EXPENSE MANAGEMENT PROCESSES AND SYSTEMS, ENHANCING FORECAST CAPABILITIES AND IDENTIFYING RISKS AND OPPORTUNITIES FOR THE BUSINESS.\n\nWHAT YOU’LL DO\n\nLEAD THE DEVELOPMENT AND EXECUTION OF STRATEGIC AND OPERATIONAL SG&A PLANS THAT DRIVE LONG-RANGE FINANCIAL AND BUSINESS PLANSWORK COLLABORATIVELY WITH BUSINESS UNITS, IS AND HEADS OF DEPARTMENTS TO CREATE AND IMPLEMENT PROCESSES AND TOOLS USED TO IMPROVE FINANCIAL AND STRATEGIC PLANNING, ANNUAL BUDGETS AND QUARTERLY FORECASTSDEVELOP EXPENSE MANAGEMENT PROCESSES AND SYSTEMS, LEVERAGING ZBB METHODOLOGY, TO DIFFERENT DEPARTMENTS AND BUSINESS UNITS , IMPROVING INFORMATION FLOW TO GUARANTEE ACCURACY, TRANSPARENCY AND SPEED IN THE BUDGETING PROCESSPROVIDE IN-DEPTH ANALYTICAL AND FINANCIAL EXPERTISE TO THE FINANCE ORGANIZATIONASSIST DURING MONTHLY CLOSE, AS WELL AS DEVELOPING AND PROVIDING FINANCIAL AND OPERATIONAL PERFORMANCE REPORTING AND ENSURING THE INTEGRITY OF THE DATA SUPPORT THE FINANCE ORGANIZATION IN OTHER ANALYTICAL INITIATIVES, INCLUDING BUT NOT LIMITED TO BUDGETING, FORECASTING, ACTUAL REPORTING AND ADHOC ANALYSISSTAY ABREAST OF THE INDUSTRY AND ECONOMIC CHANGE AND TRENDSASSIST IN DATA MANAGEMENT AND FINANCIAL REPORTING; SYNTHESIZING GROUP REPORTING UTILIZING MULTIPLE SYSTEMSENSURE SYSTEMS ARE CONSISTENT AND INTEGRATED WITH THE BUSINESS PRACTICES THEY SUPPORT AND IDENTIFY KEY ISSUES AND WEAKNESSES, PROVIDING SOLUTIONS FOR IMPROVEMENT AND MANAGING THE IMPLEMENTATION OF SYSTEM ENHANCEMENTSMIGRATE REPORTS IN EXCEL TO AUTOMATED BI TOOLSPARTNER WITH THE DIFFERENT AREAS OF THE BUSINESS TO IMPROVE THE QUALITY OF FINANCIAL INFORMATION AVAILABLE AND INFLUENCE DECISIONS THAT WOULD IMPROVE SHAREHOLDER VALUE\n\nWHAT YOU HAVE\n\nBACHELOR’S DEGREE IN FINANCE, ACCOUNTING, DATA SCIENCE OR RELATED DISCIPLINEMASTER’S DEGREE IN ACCOUNTING OR BUSINESS ADMINISTRATION (PREFERRED)EXPERIENCE WITH ZERO BASED BUDGETING, EXPENSE FORECASTING AND IMPROVING EXPENSE CONTROLSCPA OR CMA CERTIFICATION (DESIRED BUT NOT REQUIRED)9+ YEARS OF JOB SPECIFIC WORK EXPERIENCE WITH DEMONSTRATED PROFESSIONAL GROWTH AND ACHIEVEMENT EXPERIENCE ZBB AND COST CENTER PLANNING EXPERIENCE USING SAP FICO, SAP SAC, BLACKLINE, BUSINESS OBJECTS, BUSINESS INTELLIGENCE, SQL QUERIES PROJECT MANAGEMENT EXPERIENCE IN EXECUTING PROJECTS THROUGH IMPLEMENTATION, ACROSS MULTIPLE INTERNAL AND EXTERNAL REPORTING AND ORGANIZATIONAL LINES\n\nWHAT YOU’RE GOOD AT\n\nCOMMUNICATING EFFECTIVELY WITH A WIDE RANGE OF INDIVIDUALS IN WRITTEN, ORAL AND INTERPERSONAL FORM PROVIDING A STRONG ATTENTION TO DETAIL AND ACCURACY TO DAILY TASKS, AS WELL AS SPECIAL PROJECTS EXERCISING INDEPENDENT JUDGMENT AND DEMONSTRATING SOLID TIME MANAGEMENT AND ORGANIZATIONAL SKILLS, INCLUDING THE ABILITY TO MEET TIGHT DEADLINES AND SCHEDULESHONING YOUR ABILITY TO PERSUADE, MARKET AND SELL NEW IDEAS BASED ON CULTURE, AUDIENCE AND BUSINESS NEEDSEFFECTIVELY EXERCISING TACT, DISCRETION, JUDGMENT AND DIPLOMACY WHEN INTERACTING WITH INTERNAL AND EXTERNAL CUSTOMERS, AND SENIOR MANAGEMENTLEADING A FAST-PACED TEAM, WITH STRONG PERSONAL ORGANIZATION, POISE AND PROFESSIONALISM NEGOTIATING EFFECTIVELY WITH INTERNAL AND EXTERNAL CUSTOMERS AND USING APPROPRIATE CONFLICT RESOLUTION METHODS WHEN NECESSARY COLLECTING AND ANALYZING STATISTICAL AND FINANCIAL DATAACHIEVING RESULTS THROUGH TEAM EFFORTS, CHALLENGING ESTABLISHED PRACTICES AND DRAWING RELEVANT CONCLUSIONS \n\nWHAT ELSE?\n\nWE’RE LOCATED IN A PRETTY GREAT SPOT – CHECK OUT THIS VIDEO TO SEE WHAT WE MEAN\n\nMOHAWK INDUSTRIES IS A LEADING GLOBAL FLOORING MANUFACTURER THAT CREATES PRODUCTS TO ENHANCE RESIDENTIAL AND COMMERCIAL SPACES AROUND THE WORLD. MOHAWK’S VERTICALLY INTEGRATED MANUFACTURING AND DISTRIBUTION PROCESSES PROVIDE COMPETITIVE ADVANTAGES IN THE PRODUCTION OF CARPET, RUGS, CERAMIC TILE, LAMINATE, WOOD, STONE AND VINYL FLOORING. OUR INDUSTRY-LEADING INNOVATION HAS YIELDED PRODUCTS AND TECHNOLOGIES THAT DIFFERENTIATE OUR BRANDS IN THE MARKETPLACE AND SATISFY ALL REMODELING AND NEW CONSTRUCTION REQUIREMENTS. OUR BRANDS ARE AMONG THE MOST RECOGNIZED IN THE INDUSTRY AND INCLUDE AMERICAN OLEAN, DALTILE, DURKAN, IVC, KARASTAN, MARAZZI, MOHAWK, MOHAWK HOME, PERGO, AND QUICK-STEP. DURING THE PAST DECADE, MOHAWK HAS TRANSFORMED ITS BUSINESS FROM AN AMERICAN CARPET MANUFACTURER INTO THE WORLD’S LARGEST FLOORING COMPANY WITH OPERATIONS IN AUSTRALIA, BRAZIL, CANADA, EUROPE, INDIA, MALAYSIA, MEXICO, NEW ZEALAND, RUSSIA AND THE UNITED STATES.\n\nMOHAWK INDUSTRIES, INC. IS AN EQUAL OPPORTUNITY EMPLOYER INCLUDING DISABILITY/VETERAN COMMITTED TO AN INCLUSIVE WORKPLACE AND A PROUD DRUGS DON’T WORK PARTICIPANT.",
    "job_skill_set": [
      "finance",
      "communication",
      "attention to detail",
      "time management",
      "organizational skills",
      "persuasion",
      "teamwork",
      "analytical skills",
      "leadership",
      "negotiation",
      "accounting",
      "budgeting",
      "financial analysis",
      "zero based budgeting (ZBB)",
      "expense forecasting",
      "SAP FICO",
      "SAP SAC",
      "Blackline",
      "Business Objects",
      "Business Intelligence",
      "SQL queries",
      "project management",
      "data management",
      "financial reporting",
      "automated BI tools",
      "conflict resolution"
    ],
    "short_keywords": [
      "30701",
      "accounting",
      "analysis",
      "analytical",
      "attention",
      "automated",
      "based",
      "bi",
      "blackline",
      "budgeting",
      "business",
      "calhoun",
      "communication",
      "conflict",
      "data",
      "detail",
      "expense",
      "fico",
      "finance",
      "financial",
      "forecasting",
      "georgia",
      "intelligence",
      "leadership",
      "management",
      "manager",
      "negotiation",
      "objects",
      "organizational",
      "persuasion",
      "project",
      "queries",
      "reporting",
      "resolution",
      "sac",
      "sap",
      "skills",
      "sql",
      "sr",
      "states",
      "teamwork",
      "time",
      "to",
      "tools",
      "united",
      "zbb",
      "zero"
    ]
  },
  {
    "job_id": "3901351125",
    "job_title": "Finance Manager",
    "category": "FINANCE",
    "job_description": "$1500 HIRING BONUS \nJOIN OUR DEDICATED TEAM OF NON-PROFIT LEADERS AND SUPPORT IMPACT-DRIVEN COMMUNITY INCLUSION FOR ADULTS WITH DISABILITIES!  \nAT PARTNERSHIP RESOURCES, INC. (PRI) EACH PERSON WE SERVE IS AT THE CENTER OF OUR WORK. OUR VISION IS THAT EVERY PERSON WITH DISABILITIES THRIVES IN AN INCLUSIVE COMMUNITY. ESTABLISHED IN 1960, PRI IS LICENSED BY THE MN DEPARTMENT OF HUMAN SERVICES TO PROVIDE DAY AND EMPLOYMENT SERVICES FOR ADULTS WITH INTELLECTUAL AND DEVELOPMENTAL DISABILITIES. TOGETHER WITH OUR COMMUNITY PARTNERS, WE RAISE AWARENESS, HELP SHAPE OPPORTUNITIES, AND ENSURE THAT PEOPLE WITH DISABILITIES HAVE ABUNDANT CHOICES WITHIN COMMUNITY LIFE. \nWE ARE SEEKING A SKILLED, ENERGETIC, AND FORWARD-THINKING INDIVIDUAL WHO HAS A STRONG ATTENTION TO DETAIL TO FILL THE POSITION OF FINANCE MANAGER. \nTHE FINANCE MANAGER IS A HANDS-ON POSITION DIRECTLY RESPONSIBLE FOR THE MANAGEMENT AND OVERSIGHT OF THE FINANCIAL ACTIVITIES OF THE ORGANIZATION. THIS POSITION REPORTS TO THE CHIEF EXECUTIVE OFFICER (CEO). \nFINANCIAL MANAGEMENT:  RESPONSIBLE FOR FINANCIAL OPERATIONS OF THE AGENCY INCLUDING DAY-TO-DAY ACCOUNTING FUNCTIONS AND OVERSIGHT OF RECEIVABLES IN COORDINATION WITH THE BILLING TEAM PROCESS AND ENTER DAILY ACCOUNTING TRANSACTIONS PREPARE AND PROVIDE ACCURATE AND TIMELY FINANCIAL REPORTING AND DATA ANALYSES TO APPROPRIATE INTERNAL AND EXTERNAL STAKEHOLDERS INCLUDING GOVERNMENT ENTITIES AND FOUNDATION GRANTORS PREPARE, ANALYZE, AND PRESENT FINANCIAL STATEMENTS ON A MONTHLY AND QUARTERLY BASIS FOR DEPARTMENT LEADERSHIP, THE BOARD FINANCE COMMITTEE, AND THE BOARD OF DIRECTORS COORDINATE ANNUAL AUDIT PROCESS WITH EXTERNAL AUDITOR TO ENSURE TIMELY COMPLETION OF THE FINANCIAL STATEMENT, 990 AND ANNUAL FILINGS IN CONJUNCTION WITH THE CEO AND BOARD OF DIRECTORS DRIVE THE ANNUAL BUDGETING PROCESS, MAINTAINING AND CONTINUOUSLY IMPROVING THE PROCESS MAINTAIN INTERNAL CONTROL AND SAFEGUARDS FOR RECEIPT OF REVENUE, COSTS, PROGRAM BUDGETS, AND ACTUAL EXPENDITURES COMMUNICATE AND COLLABORATE EFFECTIVELY WITH FUNDRAISING STAFF, SUPPORT FINANCIAL ASPECTS OF FUNDRAISING ACTIVITIES INCLUDING GRANTS, EVENTS, ONLINE GIVING, OR OTHER DONOR RELATION ACTIVITIES MAINTAIN WORKING KNOWLEDGE OF CLIENT-RELATED SERVICES AND RATES (MN-ITS, MMIS, DWRS) TO LEAD, ADVISE, AND SUPPORT THE WORK OF THE BILLING SPECIALIST AS NEEDED ENSURE TIMELY AND ACCURATE PROCESSING OF PAYROLL, MAINTAINING A WORKING KNOWLEDGE TO SERVE AS BACKUP REVIEW, MAINTAIN AND UPDATE VENDOR CONTRACTS ENSURING THE BEST RATES, TERMS, AND ONGOING ENGAGEMENT WHILE MAKING SURE THAT CONTRACT TERMS ARE MET DEVELOP, DISTRIBUTE, AND IMPLEMENT POLICIES AND PROCEDURES WORK AS A MEMBER OF THE LEADERSHIP/MANAGEMENT TEAM AND ASSIST IN MANAGING PROJECTS AS ASSIGNED \nQUALIFICATIONS: B.A./B.S. PREFERRED WITH AN EMPHASIS OR CONCENTRATION IN BUSINESS, FINANCE, ACCOUNTING, OR RELATED FIELD DEMONSTRATED SUCCESS IN NON-PROFIT FINANCE ROLE PREFERRED TWO TO FIVE YEARS OF PROGRESSIVE FINANCE EXPERIENCE EXPERIENCE WITH QUICKBOOKS OR SIMILAR ACCOUNTING SOFTWARE PROFICIENT USE OF MICROSOFT OFFICE PRODUCTS DEMONSTRATED ABILITY TO ANALYZE FINANCIAL DATA AND THINK STRATEGICALLY ABOUT SUSTAINABILITY AND GROWTH OF THE ORGANIZATION ABILITY TO PASS A BACKGROUND STUDY WITH THE MN DEPARTMENT OF HUMAN SERVICES MUST BE AUTHORIZED TO WORK IN THE UNITED STATES WITHOUT A SPONSOR VISA  OTHER KNOWLEDGE, SKILLS & ABILITIES: DESIRE TO WORK AS PART OF A TEAM AND WILLINGNESS TO PROMOTE THE PRINCIPLES AND VIEWS OF PARTNERSHIP RESOURCES, INC. ABILITY TO WORK WITH MINIMAL SUPERVISION – SELF-MOTIVATED & CONFIDENT ABILITY TO TRAVEL BETWEEN SITES AS NEEDED USING OWN VEHICLE ABILITY TO MAINTAIN A HIGH LEVEL OF CONFIDENTIALITY STRONG ORGANIZATIONAL, ANALYTICAL, AND ADMINISTRATIVE SKILLS \nCOMPENSATION: THE IS A FULL-TIME EXEMPT POSITION. COMPETITIVE SALARY OF $65,000-$75,000 ANNUALLY DEPENDENT ON QUALIFICATIONS. COMPREHENSIVE BENEFITS PACKAGE INCLUDES: PAID TIME OFF PAID HOLIDAYS OFF (7-9 PER YEAR) ADDITIONAL PAID PERSONAL HOLIDAYS MEDICAL INSURANCE DENTAL INSURANCE RETIREMENT PLAN WITH EMPLOYER MATCH FREE LIFE AD&D COVERAGE FREE SHORT AND LONG-TERM DISABILITY COVERAGE FREE EMPLOYEE ASSISTANCE PROGRAM ACCESS TO THE FEDERAL PUBLIC STUDENT LOAN FORGIVENESS PROGRAM \nPARTNERSHIP RESOURCES, INC. IS AN EQUAL OPPORTUNITY/AFFIRMATIVE ACTION EMPLOYER COMMITTED TO CREATING A DIVERSE WORKFORCE. WE WILL NOT DISCRIMINATE AGAINST ANY EMPLOYEE OR APPLICANT BASED UPON ANY CHARACTERISTIC PROTECTED BY LAW. WE WELCOME AND ENCOURAGE PEOPLE OF ALL LIFE EXPERIENCES TO APPLY. \nLEARN MORE AT WWW.PARTNERSHIPRESOURCES.ORG. JOIN US IN OUR MISSION. APPLY NOW! ",
    "job_skill_set": [
      "financial management",
      "accounting",
      "financial reporting",
      "budgeting",
      "QuickBooks",
      "Microsoft Office",
      "data analysis",
      "audit coordination",
      "policy development",
      "vendor management",
      "teamwork",
      "communication",
      "attention to detail",
      "self-motivation",
      "organizational skills",
      "confidentiality",
      "analytical thinking",
      "strategic thinking"
    ],
    "short_keywords": [
      "accounting",
      "analysis",
      "analytical",
      "attention",
      "audit",
      "budgeting",
      "communication",
      "confidentiality",
      "coordination",
      "data",
      "detail",
      "development",
      "finance",
      "financial",
      "management",
      "manager",
      "microsoft",
      "office",
      "organizational",
      "policy",
      "quickbooks",
      "reporting",
      "selfmotivation",
      "skills",
      "strategic",
      "teamwork",
      "thinking",
      "to",
      "vendor"
    ]
  },
  {
    "job_id": "3905841089",
    "job_title": "Finance Director",
    "category": "FINANCE",
    "job_description": "WHO ARE WE?THE CHILDREN’S TRUST OF ALACHUA COUNTY IS A SPECIAL INDEPENDENT DISTRICT WITH TAXING AUTHORITY. OUR MAIN FOCUS IS TO FUND VARIOUS PROGRAMS FOR CHILDREN WITHIN OUR COMMUNITIES. SINCE 2018, THE CHILDREN’S TRUST OF ALACHUA COUNTY HAS EMBRACED THEIR MISSION OF SUPPORTING AND FUNDING A COORDINATED SYSTEM OF COMMUNITY SERVICES THAT ALLOWS ALL YOUTH AND THEIR FAMILIES TO THRIVE.\nTHE PERFECT FIT FOR THE FINANCE DIRECTOR ROLE:A PURPOSE DRIVEN PERSON WITH A STRONG FINANCIAL ADVISORY MINDSET.AN INDIVIDUAL WITH A STRONG SENSE OF OWNERSHIP AND A WILLINGNESS TO WORK COLLABORATIVELY WITH A DYNAMIC TEAM.A PERSON WHO WILL STRIVE TO BE THE SUBJECT MATTER EXPERT IN YOUR AREA OF PRACTICE AND A FINANCIAL STEWARD FOR THE ORGANIZATION AND COMMUNITY.\nUNDER THE DIRECTION OF THE EXECUTIVE DIRECTOR, THE FINANCE DIRECTOR IS RESPONSIBLE FOR STRATEGIC PLANNING AND OPERATIONAL DECISION MAKING FOR FISCAL ACTIVITIES INCLUDING REVENUE COLLECTION, EXPENDITURES, PAYROLL, ACCOUNTING AND AUDITING, INCOME TAX AND UTILITY BILLING, TREASURY AND DEBT MANAGEMENT, AND OTHER RELATED ACCOUNTING AND FINANCE PRACTICES. THE FINANCE DIRECTOR WILL ASSIST THE EXECUTIVE DIRECTOR IN THE DEVELOPMENT AND EXECUTION OF THE ANNUAL BUDGET AND OTHER ADMINISTRATIVE MATTERS.\nWHAT YOU WILL DO IN THE ROLE AS THE FINANCE DIRECTOR:SERVE AS THE PRIMARY FINANCIAL ADVISOR FOR CTAC AND PROVIDE RELEVANT FINANCIAL INFORMATION/ADVICE TO THE EXECUTIVE DIRECTOR AND BOARD ON ALL STRATEGIC AND TACTICAL MATTERS AS THEY RELATE TO FINANCIAL MANAGEMENT AND REPORTING, TAX ADMINISTRATION, COST BENEFIT ANALYSIS, FINANCIAL FORECASTING, AND THE SECURING OF NEW FUNDING.COLLABORATE WITH BOARD MEMBERS, EXECUTIVE DIRECTOR, AND TEAM MEMBERS TO ASSESS INTERNAL AND EXTERNAL TRENDS AND ISSUES, REVENUE SOURCES, EXPENDITURE REQUIREMENTS, SERVICE DEMANDS AND OTHER RELEVANT MATTERS AND FACILITATE DEVELOPMENT OF LONG-TERM FISCAL STRATEGIES.ENSURE FINANCES SUPPORT CTAC PROGRAMS AND STRATEGIC PRIORITIES.ESTABLISH AND MAINTAIN BUDGET, PROVIDE ALL FINANCIAL REPORTING AND SUBMIT QUARTERLY STATEMENTS AND UPDATES TO THE EXECUTIVE DIRECTOR, BOARD MEMBER AND PUBLIC.PROPERLY MANAGE THE INVESTMENTS OF THE CTAC’S FUNDS; SERVE AS THE LIAISON WITH THE FINANCIAL SERVICES CONTRACTOR WHO SELECTS TYPE AND TERMS OF INVESTMENT TO COINCIDE WITH CASH FLOW NEEDS.COMMUNICATE AND PROVIDE GUIDANCE REGARDING FINANCIAL INFORMATION BOTH INTERNALLY AND EXTERNALLY SO THAT A PROPER UNDERSTANDING WILL RESULT IN INFORMED DECISIONS.ESTABLISH AND GUARANTEE THAT CTAC FINANCIAL POLICIES AND PRACTICES ARE IN ALIGNMENT WITH LOCAL, STATE, AND FEDERAL LAWS, REGULATIONS AND FINANCIAL AND ACCOUNTING STANDARDS.PERFORM ALL WORK IN ACCORDANCE WITH GENERALLY ACCEPTED ACCOUNTING PRINCIPLES (GAAP) ALL OTHER INDUSTRY BEST PRACTICES.\nWHAT YOU BRING:BACHELOR’S DEGREE AND 3-5 YEARS FINANCE EXPERIENCE IN A GOVERNMENT SETTING PREFERRED.TWO (2) YEARS LEADERSHIP EXPERIENCE.PROVEN EXPERIENCE IN ACCOUNTING, FINANCIAL MANAGEMENT, AUDIT, REVENUE MANAGEMENT, WORKING CAPITAL, AND CASH FLOW MANAGEMENT.\nCHILDREN’S TRUST OF ALACHUA COUNTY PROVIDES EQUAL EMPLOYMENT OPPORTUNITIES TO ALL EMPLOYEES AND APPLICANTS FOR EMPLOYMENT AND PROHIBITS DISCRIMINATION AND HARASSMENT OF ANY TYPE WITHOUT REGARD TO RACE, COLOR, RELIGION, AGE, SEX, NATIONAL ORIGIN, DISABILITY STATUS, GENETICS, PROTECTED VETERAN STATUS, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, MARITAL STATUS, OR ANY OTHER CHARACTERISTIC PROTECTED BY FEDERAL, STATE, OR LOCAL LAWS.",
    "job_skill_set": [
      "financial management",
      "accounting",
      "budgeting",
      "auditing",
      "revenue management",
      "cash flow management",
      "financial forecasting",
      "cost benefit analysis",
      "collaboration",
      "communication",
      "leadership",
      "strategic planning",
      "problem solving",
      "ownership",
      "teamwork",
      "GAAP",
      "tax administration",
      "investment management"
    ],
    "short_keywords": [
      "accounting",
      "administration",
      "analysis",
      "auditing",
      "benefit",
      "budgeting",
      "cash",
      "collaboration",
      "communication",
      "cost",
      "director",
      "finance",
      "financial",
      "flow",
      "forecasting",
      "gaap",
      "investment",
      "leadership",
      "management",
      "ownership",
      "planning",
      "problem",
      "revenue",
      "solving",
      "strategic",
      "tax",
      "teamwork"
    ]
  },
  {
    "job_id": "3884854736",
    "job_title": "Vice President, Portfolio & Transaction Management - Value Chain Finance",
    "category": "FINANCE",
    "job_description": "EXCITING OPPORTUNITY TO JOIN RABOBANK’S NORTH AMERICAN VALUE CHAIN FINANCE TEAM! SEARCHING FOR AN EXPERIENCED AND ENERGETIC PROFESSIONAL TO JOIN OUR GROWING, HIGH-PERFORMING AND DIVERSE TEAM, WITH THE MANDATE TO ACTIVELY CONTRIBUTE TO EXPANDING THE PORTFOLIO OF RABOBANK’S FOOD, AGRICULTURE AND ENERGY TRANSITION SECTORS IN NORTH AMERICA. LOOKING FOR A TEAM PLAYER TO MANAGE, ANALYZE, AND PROVIDE STRUCTURED SOLUTIONS FOR A PORTFOLIO OF TRANSACTIONS FOR OUR CORE CLIENTS.\n\nTHIS POSTING IS AN ENGAGING AND MULTI-FACETED OPPORTUNITY TO MANAGE BOTH EXTERNAL CLIENTS AND INTERNAL RELATIONSHIPS FOR VALUE CHAIN FINANCE PRODUCTS: RECEIVABLES SECURITIZATIONS, MONETIZATIONS, REPURCHASE FACILITIES, ABL'S, AND PAYABLE FACILITIES.\n\nTHE POSITION WILL BE BASED IN EITHER THE NEW YORK, CHICAGO OR ATLANTA OFFICE AND WILL REPORT TO THE NORTH AMERICA REGIONAL HEAD OF PORTFOLIO AND TRANSACTION MANAGEMENT.\n\nOUR SHARED FUTURE: \n\n“JOINING VCF WILL GIVE YOU THE OPPORTUNITY TO WORK WITH PEOPLE WHO ARE SMART AND COLLABORATIVE, PROVIDING FINANCIAL SOLUTIONS TO DOMESTIC AND INTERNATIONAL CLIENTS IN THE ESSENTIAL FOOD AND AGRICULTURE INDUSTRY. I’M PROUD TO BE PART OF A COMPANY THAT HAS A STRONG FOCUS ON SUSTAINABILITY.” – EXECUTIVE DIRECTOR\n\nYOU AND YOUR JOB\n\nAS AN INTEGRAL PART THE GROWING PRODUCT TEAM, YOU WILL NEED TO BE BOTH A GOOD TEAM PLAYER AS WELL AS BE ABLE “GET THINGS DONE”. YOU’LL BE EXPECTED TO PUT IN THE NECESSARY TIME TO LEARN ALL ASPECTS OF THE JOB WITH THE ASSISTANCE OF RESOURCES AT HAND, INCLUDING WORKING WITH OTHER TEAM MEMBERS. YOU’LL HAVE PRIMARY RESPONSIBILITY FOR THE TRANSACTION MANAGEMENT DUTIES OF PART OF THE REGIONAL PORTFOLIO, YOU WILL ALSO BE EXPECTED TO WORK CLOSELY WITH OTHER TRANSACTION MANAGERS, INCLUDING PROVIDING BACK-UP / COVERAGE FOR EACH OTHER FOR BUSINESS TRAVEL ETC., AND BE WILLING TO PITCH IN AS THE NEEDS OF THE BUSINESS MAY REQUIRE. PORTFOLIO MANAGEMENT ACTIVITIES FOR VCF CLIENT INCLUDE COORDINATING MANAGEMENT REPORTING, RISK DASHBOARDS, DATA ANALYSIS AND REGULATORY AND POLICY RELATED ACTIVITIES REQUIRED BY THE REGION.\n\nAS A MEMBER OF THE PORTFOLIO AND TRANSACTION MANAGEMENT FUNCTION WITHIN THE VCF TEAM YOU WILL BE RESPONSIBLE FOR PERFORMING DUTIES WHICH INCLUDE:\n\nCOORDINATING THE INTERNAL APPROVAL PROCESS (INCLUDING DRAFTING INTERNAL APPROVAL MEMOS) AND EXTERNAL DOCUMENTATION PROCESS (INCLUDING DOC REVIEW) FOR TRANSACTION RENEWALS AND AMENDMENTS.MAINTAINING A DIRECT DIALOGUE WITH CLIENTS, OTHER LENDERS AND RATING AGENCIES REGARDING DEAL PERFORMANCE AND UNDERWRITING ANALYSIS OF CLIENTS AND DEBTORS, UPCOMING AMENDMENTS, INCLUDING ARRANGING AND CONDUCTING BUSINESS DUE DILIGENCE REVIEWS AND RESOLVING OPERATIONAL ISSUES.PERFORMING PERIODIC ANALYSIS ON THE PORTFOLIO, INCLUDING REVIEW OF MONTHLY SETTLEMENT REPORTS AND PERFORMING TREND ANALYSIS; ANDIDENTIFYING CHANGES IN THE REQUIREMENTS FOR TRANSACTIONS BASED ON DEVELOPMENTS OF CLIENT NEEDS, REGULATORY ENVIRONMENT AND INTERNAL CAPITAL/LIQUIDITY MODELS AND ADAPTING DEAL STRUCTURE TO FIT.\n\nJOB RESPONSIBILITIES:\n\nWRITE DETAILED INTERNAL APPROVAL MEMOS AND ALIGN WITH INTERNAL STAKEHOLDERSMAINTAIN CLIENT DIALOGUE AND PERFORM DUE DILIGENCE REVIEWSMONITOR AND ANALYZE PORTFOLIO/METRICS FOR INTERNAL & MANAGEMENT REPORTINGLIAISE WITH LEGAL COUNSEL, REVIEW DOCUMENTATION, EXECUTE AMENDMENTSAD HOC PROJECTS (IT IMPROVEMENTS, REGULATORY IMPACT ANALYSIS, ETC.)\n\nYOUR PROMISE TO US: \n\nTO BE CONSIDERED FOR THE VICE PRESIDENT, PORTFOLIO & TRANSACTION MANAGEMENT - VALUE CHAIN FINANCE ROLE, YOU MUST HAVE:\n\nMINIMUM 5 YEARS OF RELATED EXPERIENCE WITH SECURITIZATION, RECEIVABLES MONETIZATION, ASSET BASED LENDING AND OR SUPPLIER FINANCE PRODUCTS.BACHELOR'S DEGREE IN A RELEVANT FIELDFINRA LICENSES OR TO BE OBTAINED WITHIN 1 YEAR OF HIRESTRONG TECHNICAL SKILLS (PRODUCT KNOWLEDGE OF BORROWING BASE STRUCTURES, CREDIT/RISK SKILL SET, MODELLING OR STRUCTURING EXPERIENCE)EXCELLENT COMMUNICATION SKILLS, DRIVE, TEAM PLAYER, ADJUSTABLE, HAVE UNDERSTANDING OF FINANCIAL ANALYSIS & CREDIT RISK, ABILITY TO INTERACT EFFECTIVELY WITH RABOBANK CLIENTS AT C-LEVELRELEVANT TRANSACTION MANAGEMENT, EXECUTION, CREDIT, RISK OR LEGAL EXPERIENCEABILITY TO TRAVEL REGIONALLY, UP TO 35%\n\nOUR COMMITMENT TO YOU – CULTIVATING YOUR WAY BEYOND PAY: \n\nRABOBANK EMBRACES DIVERSITY AND WELCOMES EMPLOYEES AND APPLICANTS OF ALL BACKGROUNDS. OUR GOAL IS TO ALWAYS CREATE AN ENVIRONMENT THAT IS INCLUSIVE, DRAWING UPON THE STRENGTHS OF THE DIVERSITY OF OUR WORKFORCE TO EXCEED THE EXPECTATION FOR OUR CLIENTS AND CUSTOMERS.\n\nWE VIEW YOUR WELL-BEING AS MUCH MORE THAN A PAYCHECK. WE CONTINUALLY EVALUATE AND EVOLVE OUR BENEFIT OFFERINGS TO BE COMPREHENSIVE, COMPETITIVE AND TO GIVE YOU THE OPTIONS AND THE FLEXIBILITY YOU NEED. WE FOCUS OUR EMPLOYEE BENEFITS ON THREE MAIN COMPONENTS:\n\nPHYSICAL WELL-BEING INCLUDES OUR COMMITMENT TO YOUR HEALTH AND WELLNESS. MEDICAL, DENTAL AND VISION PLAN COVERAGES ARE EFFECTIVE ON YOUR DATE OF HIRE. RABO OFFERS MULTIPLE PLAN OPTIONS AND A FULL NETWORK OF PROVIDERS TO BEST MEET YOUR NEEDS.FINANCIAL WELL-BEING PROVIDES FOR YOUR RETIREMENT + SAVINGS + SECURITY. WE LOVE SEEING YOUR RETIREMENT PLAN BALANCE GROW JUST AS MUCH AS YOU DO! THAT’S WHY YOU CAN START PARTICIPATING IN THE 401(K) PLAN ON YOUR DATE OF HIRE. PLUS WE MATCH 50% OF THE FIRST 6% YOU CONTRIBUTE TO YOUR 401(K) PLAN FOR US EMPLOYEES. RABO ALSO CONTRIBUTES AN ADDITIONAL 3% OF YOUR ELIGIBLE PAY IN SAFE HARBOR CONTRIBUTION AND UP TO 3% IN ANNUAL DISCRETIONARY PROFIT SHARING CONTRIBUTIONS.EMOTIONAL WELL-BEING ENSURES YOUR WORK + LIFE BALANCE. WE OFFER A GENEROUS PAID TIME OFF PROGRAM TO FULL TIME EMPLOYEES: UP TO 20 DAYS OF VACATION TIME, 5 DAYS OF ADDITIONAL TIME OFF PLUS 7 SICK DAYS AND 11 US HOLIDAYS ANNUALLY (BASED ON HIRE DATE DURING THE CALENDAR YEAR). IN ADDITION, GROWING A BETTER WORLD TOGETHER REQUIRES WANTING THE BEST FOR OUR EMPLOYEES AND THEIR FAMILIES AND OUR COMMUNITIES. TO DO THAT, WE OFFER BOTH THE TIME AND FINANCIAL SUPPORT TO GIVE BACK TO THE COMMUNITY THROUGH OUR DOLLARS FOR DOERS, HELPING HANDS AND GIFT MATCHING PROGRAMS. (ALL PAID TIME OFF IS SUBJECT TO COMPANY ACCRUAL AND CARRYOVER POLICIES.)\n\nOUR ORGANIZATION:\n\nSERVING CLIENTS IN MEXICO, THE U.S. AND CANADA, RABOBANK WHOLESALE BANKING NORTH AMERICA IS A PREMIER CORPORATE AND INVESTMENT BANK TO THE FOOD, AGRIBUSINESS, COMMODITIES AND RENEWABLE ENERGY INDUSTRIES, PROVIDING SECTOR EXPERTISE, STRATEGIC ADVISORY AND TAILORED FINANCIAL SOLUTIONS TO OUR CLIENTS. WE THRIVE ON BUILDING LONG-TERM RELATIONSHIPS WITH CLIENTS AND STAKEHOLDERS IN THE FASTEST-GROWING FOOD AND AGRIBUSINESS REGION OF THE WORLD. SEE, HTTPS://WWW.RABOBANKWHOLESALEBANKINGNA.COM/.\n\nSALARY EXPECTATIONS: \n\nTARGET HIRING RANGE: $140,000.00 - $230,000.00\n\nTHIS POSITION IS SUBJECT TO THE TERMS OF RABOBANK’S COMPENSATION PLANS AND POLICIES. IT IS ANTICIPATED THAT THE POSITION WILL PAY WITHIN THE TARGET HIRING RANGE. THE RANGE IS REFLECTIVE OF THE DESIRED PRIMARY PHYSICAL WORK LOCATION AND MAY BE ADJUSTED OUTSIDE OF THE PROJECTED RANGE BASED ON GEOGRAPHICAL DIFFERENTIATION IF THE ACTUAL WORK LOCATION OF THE HIRED CANDIDATE DIFFERS FROM THE DESIRED PRIMARY LOCATION, OR FOR OTHER LAWFUL REASONS. FURTHER, ALL FULL-TIME REGULAR POSITIONS INCLUDE ALL OTHER BENEFITS PROVIDED TO RABOBANK EMPLOYEES, INCLUDING HEALTHCARE BENEFITS, 401K MATCHING, VACATION, SICK LEAVE, PARENTAL LEAVE, POSSIBLE DISCRETIONARY BONUSES AND ALL OTHER BENEFITS THAT ARE ALL GOVERNED BY AND SUBJECT TO ERISA PLAN DOCUMENTS AND ELIGIBILITY.\n\nRABO PROVIDES EQUAL OPPORTUNITY IN EMPLOYMENT TO ALL EMPLOYEES AND APPLICANTS AND DOES NOT DISCRIMINATE ON THE BASIS OF RACE, COLOR, CREED, RELIGION, NATIONAL ORIGIN, ANCESTRY, ALIENAGE OR CITIZENSHIP STATUS, AGE, SEX, SEXUAL ORIENTATION, GENDER IDENTITY GENDER EXPRESSION, MARITAL STATUS, GENETIC INFORMATION, MEDICAL CONDITION, PHYSICAL OR MENTAL DISABILITY, PREGNANCY, CHILDBIRTH OR RELATED MEDICAL CONDITION, MILITARY SERVICE OR VETERAN STATUS, VICTIMS OF DOMESTIC VIOLENCE, OR ANY OTHER BASIS PROTECTED BY APPLICABLE LAW. RABO ALSO PROHIBITS HARASSMENT OF ANY INDIVIDUALS ON ANY OF THE BASES LISTED ABOVE.\n\nAT RABOBANK, WE STRIVE TO GROW A BETTER WORLD TOGETHER. IN ORDER TO ACHIEVE THAT, WE HAVE TO HAVE THE RIGHT PEOPLE IN THE RIGHT JOBS. ARE YOU READY TO JOIN OUR TEAM?\n\nTHIS JOB POSTING HAS NO FIXED APPLICATION DEADLINE. WE WILL ACCEPT RESUMES UNTIL A QUALIFIED APPLICANT POOL IS IDENTIFIED.\n\n",
    "job_skill_set": [
      "receivables monetization",
      "financial analysis",
      "data analysis",
      "documentation review",
      "communication",
      "teamwork",
      "problem solving",
      "adaptability",
      "client relationship management",
      "drive",
      "collaboration",
      "attention to detail",
      "time management",
      "interpersonal skills",
      "securitization",
      "asset based lending",
      "supplier finance products",
      "credit risk assessment",
      "transaction management",
      "regulatory compliance",
      "modeling",
      "structuring experience"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "assessment",
      "asset",
      "attention",
      "based",
      "chain",
      "client",
      "collaboration",
      "communication",
      "compliance",
      "credit",
      "data",
      "detail",
      "documentation",
      "drive",
      "experience",
      "finance",
      "financial",
      "interpersonal",
      "lending",
      "management",
      "modeling",
      "monetization",
      "portfolio",
      "president",
      "problem",
      "products",
      "receivables",
      "regulatory",
      "relationship",
      "review",
      "risk",
      "securitization",
      "skills",
      "solving",
      "structuring",
      "supplier",
      "teamwork",
      "time",
      "to",
      "transaction",
      "value",
      "vice"
    ]
  },
  {
    "job_id": "3902353310",
    "job_title": "Finance and Strategy Associate",
    "category": "FINANCE",
    "job_description": "FINANCE AND STRATEGY ASSOCIATE\nJOIN OUR TEAMJOIN CLOVERLEAF IN DEVELOPING INNOVATIVE SOLUTIONS FOR THE LARGEST ELECTRIC LOADS. WE DEVELOP POWER-READY AND CONSTRUCTION-READY SITES TO ENABLE THE GROWTH OF CLOUD COMPUTING AND ARTIFICIAL INTELLIGENCE, THE RENAISSANCE OF DOMESTIC MANUFACTURING, AND NEW FORMS OF ENERGY PRODUCTION. WE ARE A FAST-PACED COMPANY WITH EXPERIENCED FOUNDERS, STRONG INVESTORS, AND A COLLABORATIVE WORK ENVIRONMENT. TAKE YOUR CAREER TO THE NEXT LEVEL, MAKE A DIFFERENCE, AND WORK ON SOME OF THE MOST IMPORTANT ISSUES OF OUR TIME!\nPOSITION DESCRIPTIONWE ARE SEEKING AN EARLY-CAREER PROFESSIONAL TO JOIN OUR DYNAMIC TEAM AS THE FINANCE AND STRATEGY ASSOCIATE. THE POSITION WILL PLAY A CRITICAL ROLE IN PROJECT INVESTMENTS, COMPANY STRATEGY, AND CAPITAL ALLOCATION. THE IDEAL CANDIDATE WILL HAVE EXPERIENCE IN FINANCE; A WORKING KNOWLEDGE OF ENERGY, DIGITAL INFRASTRUCTURE AND/OR REAL ASSETS; AND A PROVEN TRACK RECORD OF THOUGHTFUL, DETAILED, AND ACTIONABLE ANALYSIS. THE ROLE OFFERS THE ABILITY TO WORK DIRECTLY WITH COMPANY MANAGEMENT AND INVESTORS IN A FAST-PACED ENVIRONMENT AND A FASCINATING INDUSTRY.\nKEY JOB RESPONSIBILITIES1. PROJECT INVESTMENT ANALYSIS· CONDUCT COMPREHENSIVE FINANCIAL ANALYSIS OF COMPANY DEVELOPMENT PROJECTS, INCLUDING CASH FLOW PROJECTIONS, SCENARIO ANALYSIS AND RISK ASSESSMENT· COLLABORATE WITH CROSS-FUNCTIONAL TEAMS TO ASSESS PROJECT INPUTS, RISKS AND OPPORTUNITIES· VERIFY AND QUALITY CONTROL INPUTS AND OUTPUTS· SUPPORT CAPITAL ALLOCATION DECISIONS BY PRESENTING HIGH-QUALITY, STRATEGIC AND THOUGHTFUL ANALYSIS\n2. MARKET AND SITE SELECTION· DEVELOP AND IMPLEMENT QUANTITATIVE METHODS TO GUIDE THE COMPANY’S SELECTION OF MARKETS AND SITES· PERFORM TOTAL COST OF OWNERSHIP CALCULATIONS INCLUDING DEVELOPMENT AND CONSTRUCTION COSTS, COSTS OF POWER SUPPLY, GRID UPGRADES, STATE AND LOCAL TAXES AND OTHER FACTORS\n3. COMPANY FINANCIAL PROJECTIONS· DEVELOP AND UPDATE A COMPANY FINANCIAL MODEL· PRESENT RESULTS TO COMPANY MANAGEMENT AND INVESTORS TO GUIDE CAPITAL FORMATION, INVESTMENT DECISIONS, AND ANNUAL BUDGETING\n4. COMMERCIAL SUPPORT· SUPPORT THE COMPANY AS IT WORKS WITH CUSTOMERS ON JOINT VENTURES, PROJECT SALES AND OTHER SIMILAR ARRANGEMENTS· PREPARE HIGH QUALITY MATERIALS TO SUPPORT CUSTOMER AND INVESTOR DISCUSSIONS\n5. OTHER FINANCE FUNCTIONS· ASSIST IN BUILDING CAPABILITIES IN A GROWTH ENVIRONMENT, INCLUDING REPORTING, ACCOUNTING, TAX, PAYROLL, RISK MANAGEMENT AND OTHER FINANCIAL FUNCTIONS· SUPPORT FINANCIAL BUDGETING, AND FORECASTING PROCESSES\nQUALIFICATIONS·  BACHELOR’S OR MASTER’S DEGREE· 2+ EXPERIENCE IN FINANCIAL AND INVESTMENT ANALYSIS· STRONG FINANCIAL MODELING SKILLS· STRONG ANALYTICAL SKILLS AND ATTENTION TO DETAIL· ABILITY TO PREPARE CLEAR AND PROFESSIONAL MATERIALS FOR INVESTORS AND CUSTOMERS· STRATEGIC, CREATIVE MINDSET· EXCELLENT COLLABORATION SKILLS AND A CAN-DO ATTITUDE COMPENSATION AND BENEFITS· COMPETITIVE SALARY BASED ON EXPERIENCE AND QUALIFICATIONS· EQUITY PARTICIPATION IN THE COMPANY· ELIGIBLE FOR ANNUAL BONUS· COINVESTMENT OPPORTUNITY· HEALTH, DENTAL AND VISION BENEFITS· OPPORTUNITIES FOR PROFESSIONAL GROWTH AND SKILL DEVELOPMENT\nLOCATIONHOUSTON, TEXAS OR SEATTLE, WASHINGTON. WE ARE OPEN TO FLEXIBLE WORK (E.G., TWO DAYS PER WEEK REMOTE) AFTER AN INITIAL ONBOARDING PERIOD.\nABOUT CLOVERLEAFCLOVERLEAF IS A PURPOSE-DRIVEN COMPANY THAT PROVIDES SOLUTIONS FOR LARGE ELECTRIC LOADS LIKE DATA CENTERS AND ELECTRIFIED FACTORIES. CLOVERLEAF IS LED BY A VETERAN MANAGEMENT TEAM THAT HAS BUILT SEVERAL SUCCESSFUL COMPANIES. OUR LEADERSHIP PRIDES ITSELF ON DEVELOPING THE SKILLS AND CAREER OF EVERY EMPLOYEE. WE ARE COMMITTED TO AN INCLUSIVE WORKPLACE THAT SUPPORTS EMPLOYEES OF ALL BACKGROUNDS. ",
    "job_skill_set": [
      "financial analysis",
      "risk assessment",
      "quantitative methods",
      "cash flow projections",
      "capital allocation",
      "reporting",
      "accounting",
      "budgeting",
      "forecasting",
      "analytical skills",
      "attention to detail",
      "collaboration",
      "communication",
      "strategic thinking",
      "creativity",
      "professionalism",
      "can-do attitude",
      "financial modeling",
      "cost of ownership calculations"
    ],
    "short_keywords": [
      "accounting",
      "allocation",
      "analysis",
      "analytical",
      "and",
      "assessment",
      "associate",
      "attention",
      "attitude",
      "budgeting",
      "calculations",
      "cando",
      "capital",
      "cash",
      "collaboration",
      "communication",
      "cost",
      "creativity",
      "detail",
      "finance",
      "financial",
      "flow",
      "forecasting",
      "methods",
      "modeling",
      "of",
      "ownership",
      "professionalism",
      "projections",
      "quantitative",
      "reporting",
      "risk",
      "skills",
      "strategic",
      "strategy",
      "thinking",
      "to"
    ]
  },
  {
    "job_id": "3884929863",
    "job_title": "Client Finance Analyst I",
    "category": "FINANCE",
    "job_description": "THE CLIENT FINANCE ANALYST I ROLE IS A FULLY REMOTE ROLE.***UNFORTUNATELY, WE ARE NOT ABLE TO PROVIDE SPONSORSHIP ASSISTANCE AT THIS TIME OR IN THE FUTURE.***\n\nTHE CLIENT FINANCE ANALYST I WILL ASSIST IN THE OVERALL FINANCIAL MANAGEMENT FOR OUR CLIENT PORTFOLIO, REPORTING, GENERAL DAY-TO-DAY ACTIVITIES, AND RELATED MONTH END CLOSE DUTIES.\n\nESSENTIAL FUNCTIONS OF THE JOB INCLUDE BUT ARE NOT LIMITED TO: \n\nASSIST WITH THE OVERALL MONTHLY PROJECT ACCOUNTING EFFORTS INCLUDING TAKING NOTES FROM THE MONTHLY STATUS MEETINGS WITH PROJECT MANAGERS AND MAKING PROJECT UPDATES ACROSS FINANCIAL TRACKERS.SETUP NEW PROJECTS AWARDED IN TIME & EXPENSE SYSTEMS AND FILES INCLUDING VERIFYING SIGNATURES, AGREEING TO SALESFORCE AND ESCALATING DISCREPANCIES.ASSIST WITH UPDATING PROJECT FILES FOR CHANGE ORDERS, BUDGET ADJUSTMENTS & CARVE OUTS, AND UPDATING PROJECT FINANCIAL TRACKERS FOR SPECIFIC PROJECT MILESTONES/TASKS.BOOK INTERCOMPANY REVENUE/COST TRANSACTIONS & UPDATE SHARED FINANCIAL TRACKERS.ASSIST WITH THE PREPARATION AND INVESTIGATION OF HOURS AND EXPENSES FOR CLIENT PROJECTS INCURRED INCLUDING REVIEW OF ASSIGNED BILLING ROLES/RATES.PREPARE CLIENT INVOICING BASED ON CONTRACTS AND FOLLOW UP WITH CUSTOMERS ON PAST DUE INVOICES. WHEN APPLICABLE, CREATE AND MAINTAIN WATERFALL OF INVOICING PER CONTRACTS.ASSIST IN THE PREPARATION OF MONTHLY CLIENT ACCRUALSTRACK PROJECT COSTS COMPARED TO CONTRACTED AMOUNTS AS WELL AS OTHER DIRECT COSTS SHARED ACROSS PROJECTS/CLIENTS.ASSIST IN SET UP & TRACKING OF NEW EMPLOYEES AND WHEN APPLICABLE SUBCONTRACTOR HOURS/BILL RATES/EXPENSES MONTHLY COMPARED TO FORECAST AND BUDGET.UPDATE BASIC AND ROUTINE MONTHLY GENERAL LEDGER ACCOUNT RECONCILIATIONS. COLLABORATE WITH SG&A TEAM WHERE APPLICABLE.ASSIST WITH AD HOC PROJECTS AS APPLICABLE, INCLUDING THE ANNUAL BUDGET PREPARATION.ASSIST IN PULLING SUPPORTING DOCUMENTS FOR THE ANNUAL AUDIT\n\nQUALIFICATIONS\n\nMINIMUM REQUIRED:\n\nBACHELOR’S DEGREE WITH A MINIMUM CONCENTRATION ACCOUNTING, FINANCE OR BUSINESS0-2 YEARS OF RELEVANT ACCOUNTING/FINANCE EXPERIENCE\n\nOTHER REQUIRED\n\nINTERMEDIATE TO ADVANCED MICROSOFT EXCEL SKILLS\n\nPREFERRED\n\nAGENCY OR PROFESSIONAL SERVICES EXPERIENCE A PLUSMONTH END CLOSE EXPERIENCEREVENUE RECOGNITION EXPERIENCEPROJECT ACCOUNTING EXPERIENCECLIENT SERVICES/CLIENT FACING EXPERIENCE\n\nSKILLS\n\nEXCELLENT CLIENT SERVICE INCLUDING MUTUAL RESPECT AND APPROACH TO COMMUNICATIONS AS WELL AS TIMELINESS OF RESPONSESDEADLINE-ORIENTED WITH GOOD TIME MANAGEMENT AND ORGANIZATIONAL SKILLSPROVEN CRITICAL THINKING, ANALYTICAL, INTERPRETATIVE, AND PROBLEM-SOLVING SKILLSABILITY TO PROCESS AND ANALYZE LARGE VOLUMES OF QUALITATIVE AND QUANTITATIVE INFORMATIONABILITY TO MULTITASK WITH GREAT ATTENTION TO DETAIL, AND HIGH LEVEL OF ACCOUNTABILITYDISPLAY PASSION AND PURPOSE FOR WHAT WE DOCOMMUNICATION (ORAL AND WRITTEN) WITH ABILITY TO SPEAK WITH ALL LEVELS OF THE ORGANIZATIONSTRONG INTERPERSONAL AND RELATIONSHIP BUILDING SKILLS, AND AN ABILITY TO BUILD CREDIBILITY WITH EXTERNAL AND INTERNAL STAKEHOLDERSPOSSESSES ETHICS AND INTEGRITY WHEN DEALING WITH CONFIDENTIAL AND SENSITIVE INFORMATION.WILLINGNESS TO EXTEND YOURSELF AND ASSIST OTHER TEAM MEMBERSSELF-STARTING ATTITUDE WITH A STRONG DESIRE TO LEARN AND GROW RAPIDLY\n\nPRECISION IS REQUIRED BY LAW IN SOME STATES OR CITIES TO INCLUDE A REASONABLE ESTIMATE OF THE COMPENSATION RANGE FOR THIS ROLE. THIS COMPENSATION RANGE TAKES INTO ACCOUNT THE WIDE RANGE OF FACTORS THAT ARE CONSIDERED IN MAKING COMPENSATION DECISIONS INCLUDING BUT NOT LIMITED TO: SKILL SETS, EXPERIENCE AND TRAINING, LICENSURE AND CERTIFICATIONS, AND OTHER BUSINESS AND ORGANIZATIONAL NEEDS. THE DISCLOSED RANGE ESTIMATE HAS NOT BEEN ADJUSTED FOR THE APPLICABLE GEOGRAPHIC DIFFERENTIAL ASSOCIATED WITH THE LOCATION AT WHICH THE POSITION MAY BE FILLED. AT PRECISION, IT IS NOT TYPICAL FOR AN INDIVIDUAL TO BE HIRED AT OR NEAR THE TOP OF THE RANGE FOR THEIR ROLE AND COMPENSATION DECISIONS ARE DEPENDENT ON THE FACTS AND CIRCUMSTANCES OF EACH CASE. THIS ROLE IS ALSO ELIGIBLE FOR A DISCRETIONARY ANNUAL BONUS, HEALTH INSURANCE, RETIREMENT SAVINGS BENEFITS, LIFE INSURANCE AND DISABILITY BENEFITS, PARENTAL LEAVE, AND PAID TIME OFF FOR SICK LEAVE AND VACATION, AMONG OTHER BENEFITS.\n\nREASONABLE ESTIMATE OF THE CURRENT RANGE\n\n$55,000 — $76,000 USD\n\nANY DATA PROVIDED AS A PART OF THIS APPLICATION WILL BE STORED IN ACCORDANCE WITH OUR PRIVACY POLICY. FOR CA APPLICANTS, PLEASE ALSO REFER TO OUR CA PRIVACY NOTICE .\n\nPRECISION MEDICINE GROUP IS AN EQUAL OPPORTUNITY EMPLOYER. EMPLOYMENT DECISIONS ARE MADE WITHOUT REGARD TO RACE, COLOR, AGE, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, VETERAN STATUS OR OTHER CHARACTERISTICS PROTECTED BY LAW. © 2020 PRECISION MEDICINE GROUP, LLC\n\nIF YOU ARE AN INDIVIDUAL WITH A DISABILITY AND REQUIRE A REASONABLE ACCOMMODATION TO COMPLETE ANY PART OF THE APPLICATION PROCESS OR ARE LIMITED IN THE ABILITY OR UNABLE TO ACCESS OR USE THIS ONLINE APPLICATION PROCESS AND NEED AN ALTERNATIVE METHOD FOR APPLYING, YOU MAY CONTACT PRECISION MEDICINE GROUP AT QUESTIONFORHR@PRECISIONMEDICINEGRP.COM .\n\n",
    "job_skill_set": [
      "accounting",
      "finance",
      "Microsoft Excel",
      "budget preparation",
      "general ledger reconciliation",
      "client service",
      "communication",
      "time management",
      "problem solving",
      "analytical skills",
      "attention to detail",
      "interpersonal skills",
      "self-starting attitude",
      "critical thinking",
      "teamwork",
      "project accounting",
      "revenue recognition",
      "invoicing",
      "Salesforce"
    ],
    "short_keywords": [
      "accounting",
      "analyst",
      "analytical",
      "attention",
      "attitude",
      "budget",
      "client",
      "communication",
      "critical",
      "detail",
      "excel",
      "finance",
      "general",
      "i",
      "interpersonal",
      "invoicing",
      "ledger",
      "management",
      "microsoft",
      "preparation",
      "problem",
      "project",
      "recognition",
      "reconciliation",
      "revenue",
      "salesforce",
      "selfstarting",
      "service",
      "skills",
      "solving",
      "teamwork",
      "thinking",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3903481821",
    "job_title": "Trade Finance Associate",
    "category": "FINANCE",
    "job_description": "COMPANY DESCRIPTIONMERCHANT TRADE FINANCE IS A REPUTABLE PROVIDER OF THIRD-PARTY MERCHANT BANKING SERVICES WITH 20 YEARS OF EXPERIENCE. WE SPECIALIZE IN OFFERING DOCUMENTARY LETTERS OF CREDIT, STANDBY LETTERS OF CREDIT, BANK GUARANTEES, PERFORMANCE BONDS, GUARANTEE BONDS, AND PAYMENT GUARANTEES FOR IMPORT/EXPORT CONTRACTS AND PROJECT FINANCING. WE WORK WITH GENUINE INVESTORS AND RELIABLE, TOP-RATED BANKS TO ENSURE FAST AND DIRECT TRANSACTIONS FOR OUR CLIENTS.\nROLE DESCRIPTIONTHIS IS A PART-TIME REMOTE ROLE FOR A TRADE FINANCE ASSOCIATE. THE TRADE FINANCE ASSOCIATE WILL BE RESPONSIBLE FOR MANAGING BUSINESS RELATIONSHIPS, OVERSEEING TRADE FINANCE TRANSACTIONS, AND WORKING WITH TRADE INSTRUMENTATION AND THE UCP 600 GUIDELINES. THIS ROLE WILL REQUIRE REMOTE COMMUNICATION AND COLLABORATION WITH CLIENTS AND FINANCIAL INSTITUTIONS. TRADE FINANCE ASSOCIATE WILL BE RESPONSIBLE FOR THEIR OWN LEADS/ MARKETING. \nQUALIFICATIONSSTRONG KNOWLEDGE AND EXPERIENCE IN TRADE FINANCE AND TRADE INSTRUMENTATION.PROVEN ABILITY TO MANAGE BUSINESS RELATIONSHIPS.UNDERSTANDING OF FINANCE AND BANKING PRINCIPLES.FAMILIARITY WITH THE UCP 600 GUIDELINES.EXCELLENT COMMUNICATION AND NEGOTIATION SKILLS.ABILITY TO WORK INDEPENDENTLY AND REMOTELY.PRIOR EXPERIENCE IN MERCHANT BANKING OR TRADE FINANCE IS A PLUS.",
    "job_skill_set": [
      "trade finance",
      "banking principles",
      "business relationship management",
      "marketing",
      "communication",
      "collaboration",
      "trade instrumentation",
      "UCP 600 guidelines",
      "negotiation",
      "independence"
    ],
    "short_keywords": [
      "600",
      "associate",
      "banking",
      "business",
      "collaboration",
      "communication",
      "finance",
      "guidelines",
      "independence",
      "instrumentation",
      "management",
      "marketing",
      "negotiation",
      "principles",
      "relationship",
      "trade",
      "ucp"
    ]
  },
  {
    "job_id": "3899526397",
    "job_title": "Finance Project Leader",
    "category": "FINANCE",
    "job_description": "DURATION: 12 MONTHS (30 HOUR / WEEK)\nABOUT EDIFY TECHNOLOGIES: TRANSFORMING BUSINESSES WITH INNOVATIVE DIGITAL SOLUTIONS!HEADQUARTERED IN NAPERVILLE, IL, WE ARE A DYNAMIC TEAM WITH OVER TWO DECADES OF INDUSTRY EXPERTISE, DEDICATED TO DELIVERING ROBUST BUSINESS SOLUTIONS, STAFF AUGMENTATION, AND A COMPREHENSIVE RANGE OF APPLICATION AND WEB SERVICES. AS A FORMER RECIPIENT OF INC. MAGAZINE'S PRESTIGIOUS '5000 FASTEST GROWING PRIVATE COMPANIES' AWARD, WE TAKE IMMENSE PRIDE IN OUR PROVEN TRACK RECORD OF SUCCESS.AT EDIFY TECHNOLOGIES, WE PARTNER WITH CUSTOMERS GLOBALLY, EMPOWERING THEM TO ENHANCE THEIR TECHNOLOGY FOOTPRINT, REDUCE UNNECESSARY COSTS, DEVELOP SUSTAINABLE IT SOLUTIONS, AND GAIN A COMPETITIVE EDGE IN TODAY'S DIGITAL WORLD. WE BELIEVE IN CREATING AN IMPACT THROUGH INNOVATION, DRIVING TANGIBLE RESULTS THAT PROPEL BUSINESSES FORWARD.\nJOIN OUR TEAM: ARE YOU A FINANCE PROJECT LEAD LOOKING FOR A DYNAMIC OPPORTUNITY TO ACCELERATE YOUR CAREER? \nRESPONSIBILITIES:COORDINATES ALL ASPECTS OF PROJECT-ORIENTED WORK EFFORTS. SETS AND MANAGES STAKEHOLDER EXPECTATIONS INTERNALLY AND EXTERNALLY. UTILIZES PROJECT MANAGEMENT PROCESSES AND METHODOLOGIES. DEVELOPS PROJECT PLANS, DIRECTS, AND MONITORS WORK EFFORTS DAILY, IDENTIFIES RESOURCE NEEDS, PERFORMS QUALITY REVIEW; AND ESCALATES FUNCTIONAL, QUALITY, TIMELINE ISSUES APPROPRIATELY.TRACKS KEY PROJECT MILESTONES AND ADJUSTS PROJECT PLANS AND/OR RESOURCES AS NEEDED.DEFINES AND DOCUMENTS PROJECT SCOPE, OBJECTIVES, AND DESIRED OUTCOMES.  DEVELOPS AND MONITORS CHANGE MANAGEMENT REQUEST. SUPPORTS DEVELOPING BUSINESS REQUIREMENT DOCUMENTS AND VERIFIES ALIGNMENT WITH THE RESPECTIVE PROJECT CHARTERS.ENSURES PROJECTS ARE DELIVERED ON TIME, WITHIN BUDGET, AND ADHERES TO HIGH QUALITY STANDARDS.COMMUNICATES WITH ALL AREAS OF THE ENTERPRISE THAT IMPACTS THE SCOPE, BUDGET, RISK, AND RESOURCES OF THE WORK EFFORT BEING MANAGED.\nREQUIRED SKILLS:A MINIMUM OF 3 YEARS MANAGING PROJECTS.EXPERIENCE WITH TECHNOLOGY AND / OR OPERATIONAL PROJECTS.PROVEN EXPERIENCE IN PROJECT MANAGEMENT TOOLS.KNOWLEDGE OF PROJECT MANAGEMENT FRAMEWORKS AND BEST PRACTICES.\nEDUCATION: BACHELOR’S DEGREE OR EQUIVALENT WORK EXPERIENCEPROJECT MANAGEMENT CERTIFICATION OR SUCCESSFUL COMPLETION OF A RECOGNIZED PROJECT MANAGEMENT CURRICULUM IS REQUIRED\nGENERAL SKILLS:EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS.PROFICIENT AT MANAGING TIME AND RESOURCES.DETAIL-ORIENTED.ABILITY TO DRAW UP DETAILED PROJECT PLANS AND SCHEDULES.PROVEN LEADERSHIP SKILLS.CRITICAL THINKING AND PROBLEM-SOLVING SKILLS.ADEPT AT NEGOTIATING INTERNALLY AS WELL AS EXTERNALLY.  WE BELIEVE IN DIVERSITY & INCLUSION:AS A MINORITY-OWNED COMPANY, WE DEEPLY VALUE AND PRIORITIZE INCLUSION AND DIVERSITY WITHIN OUR ORGANIZATION. WE BELIEVE THAT A DIVERSE AND INCLUSIVE WORKFORCE FOSTERS INNOVATION, CREATIVITY, AND EMPATHY, LEADING TO A RICHER AND MORE REWARDING WORK ENVIRONMENT. WE ARE COMMITTED TO CULTIVATING A WORKPLACE WHERE EVERY TEAM MEMBER FEELS VALUED, RESPECTED, AND EMPOWERED TO CONTRIBUTE THEIR UNIQUE PERSPECTIVES AND TALENTS. JOIN US AND BE A PART OF A TEAM THAT CELEBRATES DIVERSITY, CHERISHES DIFFERENT PERSPECTIVES, AND FOSTERS A COLLABORATIVE AND SUPPORTIVE COMMUNITY. #INCLUSIONANDDIVERSITY #EMPOWERMENT #EDIFYTECHNOLOGIES #JOINOURTEAM #HIRING",
    "job_skill_set": [
      "project management",
      "project management tools",
      "budget management",
      "communication",
      "leadership",
      "critical thinking",
      "problem solving",
      "time management",
      "detail-oriented",
      "project management frameworks",
      "change management",
      "business requirement documents",
      "quality assurance",
      "negotiation"
    ],
    "short_keywords": [
      "assurance",
      "budget",
      "business",
      "change",
      "communication",
      "critical",
      "detailoriented",
      "documents",
      "finance",
      "frameworks",
      "leader",
      "leadership",
      "management",
      "negotiation",
      "problem",
      "project",
      "quality",
      "requirement",
      "solving",
      "thinking",
      "time",
      "tools"
    ]
  },
  {
    "job_id": "3894553589",
    "job_title": "VP, Finance and Investor Relations ",
    "category": "FINANCE",
    "job_description": "OUR CLIENT IS A WELL-ESTABLISHED AND GROWING REAL ESTATE DEVELOPMENT COMPANY BASED IN DENVER, CO. THEY FOCUS ON PREMIUM AND DIVERSIFIED ASSET CLASSES RANGING FROM MULTI-FAMILY TO COMMERCIAL PROPERTIES ACROSS MULTIPLE STATES. DUE TO GROWTH, THEY ARE LOOKING TO ADD A VP OF FINANCE AND INVESTOR RELATIONS\nSUMMARY OF THE ROLE - PROVIDE DEBT AND EQUITY ACQUISITION ASSISTANCE FOR A VARIETY OF DEVELOPMENT AND ACQUISITION PROJECTS. THE ROLE WILL PARTICIPATE IN SENIOR MANAGEMENT AND CORPORATE STRATEGY DISCUSSIONS REGULARLY. THE POSITION WILL ALSO BE RESPONSIBLE FOR MANAGING DEBT AND EQUITY RELATIONSHIPS WITH ASSISTANCE FROM THE EXECUTIVE TEAM. \nRESPONSIBILITIES: \nPARTICIPATE AND PROVIDE APPROPRIATE GUIDANCE IN SENIOR MANAGEMENT MEETINGS.ASSIST CFO IN INTRODUCTIONS AND RELATIONSHIP BUILDING FOR NEW LENDERS.CREATE AND MAINTAIN A LENDER RELATION PROGRAM UTILIZING THE CFO, PRESIDENT, AND OTHER EXECUTIVE TEAM MEMBERS TO BUILD THE RELATIONSHIP AS APPROPRIATE. CO-AUTHOR DEBT TERM SHEETS FOR DEBT STRUCTURES FOR POTENTIAL PROJECTS, TAKING INTO ACCOUNT BUSINESS PLAN REQUIREMENTS, RISK MITIGATION, GENERAL MARKET CONDITIONS, AND HISTORICAL TERMS.NEGOTIATE LOAN DOCUMENTS.MANAGE ANY LENDING ISSUES POST-FINANCIAL CLOSE, INCLUDING DRAWS, LOAN COVENANTS, LIENS, ETC.CREATE AND MAINTAIN INVESTOR RELATIONSHIP PROGRAM UTILIZING PRESIDENT, CHAIRMAN, CFO AND OTHER EXECUTIVE TEAM MEMBERS AS APPROPRIATE. LEVERAGE CORPORATE ASSETS (EVENT INVITATIONS, GOLF CLUB ACCESS, PROFESSIONAL SPORTS SEASON TICKET, ETC.) TO BUILD AND MAINTAIN RELATIONSHIPS. DEVELOP EQUITY TERM SHEETS FOR DEBT STRUCTURES FOR POTENTIAL PROJECTS, TAKING INTO ACCOUNT BUSINESS PLAN REQUIREMENTS, RISK MITIGATION, GENERAL MARKET CONDITIONS, AND HISTORICAL TERMS.ASSIST IN NEGOTIATING JOINT VENTURE DOCUMENTS.ASSIST IN MANAGING ANY EQUITY ISSUES POST-CLOSE.ASSIST AND GUIDE QUARTERLY (OR OTHERWISE, AS REQUIRED) INVESTOR UPDATES\n\nEDUCATION AND EXPERIENCE:10-15 YEARS OF REAL ESTATE EXPERIENCE WITH SIGNIFICANT TIME SPENT IN FINANCIAL DISCIPLINES IS REQUIRED.EXPERIENCE WILL EXHIBIT SIGNIFICANT PRIOR EXPERIENCE WITH A MAJORITY OF THE ROLE’S ESSENTIAL DUTIES AND RESPONSIBILITIES.",
    "job_skill_set": [
      "relationship management",
      "leadership",
      "communication",
      "team collaboration",
      "problem solving",
      "networking",
      "debt acquisition",
      "equity acquisition",
      "financial analysis",
      "negotiation",
      "real estate finance",
      "risk mitigation",
      "market analysis",
      "joint venture agreements",
      "investor relations",
      "term sheet creation",
      "strategic thinking"
    ],
    "short_keywords": [
      "acquisition",
      "agreements",
      "analysis",
      "and",
      "collaboration",
      "communication",
      "creation",
      "debt",
      "equity",
      "estate",
      "finance",
      "financial",
      "investor",
      "joint",
      "leadership",
      "management",
      "market",
      "mitigation",
      "negotiation",
      "networking",
      "problem",
      "real",
      "relations",
      "relationship",
      "risk",
      "sheet",
      "solving",
      "strategic",
      "team",
      "term",
      "thinking",
      "venture",
      "vp"
    ]
  },
  {
    "job_id": "3903426697",
    "job_title": "Project Finance Portfolio Management, Director ",
    "category": "FINANCE",
    "job_description": "MY CLIENT IS LOOKING TO HIRE A PROJECT FINANCE PORTFOLIO MANAGEMENT DIRECTOR TO JOIN THEIR GLOBAL BUSINESS.\nTHE PROJECT FINANCE PM WILL SERVE A PORTFOLIO MANAGEMENT FUNCTION IN MY CLIENTS PROJECT FINANCE PORTFOLIO. THIS POSITION IS RESPONSIBLE FOR INDEPENDENTLY OVERSEEING A DIVERSE PORTFOLIO OF PROJECT FINANCE TRANSACTIONS ACROSS VARIOUS INDUSTRIES, SUCH AS ENERGY, POWER AND INFRASTRUCTURE. THIS ROLE INVOLVES CREDIT MONITORING, CONTROL, AND ADMINISTRATION TO PROACTIVELY IDENTIFY POTENTIAL CREDIT ISSUES. THIS POSITION WILL ALSO ANALYZE AMENDMENT/CONSENT/WAIVER REQUESTS, ASSESS THEIR CREDIT IMPACT, AND PREPARE CREDIT APPROVAL APPLICATIONS WITH RECOMMENDED ACTIONS.\nRESPONSIBILITIES INCLUDE BUT AREN'T LIMITED TO:INDEPENDENTLY OVERSEE AND MANAGE A DIVERSE PORTFOLIO OF PROJECT FINANCE TRANSACTIONS IN INDUSTRIES INCLUDING THERMAL POWER, RENEWABLE POWER, INFRASTRUCTURE, OIL & GAS, AND MINING WITHIN NORTH AMERICA. PERFORM CREDIT MONITORING, CONTROL, AND ADMINISTRATION TO PROACTIVELY IDENTIFY AND ADDRESS POTENTIAL CREDIT ISSUES.ANALYZE AND EVALUATE AMENDMENT/CONSENT/WAIVER REQUESTS, ASSESSING THEIR IMPACT ON CREDIT AND PREPARING CREDIT APPROVAL APPLICATIONS WITH RECOMMENDED ACTIONS.\nTHE IDEAL CANDIDATE WILL HAVE 7+ YEARS OF EXPERIENCE IN PORTFOLIO MANAGEMENT/CREDIT RISK AND PROJECT FINANCE. \nTHIS POSITION IS IN OFFICE 3 DAYS/WEEK IN NYC.",
    "job_skill_set": [
      "financial analysis",
      "administration",
      "energy sector knowledge",
      "independent oversight",
      "problem solving",
      "communication",
      "analytical thinking",
      "decision making",
      "attention to detail",
      "team collaboration",
      "project finance",
      "credit monitoring",
      "portfolio management",
      "credit risk assessment",
      "amendment/consent/waiver analysis",
      "infrastructure knowledge",
      "oil & gas knowledge",
      "mining knowledge"
    ],
    "short_keywords": [
      "administration",
      "amendmentconsentwaiver",
      "analysis",
      "analytical",
      "assessment",
      "attention",
      "collaboration",
      "communication",
      "credit",
      "decision",
      "detail",
      "director",
      "energy",
      "finance",
      "financial",
      "gas",
      "independent",
      "infrastructure",
      "knowledge",
      "making",
      "management",
      "mining",
      "monitoring",
      "oil",
      "oversight",
      "portfolio",
      "problem",
      "project",
      "risk",
      "sector",
      "solving",
      "team",
      "thinking",
      "to"
    ]
  },
  {
    "job_id": "3906256205",
    "job_title": "Finance Manager (US)",
    "category": "FINANCE",
    "job_description": "WORK LOCATION:\n\nCHERRY HILL, NEW JERSEY\n\nHOURS\n\n40\n\nPAY DETAILS\n\n$86,840 - $139,360 USD\n\nTD IS COMMITTED TO PROVIDING FAIR AND EQUITABLE COMPENSATION OPPORTUNITIES TO ALL COLLEAGUES. THE INCLUDED SALARY RANGE FOR THIS ROLE TAKES INTO ACCOUNT MULTIPLE FACTORS THAT ARE CONSIDERED IN MAKING COMPENSATION DECISIONS. THE BASE PAY ACTUALLY OFFERED MAY VARY BASED UPON CANDIDATE'S SKILLS AND EXPERIENCE, JOB-RELATED KNOWLEDGE, LICENSURE AND CERTIFICATIONS, GEOGRAPHIC LOCATION, AND OTHER SPECIFIC BUSINESS AND ORGANIZATIONAL NEEDS. AS TD PUTS CAREER DEVELOPMENT AT THE FOREFRONT OF OUR COLLEAGUE EXPERIENCE, IT IS NOT TYPICAL FOR AN INDIVIDUAL TO BE HIRED AT OR NEAR THE TOP OF THE RANGE FOR THEIR ROLE.\n\nAS A CANDIDATE, YOU ARE ENCOURAGED TO ASK COMPENSATION RELATED QUESTIONS AND HAVE AN OPEN DIALOGUE WITH YOUR RECRUITER WHO CAN PROVIDE YOU MORE SPECIFIC DETAILS FOR THIS ROLE.\n\nLINE OF BUSINESS\n\nFINANCE\n\nJOB DESCRIPTION\n\nTHE FINANCE MANAGER PROVIDES A RANGE OF STRATEGIC FINANCE ADVICE, ANALYSIS AND SUPPORT FOR KEY BUSINESS AREAS/PORTFOLIOS AS ASSIGNED. PROACTIVELY MANAGES SENIOR RELATIONSHIPS IN ORDER TO PROVIDE SEASONED AND DEEP BUSINESS INSIGHTS, DECISION SUPPORT AND GUIDANCE AND WORKS CLOSELY WITH VARIOUS STAKEHOLDERS AND TEAM MEMBERS AS REQUIRED.\n\nDEPTH & SCOPE\n\nSCOPE OF ROLE MAY HAVE PAN-BUSINESS IMPACT AND FOCUS IS ON COMPREHENSIVE REVIEWS, SPECIALIZED ANALYSIS, AUDITS AND/OR INITIATIVES WITH A YEARLY TIME SPANACCOUNTABLE FOR CONDUCTING FINANCIAL ANALYSIS/RESEARCH, REVIEWS AND/OR AUDITS TO SUPPORT FUNCTIONAL GOALS/OBJECTIVESMAY ACT AS INTERFACE WITH FINANCE PARTNERS/LEADERS AND EXTERNAL PARTIESSERVES AS A SOURCE OF ADVICE TO SENIOR MANAGEMENT IN FIELD OF SPECIALTY; MAY LEAD TEAM(S) OF RELATED SPECIALISTS/EXPERTSUNDERTAKES AND COMPLETES A VARIETY OF COMPLEX PROJECTS AND INITIATIVES REQUIRING SEASONED BUSINESS PARTNER SPECIALIST KNOWLEDGE AND/OR THE INTEGRATION OF CROSS FUNCTIONAL PROCESSES WITHIN OWN AREA OF EXPERTISEWORK IS GUIDED BY POLICIES AND INDUSTRY STANDARDS/METHODSREQUIRES INNOVATIVE THINKING TO DEVELOP NEW SOLUTIONSCOMMUNICATES DIFFICULT CONCEPTS; CONVERTS INFORMATION TO COMPELLING BUSINESS CONTEXT AND ADVICE; INFLUENCES AND GAINS ALIGNMENT ACROSS INCREASINGLY SENIOR STAKEHOLDERSWORKS AUTONOMOUSLY AS THE LEAD AND GUIDES OTHERS WITHIN AREA OF EXPERTISE\n\nEDUCATION & EXPERIENCE\n\nUNDERGRADUATE DEGREE7+ YEARS OF RELEVANT EXPERIENCEACCOUNTING OR FINANCIAL DESIGNATION PREFERRED\n\nCUSTOMER ACCOUNTABILITIES\n\nWORKS CLOSELY WITH BUSINESS PARTNERS TO GAIN DEEP UNDERSTANDING OF THE BUSINESS AND RELEVANT OBJECTIVES IN ORDER TO CONTRIBUTE TO THE STRATEGIC DIRECTION OF RESPECTIVE BUSINESS AND/OR THE ENTERPRISEFORMULATES RELEVANT AND MEANINGFUL DATA ANALYSIS THROUGH COMPREHENSIVE DATA VISUALIZATION TOOLS, PROFILING TOOLS, SEGMENTATION, AS WELL AS LEVERAGING ADVANCED MODELING AND ANALYTICSLEADS ON THE INTERPRETATION OF COMPLEX BUSINESS ISSUES, GENERATES MULTIFACETED INSIGHTS AND IDENTIFIES OPPORTUNITIES TO HELP DRIVE BUSINESS GROWTH OR ADDRESS BUSINESS/ENTERPRISE NEEDS EFFECTIVELY COMMUNICATES RELEVANT/MEANINGFUL RECOMMENDATIONS ON A RANGE OF FINANCE MANAGEMENT ISSUES OR RELATED OPERATIONAL PROCESSES TO ALL LEVELS WITHIN THE ORGANIZATIONACTS AS A SUBJECT MATTER EXPERT FOR LOB FINANCE AREA SUPPORTED AND PROVIDES GUIDANCE/ADVICE AND RECOMMENDATIONS TO SUPPORT DEALINGS WITH INTERNAL/EXTERNAL PARTNERS IDENTIFIES AND DEVELOPS KEY BUSINESS PERFORMANCE MEASURES OR METRICS FOR OWN AREA AND ENSURES BENCHMARK/BEST PRACTICE INFORMATION IS SHARED WITH APPROPRIATE PARTIESWORKS TO MAXIMIZE SHAREHOLDER VALUE BY DEVELOPING KEY STRATEGIES/TACTICS FOR OWN UNIT AND BY CONDUCTING BUSINESS AND/OR FINANCIAL ANALYSIS TO SUPPORT KEY BUSINESS DECISIONS AND THE ACHIEVEMENT OF BUSINESS PARTNER OR DEPARTMENT OBJECTIVES LEVERAGES ADVANCED DATA AND ANALYTICS WHERE POSSIBLE TO ENSURE BUSINESS LEADERS ARE PROVIDED WITH COMPREHENSIVE INFORMATION TO ENABLE STRATEGIC DECISION SUPPORTDEVELOPS AND/OR ASSESSES SIGNIFICANT BUSINESS CASES/NEW INITIATIVES APPLYING EXPERTISE AND ENSURING CRITERIA FOR OWN AREA ARE MET (E.G., TAXATION, ACCOUNTING PRACTICES, FORECASTED RATES OF RETURN, EVALUATE OUTCOMES, TEST ASSUMPTIONS, INTERFACE WITH OTHERS FOR APPROPRIATE INPUT, IDENTIFY BENCHMARKS)PROACTIVELY PARTNERS AND SUPPORTS THE BUSINESS TO DEVELOP BUSINESS, FINANCIAL, OPERATIONAL, OR ORGANIZATIONAL STRATEGY FOR THE ORGANIZATIONENSURES ALIGNMENT BETWEEN BUSINESS SEGMENT AND ENTERPRISE GOALS/THRESHOLDSPROVIDES STRATEGIC INSIGHTS AND PROPOSES SOLUTIONS FOR THE ORGANIZATIONS THEY SUPPORT THAT DELIVER SUPERIOR RISK ADJUSTED PROFITABILITYCREATES “STORY-TELLING” PRESENTATIONS ON BUSINESS PERFORMANCE (COMPETITIVE ANALYSIS, ETC.)ACTS AS A CATALYST IN DRIVING FORWARD INITIATIVES CRITICAL TO DELIVERING STRATEGYDEVELOPS AND IMPLEMENTS GROWTH STRATEGIESPARTNERS WITH THE BUSINESS TO DEVELOP FINANCIAL PLANS AND FORECASTSAPPLIES MANAGEMENT-LEVEL FOCUS\n\nSHAREHOLDER ACCOUNTABILITIES\n\nACTS AS A RESPECTFUL “CHALLENGER” TO PROVIDE ALTERNATIVE POINTS OF VIEWLEADS THE DEVELOPMENT/IMPLEMENTATION OF NEW FINANCIAL MODELS, OPERATING SERVICE STANDARDS, METHODOLOGIES, FRAMEWORKS AND PARADIGMS TO SUPPORT ON-GOING REPORTING, AUDIT AND/OR ANALYSIS FUNCTIONS FOR OWN AREASYNTHESIZES COMPLEX AND VAST AMOUNT OF INFORMATION AND TRANSLATES INTO ACTIONABLE INSIGHTS AND STRATEGYMONITORS AND ANALYZES FINANCIAL PERFORMANCE, ACTING AS CUSTODIANS OF COSTADHERES TO ENTERPRISE FRAMEWORKS OR METHODOLOGIES THAT RELATE TO ACTIVITIES FOR OUR BUSINESS AREAENSURES RESPECTIVE PROGRAMS/POLICIES/PRACTICES ARE WELL MANAGED, MEETS BUSINESS NEEDS, COMPLIES WITH INTERNAL AND EXTERNAL REQUIREMENTS, AND ALIGNS WITH BUSINESS PRIORITIESCONSISTENTLY EXERCISES DISCRETION IN MANAGING CORRESPONDENCE, INFORMATION AND ALL MATTERS OF CONFIDENTIALITY AND PRIVACY; ESCALATES ISSUES WHERE APPROPRIATEENSURES BUSINESS OPERATIONS ARE IN COMPLIANCE WITH APPLICABLE INTERNAL AND EXTERNAL REQUIREMENTS (E.G. FINANCIAL CONTROLS, SEGREGATION OF DUTIES, TRANSACTION APPROVALS AND PHYSICAL CONTROL OF ASSETS)PARTICIPATES IN CROSS-FUNCTIONAL/ENTERPRISE INITIATIVES AS A SUBJECT MATTER EXPERT HELPING TO IDENTIFY RISK/PROVIDE GUIDANCE FOR COMPLEX SITUATIONSCONDUCTS INTERNAL AND EXTERNAL RESEARCH PROJECTS; SUPPORTS THE DEVELOPMENT/DELIVERY OF PRESENTATIONS/COMMUNICATIONS TO MANAGEMENT OR BROADER AUDIENCECONDUCTS MEANINGFUL ANALYSIS AT THE FUNCTIONAL OR ENTERPRISE LEVEL USING RESULTS TO DRAW CONCLUSIONS, MAKES RECOMMENDATIONS, ASSESSES THE EFFECTIVENESS OF PROGRAMS/POLICIES/PRACTICESMONITORS SERVICE, PRODUCTIVITY AND ASSESSES EFFICIENCY LEVELS WITHIN OWN FUNCTION AND IMPLEMENTS CONTINUOUS PROCESS/PERFORMANCE IMPROVEMENTS WHERE OPPORTUNITIES EXISTIDENTIFIES/RECOMMENDS/SUPPORTS THE IMPLEMENTATION OF ACTIONS/REMEDIATION PLANS TO ADDRESS PERFORMANCE/RISK/GOVERNANCE ISSUESACTIVELY MANAGES RELATIONSHIPS WITHIN AND ACROSS VARIOUS BUSINESS LINES, CORPORATE AND/OR CONTROL FUNCTIONS AND ENSURES ALIGNMENT WITH ENTERPRISE AND/OR REGULATORY REQUIREMENTSKEEPS ABREAST OF EMERGING ISSUES, TRENDS, AND EVOLVING REGULATORY REQUIREMENTS AND ASSESSES POTENTIAL IMPACTSMAINTAINS A CULTURE OF RISK BASED MANAGEMENT AND CONTROL, SUPPORTED BY EFFECTIVE PROCESSES IN ALIGNMENT WITH RISK APPETITE\n\nEMPLOYEE/TEAM ACCOUNTABILITIES\n\nPARTICIPATES FULLY AS A MEMBER OF THE TEAM, SUPPORTS A POSITIVE WORK ENVIRONMENT THAT PROMOTES SERVICE TO THE BUSINESS, QUALITY, INNOVATION AND TEAMWORK AND ENSURES TIMELY COMMUNICATION OF ISSUES/POINTS OF INTERESTPROVIDES THOUGHT LEADERSHIP AND/OR INDUSTRY KNOWLEDGE FOR OWN AREA OF EXPERTISE AND PARTICIPATES IN KNOWLEDGE TRANSFER WITHIN THE TEAM AND BUSINESS UNITKEEPS CURRENT ON EMERGING TRENDS/DEVELOPMENTS AND GROWS KNOWLEDGE OF THE BUSINESS, RELATED TOOLS AND TECHNIQUESPARTICIPATES IN PERSONAL PERFORMANCE MANAGEMENT AND DEVELOPMENT ACTIVITIES, INCLUDING CROSS TRAINING WITHIN OWN TEAMKEEPS OTHERS INFORMED AND UP-TO-DATE ABOUT THE STATUS/PROGRESS OF PROJECTS AND/OR ALL RELEVANT OR USEFUL INFORMATION RELATED TO DAY-TO-DAY ACTIVITIESCONTRIBUTES TO TEAM DEVELOPMENT OF SKILLS AND CAPABILITIES THROUGH MENTORSHIP OF OTHERS, BY SHARING KNOWLEDGE AND EXPERIENCES AND LEVERAGING BEST PRACTICESLEADS, MOTIVATES AND DEVELOPS RELATIONSHIPS WITH INTERNAL AND EXTERNAL BUSINESS PARTNERS/STAKEHOLDERS TO DEVELOP PRODUCTIVE WORKING RELATIONSHIPSCONTRIBUTES TO A FAIR, POSITIVE AND EQUITABLE ENVIRONMENT THAT SUPPORTS A DIVERSE WORKFORCEACTS AS A BRAND AMBASSADOR FOR YOUR BUSINESS AREA/FUNCTION AND THE BANK, BOTH INTERNALLY AND/OR EXTERNALLY\n\nPHYSICAL REQUIREMENTS\n\nNEVER: 0%; OCCASIONAL: 1-33%; FREQUENT: 34-66%; CONTINUOUS: 67-100%\n\nDOMESTIC TRAVEL – OCCASIONALINTERNATIONAL TRAVEL – NEVERPERFORMING SEDENTARY WORK – CONTINUOUSPERFORMING MULTIPLE TASKS – CONTINUOUSOPERATING STANDARD OFFICE EQUIPMENT - CONTINUOUSRESPONDING QUICKLY TO SOUNDS – OCCASIONALSITTING – CONTINUOUSSTANDING – OCCASIONALWALKING – OCCASIONALMOVING SAFELY IN CONFINED SPACES – OCCASIONALLIFTING/CARRYING (UNDER 25 LBS.) – OCCASIONALLIFTING/CARRYING (OVER 25 LBS.) – NEVERSQUATTING – OCCASIONALBENDING – OCCASIONALKNEELING – NEVERCRAWLING – NEVERCLIMBING – NEVERREACHING OVERHEAD – NEVERREACHING FORWARD – OCCASIONALPUSHING – NEVERPULLING – NEVERTWISTING – NEVERCONCENTRATING FOR LONG PERIODS OF TIME – CONTINUOUSAPPLYING COMMON SENSE TO DEAL WITH PROBLEMS INVOLVING STANDARDIZED SITUATIONS – CONTINUOUSREADING, WRITING AND COMPREHENDING INSTRUCTIONS – CONTINUOUSADDING, SUBTRACTING, MULTIPLYING AND DIVIDING – CONTINUOUS\n\nTHE ABOVE STATEMENTS ARE INTENDED TO DESCRIBE THE GENERAL NATURE AND LEVEL OF WORK BEING PERFORMED BY PEOPLE ASSIGNED TO THIS JOB. THEY ARE NOT INTENDED TO BE AN EXHAUSTIVE LIST OF ALL RESPONSIBILITIES, DUTIES AND SKILLS REQUIRED. THE LISTED OR SPECIFIED RESPONSIBILITIES & DUTIES ARE CONSIDERED ESSENTIAL FUNCTIONS FOR ADA PURPOSES.\n\nWHO WE ARE\n\nTD IS ONE OF THE WORLD'S LEADING GLOBAL FINANCIAL INSTITUTIONS AND IS THE FIFTH LARGEST BANK IN NORTH AMERICA BY BRANCHES/STORES. EVERY DAY, WE DELIVER LEGENDARY CUSTOMER EXPERIENCES TO OVER 27 MILLION HOUSEHOLDS AND BUSINESSES IN CANADA, THE UNITED STATES AND AROUND THE WORLD. MORE THAN 95,000 TD COLLEAGUES BRING THEIR SKILLS, TALENT, AND CREATIVITY TO THE BANK, THOSE WE SERVE, AND THE ECONOMIES WE SUPPORT. WE ARE GUIDED BY OUR VISION TO BE THE BETTER BANK AND OUR PURPOSE TO ENRICH THE LIVES OF OUR CUSTOMERS, COMMUNITIES AND COLLEAGUES.\n\nTD IS DEEPLY COMMITTED TO BEING A LEADER IN CUSTOMER EXPERIENCE, THAT IS WHY WE BELIEVE THAT ALL COLLEAGUES, NO MATTER WHERE THEY WORK, ARE CUSTOMER FACING. AS WE BUILD OUR BUSINESS AND DELIVER ON OUR STRATEGY, WE ARE INNOVATING TO ENHANCE THE CUSTOMER EXPERIENCE AND BUILD CAPABILITIES TO SHAPE THE FUTURE OF BANKING. WHETHER YOU’VE GOT YEARS OF BANKING EXPERIENCE OR ARE JUST STARTING YOUR CAREER IN FINANCIAL SERVICES, WE CAN HELP YOU REALIZE YOUR POTENTIAL. THROUGH REGULAR LEADERSHIP AND DEVELOPMENT CONVERSATIONS TO MENTORSHIP AND TRAINING PROGRAMS, WE’RE HERE TO SUPPORT YOU TOWARDS YOUR GOALS. AS AN ORGANIZATION, WE KEEP GROWING – AND SO WILL YOU.\n\nOUR TOTAL REWARDS PACKAGE\n\nOUR TOTAL REWARDS PACKAGE REFLECTS THE INVESTMENTS WE MAKE IN OUR COLLEAGUES TO HELP THEM AND THEIR FAMILIES ACHIEVE THEIR FINANCIAL, PHYSICAL AND MENTAL WELL-BEING GOALS. TOTAL REWARDS AT TD INCLUDES BASE SALARY AND VARIABLE COMPENSATION/INCENTIVE AWARDS (E.G., ELIGIBILITY FOR CASH AND/OR EQUITY INCENTIVE AWARDS, GENERALLY THROUGH PARTICIPATION IN AN INCENTIVE PLAN) AND SEVERAL OTHER KEY PLANS SUCH AS HEALTH AND WELL-BEING BENEFITS, SAVINGS AND RETIREMENT PROGRAMS, PAID TIME OFF (INCLUDING VACATION PTO, FLEX PTO, AND HOLIDAY PTO), BANKING BENEFITS AND DISCOUNTS, CAREER DEVELOPMENT, AND REWARD AND RECOGNITION. LEARN MORE\n\nADDITIONAL INFORMATION\n\nWE’RE DELIGHTED THAT YOU’RE CONSIDERING BUILDING A CAREER WITH TD. THROUGH REGULAR DEVELOPMENT CONVERSATIONS, TRAINING PROGRAMS, AND A COMPETITIVE BENEFITS PLAN, WE’RE COMMITTED TO PROVIDING THE SUPPORT OUR COLLEAGUES NEED TO THRIVE BOTH AT WORK AND AT HOME.\n\nCOLLEAGUE DEVELOPMENT \n\nIF YOU’RE INTERESTED IN A SPECIFIC CAREER PATH OR ARE LOOKING TO BUILD CERTAIN SKILLS, WE WANT TO HELP YOU SUCCEED. YOU’LL HAVE REGULAR CAREER, DEVELOPMENT, AND PERFORMANCE CONVERSATIONS WITH YOUR MANAGER, AS WELL AS ACCESS TO AN ONLINE LEARNING PLATFORM AND A VARIETY OF MENTORING PROGRAMS TO HELP YOU UNLOCK FUTURE OPPORTUNITIES. WHETHER YOU HAVE A PASSION FOR HELPING CUSTOMERS AND WANT TO EXPAND YOUR EXPERIENCE, OR YOU WANT TO COACH AND INSPIRE YOUR COLLEAGUES, THERE ARE MANY DIFFERENT CAREER PATHS WITHIN OUR ORGANIZATION AT TD – AND WE’RE COMMITTED TO HELPING YOU IDENTIFY OPPORTUNITIES THAT SUPPORT YOUR GOALS.\n\nTRAINING & ONBOARDING\n\nWE WILL PROVIDE TRAINING AND ONBOARDING SESSIONS TO ENSURE THAT YOU’VE GOT EVERYTHING YOU NEED TO SUCCEED IN YOUR NEW ROLE.\n\nINTERVIEW PROCESS \n\nWE’LL REACH OUT TO CANDIDATES OF INTEREST TO SCHEDULE AN INTERVIEW. WE DO OUR BEST TO COMMUNICATE OUTCOMES TO ALL APPLICANTS BY EMAIL OR PHONE CALL.\n\nACCOMMODATION\n\nIF YOU ARE AN APPLICANT WITH A DISABILITY AND NEED ACCOMMODATIONS TO COMPLETE THE APPLICATION PROCESS, EMAIL THE TD BANK US WORKPLACE ACCOMMODATIONS PROGRAM AT USWAPTDO@TD.COM. INCLUDE YOUR FULL NAME, BEST WAY TO REACH YOU, AND THE ACCOMMODATION NEEDED TO ASSIST YOU WITH THE APPLICATION PROCESS.\n\nALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, OR STATUS AS A PROTECTED VETERAN.",
    "job_skill_set": [
      "financial analysis",
      "auditing",
      "accounting",
      "strategic planning",
      "performance metrics",
      "business case development",
      "communication",
      "relationship management",
      "teamwork",
      "problem solving",
      "leadership",
      "adaptability",
      "customer focus",
      "data visualization",
      "financial modeling",
      "advanced analytics",
      "risk management",
      "innovative thinking",
      "influencing",
      "mentorship"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "advanced",
      "analysis",
      "analytics",
      "auditing",
      "business",
      "case",
      "communication",
      "customer",
      "data",
      "development",
      "finance",
      "financial",
      "focus",
      "influencing",
      "innovative",
      "leadership",
      "management",
      "manager",
      "mentorship",
      "metrics",
      "modeling",
      "performance",
      "planning",
      "problem",
      "relationship",
      "risk",
      "solving",
      "strategic",
      "teamwork",
      "thinking",
      "us",
      "visualization"
    ]
  },
  {
    "job_id": "3904393058",
    "job_title": "Global Investment Research, Regional Banks and Consumer Finance, Associate",
    "category": "FINANCE",
    "job_description": "JOB DESCRIPTION\n\nGLOBAL INVESTMENT RESEARCH\n\nFROM MACROECONOMIC FORECASTS TO INDIVIDUAL STOCK ANALYSIS, OUR TEAM DEVELOPS TOOLS AND INSIGHTS TO HELP SHAPE INVESTMENT STRATEGIES FOR CLIENTS AND THE FIRM. OUR ANALYSTS WORK ON CLIENT-FOCUSED RESEARCH IN THE EQUITY, FIXED-INCOME, CURRENCY, AND COMMODITIES MARKETS, MINING BIG DATA THAT ENTERS MARKETS AROUND THE WORLD EACH DAY TO IDENTIFY GAME-CHANGING INSIGHTS. YOU’LL BE PART OF A TEAM THAT IS INTELLECTUALLY CURIOUS, CREATIVE, ANALYTICAL, AND PASSIONATE ABOUT PERFORMING MARKET RESEARCH.\n\nGLOBAL INVESTMENT RESEARCH PRODUCES ORIGINAL, FUNDAMENTAL RESEARCH AND ANALYSIS OF INDUSTRIES, COMPANIES AND ECONOMIES. OUR RESEARCH TEAMS CONTINUALLY IDENTIFY AND ANALYZE FINANCIAL INFORMATION, STRATEGIC ISSUES AND TRENDS THAT AFFECT COMPANIES, INDUSTRIES AND MARKETS ON A REGIONAL AND GLOBAL SCALE. THIS ROLE OFFERS AN EXCELLENT OPPORTUNITY TO GAIN HANDS-ON EXPERIENCE IN EQUITY RESEARCH AND CONTRIBUTE TO THE DEVELOPMENT OF ACTIONABLE INVESTMENT IDEAS.\n\nWORKING CLOSELY WITH THE SENIOR ANALYST AND OTHER MEMBERS OF THE REGIONAL BANKS & CONSUMER FINANCE TEAM, THE GOAL OF THE ASSOCIATE IS TO\n\n BUILD STRONG INDUSTRY KNOWLEDGE OF THE BANKING AND CONSUMER FINANCE SECTOR  CONTRIBUTE TO THE GENERATION AND EXECUTION OF INVESTMENT IDEAS  WRITE REPORTS/NOTES ON COMPANIES UNDER COVERAGE  COMMUNICATE WITH THE EQUITIES SALES FORCE AND TRADERS, CLIENTS AND COMPANY MANAGEMENTS  INTERPRET DATA AND PERFORM ANALYSIS ON MARKET, ECONOMIC AND TECHNOLOGY TRENDS  DEVELOP FINANCIAL MODELS \n\nBASIC QUALIFICATIONS\n\nSKILLS & EXPERIENCE WE’RE LOOKING FOR\n\n EXCELLENT ANALYTICAL SKILLS  STRONG VERBAL AND WRITTEN COMMUNICATION SKILLS  PROFICIENCY IN EXCEL  ATTENTION TO DETAIL  STRONG TEAM ORIENTATION \n\nPREFERRED QUALIFICATIONS\n\n 1-4+ YEARS OF EXPERIENCE IN INVESTMENT RESEARCH, FINANCIAL MODELLING AND ANALYSIS  WORKING KNOWLEDGE OF ACCOUNTING, FINANCE, AND VALUATION  DEMONSTRATED INTEREST OR PREVIOUS EXPERIENCE IN THE BANKS / CONSUMER FINANCE SECTOR  ABILITY TO WORK IN A FAST-PACED, HIGH-ENERGY ENVIRONMENT  COMFORTABLE TAKING INITIATIVE AND BEING RESOURCEFUL/ENTREPRENEURIAL  ABILITY TO MULTI-TASK AND WORK WITH NUMEROUS TEAMS \n\nABOUT GOLDMAN SACHS\n\nAT GOLDMAN SACHS, WE COMMIT OUR PEOPLE, CAPITAL AND IDEAS TO HELP OUR CLIENTS, SHAREHOLDERS AND THE COMMUNITIES WE SERVE TO GROW. FOUNDED IN 1869, WE ARE A LEADING GLOBAL INVESTMENT BANKING, SECURITIES AND INVESTMENT MANAGEMENT FIRM. HEADQUARTERED IN NEW YORK, WE MAINTAIN OFFICES AROUND THE WORLD.\n\nWE BELIEVE WHO YOU ARE MAKES YOU BETTER AT WHAT YOU DO. WE'RE COMMITTED TO FOSTERING AND ADVANCING DIVERSITY AND INCLUSION IN OUR OWN WORKPLACE AND BEYOND BY ENSURING EVERY INDIVIDUAL WITHIN OUR FIRM HAS A NUMBER OF OPPORTUNITIES TO GROW PROFESSIONALLY AND PERSONALLY, FROM OUR TRAINING AND DEVELOPMENT OPPORTUNITIES AND FIRMWIDE NETWORKS TO BENEFITS, WELLNESS AND PERSONAL FINANCE OFFERINGS AND MINDFULNESS PROGRAMS. LEARN MORE ABOUT OUR CULTURE, BENEFITS, AND PEOPLE AT GS.COM/CAREERS.\n\nWE’RE COMMITTED TO FINDING REASONABLE ACCOMMODATIONS FOR CANDIDATES WITH SPECIAL NEEDS OR DISABILITIES DURING OUR RECRUITING PROCESS. LEARN MORE: HTTPS://WWW.GOLDMANSACHS.COM/CAREERS/FOOTER/DISABILITY-STATEMENT.HTML\n\n© THE GOLDMAN SACHS GROUP, INC., 2023. ALL RIGHTS RESERVED.\n\nGOLDMAN SACHS IS AN EQUAL EMPLOYMENT/AFFIRMATIVE ACTION EMPLOYER FEMALE/MINORITY/DISABILITY/VETERAN/SEXUAL ORIENTATION/GENDER IDENTITY\n\nSALARY RANGE\n\nTHE EXPECTED BASE SALARY FOR THIS NEW YORK, NEW YORK, UNITED STATES-BASED POSITION IS $150000-$225000. IN ADDITION, YOU MAY BE ELIGIBLE FOR A DISCRETIONARY BONUS IF YOU ARE AN ACTIVE EMPLOYEE AS OF FISCAL YEAR-END.\n\nBENEFITS\n\nGOLDMAN SACHS IS COMMITTED TO PROVIDING OUR PEOPLE WITH VALUABLE AND COMPETITIVE BENEFITS AND WELLNESS OFFERINGS, AS IT IS A CORE PART OF PROVIDING A STRONG OVERALL EMPLOYEE EXPERIENCE. A SUMMARY OF THESE OFFERINGS, WHICH ARE GENERALLY AVAILABLE TO ACTIVE, NON-TEMPORARY, FULL-TIME AND PART-TIME US EMPLOYEES WHO WORK AT LEAST 20 HOURS PER WEEK, CAN BE FOUND HERE .",
    "job_skill_set": [
      "financial modeling",
      "data analysis",
      "investment research",
      "finance",
      "analytical skills",
      "communication",
      "initiative",
      "resourcefulness",
      "Excel",
      "accounting",
      "valuation",
      "teamwork",
      "attention to detail",
      "multi-tasking"
    ],
    "short_keywords": [
      "accounting",
      "analysis",
      "analytical",
      "and",
      "associate",
      "attention",
      "banks",
      "communication",
      "consumer",
      "data",
      "detail",
      "excel",
      "finance",
      "financial",
      "global",
      "initiative",
      "investment",
      "modeling",
      "multitasking",
      "regional",
      "research",
      "resourcefulness",
      "skills",
      "teamwork",
      "to",
      "valuation"
    ]
  },
  {
    "job_id": "3901906635",
    "job_title": "Finance and Operations Director",
    "category": "FINANCE",
    "job_description": "\nAPPLICANTS MUST SEND RESUME AND COVER LETTER WITH SALARY RANGE TO LAUREN@ILENVIRO.ORG TO BE CONSIDERED. INCOMPLETE APPLICATIONS VIA LINKEDIN WILL NOT BE REVIEWED.\nPOSITION SUMMARY:\nTHE FINANCE AND OPERATIONS DIRECTOR WILL PLAY A PIVOTAL ROLE IN THE OVERALL OPERATIONS, FINANCIAL OVERSIGHT, AND PEOPLE SUSTAINABILITY OF IEC. THE FINANCE AND OPERATIONS DIRECTOR WILL BE RESPONSIBLE FOR MAINTAINING AND IMPROVING DAY-TO-DAY ORGANIZATIONAL FUNCTIONS, INCLUDING BUT NOT LIMITED TO FINANCE, HR, AND OPERATIONS FOR THE CHICAGO & SPRINGFIELD LOCATIONS. THIS ROLE WILL SUPERVISE A TEAM OF TWO THAT WILL FOCUS ON THE OPERATIONS AND HR FUNCTIONS OF THE ORGANIZATION. THIS POSITION WILL ALSO INTERACT WITH IEC’S BOARD OF DIRECTORS, SENIOR MANAGEMENT, OTHER STAFF, AND EXTERNAL CONSTITUENTS.\nIEC’S DEEP RELATIONSHIPS WITH LEADERS, NON-PROFIT ORGANIZATIONS, AND GOVERNMENT OFFICIALS POSITION IT WELL TO CONVENE PHILANTHROPIC FORCES AND ENGAGE CIVIC PARTNERS IN THE COMMUNITY TO ADDRESS, MITIGATE, AND SOLVE REGIONAL ENVIRONMENTAL PROBLEMS. THE OPPORTUNITY FOR IEC IS TO BRING ALL OF THESE PLAYERS TOGETHER TO PROMOTE AN EVEN MORE THRIVING – AND EQUITABLE – REGION, WORKING COLLABORATIVELY WITH OTHER PARTS OF THE STATE TO IDENTIFY LONG-OVERDUE ENVIRONMENTAL SOLUTIONS.\nTHE FINANCE AND OPERATIONS DIRECTOR WILL MAINTAIN AND PROVIDE FINANCIAL DATA AND INFORMATION ABOUT ALL ORGANIZATIONAL ACTIVITIES THAT WILL ASSIST MANAGEMENT, THE BOARD OF DIRECTORS, AND PROGRAM LEADS IN MAKING SOUND FINANCIAL DECISIONS ABOUT THE ORGANIZATION’S OPERATIONS AND FUTURE GROWTH. THE FINANCE AND OPERATIONS DIRECTOR WILL PROVIDE OVERSIGHT ON THE INTERNAL OPERATIONS SIDE OF THE ORGANIZATION.\nPOSITION RESPONSIBILITIES:\nFINANCE AND ADMINISTRATIONOVERSEE AND EXECUTE FINANCE OPERATIONS, INCLUDING ACCOUNTS PAYABLE, RECEIVABLES, AND PAYROLL FUNCTIONS.MANAGE COSTS AND PROFITABILITY, MAKING SURE EXPENDITURES ARE CONSISTENT WITH THE ORGANIZATION’S BUDGETS AND FUNDER’S GOALS AND MISSION ACROSS OUR 501(C) 3 AND 501(C) 4 BUDGETS.COMPLY WITH ALL FUNDER REPORTING REQUIREMENTS.OVERSEE PREPARATION OF ANNUAL FINANCIAL STATEMENTS IN COMPLIANCE WITH GENERALLY ACCEPTED FINANCIAL PRINCIPLES AND COORDINATION OF ANNUAL INDEPENDENT FINANCIAL STATEMENT AUDIT.LEAD ANNUAL BUDGETING PROCESS, INCLUDING THE BOARD APPROVAL PROCESS AND COLLABORATION ACROSS THE DEVELOPMENT AND PROGRAMS TEAMS.REMAIN CURRENT AND KNOWLEDGEABLE ABOUT LEGAL, ACCOUNTING, AUDIT, AND TAX POLICY MATTERS RELATED TO FOUNDATIONS AND PHILANTHROPY.MANAGE AND EVALUATE FISCALLY-SPONSORED PARTNERSHIPS IN ACCORDANCE WITH IEC’S POLICIES AND THE ABILITY OF IEC TO ADMINISTER PARTNERSHIPS APPROPRIATELY.PROVIDE FINANCIAL ANALYSIS AND INFORMATION SHARING THROUGHOUT THE ORGANIZATION TO AID IN DECISION-MAKING AND STRATEGIC DIRECTION, INCLUDING SUPPORTING LONG-RANGE STRATEGIC PLANNING GOALS WITH FINANCIAL AND ECONOMIC INSIGHTS.OVERSEE IEC’S FISCAL SPONSORSHIP PROGRAM.\nOPERATIONSOVERSEE THE DEVELOPMENT, MAINTENANCE, AND IMPLEMENTATION OF OPERATIONAL POLICIES AND PROCEDURES.OVERSEE DAY-TO-DAY OPERATIONS, INCLUDING FINANCE, PEOPLE MANAGEMENT, AND OFFICE MAINTENANCE.\nLEADERSHIP:MANAGE/SUPERVISE/MENTOR ALL MEMBERS OF THE FINANCE, HR, AND OPERATIONS TEAM IN THEIR MANAGEMENT OF ALL ASPECTS OF ACCOUNTING, FINANCIAL, OPERATIONS, HR ADMINISTRATION, INVESTMENT MANAGEMENT, GRANTS AND CONTRACTS, AND INFORMATION TECHNOLOGY.SERVE AS A COLLABORATIVE MEMBER OF THE EXECUTIVE DIRECTOR’S INTERNAL LEADERSHIP TEAM RESPONSIBLE FOR ORGANIZATIONAL POLICY DEVELOPMENT AND PLANNING.COLLABORATE WITH STAFF MEMBERS TO IMPLEMENT IEC’S EQUITY, DIVERSITY, AND INCLUSION PLAN.ACT AS STAFF POINT PERSON FOR THE BOARD OF DIRECTORS FINANCE COMMITTEE AND DRIVE SUSTAINABLE GROWTH.\nQUALIFICATIONSMANAGEMENT EXPERIENCE IN A FINANCE AND OPERATIONS FUNCTION; NON-PROFIT AND/OR FOUNDATION EXPERIENCE REQUIRED.STRONG FINANCIAL ACUMEN AND JUDGMENT COMBINED WITH A PASSION FOR ENVIRONMENTAL JUSTICE.PREVIOUS EXPERIENCE WITH FINANCES AND BUDGETING, OPERATIONS, AND PEOPLE MANAGEMENT. PREVIOUS EXPERIENCE TRACKING FOUNDATION GRANT SPENDING, CREATING GRANT BUDGETS FOR PROPOSALS, AND COMPLETING REPORTING REQUIREMENTS FOR GRANTS.STRONG OPERATIONAL AND IMPLEMENTATION EXPERIENCE.DEMONSTRATED KNOWLEDGE OF FINANCE, ACCOUNTING, AND HR SOFTWARE SYSTEMS AND THE ABILITY TO ADOPT NEW SYSTEMS EASILY IN ACCORDANCE WITH EVOLVING NEEDS AND REQUIREMENTS.EXPERTISE IN QUICKBOOKS OR RELATED ACCOUNTING SOFTWARE.HIGHLY DEVELOPED INTERPERSONAL SKILLS AND SAVVY IN RELATIONSHIP AND CULTURE-BUILDING.DETAIL-ORIENTED WITH THE ABILITY TO TRACK TO COMPLETION OF NUMEROUS PROJECTS AND TASKS.\nEQUAL OPPORTUNITY EMPLOYERIEC/IECEF IS AN EQUAL-OPPORTUNITY EMPLOYER THAT IS COMMITTED TO DIVERSITY AND INCLUSION IN THE WORKPLACE. WE PROHIBIT DISCRIMINATION AND HARASSMENT OF ANY KIND BASED ON RACE, COLOR, SEX, GENDER EXPRESSION OR IDENTITY, RELIGION, AGE, NATIONAL ORIGIN, ANCESTRY, MARITAL STATUS, PROTECTIVE ORDER STATUS, VETERAN STATUS, SEXUAL ORIENTATION, CITIZENSHIP STATUS, GENETIC INFORMATION, ANCESTRY, PREGNANCY, CERTAIN ARREST OR CRIMINAL HISTORY RECORDS, HOMELESSNESS AND USE OF LAWFUL PRODUCTS OUTSIDE OF WORK DURING NON-WORKING HOURS OR ANY OTHER PROTECTED CHARACTERISTIC AS OUTLINED BY FEDERAL, STATE, OR LOCAL LAWS.\nEQUITY, ALLYSHIP, AND POWERBUILDING VALUESIEC/IECEF IS WORKING ALWAYS TO ENSURE THAT EVERYONE ON OUR TEAM FEELS ENGAGED AND SUPPORTED IN ALL AREAS OF THE ORGANIZATION’S OPERATIONS AS WE WORK TO BECOME A FULLY INCLUSIVE, MULTICULTURAL, AND ANTI-RACIST ORGANIZATION.\nWE ARE ONLY AS POWERFUL AS THE PEOPLE IN OUR MOVEMENT AND THOSE WE SERVE. BUILDING POWER FOR PEOPLE AND OUR ENVIRONMENT IN ILLINOIS REQUIRES US TO ACTIVELY COMBAT SOCIAL AND POLITICAL POWER DYNAMICS THAT DISENFRANCHISE MARGINALIZED COMMUNITIES ACROSS A BROAD RANGE OF ISSUES BEYOND THOSE THAT FALL SQUARELY WITHIN TRADITIONAL ENVIRONMENTAL POLICY. WHEN MARGINALIZED COMMUNITIES ARE EMPOWERED, ENVIRONMENTAL PROTECTIONS BECOME MORE POSSIBLE. THUS WE ARE CALLED TO STAND IN SOLIDARITY AS ALLIES WITH THOSE FIGHTING FOR JUSTICE AND TO STRENGTHEN OUR DEMOCRATIC INSTITUTIONS WHERE POWER DRIVES POLICY CHANGE.\nABOUT OUR PAY AND BENEFITSTHIS FULL-TIME POSITION CAN BE BASED OUT OF THE CHICAGO OR SPRINGFIELD OFFICE WITH A HYBRID WORK ARRANGEMENT WHICH WILL INCLUDE A MINIMUM OF 2 DAYS IN OFFICE. BENEFITS INCLUDE HEALTH INSURANCE, DENTAL INSURANCE, A 401(K) PLAN, AND GENEROUS PAID TIME OFF.\nSALARY RANGE IS $90,000-110,000, COMMENSURATE WITH EXPERIENCE. COVER LETTER MUST INCLUDE SALARY REQUIREMENTS.\nHOW TO APPLY\nINTRODUCE YOURSELF TO US AS A COLLEAGUE. SHOW US YOUR FUTURE HERE, AND LET US KNOW WHAT YOU’D BRING TO OUR ORGANIZATION! \nTHE APPLICATION DEADLINE IS APRIL 30, 2024, BUT RESUMES WILL BE REVIEWED ON A ROLLING BASIS, AND INTERVIEWS WILL BE SCHEDULED WITH QUALIFIED APPLICANTS IN ACCORDANCE WITH THE APPLICATION DATE.\nTO APPLY, PLEASE EMAIL A RESUME, COVER LETTER, AND SALARY EXPECTATIONS. PLEASE SEND ALL APPLICATION MATERIALS, ALONG WITH QUESTIONS, VIA EMAIL TO:\nLAUREN SPROWLHR & OPERATIONS MANAGER",
    "job_skill_set": [
      "financial oversight",
      "budgeting",
      "financial analysis",
      "accounting",
      "HR management",
      "operations management",
      "reporting requirements",
      "data analysis",
      "financial statements preparation",
      "software systems adoption",
      "leadership",
      "interpersonal skills",
      "team management",
      "communication",
      "collaboration",
      "problem solving",
      "detail-oriented",
      "relationship building",
      "strategic planning",
      "QuickBooks",
      "policy development",
      "grant management",
      "equity and inclusion advocacy"
    ],
    "short_keywords": [
      "accounting",
      "adoption",
      "advocacy",
      "analysis",
      "and",
      "budgeting",
      "building",
      "collaboration",
      "communication",
      "data",
      "detailoriented",
      "development",
      "director",
      "equity",
      "finance",
      "financial",
      "grant",
      "hr",
      "inclusion",
      "interpersonal",
      "leadership",
      "management",
      "operations",
      "oversight",
      "planning",
      "policy",
      "preparation",
      "problem",
      "quickbooks",
      "relationship",
      "reporting",
      "requirements",
      "skills",
      "software",
      "solving",
      "statements",
      "strategic",
      "systems",
      "team"
    ]
  },
  {
    "job_id": "3904500508",
    "job_title": "Sr Finance Analyst",
    "category": "FINANCE",
    "job_description": "JOIN A TEAM RECOGNIZED FOR LEADERSHIP, INNOVATION AND DIVERSITY\n\nJOIN A TEAM RECOGNIZED FOR LEADERSHIP, INNOVATION AND DIVERSITY\n\nJOIN A TEAM RECOGNIZED FOR LEADERSHIP, INNOVATION AND DIVERSITY\n\nTHE FUTURE IS WHAT YOU MAKE IT.\n\nWHEN YOU JOIN HONEYWELL, YOU BECOME A MEMBER OF OUR GLOBAL TEAM OF THINKERS, INNOVATORS, DREAMERS AND DOERS WHO MAKE THE THINGS THAT MAKE THE FUTURE. THAT MEANS CHANGING THE WAY WE FLY, FUELING JETS IN AN ECO-FRIENDLY WAY, KEEPING BUILDINGS SMART AND SAFE AND EVEN MAKING IT POSSIBLE TO BREATHE ON MARS.\n\nWORKING AT HONEYWELL ISN’T JUST ABOUT DEVELOPING COOL THINGS. THAT’S WHY ALL OUR EMPLOYEES ENJOY ACCESS TO DYNAMIC CAREER OPPORTUNITIES ACROSS DIFFERENT FIELDS AND INDUSTRIES.\n\nARE YOU READY TO HELP US MAKE THE FUTURE?\n\nJOIN A TEAM OF INTEGRATED SUPPLY CHAIN TRANSFORMATION FINANCE PROFESSIONALS TO SUPPORT SIMPLIFICATION, STANDARDIZATION & PROCESS IMPROVEMENTS WITH ONE OF HONEYWELL’S IA BUSINESS. YOU WILL PLAY AN IMPORTANT PART IN ALIGNING FINANCIAL STRUCTURE, METRICS, ALIGNMENT OF PROCESSES TO GLOBAL AND LOCAL POLICIES WITH EFFICIENCY, SPEED, AND QUALITY. YOU WILL PLAY AN IMPORTANT ROLE IN MANAGING FINANCIAL PERFORMANCE AND IMPLEMENTING FINANCE STRATEGIES TO ACHIEVE COMMITTED BUSINESS PERFORMANCE THROUGH STANDARDIZED MOS & ANALYTICS YOU WILL SUPPORT HONEYWELL BUSINESS LEADERS AND SUPPORT TO DRIVE FINANCE INITIATIVES AND DECISIONS. YOU WILL ALSO PLAY IMPORTANT PART TO IDENTIFY TRENDS AND DEVELOPMENTS IN COMPETITIVE ENVIRONMENTS AND SUPPORT THE MANAGEMENT OUTCOME DECISIONS.\n\nKEY RESPONSIBILITIES\n\nDRIVING MOS FOR ALL KEY PROCESSESSTANDARDIZATION OF DATA, REPORTS AND UNDERLYING ANALYTICSDEFINE, DEVELOP, AND ENTHUSIASTICALLY DRIVE PROCESS IMPROVEMENTS AND DIGITIZATION TO REDUCE FINANCE BUSINESS PROCESS CYCLE TIMES, IMPROVE FINANCIAL FORECAST QUALITY AND RELIABILITY, IMPROVE THE INFORMATION PROVIDED TO LEADERSHIP FOR BUSINESS DECISIONSDRIVE CONTINUOUS IMPROVEMENTTRAVEL 25% TO NEBRASKA CITY\n\nYOU MUST HAVE\n\nBACHELOR’S DEGREE IN ACCOUNTING OR FINANCE.3 + YEARS OF EXPERIENCE IN ACCOUNTING OR FINANCE3+ YEARS OF COST ACCOUNTING EXPERIENCE\n\nWE VALUE\n\nSOME RELEVANT EXPERIENCE IN SIMILAR POSITIONS.MASTER’S DEGREE IN FINANCE OR CPA.ABILITY TO PRESENT COMPLEX ANALYSIS WITH CLARITY.ABILITY TO UNDERSTAND ACCOUNTING AND FINANCIAL PROCESSES RELATED TO THE BUSINESS.UNDERSTANDING ISC PROCESSESUNDERSTANDING OF SAP AND OTHER FINANCIAL TOOLSKNOWLEDGE OF US GAAP SARBES-OXLEY AND INTERNAL CONTROLS.GOOD ORAL AND WRITTEN COMMUNICATION.\n\nADDITIONAL INFORMATION\n\nJOB ID: HRD225145CATEGORY: FINANCELOCATION: 2101 CITYWEST BLVD,HOUSTON,TEXAS,77042,UNITED STATESEXEMPT\n\nGLOBAL (ALL)\n\nHONEYWELL IS AN EQUAL OPPORTUNITY EMPLOYER. QUALIFIED APPLICANTS WILL BE CONSIDERED WITHOUT REGARD TO AGE, RACE, CREED, COLOR, NATIONAL ORIGIN, ANCESTRY, MARITAL STATUS, AFFECTIONAL OR SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, DISABILITY, NATIONALITY, SEX, RELIGION, OR VETERAN STATUS.",
    "job_skill_set": [
      "accounting",
      "finance",
      "US GAAP",
      "internal controls",
      "data analysis",
      "financial forecasting",
      "process improvement",
      "financial metrics",
      "communication",
      "presentation skills",
      "teamwork",
      "problem solving",
      "analytical thinking",
      "adaptability",
      "cost accounting",
      "SAP",
      "SARBES-OXLEY"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "analysis",
      "analyst",
      "analytical",
      "communication",
      "controls",
      "cost",
      "data",
      "finance",
      "financial",
      "forecasting",
      "gaap",
      "improvement",
      "internal",
      "metrics",
      "presentation",
      "problem",
      "process",
      "sap",
      "sarbesoxley",
      "skills",
      "solving",
      "sr",
      "teamwork",
      "thinking",
      "us"
    ]
  },
  {
    "job_id": "3901948209",
    "job_title": "Finance and Building Administrator",
    "category": "FINANCE",
    "job_description": "THE SCHOOL OF HUMANITIES AND SCIENCES (H&S) IS THE FOUNDATION OF A LIBERAL ARTS EDUCATION AT STANFORD. THE SCHOOL ENCOMPASSES 23 DEPARTMENTS AND 25 INTERDISCIPLINARY PROGRAMS. H&S IS HOME TO FUNDAMENTAL AND APPLIED RESEARCH, WHERE FREE, OPEN, AND CRITICAL INQUIRY IS PURSUED ACROSS DISCIPLINES. AS THE UNIVERSITY’S LARGEST SCHOOL, H&S SERVES AS THE FOUNDATION OF A STANFORD UNDERGRADUATE EDUCATION NO MATTER WHICH DISCIPLINE STUDENTS PURSUE AS A MAJOR. GRADUATE STUDENTS WORK ALONGSIDE WORLD-RENOWNED FACULTY TO PURSUE AND SHAPE FOUNDATIONAL RESEARCH THAT LEADS TO BREAKTHROUGHS AND DISCOVERIES THAT SHED NEW LIGHT ON THE PAST, INFLUENCE THE PRESENT, AND SHAPE THE FUTURE. TOGETHER, FACULTY AND STUDENTS IN H&S ENGAGE IN INSPIRATIONAL TEACHING, LEARNING, AND RESEARCH EVERY DAY.\n\nDEPARTMENT/PROGRAM DESCRIPTION: THE DEPARTMENTS OF PHILOSOPHY AND RELIGIOUS STUDIES OPERATE AS TWO SEPARATE DEPARTMENTS, BUT ARE BOTH SUPPORTED BY THE SAME CORE STAFF. THE DEPARTMENT OF PHILOSOPHY EMBODIES A LIVELY COMMUNITY OF PHILOSOPHERS WITH A BROAD RANGE OF SCHOLARLY INTERESTS. THE DEPARTMENT OFFER RIGOROUS, COMPETITIVE PROGRAMS IN TRADITIONAL CORE AREAS OF PHILOSOPHY, AS WELL AS OPPORTUNITIES TO EXPLORE SOMETIMES-NEGLECTED SUBFIELDS LIKE FEMINIST PHILOSOPHY OR AESTHETICS. THE TRADITIONAL STRENGTHS IN LOGIC AND THE PHILOSOPHY OF SCIENCE REMAIN CENTRAL TO THE DEPARTMENT, AND THEY ARE NOW COMPLEMENTED BY VERY STRONG PROGRAMS IN ACTION THEORY, ETHICS AND POLITICAL PHILOSOPHY, LANGUAGE, MIND AND EPISTEMOLOGY, AND THE HISTORY OF PHILOSOPHY — ESPECIALLY ANCIENT PHILOSOPHY AND KANT STUDIES. THE DEPARTMENT OF RELIGIOUS STUDIES IS THE PRINCIPAL HUB AND FOCAL POINT AT STANFORD UNIVERSITY FOR THE ACADEMIC STUDY OF RELIGION, THAT IS, THE STUDY BOTH OF RELIGION IN GENERAL AS A HUMAN PHENOMENON AND OF SPECIFIC RELIGIOUS TRADITIONS, FROM A SCHOLARLY AND CRITICAL STANDPOINT, USING THE TOOLS AND METHODS OF VARIOUS DISCIPLINES IN THE HUMANITIES AND SOCIAL SCIENCES.\n\nPOSITION SUMMARY: THE DEPARTMENTS OF PHILOSOPHY AND RELIGIOUS STUDIES ARE SEEKING A FINANCE AND BUILDING ADMINISTRATOR TO PROVIDE OPERATIONAL AND ADMINISTRATIVE SUPPORT TO/FOR DEPARTMENT FACULTY, STAFF AND STUDENTS. THE POSITION REPORTS DIRECTLY TO THE ASSISTANT DIRECTOR OF FINANCE & OPERATIONS, AND SHOULD BE HIGHLY MOTIVATED, ENTHUSIASTIC, WELL-ORGANIZED, DETAIL-ORIENTED, AND ABLE TO WORK INDEPENDENTLY. THIS IS AN EXCITING AND INNOVATIVE OPPORTUNITY TO PARTICIPATE IN INITIATIVES TO SUPPORT DEPARTMENT PERSONNEL. THE FINANCE AND BUILDING ADMINISTRATOR MUST POSSESS AND DEMONSTRATE A POSITIVE OUTLOOK ON CONTINUOUS PROCESS IMPROVEMENT EFFORTS WHILE MAINTAINING A TEAM-BASED AND CUSTOMER-FOCUSED MINDSET. IT IS CRITICAL THAT THIS POSITION EXHIBIT THE ABILITIES TO PRACTICE SOUND JUDGMENT AND DECISION-MAKING, EFFECTIVE WRITTEN & ORAL COMMUNICATION, STRONG ATTENTION TO DETAIL AND RESPECTFUL RELATIONSHIP MANAGEMENT. THIS POSITION MUST ALSO EXHIBIT A STRONG DESIRE TO CONTINUOUSLY LEARN NEW AND UNFAMILIAR BUSINESS TOPICS, POLICIES AND PROCEDURES, AND THE ABILITY TO TRANSLATE THIS INFORMATION INTO OPERATIONAL SUCCESSES. THE IDEAL CANDIDATE IS A FRIENDLY, PROACTIVE AND DEPENDABLE SELF-STARTER WITH STRONG INTERPERSONAL AND COMMUNICATION SKILLS. THIS IS A BUSY POSITION AT TIMES REQUIRING A HIGH LEVEL OF PROFESSIONALISM, PRODUCTIVITY, ACCURACY, ORGANIZATION, MULTI-TASKING, INDEPENDENCE, SOUND JUDGMENT, AND DECISION-MAKING. THE POSITION REQUIRES A MOTIVATED PERSON WITH A POSITIVE ATTITUDE AND A PASSION FOR CUSTOMER SERVICE AND SUPPORTING OTHERS TO MANAGE A WIDE VARIETY OF TASKS IN A FAST-PACED ACADEMIC ENVIRONMENT WITH FREQUENTLY SHIFTING PRIORITIES.\n\nTHIS IS A 100% FTE, CONTINUING, NON-EXEMPT POSITION. THIS POSITION WILL BE BASED ON THE STANFORD CAMPUS AND WILL BE CONSIDERED FOR AN OPTION OF TELECOMMUTING (HYBRID OF WORKING ON-SITE AND OFF-SITE), SUBJECT TO OPERATIONAL NEED.\n\nIF YOU BELIEVE THAT THIS OPPORTUNITY IS A MATCH FOR YOUR KNOWLEDGE, SKILLS AND ABILITIES, WE ENCOURAGE YOU TO APPLY. THANK YOU FOR CONSIDERING EMPLOYMENT OPPORTUNITIES WITH THE SCHOOL OF HUMANITIES AND SCIENCES.\n\nTO BE CONSIDERED, PLEASE SUBMIT A COVER LETTER AND RESUME ALONG WITH YOUR ONLINE APPLICATION. YOUR ONE-PAGE COVER LETTER SHOULD BRIEFLY DESCRIBE YOUR BACKGROUND IN CUSTOMER SERVICE AND PROVIDE EXAMPLES OF YOUR EXPERIENCE WITH ATTENTION TO DETAIL, RESPONSIVENESS, AND DECISION-MAKING.\n\nCORE DUTIES\n\nACT ON BEHALF OF THE SUPERVISOR, DEPARTMENT MANAGER, OR CHAIR IN REGARD TO ESTABLISHING PRIORITIES AND IDENTIFYING AND RESOLVING PROBLEMS THAT ARE ADMINISTRATIVE IN NATURE. OVERSEE AND/OR PROCESS A VARIETY OF COMPLEX FINANCIAL TRANSACTIONS; PRODUCE, MONITOR, AND RECONCILE BUDGET STATEMENTS; RESEARCH, IDENTIFY, AND RESOLVE DISCREPANCIES. MAY ASSIST WITH CAPITAL OR SPECIAL EQUIPMENT REQUESTS AND/OR VENDOR SELECTION. COORDINATE AND MONITOR ROUTINE MAINTENANCE SERVICES COMPLETION. PLAN AND COORDINATE OFFICE MOVES, OFFICE ASSIGNMENTS, AND/OR MINOR RENOVATION PROJECTS.  MANAGE FACILITIES PROJECTS, INCLUDING BUILDING SAFETY, DOOR SECURITY, EMERGENCY PROCEDURES, AND ZERO WASTE MANAGEMENT OVERSIGHT. WORK CLOSELY WITH LSRE TO ENSURE COMPLIANCE WITH UNIVERSITY POLICY AND SAFETY PROTOCOLS. CREATE COMPLEX REPORTS AND SPREADSHEETS WHICH MAY UTILIZE SPECIALIZED SOFTWARE AND SYSTEMS. ARRANGE WITH VENDORS FOR SERVICES, OVERSEEING THE PRODUCTION AND DISTRIBUTION OF MATERIALS, ADMINISTERING LOGISTICS, AND MANAGING EVENTS WITHIN BUDGET. CREATE, MAINTAIN, MODIFY, AND/OR ENSURE ACCURACY OF CONTENT IN VARIOUS UNIT DOCUMENTS, DISPLAYS, REPORTS, BROCHURES, SOCIAL MEDIA, AND/OR WEBSITES. PLAN AND SCHEDULE CALENDAR(S) WITH LIMITED CONSULTATION, RESOLVE CALENDARING CONFLICTS, AND ARRANGE TRAVEL IN COMPLIANCE WITH UNIT, UNIVERSITY, AND SPONSOR POLICIES. MAY LEAD STAFF OR SUPERVISE DAY-TO-DAY WORK OF STUDENT AND/OR TEMPORARY WORKERS, INCLUDING SCHEDULING, ASSIGNING, AND PRIORITIZING WORKLOADS, SETTING APPROPRIATE DEADLINES, REVIEWING WORK FOR QUALITY AND TIMELINESS, AND PROVIDING PERFORMANCE REVIEW INPUT.  OTHER DUTIES MAY ALSO BE ASSIGNED.\n\n\nEDUCATION AND EXPERIENCE\n\nHIGH SCHOOL DIPLOMA AND FOUR YEARS OF ADMINISTRATIVE EXPERIENCE, OR COMBINATION OF EDUCATION AND RELEVANT EXPERIENCE. \n\n\nKNOWLEDGE, SKILLS, AND ABILITIES\n\nADVANCED COMPUTER SKILLS AND DEMONSTRATED EXPERIENCE WITH OFFICE SOFTWARE AND EMAIL APPLICATIONS. DEMONSTRATED SUCCESS IN FOLLOWING THROUGH AND COMPLETING PROJECTS. EXCELLENT ORGANIZATIONAL SKILLS AND ATTENTION TO DETAIL. STRONG VERBAL AND WRITTEN COMMUNICATION SKILLS. EXCELLENT CUSTOMER SERVICE AND INTERPERSONAL SKILLS. ABILITY TO PRIORITIZE, MULTI-TASK, AND ASSIGN WORK TO OTHERS. ABILITY TO TAKE INITIATIVE AND OWNERSHIP OF PROJECTS. ABILITY TO ROUTINELY AND INDEPENDENTLY EXERCISE SOUND JUDGMENT IN MAKING DECISIONS. \n\n\nIN ADDITION, PREFERRED REQUIREMENTS INCLUDE\n\nEXPERIENCE WITH STANFORD FINANCIAL SYSTEMS HIGHLY DESIRED. \n\n\nTHE EXPECTED PAY RANGE FOR THIS POSITION IS $33.17 TO $43.75 PER HOUR.\n\nSTANFORD UNIVERSITY PROVIDES PAY RANGES REPRESENTING ITS GOOD FAITH ESTIMATE OF WHAT THE UNIVERSITY REASONABLY EXPECTS TO PAY FOR A POSITION. THE PAY OFFERED TO A SELECTED CANDIDATE WILL BE DETERMINED BASED ON FACTORS SUCH AS (BUT NOT LIMITED TO) THE SCOPE AND RESPONSIBILITIES OF THE POSITION, THE QUALIFICATIONS OF THE SELECTED CANDIDATE, DEPARTMENTAL BUDGET AVAILABILITY, INTERNAL EQUITY, GEOGRAPHIC LOCATION AND EXTERNAL MARKET PAY FOR COMPARABLE JOBS.\n\nAT STANFORD UNIVERSITY, BASE PAY REPRESENTS ONLY ONE ASPECT OF THE COMPREHENSIVE REWARDS PACKAGE. THE CARDINAL AT WORK WEBSITE (HTTPS://CARDINALATWORK.STANFORD.EDU/BENEFITS-REWARDS) PROVIDES DETAILED INFORMATION ON STANFORD’S EXTENSIVE RANGE OF BENEFITS AND REWARDS OFFERED TO EMPLOYEES. SPECIFICS ABOUT THE REWARDS PACKAGE FOR THIS POSITION MAY BE DISCUSSED DURING THE HIRING PROCESS.\n\nWHY STANFORD IS FOR YOU\n\nIMAGINE A WORLD WITHOUT SEARCH ENGINES OR SOCIAL PLATFORMS. CONSIDER LIVES SAVED THROUGH FIRST-EVER ORGAN TRANSPLANTS AND RESEARCH TO CURE ILLNESSES. STANFORD UNIVERSITY HAS REVOLUTIONIZED THE WAY WE LIVE AND ENRICH THE WORLD. SUPPORTING THIS MISSION IS OUR DIVERSE AND DEDICATED 17,000 STAFF. WE SEEK TALENT DRIVEN TO IMPACT THE FUTURE OF OUR LEGACY. OUR CULTURE AND UNIQUE PERKS EMPOWER YOU WITH\n\nFREEDOM TO GROW. WE OFFER CAREER DEVELOPMENT PROGRAMS, TUITION REIMBURSEMENT, OR AUDIT A COURSE. JOIN A TEDTALK, FILM SCREENING, OR LISTEN TO A RENOWNED AUTHOR OR GLOBAL LEADER SPEAK.A CARING CULTURE. WE PROVIDE SUPERB RETIREMENT PLANS, GENEROUS TIME-OFF, AND FAMILY CARE RESOURCES.A HEALTHIER YOU. CLIMB OUR ROCK WALL, OR CHOOSE FROM HUNDREDS OF HEALTH OR FITNESS CLASSES AT OUR WORLD-CLASS EXERCISE FACILITIES. WE ALSO PROVIDE EXCELLENT HEALTH CARE BENEFITS.DISCOVERY AND FUN. STROLL THROUGH HISTORIC SCULPTURES, TRAILS, AND MUSEUMS.ENVIABLE RESOURCES. ENJOY FREE COMMUTER PROGRAMS, RIDESHARING INCENTIVES, DISCOUNTS AND MORE\n\n\nTHE JOB DUTIES LISTED ARE TYPICAL EXAMPLES OF WORK PERFORMED BY POSITIONS IN THIS JOB CLASSIFICATIONS AND ARE NOT DESIGNED TO CONTAIN OR BE INTERPRETED AS A COMPREHENSIVE INVENTORY OF ALL DUTIES, TASKS AND RESPONSIBILITIES. SPECIFIC DUTIES AND RESPONSIBILITIES MAY VARY DEPENDING ON DEPARTMENT OR PROGRAM NEEDS WITHOUT CHANGING THE GENERAL NATURE AND SCOPE OF THE JOB OR LEVEL OF RESPONSIBILITY. EMPLOYEES MAY ALSO PERFORM OTHER DUTIES AS ASSIGNED. \n\nCONSISTENT WITH ITS OBLIGATIONS UNDER THE LAW, THE UNIVERSITY WILL PROVIDE REASONABLE ACCOMMODATIONS TO APPLICANTS AND EMPLOYEES WITH DISABILITIES. APPLICANTS  REQUIRING A REASONABLE ACCOMMODATION FOR ANY PART OF THE APPLICATION OR HIRING PROCESS SHOULD CONTACT STANFORD UNIVERSITY HUMAN RESOURCES AT STANFORDELR@STANFORD.EDU. FOR ALL OTHER INQUIRIES, PLEASE SUBMIT A CONTACT FORM.\n\nSTANFORD IS AN EQUAL EMPLOYMENT OPPORTUNITY AND AFFIRMATIVE ACTION EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, PROTECTED VETERAN STATUS, OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW.",
    "job_skill_set": [
      "financial transactions",
      "advanced computer skills",
      "office software proficiency",
      "report creation",
      "data analysis",
      "project management",
      "vendor management",
      "communication",
      "customer service",
      "attention to detail",
      "organizational skills",
      "problem solving",
      "teamwork",
      "independence",
      "initiative",
      "decision-making",
      "interpersonal skills",
      "budget management",
      "facilities management",
      "Stanford financial systems"
    ],
    "short_keywords": [
      "administrator",
      "advanced",
      "analysis",
      "and",
      "attention",
      "budget",
      "building",
      "communication",
      "computer",
      "creation",
      "customer",
      "data",
      "decisionmaking",
      "detail",
      "facilities",
      "finance",
      "financial",
      "independence",
      "initiative",
      "interpersonal",
      "management",
      "office",
      "organizational",
      "problem",
      "proficiency",
      "project",
      "report",
      "service",
      "skills",
      "software",
      "solving",
      "stanford",
      "systems",
      "teamwork",
      "to",
      "transactions",
      "vendor"
    ]
  },
  {
    "job_id": "3902357065",
    "job_title": "SAP CFIN Consultant - Central Finance",
    "category": "FINANCE",
    "job_description": "PROFICIENT IN BELOW CFIN AREAS - MATERIAL MASTER AND ASSOCIATED OBJECTS SUCH AS UOM, MATERIAL TYPE, VALUATION CLASS - I/C CUSTOMER AND VENDOR MANAGEMENT WE REQUIRE THE RESOURCE TO DESIGN AND DRIVE THE DISCUSSION TO A POINT WHERE OUR TEAM CAN PICK UP FOR BUILD. 2) PROFICIENT IN OVERALL G/L AREAS (CONFIGURATION AND TESTING).",
    "job_skill_set": [
      "Design",
      "Discussion Facilitation",
      "Team Collaboration",
      "SAP CFIN",
      "Material Master",
      "UOM",
      "Material Type",
      "Valuation Class",
      "Customer Management",
      "Vendor Management",
      "G/L Configuration",
      "G/L Testing"
    ],
    "short_keywords": [
      "central",
      "cfin",
      "class",
      "collaboration",
      "configuration",
      "consultant",
      "customer",
      "design",
      "discussion",
      "facilitation",
      "finance",
      "gl",
      "management",
      "master",
      "material",
      "sap",
      "team",
      "testing",
      "type",
      "uom",
      "valuation",
      "vendor"
    ]
  },
  {
    "job_id": "3902693086",
    "job_title": "Assistant Professor of Finance",
    "category": "FINANCE",
    "job_description": "RHODE ISLAND COLLEGE INVITES APPLICANTS FOR THE POSITION OF ASSISTANT PROFESSOR OF FINANCE. THIS IS A CONTINUING TENURE-TRACK, ACADEMIC YEAR, FULL-TIME POSITION. THE POSITION IS OPEN UNTIL FILLED. THE SEARCH COMMITTEE WILL BEGIN REVIEWING APPLICATIONS ON APRIL 22, 2024 AND PRIORITY WILL BE GIVEN TO APPLICATIONS SUBMITTED BY THAT DATE. FIRST-ROUND INTERVIEWS WILL BE CONDUCTED ON ZOOM DURING THE LAST WEEK OF APRIL 2024. WE EXPECT CAMPUS INTERVIEWS TO TAKE PLACE IN MAY, AND AN OFFER OUT NO LATER THAN JUNE 15, 2024.\nTHE DEPARTMENT OF ECONOMICS AND FINANCE IS HOUSED IN THE SCHOOL OF BUSINESS WITH THE DEPARTMENTS OF ACCOUNTING, COMPUTER INFORMATION SYSTEMS, AND MANAGEMENT AND MARKETING. THE DEPARTMENT HAS APPROXIMATELY 150 MAJORS, SERVED BY SIX FULL-TIME FACULTY MEMBERS, AND OFFERS AROUND 50 COURSE SECTIONS PER YEAR. CLASS SIZE IS LIMITED TO A MAXIMUM OF 30 STUDENTS. ABOUT 1,000 STUDENTS MAJOR IN THE SCHOOL OF BUSINESS PROGRAMS. THE PROGRAMS OFFERED BY THE DEPARTMENT OF ECONOMICS AND FINANCE INCLUDE MAJORS IN ECONOMICS AND FINANCE, AND MINORS IN ECONOMICS, FINANCE, AND INTERNATIONAL BUSINESS. THE DEPARTMENT IS A BLOOMBERG EXPERIENTIAL LEARNING PARTNER (ELP) AND THE FINANCE LAB HOUSES 15 BLOOMBERG TERMINALS. THE BS IN FINANCE DEGREE HAS THE CFA INSTITUTE UNIVERSITY AFFILIATION PROGRAM DESIGNATION AND THE CFA INSTITUTE LEVEL I EXAM CURRICULUM IS EMBEDDED IN SEVERAL OF THE FINANCE COURSES.\nRHODE ISLAND COLLEGE (RIC) IS A REGIONAL COMPREHENSIVE PUBLIC COLLEGE THAT SERVES APPROXIMATELY 5,000 STUDENTS THROUGH ITS FIVE SCHOOLS: FACULTY OF ARTS AND SCIENCES, SCHOOL OF EDUCATION AND HUMAN DEVELOPMENT, SCHOOL OF BUSINESS, SCHOOL OF NURSING, AND SCHOOL OF SOCIAL WORK. ESTABLISHED IN 1854, RIC IS RHODE ISLAND’S FIRST PUBLIC INSTITUTION OF HIGHER EDUCATION. THE COLLEGE IS LOCATED ON A BEAUTIFUL 180-ACRE SUBURBAN CAMPUS IN THE VIBRANT CITY OF PROVIDENCE, RHODE ISLAND’S CAPITAL, WITH EXCELLENT PROXIMITY TO THE ACADEMIC AND CULTURAL RESOURCES OF BOSTON AND NEW YORK CITY. \nTHE COLLEGE BOASTS ENGAGED FACULTY, HIGH-QUALITY ACADEMIC PROGRAMS, SMALL CLASS SIZES, PERSONALIZED, HANDS-ON LEARNING EXPERIENCES, AND HIGH VALUE-TO-TUITION COMPARED TO OTHER FOUR-YEAR INSTITUTIONS. COMMITTED TO PROMOTING DIVERSITY, EQUITY, AND INCLUSION AND PROVIDING A SAFE AND INCLUSIVE CAMPUS ENVIRONMENT FOR ALL STUDENTS, THE COLLEGE IS PROUD TO BE A HISPANIC-SERVING INSTITUTION (HSI). WITH FIRST-GENERATION STUDENTS MAKING UP ABOUT HALF ITS STUDENT BODY, RIC IS DEDICATED TO PROVIDING STUDENTS WITH A WELL-ROUNDED COLLEGE EXPERIENCE TO FACILITATE UPWARD MOBILITY AND CAREER GROWTH. THE COLLEGE OFFERS AN ACTIVE CAMPUS LIFE, INCLUDING CLUBS AND ORGANIZATIONS, ATHLETICS, CULTURAL EVENTS, AND COMMUNITY SERVICE OPPORTUNITIES. \nRESPONSIBILITIESTEACHING UNDERGRADUATE FINANCE COURSES,CONDUCTING AND PUBLISHING RESEARCH IN FINANCE,INVOLVEMENT IN ACTIVITIES THAT PROMOTE STUDENT DEVELOPMENT AND GROWTH, INCLUDING ADVISING AND WORKING WITH STUDENT TEAMS/ORGANIZATIONS,PROVIDING SERVICE TO THE DEPARTMENT, COLLEGE, AND COMMUNITY,PERFORMING OTHER DUTIES AND RESPONSIBILITIES AS ASSIGNED BY THE CHAIR OF THE ECONOMICS AND FINANCE DEPARTMENT.\nQUALIFICATIONSCANDIDATES MUST HAVE A PH.D. (OR DBA) IN FINANCE OR A PH.D. IN A RELATED FIELD ACCOMPANIED WITH AN EARNED CFA CHARTER. ABD WITH COMPLETION EXPECTED BY JUNE 2024 WILL BE CONSIDERED; HOWEVER, A DOCTORAL DEGREE IS REQUIRED FOR ALL TENURE-TRACK APPOINTMENTS AND MUST BE COMPLETED PRIOR TO THE BEGINNING OF SERVICE.\nCOLLEGE LEVEL TEACHING EXPERIENCE IN FINANCE, COMMITMENT TO TEACHING EXCELLENCE, AND DEMONSTRATED POTENTIAL FOR SCHOLARLY RESEARCH ARE REQUIRED. THE SUCCESSFUL CANDIDATE IS EXPECTED TO SERVE ACTIVELY WITHIN THE DEPARTMENT AND THE COLLEGE. THIS SERVICE WILL INCLUDE ADVISING FINANCE MAJORS AND MINORS, AND EXCELLENCE IN ADVISING AND MENTORING STUDENTS IS HIGHLY SOUGHT. CANDIDATES FROM ALL AREAS OF FINANCE ARE WELCOME TO APPLY.",
    "job_skill_set": [
      "Ph.D. in Finance",
      "CFA Charter",
      "College Level Teaching Experience",
      "Research in Finance",
      "Advising Students",
      "Curriculum Development",
      "Teaching Excellence",
      "Student Development",
      "Mentoring",
      "Collaboration",
      "Communication",
      "Diversity and Inclusion"
    ],
    "short_keywords": [
      "advising",
      "and",
      "assistant",
      "cfa",
      "charter",
      "collaboration",
      "college",
      "communication",
      "curriculum",
      "development",
      "diversity",
      "excellence",
      "experience",
      "finance",
      "in",
      "inclusion",
      "level",
      "mentoring",
      "of",
      "phd",
      "professor",
      "research",
      "student",
      "students",
      "teaching"
    ]
  },
  {
    "job_id": "3886203882",
    "job_title": "Finance Specialist",
    "category": "FINANCE",
    "job_description": "COMPANY DESCRIPTION\n \n\n\n ROLE DESCRIPTION\n \nTHIS IS A TEMPORARY REMOTE ROLE FOR A FINANCE SPECIALIST. THE FINANCE SPECIALIST WILL BE RESPONSIBLE FOR CONDUCTING FINANCIAL ANALYSIS AND DEVELOPING FINANCIAL REPORTS, CREATING AND MAINTAINING FINANCIAL MODELS, MANAGING ACCOUNTS PAYABLE AND RECEIVABLE, AND HANDLING INTERNAL AND EXTERNAL FINANCIAL INQUIRIES. THE ROLE WILL ALSO INVOLVE COLLABORATING WITH TEAM MEMBERS TO ENSURE THE ACCURACY AND COMPLETENESS OF FINANCIAL DATA AND SUPPORTING SPECIAL PROJECTS AS NEEDED.\n\n QUALIFICATIONS\n \nSTRONG ANALYTICAL SKILLS AND PROFICIENCY IN FINANCEEXPERIENCE IN CREATING AND ANALYZING FINANCIAL STATEMENTSEXCELLENT COMMUNICATION SKILLS TO HANDLE INTERNAL AND EXTERNAL FINANCIAL INQUIRIESEXPERTISE IN ACCOUNTING PRINCIPLES AND PRACTICESHIGH ATTENTION TO DETAIL AND ACCURACYABILITY TO WORK INDEPENDENTLY AND REMOTELYEXPERIENCE IN MANAGING ACCOUNTS PAYABLE AND RECEIVABLEBACHELOR'S DEGREE IN FINANCE, ACCOUNTING, ECONOMICS OR RELATED FIELD\n\n \nRELEVANT SKILLS AND QUALIFICATION THAT WOULD BE BENEFICIAL INCLUDE EXPERIENCE WITH FINANCIAL ANALYSIS SOFTWARE, PROFICIENCY IN MICROSOFT EXCEL, KNOWLEDGE OF TAX REGULATIONS, AND A CPA CERTIFICATION.",
    "job_skill_set": [
      "financial analysis",
      "financial reporting",
      "accounts payable",
      "accounts receivable",
      "accounting principles",
      "Microsoft Excel",
      "tax regulations",
      "analytical skills",
      "communication",
      "attention to detail",
      "independence",
      "collaboration",
      "financial modeling",
      "financial analysis software",
      "CPA certification"
    ],
    "short_keywords": [
      "accounting",
      "accounts",
      "analysis",
      "analytical",
      "attention",
      "certification",
      "collaboration",
      "communication",
      "cpa",
      "detail",
      "excel",
      "finance",
      "financial",
      "independence",
      "microsoft",
      "modeling",
      "payable",
      "principles",
      "receivable",
      "regulations",
      "reporting",
      "skills",
      "software",
      "specialist",
      "tax",
      "to"
    ]
  },
  {
    "job_id": "3904992088",
    "job_title": "Finance Manager",
    "category": "FINANCE",
    "job_description": "IF YOU NEED ASSISTANCE DURING THE RECRUITING PROCESS DUE TO A DISABILITY, PLEASE REACH OUT TO OUR RECRUITING ACCOMMODATIONS TEAM THROUGH THE ACCOMMODATION REQUEST FORM. THIS FORM IS USED ONLY BY INDIVIDUALS WITH DISABILITIES WHO REQUIRE ASSISTANCE OR ADJUSTMENTS IN APPLYING AND INTERVIEWING FOR A JOB. THIS FORM IS NOT FOR INQUIRING ABOUT A POSITION OR THE STATUS OF AN APPLICATION.\n\nARE YOU LOOKING TO JOIN ONE OF THE LEADING ONLINE TRAVEL COMPANIES IN THE WORLD? EXPEDIA GROUP BELIEVES TRAVEL IS A FORCE FOR GOOD. WHEN WE POWER MORE TRAVEL, WE UNLEASH MORE OPPORTUNITIES TO STRENGTHEN CONNECTIONS, BROADEN HORIZONS AND BRIDGE DIVIDES. COME JOIN OUR MISSION TO POWER GLOBAL TRAVEL FOR EVERYONE, EVERYWHERE.\n\nCOLLECTIVELY, OUR BRANDS COVER VIRTUALLY EVERY ASPECT OF RESEARCHING, PLANNING, AND BOOKING TRAVEL, FROM CHOOSING THE BEST AIRPLANE SEAT, TO READING PERSONAL TRAVEL REVIEWS OF HOTELS, TO PLANNING WHAT TO DO IN A DESTINATION ONCE YOU ARRIVE. THE EXPEDIA GROUP SERVES BOTH LEISURE AND BUSINESS TRAVELERS WITH TASTES AND BUDGETS RANGING FROM MODEST TO LUXURY. EXPEDIA GROUP DELIVERS CONSUMER TRAVEL DEMAND GLOBALLY TO THOUSANDS OF HOTELS AND VACATION RENTALS, HUNDREDS OF AIRLINES, THOUSANDS OF ACTIVITIES, AND DOZENS OF CAR RENTAL COMPANIES AND CRUISE LINES.\n\nWE ARE LOOKING FOR A HIGHLY MOTIVATED FINANCE MANAGER TO JOIN THE EXPEDIA GROUP FINANCE TEAM. IN THIS ROLE YOU WILL PROVIDE FINANCIAL MANAGEMENT SUPPORT AND PARTNER WITH LEADERS THROUGHOUT EG. YOU WILL BE A CATALYST IN INFLUENCING THE STRATEGIC DECISIONS ACROSS THE BUSINESS. WE WILL NURTURE YOUR COLLABORATIVE APPROACH AND WILL WELCOME YOUR WAY OF THINKING. WE VALUE WORKING WITH GLOBALLY DIVERSE TEAMS TO BREAK DOWN OBSTACLES, BE INNOVATIVE AND ENSURE THE FINANCIAL SUCCESS OF THE BUSINESS AND HAPPINESS OF OUR TRAVELERS!\n\nWHAT YOU WILL DO\n\nPARTNER ACROSS EG TO DEVELOP A DEEP UNDERSTANDING OF BUSINESS LEVERS AND FIND OPPORTUNITIES TO DRIVE VALUE INTO THE ORGANIZATION.DISTILL COMPLEX FINANCIAL DATA INTO IMPACTFUL INSIGHTS; BUILD FINANCIAL MODELS, ANALYZE LATEST TRENDS AND INITIATIVES, AND PERFORM AD-HOC MODELING AS REQUIRED.DRIVE PROCESS IMPROVEMENT THROUGH EFFECTIVE BUSINESS PARTNERING ACROSS THE ORGANIZATION.IN-DEPTH ANALYSIS AND BENCHMARKING OF OUR PORTFOLIO OF BRANDS, THE PRODUCTS WE SELL, AND THE MARKETING CHANNELS CUSTOMERS ENGAGE IN AS WELL AS THE EXTERNAL COMPETITIVE LANDSCAPE.RESPONSIBLE FOR FORECAST/OUTLOOK FOR A SPECIFIC BRAND(S) OR EG-WIDE, INCLUDING IDENTIFYING AND ANALYZING RISKS AND OPPORTUNITIES.SUPPORT MBRS, QBRS, BOARD OF DIRECTORS PRESENTATIONS, AND IR/EARNING PREPARATION.LEAD A VARIETY OF PROJECTS TO SIMPLIFY AND AUTOMATE CURRENT PROCESSES\n\nWHO YOU ARE\n\nELEVATED LEVEL OF INTELLECTUAL CURIOSITY THAT DRIVES SENSE OF OWNERSHIP AND DESIRE FOR CONTINUOUS IMPROVEMENT.EXCELLENT INTERPERSONAL SKILLS AND DEMONSTRATED ABILITY TO WORK WITH ALL LEVELS OF MANAGEMENT.ADVANCED ANALYTIC, MODELING, FORECASTING, AND PRESENTATION SKILLS.RESULTS DRIVEN AND HIGHLY MOTIVATED, WITH THE ABILITY TO THINK BIG AND SMALL.ABLE TO LEAD AND INFLUENCE DECISIONS ACROSS VARIOUS INTERNAL FUNCTIONS.COMFORTABLE WORKING WITH AMBIGUITY IN A DYNAMIC, FAST-PACED ENVIRONMENT.HIGHLY PROFICIENT WITH EXCEL AND POWERPOINT. EXPERIENCE WITH ORACLE AND HYPERION.6+ YEARS OF RELEVANT PROFESSIONAL EXPERIENCE.\n\nTHE TOTAL CASH RANGE FOR THIS POSITION IN SEATTLE IS $110,500.00 TO $155,000.00. EMPLOYEES IN THIS ROLE HAVE THE POTENTIAL TO INCREASE THEIR PAY UP TO $177,000.00, WHICH IS THE TOP OF THE RANGE, BASED ON ONGOING, DEMONSTRATED, AND SUSTAINED PERFORMANCE IN THE ROLE.\n\nSTARTING PAY FOR THIS ROLE WILL VARY BASED ON MULTIPLE FACTORS, INCLUDING LOCATION, AVAILABLE BUDGET, AND AN INDIVIDUAL’S KNOWLEDGE, SKILLS, AND EXPERIENCE. PAY RANGES MAY BE MODIFIED IN THE FUTURE.\n\nEXPEDIA GROUP IS PROUD TO OFFER A WIDE RANGE OF BENEFITS TO SUPPORT EMPLOYEES AND THEIR FAMILIES, INCLUDING MEDICAL/DENTAL/VISION, PAID TIME OFF, AND AN EMPLOYEE ASSISTANCE PROGRAM. TO FUEL EACH EMPLOYEE’S PASSION FOR TRAVEL, WE OFFER A WELLNESS & TRAVEL REIMBURSEMENT, TRAVEL DISCOUNTS, AND AN INTERNATIONAL AIRLINES TRAVEL AGENT (IATAN) MEMBERSHIP.VIEW OUR FULL LIST OF BENEFITS.\n\nABOUT EXPEDIA GROUP\n\nEXPEDIA GROUP (NASDAQ: EXPE) POWERS TRAVEL FOR EVERYONE, EVERYWHERE THROUGH OUR GLOBAL PLATFORM. DRIVEN BY THE CORE BELIEF THAT TRAVEL IS A FORCE FOR GOOD, WE HELP PEOPLE EXPERIENCE THE WORLD IN NEW WAYS AND BUILD LASTING CONNECTIONS. WE PROVIDE INDUSTRY-LEADING TECHNOLOGY SOLUTIONS TO FUEL PARTNER GROWTH AND SUCCESS, WHILE FACILITATING MEMORABLE EXPERIENCES FOR TRAVELERS. EXPEDIA GROUP'S FAMILY OF BRANDS INCLUDES: BRAND EXPEDIA®, HOTELS.COM®, EXPEDIA® PARTNER SOLUTIONS, VRBO®, TRIVAGO®, ORBITZ®, TRAVELOCITY®, HOTWIRE®, WOTIF®, EBOOKERS®, CHEAPTICKETS®, EXPEDIA GROUP™ MEDIA SOLUTIONS, EXPEDIA LOCAL EXPERT®, CARRENTALS.COM™, AND EXPEDIA CRUISES™.\n\n© 2021 EXPEDIA, INC. ALL RIGHTS RESERVED. TRADEMARKS AND LOGOS ARE THE PROPERTY OF THEIR RESPECTIVE OWNERS. CST: 2029030-50\n\nEMPLOYMENT OPPORTUNITIES AND JOB OFFERS AT EXPEDIA GROUP WILL ALWAYS COME FROM EXPEDIA GROUP’S TALENT ACQUISITION AND HIRING TEAMS. NEVER PROVIDE SENSITIVE, PERSONAL INFORMATION TO SOMEONE UNLESS YOU’RE CONFIDENT WHO THE RECIPIENT IS. EXPEDIA GROUP DOES NOT EXTEND JOB OFFERS VIA EMAIL OR ANY OTHER MESSAGING TOOLS TO INDIVIDUALS TO WHOM WE HAVE NOT MADE PRIOR CONTACT. OUR EMAIL DOMAIN IS @EXPEDIAGROUP.COM. THE OFFICIAL WEBSITE TO FIND AND APPLY FOR JOB OPENINGS AT EXPEDIA GROUP IS CAREERS.EXPEDIAGROUP.COM/JOBS.\n\nEXPEDIA IS COMMITTED TO CREATING AN INCLUSIVE WORK ENVIRONMENT WITH A DIVERSE WORKFORCE. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, GENDER, GENDER IDENTITY OR EXPRESSION, SEXUAL ORIENTATION, NATIONAL ORIGIN, GENETICS, DISABILITY, AGE, OR VETERAN STATUS. THIS EMPLOYER PARTICIPATES IN E-VERIFY. THE EMPLOYER WILL PROVIDE THE SOCIAL SECURITY ADMINISTRATION (SSA) AND, IF NECESSARY, THE DEPARTMENT OF HOMELAND SECURITY (DHS) WITH INFORMATION FROM EACH NEW EMPLOYEE'S I-9 TO CONFIRM WORK AUTHORIZATION.",
    "job_skill_set": [
      "financial management",
      "financial modeling",
      "data analysis",
      "forecasting",
      "Excel",
      "PowerPoint",
      "Oracle",
      "Hyperion",
      "interpersonal skills",
      "collaboration",
      "problem solving",
      "adaptability",
      "leadership",
      "communication",
      "intellectual curiosity",
      "results-driven"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "collaboration",
      "communication",
      "curiosity",
      "data",
      "excel",
      "finance",
      "financial",
      "forecasting",
      "hyperion",
      "intellectual",
      "interpersonal",
      "leadership",
      "management",
      "manager",
      "modeling",
      "oracle",
      "powerpoint",
      "problem",
      "resultsdriven",
      "skills",
      "solving"
    ]
  },
  {
    "job_id": "3901347353",
    "job_title": "Director/VP Project Finance ",
    "category": "FINANCE",
    "job_description": "THE GREEN RECRUITMENT COMPANY IS DELIGHTED TO PARTNER WITH A LEADING SOLAR IPP IN THEIR SEARCH FOR A DIRECTOR OR VP OF PROJECT FINANCE TO LEAD THEIR EXECUTION OF THEIR PROJECT FINANCING STRATEGIES. REPORTING DIRECTLY TO THE C-SUITE TEAM, OUR CLIENT IS LOOKING FOR A CANDIDATE WITH EXPERIENCE LEADING AND EXECUTING COMPLEX PROJECT FINANCE TRANSACTIONS, INCLUDING BOTH DEBT AND TAX EQUITY. WITH IMPRESSIVE CAPITAL BACKING AND A GROWING PIPELINE OF DISTRIBUTED GENERATION PROJECTS ACROSS THE US, IT'S A FANTASTIC TIME TO JOIN. \n\n\nRESPONSIBILITIES: LEAD BOTH DEBT AND TAX EQUITY TRANSACTIONS - COORDINATE DUE DILIGENCE, DOCUMENTATION, EXECUTION TO CLOSEMAINTAIN AND BUILD RELATIONSHIPS WITH THIRD-PARTY CONSULTANTS, LAWYERS, OUTSIDE EXPERTS RELATED TO TAX EQUITY AND DEBT FINANCINGS.IDENTIFY NEW FINANCING STRATEGIES AND OPPORTUNITIES.SOLICIT AND REVIEW PROSPECTIVE TERM SHEETS FROM TAX EQUITY INVESTORS AND LENDERS, PROPOSE SOLUTIONS TO SENIOR MANAGEMENT.REVIEW AND DESIGN FINANCIAL MODELS, ENSURING INPUTS ARE CONSISTENT WITH INTERNAL VIEWS AND VALIDATED BY THIRD-PARTY CONSULTANTS\n\n\nQUALIFICATIONS:BACHELOR’S DEGREE IN FINANCE OR ACCOUNTING REQUIRED, MASTERS IN BUSINESS OR ACCOUNTING PREFERRED4+ YEARS OF RENEWABLES EXPERIENCE, WITH A SUCCESSFUL TRACK RECORD IN PROJECT FINANCE (DEBT AND TAX EQUITY), WITH AN EMPHASIS ON LEADING COMPLEX TRANSACTIONS TO CLOSINGDEMONSTRATED TRACK RECORD OF LEADING AND CLOSING FINANCINGS, AND AN IN-DEPTH UNDERSTANDING DEBT AND TAX EQUITY STRUCTURESUNDERSTANDING AND ABILITY TO WORK WITH FINANCIAL MODELS AND PERFORM SENSITIVITY ANALYSES.EXCELLENT ORAL AND WRITTEN COMMUNICATION SKILLS, INCLUDING PRESENTATION SKILLS TO A VARIETY OF EXTERNAL PARTNERS AND INTERNAL PARTIES (TEAM, SENIOR MANAGEMENT, BOARD)",
    "job_skill_set": [
      "documentation",
      "financial analysis",
      "leadership",
      "communication",
      "relationship building",
      "problem solving",
      "presentation skills",
      "strategic thinking",
      "project finance",
      "debt financing",
      "tax equity",
      "financial modeling",
      "sensitivity analysis",
      "due diligence",
      "capital markets"
    ],
    "short_keywords": [
      "analysis",
      "building",
      "capital",
      "communication",
      "debt",
      "diligence",
      "directorvp",
      "documentation",
      "due",
      "equity",
      "finance",
      "financial",
      "financing",
      "leadership",
      "markets",
      "modeling",
      "presentation",
      "problem",
      "project",
      "relationship",
      "sensitivity",
      "skills",
      "solving",
      "strategic",
      "tax",
      "thinking"
    ]
  },
  {
    "job_id": "3895222638",
    "job_title": "Vice President Finance",
    "category": "FINANCE",
    "job_description": "WE ARE AN INVESTMENT FUND SPECIALIZING IN PRIVATE EQUITY (PE) AND VENTURE CAPITAL (VC) STYLE STRATEGIES. AS THE FIRST EVER HIRE FOR OUR FINANCE TEAM, YOU WILL PLAY A PIVOTAL ROLE IN SHAPING THE FINANCIAL INFRASTRUCTURE OF OUR ORGANIZATION.\nPOSITION SUMMARY: REPORTING DIRECTLY TO THE FOUNDERS, THE VICE PRESIDENT OF FINANCE WILL BE RESPONSIBLE FOR ESTABLISHING AND LEADING THE FINANCE FUNCTION OF OUR INVESTMENT FUND. THIS ROLE REQUIRES A STRATEGIC THINKER WITH A STRONG FOUNDATION IN FINANCE, PROVEN LEADERSHIP SKILLS, AND THE ABILITY TO THRIVE IN A DYNAMIC AND ENTREPRENEURIAL ENVIRONMENT. THE IDEAL CANDIDATE WILL HAVE A MINIMUM OF 10 YEARS OF EXPERIENCE IN FINANCE ROLES WITHIN THE ASSET MANAGEMENT INDUSTRY.\nKEY RESPONSIBILITIES:FINANCIAL STRATEGY AND PLANNING:DEVELOP AND IMPLEMENT FINANCIAL STRATEGIES ALIGNED WITH THE FUND'S OVERALL OBJECTIVES.LEAD THE ANNUAL BUDGETING AND FORECASTING PROCESS, PROVIDING INSIGHTS TO OPTIMIZE INVESTMENT DECISIONS.FINANCIAL REPORTING AND ANALYSIS:OVERSEE THE PREPARATION AND ANALYSIS OF FINANCIAL REPORTS, INCLUDING P&L STATEMENTS, BALANCE SHEETS, AND CASH FLOW STATEMENTS.PROVIDE REGULAR FINANCIAL INSIGHTS TO THE FOUNDERS AND INVESTMENT TEAM TO SUPPORT DECISION-MAKING.INVESTOR RELATIONS:SERVE AS A KEY POINT OF CONTACT FOR INVESTORS, PROVIDING TIMELY AND ACCURATE FINANCIAL INFORMATION AND ADDRESSING INQUIRIES.PREPARE INVESTOR PRESENTATIONS AND REPORTS FOR FUNDRAISING ACTIVITIES AND ONGOING COMMUNICATIONS.RISK MANAGEMENT AND COMPLIANCE:ESTABLISH AND MAINTAIN ROBUST INTERNAL CONTROLS TO ENSURE COMPLIANCE WITH REGULATORY REQUIREMENTS AND INDUSTRY BEST PRACTICES.MANAGE FINANCIAL RISKS AND IDENTIFY OPPORTUNITIES TO MITIGATE POTENTIAL EXPOSURES.TEAM LEADERSHIP AND DEVELOPMENT:BUILD AND LEAD A HIGH-PERFORMING FINANCE TEAM, PROVIDING MENTORSHIP AND GUIDANCE TO FOSTER PROFESSIONAL GROWTH.COLLABORATE WITH OTHER FUNCTIONAL AREAS TO DRIVE CROSS-FUNCTIONAL INITIATIVES AND ACHIEVE ORGANIZATIONAL GOALS.\nQUALIFICATIONS:BACHELOR'S DEGREE IN FINANCE, ACCOUNTING, OR RELATED FIELD; MBA OR CPA PREFERRED.MINIMUM OF 10 YEARS OF EXPERIENCE IN FINANCE ROLES WITHIN PRIVATE EQUITY, VENTURE CAPITAL, OR INVESTMENT BANKING.PROVEN TRACK RECORD OF BUILDING AND LEADING FINANCE TEAMS IN FAST-PACED AND EVOLVING ENVIRONMENTS.STRONG ANALYTICAL SKILLS WITH THE ABILITY TO TRANSLATE COMPLEX FINANCIAL DATA INTO ACTIONABLE INSIGHTS.EXCELLENT COMMUNICATION AND INTERPERSONAL SKILLS, WITH THE ABILITY TO INTERACT EFFECTIVELY WITH SENIOR STAKEHOLDERS AND INVESTORS.STRATEGIC MINDSET WITH A FOCUS ON DRIVING BUSINESS GROWTH AND SCALABILITY.",
    "job_skill_set": [
      "financial reporting",
      "compliance",
      "team leadership",
      "analytical skills",
      "accounting",
      "communication",
      "interpersonal skills",
      "mentorship",
      "collaboration",
      "problem solving",
      "adaptability",
      "financial strategy",
      "budgeting",
      "forecasting",
      "risk management",
      "investment analysis",
      "financial modeling",
      "private equity",
      "venture capital",
      "MBA",
      "CPA",
      "strategic thinking"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "analysis",
      "analytical",
      "budgeting",
      "capital",
      "collaboration",
      "communication",
      "compliance",
      "cpa",
      "equity",
      "finance",
      "financial",
      "forecasting",
      "interpersonal",
      "investment",
      "leadership",
      "management",
      "mba",
      "mentorship",
      "modeling",
      "president",
      "private",
      "problem",
      "reporting",
      "risk",
      "skills",
      "solving",
      "strategic",
      "strategy",
      "team",
      "thinking",
      "venture",
      "vice"
    ]
  },
  {
    "job_id": "3894893665",
    "job_title": "Finance Administrator",
    "category": "FINANCE",
    "job_description": "JOB TYPE: 3 MONTHS CONTRACT WITH POSSIBLE EXTENSION \nTHE FIELD FINANCE ADMINISTRATOR PERFORMS ROUTINE ADMINISTRATIVE DUTIES IN A FACILITY IN ACCORDANCE WITH STANDARD ADMINISTRATIVE OFFICE PROCEDURES. THIS ROLE WILL SUPPORT THE MANAGEMENT TEAM OF THE FACILITY.\nREQUIRED SKILLS AND EXPERIENCE:HIGH SCHOOL DIPLOMA OR GEDEXPERIENCE IN AN OFFICE ENVIRONMENT.PROFICIENT IN MICROSOFT EXCEL. ABILITY TO CREATE SPREADSHEETS, CHARTS AND PIVOT TABLES.SAP EXPERIENCE A PLUS, NOT REQUIRED.GOOD TIME MANAGEMENT AND ORGANIZATION SKILLS.PROFICIENT WITH ALL MICROSOFT OFFICE PROGRAMS (KNOWLEDGE OF EXCEL)TASKS:CREATING AND UPDATING EXCEL SPREADSHEETS WITH SPEND ACTIVITY.REVIEW OPEN POS AND UNPAID EXPENSES. ASSIST WITH IDENTIFYING ISSUES WITH VENDORS.CREATING SOPS AND DOCUMENTATION OF PROCESS WITH SUPPORT OF FINANCE MANAGER.ASSIST WITH VARIOUS FINANCE SUPPORT TASKS NEEDED.",
    "job_skill_set": [
      "Microsoft Excel",
      "Microsoft Office",
      "Spreadsheet creation",
      "Time management",
      "Organization",
      "Communication",
      "Problem solving",
      "SAP",
      "Chart creation",
      "Pivot tables"
    ],
    "short_keywords": [
      "administrator",
      "chart",
      "communication",
      "creation",
      "excel",
      "finance",
      "management",
      "microsoft",
      "office",
      "organization",
      "pivot",
      "problem",
      "sap",
      "solving",
      "spreadsheet",
      "tables",
      "time"
    ]
  },
  {
    "job_id": "3904565981",
    "job_title": "Assistant Vice President Finance",
    "category": "FINANCE",
    "job_description": "JOB SUMMARY:WE ARE SEEKING A SKILLED AND EXPERIENCED AVP FINANCE, ASSISTANT TO CFO FOR OUR FINANCE TEAM. THE IDEAL CANDIDATE WILL BE RESPONSIBLE FOR MANAGING US PAYROLL, US INSURANCE, AND VARIOUS FINANCIAL TASKS UNDER THE GUIDANCE OF THE CFO. THIS ROLE REQUIRES A HIGH LEVEL OF ATTENTION TO DETAIL, STRONG ORGANIZATIONAL SKILLS, AND THE ABILITY TO WORK EFFECTIVELY IN A FAST-PACED ENVIRONMENT.\nRESPONSIBILITIES:HANDLE US PAYROLL PROCESSING, INCLUDING CALCULATING WAGES, ENSURING COMPLIANCE WITH TAX REGULATIONS, AND PROCESSING PAYMENTS ACCURATELY AND ON TIME.MANAGE US INSURANCE POLICIES, INCLUDING HEALTH INSURANCE, WORKERS' COMPENSATION, AND LIABILITY INSURANCE, ENSURING TIMELY PAYMENTS AND RESOLVING ANY ISSUES THAT MAY ARISE.ASSIST IN FINANCIAL PLANNING AND ANALYSIS, INCLUDING BUDGETING, FORECASTING, AND FINANCIAL REPORTING.SUPPORT THE CFO IN PREPARING FINANCIAL STATEMENTS, REPORTS, AND PRESENTATIONS FOR MANAGEMENT AND STAKEHOLDERS.COORDINATE WITH INTERNAL AND EXTERNAL AUDITORS TO PROVIDE NECESSARY DOCUMENTATION AND SUPPORT DURING AUDITS.MANAGE ADP SOFTWARE FOR PAYROLL PROCESSING AND ENSURE ACCURATE AND EFFICIENT USE OF THE SYSTEM.PROCESS INVOICES, INCLUDING VERIFYING ACCURACY, OBTAINING NECESSARY APPROVALS, AND ENSURING TIMELY PAYMENT.HANDLE CONSULTANT PAYMENT PROCESSING, INCLUDING CONTRACT REVIEW, INVOICE VALIDATION, AND PAYMENT SCHEDULING.ADMINISTER 401(K) PROGRAM, INCLUDING ENROLLMENT, CONTRIBUTION PROCESSING, AND COMPLIANCE MONITORING.ASSIST WITH AD HOC FINANCIAL PROJECTS AND INITIATIVES AS ASSIGNED BY THE CFO.\nREQUIREMENTS:MBA IN FINANCE OR MCOM IN FINANCE IS MANDATORY.3-7 YEARS OF EXPERIENCE IN FINANCE OR ACCOUNTING ROLES, PREFERABLY IN A CORPORATE ENVIRONMENT.STRONG UNDERSTANDING OF US PAYROLL PROCESSING, TAX REGULATIONS, AND COMPLIANCE REQUIREMENTS.EXPERIENCE MANAGING US INSURANCE POLICIES, INCLUDING HEALTH INSURANCE AND WORKERS' COMPENSATION.PROFICIENCY IN FINANCIAL SOFTWARE AND TOOLS, SUCH AS EXCEL OR SIMILAR PROGRAMS.FAMILIARITY WITH ADP SOFTWARE FOR PAYROLL PROCESSING.KNOWLEDGE OF CONSULTANT PAYMENT PROCESSING AND CONTRACT ADMINISTRATION.UNDERSTANDING OF 401(K) ADMINISTRATION AND COMPLIANCE REQUIREMENTS.EXCELLENT ANALYTICAL SKILLS AND ATTENTION TO DETAIL.ABILITY TO MULTITASK AND PRIORITIZE TASKS EFFECTIVELY IN A DYNAMIC WORK ENVIRONMENT.STRONG COMMUNICATION AND INTERPERSONAL SKILLS, WITH THE ABILITY TO COLLABORATE EFFECTIVELY WITH CROSS-FUNCTIONAL TEAMS.DEMONSTRATED ABILITY TO MAINTAIN CONFIDENTIALITY AND HANDLE SENSITIVE INFORMATION WITH DISCRETION.\nBENEFITS:COMPETITIVE SALARY BASED ON EXPERIENCE AND QUALIFICATIONS.COMPREHENSIVE HEALTH INSURANCE AND OTHER BENEFITS PACKAGES.OPPORTUNITIES FOR PROFESSIONAL DEVELOPMENT AND CAREER GROWTH WITHIN THE ORGANIZATION.A COLLABORATIVE AND SUPPORTIVE WORK ENVIRONMENT WITH A FOCUS ON INNOVATION AND EXCELLENCE.\n( PLEASE NOTE: IT IS AN OPPORTUNITY LOCAL TO CITIZENS OF UNITED STATES, WE ARE NOT ACCEPTING APPLICATIONS FROM ANY OTHER COUNTRY FOR THIS ROLE)",
    "job_skill_set": [
      "Insurance Management",
      "Attention to Detail",
      "Organizational Skills",
      "Multitasking",
      "Communication Skills",
      "Interpersonal Skills",
      "Collaboration",
      "US Payroll Processing",
      "Tax Regulations Compliance",
      "Financial Planning and Analysis",
      "Financial Reporting",
      "ADP Software",
      "Financial Software (Excel)",
      "401(K) Administration",
      "Invoice Processing",
      "Contract Administration",
      "Confidentiality"
    ],
    "short_keywords": [
      "401k",
      "administration",
      "adp",
      "analysis",
      "and",
      "assistant",
      "attention",
      "collaboration",
      "communication",
      "compliance",
      "confidentiality",
      "contract",
      "detail",
      "excel",
      "finance",
      "financial",
      "insurance",
      "interpersonal",
      "invoice",
      "management",
      "multitasking",
      "organizational",
      "payroll",
      "planning",
      "president",
      "processing",
      "regulations",
      "reporting",
      "skills",
      "software",
      "tax",
      "to",
      "us",
      "vice"
    ]
  },
  {
    "job_id": "3904995129",
    "job_title": "Fundamental Fixed Income (FFI) - Director, Leveraged Finance Research",
    "category": "FINANCE",
    "job_description": "R241469\n\nDESCRIPTION\n\nABOUT THIS ROLE\n\nBLACKROCK IS ONE OF THE WORLD’S PREEMINENT ASSET MANAGEMENT FIRMS AND A BEST-IN-CLASS PROVIDER OF GLOBAL INVESTMENT MANAGEMENT, RISK MANAGEMENT AND ADVISORY SERVICES TO INSTITUTIONAL, INTERMEDIARY AND INDIVIDUAL INVESTORS AROUND THE WORLD. BLACKROCK OFFERS A RANGE OF SOLUTIONS — FROM METICULOUS FUNDAMENTAL AND QUANTITATIVE ACTIVE MANAGEMENT APPROACHES AIMED AT IMPROVING OUTPERFORMANCE TO HIGHLY EFFICIENT INDEXING STRATEGIES DESIGNED TO GAIN BROAD EXPOSURE TO ALL CAPITAL MARKETS. OUR CLIENTS CAN ACCESS OUR INVESTMENT SOLUTIONS THROUGH A VARIETY OF PRODUCT STRUCTURES, INCLUDING INDIVIDUAL AND INSTITUTIONAL SEPARATE ACCOUNTS, MUTUAL FUNDS AND POOLED INVESTMENT VEHICLES, AND THE INDUSTRY-LEADING ISHARES® ETFS.\n\nTHE BLACKROCK'S FUNDAMENTAL FIXED INCOME HANDLES MORE THAN $1.2 TRILLION IN FIXED INCOME ASSETS ACROSS INDEX, ACTIVE, AND SYSTEMATIC STRATEGIES. THE PLATFORM OFFERS AN ARRAY OF FIXED INCOME PRODUCTS DESIGNED TO MEET SPECIFIC CLIENT RISK AND RETURN PROFILES. INCORPORATING THE EXPERTISE OF BLACKROCK'S SECTOR SPECIALISTS, EACH CLIENT PORTFOLIO IS TAILORED TO REFLECT SPECIFIC INVESTMENT GUIDELINES AND OBJECTIVES WITH RESPECT TO INTEREST RATE EXPOSURE, SECTOR ALLOCATION, AND CREDIT QUALITY.\n\nOUR LEVERAGED FINANCE PLATFORM MANAGES HIGH YIELD BONDS, LEVERAGED LOANS, AND CLO’S. THE TEAM IS GLOBAL WITH INVESTMENT PROFESSIONALS IN THE AMERICAS, EUROPE, AND ASIA. THIS IS AN DIRECTOR POSITION WITHIN THE LEV FIN RESEARCH TEAM IN NEW YORK.\n\nKEY RESPONSIBILITIES\n\nASSUME INDUSTRY COVERAGE AND APPLY THAT KNOWLEDGE TO DILIGENCE OPPORTUNITIES WITHIN THE HIGH YIELD AND LEVERAGED LOAN MARKETS AND EVALUATE RELATIVE VALUE ACROSS CAPITAL STRUCTURESWORK DIRECTLY WITH MEMBERS OF PORTFOLIO MANAGEMENT TEAM WITHIN BLACKROCK’S LEV FIN BUSINESS TO UNDERWRITE CREDIT RISK RELATED TO HIGH YIELD AND LOAN POSITIONING WITHIN DEDICATED LEVERAGED FINANCE PORTFOLIOS AND ACROSS BLACKROCK’S CREDIT PLATFORMPARTNER WITH BLACKROCK’S CAPITAL MARKETS GROUP AND EXTERNAL BUSINESS PARTNERS ON OPPORTUNITIES IN NEW ISSUE BONDS AND LEVERAGED LOANSOVERSEE AND LEAD JUNIOR CREDIT RESEARCH TEAM MEMBERS TO HELP MENTOR, TRAIN, AND DEVELOP NEW TALENTMAINTAIN STRONG RELATIONSHIPS WITH PRODUCT STRATEGISTS, PORTFOLIO MANAGERS, CAPITAL MARKETS, LEGAL, AND OTHERS WHO SUPPORT THE LEVERAGED FINANCE BUSINESSDEVELOP THEMATIC MATERIALS TO SHARE SECTOR-LEVEL INSIGHTS ACROSS INTERNAL CONSTITUENCIES AND IN EXTERNAL CLIENT COMMUNICATIONS\n\nKEY QUALIFICATIONS\n\nUNDERGRADUATE DEGREE IN FINANCE, ECONOMICS, STATISTICS, OR MATHEMATICS WITH SUPERIOR ACADEMIC RECORD7+ YEARS OF RELEVANT AND SIMILAR EXPERIENCE WORKING AS A RESEARCH ANALYST IN THE HIGH YIELD AND LEVERAGED LOAN MARKETCOMFORT AND ABILITY TO UNDERSTAND AND COMMUNICATE COVENANTSSTRONG FINANCIAL MODELING, ANALYTICAL, AND INTERPERSONAL SKILLS ARE PARAMOUNTPROFICIENT IN BLOOMBERG, EXCEL AND POWERPOINT; FAMILIARITY WITH ALADDIN PLATFORM PREFERRED, NOT REQUIRED\n\nFOR NEW YORK CITY ONLY: THE SALARY RANGE FOR THIS POSITION IS $205,000 - $260,000. ADDITIONALLY, EMPLOYEES ARE ELIGIBLE FOR AN ANNUAL DISCRETIONARY BONUS, AND BENEFITS INCLUDING HEATH CARE, LEAVE BENEFITS, AND RETIREMENT BENEFITS. BLACKROCK OPERATES A PAY-FOR-PERFORMANCE COMPENSATION PHILOSOPHY AND YOUR TOTAL COMPENSATION MAY VARY BASED ON ROLE, LOCATION, AND FIRM, DEPARTMENT AND INDIVIDUAL PERFORMANCE.\n\nOUR BENEFITS\n\nTO HELP YOU STAY ENERGIZED, ENGAGED AND INSPIRED, WE OFFER A WIDE RANGE OF BENEFITS INCLUDING A STRONG RETIREMENT PLAN, TUITION REIMBURSEMENT, COMPREHENSIVE HEALTHCARE, SUPPORT FOR WORKING PARENTS AND FLEXIBLE TIME OFF (FTO) SO YOU CAN RELAX, RECHARGE AND BE THERE FOR THE PEOPLE YOU CARE ABOUT.\n\nOUR HYBRID WORK MODEL\n\nBLACKROCK’S HYBRID WORK MODEL IS DESIGNED TO ENABLE A CULTURE OF COLLABORATION AND APPRENTICESHIP THAT ENRICHES THE EXPERIENCE OF OUR EMPLOYEES, WHILE SUPPORTING FLEXIBILITY FOR ALL. EMPLOYEES ARE CURRENTLY REQUIRED TO WORK AT LEAST 4 DAYS IN THE OFFICE PER WEEK, WITH THE FLEXIBILITY TO WORK FROM HOME 1 DAY A WEEK. SOME BUSINESS GROUPS MAY REQUIRE MORE TIME IN THE OFFICE DUE TO THEIR ROLES AND RESPONSIBILITIES. WE REMAIN FOCUSED ON INCREASING THE IMPACTFUL MOMENTS THAT ARISE WHEN WE WORK TOGETHER IN PERSON – ALIGNED WITH OUR COMMITMENT TO PERFORMANCE AND INNOVATION. AS A NEW JOINER, YOU CAN COUNT ON THIS HYBRID MODEL TO ACCELERATE YOUR LEARNING AND ONBOARDING EXPERIENCE HERE AT BLACKROCK.\n\nABOUT BLACKROCK\n\nAT BLACKROCK, WE ARE ALL CONNECTED BY ONE MISSION: TO HELP MORE AND MORE PEOPLE EXPERIENCE FINANCIAL WELL-BEING. OUR CLIENTS, AND THE PEOPLE THEY SERVE, ARE SAVING FOR RETIREMENT, PAYING FOR THEIR CHILDREN’S EDUCATIONS, BUYING HOMES AND STARTING BUSINESSES. THEIR INVESTMENTS ALSO HELP TO STRENGTHEN THE GLOBAL ECONOMY: SUPPORT BUSINESSES SMALL AND LARGE; FINANCE INFRASTRUCTURE PROJECTS THAT CONNECT AND POWER CITIES; AND FACILITATE INNOVATIONS THAT DRIVE PROGRESS.\n\nTHIS MISSION WOULD NOT BE POSSIBLE WITHOUT OUR SMARTEST INVESTMENT – THE ONE WE MAKE IN OUR EMPLOYEES. IT’S WHY WE’RE DEDICATED TO CREATING AN ENVIRONMENT WHERE OUR COLLEAGUES FEEL WELCOMED, VALUED AND SUPPORTED WITH NETWORKS, BENEFITS AND DEVELOPMENT OPPORTUNITIES TO HELP THEM THRIVE.\n\nFOR ADDITIONAL INFORMATION ON BLACKROCK, PLEASE VISIT @BLACKROCK | TWITTER: @BLACKROCK | LINKEDIN: WWW.LINKEDIN.COM/COMPANY/BLACKROCK\n\nBLACKROCK IS PROUD TO BE AN EQUAL OPPORTUNITY AND AFFIRMATIVE ACTION EMPLOYER. WE EVALUATE QUALIFIED APPLICANTS WITHOUT REGARD TO RACE, COLOR, NATIONAL ORIGIN, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, DISABILITY, PROTECTED VETERAN STATUS, AND OTHER STATUSES PROTECTED BY LAW.\n\nBLACKROCK WILL CONSIDER FOR EMPLOYMENT QUALIFIED APPLICANTS WITH ARREST OR CONVICTION RECORDS IN A MANNER CONSISTENT WITH THE REQUIREMENTS OF THE LAW, INCLUDING ANY APPLICABLE FAIR CHANCE LAW.\n\n",
    "job_skill_set": [
      "analytical skills",
      "interpersonal skills",
      "mentoring",
      "communication",
      "relationship management",
      "teamwork",
      "leadership",
      "financial modeling",
      "Bloomberg",
      "Excel",
      "PowerPoint",
      "Aladdin platform",
      "credit risk assessment",
      "high yield bonds",
      "leveraged loans",
      "capital markets"
    ],
    "short_keywords": [
      "aladdin",
      "analytical",
      "assessment",
      "bloomberg",
      "bonds",
      "capital",
      "communication",
      "credit",
      "director",
      "excel",
      "ffi",
      "finance",
      "financial",
      "fixed",
      "fundamental",
      "high",
      "income",
      "interpersonal",
      "leadership",
      "leveraged",
      "loans",
      "management",
      "markets",
      "mentoring",
      "modeling",
      "platform",
      "powerpoint",
      "relationship",
      "research",
      "risk",
      "skills",
      "teamwork",
      "yield"
    ]
  },
  {
    "job_id": "3905864544",
    "job_title": "Head of Corporate Finance (Sr. Director / Director)",
    "category": "FINANCE",
    "job_description": "ABOUT US\n\nAT CLOUDFLARE, WE HAVE OUR EYES SET ON AN AMBITIOUS GOAL: TO HELP BUILD A BETTER INTERNET. TODAY THE COMPANY RUNS ONE OF THE WORLD’S LARGEST NETWORKS THAT POWERS APPROXIMATELY 25 MILLION INTERNET PROPERTIES, FOR CUSTOMERS RANGING FROM INDIVIDUAL BLOGGERS TO SMBS TO FORTUNE 500 COMPANIES. CLOUDFLARE PROTECTS AND ACCELERATES ANY INTERNET APPLICATION ONLINE WITHOUT ADDING HARDWARE, INSTALLING SOFTWARE, OR CHANGING A LINE OF CODE. INTERNET PROPERTIES POWERED BY CLOUDFLARE ALL HAVE WEB TRAFFIC ROUTED THROUGH ITS INTELLIGENT GLOBAL NETWORK, WHICH GETS SMARTER WITH EVERY REQUEST. AS A RESULT, THEY SEE SIGNIFICANT IMPROVEMENT IN PERFORMANCE AND A DECREASE IN SPAM AND OTHER ATTACKS. CLOUDFLARE WAS NAMED TO ENTREPRENEUR MAGAZINE’S TOP COMPANY CULTURES LIST AND RANKED AMONG THE WORLD’S MOST INNOVATIVE COMPANIES BY FAST COMPANY.\n\nWE REALIZE PEOPLE DO NOT FIT INTO NEAT BOXES. WE ARE LOOKING FOR CURIOUS AND EMPATHETIC INDIVIDUALS WHO ARE COMMITTED TO DEVELOPING THEMSELVES AND LEARNING NEW SKILLS, AND WE ARE READY TO HELP YOU DO THAT. WE CANNOT COMPLETE OUR MISSION WITHOUT BUILDING A DIVERSE AND INCLUSIVE TEAM. WE HIRE THE BEST PEOPLE BASED ON AN EVALUATION OF THEIR POTENTIAL AND SUPPORT THEM THROUGHOUT THEIR TIME AT CLOUDFLARE. COME JOIN US!\n\nAVAILABLE LOCATIONS: US REMOTE (PACIFIC AND CENTRAL TIME ZONES PREFERRED)\n\nNOTE: BASED ON THE CANDIDATE'S EXPERIENCE, WE ARE OPEN TO HIRING THIS POSITION AT THE DIRECTOR OR SR. DIRECTOR LEVEL.\n\n\nABOUT THE DEPARTMENT\n\nTHE CORPORATE FINANCE TEAM IS RESPONSIBLE FOR ENTERPRISE LEVEL PLANNING, BUDGETING, FORECASTING, ANALYSIS AND CAPITAL ALLOCATION. THIS IS A HIGHLY STRATEGIC & VISIBLE TEAM THAT PARTNERS CLOSELY WITH OUR C-SUITE AND CROSS-FUNCTIONAL BUSINESS LEADERS TO DEVELOP KEY PRIORITIES FOR THE BUSINESS AS WELL AS THE FINANCIAL PLAN REQUIRED TO DELIVER ON OUR GROWTH AND PROFITABILITY GOALS. MEMBERS OF THE CORPORATE FINANCE TEAM POSSESS EXCELLENT ANALYTICAL, CRITICAL REASONING, INTERPERSONAL, COMMUNICATION, INFLUENCING AND LEADERSHIP SKILLS AND ARE PASSIONATE ABOUT BOTH PROBLEM SOLVING AS WELL AS BUILDING HIGH QUALITY REPEATABLE PROCESSES THAT SCALE WITH OUR RAPID GROWTH. OUR ROLE EXTENDS BEYOND ANALYZING AND REPORTING; WE TAKE PRIDE IN HELPING TO DESIGN AND IMPLEMENT SOLUTIONS TO THE DIFFERENT CHALLENGES THAT CAN ARISE IN OUR HIGH GROWTH ENVIRONMENT.\n\nWHAT YOU'LL DO\n\nDEVELOP AND EXECUTE OUR FINANCIAL PLAN TO SUPPORT CLOUDFLARE’S GROWTH AND SCALE OBJECTIVES. PARTNER WITH CROSS-FUNCTIONAL TEAMS TO DEVELOP AND PRIORITIZE STRATEGIC INITIATIVES THAT DRIVE REVENUE GROWTH, COST OPTIMIZATION, AND OPERATIONAL EFFICIENCYLEAD THE CORPORATE FORECASTING AND BUDGETING PROCESSES, INCLUDING ANNUAL PLANNING AS WELL AS MONTHLY AND QUARTERLY BUSINESS REVIEWSBE A THOUGHT PARTNER TO BUSINESS LEADERS HELPING TO RESOLVE COMPETING BUSINESS PRIORITIES AND DETERMINE OPTIMAL INVESTMENT ALLOCATION BY FUNCTIONPREPARE FINANCIAL ANALYSIS, BUSINESS INSIGHTS AND PRESENTATION MATERIALS FOR REGULAR FINANCIAL AND BUSINESS UPDATES TO THE LEADERSHIP TEAMPARTNER WITH ACCOUNTING TO SUPPORT MONTH-END CLOSE, FLUX REVIEW PROCESSES, AND DELIVER HIGH-QUALITY FINANCIAL REPORTINGCONTRIBUTE TO EARNINGS RELEASES, M&A ACTIVITIES AND OTHER CORPORATE INITIATIVES IN CLOSE PARTNERSHIP WITH OUR INVESTOR RELATIONS AND CORPORATE DEVELOPMENT TEAMSDESIGN, AUTOMATE, AND OPTIMIZE FLEXIBLE FINANCE PROCESSES TO MEET THE NEEDS OF A DYNAMIC AND FAST-GROWING BUSINESS ENVIRONMENTOWN, REFINE FINANCIAL SYSTEMS ROADMAP IN PARTNERSHIP WITH OUR TRANSFORMATION TEAMSLEAD, INSPIRE, AND DEVELOP OUR TEAM OF CORPORATE FINANCE AND ANAPLAN COE PROFESSIONALS \n\n\nEXAMPLES OF DESIRABLE SKILLS, KNOWLEDGE AND EXPERIENCE\n\n12+ YEARS OF PROGRESSIVE EXPERIENCE IN FINANCE, INVESTMENT BANKING OR PE WITH PRIOR EXPERIENCE IN A CORPORATE FP&A FUNCTION. HIGH GROWTH, PUBLIC COMPANY SAAS EXPERIENCE PREFERREDDEMONSTRATED SUCCESS IN BUILDING AND LEADING HIGH PERFORMANCE FINANCE TEAMSSTRONG EXECUTIVE PRESENCE AND INTERPERSONAL SKILLS WITH PROFICIENCY IN DISTILLING COMPLEX BUSINESS INFORMATION INTO CONSUMABLE AND ACTIONABLE TAKEAWAYSEXPERT IN FINANCIAL MODELING WITH STRONG WORKING KNOWLEDGE OF GAAP. EXTENSIVE EXPERIENCE ARCHITECTING INTEGRATED MODELS FROM SCRATCH, IN EXCEL OR IN OTHER PLANNING APPLICATIONS.SYSTEMS THINKER. EXPERIENCE IN DESIGNING AND IMPLEMENTING NEW SYSTEMS AND TOOLSDEMONSTRATED PROJECT MANAGEMENT SKILLS WITH EXPERIENCE IMPROVING AND STREAMLINING PROCESSES, AND DEVELOPING SOLUTIONS TO OPERATIONAL INEFFICIENCIESINTELLECTUALLY CURIOUS WITH PROBLEM SOLVING ORIENTATION. STRONG ANALYTICAL CAPABILITIES AND BUSINESS ACUMEN WITH ABILITY TO APPLY RIGOROUS LOGIC AND SOUND METHODS TO SOLVE MULTI-FACETED PROBLEMS. NOT SATISFIED WITH EASY OR CONVENIENT ANSWERSWILLINGNESS TO PLAY “UP AND DOWN THE STACK” DIVING INTO THE DETAILS AS WELL AS MANAGING EXEC LEVEL COMMUNICATIONSHIGH PROFICIENCY WITH FINANCIAL SYSTEMS AND TOOLS. ANAPLAN, NETSUITE, REVPRO, SALESFORCE AND TABLEAU EXPERIENCE IS A PLUSBA/BS IN FINANCE, ACCOUNTING, ECONOMICS OR QUANTITATIVE FIELD; MBA OR MASTERS PREFERRED \n\n\nCOMPENSATION\n\nCOMPENSATION MAY BE ADJUSTED DEPENDING ON WORK LOCATION.\n\nFOR COLORADO-BASED HIRES AND WASHINGTON HIRES: ESTIMATED ANNUAL SALARY OF $216,000 - $294,000FOR NEW YORK CITY-BASED AND CALIFORNIA (EXCLUDING BAY AREA): ESTIMATED ANNUAL SALARY OF $248,000 - $337,000FOR BAY AREA-BASED HIRES: ESTIMATED ANNUAL SALARY OF $261,000 - $355,000\n\n\nEQUITY\n\nTHIS ROLE IS ELIGIBLE TO PARTICIPATE IN CLOUDFLARE’S EQUITY PLAN.\n\nBENEFITS\n\nCLOUDFLARE OFFERS A COMPLETE PACKAGE OF BENEFITS AND PROGRAMS TO SUPPORT YOU AND YOUR FAMILY. OUR BENEFITS PROGRAMS CAN HELP YOU PAY HEALTH CARE EXPENSES, SUPPORT CAREGIVING, BUILD CAPITAL FOR THE FUTURE AND MAKE LIFE A LITTLE EASIER AND FUN! THE BELOW IS A DESCRIPTION OF OUR BENEFITS FOR EMPLOYEES IN THE UNITED STATES, AND BENEFITS MAY VARY FOR EMPLOYEES BASED OUTSIDE THE U.S.\n\nHEALTH & WELFARE BENEFITS\n\nMEDICAL/RX INSURANCEDENTAL INSURANCEVISION INSURANCEFLEXIBLE SPENDING ACCOUNTSCOMMUTER SPENDING ACCOUNTSFERTILITY & FAMILY FORMING BENEFITSON-DEMAND MENTAL HEALTH SUPPORT AND EMPLOYEE ASSISTANCE PROGRAMGLOBAL TRAVEL MEDICAL INSURANCE\n\n\nFINANCIAL BENEFITS\n\nSHORT AND LONG TERM DISABILITY INSURANCELIFE & ACCIDENT INSURANCE401(K) RETIREMENT SAVINGS PLANEMPLOYEE STOCK PARTICIPATION PLAN\n\n\nTIME OFF\n\nFLEXIBLE PAID TIME OFF COVERING VACATION AND SICK LEAVELEAVE PROGRAMS, INCLUDING PARENTAL, PREGNANCY HEALTH, MEDICAL, AND BEREAVEMENT LEAVE\n\n\nWHAT MAKES CLOUDFLARE SPECIAL?\n\nWE’RE NOT JUST A HIGHLY AMBITIOUS, LARGE-SCALE TECHNOLOGY COMPANY. WE’RE A HIGHLY AMBITIOUS, LARGE-SCALE TECHNOLOGY COMPANY WITH A SOUL. FUNDAMENTAL TO OUR MISSION TO HELP BUILD A BETTER INTERNET IS PROTECTING THE FREE AND OPEN INTERNET.\n\nPROJECT GALILEO: WE EQUIP POLITICALLY AND ARTISTICALLY IMPORTANT ORGANIZATIONS AND JOURNALISTS WITH POWERFUL TOOLS TO DEFEND THEMSELVES AGAINST ATTACKS THAT WOULD OTHERWISE CENSOR THEIR WORK, TECHNOLOGY ALREADY USED BY CLOUDFLARE’S ENTERPRISE CUSTOMERS--AT NO COST.\n\nATHENIAN PROJECT: WE CREATED ATHENIAN PROJECT TO ENSURE THAT STATE AND LOCAL GOVERNMENTS HAVE THE HIGHEST LEVEL OF PROTECTION AND RELIABILITY FOR FREE, SO THAT THEIR CONSTITUENTS HAVE ACCESS TO ELECTION INFORMATION AND VOTER REGISTRATION.\n\nPATH FORWARD PARTNERSHIP: SINCE 2016, WE HAVE PARTNERED WITH PATH FORWARD, A NONPROFIT ORGANIZATION, TO CREATE 16-WEEK POSITIONS FOR MID-CAREER PROFESSIONALS WHO WANT TO GET BACK TO THE WORKPLACE AFTER TAKING TIME OFF TO CARE FOR A CHILD, PARENT, OR LOVED ONE.\n\n1.1.1.1: WE RELEASED 1.1.1.1 TO HELP FIX THE FOUNDATION OF THE INTERNET BY BUILDING A FASTER, MORE SECURE AND PRIVACY-CENTRIC PUBLIC DNS RESOLVER. THIS IS AVAILABLE PUBLICLY FOR EVERYONE TO USE - IT IS THE FIRST CONSUMER-FOCUSED SERVICE CLOUDFLARE HAS EVER RELEASED. HERE’S THE DEAL - WE DON’T STORE CLIENT IP ADDRESSES NEVER, EVER. WE WILL CONTINUE TO ABIDE BY OUR PRIVACY COMMITMENT AND ENSURE THAT NO USER DATA IS SOLD TO ADVERTISERS OR USED TO TARGET CONSUMERS.\n\nSOUND LIKE SOMETHING YOU’D LIKE TO BE A PART OF? WE’D LOVE TO HEAR FROM YOU!\n\nTHIS POSITION MAY REQUIRE ACCESS TO INFORMATION PROTECTED UNDER U.S. EXPORT CONTROL LAWS, INCLUDING THE U.S. EXPORT ADMINISTRATION REGULATIONS. PLEASE NOTE THAT ANY OFFER OF EMPLOYMENT MAY BE CONDITIONED ON YOUR AUTHORIZATION TO RECEIVE SOFTWARE OR TECHNOLOGY CONTROLLED UNDER THESE U.S. EXPORT LAWS WITHOUT SPONSORSHIP FOR AN EXPORT LICENSE.\n\nCLOUDFLARE IS PROUD TO BE AN EQUAL OPPORTUNITY EMPLOYER. WE ARE COMMITTED TO PROVIDING EQUAL EMPLOYMENT OPPORTUNITY FOR ALL PEOPLE AND PLACE GREAT VALUE IN BOTH DIVERSITY AND INCLUSIVENESS. ALL QUALIFIED APPLICANTS WILL BE CONSIDERED FOR EMPLOYMENT WITHOUT REGARD TO THEIR, OR ANY OTHER PERSON'S, PERCEIVED OR ACTUAL RACE, COLOR, RELIGION, SEX, GENDER, GENDER IDENTITY, GENDER EXPRESSION, SEXUAL ORIENTATION, NATIONAL ORIGIN, ANCESTRY, CITIZENSHIP, AGE, PHYSICAL OR MENTAL DISABILITY, MEDICAL CONDITION, FAMILY CARE STATUS, OR ANY OTHER BASIS PROTECTED BY LAW. WE ARE AN AA/VETERANS/DISABLED EMPLOYER.\n\nCLOUDFLARE PROVIDES REASONABLE ACCOMMODATIONS TO QUALIFIED INDIVIDUALS WITH DISABILITIES. PLEASE TELL US IF YOU REQUIRE A REASONABLE ACCOMMODATION TO APPLY FOR A JOB. EXAMPLES OF REASONABLE ACCOMMODATIONS INCLUDE, BUT ARE NOT LIMITED TO, CHANGING THE APPLICATION PROCESS, PROVIDING DOCUMENTS IN AN ALTERNATE FORMAT, USING A SIGN LANGUAGE INTERPRETER, OR USING SPECIALIZED EQUIPMENT. IF YOU REQUIRE A REASONABLE ACCOMMODATION TO APPLY FOR A JOB, PLEASE CONTACT US VIA E-MAIL AT HR@CLOUDFLARE.COM OR VIA MAIL AT 101 TOWNSEND ST. SAN FRANCISCO, CA 94107.",
    "job_skill_set": [
      "budgeting",
      "project management",
      "leadership",
      "communication",
      "interpersonal skills",
      "problem solving",
      "analytical skills",
      "teamwork",
      "adaptability",
      "strategic thinking",
      "financial planning",
      "forecasting",
      "financial analysis",
      "financial modeling",
      "GAAP",
      "financial reporting",
      "Anaplan",
      "Excel",
      "Netsuite",
      "Salesforce",
      "Tableau",
      "critical reasoning",
      "influencing"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "analytical",
      "anaplan",
      "budgeting",
      "communication",
      "corporate",
      "critical",
      "director",
      "excel",
      "finance",
      "financial",
      "forecasting",
      "gaap",
      "head",
      "influencing",
      "interpersonal",
      "leadership",
      "management",
      "modeling",
      "netsuite",
      "of",
      "planning",
      "problem",
      "project",
      "reasoning",
      "reporting",
      "salesforce",
      "skills",
      "solving",
      "sr",
      "strategic",
      "tableau",
      "teamwork",
      "thinking"
    ]
  },
  {
    "job_id": "3901375658",
    "job_title": "Director of Finance And Accounting",
    "category": "FINANCE",
    "job_description": "PRIMARY RESPONSIBILITIES:FORMULATE, REFINE, AND EXECUTE THE FINANCIAL STRATEGY OF THE ORGANIZATION.DEVELOP AND PRESENT COMPREHENSIVE CORPORATE BUDGETS AND FINANCIAL REPORTS REGULARLY TO FACILITATE EFFECTIVE MANAGEMENT OF PROFIT AND LOSS.ESTABLISH AND REINFORCE POLICIES AND PROTOCOLS TO OPTIMIZE OPERATIONAL EFFICIENCY AND GOVERNANCE ACROSS THE ORGANIZATION.ASSESS AND ENHANCE EXISTING FINANCE AND ACCOUNTING SYSTEMS AND SOFTWARE FOR IMPROVED FUNCTIONALITY.OVERSEE THE ADMINISTRATION, INTEGRATION, AND TRAINING RELATED TO PAYROLL, BENEFITS, AND EMPLOYEE PROGRAMS.SUPERVISE ACCOUNTS PAYABLE AND ACCOUNTS RECEIVABLE FUNCTIONS TO ENSURE SMOOTH OPERATIONS.MANAGE ALL ASPECTS OF EXPENSE PROCESSING, APPROVAL, REIMBURSEMENT, AND RECONCILIATION.COLLABORATE WITH EXTERNAL TAX AND ACCOUNTING EXPERTS TO ENSURE ADHERENCE TO CORPORATE COMPLIANCE STANDARDS.",
    "job_skill_set": [
      "financial strategy",
      "corporate budgeting",
      "financial reporting",
      "operational efficiency",
      "finance and accounting systems",
      "payroll administration",
      "accounts payable",
      "accounts receivable",
      "expense processing",
      "compliance standards",
      "leadership",
      "communication",
      "collaboration",
      "problem solving",
      "training",
      "policy development"
    ],
    "short_keywords": [
      "accounting",
      "accounts",
      "administration",
      "and",
      "budgeting",
      "collaboration",
      "communication",
      "compliance",
      "corporate",
      "development",
      "director",
      "efficiency",
      "expense",
      "finance",
      "financial",
      "leadership",
      "of",
      "operational",
      "payable",
      "payroll",
      "policy",
      "problem",
      "processing",
      "receivable",
      "reporting",
      "solving",
      "standards",
      "strategy",
      "systems",
      "training"
    ]
  },
  {
    "job_id": "3903447802",
    "job_title": "Vice President of Finance",
    "category": "FINANCE",
    "job_description": "DESCRIPTION\n\nPOSITION AT CENTURY COMMUNITIES\n\nABOUT CENTURY COMMUNITIES\n\nAS ONE OF THE NATION’S LARGEST HOMEBUILDERS AND INDUSTRY LEADER IN ONLINE SALES, WE KNOW WHAT IT TAKES TO BE A MARKET GAMECHANGER, AND THAT INCLUDES PROVIDING YOU WITH ALL THE RESOURCES, OPPORTUNITIES, AND BENEFITS TO BUILD A THRIVING AND REWARDING CAREER.\n\nBENEFITS WE OFFER\n\nTEAM MEMBERS ENJOY AN EXCELLENT BENEFITS PACKAGE THAT INCLUDES MEDICAL, DENTAL, VISION, 401(K) WITH EMPLOYER MATCH, PAID TIME OFF, PLUS HOME AND MORTGAGE DISCOUNTS. WE ALSO OFFER COMPETITIVE SALARIES WITH THE POTENTIAL FOR DISCRETIONARY BONUSES AND/OR COMMISSION STRUCTURE (DEPENDING ON THE POSITION).\n\nWE HIRE THE BEST\n\nOUR MISSION OF BUILDING, FINANCING, AND INSURING A HOME FOR EVERY DREAM™ IS ONLY POSSIBLE WITH THE BEST TALENT IN THE INDUSTRY. IF THAT’S YOU—IF YOU’RE A SELF-STARTER, CHANGEMAKER, AND THOUGHTFUL COLLABORATOR READY TO TAKE THEIR CAREER TO THE NEXT LEVEL—THEN APPLY TODAY!\n\nWHAT YOU’LL DO\n\nTHE VICE PRESIDENT OF FINANCE IS RESPONSIBLE FOR THE DIVISION'S FINANCIAL PLANNING AND ANALYSIS, REPORTING, BUDGETING, OPERATIONAL IMPROVEMENT, FORECASTING, FINANCIAL CONTROL SYSTEMS, BACK-OFFICE OPERATIONAL EFFICIENCY, AND COST ACCOUNTING.\n\nYOUR KEY RESPONSIBILITIES INCLUDE\n\nSUPERVISE THE ANNUAL BUSINESS PLANNING AND QUARTERLY FORECAST UPDATE PROCESS, ENSURING A HIGH LEVEL OF TRANSPARENCY AND ACCURACY.WORK CLOSELY WITH THE DIVISION PRESIDENT AND LAND ACQUISITION DEPARTMENT TO ANALYZE THE VIABILITY AND STRUCTURE OF POTENTIAL DEALS AND DETERMINE THE DIRECTION OF FUTURE PROJECT AND PRODUCT POSITIONING.PREPARE AND REVIEWS ALL SALES GROSS MARGIN WORKSHEETS (SALES SCRUBS).REVIEW AND ANALYZE MONTHLY FINANCIAL RESULTS, INCLUDING REASONS FOR VARIANCE FROM THE ANNUAL PLAN.PERFORM POST-ACQUISITION PROJECT REVIEWS COMPARING ACTUAL RESULTS WITH ORIGINAL UNDERWRITING TO IDENTIFY TRENDS OR GAPS AND AREAS OF IMPROVEMENT FOR FUTURE DEALS.MANAGE THE LAND DEVELOPMENT BUDGET UPDATE MONTHLY.PROVIDE ANALYTICAL SUPPORT TO MANAGEMENT TO IMPROVE HOMEBUILDING OPERATIONS AND IDENTIFY COST SAVINGS AND REVENUE ENHANCEMENT OPPORTUNITIES.WORK CLOSELY WITH THE SALES AND MARKETING DEPARTMENT TO ESTABLISH CORRECT PROJECT-LEVEL PRICING, INCLUDING BASE PRICES, LOT PREMIUMS, OPTION PRICING, AND INCENTIVE PROMOTIONS.WORK CLOSELY WITH THE PURCHASING DEPARTMENT TO REDUCE DIRECT COSTS, TRACK COMMODITY PRICING, AND LIMIT OUR PLAN PORTFOLIO.SERVE AS A LOCAL DRIVER OF PROCESS IMPROVEMENT EFFORTS DRIVEN TO STANDARDIZED PROCESSES IN ALL ASPECTS OF THE OPERATION.PROVIDE SUPPORT AND DIRECTION TO THE CORPORATE ACCOUNTING GROUP IN PREPARING DIVISION FINANCIAL STATEMENTS AND DISCLOSURE.OVERSEE INTERNAL CONTROL AND OTHER ACCOUNTING/OPERATIONAL PROCEDURES WITHIN THE DIVISION.SUPPORT ALL DIVISION DEPARTMENTS WITH SPECIAL PROJECTS.PERFORM OTHER DUTIES AS NEEDED OR ASSIGNED.\n\nWHAT YOU HAVE\n\nEXCELLENT ORGANIZATIONAL SKILLS AND ATTENTION TO DETAIL.ABILITY TO FOLLOW UP AND FOLLOW THROUGH ON PROJECTS.WILLINGNESS TO BE PROACTIVE AND TAKE ON ADDITIONAL RESPONSIBILITIES.EFFECTIVE WORKING RELATIONSHIPS WITH VENDORS, SUPPLIERS, CO-WORKERS, AND SUPERVISORY PERSONNEL.\n\nYOUR EDUCATION AND EXPERIENCE\n\nBACHELOR'S DEGREE IN FINANCE OR ACCOUNTING.10+ YEARS OF EXPERIENCE IN FINANCE AND/OR ACCOUNTING.MBA OR BIG 4 CPA PREFERRED.4 OR MORE YEARS OF EXPERIENCE IN RESIDENTIAL HOME BUILDING, LAND, OR CONSTRUCTION ARE REQUIRED.EXPERIENCE WITH AN INTERNATIONAL MANUFACTURING CORPORATION IS PREFERRED.WORK EXPERIENCE IN MANUFACTURING OPERATIONS OR PURCHASING IS A PLUS.KNOWLEDGE OF NEWSTAR AND IBM TM1 IS A PLUS.\n\n",
    "job_skill_set": [
      "organizational skills",
      "attention to detail",
      "collaboration",
      "communication",
      "relationship building",
      "problem solving",
      "leadership",
      "financial planning",
      "budgeting",
      "financial analysis",
      "cost accounting",
      "forecasting",
      "financial reporting",
      "operational efficiency",
      "project management",
      "accounting procedures",
      "data analysis",
      "knowledge of NewStar",
      "knowledge of IBM TM1",
      "residential home building experience",
      "land acquisition analysis",
      "vendor management",
      "proactive attitude"
    ],
    "short_keywords": [
      "accounting",
      "acquisition",
      "analysis",
      "attention",
      "attitude",
      "budgeting",
      "building",
      "collaboration",
      "communication",
      "cost",
      "data",
      "detail",
      "efficiency",
      "experience",
      "finance",
      "financial",
      "forecasting",
      "home",
      "ibm",
      "knowledge",
      "land",
      "leadership",
      "management",
      "newstar",
      "of",
      "operational",
      "organizational",
      "planning",
      "president",
      "proactive",
      "problem",
      "procedures",
      "project",
      "relationship",
      "reporting",
      "residential",
      "skills",
      "solving",
      "tm1",
      "to",
      "vendor",
      "vice"
    ]
  },
  {
    "job_id": "3894980256",
    "job_title": "Sap Finance Control Consultant",
    "category": "FINANCE",
    "job_description": "JOB SPEC:LONG TERM PROJECT.C2C ROLE100% REMOTEIMPORTANT INTERNATIONAL CLIENT.\nREQUIREMENTS:10+ YEARS OF SAP EXPERIENCE SUPPORTING GENERAL LEDGER IN ADDITION TO AT LEAST 5 OF THE ACCOMPANYING CAPACITIES: ACCOUNTS PAYABLE, ACCOUNTS RECEIVABLE, FINANCIAL ACCOUNTING, FIXED ASSET ACCOUNTING, INTER-COMPANY ACCOUNTING, PROJECT SYSTEM, AND MANAGEMENT ACCOUNTING.UNDERSTANDING OF ACCOUNTING BUSINESS PROCESSES.INVOLVEMENT WITH FI INTEGRATION FOCUSES ON OTHER SAP-BASED ERP MODULES LIKE MM, HR, PP, AND PM.CAPACITY TO COMPREHEND BUSINESS FORMS FROM A CLIENT’S POINT OF VIEW.CAPACITY TO WORK IN A GROUP DOMAIN, VIABLY COOPERATING WITH OTHERS.MUST BE RESULTS-ORIENTED.AT LEAST 5 YEARS OF INVOLVEMENT WITH A FULL CYCLE IMPLEMENTATION IN LARGE ORGANIZATIONS AND AT LEAST ONE (1) END TO END S/4 HANA IMPLEMENTATIONS.EXPERIENCE IN AUTOMOTIVE OR MANUFACTURING COMPANIES IS AN ASSET.EXPERIENCE IN DEVELOPING TEST, CUTOVER AND POST GO-LIVE PLANS FOR THE MODULES OF COMPETENCE (STRATEGY, PLAN, REQUIREMENTS, KPIS, ETC).EXPERIENCE WITH GLOBALLY DISTRIBUTED TEAMS.MUST HAVE STRONG ANALYTICAL SKILLS, BE TEAM-ORIENTED WITH EXCELLENT COMMUNICATION SKILLS.STRONG CUSTOMER ORIENTATION.ABILITY TO WORK INDEPENDENTLY AND EFFICIENTLY, MANAGING TIMELINES AND EXPECTATIONS, AND PRODUCING HIGH-QUALITY DELIVERABLES",
    "job_skill_set": [
      "Financial Accounting",
      "Project System",
      "Management Accounting",
      "Teamwork",
      "Communication",
      "Analytical Skills",
      "Customer Orientation",
      "Results-Oriented",
      "Independence",
      "Time Management",
      "High-Quality Deliverables",
      "SAP",
      "General Ledger",
      "Accounts Payable",
      "Accounts Receivable",
      "Fixed Asset Accounting",
      "Inter-Company Accounting",
      "FI Integration",
      "S/4 HANA",
      "Test Planning",
      "Cutover Planning",
      "Post Go-Live Planning",
      "ERP Modules (MM, HR, PP, PM)"
    ],
    "short_keywords": [
      "accounting",
      "accounts",
      "analytical",
      "asset",
      "communication",
      "consultant",
      "control",
      "customer",
      "cutover",
      "deliverables",
      "erp",
      "fi",
      "finance",
      "financial",
      "fixed",
      "general",
      "golive",
      "hana",
      "highquality",
      "hr",
      "independence",
      "integration",
      "intercompany",
      "ledger",
      "management",
      "mm",
      "modules",
      "orientation",
      "payable",
      "planning",
      "pm",
      "post",
      "pp",
      "project",
      "receivable",
      "resultsoriented",
      "s4",
      "sap",
      "skills",
      "system",
      "teamwork",
      "test",
      "time"
    ]
  },
  {
    "job_id": "3903474308",
    "job_title": "Sr. Finance Analyst",
    "category": "FINANCE",
    "job_description": "WE ARE SEEKING A SR. FINANCE ANALYST TO JOIN OUR RAPIDLY EXPANDING TEAM.\n\nTHE IDEAL CANDIDATE WILL POSSESS PROFOUND EXPERTISE IN EXCEL AND HAVE EXTENSIVE EXPERIENCE IN MODELING REVENUE, EXPENSES, AND FINANCIAL STATEMENTS ACROSS DIVERSE COMPANIES.\n\nTHIS ROLE INVOLVES MANAGING MULTIPLE CLIENT ACCOUNTS AND REQUIRES A PROACTIVE, CLIENT-FRIENDLY APPROACH WITH A STRONG ENTHUSIASM FOR FINANCIAL ANALYSIS.\n\nCANDIDATES SHOULD BE ADEPT IN UTILIZING TOP-OF-THE-LINE SOFTWARE TOOLS TO DELIVER PRECISE FINANCIAL SOLUTIONS.\n\nWE ARE LOOKING FOR A DEDICATED PROFESSIONAL EAGER TO GROW WITH OUR TEAM AND EXCEL IN A DYNAMIC ENVIRONMENT, ALL WHILE MANAGING A GREAT TEAM ENVIRONMENT AND WORK-LIFE BALANCE.",
    "job_skill_set": [
      "financial analysis",
      "client account management",
      "software tools utilization",
      "proactive approach",
      "client-friendly",
      "teamwork",
      "adaptability",
      "excel",
      "financial modeling",
      "enthusiasm",
      "work-life balance"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "analysis",
      "analyst",
      "approach",
      "balance",
      "client",
      "clientfriendly",
      "enthusiasm",
      "excel",
      "finance",
      "financial",
      "management",
      "modeling",
      "proactive",
      "software",
      "sr",
      "teamwork",
      "tools",
      "utilization",
      "worklife"
    ]
  },
  {
    "job_id": "3884436115",
    "job_title": "Oracle Finance  Fusion Lead",
    "category": "FINANCE",
    "job_description": "COMPANY DESCRIPTIONTRUGLOBAL IS A GLOBAL IT CONSULTING AND PROFESSIONAL SERVICES COMPANY BASED IN SAN JOSE, CA. WE SPECIALIZE IN DELIVERING HIGH-QUALITY AND ROBUST IT SOLUTIONS THAT LEVERAGE THE LATEST TECHNOLOGIES AND BEST PRACTICES. OUR TEAM IS PASSIONATE ABOUT TECHNOLOGY AND HAS EXTENSIVE CORPORATE EXPERIENCE TO PROVIDE OUR CLIENTS WITH THE BEST-IN-CLASS SERVICES. WITH A MIX OF ON-SITE, OFFSITE, OR OFFSHORE DELIVERY MODELS, WE ENSURE EFFICIENT PROJECT EXECUTION AND CONSISTENT QUALITY DELIVERABLES.\nROLE DESCRIPTIONTHIS IS A CONTRACT ROLE FOR AN ORACLE FINANCE FUSION LEAD. AS AN ORACLE FINANCE FUSION LEAD, YOU WILL BE RESPONSIBLE FOR MANAGING AND IMPLEMENTING ORACLE HR AND ORACLE APPLICATIONS SOLUTIONS. YOU WILL ALSO BE INVOLVED IN BUSINESS PROCESS CONSULTING AND INTEGRATION ACTIVITIES. THIS IS AN ON-SITE ROLE BASED IN SAN JOSE, CA.\nQUALIFICATIONSEXPERIENCE IN BUSINESS PROCESS CONSULTING AND IMPLEMENTATIONEXPERTISE IN ORACLE HR AND ORACLE APPLICATIONSSTRONG KNOWLEDGE OF INTEGRATION TECHNIQUES AND METHODOLOGIESEXCELLENT PROBLEM-SOLVING AND ANALYTICAL SKILLSSTRONG COMMUNICATION AND INTERPERSONAL SKILLSFAMILIARITY WITH ORACLE FUSION TECHNOLOGY IS A PLUSBACHELOR'S DEGREE IN COMPUTER SCIENCE, INFORMATION TECHNOLOGY, OR RELATED FIELDRELEVANT CERTIFICATIONS IN ORACLE FINANCEQUALIFICATIONS: BACHELOR'S DEGREE IN ACCOUNTING, FINANCE, OR A RELATED FIELD (CPA A PLUS). \nMINIMUM 5 YEARS OF EXPERIENCE IN A FUNCTIONAL FINANCE ROLE, WITH A STRONG FOCUS ON GENERAL LEDGER, FIXED ASSETS, AND CASH MANAGEMENT. \nPROVEN EXPERIENCE WITH ORACLE FUSION APPLICATIONS (FINANCE MODULES) OR SIMILAR ERP SYSTEMS. \nEXCELLENT COMMUNICATION AND INTERPERSONAL SKILLS, WITH THE ABILITY TO BUILD STRONG RELATIONSHIPS WITH DIVERSE STAKEHOLDERS. \nDEMONSTRATED ABILITY TO ASK INSIGHTFUL QUESTIONS AND ACTIVELY LISTEN TO BUSINESS NEEDS. \nSTRONG ANALYTICAL AND PROBLEM-SOLVING SKILLS. \nABILITY TO WORK INDEPENDENTLY AND AS PART OF A TEAM. \nEXPERIENCE WORKING WITH PROFESSIONAL SERVICES FIRMS LIKE PWC IS A PLUS. NEEDS MINIMUM 3 IMPLEMENTATIONS\n\n",
    "job_skill_set": [
      "Problem-Solving",
      "Communication Skills",
      "Interpersonal Skills",
      "Teamwork",
      "Relationship Building",
      "Oracle HR",
      "Oracle Applications",
      "Integration Techniques",
      "Oracle Fusion Technology",
      "General Ledger",
      "Fixed Assets",
      "Cash Management",
      "ERP Systems",
      "Business Process Consulting",
      "Relevant Certifications in Oracle Finance",
      "Analytical Skills",
      "Active Listening",
      "Independence"
    ],
    "short_keywords": [
      "active",
      "analytical",
      "applications",
      "assets",
      "building",
      "business",
      "cash",
      "certifications",
      "communication",
      "consulting",
      "erp",
      "finance",
      "fixed",
      "fusion",
      "general",
      "hr",
      "in",
      "independence",
      "integration",
      "interpersonal",
      "lead",
      "ledger",
      "listening",
      "management",
      "oracle",
      "problemsolving",
      "process",
      "relationship",
      "relevant",
      "skills",
      "systems",
      "teamwork",
      "techniques",
      "technology"
    ]
  },
  {
    "job_id": "3902756637",
    "job_title": "Vice President, Finance Investments",
    "category": "FINANCE",
    "job_description": "COMPANY OVERVIEW:\n\nHILLWOOD INVESTMENT PROPERTIES (HIP) HILLWOOD, A PEROT COMPANY, IS A FULL-SERVICE INDUSTRIAL REAL ESTATE DEVELOPER, INVESTOR, AND ADVISOR, FOCUSING ON INSTITUTIONAL-GRADE INDUSTRIAL PROPERTIES. FROM ACQUISITIONS AND JOINT VENTURES TO DEVELOPMENT, PROPERTY MANAGEMENT AND FUND/ASSET MANAGEMENT, HILLWOOD PROVIDES CREATIVE SOLUTIONS FOR ITS CUSTOMERS AND LONG-TERM VALUE FOR ITS PARTNERS. HILLWOOD HAS EXPERIENCE IN 64 MARKETS ACROSS NORTH AMERICA AND EUROPE AND HAS DEVELOPED AND ACQUIRED 273.1 MILLION SQUARE FEET (Q4-2023). FOR ADDITIONAL INFORMATION, VISIT WWW.HILLWOOD.COM.\n\nPOSITION SUMMARY:\n\nHILLWOOD INVESTMENT PROPERTIES (HIP) IS ACTIVELY SEEKING A VICE PRESIDENT (VP), FINANCE & INVESTMENTS TO JOIN ITS CAPITAL MARKETS FINANCE TEAM BASED IN DALLAS, TEXAS. THE VP WILL PLAY A CRITICAL ROLE IN THE TRANSACTION PROCESS BY COLLABORATING WITH MARKET LEADERS (ML) AND REGIONAL MARKET LEADERS (RML) WITHIN THEIR ASSIGNED GEOGRAPHICAL REGION. UPON IDENTIFICATION OF POTENTIAL OPPORTUNITIES, THE VP WILL PROACTIVELY ENGAGE WITH ML/ RMLS TO ASSESS TRANSACTION FEASIBILITY, PROVIDING EXPERTISE IN FINANCIAL DUE DILIGENCE, UNDERWRITING, AND STRATEGIC DEAL STRUCTURING.\n\nRESPONSIBILITIES:\n\nBE A STRATEGIC FINANCIAL ADVISOR TO MLS AND RMLS, EMPOWERING THEM TO CONCENTRATE ON THEIR CORE TRANSACTIONAL OPERATIONS.COLLABORATE CLOSELY WITH MLS AND RMLS TO EVALUATE KEY FINANCIAL UNDERWRITING METRICS, TRANSACTION CAPITALIZATION, AND REFINE DEAL STRUCTURING STRATEGIES TO OPTIMIZE OUTCOMES.LEAD AND GUIDE ANALYSTS TASKED WITH THE FINANCIAL UNDERWRITING OF NEW AND EXISTING BUSINESS WITHIN THE ASSIGNED REGION ENSURING THOROUGH AND ACCURATE UNDERWRITING IN ADHERENCE WITH INTERNAL FINANCIAL GUIDELINES.DRIVE CONSISTENCY AND ACCURACY IN UNDERWRITING AND OPERATIONAL/INVESTMENT COMMITTEE SUBMISSIONS, OVERSEEING DEAL-RELATED REPORTING METRICS ACROSS THE PURSUIT LIFECYCLE.PROVIDE COMPREHENSIVE TRAINING AND MENTORSHIP TO ANALYSTS AND ASSOCIATES, PROMOTING PROFESSIONAL DEVELOPMENT IN OPERATIONAL AND QUANTITATIVE FINANCIAL ANALYSIS METHODOLOGIES AND TECHNIQUES.OVERSEE THE PREPARATION OF MATERIALS FOR OPERATING COMMITTEE (OC) AND INVESTMENT COMMITTEE (IC) WITH THE ASSISTANCE OF ANALYSTS.PARTNER WITH THE CHIEF LEGAL OFFICER (CLO) TO ADDRESS LEGAL STRUCTURING AND CLUB COMPLIANCE INTRICACIES.MONITOR AND ADVISE ML/ RMLS ON BI-WEEKLY PIPELINE UPDATES, TRACK PURSUIT COST APPROVALS AND ADVISE ON LIMITATIONS WHILE MONITORING OVERALL PROJECT SPEND.OCCASIONALLY TRAVEL TO ML/ RMLS' OFFICES TO ENHANCE COLLABORATION WITH LOCAL TEAMS AND REINFORCE ORGANIZATIONAL COHESION.SERVE AS THE PIVOTAL CONDUIT BETWEEN ML/RMLS AND EXECUTIVE LEADERSHIP (CIO, CFO, PRESIDENT) TO ENSURE ALIGNMENT.\n\nREQUIRED SKILLS AND ABILITIES:\n\nEXCEPTIONAL BUSINESS ACUMEN AND CRITICAL THINKING, ANALYTICAL, AND ORGANIZATIONAL SKILLS WITH METICULOUS ATTENTION TO DETAIL.EXPERT IN FINANCIAL MODELING, UNDERWRITING, AND ANALYSIS, EMPHASIZED BY A PROVEN HISTORY OF EFFECTIVELY MANAGING PROJECTS AND PROVIDING SOUND FINANCIAL RECOMMENDATIONS.ABILITY TO SOLVE COMPLEX PROBLEMS AND FINDING CREATIVE SOLUTIONS.PROVEN TRACK RECORD OF CONSISTENTLY DELIVERING RESULTS ON TIME AND ON BUDGET WITH A HIGH SENSE OF URGENCY.ADEPT IN COLLABORATING WITH CROSS-FUNCTIONAL TEAMS, EXPERTLY COMMUNICATING WITH VARIED STAKEHOLDERS, AND FOSTERING CONSENSUS.EMBODIES A HIGH STANDARD OF PROFESSIONALISM, INTEGRITY, AND ETHICAL CONDUCT, COUPLED WITH STRONG LEADERSHIP CAPABILITIES.EXCELLENT COMMUNICATION AND PRESENTATION SKILLS (BOTH VERBAL AND WRITTEN) TO EFFECTIVELY ENGAGE STAKEHOLDERS.EXCELLENT INTERPERSONAL SKILLS, ENABLING SEAMLESS INTERACTION WITH EXECUTIVE-LEVEL CLIENTS AND INTERNAL COUNTERPARTS.CAN HANDLE SENSITIVE AND CONFIDENTIAL INFORMATION WITH DISCRETION TO PROTECT INTELLECTUAL PROPERTY AND BUSINESS CONFIDENCE.ABILITY TO WORK INDEPENDENTLY MULTITASK AND MANAGE DEADLINES ACROSS CROSS-FUNCTIONAL TEAMS.INNATE DRIVE FOR INNOVATION AND ADAPTABILITY, THRIVING IN DYNAMIC ENTREPRENEURIAL ENVIRONMENTS.PROFICIENT IN MS OFFICE SUITE, PARTICULARLY EXCEL, AND POSSESSES FAMILIARITY WITH CODING LANGUAGES SUCH AS C++ AND PYTHON.\n\nEDUCATION AND EXPERIENCE:\n\nBACHELOR’S DEGREE IN FINANCE, REAL ESTATE, OR A RELATED DISCIPLINE IS REQUIRED.MBA OR ADVANCED DEGREE IS HIGHLY PREFERRED, DEMONSTRATING A COMMITMENT TO CONTINUOUS PERSONAL AND PROFESSIONAL GROWTH.MINIMUM OF 8 YEARS’ EXPERIENCE IN FINANCE, INVESTMENT BANKING, REAL ESTATE, OR ASSOCIATED FIELD REQUIRED.MINIMUM OF 5 YEARS’ EXPERIENCE IN DEAL FINANCIAL DUE DILIGENCE AND ANALYSIS.PREVIOUS MANAGERIAL EXPERIENCE LEADING TEAMS AND COLLABORATING ACROSS DEPARTMENTS OR FUNCTIONS.\n\nEEO STATEMENT:\n\nHILLWOOD IS COMMITTED TO PROVIDING EQUAL OPPORTUNITY IN EMPLOYMENT, TO ALL APPLICANTS AND EMPLOYEES REGARDLESS OF, RACE, COLOR, RELIGION, GENDER, AGE, NATIONAL ORIGIN, MILITARY STATUS, VETERAN STATUS, HANDICAP, PHYSICAL OR MENTAL DISABILITY, SEXUAL ORIENTATION, GENDER IDENTITY, GENETIC INFORMATION OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW.\n\n#HIP",
    "job_skill_set": [
      "financial analysis",
      "project management",
      "MS Office Suite",
      "Excel",
      "business acumen",
      "critical thinking",
      "analytical skills",
      "organizational skills",
      "problem solving",
      "communication",
      "leadership",
      "interpersonal skills",
      "professionalism",
      "adaptability",
      "team collaboration",
      "financial modeling",
      "underwriting",
      "C++",
      "Python",
      "financial due diligence"
    ],
    "short_keywords": [
      "acumen",
      "adaptability",
      "analysis",
      "analytical",
      "business",
      "c",
      "collaboration",
      "communication",
      "critical",
      "diligence",
      "due",
      "excel",
      "finance",
      "financial",
      "interpersonal",
      "investments",
      "leadership",
      "management",
      "modeling",
      "ms",
      "office",
      "organizational",
      "president",
      "problem",
      "professionalism",
      "project",
      "python",
      "skills",
      "solving",
      "suite",
      "team",
      "thinking",
      "underwriting",
      "vice"
    ]
  },
  {
    "job_id": "3902828623",
    "job_title": "Fractional Finance Consultant",
    "category": "FINANCE",
    "job_description": "VACO HAS PARTNERED WITH A LOCAL AIRCRAFT COMPANY SEARCHING FOR A FRACTIONAL FINANCE CONSULTANT. THIS IS A TEMPORARY POSITION THAT REQUIRES A SEASONED PROFESSIONAL WITH A STRONG BACKGROUND IN FINANCE AND ACCOUNTING. IF YOU ARE READY TO MAKE AN IMMEDIATE IMPACT, PLEASE APPLY TODAY! \n\nJOB TITLE: FRACTIONAL FINANCE CONSULTANT (PART TIME, 20-30 HOURS PER WEEK) \nLOCATION: SCOTTSDALE (FLEXIBLE SCHEDULE) \nPAY RATE: $70 - $80 PER HOUR \n\nRESPONSIBILITIES: PROVIDE FINANCIAL OVERSIGHT AND RECOMMENDATIONS TO FOUNDER/OWNER SUPERVISE ACCOUNTING AND FINANCE STAFF SCALE BUSINESS OPERATIONS TO ACCOMMODATE BUSINESS GROWTH ACT AS A FINANCIAL PARTNER TO THE OWNER \nQUALIFICATIONS: BACHELOR'S DEGREE IN ACCOUNTING, FINANCE, BUSINESS ADMINISTRATION, OR RELATED FIELD PREFERREDPROVEN EXPERIENCE IN FINANCE AND ACCOUNTING ROLES EXCELLENT COMMUNICATION SKILLS ABILITY TO COMMIT TO DURATION AND NEEDS OF PROJECT",
    "job_skill_set": [
      "finance",
      "accounting",
      "financial oversight",
      "business operations",
      "financial recommendations",
      "supervision",
      "project management",
      "communication",
      "commitment",
      "partnership"
    ],
    "short_keywords": [
      "accounting",
      "business",
      "commitment",
      "communication",
      "consultant",
      "finance",
      "financial",
      "fractional",
      "management",
      "operations",
      "oversight",
      "partnership",
      "project",
      "recommendations",
      "supervision"
    ]
  },
  {
    "job_id": "3905299266",
    "job_title": "Account Executive, Finance Cloud",
    "category": "FINANCE",
    "job_description": "ABOUT RIPPLING\n\nRIPPLING GIVES BUSINESSES ONE PLACE TO RUN HR, IT, AND FINANCE. IT BRINGS TOGETHER ALL OF THE WORKFORCE SYSTEMS THAT ARE NORMALLY SCATTERED ACROSS A COMPANY, LIKE PAYROLL, EXPENSES, BENEFITS, AND COMPUTERS. FOR THE FIRST TIME EVER, YOU CAN MANAGE AND AUTOMATE EVERY PART OF THE EMPLOYEE LIFECYCLE IN A SINGLE SYSTEM.\n\nTAKE ONBOARDING, FOR EXAMPLE. WITH RIPPLING, YOU CAN HIRE A NEW EMPLOYEE ANYWHERE IN THE WORLD AND SET UP THEIR PAYROLL, CORPORATE CARD, COMPUTER, BENEFITS, AND EVEN THIRD-PARTY APPS LIKE SLACK AND MICROSOFT 365—ALL WITHIN 90 SECONDS.\n\nBASED IN SAN FRANCISCO, CA, RIPPLING HAS RAISED $1.2B FROM THE WORLD’S TOP INVESTORS—INCLUDING KLEINER PERKINS, FOUNDERS FUND, SEQUOIA, GREENOAKS, AND BEDROCK—AND WAS NAMED ONE OF AMERICA'S BEST STARTUP EMPLOYERS BY FORBES.\n\nABOUT THE ROLE\n\nAS A FINANCE CLOUD ACCOUNT EXECUTIVE AT RIPPLING, YOU ARE A PROVEN HUNTER & CLOSER WITH A TRACK RECORD OF QUOTA ATTAINMENT AND OVERACHIEVEMENT. AS AN EARLY MEMBER OF THIS TEAM, YOU WILL HAVE THE OPPORTUNITY TO HELP DEFINE THE SALES STRATEGY THAT FUELS THE GROWTH OF THE COMPANY!\n\nWHAT YOU WILL DO\n\nDRIVE REVENUE FOR RIPPLING AT ALL POINTS OF THE SALES CYCLE, INCLUDING PROSPECTING, PRODUCT DEMONSTRATIONS, ONBOARDING, CLOSE, AND CONSUMPTION. DEVELOP STRATEGIES FOR PROSPECTING AND CLOSING OPPORTUNITIES WITHIN YOUR BOOK OF BUSINESSLEVERAGE SALES METHODOLOGIES TO UNCOVER CUSTOMER NEEDS AND PAIN POINTSARTICULATE RIPPLING’S SPEND MANAGEMENT VALUE PROPOSITION BY USING THE APPROPRIATE SALES QUALIFICATION STANDARDSOWN SALES ACTIVITY AND MONTHLY REVENUE FORECASTINGCOLLABORATE WITH PRODUCT, DESIGN, MARKETING AND ENGINEERING TEAMS TO INCORPORATE CUSTOMER FEEDBACK\n\nWHAT YOU WILL NEED\n\nMINIMUM 2 YEARS OF QUOTA-CARRYING EXPERIENCE IN A FULL CYCLE CLOSING ROLE WITH STRONG PROSPECTING, QUALIFYING, NEGOTIATING, AND CLOSING SKILLSMINIMUM 1 YEAR EXPERIENCE SELLING TO MID-MARKET SIZED BUSINESSESABILITY TO DISCUSS RIPPLING'S VALUE PROPOSITION WITH C-LEVEL EXECUTIVES, FINANCE TEAMS, AND DECISION MAKERSEXPERIENCE WITH OUTBOUND PROSPECTING TO OUR EXISTING CUSTOMER BASE AND CONDUCTING PRODUCT DEMONSTRATIONSCONSULTATIVE SALES APPROACH AND COMFORTABLE LEVERAGING ANALYTICAL & QUANTITATIVE SKILLSCONSISTENT TRACK RECORD OF HITTING OR EXCEEDING SALES TARGETS IN A FAST-PACED ENVIRONMENTHIGH ADAPTABILITY AND UNDERSTANDING OF CHANGE WITHIN THE EVOLUTION OF A STARTUPEXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS\n\nADDITIONAL INFORMATION\n\nRIPPLING IS AN EQUAL OPPORTUNITY EMPLOYER. WE ARE COMMITTED TO BUILDING A DIVERSE AND INCLUSIVE WORKFORCE AND DO NOT DISCRIMINATE BASED ON RACE, RELIGION, COLOR, NATIONAL ORIGIN, ANCESTRY, PHYSICAL DISABILITY, MENTAL DISABILITY, MEDICAL CONDITION, GENETIC INFORMATION, MARITAL STATUS, SEX, GENDER, GENDER IDENTITY, GENDER EXPRESSION, AGE, SEXUAL ORIENTATION, VETERAN OR MILITARY STATUS, OR ANY OTHER LEGALLY PROTECTED CHARACTERISTICS, RIPPLING IS COMMITTED TO PROVIDING REASONABLE ACCOMMODATIONS FOR CANDIDATES WITH DISABILITIES WHO NEED ASSISTANCE DURING THE HIRING PROCESS. TO REQUEST A REASONABLE ACCOMMODATION, PLEASE EMAIL ACCOMODATIONS@RIPPLING.COM\n\nRIPPLING HIGHLY VALUES HAVING EMPLOYEES WORKING IN-OFFICE TO FOSTER A COLLABORATIVE WORK ENVIRONMENT AND COMPANY CULTURE. FOR OFFICE-BASED EMPLOYEES (EMPLOYEES WHO LIVE WITHIN A 40 MILE RADIUS OF A RIPPLING OFFICE), RIPPLING CONSIDERS WORKING IN THE OFFICE, AT LEAST THREE DAYS A WEEK UNDER CURRENT POLICY, TO BE AN ESSENTIAL FUNCTION OF THE EMPLOYEE'S ROLE.\n\nTHIS ROLE WILL RECEIVE A COMPETITIVE ON-TARGET EARNINGS (BASE SALARY + SALES COMMISSION) + BENEFITS + EQUITY. THE ON-TARGET EARNINGS* US-BASED EMPLOYEES WILL BE 50/50 COMMISSION SPLIT FOR BASE/VARIABLE PAY FOR THE RANGE LISTED BELOW.\n\nA VARIETY OF FACTORS ARE CONSIDERED WHEN DETERMINING SOMEONE’S COMPENSATION–INCLUDING A CANDIDATE’S PROFESSIONAL BACKGROUND, EXPERIENCE, AND LOCATION. FINAL OFFER AMOUNTS MAY VARY FROM THE AMOUNTS LISTED BELOW.\n\nCOMMISSION IS NOT GUARANTEED\n\nTHE PAY RANGE FOR THIS ROLE IS:\n\n215,000 - 215,000 USD PER YEAR(TIER 1 )\n\n200,000 - 200,000 USD PER YEAR(TIER 2 )\n\n200,000 - 200,000 USD PER YEAR(TIER 3)",
    "job_skill_set": [
      "revenue forecasting",
      "analytical skills",
      "quantitative skills",
      "communication",
      "collaboration",
      "adaptability",
      "problem solving",
      "sales methodologies",
      "prospecting",
      "negotiating",
      "closing",
      "product demonstrations",
      "consultative sales",
      "customer feedback incorporation"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "analytical",
      "closing",
      "cloud",
      "collaboration",
      "communication",
      "consultative",
      "customer",
      "demonstrations",
      "executive",
      "feedback",
      "finance",
      "forecasting",
      "incorporation",
      "methodologies",
      "negotiating",
      "problem",
      "product",
      "prospecting",
      "quantitative",
      "revenue",
      "sales",
      "skills",
      "solving"
    ]
  },
  {
    "job_id": "3891251481",
    "job_title": "Associate / Associate Director of Asset Management, Finance, and Investor Relations",
    "category": "FINANCE",
    "job_description": "ABOUT GRANITE CAPITAL GROUP GRANITE CAPITAL GROUP (GCG) PROVIDES AN ARRAY OF COMMERCIAL REAL ESTATE SERVICES TO ACCREDITED INVESTORS INCLUDING SPONSORED INVESTMENT FUNDS, ADVISORY SERVICES INCLUDING STRUCTURING AND EXECUTING 1031 EXCHANGES, ASSET MANAGEMENT, REAL ESTATE PORTFOLIO ANALYSIS, AND CONSULTING. GCG WAS FORMED TO PURSUE OPPORTUNISTIC REAL ESTATE INVESTMENTS IN THE WESTERN UNITED STATES WITH A FOCUS ON VALUE-ADD REPOSITIONING, GROUND-UP DEVELOPMENT, AND ASSET MANAGEMENT OF MULTIFAMILY, INDUSTRIAL, AND RETAIL ASSETS.  OUR INVESTMENT PARTNERS COMPRISE HIGH-NET-WORTH FAMILIES, INDIVIDUAL ACCREDITED INVESTORS, AND SELECT INSTITUTIONAL INVESTORS. WE ARE PROUD TO WORK WITH OVER 200 INVESTMENT PARTNERS, THE MAJORITY OF WHOM ARE REPEAT INVESTORS IN OUR PROJECTS.  DESCRIPTION WE ARE SEEKING A TALENTED AND EXPERIENCED INDIVIDUAL TO JOIN OUR TEAM AS AN ASSOCIATE / ASSOCIATE DIRECTOR, SPECIALIZING IN ASSET MANAGEMENT, FINANCE, AND INVESTOR RELATIONS. THE SUCCESSFUL CANDIDATE WILL PLAY A CRUCIAL ROLE IN MANAGING OUR PORTFOLIO OF MULTIFAMILY PROPERTIES, OPTIMIZING FINANCIAL PERFORMANCE, AND MAINTAINING STRONG RELATIONSHIPS WITH INVESTORS. KEY RESPONSIBILITIES  ASSET MANAGEMENTOVERSEE THE DAY-TO-DAY OPERATIONS AND PERFORMANCE OF ASSIGNED MULTIFAMILY PROPERTIES.DEVELOP AND IMPLEMENT ASSET MANAGEMENT STRATEGIES TO MAXIMIZE PROPERTY VALUE AND INVESTOR RETURNS.CONDUCT REGULAR PROPERTY INSPECTIONS AND PERFORMANCE REVIEWS TO IDENTIFY OPPORTUNITIES FOR IMPROVEMENT.COORDINATE WITH PROPERTY MANAGEMENT TEAMS TO ENSURE THAT OPERATIONAL GOALS AND FINANCIAL TARGETS ARE MET.PARTICIPATE IN THE DEVELOPMENT AND IMPLEMENTATION OF OUR STRATEGIC PLAN TO MAXIMIZE THE PERFORMANCE AND VALUE OF THE INVESTMENT PORTFOLIO INCLUDING FINANCIAL PLANNING, BUDGETING, AND FORECASTING OF OUR PORTFOLIO; ENSURING ACCURACY, EFFICIENCY, AND ALIGNMENT WITH COMPANY OBJECTIVES.  BUSINESS WRITINGWRITE CLEAR, CONCISE, AND COMPELLING BUSINESS DOCUMENTS, INCLUDING INVESTMENT MEMORANDUMS, PROPERTY SUMMARIES, AND INVESTOR COMMUNICATIONS.ENSURE ACCURACY AND ATTENTION TO DETAIL IN ALL WRITTEN MATERIALS, MAINTAINING THE HIGHEST STANDARDS OF PROFESSIONALISM AND QUALITY.\nFINANCIAL ANALYSIS AND REPORTINGCONDUCT THOROUGH FINANCIAL ANALYSIS, RISK ASSESSMENTS, AND MARKET RESEARCH TO IDENTIFY OPPORTUNITIES AND MITIGATE POTENTIAL CHALLENGES. PREPARE DETAILED FINANCIAL ANALYSES, INCLUDING CASH FLOW PROJECTIONS, BUDGETING, AND VARIANCE ANALYSIS.REVIEW MODELING AND FINANCIAL ANALYSIS FOR ALL NEW AND EXISTING PROJECTS.MONITOR FINANCIAL PERFORMANCE METRICS AND PROVIDE RECOMMENDATIONS FOR OPTIMIZING REVENUE AND REDUCING EXPENSES.GENERATE COMPREHENSIVE FINANCIAL REPORTS FOR INTERNAL STAKEHOLDERS AND EXTERNAL INVESTORS. INVESTOR RELATIONSDRIVE INVESTOR RELATIONS INITIATIVES INCLUDING COMMUNICATION, MARKETING STRATEGY, WRITING INVESTOR MEMORANDUMS AND REPORTS, AND CREATING PRESENTATIONS TO EFFECTIVELY ENGAGE AND INFORM INVESTORS. SERVE AS THE PRIMARY POINT OF CONTACT FOR INVESTOR INQUIRIES AND COMMUNICATIONS.PREPARE INVESTOR PRESENTATIONS, REPORTS, AND UPDATES TO COMMUNICATE INVESTMENT PERFORMANCE AND STRATEGY.CULTIVATE AND MAINTAIN STRONG RELATIONSHIPS WITH INVESTORS THROUGH REGULAR COMMUNICATION AND ENGAGEMENT ACTIVITIES. QUALIFICATIONS AND PROVEN SKILLS BACHELOR'S DEGREE IN FINANCE, BUSINESS ADMINISTRATION, ECONOMICS, OR RELATED FIELD; MBA, CPA OR CFA PREFERRED. PROVEN EXPERIENCE (7+ YEARS) IN ASSET MANAGEMENT, FINANCE, ACQUISITIONS AND INVESTOR RELATIONS WITHIN THE REAL ESTATE INDUSTRY WITH A FOCUS ON MULTIFAMILY PROPERTIES. STRONG LEADERSHIP SKILLS WITH A MINIMUM OF 3+ YEARS IN A LEADERSHIP ROLE AND THE ABILITY TO INSPIRE AND MOTIVATE TEAMS TO ACHIEVE OUTSTANDING RESULTS. COMMITMENT TO INTEGRITY, TRANSPARENCY, AND ETHICAL CONDUCT IN ALL ASPECTS OF THE ROLE. SELF-STARTER THAT TAKES INITIATIVE, WORKS WELL INDEPENDENTLY, AND MANAGES WORKLOAD TO EFFICIENTLY MEET STRATEGIC AND OPERATIONAL INITIATIVES AND BENCHMARKS. EXCEPTIONAL ANALYTICAL ABILITIES AND ATTENTION TO DETAIL, WITH A TRACK RECORD OF EFFECTIVELY MANAGING COMPLEX FINANCIAL MODELS AND ANALYSES. EXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLS, WITH THE ABILITY TO ARTICULATE COMPLEX CONCEPTS CLEARLY AND CONCISELY TO INVESTORS THROUGH OFFERING MEMORANDUMS AND REGULAR INVESTOR COMMUNICATIONS.  ",
    "job_skill_set": [
      "financial analysis",
      "financial reporting",
      "budgeting",
      "risk assessment",
      "market research",
      "business writing",
      "cash flow projections",
      "variance analysis",
      "strategic planning",
      "presentation skills",
      "leadership",
      "communication",
      "analytical thinking",
      "attention to detail",
      "initiative",
      "integrity",
      "teamwork",
      "self-starter",
      "asset management",
      "real estate",
      "financial modeling",
      "investor relations",
      "property management"
    ],
    "short_keywords": [
      "analysis",
      "analytical",
      "and",
      "assessment",
      "asset",
      "associate",
      "attention",
      "budgeting",
      "business",
      "cash",
      "communication",
      "detail",
      "director",
      "estate",
      "finance",
      "financial",
      "flow",
      "initiative",
      "integrity",
      "investor",
      "leadership",
      "management",
      "market",
      "modeling",
      "of",
      "planning",
      "presentation",
      "projections",
      "property",
      "real",
      "relations",
      "reporting",
      "research",
      "risk",
      "selfstarter",
      "skills",
      "strategic",
      "teamwork",
      "thinking",
      "to",
      "variance",
      "writing"
    ]
  },
  {
    "job_id": "3903477702",
    "job_title": "Finance / Project Assistant",
    "category": "FINANCE",
    "job_description": "JOB DESCRIPTION:\n\nOUR AUTOMATION & DIGITALIZATION DIVISION IN ALPHARETTA, GA, IS LOOKING TO WELCOME A FINANCE / PROJECT ASSISTANT WHO HAS A PASSION FOR DETAIL-ORIENTED WORK AND A KNACK FOR ORGANIZATION TO CONTRIBUTE TO THE SUCCESS OF BOTH OUR FINANCE AND PROJECT TEAMS. AS THE SUCCESSFUL CANDIDATE YOU WILL PLAY A CRUCIAL ROLE IN ENSURING THE ACCURACY AND TIMELINESS OF FINANCIAL REPORTING, AS WELL AS ASSISTING IN VARIOUS FINANCIAL AND PROJECT ADMINISTRATION TASKS.WHAT YOU WILL BE DOINGHERE’S AN OVERVIEW OF YOUR RESPONSIBILITIES AND HOW YOU CAN LEVERAGE YOUR EXPERTISE:ENSURES THE TIMELY AND ACCURATE GENERATION OF CRITICAL REPORTS.FACILITATES THE PURCHASING ACTIVITIES AND COORDINATES WITH BUYERS, INCLUDING CLARIFYING SCHEDULES, SHIP DATES, AND LOGISTICS.PROVIDES ASSISTANCE IN ORDER ENTRY AND PROJECT CREATION WITHIN PROJECT SERVER AND SAP.SUPPORTS MONTHLY INVOICING PROCESSES, INCLUDING TIME & MATERIAL (T&M) INVOICING.CODES AND INVOICES FOR SUBCONTRACTORS AND OTHER GLOBAL RESOURCE POOLS AS NEEDED.CREATES NEW EMPLOYEE NUMBERS AND MAINTAINING HEDGING FOR FOREIGN CURRENCY.MANAGES PROJECT DOCUMENTATION CREATION AND SUBMITTALS.CONTRIBUTES TO PROCESS CREATION AND IMPROVEMENT INITIATIVES.OTHER AD HOC TASKS AND DUTIES AS ASSIGNED. WHAT WE HAVE TO OFFERIN EXCHANGE FOR YOUR COMMITMENT, WE OFFER THE FOLLOWING:PAID MATERNITY PROGRAM TO SUPPORT EMPLOYEES DURING THIS SIGNIFICANT AND EXCITING LIFE EVENTA DYNAMIC, COLLABORATIVE AND INNOVATIVE WORK ENVIRONMENT WHERE YOUR EXPERTISE AND IDEAS ARE VALUEDTRAINING AND MENTORSHIP OPPORTUNITIES AND FINANCIAL SUPPORT FOR PROFESSIONAL DEVELOPMENT AND CERTIFICATIONS, INCLUDING A LINKEDIN LEARNING LICENSECLEAR CAREER PATHS FOR CAREER GROWTH, INTERNAL PROMOTIONS, AND OPPORTUNITIES TO TAKE ON MORE RESPONSIBILITIESCOMPENSATION THAT INCREASES WITH TECHNICAL CAPABILITY AND EXPERTISE AND A COMPREHENSIVE BENEFITS PACKAGE, INCLUDING COMPANY-MATCHED 401KCOMPETITIVE PAID-TIME-OFF POLICIES THAT INCLUDES VACATION, PAID HOLIDAYS, AND SICK DAYSA POSITIVE AND COLLABORATIVE CULTURE THAT FOCUSES ON OUR CORE VALUES AND BEHAVIORSCOMPANY SWAG SHOP OFFERING A RANGE OF ANDRITZ-BRANDED MERCHANDISE TO CULTIVATE TEAM SPIRIT AND PRIDEREGULAR COMPANY EVENTS AND SOCIAL ACTIVITIES TO FOSTER CAMARADERIEA REMOTE AND/OR HYBRID WORK ENVIRONMENT TO PROMOTE WORK-LIFE BALANCE WHAT WE'RE LOOKING FORWHEN SELECTING CANDIDATES, WE WILL BE LOOKING FOR THE FOLLOWING:HIGHER EDUCATION IN ACCOUNTING OR FINANCE PREFERRED, ALTHOUGH NOT REQUIREDMINIMUM 3 YEARS' COMPARABLE OR RELATED EXPERIENCESAP EXPERIENCE PREFERREDABILITY TO EFFECTIVELY MANAGE MULTIPLE TASKS OR PROJECTS SIMULTANEOUSLY WHILE MEETING ASSIGNED DEADLINES.KNOWLEDGE OF ACCOUNTING PROCESSES, PROCEDURES, AND BEST PRACTICES IS AN ASSET.EXCELLENT INTERPERSONAL AND COMMUNICATION SKILLS, BOTH VERBAL AND WRITTEN.CUSTOMER-FOCUSED WITH A STRONG ABILITY TO COLLABORATE WITHIN A TEAM.SELF-MOTIVATED, ADAPTABLE, AND QUICK TO LEARN NEW CONCEPTS.PROFICIENCY WITH COMPUTER APPLICATIONS AND PROGRAMS RELEVANT TO THE POSITION, SUCH AS THE MICROSOFT OFFICE SUITE.STRONG ATTENTION TO DETAIL AND OUTSTANDING FOLLOW-UP SKILLS. WE LOOK FORWARD TO RECEIVING YOUR APPLICATION AND EXPLORING THE OPPORTUNITY TO WORK TOGETHER! PPADN1 PPADU1 PPADD1",
    "job_skill_set": [
      "financial reporting",
      "accounting processes",
      "Microsoft Office Suite",
      "foreign currency hedging",
      "process improvement",
      "attention to detail",
      "communication",
      "team collaboration",
      "time management",
      "adaptability",
      "self-motivation",
      "SAP",
      "project documentation",
      "invoicing",
      "order entry"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "assistant",
      "attention",
      "collaboration",
      "communication",
      "currency",
      "detail",
      "documentation",
      "entry",
      "finance",
      "financial",
      "foreign",
      "hedging",
      "improvement",
      "invoicing",
      "management",
      "microsoft",
      "office",
      "order",
      "process",
      "processes",
      "project",
      "reporting",
      "sap",
      "selfmotivation",
      "suite",
      "team",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3904722854",
    "job_title": "Director, R&D Finance",
    "category": "FINANCE",
    "job_description": "ABOUT THE ROLE\n\nAS A LEADING AI CYBERSECURITY FIRM ON THE CUTTING EDGE OF TECHNOLOGY AND INNOVATION, OUR COMPANY SAFEGUARDS DIGITAL INTEGRITY WITH UNPARALLELED AI-DRIVEN SOLUTIONS. AMIDST OUR RAPID GROWTH TRAJECTORY, WE SEEK A STRATEGIC AND VISIONARY DIRECTOR OF R&D FINANCE TO OVERSEE FINANCIAL STRATEGIES THAT UNDERPIN OUR ENGINEERING AND PRODUCT DEVELOPMENT (EPD) INITIATIVES. THIS ROLE IS PIVOTAL IN SHAPING FINANCIAL PRACTICES THAT DIRECTLY CONTRIBUTE TO OUR AMBITIOUS GOALS, ENHANCING OUR MARKET POSITION, AND DRIVING ROI FROM OUR ENGINEERING EFFORTS.\n\nWHAT YOU WILL DO\n\nSTRATEGIC FINANCIAL LEADERSHIP: SERVE AS A KEY FINANCIAL STRATEGIST FOR THE EPD AND STO DIVISIONS, CRAFTING FINANCIAL MODELS THAT ALIGN WITH THE COMPANY'S STRATEGIC OBJECTIVES. ELEVATE FINANCIAL PLANNING FROM MERE BUDGET MANAGEMENT TO STRATEGIC INVESTMENT IN INNOVATION, ENSURING EVERY DOLLAR SPENT MAXIMIZES ENGINEERING ROI AND CONTRIBUTES TO SIGNIFICANT ARR GROWTH.COMPREHENSIVE BUDGET OVERSIGHT: CHAMPION THE DEVELOPMENT AND EXECUTION OF COMPREHENSIVE BUDGET STRATEGIES ACROSS ALL EPD DOMAINS, INCORPORATING SOPHISTICATED FORECASTING, RESOURCE ALLOCATION, AND OPERATIONAL EXPENSE MANAGEMENT TO SUPPORT SCALABLE GROWTH. ENSURE THESE STRATEGIES ARE ROBUST, FLEXIBLE, AND ALIGNED WITH LONG-TERM CORPORATE VISIONS.ADVANCED INVESTMENT ANALYSIS: SPEARHEAD ADVANCED INVESTMENT ANALYSIS, APPLYING RIGOROUS FINANCIAL AND RISK ASSESSMENT METHODOLOGIES TO EVALUATE AND PRIORITIZE R&D PROJECTS. EMPLOY A STRATEGIC LENS TO INVESTMENT DECISIONS, FOCUSING ON LONG-TERM VALUE CREATION AND MARKET DIFFERENTIATION.STRATEGIC PARTNERSHIP AND COLLABORATION: ACT AS A PRIMARY FINANCIAL LIAISON BETWEEN EPD, CORPORATE FP&A, ACCOUNTING, AND EXTERNAL STAKEHOLDERS. FORGE STRATEGIC PARTNERSHIPS TO REFINE FINANCIAL MODELS AND OPERATIONAL EFFICIENCY, ENSURING ALIGNMENT WITH GLOBAL FINANCIAL STRATEGIES AND COMPLIANCE.GLOBAL STRATEGY AND EFFICIENCY OPTIMIZATION: LEVERAGE DEEP ANALYTICAL INSIGHTS TO REFINE AND OPTIMIZE GLOBAL OPERATIONS, PARTICULARLY FOCUSING ON THE STRATEGIC SIGNIFICANCE OF THE INDIA OFFICE. IMPLEMENT BENCHMARKING AND BEST PRACTICES TO DRIVE CONTINUAL IMPROVEMENT IN EPD EFFICIENCY AND EFFECTIVENESS.EXECUTIVE DECISION SUPPORT: PROVIDE EXECUTIVE-LEVEL SUPPORT BY DELIVERING ACTIONABLE FINANCIAL INSIGHTS AND ANALYSES THAT DRIVE STRATEGIC DECISION-MAKING. EVALUATE COMPLEX SCENARIOS TO INFORM RESOURCE ALLOCATION, TECHNOLOGICAL INVESTMENTS, AND STRATEGIC PROJECT SELECTIONS.FINANCIAL STEWARDSHIP AND GOVERNANCE: UPHOLD THE HIGHEST STANDARDS OF FINANCIAL INTEGRITY AND GOVERNANCE ACROSS R&D OPERATIONS. ENSURE A CULTURE OF ACCOUNTABILITY, TRANSPARENCY, AND STRATEGIC FORESIGHT IN FINANCIAL PLANNING AND ANALYSIS PRACTICES.INNOVATION AND INFRASTRUCTURE SAVINGS: IDENTIFY AND EXECUTE INNOVATIVE PROJECTS TO ACHIEVE AGGRESSIVE INFRASTRUCTURE SAVINGS TARGETS WITHOUT COMPROMISING ON GROWTH OR SERVICE QUALITY. REPORT ON PROGRESS AND ADAPT STRATEGIES TO MEET EVOLVING TECHNOLOGICAL AND MARKET DEMANDS.INFRASTRUCTURE FORECASTING: MANAGE DETAILED INFRASTRUCTURE FORECASTS AND CONTROL SPENDING TO MEET GROSS MARGIN EXPECTATIONS. FORECAST NON-COST OF REVENUE (COR) INFRASTRUCTURE AND UNDERLYING UNIT ECONOMICS, INCLUDING PER PRODUCT MARGINS.\n\nMUST HAVES\n\nA MINIMUM OF 10 YEARS OF EXPERIENCE IN FINANCIAL MANAGEMENT WITHIN TECHNOLOGY OR CYBERSECURITY SECTORS, WITH AT LEAST 5 YEARS IN A LEADERSHIP ROLE OVERSEEING R&D OR PRODUCT DEVELOPMENT FINANCE.A MASTER'S DEGREE IN FINANCE, BUSINESS ADMINISTRATION, OR A RELATED FIELD. RELEVANT CERTIFICATIONS (E.G., CFA, CPA) ARE ADVANTAGEOUS.EXPERIENCE SUCCESSFULLY SUPPORTING AND ADDING VALUE TO GLOBAL ORGANIZATIONS DEMONSTRATED ABILITY TO DEVELOP AND EXECUTE FINANCIAL STRATEGIES THAT SUPPORT TECHNOLOGICAL INNOVATION AND COMPANY GROWTH.PROVEN TRACK RECORD OF EFFECTIVE CROSS-FUNCTIONAL AND EXECUTIVE-LEVEL COLLABORATION.EXCEPTIONAL ANALYTICAL, STRATEGIC THINKING, AND PROBLEM-SOLVING SKILLS.STRONG LEADERSHIP QUALITIES WITH THE ABILITY TO INSPIRE AND DRIVE ORGANIZATIONAL CHANGE.ADVANCED PROFICIENCY IN FINANCIAL MODELING, ANALYTICS TOOLS, AND ERP SYSTEMS.\n\nNICE TO HAVE\n\nEXPERIENCE IN THE CYBER-SECURITY AND SAAS INDUSTRIESEXPERIENCE WORKING IN A FAST GROWTH PRIVATE COMPANY IN SERIES C OR ABOVE\n\n",
    "job_skill_set": [
      "financial management",
      "financial modeling",
      "investment analysis",
      "budget management",
      "risk assessment",
      "strategic planning",
      "strategic thinking",
      "problem solving",
      "leadership",
      "collaboration",
      "communication",
      "analytical skills",
      "analytics tools",
      "ERP systems",
      "forecasting",
      "resource allocation",
      "financial governance",
      "infrastructure forecasting",
      "organizational change management"
    ],
    "short_keywords": [
      "allocation",
      "analysis",
      "analytical",
      "analytics",
      "assessment",
      "budget",
      "change",
      "collaboration",
      "communication",
      "director",
      "erp",
      "finance",
      "financial",
      "forecasting",
      "governance",
      "infrastructure",
      "investment",
      "leadership",
      "management",
      "modeling",
      "organizational",
      "planning",
      "problem",
      "rd",
      "resource",
      "risk",
      "skills",
      "solving",
      "strategic",
      "systems",
      "thinking",
      "tools"
    ]
  },
  {
    "job_id": "3905207168",
    "job_title": "Product Strategist - Embedded Finance",
    "category": "FINANCE",
    "job_description": "CALLING ALL INNOVATORS – FIND YOUR FUTURE AT FISERV.\n\nWE’RE FISERV, A GLOBAL LEADER IN FINTECH AND PAYMENTS, AND WE MOVE MONEY AND INFORMATION IN A WAY THAT MOVES THE WORLD. WE CONNECT FINANCIAL INSTITUTIONS, CORPORATIONS, MERCHANTS, AND CONSUMERS TO ONE ANOTHER MILLIONS OF TIMES A DAY – QUICKLY, RELIABLY, AND SECURELY. ANY TIME YOU SWIPE YOUR CREDIT CARD, PAY THROUGH A MOBILE APP, OR WITHDRAW MONEY FROM THE BANK, WE’RE INVOLVED. IF YOU WANT TO MAKE AN IMPACT ON A GLOBAL SCALE, COME MAKE A DIFFERENCE AT FISERV.\n\nJOB TITLE\n\nPRODUCT STRATEGIST - EMBEDDED FINANCE\n\nWHAT DOES A SUCCESSFUL PRODUCT STRATEGIST - EMBEDDED FINANCE DO AT FISERV?\n\nAS A SUCCESSFUL PRODUCT STRATEGIST, EMBEDDED FINANCE, YOU WILL INTEGRATE FINANCIAL SERVICES INTO COMMERCE PLATFORMS TO BETTER SERVE OUR CLIENTS AND THEIR CUSTOMERS.\n\nWHAT YOU WILL DO\n\nYOU WILL PARTNER AND ADVISE OUR CLIENTS ON STRATEGIES THAT WILL OPTIMIZE WITH THEIR CASH FLOW AND ACHIEVE THEIR BUSINESS GOALS.\n\nLEAD CROSS FUNCTIONAL TEAMS TO PRODUCTIZE AND BUILD SCALABLE PROCESSES FOR SERVICES ENABLED BY DIFFERENT UNDERLYING SOLUTIONS.PARTNER WITH SALES, BILLING, IMPLEMENTATIONS, PRICING AND SERVICE TEAMS TO BUILD BEST OF BREED END-TO-END EXPERIENCES FOR CLIENTS.IDENTIFY AND GAIN CONSENSUS FOR OPERATIONAL IMPROVEMENTS ACROSS CLIENT IMPLEMENTATION TEAMS.PARTNER WITH THE BILLING TEAM TO DESIGN STREAMLINED BILLING COVERING MULTIPLE SOLUTIONS THAT ARE PART OF OUR EMBEDDED FINANCE OFFERING.COLLABORATE WITH FINANCE TEAMS TO CAPTURE AND FORECAST COSTS AND REVENUE ASSOCIATED WITH EMBEDDED FINANCE IMPLEMENTATIONS AND SERVICING.\n\nWHAT YOU WILL NEED TO HAVE\n\nA MINIMUM OF 4 YEARS OF PAYMENTS PROCESSING EXPERIENCE.A MINIMUM OF 4 YEARS OF EMBEDDED FINANCE EXPERIENCE.PAYMENT PLATFORMS AND BANKING EXPERIENCE.BACHELOR’S DEGREE IN BUSINESS, FINANCE, ECONOMICS, COMPUTER SCIENCE OR RELATED FIELD.EXPERIENCE MANAGING OPERATIONS IN ACQUIRER / PROCESSOR ENVIRONMENT WITH VERTICAL SAAS OR ENTERPRISE MERCHANTS AS CLIENTS.EXPERIENCE NEGOTIATING AND TRACKING SLAS ACROSS MULTI-PROCESSOR PLATFORMS.\n\nWHAT WOULD BE GREAT TO HAVE\n\nFAMILIARITY WITH PAYMENTS TECHNOLOGY, APIS AND SOFTWARE DEVELOPMENT.EXPERIENCE COLLABORATING WITH FINANCE TEAMS TO CAPTURE AND FORECAST COSTS AND REVENUE ASSOCIATED WITH EMBEDDED FINANCE IMPLEMENTATIONS AND SERVICING.\n\nPERKS AT WORK\n\nWE’RE #FISVPROUD OF OUR COMMITMENT TO YOUR OVERALL WELL-BEING WITH A GROWING OFFERING OF PHYSICAL, MENTAL, EMOTIONAL, AND FINANCIAL BENEFITS FROM DAY ONE.MAINTAIN A HEALTHY WORK-LIFE BALANCE WITH PAID HOLIDAYS, GENEROUS TIME OFF POLICIES, INCLUDING UNLIMITED RECHARGE & REFUEL FOR QUALIFYING ASSOCIATES, AND FREE COUNSELING THROUGH OUR EAP.PLAN FOR YOUR FUTURE WITH COMPETITIVE SALARIES, THE FISERV 401(K) SAVINGS PLAN, AND OUR EMPLOYEE STOCK PURCHASE PLAN.RECOGNIZE AND BE RECOGNIZED BY COLLEAGUES WITH OUR LIVING PROOF PROGRAM WHERE YOU CAN EXCHANGE POINTS FOR A VARIETY OF REWARDS.PRIORITIZE YOUR HEALTH WITH A VARIETY OF MEDICAL, DENTAL, VISION, LIFE, AND DISABILITY INSURANCE OPTIONS AND A RANGE OF WELL-BEING RESOURCES THROUGH OUR FUEL YOUR LIFE PROGRAM.ADVANCE YOUR CAREER WITH TRAINING, DEVELOPMENT, CERTIFICATION, AND INTERNAL MOBILITY OPPORTUNITIES.JOIN EMPLOYEE RESOURCE GROUPS THAT PROMOTE OUR DIVERSE AND INCLUSIVE CULTURE WHERE ASSOCIATES CAN SHARE PERSPECTIVES, EXCHANGE IDEAS, AND ELEVATE CAREERS.\n\nSALARY RANGE\n\n$96,200.00 - $164,900.00\n\nTHESE PAY RANGES APPLY TO EMPLOYEES WORKING IN NEW JERSEY. PAY RANGES FOR EMPLOYEES WORKING IN OTHER STATES MAY DIFFER.\n\nTHIS ROLE IS NOT ELIGIBLE TO BE PERFORMED IN COLORADO, CALIFORNIA, HAWAII, NEW YORK OR WASHINGTON.\n\nPLEASE NOTE THAT SALARY RANGES PROVIDED FOR THIS ROLE ON EXTERNAL JOB BOARDS ARE SALARY ESTIMATES MADE BY OUTSIDE PARTIES AND MAY NOT BE ACCURATE.\n\nTHANK YOU FOR CONSIDERING EMPLOYMENT WITH FISERV. PLEASE\n\nAPPLY USING YOUR LEGAL NAMECOMPLETE THE STEP-BY-STEP PROFILE AND ATTACH YOUR RESUME (EITHER IS ACCEPTABLE, BOTH ARE PREFERABLE).\n\nWHAT YOU SHOULD KNOW ABOUT US\n\nFISERV IS A GLOBAL LEADER IN PAYMENTS AND FINANCIAL TECHNOLOGY WITH MORE THAN 40,000 ASSOCIATES PROUDLY SERVING CLIENTS IN MORE THAN 100 COUNTRIES. AS ONE OF FORTUNE® MAGAZINE'S \"WORLD'S MOST ADMIRED COMPANIES™\" 9 OF THE LAST 10 YEARS, ONE OF FAST COMPANY’S MOST INNOVATIVE COMPANIES, AND A TOP SCORER ON BLOOMBERG’S GENDER-EQUALITY INDEX, WE ARE COMMITTED TO INNOVATION AND EXCELLENCE.\n\nOUR COMMITMENT TO DIVERSITY AND INCLUSION\n\nFISERV IS AN EQUAL OPPORTUNITY EMPLOYER, AND WE WELCOME AND ENCOURAGE DIVERSITY IN OUR WORKFORCE THAT REFLECTS OUR WORLD. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, PROTECTED VETERAN STATUS, OR ANY OTHER CATEGORY PROTECTED BY LAW.\n\nWE WILL ENSURE THAT INDIVIDUALS WITH DISABILITIES ARE PROVIDED REASONABLE ACCOMMODATION TO PARTICIPATE IN THE JOB APPLICATION OR INTERVIEW PROCESS, TO PERFORM ESSENTIAL JOB FUNCTIONS, AND TO RECEIVE OTHER BENEFITS AND PRIVILEGES OF EMPLOYMENT. PLEASE CONTACT US TO REQUEST ACCOMMODATION.\n\nWARNING ABOUT FAKE JOB POSTS\n\nPLEASE BE AWARE OF FRAUDULENT JOB POSTINGS THAT ARE NOT AFFILIATED WITH FISERV. FRAUDULENT JOB POSTINGS MAY BE USED BY CYBER CRIMINALS TO TARGET YOUR PERSONALLY IDENTIFIABLE INFORMATION AND/OR TO STEAL MONEY OR FINANCIAL INFORMATION.\n\nANY COMMUNICATIONS FROM A FISERV REPRESENTATIVE WILL COME FROM A LEGITIMATE BUSINESS EMAIL ADDRESS. WE WILL NOT HIRE THROUGH TEXT MESSAGE, SOCIAL MEDIA, OR EMAIL ALONE, AND ANY INTERVIEWS WILL BE CONDUCTED IN PERSON OR THROUGH A SECURE VIDEO CALL. WE WON’T ASK YOU FOR SENSITIVE INFORMATION NOR WILL WE ASK YOU TO PAY ANYTHING DURING THE HIRING PROCESS. WE ALSO WON’T SEND YOU A CHECK TO CASH ON FISERV’S BEHALF.\n\nIF YOU SEE SUSPICIOUS ACTIVITY OR BELIEVE THAT YOU HAVE BEEN THE VICTIM OF A JOB POSTING SCAM, YOU SHOULD REPORT IT TO YOUR LOCAL FBI FIELD OFFICE OR TO THE FBI’S INTERNET CRIME COMPLAINT CENTER.",
    "job_skill_set": [
      "operations management",
      "cost forecasting",
      "revenue forecasting",
      "strategic thinking",
      "collaboration",
      "communication",
      "problem solving",
      "leadership",
      "client advisory",
      "payments processing",
      "embedded finance",
      "payment platforms",
      "banking",
      "SLA negotiation",
      "API familiarity",
      "software development",
      "consensus building"
    ],
    "short_keywords": [
      "advisory",
      "api",
      "banking",
      "building",
      "client",
      "collaboration",
      "communication",
      "consensus",
      "cost",
      "development",
      "embedded",
      "familiarity",
      "finance",
      "forecasting",
      "leadership",
      "management",
      "negotiation",
      "operations",
      "payment",
      "payments",
      "platforms",
      "problem",
      "processing",
      "product",
      "revenue",
      "sla",
      "software",
      "solving",
      "strategic",
      "strategist",
      "thinking"
    ]
  },
  {
    "job_id": "3894996838",
    "job_title": "SAP Product Manager (S/4 HANA - RTR Finance )",
    "category": "FINANCE",
    "job_description": "CLOUDIOUS LLC IS ONE OF THE FASTEST EMERGING IT SOLUTIONS AND SERVICES COMPANY HEADQUARTERED IN SAN JOSE, CA WITH THEIR GLOBAL OFFICES IN CANADA, EMEA & APAC.\nWE ARE CURRENTLY HIRING A SEASONED SAP PRODUCT MANAGER (S/4 HANA - RTR FINANCE ) WHO COMES WITH A STRONG CONSULTING MINDSET\n\nSAP PRODUCT MANAGER (S/4 HANA - RTR FINANCE )BELLEVUE WA (ONSITE)12+ MONTHS CONTRACT\nEXPERIENCE: 10+ \nMANDATORY SKILLS - PRODUCT MANAGEMENT,SAP ERP,FINANCIAL ACCOUNTING,STAKEHOLDER MANAGEMENT\nEXPERIENCE AND EDUCATION REQUIREMENTS:BACHELOR’S DEGREE IN COMPUTER SCIENCE, BUSINESS OR RELATED; MASTER’S DEGREE A PLUSEXPERIENCE WITH SAP S4/HANA OR ORACLE CLOUD ERP A PLUSRTR /FICO EXPERT WITH ERP AND S/4HANA EXPERIENCEPREFERRED SIX SIGMA/LEAD EXPERIENCE OR CERTIFIED PRODUCT MANAGER\n5+ YEARS OF 7 YEARS OF RELEVANT PRODUCT MANAGEMENT EXPERIENCE IN AN AGILE SOFTWARE PRODUCT DEVELOPMENT ENVIRONMENT.STRATEGYAND NEGOTIATE PRIORITIZATION OF DELIVERY ACROSS NUMEROUS TECHNOLOGY TEAMS TO SUPPORT CONTINUING IMPROVEMENTS IN THE RECORD TO REPORT VALUE STREAMS PROCESSES THROUGH ERP IMPLEMENTATION.THE END-TO-END BUSINESS PROCESSES AND THE ERP AND OTHER CONNECTED APPLICATIONS; CONTRIBUTE TO SETTING STRATEGY FOR CONTINUOUS IMPROVEMENT OF PROCESS ENABLED BY TECHNOLOGY.AS THE LEAD OR CONTRIBUTING PRODUCT MANAGER ON MULTIPLE STRATEGIC PROJECTS PRESENTING AND DRIVING ENABLING TECHNOLOGY DECISIONS FOR CLIENT SYSTEMS.BUSINESS STRATEGIES TO TECHNOLOGY DOMAINS FOR DELIVERY, LEVERAGING WELL-DEFINED STRUCTURE OF CLIENT BUSINESS PROCESSES, PRODUCTS, AND CAPABILITIES.AS INNOVATION EVANGELIST BY BEING A THOUGHT LEADER IN THE APPLICATION AND SCALING OF TECHNICAL IDEAS; UTILIZE SEPARATE TECHNOLOGIES, AND VERTICAL DEPARTMENTS TO OPTIMIZE THE FLOW OF PRODUCTS AND SERVICES THROUGH ENTIRE VALUE STREAMS.ANALYSIS OF QUANTITATIVE AND QUALITATIVE DATA TO IDENTIFY ROOT CAUSE OF ISSUES AND ASSESS OPPORTUNITY SIZE AND IMPACT.ANALYZING FUTURE-STATE CAPABILITIES, PERFORMANCE, AND SOLUTION DESIGNS OF IN-HOUSE AND EXTERNAL TOOLS TO INFLUENCE BUILD VS. BUY DECISIONS.THE TOTAL COST OF OWNERSHIP (TCO) FOR EACH PLATFORM/APPLICATION, ASSIST WITH COST-BENEFIT / RETURN ON INVESTMENT / NPV ANALYSIS, TO SUPPORT DECISION MAKING.CUSTOMER INSIGHTS FOR HELPING BUILD PRODUCT VISION, STRATEGY, ROADMAP, PRIORITIES.CUSTOMERS PRIORITIES AND BE A STRONG INTERNAL AND EXTERNAL CUSTOMER REPRESENTATIVE.SEAMLESSLY INTO AN ENVIRONMENT AND CULTURE THAT PRIORITIZES A CUSTOMER-FIRST MENTALITY, FOSTERING A TEAM ATMOSPHERE DEDICATED TO UNDERSTANDING AND MEETING THE NEEDS OF OUR CUSTOMERS & TECHNOLOGYALL ASPECTS OF THE SOFTWARE DEVELOPMENT PROCESS, FROM DEFINING THE STRATEGY AND ARCHITECTURE THROUGH DEPLOYMENT AND SUPPORT.ERP PRODUCT/PLATFORM STRATEGY INTO ACTIONABLE PLANS BY CRAFTING COMPREHENSIVE FEATURE DESCRIPTIONS AND USER STORIES THAT ARE EASILY DIGESTIBLE FOR THE DEVELOPMENT TEAM.WITH SCRUM MASTER AND DEV LEADERS TO CRAFT, ARCHITECT AND ASSEMBLE EFFECTIVE PRODUCTS FOR AGILE DELIVERY TEAMS.TO KEY AGILE CEREMONIES: PROGRAM INCREMENT (PI) PLANNING / BIG ROOM PLANNING; SYSTEM DEMO; INSPECT AND ADAPT (I&A), ETC.WITH ERP AND INTEGRATION DEVELOPMENT AND EXECUTION TEAMS TO BUILD AND COMMUNICATE ANTICIPATED RELEASE SCHEDULES.FEATURE AND STORY ELABORATION ACTIVITIES ACROSS ALL AGILE TEAMS THROUGHOUT EXECUTION.IN RUNNING BETA AND PILOT PROGRAMS WITH EARLY-STAGE PRODUCTS AND SAMPLES.FINANCE, ACCOUNTING, TAX AND OTHER PARTNER TEAMS WITH PRODUCT OR TECHNICAL KNOWLEDGE AND ADDITIONAL DOCUMENTATION.PROACTIVE INDIVIDUAL CAPABLE OF CHAMPIONING PRODUCT VISION, STRATEGY, AND ROADMAP ALIGNED WITH BUSINESS GOALS AND OBJECTIVES. EQUALLY COMFORTABLE ROLLING UP SLEEVES TO DELVE INTO THE DETAILS, PROVIDING HANDS-ON SUPPORT TO ENSURE THE TEAM SUCCESSFULLY ACCOMPLISHES ITS TASKS.REQUIREMENTS:BUSINESS AND TECHNICAL COMMUNICATION SKILLS, BOTH WRITTEN AND ORAL, AND THE ABILITY TO CONVEY RESULTS IN A PERSUASIVE MANNER AND AT THE APPROPRIATE LEVEL OF DETAIL.ABOUT TELECOMMUNICATIONS INDUSTRY, BUSINESS PROCESSES, STRATEGIC TECHNOLOGIES, AND INDUSTRY LEADING PRACTICESSUCCESS IN DELIVERING SOFTWARE WITH AGILE SCRUM METHODOLOGIES AND OTHER COMMONLY USED TOOLS.REQUIREMENTS ELICITATION, AND PROVEN WRITING SKILLS INCLUDING THE ABILITY TO WRITE CONCISELY AND CLEARLY FOR DIFFERENT AUDIENCES.WITH AGILE BACKLOG/PROJECT MANAGEMENT TOOLS.WITH SUCCESSIVE ELABORATION AND ABILITY TO DEVELOP INITIATIVES, FEATURES AND USER STORIES THAT THE DEVOPS TEAMS CAN INGEST.IN DELIVERING LARGE AND SOPHISTICATED BUSINESS/TECHNOLOGY INITIATIVES AS PRODUCT MANAGER OR LEAD TECHNOLOGY ROLE.TRACK RECORD OF EFFICIENTLY CONNECTING WITH LEADERSHIP, WHILE EMPLOYING A HIGH DEGREE OF COLLABORATION AND INFLUENCE.WRITTEN AND VERBAL COMMUNICATION SKILLS WITH ABILITY TO PRESENT SOPHISTICATED TECHNICAL INFORMATION IN A CLEAR AND CONCISE MANNER TO A VARIETY OF AUDIENCES INCLUDING EXECUTIVES AND NON-TECHNICAL LEADERS.OF CONTROL DESIGN AND DOCUMENTATION, AND SOX COMPLIANCE ORGANIZATIONAL SKILLS TO MANAGE, PRIORITIZE AND EXECUTE ON COMPETING ACTIVITIES TO NEGOTIATE BETWEEN TEAMS AND REACH CONSENSUS AND SUPPORT.",
    "job_skill_set": [
      "Financial Accounting",
      "Data Analysis",
      "Cost-Benefit Analysis",
      "Communication",
      "Collaboration",
      "Problem Solving",
      "Customer Focus",
      "Leadership",
      "Adaptability",
      "Strategic Thinking",
      "Teamwork",
      "SAP ERP",
      "Product Management",
      "Stakeholder Management",
      "S/4 HANA",
      "Agile Methodologies",
      "Requirements Elicitation",
      "ERP Implementation",
      "Technical Writing",
      "Project Management Tools",
      "SOX Compliance",
      "Six Sigma",
      "Oracle Cloud ERP",
      "Negotiation",
      "Influence"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "agile",
      "analysis",
      "cloud",
      "collaboration",
      "communication",
      "compliance",
      "costbenefit",
      "customer",
      "data",
      "elicitation",
      "erp",
      "finance",
      "financial",
      "focus",
      "hana",
      "implementation",
      "influence",
      "leadership",
      "management",
      "manager",
      "methodologies",
      "negotiation",
      "oracle",
      "problem",
      "product",
      "project",
      "requirements",
      "rtr",
      "s4",
      "sap",
      "sigma",
      "six",
      "solving",
      "sox",
      "stakeholder",
      "strategic",
      "teamwork",
      "technical",
      "thinking",
      "tools",
      "writing"
    ]
  },
  {
    "job_id": "3903845850",
    "job_title": "Finance Manager, Ops Finance IPAT",
    "category": "FINANCE",
    "job_description": "DESCRIPTION\n\nARE YOU PASSIONATE ABOUT OPTIMIZING FREE CASH FLOWS AND MAXIMIZING WORKING CAPITAL EFFICIENCY ON A GLOBAL SCALE?\n\nJOIN OUR DYNAMIC TEAM AS WE REVOLUTIONIZE OUR FINANCIAL STRATEGIES TO MANAGE CASH FLOWS. AS A FINANCE MANAGER, YOU WILL PLAY A PIVOTAL ROLE IN DRIVING TRANSFORMATIVE INITIATIVES THAT IMPROVE FREE CASH FLOW MANAGEMENT, STREAMLINE PROCESSES, AND EMPOWER INFORMED DECISION-MAKING.\n\nLEARNING OPPORTUNITIES\n\nGAIN EXPOSURE TO COMPLEX GLOBAL OPERATIONS, HONING YOUR SKILLS IN FINANCIAL ANALYSIS, STRATEGIC PLANNING, AND RISK MANAGEMENT.COLLABORATE WITH CROSS-FUNCTIONAL TEAMS, LEARNING FROM SEASONED PROFESSIONALS IN FINANCE, OPERATIONS, AND TECHNOLOGY.DEVELOP EXPERTISE IN DATA ANALYTICS AND AUTOMATION, LEVERAGING CUTTING-EDGE TOOLS AND TECHNIQUES TO DRIVE CONTINUOUS IMPROVEMENT.STAY AHEAD OF INDUSTRY TRENDS AND BEST PRACTICES, ATTENDING CONFERENCES AND WORKSHOPS TO EXPAND YOUR KNOWLEDGE AND NETWORK.TAKE ON LEADERSHIP OPPORTUNITIES, DRIVING CHANGE AND INNOVATION WITHIN THE ORGANIZATION WHILE ENHANCING YOUR OWN PROFESSIONAL DEVELOPMENT.\n\nKEY JOB RESPONSIBILITIES\n\n DRIVE PLANNING AND REPORTING OF WORLDWIDE OPERATIONS WORKING CAPITAL, ENSURING ACCURACY AND TIMELINESS IN FINANCIAL DATA ANALYSIS. DEVELOP INNOVATIVE STRATEGIES TO IMPROVE FREE CASH FLOWS, LEVERAGING MARKET TRENDS AND BUSINESS INSIGHTS TO DRIVE SUSTAINABLE GROWTH. COLLABORATE CLOSELY WITH BUSINESS AND FINANCE TEAMS TO IDENTIFY OPPORTUNITIES FOR OPTIMIZING PAY-TERMS AND ENHANCING CASH FLOW MANAGEMENT. DRIVE THE AUTOMATION OF THE PLANNING AND REPORTING FRAMEWORK AND MODELS, UTILIZING ADVANCED TECHNOLOGY TO STREAMLINE PROCESSES AND INCREASE EFFICIENCY. MAINTAIN STRONG CONTROLLERSHIP OF WORKING CAPITAL, IMPLEMENTING ROBUST CONTROLS AND PROCEDURES TO MITIGATE RISKS AND ENSURE COMPLIANCE. BUILD AND MAINTAIN A COMPREHENSIVE PLANNING AND REPORTING SUITE, PROVIDING ACTIONABLE INSIGHTS TO SUPPORT STRATEGIC DECISION-MAKING AT ALL LEVELS OF THE ORGANIZATION.\n\nA DAY IN THE LIFE\n\n START THE DAY BY REVIEWING KEY FINANCIAL METRICS AND PERFORMANCE INDICATORS RELATED TO WORKING CAPITAL AND CASH FLOW. COLLABORATE WITH CROSS-FUNCTIONAL TEAMS TO GATHER DATA AND INSIGHTS FOR ONGOING PROJECTS AND INITIATIVES. ANALYZE CASH FLOW FORECASTS AND IDENTIFY AREAS FOR IMPROVEMENT OR OPTIMIZATION. LEAD MEETINGS WITH BUSINESS STAKEHOLDERS TO DISCUSS STRATEGIES FOR ENHANCING CASH FLOW EFFICIENCY AND MANAGING WORKING CAPITAL EFFECTIVELY. WORK CLOSELY WITH THE FINANCE TEAM TO AUTOMATE REPORTING PROCESSES AND DEVELOP DASHBOARDS FOR MONITORING FINANCIAL PERFORMANCE. ENGAGE IN CONTINUOUS LEARNING AND PROFESSIONAL DEVELOPMENT ACTIVITIES TO STAY UPDATED ON INDUSTRY TRENDS AND BEST PRACTICES.\n\nWE ARE OPEN TO HIRING CANDIDATES TO WORK OUT OF ONE OF THE FOLLOWING LOCATIONS:\n\nARLINGTON, VA, USA | ATLANTA, GA, USA | AUSTIN, TX, USA | BELLEVUE, WA, USA | LOS ANGELES, CA, USA | NASHVILLE, TN, USA | SEATTLE, WA, USA | SIMI VALLEY, CA, USA | WEST HOLLYWOOD, CA, USA\n\nBASIC QUALIFICATIONS\n\n BA OR BS IN FINANCE, ACCOUNTING, BUSINESS, ECONOMICS, OR A HIGHLY ANALYTICAL FIELD (E.G., ENGINEERING, MATH, COMPUTER SCIENCE) 5+ YEARS OF FINANCE EXPERIENCE, OR MASTER’S DEGREE AND 3+ YEARS OF FINANCE EXPERIENCE\n\nPREFERRED QUALIFICATIONS\n\n 5+ YEARS OF IDENTIFYING INCOMPLETE OR INACCURATE DATA, IDENTIFYING THE ROOT CAUSE AND CREATING/IMPLEMENTING AN ESCALATION PLAN EXPERIENCE 5+ YEARS OF SOLVING COMPLEX BUSINESS CHALLENGES BY DELIVERING ACCURATE AND TIMELY FINANCIAL MODELS, ANALYSIS, AND RECOMMENDATIONS THAT HAVE A PROVEN IMPACT ON BUSINESS (E.G., FINANCIAL SAVINGS, OPERATIONAL IMPROVEMENTS, OR CUSTOMER BENEFITS) EXPERIENCE MBA, CA OR CPA EXPERIENCE IN WORKING CAPITAL MANAGEMENT AND ACCOUNTS PAYABLE OPERATIONS, DEMONSTRATING PROFICIENCY IN OPTIMIZING CASH FLOW EXPERIENCE WORKING WITH LARGE-SCALE DATA MINING AND REPORTING TOOLS (EXAMPLES: SQL, MS ACCESS, ESSBASE, COGNOS) AND OTHER FINANCIAL SYSTEMS (EXAMPLES: ORACLE, SAP, LAWSON, JD EDWARDS) EXPERIENCE DELIVERING FORECASTING, BUDGETING, AND VARIANCE ANALYSIS, AND DATA INTERPRETATION OF RESULTS\n\nAMAZON IS COMMITTED TO A DIVERSE AND INCLUSIVE WORKPLACE. AMAZON IS AN EQUAL OPPORTUNITY EMPLOYER AND DOES NOT DISCRIMINATE ON THE BASIS OF RACE, NATIONAL ORIGIN, GENDER, GENDER IDENTITY, SEXUAL ORIENTATION, PROTECTED VETERAN STATUS, DISABILITY, AGE, OR OTHER LEGALLY PROTECTED STATUS. FOR INDIVIDUALS WITH DISABILITIES WHO WOULD LIKE TO REQUEST AN ACCOMMODATION, PLEASE VISIT HTTPS://WWW.AMAZON.JOBS/EN/DISABILITY/US.\n\nPURSUANT TO THE LOS ANGELES FAIR CHANCE ORDINANCE, WE WILL CONSIDER FOR EMPLOYMENT QUALIFIED APPLICANTS WITH ARREST AND CONVICTION RECORDS.\n\nOUR COMPENSATION REFLECTS THE COST OF LABOR ACROSS SEVERAL US GEOGRAPHIC MARKETS. THE BASE PAY FOR THIS POSITION RANGES FROM $81,100/YEAR IN OUR LOWEST GEOGRAPHIC MARKET UP TO $179,500/YEAR IN OUR HIGHEST GEOGRAPHIC MARKET. PAY IS BASED ON A NUMBER OF FACTORS INCLUDING MARKET LOCATION AND MAY VARY DEPENDING ON JOB-RELATED KNOWLEDGE, SKILLS, AND EXPERIENCE. AMAZON IS A TOTAL COMPENSATION COMPANY. DEPENDENT ON THE POSITION OFFERED, EQUITY, SIGN-ON PAYMENTS, AND OTHER FORMS OF COMPENSATION MAY BE PROVIDED AS PART OF A TOTAL COMPENSATION PACKAGE, IN ADDITION TO A FULL RANGE OF MEDICAL, FINANCIAL, AND/OR OTHER BENEFITS. FOR MORE INFORMATION, PLEASE VISIT HTTPS://WWW.ABOUTAMAZON.COM/WORKPLACE/EMPLOYEE-BENEFITS. THIS POSITION WILL REMAIN POSTED UNTIL FILLED. APPLICANTS SHOULD APPLY VIA OUR INTERNAL OR EXTERNAL CAREER SITE.\n\n\nCOMPANY - AMAZON.COM SERVICES LLC - A57\n\nJOB ID: A2617587",
    "job_skill_set": [
      "financial analysis",
      "strategic planning",
      "data analytics",
      "automation",
      "cash flow management",
      "budgeting",
      "data interpretation",
      "leadership",
      "collaboration",
      "problem solving",
      "communication",
      "adaptability",
      "critical thinking",
      "continuous learning",
      "risk management",
      "working capital management",
      "financial modeling",
      "SQL",
      "MS Access",
      "Oracle",
      "SAP",
      "variance analysis"
    ],
    "short_keywords": [
      "access",
      "adaptability",
      "analysis",
      "analytics",
      "automation",
      "budgeting",
      "capital",
      "cash",
      "collaboration",
      "communication",
      "continuous",
      "critical",
      "data",
      "finance",
      "financial",
      "flow",
      "interpretation",
      "ipat",
      "leadership",
      "learning",
      "management",
      "manager",
      "modeling",
      "ms",
      "ops",
      "oracle",
      "planning",
      "problem",
      "risk",
      "sap",
      "solving",
      "sql",
      "strategic",
      "thinking",
      "variance",
      "working"
    ]
  },
  {
    "job_id": "3887708351",
    "job_title": "Strategic Finance Analyst",
    "category": "FINANCE",
    "job_description": "WHY MOZILLA?\n\nMOZILLA CORPORATION IS THE NON-PROFIT-BACKED TECHNOLOGY COMPANY THAT HAS SHAPED THE INTERNET FOR THE BETTER OVER THE LAST 25 YEARS. WE MAKE PIONEERING BRANDS LIKE FIREFOX, THE PRIVACY-MINDED WEB BROWSER, AND POCKET, A SERVICE FOR KEEPING UP WITH THE BEST CONTENT ONLINE. NOW, WITH MORE THAN 225 MILLION PEOPLE AROUND THE WORLD USING OUR PRODUCTS EACH MONTH, WE’RE SHAPING THE NEXT 25 YEARS OF TECHNOLOGY AND HELPING TO RECLAIM AN INTERNET BUILT FOR PEOPLE, NOT COMPANIES. OUR WORK FOCUSES ON DIVERSE AREAS INCLUDING AI, SOCIAL MEDIA, SECURITY AND MORE. AND WE’RE DOING THIS WHILE NEVER LOSING OUR FOCUS ON OUR CORE MISSION – TO MAKE THE INTERNET BETTER FOR PEOPLE.\n\nTHE MOZILLA CORPORATION IS WHOLLY OWNED BY THE NON-PROFIT 501(C) MOZILLA FOUNDATION. THIS MEANS WE AREN’T BEHOLDEN TO ANY SHAREHOLDERS — ONLY TO OUR MISSION. ALONG WITH THOUSANDS OF VOLUNTEER CONTRIBUTORS AND COLLABORATORS ALL OVER THE WORLD, MOZILLIANS DESIGN, BUILD AND DISTRIBUTE OPEN-SOURCE SOFTWARE THAT ENABLES PEOPLE TO ENJOY THE INTERNET ON THEIR TERMS.\n\nMOZILLA FINANCE IS RESPONSIBLE FOR STRATEGIC RESOURCE ALLOCATION AND DAY-TO-DAY FINANCIAL OPERATIONS AS MOZILLA SCALES ITS MISSION IMPACT WITH NEW AND EXISTING PRODUCTS, TECHNOLOGY AND BUSINESS MODELS TO BETTER SERVE USERS AND ADVANCE AN AGENDA FOR A HEALTHIER INTERNET.\n\nABOUT THIS TEAM AND ROLE\n\nWE ARE SEEKING A FINANCIAL ANALYST TO JOIN OUR STRATEGIC FINANCE TEAM FOCUSED ON REVENUE AND ARR. THIS ROLE WILL REPORT TO OUR STRATEGIC FINANCE LEAD AND PARTNER DIRECTLY WITH LEADERS IN OUR SALES, PRODUCT MARKETING, REVENUE, AND CUSTOMER SUCCESS ORGANIZATIONS. THE ROLE WILL FOCUS ON ANALYZING AND FORECASTING ARR AND REVENUE AND PLAY A CRITICAL PART IN DRIVING INFORMED DECISION-MAKING BY PROVIDING ACCURATE AND ACTIONABLE INSIGHTS RELATED TO ARR PERFORMANCE. THIS ROLE WILL PARTNER ACROSS GTM EXECUTIVE LEADERSHIP AND WILL HELP INFLUENCE STRATEGIC DECISIONS AND GROWTH OPPORTUNITIES FOR EACH OF THE GTM FUNCTIONS. THIS IS A FANTASTIC OPPORTUNITY FOR A CANDIDATE WHO WANTS TO BE PART OF A DYNAMIC FP&A ORGANIZATION THAT IS SCALING FOR THE FUTURE.\n\nTHE IDEAL CANDIDATE WILL HAVE A STRONG BACKGROUND IN FINANCIAL ANALYSIS, STRATEGIC PLANNING, AND A DEEP UNDERSTANDING OF THE DRIVERS OF SUBSCRIPTION-BASED BUSINESS MODELS. THEY WILL HAVE EXPERIENCE WITH REVENUE MODELING FOR SEVERAL PRODUCTS AND PRICING STRUCTURES, AND THEY WILL HAVE A STRONG TRACK RECORD OF PROVIDING STRUCTURE, CONSOLIDATION, AND ANALYSIS OF ARR & REVENUE DATA.\n\nWHAT YOU’LL DO\n\nCONDUCT A THOROUGH ANALYSIS OF ANNUAL RECURRING REVENUE, INCLUDING TREND ANALYSIS, VARIANCE EXPLANATIONS, AND PERFORMANCE METRICS TO MONITOR OVERALL BUSINESS PERFORMANCE.COLLABORATE WITH CROSS-FUNCTIONAL TEAMS TO DRIVE ACCURATE ARR FORECASTS THAT ALIGN WITH OVERALL COMPANY GUARDRAILS.BUILD STANDARDIZED ARR REPORTING FOR THE EXECUTIVE LEADERSHIP TEAM TO PROVIDE VISIBILITY, DRIVE OWNERSHIP, AND PROACTIVELY IDENTIFY RISKS AND OPPORTUNITIES.OWN TOP-LINE REVENUE MODELS FOR MULTIPLE PRODUCTS AND PARTNER WITH REVENUE ACCOUNTING TO EXPAND RECOGNIZED REVENUE REPORTING.CONTINUOUSLY REFINE AND IMPROVE FP&A PROCESSES RELATED TO ARR & REVENUE ANALYSIS, FORECASTING, AND REPORTING.SUPPORT THE DEVELOPMENT OF DEAL METRICS TO REPORT TRENDS IN PRICING, PRODUCT, CUSTOMER LIFECYCLE, AND COMMISSION TARGETS.PARTNER CLOSELY WITH REVENUE AND MARKETING TEAMS TO SET STRATEGY AROUND PRICING AND PROMOTIONAL INITIATIVES.BE AN EFFECTIVE AND MEMORABLE PRESENTER. USE STORYTELLING WITH CONTENT AND DELIVERY TO PERSUADE AND INSPIRE TEAMS TO TAKE ACTION AND PRIORITIZE RESOURCES.\n\nWHAT YOU’LL BRING\n\n4-6 YEARS OF FP&A OR FINANCE EXPERIENCE (SAAS AND/OR HIGH-GROWTH COMPANIES PREFERRED BUT NOT REQUIRED)STRONG UNDERSTANDING OF SUBSCRIPTION-BASED BUSINESS MODELS AND KEY METRICS SUCH AS MRR, CHURN, CAC, AND LTVADVANCED PROFICIENCY IN EXCEL MODELING SKILLS (INCLUDING VBA, PIVOT TABLES, ARRAY FUNCTIONS, POWER PIVOTS, ETC) – TO DEVELOP COMPLEX AND SCALABLE MODELS WITH SENSIBLE ASSUMPTIONS FROM LARGE DATA SETSADDITIONALLY, PROFICIENCY IN GOOGLE WORKSPACE, PARTICULARLY GOOGLE SHEETS AND SLIDES, IS ESSENTIAL. KNOWLEDGE OF SQL AND EXPERIENCE WITH GOOGLE LOOKER/BIGQUERY FOR DATA ANALYSIS AND VISUALIZATION ARE HIGHLY DESIRABLE.FAMILIARITY WITH COMBINING AND MANIPULATING DATA TABLES AND SETS – JOINS, UNIONS, ETC.EXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLSSTRONG INTERPERSONAL SKILLS AND ABILITY TO INFLUENCE THROUGH CREATING FELLOWSHIPBACHELOR'S DEGREE IN A QUANTITATIVE FIELD SUCH AS FINANCE, STATISTICS, ENGINEERING, ECONOMICS, OR A RELATED FIELD REQUIRED WITH 6+ YEARS OF WORK EXPERIENCE.\n\nSUCCESS FACTORS:\n\nYOU WILL LIKELY BE SUPER HAPPY AND PRODUCTIVE IN THIS ROLE IF YOU...\n\nACTION-ORIENTED. YOU GET THINGS DONE AND CAN MOVE QUICKLY AND SMARTLY TO SET CHALLENGING GOALS AND THEN DEVELOP PLANS TO DELIVER AND ACHIEVE THEMYOU KNOW HOW TO CRUNCH DATA IN EXCEL AND CREATE COMPELLING PRESENTATIONS. YOU'RE COMFORTABLE WITH NUMBERS AND HOW TO USE THEM TO GET RESULTSHAVE A STRONG BUILDER MENTALITY AND CAN BRING ORDER TO CHAOSARE ABLE TO EFFECTIVELY CHALLENGE THE STATUS QUO AND PLAN INSIGHTFUL ROADMAPS\n\nWHAT YOU’LL GET\n\nGENEROUS PERFORMANCE-BASED BONUS PLANS TO ALL ELIGIBLE EMPLOYEES - WE SHARE IN OUR SUCCESS AS ONE TEAMRICH MEDICAL, DENTAL, AND VISION COVERAGEGENEROUS RETIREMENT CONTRIBUTIONS WITH 100% IMMEDIATE VESTING (REGARDLESS OF WHETHER YOU CONTRIBUTE)QUARTERLY ALL-COMPANY WELLNESS DAYS WHERE EVERYONE TAKES A PAUSE TOGETHERCOUNTRY SPECIFIC HOLIDAYS PLUS A DAY OFF FOR YOUR BIRTHDAYONE-TIME HOME OFFICE STIPENDANNUAL PROFESSIONAL DEVELOPMENT BUDGETQUARTERLY WELL-BEING STIPENDCONSIDERABLE PAID PARENTAL LEAVEEMPLOYEE REFERRAL BONUS PROGRAMOTHER BENEFITS (LIFE/AD&D, DISABILITY, EAP, ETC. - VARIES BY COUNTRY)\n\nABOUT MOZILLA\n\nMOZILLA EXISTS TO BUILD THE INTERNET AS A PUBLIC RESOURCE ACCESSIBLE TO ALL BECAUSE WE BELIEVE THAT OPEN AND FREE IS BETTER THAN CLOSED AND CONTROLLED. WHEN YOU WORK AT MOZILLA, YOU GIVE YOURSELF A CHANCE TO MAKE A DIFFERENCE IN THE LIVES OF WEB USERS EVERYWHERE. AND YOU GIVE US A CHANCE TO MAKE A DIFFERENCE IN YOUR LIFE EVERY SINGLE DAY. JOIN US TO WORK ON THE WEB AS THE PLATFORM AND HELP CREATE MORE OPPORTUNITY AND INNOVATION FOR EVERYONE ONLINE.\n\nCOMMITMENT TO DIVERSITY, EQUITY, INCLUSION, AND BELONGING\n\nMOZILLA UNDERSTANDS THAT VALUING DIVERSE CREATIVE PRACTICES AND FORMS OF KNOWLEDGE ARE CRUCIAL TO AND ENRICH THE COMPANY’S CORE MISSION. WE ENCOURAGE APPLICATIONS FROM EVERYONE, INCLUDING MEMBERS OF ALL EQUITY-SEEKING COMMUNITIES, SUCH AS (BUT CERTAINLY NOT LIMITED TO) WOMEN, RACIALIZED AND INDIGENOUS PERSONS, PERSONS WITH DISABILITIES, PERSONS OF ALL SEXUAL ORIENTATIONS, GENDER IDENTITIES, AND EXPRESSIONS.\n\nWE WILL ENSURE THAT QUALIFIED INDIVIDUALS WITH DISABILITIES ARE PROVIDED REASONABLE ACCOMMODATIONS TO PARTICIPATE IN THE JOB APPLICATION OR INTERVIEW PROCESS, TO PERFORM ESSENTIAL JOB FUNCTIONS, AND TO RECEIVE OTHER BENEFITS AND PRIVILEGES OF EMPLOYMENT, AS APPROPRIATE. PLEASE CONTACT US AT HIRINGACCOMMODATION@MOZILLA.COM TO REQUEST ACCOMMODATION.\n\nWE ARE AN EQUAL OPPORTUNITY EMPLOYER. WE DO NOT DISCRIMINATE ON THE BASIS OF RACE (INCLUDING HAIRSTYLE AND TEXTURE), RELIGION (INCLUDING RELIGIOUS GROOMING AND DRESS PRACTICES), GENDER, GENDER IDENTITY, GENDER EXPRESSION, COLOR, NATIONAL ORIGIN, PREGNANCY, ANCESTRY, DOMESTIC PARTNER STATUS, DISABILITY, SEXUAL ORIENTATION, AGE, GENETIC PREDISPOSITION, MEDICAL CONDITION, MARITAL STATUS, CITIZENSHIP STATUS, MILITARY OR VETERAN STATUS, OR ANY OTHER BASIS COVERED BY APPLICABLE LAWS. MOZILLA WILL NOT TOLERATE DISCRIMINATION OR HARASSMENT BASED ON ANY OF THESE CHARACTERISTICS OR ANY OTHER UNLAWFUL BEHAVIOR, CONDUCT, OR PURPOSE.\n\nGROUP: D\n\nREQ ID: R2452\n\nHIRING RANGES\n\nUS TIER 1 LOCATIONS\n\n$102,000—$150,000 USD\n\nUS TIER 2 LOCATIONS\n\n$94,000—$138,000 USD\n\nUS TIER 3 LOCATIONS\n\n$87,000—$127,000 USD\n\n",
    "job_skill_set": [
      "financial analysis",
      "strategic planning",
      "data analysis",
      "reporting",
      "communication",
      "interpersonal skills",
      "action-oriented",
      "problem-solving",
      "collaboration",
      "adaptability",
      "subscription-based business models",
      "revenue modeling",
      "Excel modeling",
      "Google Workspace",
      "SQL",
      "data visualization",
      "influence",
      "storytelling"
    ],
    "short_keywords": [
      "actionoriented",
      "adaptability",
      "analysis",
      "analyst",
      "business",
      "collaboration",
      "communication",
      "data",
      "excel",
      "finance",
      "financial",
      "google",
      "influence",
      "interpersonal",
      "modeling",
      "models",
      "planning",
      "problemsolving",
      "reporting",
      "revenue",
      "skills",
      "sql",
      "storytelling",
      "strategic",
      "subscriptionbased",
      "visualization",
      "workspace"
    ]
  },
  {
    "job_id": "3905290159",
    "job_title": "Finance Analyst - Electrolyzers",
    "category": "FINANCE",
    "job_description": "DESCRIPTION\n\nFINANCE ANALYST - ELECTROLYZERS\n\nOUR CULTURE BELIEVES IN POWERING YOUR POTENTIAL . WE PROVIDE GLOBAL OPPORTUNITIES TO DEVELOP YOUR CAREER, MAKE YOUR COMMUNITY A BETTER PLACE AND WORK WITH TODAY’S MOST INNOVATIVE THINKERS TO SOLVE THE WORLD’S TOUGHEST PROBLEMS.\n\nWE BELIEVE IN FLEXIBILITY FOR YOU TO EXPLORE YOUR PASSIONS WHILE MAKING AN IMPACT THROUGH MEANINGFUL WORK WITHIN OUR INCLUSIVE WORKFORCE. THAT’S WHAT IS ALL ABOUT.\n\nWE ARE LOOKING FOR A TALENTED FINANCE ANALYST - ELECTROLYZERS TO JOIN OUR TEAM SPECIALIZING IN FINANCE FOR OUR ACCELERA BUSINESS UNITE IN TROY, MI.\n\nIN THIS ROLE, YOU WILL MAKE AN IMPACT IN THE FOLLOWING WAYS:\n\nRESPONSIBLE FOR THE PREPARATION OF COMPLEX AND INTERPRETIVE FINANCIAL ANALYSES AND REPORTS. SUPPORTS THE ANNUAL BUDGET PROCESS, EXPENSE AND/OR STAFFING FORECASTS AND STATISTICAL REPORTING.PREPARES COMPLEX FINANCIAL ANALYSES AND REPORTS FOR DEPARTMENT MANAGEMENT.PREPARES ANALYSES, REPORTS, AND SPECIAL STUDIES FOR MANAGEMENT.BUSINESS PARTNERS WITH ORGANIZATIONAL UNIT(S) TO DEVELOP ANNUAL BUDGETS, EXPENSE AND STAFFING FORECASTS, AND STATISTICAL REPORTING.PREPARES AND CONSOLIDATES FINANCIAL DATA STATISTICAL REPORTING, INCLUDING FINANCIAL PERFORMANCE, VARIANCE EXPLANATIONS, AND COST ANALYSIS.COACHES OR LEADS LESS-EXPERIENCED FINANCIAL ANALYSTS.\n\nTO BE SUCCESSFUL IN THIS ROLE YOU WILL NEED THE FOLLOWING:\n\nINTERMEDIATE LEVEL OF RELEVANT PROFESSIONAL WORK EXPERIENCE IN THE FIELD OF STUDY REQUIRED.AS A KEY MEMBER OF THE PROJECT, PROVIDE FINANCIAL ANALYSIS, ADVICE AND GUIDANCE TO SUPPORT THE PROJECT TEAM IN MAKING THE BEST BUSINESS DECISIONSBUSINESS PARTNER WITH COMMERCIAL, VPI AND SUPPLY CHAIN TEAMS TO CREATE COST MODELS FOR POTENTIAL PROJECTS BEING BID BY THE COMMERCIAL TEAMBUILD COST, MARGIN AND PROFITABILITY SCENARIOS FOR PROJECT TEAMS CONSIDERATION DURING PROJECT ACCEPTANCE REVIEWSIDENTIFY PROJECT RISKS (LIQUIDATED DAMAGES ON DELIVERY, PRODUCT PERFORMANCE METRICS ETC.,) AND QUANTIFY THEM FOR PROJECT TEAMS CONSIDERATIONSFOR ACCEPTED PROJECTS, ESTABLISH BASE LINE COST MODEL AND COMPARE THEM AGAINST ACTUAL COSTS DURING KEY PROJECT MILESTONESHELP DEFINE PROJECT MANAGEMENT PROCESS – FROM SIGNATURE THROUGH TO THE END OF CONTRACTUAL OBLIGATIONSCOMFORTABLE DEVELOPING AND WORKING WITH COMPLEX FINANCIAL MODELS.\n\nAT CUMMINS, WE ARE AN EQUAL OPPORTUNITY AND AFFIRMATIVE ACTION EMPLOYER DEDICATED TO DIVERSITY IN THE WORKPLACE. OUR POLICY IS TO PROVIDE EQUAL EMPLOYMENT OPPORTUNITIES TO ALL QUALIFIED PERSONS WITHOUT REGARD TO RACE, GENDER, COLOR, DISABILITY, NATIONAL ORIGIN, AGE, RELIGION, UNION AFFILIATION, SEXUAL ORIENTATION, VETERAN STATUS, CITIZENSHIP, GENDER IDENTITY AND/OR EXPRESSION, OR OTHER STATUS PROTECTED BY LAW.\n\nCUMMINS VALIDATES RIGHT TO WORK USING E-VERIFY. CUMMINS WILL PROVIDE THE SOCIAL SECURITY ADMINISTRATION (SSA) AND, IF NECESSARY, THE DEPARTMENT OF HOMELAND SECURITY (DHS), WITH INFORMATION FROM EACH NEW EMPLOYEE’S FORM I-9 TO CONFIRM WORK AUTHORIZATION.\n\nJOB FINANCE\n\nPRIMARY LOCATION UNITED STATES-MICHIGAN-ROCHESTER HILLS-US, MI, TROY, 2135 WEST MAPLE ROAD\n\nJOB TYPE EXPERIENCED - EXEMPT / OFFICE\n\nRECRUITMENT JOB TYPE EXEMPT - EXPERIENCED\n\nJOB POSTING APR 18, 2024, 11:32:59 AM\n\nUNPOSTING DATE ONGOING\n\nORGANIZATION ACCELERA BUSINESS\n\nROLE CATEGORY HYBRID - POTENTIAL FOR PARTIAL REMOTE\n\nRELOCATION PACKAGE INELIGIBLE\n\nREQ ID: 240003BX",
    "job_skill_set": [
      "financial analysis",
      "budget preparation",
      "statistical reporting",
      "variance analysis",
      "financial reporting",
      "project management",
      "data consolidation",
      "risk identification",
      "financial modeling",
      "communication",
      "teamwork",
      "leadership",
      "problem solving",
      "adaptability",
      "analytical thinking",
      "coaching",
      "cost modeling"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "analyst",
      "analytical",
      "budget",
      "coaching",
      "communication",
      "consolidation",
      "cost",
      "data",
      "electrolyzers",
      "finance",
      "financial",
      "identification",
      "leadership",
      "management",
      "modeling",
      "preparation",
      "problem",
      "project",
      "reporting",
      "risk",
      "solving",
      "statistical",
      "teamwork",
      "thinking",
      "variance"
    ]
  }
]