[
  {
    "job_id": "3902311976",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "\"COMPANY DESCRIPTION WE SUGGEST YOU ENTER DETAILS HERE\n ROLE DESCRIPTION THIS IS A FULL-TIME REMOTE ROLE FOR A BUSINESS DEVELOPMENT MANAGER AT DLC (DIRECT LABOR & CONSULTING). THE BUSINESS DEVELOPMENT MANAGER WILL BE RESPONSIBLE FOR IDENTIFYING NEW BUSINESS OPPORTUNITIES, DEVELOPING AND MAINTAINING CLIENT RELATIONSHIPS, AND DRIVING REVENUE GROWTH. THEY WILL ALSO COLLABORATE WITH CROSS-FUNCTIONAL TEAMS TO DEVELOP AND EXECUTE STRATEGIES TO MEET BUSINESS OBJECTIVES.\n QUALIFICATIONS STRONG INTERPERSONAL AND COMMUNICATION SKILLSPROVEN TRACK RECORD IN SALES AND BUSINESS DEVELOPMENTABILITY TO BUILD AND MAINTAIN RELATIONSHIPS WITH CLIENTSEXCELLENT NEGOTIATION AND PERSUASION SKILLSABILITY TO ANALYZE MARKET TRENDS AND DEVELOP BUSINESS STRATEGIESKNOWLEDGE OF THE INDUSTRY AND MARKET CONDITIONSABILITY TO WORK INDEPENDENTLY AND IN A TEAMBACHELOR'S DEGREE IN BUSINESS OR A RELATED FIELD \"",
    "job_skill_set": [
      "sales",
      "business development",
      "negotiation",
      "market analysis",
      "strategic planning",
      "industry knowledge",
      "client relationship management",
      "revenue growth strategies",
      "communication",
      "interpersonal skills",
      "teamwork",
      "independence",
      "persuasion"
    ],
    "short_keywords": [
      "analysis",
      "business",
      "businessdevelopment",
      "client",
      "communication",
      "development",
      "growth",
      "independence",
      "industry",
      "interpersonal",
      "knowledge",
      "management",
      "manager",
      "market",
      "negotiation",
      "persuasion",
      "planning",
      "relationship",
      "revenue",
      "sales",
      "skills",
      "strategic",
      "strategies",
      "teamwork"
    ]
  },
  {
    "job_id": "3901803340",
    "job_title": "Remote Business Development Specialist",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ARE YOU ON THE HUNT FOR YOUR NEXT SALES OPPORTUNITY?\nWE'RE ACTIVELY SEARCHING FOR DYNAMIC AND SELF-MOTIVATED INDIVIDUALS TO JOIN OUR GROWING TEAM IN THE ROLE OF REMOTE BUSINESS DEVELOPMENT SPECIALIST ON A 1099 CONTRACT BASIS. THIS IS A FANTASTIC OPPORTUNITY FOR EXPERIENCED SALES PROFESSIONALS AND THOSE ENTERING THE FIELD TO JUMPSTART THEIR CAREERS, MAKING A SIGNIFICANT IMPACT WHILE ENJOYING THE FLEXIBILITY OF REMOTE WORK. PREPARE TO UNLEASH YOUR EARNING POTENTIAL WITH OUR STEADFAST SUPPORT AT EVERY TURN, ALL WHILE EMBARKING ON A REWARDING AND FULFILLING CAREER PATH.\nRESPONSIBILITIES FOR THE REMOTE BUSINESS DEVELOPMENT SPECIALIST POSITION:\n● FOSTER AND MAINTAIN CLIENT RELATIONSHIPS THROUGH EFFECTIVE COMMUNICATION.● DELIVER ENGAGING AND INFORMATIVE PRODUCT PRESENTATIONS.● CONDUCT VIRTUAL DEMONSTRATIONS TO HIGHLIGHT KEY FEATURES AND BENEFITS.● STRIVE TO ACHIEVE INDIVIDUAL AND TEAM SALES TARGETS.● ARTICULATE THE VALUE PROPOSITIONS TO POTENTIAL CUSTOMERS SKILLFULLY.● ENGAGE WITH WARM LEADS TO GUIDE THEM THROUGH THE SALES FUNNEL.● MAINTAIN ACCURATE AND UP-TO-DATE RECORDS OF ALL SALES ACTIVITIES.\nWHAT'S WAITING FOR YOU AS A REMOTE BUSINESS DEVELOPMENT SPECIALIST AT OUR ORGANIZATION?\n● WORK FROM THE CONVENIENCE OF YOUR HOME, ELIMINATING COMMUTE TIMES AND ENABLING A PERSONALIZED AND PRODUCTIVE WORKSPACE.● BENEFIT FROM AN UNCAPPED COMMISSION SYSTEM, ALLOWING YOU TO DIRECTLY IMPACT YOUR EARNINGS BASED ON YOUR PERFORMANCE IN THIS 1099 POSITION.● NO PRIOR SALES EXPERIENCE IS REQUIRED; RECEIVE COMPREHENSIVE TRAINING ON OUR PRODUCTS/SERVICES, SALES TECHNIQUES, AND THE USE OF VIRTUAL COMMUNICATION TOOLS TO ENSURE SUCCESS IN YOUR ROLE.● NO MORE COLD CALLING; WE PROVIDE ACCESS TO THE BEST LEADS, ALLOWING YOU TO FOCUS ON CLOSING DEALS AND REALIZING YOUR FULL POTENTIAL.",
    "job_skill_set": [
      "sales",
      "communication",
      "product presentations",
      "virtual demonstrations",
      "sales funnel management",
      "record keeping",
      "lead engagement",
      "self-motivation",
      "teamwork",
      "adaptability",
      "relationship building",
      "goal-oriented",
      "problem solving"
    ],
    "short_keywords": [
      "adaptability",
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "demonstrations",
      "development",
      "engagement",
      "funnel",
      "goaloriented",
      "keeping",
      "lead",
      "management",
      "presentations",
      "problem",
      "product",
      "record",
      "relationship",
      "remote",
      "sales",
      "selfmotivation",
      "solving",
      "specialist",
      "teamwork",
      "virtual"
    ]
  },
  {
    "job_id": "3884823083",
    "job_title": "Area Director Business Development",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "SUNRISE SENIOR LIVING WAS AGAIN CERTIFIED AS A GREAT PLACE TO WORK® BY ACTIVATED INSIGHTS. THIS IS THE 6TH TIME SUNRISE HAS RECEIVED THIS TOP CULTURE AND WORKPLACE DESIGNATION, HIGHLIGHTING THE SPECIAL PLACE SUNRISE IS TO BE A PART OF. \n\n COMMUNITY NAME \n\nSUNRISE OF FAIRFIELD\n\n JOB ID \n\n2024-208613\n\nJOB OVERVIEW\n\n\"SUNRISE IS THE BEST PLACE THAT I'VE EVER WORKED, SIMPLY BECAUSE OF THE PEOPLE. WE PROVIDE QUALITY CARE IN AN ENVIRONMENT THAT FEELS LIKE HOME. OUR FOCUS IS DOING WHAT’S RIGHT FOR THE RESIDENT. FOR ME, THAT’S A BIG BREATH OF FRESH AIR.\"\n\n SUNRISE LEADER \n\n\nTHE AREA DIRECTOR OF BUSINESS DEVELOPMENT (ADBD) IS RESPONSIBLE FOR USING MARKET KNOWLEDGE AND COMPANY RESOURCES TO DEVELOP AND IMPLEMENT BUSINESS DEVELOPMENT STRATEGIES FOR AN ASSIGNED MARKET THAT WILL GENERATE QUALIFIED, NONPAID PROFESSIONAL REFERRALS, BRING MORE SENIORS TO SUNRISE SENIOR LIVING AND POSITION SUNRISE AS A PREFERRED PROVIDER. THE ADBD ALSO DRIVES STRATEGIES RELATED TO LOCAL PAID REFERRAL PARTNERS TO GENERATE 3RD PARTY REFERRALS AND MOVE-INS FROM THESE PARTNERS. THE ADBD ASSISTS EXECUTIVE DIRECTORS AND REGIONAL DIRECTORS OF SALES IN COACHING AND MENTORING DIRECTORS OF SALES IN THE MARKET ON BEST PRACTICES RELATED TO PROFESSIONAL OUTREACH AND BUSINESS DEVELOPMENT.\n\nRESPONSIBILITIES & QUALIFICATIONS\n\nRESPONSIBILITIES:\n\nAS A PART OF THE SUNRISE TEAM, SUPPORTING OUR MISSION, PRINCIPLES OF SERVICE AND CORE VALUES IS A FUNDAMENTAL PART OF THIS JOB. OUR FOUNDATIONAL BELIEF IS THE SACRED VALUE OF HUMAN LIFE. THE UNIQUE RESPONSIBILITIES FOR THIS ROLE INCLUDE BUT ARE NOT LIMITED TO THE ESSENTIAL FUNCTIONS LISTED BELOW:\n\nFACILITATES AND PROVIDES ONGOING PRODUCT-SERVICE EDUCATION AS A RESULT OF SALES EFFORT WITHIN THE MARKET TO TRADE ORGANIZATIONS, HOSPITAL DEPARTMENTS, PHYSICIANS AND OTHER HEALTH CARE ORGANIZATIONS, AS APPROPRIATE.TARGETS REFERRALS FROM AMONG THE PROFESSIONAL COMMUNITY, VARIOUS COMMUNITY ASSOCIATIONS, AND RELATED PROVIDERS THAT WILL SERVICE ALL PRODUCTS OF OUR MARKET RANGING FROM INDEPENDENT LIVING TO SKILLED NURSING FACILITIES.COORDINATES PARTICIPATION OF COMMUNITY TEAM MEMBERS IN PROFESSIONAL SOCIETIES AND ACTIVITIES, WHICH WILL RESULT IN QUALIFIED LEADS.IDENTIFIES BOTH NEW BUSINESS OPPORTUNITIES AND NEW CUSTOMER CALL POINTS WITHIN THE COMMUNITIES SERVED FOR ADDITIONAL QUALIFIED LEADS AND MOVE-INS.MAINTAINS PROFESSIONAL RELATIONSHIPS IN THE COMMUNITY.IDENTIFIES, TARGETS, AND GENERATES A CONSISTENT AND CONTINUOUS REFERRAL STREAM FROM QUALIFIED REFERRAL SOURCES AS A RESULT OF EFFECTIVE AND SYSTEMATIC EXTERNAL BUSINESS DEVELOPMENT YIELDING BOTH CENSUS AND REVENUE GROWTH.DEFINES AND DEVELOPS KEY MACRO REFERRAL SOURCES AND MAINTAINS RELATIONSHIPS WITH KEY AREA REFERRAL SOURCES WITHIN THEIR ASSIGNED AREA THAT HAVE THE ABILITY TO REFER TO MULTIPLE COMMUNITIES.IDENTIFIES NEW SOURCES OF REFERRALS THAT CAN GROW THE BUSINESS IN ADDITION TO MAINTAINING CURRENT REFERRAL SOURCES.ESTABLISHES, MANAGES, AND COMMUNICATES ACCOUNT PLANS WHICH ALIGN WITH ASSIGNED MARKET PRIORITIES.COLLABORATES WITH EXECUTIVE DIRECTORS AND COMMUNITY SALES TEAMS ON IMPROVED SERVICE DELIVERY AND PROBLEM RESOLUTION RELATED TO THE ACCOUNTS IN THEIR PORTFOLIO.ORGANIZES TRADE SHOW PRESENTATIONS, BROCHURES, AND OTHER MARKETING MATERIAL, AND PROVIDES SUPPORT WITH PROFESSIONAL EVENTS HELD IN THE COMMUNITY WHICH WILL DRIVE QUALIFIED LEADS FOR THE COMMUNITIES THEY REPRESENT.PROVIDES ON-GOING AND TIMELY COMMUNICATION AND FOLLOW-UP TO EXECUTIVE DIRECTORS AND DIRECTOR OF SALES OF INITIATIVES IN PROGRESS THAT MAY GENERATE REFERRALS TO THEIR COMMUNITY.CONSISTENTLY PARTICIPATES IN COMMUNITY SALES MEETINGS PROVIDING UPDATES, COACHING AND INSIGHTS ON BUSINESS DEVELOPMENT.MAINTAINS A REGULAR VISIT CADENCE WITH EACH COMMUNITY IN THEIR PORTFOLIO.COORDINATES JOINT SALES EFFORTS WITH APPROPRIATE REPRESENTATIVES OF SUNRISE SENIOR LIVING COMMUNITIES TO IDENTIFY AND MEET WITH BOTH PROSPECTIVE AND EXISTING CUSTOMERS, AS APPROPRIATE.MONITORS AND REPORTS CENSUS/REFERRAL ACTIVITY FOR ACCOUNTS IN THEIR PORTFOLIO; PREPARES AND SUBMITS REQUIRED SALES MANAGEMENT REPORTS REFLECTING TARGETS, PROGRESS AND ACCOMPLISHMENTS WHILE MAINTAINING A THOROUGH WORKING PROFICIENCY AND KEEPING PROFESSIONAL CONTACT RECORDS CURRENT IN THE CUSTOMER RELATIONSHIP MANAGEMENT TRACKING SYSTEM.COMMUNICATES ACTIVITIES AND OUTCOMES WITH COMMUNITIES IN THEIR MARKET BY SUBMITTING A CALENDAR OF SCHEDULED AND COMPLETED ACTIVITIES; PARTICIPATES IN A REGULARLY SCHEDULED MEETING WITH THE MARKET’S EXECUTIVE DIRECTORS AND COMMUNITY SALES TEAMS TO REVIEW STATUS OF EXISTING AND PROSPECTIVE ACCOUNTS.FULLY COMPREHENDS AND CAN EXPLAIN TO OTHERS THE BASIC LEGAL ASPECTS OF SALES CONTRACTS (LANGUAGE AND TERMS) AND STATE REGULATIONS REGARDING ADMISSIONS/DISCHARGES.UNDERSTANDS AND MANAGES COSTS BY MONITORING BUDGETS AND RECONCILIATION.PROCESSES AND SUBMITS MONTHLY EXPENSES AND BUDGET DATA TIMELY PER SUNRISE POLICIES AND INTERNAL BUSINESS CONTROLS.UNDERSTANDS THE INTERNAL COSTS ASSOCIATED WITH ALL SUNRISE RESIDENT CARE PROGRAMS.PARTNERS IN THE DELIVERY AND PARTICIPATION IN SUNRISE UNIVERSITY TRAINING AND SELF-STUDY PROGRAMS DURING THE REQUIRED TIMEFRAME.DEVELOPS A WORKING KNOWLEDGE OF STATE REGULATIONS AND ENSURES COMPLIANCE.KEEPS ABREAST OF PROFESSIONAL DEVELOPMENTS IN THE FIELD BY READING AND ATTENDING CONFERENCES AND TRAINING SESSIONS.DRIVES STRATEGIES RELATED TO LOCAL PAID REFERRAL PARTNERS TO GENERATE 3RD PARTY REFERRALS AND MOVE-INS FROM THESE PARTNERS.ASSISTS EXECUTIVE DIRECTORS AND REGIONAL DIRECTORS OF SALES IN COACHING AND MENTORING DIRECTORS OF SALES IN THE MARKET ON BEST PRACTICES RELATED TO PROFESSIONAL OUTREACH AND BUSINESS DEVELOPMENT.MAINTAIN COMPLIANCE IN ASSIGNED REQUIRED TRAINING AS APPLICABLE TO THIS ROLE TO ENSURE THAT SUNRISE STANDARDS ARE ALWAYS MET.\n\n\nQUALIFICATIONS:\n\nTO PERFORM THIS JOB SUCCESSFULLY, AN INDIVIDUAL MUST BE ABLE TO PERFORM EACH ESSENTIAL DUTY SATISFACTORILY. THE REQUIREMENTS LISTED THROUGHOUT THIS JOB DESCRIPTION ARE REPRESENTATIVE OF THE KNOWLEDGE, SKILLS, AND ABILITIES REQUIRED:\n\nCOLLEGE DEGREE OR EQUIVALENT EXPERIENCE STRONGLY PREFERRED.THREE TO FIVE (3-5) YEARS’ EXPERIENCE IN CONSULTATIVE BUSINESS TO BUSINESS SALES.PRIOR EXPERIENCE SELLING TO HEALTHCARE ACCOUNTS OR IN PROFESSIONAL BUSINESS DEVELOPMENT IS PREFERRED.A DEMONSTRATED TRACK RECORD OF SUCCESSFUL ACCOUNT MANAGEMENT.ABILITY TO HANDLE MULTIPLE PRIORITIES.POSSESS WRITTEN AND VERBAL SKILLS FOR EFFECTIVE COMMUNICATION AND THE ABILITY TO FACILITATE GROUP PRESENTATIONS.EXCELLENT ORGANIZATIONAL AND TIME MANAGEMENT SKILLS.ABILITY TO CONSTANTLY SURVEY THE ENVIRONMENT FOR NEW OR CHANGING BUSINESS OPPORTUNITIES.ABILITY TO, CUSTOMARILY AND REGULARLY, EXERCISE DISCRETION AND INDEPENDENT JUDGMENT.DEMONSTRATES GOOD JUDGMENT, PROBLEM SOLVING AND DECISION-MAKING SKILLS.DEMONSTRATION OF PROFICIENCY IN COMPUTER SKILLS, MICROSOFT OFFICE (WINDOWS, OUTLOOK, EXCEL) AND SUNRISE APPLICATIONS WITH THE ABILITY TO LEARN NEW APPLICATIONS.ABILITY TO WORK FLEXIBLE HOURS AND BE AVAILABLE FOR OUR CUSTOMERS AT PEAK SERVICE DELIVERY DAYS AND TIMES, REFLECTIVE OF OUR LEADERSHIP EXCELLENCE STAFFING.PROVEN ABILITY TO WORK WITHOUT DAILY SUPERVISION EITHER ON THE ROAD OR IN A HOME-OFFICE ENVIRONMENT.\n\n\nABOUT SUNRISE\n\nSUNRISE SENIOR LIVING HAS CHAMPIONED QUALITY OF LIFE IN SENIOR CARE FOR MORE THAN 30 YEARS. WE BELIEVE TEAM MEMBERS ARE OUR GREATEST RESOURCE AND ARE LOOKING FOR PEOPLE WHO SHARE OUR COMMITMENT TO PROVIDE QUALITY CARE FOR SENIORS AND THEIR FAMILIES. IT'S NO SURPRISE THAT MANY OF THE WORLD'S LEADING EXPERTS IN SENIOR LIVING ENTRUST THEIR CAREER TO SUNRISE.\n\nAT SUNRISE, YOU WILL…\n\n MAKE A DIFFERENCE EVERY DAY \n\nWE ARE PASSIONATE ABOUT OUR MISSION — TO CHAMPION QUALITY OF LIFE FOR ALL SENIORS. WE DELIVER HIGH-QUALITY CARE WITH A PERSONAL TOUCH AND ENCOURAGE OUR RESIDENTS TO ENJOY LIFE TO THE FULLEST.\n\n BE PART OF A UNIQUELY SUPPORTIVE COMMUNITY \n\nTHE CARE-FOCUSED ENVIRONMENT WE CREATE FOR RESIDENTS EXTENDS TO OUR TEAM MEMBERS. WE OFFER PROGRAMS, REWARDS, AND BENEFITS TO HELP YOU LIVE YOUR BEST.\n\n I  GNITE YOUR POTENTIAL \n\nWE BELIEVE POTENTIAL HAS NO LIMITS. WE OFFER BEST-IN-CLASS LEADERSHIP DEVELOPMENT PROGRAMS DESIGNED TO GROW OUR LEADERS. WE ARE COMMITTED TO HELPING OUR TEAM MEMBERS ACHIEVE THEIR CAREER GOALS.\n\n APPLY TODAY TO LEARN WHY SUNRISE SENIOR LIVING IS A CERTIFIED GREAT PLACE TO WORK® \n\nPRE-EMPLOYMENT REQUIREMENTS\n\nSUNRISE CONSIDERS THE HEALTH AND SAFETY OF ITS RESIDENTS, FAMILY MEMBERS, AND TEAM MEMBERS TO BE ONE OF ITS HIGHEST PRIORITIES. EMPLOYMENT WITH SUNRISE IS CONDITIONED ON COMPLETING AND PASSING A DRUG TEST (WHICH DOES NOT INCLUDE MARIJUANA), PARTICIPATING IN TESTING REQUIREMENTS (E.G. TUBERCULOSIS TEST, PHYSICAL EVALUATION). COVID-19 AND INFLUENZA VACCINATION IS ONLY REQUIRED TO THE EXTENT MANDATED BY APPLICABLE FEDERAL, STATE, AND LOCAL LAWS AND AUTHORITIES.\n\nCOMPENSATION DISCLAIMER\n\nSELECTED CANDIDATES WILL BE OFFERED COMPETITIVE COMPENSATION BASED ON GEOGRAPHIC LOCATION OF COMMUNITY/OFFICE, SKILLS, EXPERIENCE, QUALIFICATIONS, AND CERTIFICATIONS/LICENSES (WHERE APPLICABLE).\n\n",
    "job_skill_set": [
      "business development",
      "account management",
      "sales",
      "market analysis",
      "customer relationship management",
      "Microsoft Office",
      "healthcare sales",
      "presentation skills",
      "communication",
      "problem solving",
      "teamwork",
      "organizational skills",
      "time management",
      "flexibility",
      "leadership",
      "discretion",
      "judgment",
      "mentoring",
      "budget management",
      "data analysis"
    ],
    "short_keywords": [
      "account",
      "analysis",
      "area",
      "budget",
      "business",
      "businessdevelopment",
      "communication",
      "customer",
      "data",
      "development",
      "director",
      "discretion",
      "flexibility",
      "healthcare",
      "judgment",
      "leadership",
      "management",
      "market",
      "mentoring",
      "microsoft",
      "office",
      "organizational",
      "presentation",
      "problem",
      "relationship",
      "sales",
      "skills",
      "solving",
      "teamwork",
      "time"
    ]
  },
  {
    "job_id": "3905862800",
    "job_title": "Manager, Europe - Impact Investing (Business Development + Client Services)",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ABOUT TIDELINE\nTIDELINE IS A SPECIALIST CONSULTING FIRM THAT PROVIDES EXPERT IMPACT INVESTING ADVICE AND HAS PLAYED A FOUNDATIONAL ROLE IN BUILDING THE FIELD SINCE THE FIRM’S INCEPTION IN 2014. OUR MISSION IS TO ENABLE LEADING INVESTORS TO INTEGRATE AND DELIVER IMPACT WITH CONFIDENCE, AND OUR VISION IS A WORLD THAT EXPECTS AND TRUSTS IN THE ABILITY OF ALL FINANCIAL CAPITAL TO CONTRIBUTE TO A JUST SOCIETY AND THRIVING PLANET. TO THAT END, OUR SERVICES INCLUDE IMPACT MANAGEMENT STRATEGY, IMPLEMENTATION, AND RESEARCH AND THOUGHT LEADERSHIP.TIDELINE HAS COMPLETED MORE THAN 200 PROJECTS FOR CLIENTS DEPLOYING OVER $200B IN IMPACT CAPITAL. WITH SERVICES FOCUSED ON STRATEGY AND IMPLEMENTATION, THE FIRM SUPPORTS IMPACT INVESTING PLATFORMS, PROGRAMS, AND VEHICLES GLOBALLY ACROSS THEMES AND SECTORS. PAST CLIENTS HAVE INCLUDED DIVERSE LEADING GLOBAL ASSET OWNERS, ASSET MANAGERS, AND SERVICE PROVIDERS ACTIVE IN IMPACT INVESTING ACROSS A VARIETY OF ASSET CLASSES AND SECTORS. IMPACT IS A GUIDING FORCE FOR EVERYTHING THAT WE DO – HOW WE INTERACT WITH CLIENTS, CONDUCT OURSELVES AS A BUSINESS, AND WORK WITH EACH OTHER AS TEAMMATES. WE STRIVE TO DELIVER INTEGRAL, FIELD-LEADING WORK FOR OUR CLIENTS WHILE ALSO PROVIDING TO THE MARKET AN ASPIRATIONAL MODEL OF WHAT A MORE REGENERATIVE BUSINESS CAN LOOK LIKE.\nABOUT THE POSITION\nIN THE NEXT FIVE YEARS, TIDELINE AIMS TO FORTIFY OUR POSITION IN THE IMPACT MARKET AS THE LEADING TRUSTED ADVISOR TO INSTITUTIONAL INVESTORS AND TO GROW SUSTAINABLY IN ORDER TO DEEPEN OUR MARKET INFLUENCE AND INVEST IN TEAM. CURRENTLY, WE HAVE AN INCREDIBLE MULTI-DISCIPLINARY TEAM THAT INCLUDES EXCEPTIONAL ASSOCIATES AND ANALYSTS, ALONG WITH OUR FOUNDING PARTNER AND ONE ASSOCIATE PARTNER. IN ORDER TO ACHIEVE OUR GOALS, WE ARE LOOKING TO ADD CAPACITY TO OUR TEAM AT THE MANAGER LEVEL, WITH AN OPPORTUNITY TO GROW INTO A DIRECTOR-LEVEL ROLE. THE PRIMARY RESPONSIBILITIES FOR THIS ROLE INCLUDE –CONSULTING: LEADING CLIENT ENGAGEMENTS, INCLUDING MANAGING CLIENT RELATIONSHIPS AND PROVIDING GUIDANCE, DIRECTION-SETTING, AND OVERSIGHT FOR THE INTERNAL TEAM.PEOPLE MANAGEMENT: MANAGE SENIOR ANALYSTS AND ASSOCIATES ON THE CLIENT SERVICES TEAM, WITH THE GOAL OF PROVIDING REGULAR FEEDBACK, SUPPORT, MENTORSHIP, AND PROFESSIONAL DEVELOPMENT.INTERNAL OPERATIONS AND PROCESS IMPROVEMENTS: OVERSEE STAFFING/RESOURCING OF TEAM MEMBERS TO INTERNAL AND CLIENT-FACING PROJECTS, TAKING INTO CONSIDERATION INDIVIDUAL TEAM MEMBERS’ AREAS OF EXPERTISE, CAPACITY, AND PROFESSIONAL DEVELOPMENT GOALS. WORK WITH THE SENIOR MANAGEMENT TEAM TO MAKE SERVICE DELIVERY MORE EFFECTIVE AND EFFICIENT (FOR EXAMPLE, THROUGH IDENTIFYING AND INTEGRATING NEW SOFTWARE TOOLS).BUSINESS DEVELOPMENT: LEAD THE DRAFTING OF PROPOSALS AND OTHER BUSINESS DEVELOPMENT MATERIALS, IN COLLABORATION WITH OUR MARKETING/BD TEAM.\nQUALIFICATIONS\nTHE IDEAL CANDIDATE IS AN EXPERIENCED CONSULTANT WHO ENJOYS MANAGING PEOPLE AND THINKING ABOUT PROCESSES. TIDELINE ADDITIONALLY VALUES TEAM MEMBERS WHO ARE COLLABORATIVE, ORGANIZED, AND DRIVEN TO LEARN; COMMUNICATE WELL; AND ARE DEEPLY COMMITTED TO ADVANCING SOCIAL AND ENVIRONMENTAL OUTCOMES. \nIN ORDER TO BE CONSIDERED FOR THE ROLE, CANDIDATES MUST HAVE –\nA BACHELOR’S DEGREE5-8 YEARS OF WORK EXPERIENCE (CANDIDATES WITH MORE EXPERIENCE WILL ALSO BE CONSIDERED)CONSULTING EXPERIENCE, INCLUDING EXPERIENCE MANAGING AND/OR LEADING PROJECTS AS WELL AS CLIENT-FACING EXPERIENCESTRONG INTEREST IN MANAGING, DEVELOPING, AND SUPPORTING PEOPLE AND TEAMSAN INTEREST IN MAKING A LONG-TERM COMMITMENT TO A BOUTIQUE CONSULTING FIRM, WITH THE GOAL OF GROWING INTO A SENIOR LEADERSHIP POSITIONSOME EXPERIENCE IN THE IMPACT INVESTING SPACEA TRACK RECORD OF COLLABORATING WITH DIRECT AND INDIRECT REPORTS AND PEERSSTRONG WRITTEN AND ORAL COMMUNICATION SKILLSCOMFORT LEARNING NEW TECHNOLOGY TOOLS AND PLATFORMSCOMMITMENT TO TIDELINE’S VALUES, AS ARTICULATED IN OUR DE&I STATEMENT AND COMMUNITY AGREEMENT (SEE PP. 49-52 OF OUR MILESTONE REPORT).ELIGIBILITY TO WORK IN THE US INDEFINITELY\nTHE IDEAL CANDIDATE WOULD ALSO HAVE ONE OR MORE OF THE FOLLOWING –MANAGEMENT EXPERIENCE, INCLUDING MENTORING AND COACHING TEAMS WITH DIVERSE PROFESSIONAL BACKGROUNDS. PROVIDING PROFESSIONAL DEVELOPMENT SUPPORT AND MENTORSHIP WILL BE KEY TO SUCCESS IN THIS ROLE.SIGNIFICANT KNOWLEDGE AND EXPERIENCE IN IMPACT INVESTING AND IMPACT MANAGEMENTEXPERIENCE WITH BUSINESS DEVELOPMENT AND REVENUE GENERATIONBASED NEAR ONE OF OUR HUBS IN NEW YORK OR PORTLAND – THIS MAKES IT EASIER TO SPEND TIME WITH THE TEAM IN-PERSON, BUT WE ARE A REMOTE-FIRST BUSINESS AND INVITE CANDIDATES TO APPLY FROM ANYWHERE WITHIN THE US\nHIRING PROCESS FAQS\nWHAT ARE SOME OF THE BENEFITS AND PERKS OF WORKING AT TIDELINE?A PROFESSIONAL DEVELOPMENT STIPEND IS AVAILABLE FOR EVERY EMPLOYEE TO USE TOWARDS IMPROVING THEIR EXPERTISE AND SOFT SKILLS.BEYOND PROVIDING A WORK LAPTOP, WE HAVE A “WORK FROM HOME” STIPEND AVAILABLE FOR EMPLOYEES TO HELP MAKE THEIR HOME WORKING SPACE BETTER.RETREATS: WE HOLD RETREATS EVERY YEAR WHERE TEAM MEMBERS GET TOGETHER IN A BEAUTIFUL LOCATION TO BRAINSTORM AND JUST HAVE A FUN TIME.WE CLOSE THE OFFICE FOR THE LAST WEEK OF DECEMBER SO EVERYONE CAN ENJOY TIME WITH FAMILY AND FRIENDS DURING THE HOLIDAY SEASON.EVERY OTHER FRIDAY IS A \"FREE FRIDAY\"WHAT WILL THE HIRING PROCESS LOOK LIKE?LOOKING FOR A NEW JOB CAN BE A DAUNTING EXPERIENCE. OUR APPROACH IS BASED IN EMPATHY AND A DESIRE FOR CANDIDATES TO HAVE A GOOD EXPERIENCE. WE WANT TO GIVE EVERYONE AN OPPORTUNITY TO DISPLAY THEIR STRENGTHS THROUGH THEIR ANSWERS TO OUR QUESTIONS.OUR TIMELINE FROM APPLICATION CLOSE DATE TO DECISION TYPICALLY TAKES ~6 WEEKS FOR JUNIOR ROLES AND 8-10 WEEKS FOR MORE SENIOR ROLES. WE TRY TO MOVE THINGS ALONG AS QUICKLY AS POSSIBLE, BUT SOMETIMES SCHEDULES GET IN THE WAY (AND WE AIM TO BE CONSIDERATE OF YOURS AS WELL!). WE MAKE EVERY EFFORT TO COMMUNICATE CONSISTENTLY AND TRANSPARENTLY THROUGH EACH STEP OF THE PROCESS.FOR THIS ROLE, APPLICATIONS ARE CURRENTLY SET TO CLOSE ON MAY 12TH. YOU CAN EXPECT TO HEAR FROM US BETWEEN MAY 13TH AND MAY 24TH ABOUT WHETHER YOU WILL BE INVITED TO INTERVIEW FOR THE ROLE. THE FIRST STEP WILL BE A SHORT SCREENING INTERVIEW (ABOUT 25 MINUTES), AND DURING THAT INTERVIEW WE WILL ALSO MAKE SURE TO GIVE YOU AN OVERVIEW OF THE HIRING PROCESS.FOLLOWING THE SCREENING INTERVIEW, WE EXPECT TO HAVE 2 ROUNDS OF INTERVIEWS AS WELL AS A CASE EXERCISE STAGE.HOW WOULD YOU DESCRIBE YOUR CULTURE?COLLABORATIVE, INCLUSIVE, AND PASSIONATE. WE ENCOURAGE ALL TEAM MEMBERS TO BE THEIR FULL SELVES AT WORK. AS A RELATIVELY SMALL TEAM, THERE ARE A LOT OF OPPORTUNITIES TO HAVE YOUR VOICE HEARD. OUR STRUCTURE IS RELATIVELY FLAT.WHAT’S YOUR COMMITMENT TO DEI TO LIFE IN CULTURE AND WORKPLACE?WE HAVE AN INTERNAL DE&I WORKING GROUP THAT IS COMMITTED TO IMPROVING DE&I PRACTICES, CULTURE, AND EMPLOYEE EXPERIENCE. DIVERSITY, EQUITY, AND INCLUSION ARE CORE TENETS OF OUR CULTURE AND WE PLACE A HEAVY EMPHASIS ON CONSTANTLY LEARNING AND IMPROVING OUR OWN UNDERSTANDING OF WHAT THAT MEANS FOR OUR BUSINESS. AT TIDELINE, WE BELIEVE THAT COMPASSION, EQUITY, DIVERSITY, AND INCLUSION ARE FUNDAMENTAL TO OUR SUCCESS. OUR COMMITMENT TO DIVERSITY, EQUITY AND INCLUSION MANIFESTS IN THREE KEY WAYS:THE MISSION AND VISION OF BLUEMARK AND ITS SISTER COMPANY, TIDELINE -- OUR FIRM’S VISION OF SHARED, SUSTAINABLE PROSPERITY IS INSEPARABLY ROOTED IN THE CREDO OF A DIVERSE, EQUITABLE, AND INCLUSIVE WORLD.HOW WE CONDUCT OURSELVES AS AN EMPLOYER -- BLUEMARK IS AN EQUAL OPPORTUNITY EMPLOYER, AND WE VALUE THE UNIQUE CONTRIBUTIONS OF EACH OF OUR TEAM MEMBERS. THROUGH OUR HIRING, MENTORING, AND MANAGING, WE ENCOURAGE OUR TEAM TO BRING THEIR FULL SELVES AND INDIVIDUALITY TO OUR WORK.HOW WE USE OUR INFLUENCE -- IN OUR WORK WITH CLIENTS, WE STRIVE TO BE AN ENABLING FORCE IN THE EQUITABLE DISTRIBUTION OF WEALTH, OPPORTUNITIES, AND PRIVILEGES WITHIN OUR SOCIETY.\n",
    "job_skill_set": [
      "business development",
      "project management",
      "client relationship management",
      "people management",
      "communication",
      "collaboration",
      "organizational skills",
      "adaptability",
      "impact investing",
      "consulting",
      "process improvement",
      "technology tools integration",
      "proposal drafting",
      "mentorship",
      "commitment to social outcomes",
      "professional development"
    ],
    "short_keywords": [
      "adaptability",
      "business",
      "businessdevelopment",
      "client",
      "collaboration",
      "commitment",
      "communication",
      "consulting",
      "development",
      "drafting",
      "europe",
      "impact",
      "improvement",
      "integration",
      "investing",
      "management",
      "manager",
      "mentorship",
      "organizational",
      "outcomes",
      "people",
      "process",
      "professional",
      "project",
      "proposal",
      "relationship",
      "services",
      "skills",
      "social",
      "technology",
      "to",
      "tools"
    ]
  },
  {
    "job_id": "3905220460",
    "job_title": "Business Development Director",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "JOB TITLE: BUSINESS DEVELOPMENT DIRECTOR\nJOB DESCRIPTION:AS THE BUSINESS DEVELOPMENT DIRECTOR IN THE CONSTRUCTION INDUSTRY, YOU WILL BE RESPONSIBLE FOR DRIVING BUSINESS GROWTH AND EXPANDING OUR MARKET PRESENCE THROUGH STRATEGIC PLANNING, RELATIONSHIP BUILDING, AND CLIENT ACQUISITION. YOU WILL PLAY A PIVOTAL ROLE IN IDENTIFYING NEW BUSINESS OPPORTUNITIES, DEVELOPING INNOVATIVE STRATEGIES, AND NURTURING CLIENT RELATIONSHIPS TO ACHIEVE REVENUE TARGETS AND LONG-TERM BUSINESS OBJECTIVES.\nKEY RESPONSIBILITIES INCLUDE:\nMARKET RESEARCH AND ANALYSIS: CONDUCT MARKET RESEARCH AND ANALYSIS TO IDENTIFY EMERGING TRENDS, COMPETITIVE LANDSCAPES, AND GROWTH OPPORTUNITIES IN THE CONSTRUCTION INDUSTRY. MONITOR INDUSTRY DEVELOPMENTS, REGULATORY CHANGES, AND MARKET DYNAMICS TO INFORM STRATEGIC DECISION-MAKING AND BUSINESS DEVELOPMENT INITIATIVES.\nSTRATEGIC PLANNING AND GOAL SETTING: DEVELOP AND IMPLEMENT COMPREHENSIVE BUSINESS DEVELOPMENT PLANS, STRATEGIES, AND INITIATIVES ALIGNED WITH COMPANY GOALS AND OBJECTIVES. SET AMBITIOUS BUT ACHIEVABLE REVENUE TARGETS, GROWTH PROJECTIONS, AND PERFORMANCE METRICS TO MEASURE SUCCESS AND TRACK PROGRESS OVER TIME.\nCLIENT RELATIONSHIP MANAGEMENT: CULTIVATE AND MAINTAIN STRONG RELATIONSHIPS WITH EXISTING AND PROSPECTIVE CLIENTS, INCLUDING OWNERS, DEVELOPERS, ARCHITECTS, ENGINEERS, AND CONTRACTORS. ACT AS A TRUSTED ADVISOR AND STRATEGIC PARTNER, UNDERSTANDING CLIENT NEEDS, ANTICIPATING CHALLENGES, AND DELIVERING INNOVATIVE SOLUTIONS TO DRIVE CLIENT SATISFACTION AND LOYALTY.\nPROPOSAL DEVELOPMENT AND PRESENTATION: LEAD THE DEVELOPMENT AND PREPARATION OF HIGH-QUALITY PROPOSALS, PRESENTATIONS, AND PITCHES TO SECURE NEW BUSINESS OPPORTUNITIES. COLLABORATE WITH CROSS-FUNCTIONAL TEAMS, INCLUDING ESTIMATING, OPERATIONS, AND FINANCE, TO DEVELOP COMPELLING VALUE PROPOSITIONS, PRICING STRATEGIES, AND PROJECT DELIVERY PLANS THAT DIFFERENTIATE OUR COMPANY IN THE MARKETPLACE.\nNETWORKING AND INDUSTRY ENGAGEMENT: REPRESENT THE COMPANY AT INDUSTRY EVENTS, CONFERENCES, AND NETWORKING FORUMS TO ENHANCE BRAND VISIBILITY, EXPAND PROFESSIONAL NETWORKS, AND BUILD STRATEGIC PARTNERSHIPS. IDENTIFY KEY INFLUENCERS, STAKEHOLDERS, AND DECISION-MAKERS IN THE CONSTRUCTION INDUSTRY AND DEVELOP TARGETED ENGAGEMENT STRATEGIES TO FOSTER MEANINGFUL CONNECTIONS AND BUSINESS RELATIONSHIPS.\nQUALIFICATIONS:BACHELOR'S DEGREE IN BUSINESS ADMINISTRATION, MARKETING, ENGINEERING, OR RELATED FIELD; MASTER'S DEGREE OR PROFESSIONAL CERTIFICATIONS PREFERRED.MINIMUM OF 7-10 YEARS OF PROGRESSIVE EXPERIENCE IN BUSINESS DEVELOPMENT, SALES, OR MARKETING ROLES WITHIN THE CONSTRUCTION INDUSTRY.PROVEN TRACK RECORD OF SUCCESS IN DRIVING REVENUE GROWTH, SECURING NEW BUSINESS OPPORTUNITIES, AND BUILDING LASTING CLIENT RELATIONSHIPS.STRONG BUSINESS ACUMEN, STRATEGIC THINKING, AND ANALYTICAL SKILLS, WITH THE ABILITY TO IDENTIFY MARKET TRENDS, ASSESS COMPETITIVE LANDSCAPES, AND DEVELOP DATA-DRIVEN BUSINESS STRATEGIES.EXCELLENT COMMUNICATION, NEGOTIATION, AND INTERPERSONAL SKILLS, WITH THE ABILITY TO ENGAGE AND INFLUENCE STAKEHOLDERS AT ALL LEVELS OF THE ORGANIZATION.RESULTS-ORIENTED MINDSET, WITH A FOCUS ON ACHIEVING MEASURABLE OUTCOMES, EXCEEDING TARGETS, AND DELIVERING EXCEPTIONAL CUSTOMER VALUE.\nCOMPENSATION AND BENEFITS:COMPETITIVE BASE SALARY, PERFORMANCE-BASED BONUSES, AND INCENTIVES TIED TO INDIVIDUAL AND COMPANY PERFORMANCE.COMPREHENSIVE BENEFITS PACKAGE, INCLUDING HEALTH, DENTAL, AND VISION INSURANCE, RETIREMENT SAVINGS PLAN, AND PAID TIME OFF.OPPORTUNITIES FOR PROFESSIONAL DEVELOPMENT, TRAINING, AND CAREER ADVANCEMENT WITHIN THE COMPANY.\nHOW TO APPLY:\nTO APPLY FOR THE POSITION OF BUSINESS DEVELOPMENT DIRECTOR, PLEASE SUBMIT YOUR RESUME AND COVER LETTER. IN YOUR COVER LETTER, PLEASE HIGHLIGHT YOUR RELEVANT EXPERIENCE, QUALIFICATIONS, AND WHY YOU ARE INTERESTED IN JOINING OUR TEAM. PLEASE INCLUDE \"BUSINESS DEVELOPMENT DIRECTOR APPLICATION - [YOUR NAME]\" IN THE SUBJECT LINE OF YOUR EMAIL. WE THANK ALL APPLICANTS FOR THEIR INTEREST, BUT ONLY THOSE SELECTED FOR AN INTERVIEW WILL BE CONTACTED.\nWE ARE AN EQUAL OPPORTUNITY EMPLOYER COMMITTED TO DIVERSITY, EQUITY, AND INCLUSION. WE ENCOURAGE QUALIFIED INDIVIDUALS FROM ALL BACKGROUNDS TO APPLY.",
    "job_skill_set": [
      "market research",
      "strategic planning",
      "client relationship management",
      "communication",
      "negotiation",
      "business acumen",
      "analytical skills",
      "sales",
      "marketing",
      "relationship building",
      "team collaboration",
      "results-oriented mindset",
      "interpersonal skills",
      "influencing skills",
      "problem solving",
      "adaptability",
      "proposal development"
    ],
    "short_keywords": [
      "acumen",
      "adaptability",
      "analytical",
      "building",
      "business",
      "businessdevelopment",
      "client",
      "collaboration",
      "communication",
      "development",
      "director",
      "influencing",
      "interpersonal",
      "management",
      "market",
      "marketing",
      "mindset",
      "negotiation",
      "planning",
      "problem",
      "proposal",
      "relationship",
      "research",
      "resultsoriented",
      "sales",
      "skills",
      "solving",
      "strategic",
      "team"
    ]
  },
  {
    "job_id": "3891266979",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "COMPANY IS A FAST GROWING SERVICE COMPANY SPECIALIZING IN VAPOR RECOVERY AND EMISSIONS COMPLIANCE SOLUTIONS FOR THE OIL & GAS INDUSTRY.\n\nWE ARE CURRENTLY SEEKING A FULL-TIME BUSINESS DEVELOPMENT MANAGER IN THE WEST TEXAS AREA. SEEKING A QUALIFIED AND HIGHLY MOTIVATED SALES PROFESSIONAL TO MAINTAIN AND GROW OUR SALES TERRITORY.\n\nTHE IDEAL CANDIDATE WILL BE\n\nHAVE KNOWLEDGE OF OILFIELD, PRODUCTION AND PRODUCTION FACILITIES, COMPRESSION OPERATIONS, VAPOR RECOVERY, ESG PRACTICES.KNOWLEDGE OF ENVIRONMENTAL, OOOOA REGULATIONS A POSITIVE.ABLE TO GRASP AND SOLVE COMPLEX PROBLEMS WHILE HELPING OUR CUSTOMERS REACH THEIR GOALS.DEDICATED TO KNOWING EVERYTHING ABOUT THE PRODUCTS AND SERVICES THEY ARE SELLING.INQUISITIVE AS TO CUSTOMERS' DECISIONS AND HOW THEY CAME TO THEIR DECISIONS.HAVE A HIGH LEVEL OF WRITTEN AND VERBAL COMMUNICATION SKILLS.HAVE A HIGH LEVEL OF ORGANIZATION.WILLING TO TRAVEL REGULARLY AS PART OF THE JOB.SELF-STARTER WITH NO NEED FOR CONSTANT SUPERVISION.COMPUTER SKILLS INCLUDING MICROSOFT EXCEL, WORD, AND POWER POINT ARE REQUIRED.DEDICATED TO USING A CRM.\n\nRESPONSIBILITIES\n\nACTIVELY PURSUE BUSINESS THROUGH COLD CALLS AND SCHEDULED APPOINTMENTS.PROPERLY SCHEDULE SOLD WORK THROUGH OFFICE STAFF AND OPERATIONS.REPORT ACTIVITY ON A DAILY BASIS INTO COMPANY CUSTOMER RELATIONS MANAGEMENT SOFTWARE.MAINTAIN CUSTOMER RELATIONSHIPS THROUGH FOLLOW-UP AND SERVICE.\n\nREQUIREMENTS\n\n2+ YEARS OF SALES EXPERIENCE.ABILITY TO DEMONSTRATE TECHNICAL KNOWLEDGE.POSSESS A HIGH LEVEL OF BUSINESS ACUMEN.WILLINGNESS TO TRAVEL AS NEEDED.\n\nPREFERRED\n\nBACHELOR'S DEGREE FROM AN ACCREDITED UNIVERSITY.1-2 YEARS OF SALES EXPERIENCE IN ENVIRONMENTAL, PRODUCTION, OR FACILITIES.\n\nCOMPENSATION\n\nBASE PLUS COMMISSION, TRUCK ALLOWANCE, 401K MATCH, HEALTH/DENTAL/VISION BENEFITS. ACTUAL COMPENSATION IS BASED ON EXPERIENCE.\n\nBENEFITS\n\n401(K)401(K) MATCHINGDENTAL INSURANCEHEALTH INSURANCEPAID TIME OFFVISION INSURANCE\n\nWORK LOCATION: HYBRID REMOTE IN MIDLAND, TX 79706\n\n",
    "job_skill_set": [
      "Sales",
      "CRM Software",
      "Business Acumen",
      "Communication",
      "Problem Solving",
      "Organization",
      "Self-Starter",
      "Customer Relationship Management",
      "Oilfield Knowledge",
      "Environmental Regulations Knowledge",
      "Microsoft Excel",
      "Microsoft Word",
      "Microsoft PowerPoint",
      "Technical Knowledge",
      "Vapor Recovery Knowledge",
      "Inquisitiveness",
      "Travel Willingness"
    ],
    "short_keywords": [
      "acumen",
      "business",
      "businessdevelopment",
      "communication",
      "crm",
      "customer",
      "development",
      "environmental",
      "excel",
      "inquisitiveness",
      "knowledge",
      "management",
      "manager",
      "microsoft",
      "oilfield",
      "organization",
      "powerpoint",
      "problem",
      "recovery",
      "regulations",
      "relationship",
      "sales",
      "selfstarter",
      "software",
      "solving",
      "technical",
      "travel",
      "vapor",
      "willingness",
      "word"
    ]
  },
  {
    "job_id": "3902933182",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "THE BUSINESS DEVELOPMENT REPRESENTATIVE AT REVALIZE PLAYS A CRITICAL ROLE IN GROWING OUR BUSINESS. THIS POSITION WILL FOCUS ON DEVELOPING QUALIFIED PROSPECTS FOR OUR SALES PROCESS THROUGH COLD-CALLING, REFERRAL NETWORK NURTURING, PARTNER CHANNEL DEVELOPMENT AND THE MANAGEMENT OF VARIOUS MARKETING AND SOCIAL MEDIA PROGRAMS DESIGNED TO CULTIVATE PROSPECTS FOR DEEPER QUALIFICATION.\nLOCATIONREMOTE IN THE UNITED STATES\nRESPONSIBILITIES COMMIT TO AND DELIVER ON STANDARD SERVICE LEVEL AGREEMENT WITH REGARDS TO LEAD FOLLOW-UP PROTOCOL, BRAND MESSAGING, BUSINESS SYSTEM PROCESS ADHERENCE, AND KEY-PERFORMANCE-INDICATOR TRACKING/REPORTING.DEVELOP TARGET PROSPECT LISTS AND EXECUTE COLD OUTREACH TO LEADERS AT SELECT ACCOUNTS.PROVIDE HIGH-LEVEL INFORMATION AS TO WHY REVALIZE IS THE RIGHT SOLUTION FOR THEIR NEEDS.GENERATE QUALIFIED LEADS AND SET MEETINGS TO CREATE QUALIFIED OPPORTUNITIES FOR THE ACCOUNT EXECUTIVE TEAM.MANAGE A PIPELINE AND PROVIDING ACCURATE DATA IN SALESFORCE TO BE USED FOR FORECASTING.UTILIZE FULL-SUITE OF TECH-STACK SOLUTIONS DESIGNED TO ENHANCE PROSPECTING MOTIONS THROUGH INTENT PREDICTIVE MODELS, SALES ENABLEMENT SOFTWARE, EMAIL NURTURE AUTOMATION SEQUENCING, DATA ENRICHMENT PROGRAMS, AND AUTOMATED SALES/MARKETING CRM/CLOUD SOLUTIONS. TOOLS INCLUDE: SALESFORCE, HUBSPOT, 6SENSE, RING LEAD, ZOOM INFO, SEISMIC, LIVE SOCIAL, AND OTHERS.\nQUALIFICATIONS0-2 YEARS’ AT A BUSINESS-TO-BUSINESS ORGANIZATION IN AN INSIDE BUSINESS DEVELOPMENT OR INSIDE SALES ROLE – RECENT GRADUATES WELCOME.BACHELOR’S DEGREE PREFERRED.CONFIDENT, CLEAR AND SUCCINCT COMMUNICATION STYLE – BOTH WRITTEN AND VERBAL.PRIOR EXPERIENCE WITH SALESFORCE AND OUTREACH.IO PREFERRED.ABILITY TO LEARN QUICKLY AND ADAPT TO CHANGES IN A FAST PACED ENVIRONMENT\nADDITIONAL INFORMATIONALL YOUR INFORMATION WILL BE KEPT CONFIDENTIAL ACCORDING TO EEO GUIDELINES. QUALIFIED APPLICANTS WILL BE ASKED TO COMPLETE A 30-MINUTE ONLINE ASSESSMENT AS A PART OF YOUR APPLICATION. THE OFFICIAL WORKING TIME ZONES ARE EST FOR US EMPLOYEES AND CET FOR EMEA EMPLOYEES.",
    "job_skill_set": [
      "Salesforce",
      "HubSpot",
      "6sense",
      "Ring Lead",
      "Zoom Info",
      "Seismic",
      "Live Social",
      "Email Nurture Automation",
      "Data Enrichment Programs",
      "CRM Solutions",
      "Cold Calling",
      "Lead Generation",
      "Business Development",
      "Marketing Programs",
      "Social Media Management",
      "Sales Enablement Software",
      "Intent Predictive Models",
      "Communication",
      "Adaptability",
      "Problem Solving",
      "Teamwork",
      "Time Management",
      "Attention to Detail",
      "Customer Focus"
    ],
    "short_keywords": [
      "6sense",
      "adaptability",
      "attention",
      "automation",
      "business",
      "businessdevelopment",
      "calling",
      "cold",
      "communication",
      "crm",
      "customer",
      "data",
      "detail",
      "development",
      "email",
      "enablement",
      "enrichment",
      "focus",
      "generation",
      "hubspot",
      "info",
      "intent",
      "lead",
      "live",
      "management",
      "marketing",
      "media",
      "models",
      "nurture",
      "predictive",
      "problem",
      "programs",
      "representative",
      "ring",
      "sales",
      "salesforce",
      "seismic",
      "social",
      "software",
      "solutions",
      "solving",
      "teamwork",
      "time",
      "to",
      "zoom"
    ]
  },
  {
    "job_id": "3902945207",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "WHO WE’RE HIRING:GAMEWELL MECHANICAL IS LOOKING FOR AN EXPERIENCED BUSINESS DEVELOPMENT MANAGER TO JOIN OUR TEAM! THE BUSINESS DEVELOPMENT MANAGER WILL PLAY A KEY ROLE IN DRIVING BUSINESS GROWTH BY IDENTIFYING AND SECURING NEW PROJECT OPPORTUNITIES. THIS INDIVIDUAL WILL BE RESPONSIBLE FOR CULTIVATING RELATIONSHIPS WITH POTENTIAL CLIENTS, UNDERSTANDING THEIR PROJECT NEEDS, AND DESIGNING AND PRESENTING TAILORED SOLUTIONS THAT ALIGN WITH OUR COMPANY’S CAPABILITIES AND EXPERTISE ACROSS NORTH AND SOUTH CAROLINA. THE IDEAL CANDIDATE WILL BE WELL CONNECTED IN THE INDUSTRY AND HAVE A MECHANICAL ENGINEERING BACKGROUND.WHO WE ARE:GAMEWELL MECHANICAL HAS EARNED THE REPUTATION OF QUALITY CONSTRUCTION…AHEAD OF SCHEDULE. FOR OVER 40 YEARS, WE HAVE APPROACHED OUR WORK WITH THE CUSTOMER’S BEST INTEREST IN MIND TO SERVE AND PROVIDE THE BEST CONSTRUCTION AT THE LOWEST COST. WE ALSO INVEST IN OUR EMPLOYEES’ FUTURE THROUGH TRAINING PROGRAMS AND A PASSION FOR WORKPLACE SAFETY. WE ARE LOOKING FOR HARDWORKING, GOAL-ORIENTED INDIVIDUALS TO JOIN OUR TEAM AS WE CONTINUE TO GROW AND EXCEED EXPECTATIONS!WHAT WE OFFER:GAMEWELL MECHANICAL OFFERS A WIDE RANGE OF EMPLOYEE BENEFITS, INCLUDING:· A WELCOMING, FAMILY-ORIENTED WORK ENVIRONMENT THAT SUPPORTS WORK/LIFE BALANCE.· 401K PLAN WITH ROTH AND TRADITIONAL OPTIONS, INCLUDING A 25% COMPANY MATCH ON UP TO 6% OF YOUR INCOME.· MEDICAL INSURANCE WITH THREE PLAN CHOICES, INCLUDING HEALTH SAVINGS ACCOUNT OPTIONS.· DENTAL INSURANCE COVERAGE.· VISION INSURANCE COVERAGE.· FLEXIBLE SPENDING ACCOUNT.· TUITION REIMBURSEMENT.· PAID TIME OFF THAT INCREASES WITH YEARS OF SERVICE.· EMPLOYEE ASSISTANCE PROGRAM FOR SUPPORT WHEN NEEDED.WHAT YOU’LL DO: · CLIENT RELATIONSHIP MANAGEMENTO DEVELOP AND NURTURE RELATIONSHIPS WITH KEY DECISION-MAKERS AND STAKEHOLDERS AT TARGET COMPANIES.O CONDUCT MEETINGS, PRESENTATIONS, AND NEGOTIATIONS WITH CLIENTS TO UNDERSTAND THEIR PROJECT REQUIREMENTS AND OBJECTIVES.· BID SCHEDULEO MAINTAIN AND PROVIDE PRE-QUALIFICATION PACKAGES TO CLIENTS AS NEEDED.O COLLABORATE WITH ESTIMATING DEPARTMENT TO OVERSEE WORKLOAD AND STRATEGY.O COORDINATE WITH SUBCONTRACTORS AND SUPPLIERS FOR ACCURATE SCOPES OF WORK AND MATERIALS.O FACILITATE BID PRESENTATION AND REVIEW MEETINGS WITH CLIENTS.· BUSINESS DEVELOPMENTO IMPLEMENT A COMPREHENSIVE BUSINESS DEVELOPMENT PLAN AND COORDINATE YOUR OWN SALES SCHEDULE TO BEST MEET GOALS AND EXPECTATIONS FOR THE COMPANY.O PROVIDE REGULAR REPORTS AND UPDATES TO MANAGEMENT ON SALES PIPELINE, REVENUE FORECASTS, AND MARKET INSIGHTS.O COORDINATE WITH OPERATIONS FOR UPCOMING WORK.O PROPOSE PREFABRICATED MODULES IN SALES PITCHES FOR MORE EFFICIENT USE OF RESOURCES IN SHOP.O RESEARCH AND ANALYZE MARKET TRENDS, COMPETITOR ACTIVITIES, AND INDUSTRY DEVELOPMENTS TO IDENTIFY POTENTIAL LEADS.O BUILD AND MAINTAIN A ROBUST PIPELINE OF PROSPECTIVE PROJECTS THROUGH NETWORKING, COLD CALLING, AND OTHER LEAD GENERATION METHODS.WHAT YOU’LL BRING:· BACHELOR’S DEGREE IN MECHANICAL ENGINEERING OR EQUIVALENT WORK EXPERIENCE.· EXCELLENT COMMUNICATION, PRESENTATION, AND NEGOTIATION SKILLS.· EXPERIENCE IN EQUIPMENT SALES OR DESIGN IS ENCOURAGED.· PREVIOUS EXPERIENCE IN CONSTRUCTION OR ESTIMATING IS PREFERRED.· EXCELLENT MICROSOFT WORD AND EXCEL SKILLS.· MUST BE ABLE TO CRAWL, KNEEL, SQUAT, AND CLIMB. · MUST BE ABLE TO LIFT UP TO 50 POUNDS ON A REGULAR BASIS, UNASSISTED. · MUST BE ABLE TO STAND AND WALK FOR EXTENDED PERIODS OF TIME.  NOT EVERYONE MAY FULFILL ALL THE REQUIREMENTS LISTED HERE. IF YOU POSSESS THE NECESSARY SKILLS BUT ARE UNSURE ABOUT YOUR BACKGROUND, PLEASE DON’T HESITATE TO APPLY. WE WELCOME YOUR APPLICATION AND ARE EAGER TO EXPLORE THE OPPORTUNITY WITH YOU. WE’RE CONSTANTLY SEEKING INDIVIDUALS WHO CAN CONTRIBUTE TO OUR COMPANY’S GROWTH AND SUCCESS.AT GAMEWELL MECHANICAL, WE’RE DEDICATED TO CREATING A RESPECTFUL AND INCLUSIVE WORKPLACE. WE’RE AN EQUAL OPPORTUNITY EMPLOYER AND DON’T DISCRIMINATE BASED ON VARIOUS FACTORS, INCLUDING RACE, RELIGION, GENDER, AGE, OR DISABILITY. OUR EMPLOYMENT DECISIONS ARE SOLELY BASED ON MERIT, COMPETENCE, PERFORMANCE, AND BUSINESS REQUIREMENTS, ENSURING FAIRNESS AND EQUAL OPPORTUNITIES FOR ALL.",
    "job_skill_set": [
      "business development",
      "mechanical engineering",
      "client relationship management",
      "presentation skills",
      "negotiation skills",
      "market analysis",
      "sales forecasting",
      "lead generation",
      "communication",
      "teamwork",
      "problem solving",
      "goal-oriented",
      "adaptability",
      "networking",
      "customer service",
      "time management",
      "Microsoft Word",
      "Microsoft Excel",
      "construction estimating",
      "prefabricated modules"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "business",
      "businessdevelopment",
      "client",
      "communication",
      "construction",
      "customer",
      "development",
      "engineering",
      "estimating",
      "excel",
      "forecasting",
      "generation",
      "goaloriented",
      "lead",
      "management",
      "manager",
      "market",
      "mechanical",
      "microsoft",
      "modules",
      "negotiation",
      "networking",
      "prefabricated",
      "presentation",
      "problem",
      "relationship",
      "sales",
      "service",
      "skills",
      "solving",
      "teamwork",
      "time",
      "word"
    ]
  },
  {
    "job_id": "3905824527",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "BUSINESS DEVELOPMENT MANAGERORLANDO, FLORIDA BASED GLOBAL PROCUREMENT SOLUTIONS, INC. IS A SERVICE-DISABLED VETERANOWNED SMALL BUSINESS (SDVOSB) THAT WAS FOUNDED IN 2010 AND SPECIALIZES IN SUPPLYING AVARIETY OF CONSUMER PRODUCTS FROM MAJOR US MANUFACTURERS TO THE U.S. DEPARTMENT OF VETERANSAFFAIRS AND U.S. DEPARTMENT OF DEFENSE.\nWE ARE SEEKING A BUSINESS DEVELOPMENT MANAGER TO PLAY A CRITICAL ROLE IN DRIVING ORGANIC ANDINORGANIC SALES, IN ADDITION TO BUILDING AND MAINTAINING A MULTITUDE OF RELATIONSHIPS WITHMANUFACTURER AND DISTRIBUTOR PARTNERS.\nEXPERIENCE IN WORKING WITH VETERANS AFFAIRS MEDICAL CENTERS (VAMC), HEALTHCARE ANDGOVERNMENT ENTITIES IS A BONUS. THIS IS AN ONSITE MANAGEMENT-LEVEL POSITION; NOT REMOTE.\nKEY RESPONSIBILITIES:• FACILITATE INTRODUCTORY IN PERSON MEETINGS FOR HUNDREDS OF MANUFACTURER REPS AT VA MEDICALCENTERS (VAMC) ACROSS THE USA. FORCE THE CONVERSION PROCESS THROUGH MULTIPLE DEPARTMENTSWITHIN THE VAMCS.• DEVELOP AND IMPLEMENT COMPREHENSIVE SALES STRATEGIES TO ACHIEVE REVENUE TARGETS AND DRIVEBUSINESS GROWTH, WITH A FOCUS ON EXPANDING OUR CUSTOMER BASE WITHIN THE VAMCS’ ANDGOVERNMENT SECTORS.• LEAD AND MENTOR OUR INSIDE SALES REPRESENTATIVE TO MAXIMIZE PERFORMANCE.• IDENTIFY AND PURSUE NEW BUSINESS OPPORTUNITIES THROUGH PROACTIVE NETWORKING.• BUILD AND MAINTAIN STRONG RELATIONSHIPS WITH KEY STAKEHOLDERS, INCLUDING GOVERNMENT AGENCIES,PROCUREMENT OFFICERS, AND STRATEGIC PARTNERS, TO POSITION THE COMPANY AS A TRUSTED PROVIDER.• COLLABORATE WITH INTERNAL TEAMS, PRIMARILY CUSTOMER SERVICE, TO ALIGN SALES GOALS WITH COMPANYOBJECTIVES.• ANALYZE MARKET TRENDS AND CUSTOMER FEEDBACK TO GUIDE PRODUCT DEVELOPMENT.\nQUALIFICATIONS:• BACHELOR’S OR MBA LEVEL DEGREE IN BUSINESS / FINANCE RELATED CATEGORY PREFERRED.• 5-8 YEARS OF SALES EXPERIENCE, PREFERABLY IN JANITORIAL/SANITATION PRODUCTS.• UNDERSTANDING OF GOVERNMENT PROCUREMENT PROCESSES, ESPECIALLY IN HEALTHCARE.• STRONG LEADERSHIP AND COMMUNICATION SKILLS.• PROVEN RECORD OF ACCOMPLISHMENT OF SUCCESS IN DRIVING SALES GROWTH, ACHIEVING REVENUE TARGETS,AND LEADING HIGH-PERFORMING SALES TEAMS.• PROFICIENCY IN CRM SOFTWARE AND MICROSOFT OFFICE.• MILITARY BACKGROUND WILL BE HIGHLY CONSIDERED\nBENEFITS:• COMPETITIVE SALARY WITH BONUS INCENTIVES• HEALTH, DENTAL, AND VISION INSURANCE• 401K• PAID TIME OFF AND HOLIDAYS",
    "job_skill_set": [
      "sales strategies",
      "Microsoft Office",
      "market analysis",
      "business development",
      "relationship management",
      "team leadership",
      "product development",
      "communication",
      "networking",
      "mentoring",
      "problem solving",
      "collaboration",
      "adaptability",
      "CRM software",
      "government procurement processes",
      "revenue targets"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "crm",
      "development",
      "government",
      "leadership",
      "management",
      "manager",
      "market",
      "mentoring",
      "microsoft",
      "networking",
      "office",
      "problem",
      "processes",
      "procurement",
      "product",
      "relationship",
      "revenue",
      "sales",
      "software",
      "solving",
      "strategies",
      "targets",
      "team"
    ]
  },
  {
    "job_id": "3905372456",
    "job_title": "New Role! - $5M in Seed Funding! - Business Development Manager – 3PL Logistics/Warehousing Startup - $100k -$120k Base, Double OTE- Work From Home",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "OUR STAFFING AGENCY REPRESENTS A PRIVATELY HELD 3PL LOGISTICS AND SUPPLY CHAIN FIRM EXPERIENCING INCREDIBLE GROWTH.\nTHIS EARLY-STAGE STARTUP, BASED IN THE NORTHEAST AND RECENTLY AWARDED WITH $5M IN SEED FUNDING, IS RECOGNIZED AS A PROMINENT PLAYER IN THE SUPPLY CHAIN SECTOR. THEY ARE CURRENTLY SEEKING A BUSINESS DEVELOPMENT MANAGER TO SECURE LARGE, NET-NEW DEALS ($250K AND ABOVE). WHILE THE ROLE IS REMOTE, CANDIDATES MUST RESIDE IN A PREFERRED METRO AREA, WITH PREFERENCE GIVEN TO THOSE IN THE EASTERN U.S.\nSOLUTIONEXPERTS IN WAREHOUSING, DISTRIBUTION, KITTING, INVENTORY MANAGEMENT, AND FULFILLMENT, OUR COMPANY HAS CREATED A POWERFUL E-COMM API THAT WILL INTEGRATE WITH ALL YOUR PARTNERS: FROM AMAZON, MAGENTO, AND EBAY, ALL THE WAY TO THE UNITED STATES POST OFFICE. THEY HAVE YOU COVERED.\nOUR FULFILLMENT & LOGISTICS SERVICES CATER TO VARIOUS INDUSTRIES AND THEIR SPECIFIC CHALLENGES. WE PROVIDE COMPREHENSIVE SUPPORT, INCLUDING GLOBAL LOGISTICS, INVENTORY MANAGEMENT, VENDOR MANAGEMENT, SUBSCRIPTION MANAGEMENT, AMAZON PREP, AND SUPPLY CHAIN ENHANCEMENTS. OUR SERVICES ARE BACKED BY ADVANCED INFORMATION TECHNOLOGY SYSTEMS, ALL OPERATING ON A UNIFIED GLOBAL PLATFORM.\nROLE\n* INDIVIDUAL CONTRIBUTOR, WORKING FROM YOUR HOME OFFICE. IN OFFICE VISITS ONCE OR TWICE PER MONTH.* $100K - $120K BASE SALARY, COMMENSURATE WITH YOUR EXPERIENCE. UNCAPPED COMMISSIONS, WITHDOUBLE OTE FIRST YEAR.* MUST HAVE 5 YEARS OF EXPERIENCE IN THE 3PL SERVICES MARKET.* MUST BE ABLE TO BRING OVER AN EXISTING BOOK OF SIGNIFICANT BUSINESS.*WE ARE LOOKING FOR A HUNTER MENTALITY WHO IS NOT AFRAID OF THE PHONE.* 25% TRAVEL, AND TERRITORY IS THE ENTIRE UNITED STATES.* STARTUP EXPERIENCE MOVES YOU TO THE TOP OF THE LIST.\n\nOFFICIAL JOB DESCRIPTION\nPOSITION OVERVIEW:\nTHE BUSINESS DEVELOPMENT MANAGER WILL CONTACT NEW BUSINESSES BY CONTACTING NEW AND EXISTING CUSTOMERS. THIS ROLE WILL LEAD FRONT-END ENGAGEMENT, SET UP AND CONDUCT PRESENTATIONS, AND WORK WITH EXECUTIVE MANAGEMENT TO SECURE BUSINESS. THE ROLE WILL ALSO BE INSTRUMENTAL FOR UP TO 90 DAYS POST-SALE TO ENSURE PROPER MANAGEMENT AND HANDOFF OF THE CUSTOMER.\nTOP FOUR CANDIDATE CHARACTERISTICS:· SELF-STARTER AND INDEPENDENT WORKER· MUST HAVE 3PL EXPERIENCE.· MUST HAVE A CURRENT BOOK OF BUSINESS TO BRING TO THE POSITION.· EXPERIENCE AND DESIRE TO WORK IN A FAST-PACED, ENTREPRENEURIAL, STARTUP ENVIRONMENT.\nRESPONSIBILITIES:· ESTABLISH PRODUCTIVE AND PROFESSIONAL RELATIONSHIPS WITH KEY PERSONNEL IN ASSIGNED CUSTOMER ACCOUNTS.· WORK COLLABORATIVELY ACROSS INTERNAL TEAMS, INCLUDING SUPPORT, SERVICE, AND MANAGEMENT RESOURCES, TO MEET ACCOUNT PERFORMANCE OBJECTIVES AND CUSTOMERS’ EXPECTATIONS.· MEET ASSIGNED TARGETS FOR PROFITABLE SALES VOLUME AND STRATEGIC OBJECTIVES IN POSTED ACCOUNTS.· PROACTIVELY LEAD A JOINT COMPANY-STRATEGIC ACCOUNT PLANNING PROCESS THAT DEVELOPS MUTUAL PERFORMANCE OBJECTIVES, FINANCIAL TARGETS, AND CRITICAL MILESTONES FOR ONE AND THREE YEARS.· PROACTIVELY ASSESS, CLARIFY, AND VALIDATE CUSTOMER NEEDS ON AN ONGOING BASIS.· LEAD SOLUTION-BASED DEVELOPMENT EFFORTS THAT BEST ADDRESS CUSTOMER NEEDS WHILE COORDINATING THE INVOLVEMENT OF ALL NECESSARY COMPANY PERSONNEL.\nPERFORMANCE MEASURES:· ACHIEVE ASSIGNED SALES QUOTA WITHIN DESIGNATED ACCOUNTS.· MEET ASSIGNED EXPECTATIONS FOR PROFITABILITY.· ACHIEVE STRATEGIC CUSTOMER OBJECTIVES DEFINED BY COMPANY MANAGEMENT.· COMPLETE STRATEGIC CUSTOMER ACCOUNT PLANS THAT MEET COMPANY STANDARDS.· MAINTAIN HIGH CUSTOMER SATISFACTION RATINGS THAT MEET COMPANY STANDARDS.· COMPLETE REQUIRED TRAINING AND DEVELOPMENT OBJECTIVES WITHIN THE ASSIGNED TIME FRAME.\nORGANIZATIONAL ALIGNMENT:· WILL REPORT TO THE VICE PRESIDENT OF SALES.· ENLIST THE SUPPORT OF SALES SPECIALISTS, IMPLEMENTATION RESOURCES, SERVICE RESOURCES, AND OTHER SALES AND MANAGEMENT RESOURCES AS NEEDED.· CLOSELY COORDINATE COMPANY EXECUTIVE INVOLVEMENT WITH CUSTOMER MANAGEMENT.· WORK CLOSELY WITH CUSTOMER SERVICE REPRESENTATIVES TO ENSURE CUSTOMER SATISFACTION AND PROBLEM RESOLUTION.· FUTURE POTENTIAL TO HAVE DIRECT REPORT STAFF ASSIGNED TO SUPPORT RESPONSIBILITIES IN SPECIFIC CUSTOMERS.\n QUALIFICATIONS:· 5+ YEARS EXPERIENCE IN THE 3PL SERVICES MARKET.· CANDIDATE MUST HAVE A PORTABLE BOOK OF BUSINESS AND HAVE THE WILL TO HUNT.· ABILITY TO COLD-CALL AND MAKE FACE TO FACE APPOINTMENTS.\n· PC PROFICIENCY, CRM, AND MS OFFICE PROFICIENCY.· ASSOCIATE DEGREE OR HIGHER IS PREFERRED.· REQUIRES MINIMALLY 25% TRAVEL.· BACKGROUND CHECK REQUIRED.· MUST COMPLETE A PXT SELECT SALES ASSESSMENT.",
    "job_skill_set": [
      "business development",
      "sales",
      "MS Office proficiency",
      "cold calling",
      "presentation skills",
      "customer relationship management",
      "data analysis",
      "self-starter",
      "independent worker",
      "communication",
      "team collaboration",
      "problem solving",
      "adaptability",
      "negotiation",
      "customer focus",
      "entrepreneurial mindset",
      "time management",
      "3PL services",
      "CRM proficiency",
      "territory management"
    ],
    "short_keywords": [
      "100k",
      "120k",
      "3pl",
      "5m",
      "adaptability",
      "analysis",
      "base",
      "business",
      "businessdevelopment",
      "calling",
      "cold",
      "collaboration",
      "communication",
      "crm",
      "customer",
      "data",
      "development",
      "double",
      "entrepreneurial",
      "focus",
      "from",
      "funding",
      "home",
      "in",
      "independent",
      "logisticswarehousing",
      "management",
      "manager",
      "mindset",
      "ms",
      "negotiation",
      "new",
      "office",
      "ote",
      "presentation",
      "problem",
      "proficiency",
      "relationship",
      "role",
      "sales",
      "seed",
      "selfstarter",
      "services",
      "skills",
      "solving",
      "startup",
      "team",
      "territory",
      "time",
      "work",
      "worker"
    ]
  },
  {
    "job_id": "3901699101",
    "job_title": "Business Development Manager (Health & Life Sciences)",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "BUILD YOUR BIG CAREER WITH THE FIRM THAT DOES BIG LAW BETTER. MCDERMOTT WILL & EMERY IS A LEADING GLOBAL LAW FIRM THAT BRINGS TOGETHER MORE THAN 1,400 LAWYERS AND 1,200 BUSINESS PROFESSIONALS. WE CELEBRATE EXCELLENCE, COLLABORATION AND COMMUNITY AND HAVE BEEN RECOGNIZED AS A TOP WORKPLACE BY THE AMERICAN LAWYER, WORKING MOTHER MAGAZINE, VAULT AND THE HUMAN RIGHTS CAMPAIGN.\n\nAT MCDERMOTT, WE DON’T JUST INVEST IN YOUR FUTURE, WE ACCELERATE YOUR CAREER – WHEREVER IT MAY LEAD. THAT INCLUDES SUPPORTING YOU BOTH IN AND OUTSIDE OF THE OFFICE.\n\nWITH US, YOU’LL FIND\n\nA FIRM WHERE EVERYONE BELONGS: OUR AWARD-WINNING CULTURE PRIORITIZES WARMTH AND AUTHENTICITY — WE ENCOURAGE YOU TO BE YOURSELF!ENTHUSIASM FOR DIVERSE PERSPECTIVES: WE’RE SMARTER AND STRONGER WHEN EVERYONE HAS A VOICE AND A SEAT AT THE TABLE. WE WELCOME UNIQUE VIEWPOINTS AND IDEAS, AND WE MAKE OPPORTUNITIES FOR YOU AND YOUR CAREER TO THRIVE.SUPPORT TO FEEL YOUR BEST AND DO YOUR BEST: WELLNESS IS INTEGRAL TO BUILDING A SUCCESSFUL CAREER AND A RICH LIFE. THAT’S WHY OUR BENEFITS PROGRAM SUPPORTS YOUR PHYSICAL, EMOTIONAL, MENTAL AND FINANCIAL HEALTH, WITH AN EMPHASIS ON WORK/LIFE BALANCE.REAL REWARDS FOR REAL WORK: WE OFFER GENEROUS COMPENSATION PACKAGES THAT RECOGNIZE HARD WORK AND EXCELLENCE.\n\nTHE BUSINESS DEVELOPMENT MANAGER MAINTAINS THE BUSINESS DEVELOPMENT RELATIONSHIP WITH ATTORNEYS IN THE HEALTH & LIFE SCIENCES PRACTICE GROUP. THIS POSITION DEVELOPS AND IMPLEMENTS BUSINESS DEVELOPMENT STRATEGIES IN ORDER TO EXPAND CLIENT RELATIONSHIPS, INCREASE REVENUE AND BRAND RECOGNITION, WHILE OVERSEEING BUSINESS DEVELOPMENT TEAM MEMBERS AND DEPARTMENTAL PROCESSES. THE BUSINESS DEVELOPMENT MANAGER RELIES ON EXTENSIVE EXPERIENCE AND JUDGMENT TO PLAN AND ACCOMPLISH PRACTICE GROUP GOALS.\n\nAS A BUSINESS DEVELOPMENT MANAGER YOU WILL\n\nORGANIZE AND DRIVE CLIENT TARGETING PROGRAMS AND CAMPAIGNS FOR SUPPORTED AREAS, INCLUDING PROMPTING AND MONITORING PURSUIT ACTIVITIES, AND TRACKING AND REPORTING ON RESULTSLEAD AND DRAFT CONTENT FOR RFPS, PITCHES AND OTHER OPPORTUNITIES, INCLUDING COORDINATING WITH OTHER BUSINESS DEVELOPMENT TEAM MEMBERS, CONDUCTING FOLLOW UP AND TRACKING RESULTS IN SALESFORCEIDENTIFY AND FACILITATE CROSS-SELLING OPPORTUNITIES WITHIN THE DESIGNATED PRACTICE GROUP AND OTHER FIRM PRACTICE GROUPS, INCLUDING CRAFTING AND EXECUTING A RANGE OF GO-TO-MARKET STRATEGIES AROUND THESE OPPORTUNITIES AND COLLABORATING WITH OTHER BD TEAM MEMBERSLEAD THE STRATEGIC PLANNING AND EXECUTION OF SIGNATURE MCDERMOTT EVENTS, MAXIMIZING ENGAGEMENT AND BUSINESS IMPACT.SERVE AS LEAD POINT PERSON FOR PRACTICE AND FIRM-WIDE EVENTS, OVERSEEING CONTENT, TARGETING, SPEAKER ENGAGEMENT, EVENT LOGISTICS, AND FOLLOW-UP REPORTINGMONITOR INDUSTRY TRENDS AND CONDUCT STRATEGIC RESEARCH ON POTENTIAL CLIENTS, COMPETITORS AND PRACTICE DEVELOPMENTS TO IDENTIFY BUSINESS AND LEGAL OPPORTUNITIES AND ENSURE OPTIMAL POSITIONING TO GROW MARKET SHAREIDENTIFY AND FACILITATE PARTICIPATION IN SPONSORSHIPS, CONFERENCES, MEMBERSHIPS AND OTHER KEY PROFILE-BUILDING OPPORTUNITIES FOR THE PRACTICE, OFFICE AND INDIVIDUAL LAWYERSDRIVE COLLABORATION WITHIN BD DEPARTMENT AND FIRM TEAMS AND RESOURCES, IDENTIFYING AND LEVERAGING SYNERGISTIC OPPORTUNITIES TO ENHANCE SERVICE OFFERINGSNAVIGATE LATERAL HIRES THROUGH THE INTEGRATION PROCESS, ALIGNING THEM WITH FIRM PRIORITIES AND MONITORING MILESTONESMANAGE ASSIGNED LEGAL DIRECTORY AND LEAGUE RANKING SUBMISSIONS, AND ASSIST THE AWARDS TEAM IN THE GENERATION OF MATTERS AND OTHER INFORMATION FOR AWARDS SUBMISSIONSOVERSEE THE WORKFLOW AND PERFORMANCE OF BUSINESS DEVELOPMENT TEAM MEMBERS, ENSURING ACTIVE MANAGEMENT AND PROVIDING CONTINUOUS PERFORMANCE FEEDBACK, WHILE ALSO ENGAGING IN THE ANNUAL STAFF PERFORMANCE EVALUATION PROCESSESMANAGE, REVIEW AND TRACK THE BUSINESS DEVELOPMENT BUDGET FOR THE DESIGNATED PRACTICE GROUPCONSULT WITH ATTORNEYS TO DEVELOP AND MONITOR INDIVIDUAL BUSINESS DEVELOPMENT GOALS AND PLANSREVIEW AND REGULARLY UPDATE COLLATERAL AND EXPERIENCE FOR THE DESIGNATED PRACTICE GROUP, INCLUDING PRACTICE-WIDE COMMUNICATIONS, BROCHURES, AND PRESENTATIONS\n\nJOB SPECIFICATIONS\n\nBACHELOR’S DEGREEAT LEAST EIGHT YEARS OF RELATED WORK EXPERIENCEKNOWLEDGE OF MICROSOFT OFFICE SUITE (EXCEL, OUTLOOK, POWERPOINT, AND WORD)KNOWLEDGE OF CLIENT RELATIONSHIP MANAGEMENT (CRM) SOFTWARESTRONG WRITTEN AND VERBAL COMMUNICATION SKILLSSTRONG LEADERSHIP SKILLSSTRONG ANALYTICAL SKILLSABILITY TO WORK UNDER TIGHT DEADLINES AND PRIORITIZE RESPONSIBILITIESABILITY TO HANDLE AND MAINTAIN CONFIDENTIAL INFORMATIONABILITY TO TRAVEL AND WORK FLEXIBLE AND/OR FLUCTUATING WORK HOURSABILITY TO WORK INDEPENDENTLY AND UNDER OWN DIRECTION AND INITIATIVE\n\nAS PART OF OUR ONGOING COMMITMENT TO BE #ALWAYSBETTER FOR OUR PEOPLE, CLIENTS AND COMMUNITIES, WE HAVE CREATED A CULTURE OF BELONGING THAT CHAMPIONS YOUR INDIVIDUALITY AS BOTH A PERSON AND A PROFESSIONAL. FROM OUR COMPETITIVE COMPENSATION, TOP BENEFITS AND AWARD-WINNING PROFESSIONAL DEVELOPMENT PROGRAMS TO INDUSTRY-LEADING WELLNESS INITIATIVES, WE SUPPORT YOU THROUGH EVERY STAGE OF YOUR LIFE AND CAREER. WITH MCDERMOTT, YOU CAN LIVE A LIFE YOU LOVE BOTH IN AND OUTSIDE OF THE OFFICE.\n\nPHYSICAL DEMANDS AND WORK ENVIRONMENT\n\nTHE PHYSICAL DEMANDS AND WORK ENVIRONMENT CHARACTERISTICS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY AN EMPLOYEE TO SUCCESSFULLY PERFORM THE ESSENTIAL FUNCTIONS OF THIS JOB. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS.\n\nPHYSICAL DEMANDS\n\nWHILE PERFORMING THE DUTIES OF THIS JOB, THE EMPLOYEE IS REQUIRED TO SIT, USE HANDS, REACH WITH HANDS AND ARMS, STOOP, TALK AND HEAREMPLOYEE MUST OCCASIONALLY LIFT UP TO TWENTY (20) POUNDS\n\nWORK ENVIRONMENT\n\nTYPICAL INDOOR OFFICE ENVIRONMENT\n\nDISCLAIMER\n\nTHE ABOVE STATEMENTS ARE INTENDED TO DESCRIBE THE GENERAL NATURE AND LEVEL OF THE WORK BEING PERFORMED BY PEOPLE WITHIN THIS CLASSIFICATION. THEY ARE NOT INTENDED TO BE AN EXHAUSTIVE LIST OF ALL RESPONSIBILITIES, DUTIES AND SKILLS REQUIRED OF EMPLOYEES ASSIGNED TO THIS JOB.\n\n",
    "job_skill_set": [
      "Business Development Strategies",
      "Analytical Skills",
      "Communication Skills",
      "Leadership Skills",
      "Collaboration",
      "Time Management",
      "Problem Solving",
      "Independence",
      "Adaptability",
      "Microsoft Office Suite",
      "Client Relationship Management (CRM) Software",
      "Budget Management",
      "Event Planning",
      "Salesforce",
      "Confidentiality"
    ],
    "short_keywords": [
      "adaptability",
      "analytical",
      "budget",
      "business",
      "businessdevelopment",
      "client",
      "collaboration",
      "communication",
      "confidentiality",
      "crm",
      "development",
      "event",
      "health",
      "independence",
      "leadership",
      "life",
      "management",
      "manager",
      "microsoft",
      "office",
      "planning",
      "problem",
      "relationship",
      "salesforce",
      "sciences",
      "skills",
      "software",
      "solving",
      "strategies",
      "suite",
      "time"
    ]
  },
  {
    "job_id": "3898173244",
    "job_title": "Vice President of Business Development",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "COMPANY DESCRIPTION\n VANTEDGE SEARCH IS A LEADING PROVIDER OF GLOBAL EXECUTIVE SEARCH AND TALENT ADVISORY SERVICES. CO-FOUNDED BY INDUSTRY PRACTITIONERS, OUR TEAM BRINGS A WEALTH OF EXPERTISE AND EXPERIENCE TO HANDLE OUR CLIENTS' MOST COMPLEX SEARCH ASSIGNMENTS. WITH SPECIALIZED SEARCH CONSULTANTS, RESEARCH ANALYSTS, AND SOURCING EXPERTS LOCATED ACROSS THE US, CANADA, UK, AND INDIA, WE ARE WELL-EQUIPPED TO DELIVER EXCEPTIONAL RESULTS.\n ROLE DESCRIPTION\n THIS IS A FULL-TIME REMOTE ROLE FOR A VICE PRESIDENT OF BUSINESS DEVELOPMENT. THE VICE PRESIDENT OF BUSINESS DEVELOPMENT WILL BE RESPONSIBLE FOR LEADING AND EXECUTING NEW BUSINESS DEVELOPMENT INITIATIVES, CREATING AND IMPLEMENTING BUSINESS PLANS, NEGOTIATING CONTRACTS, MANAGING KEY ACCOUNTS, AND DRIVING SALES GROWTH. THE ROLE WILL REQUIRE STRONG LEADERSHIP AND STRATEGIC THINKING, AS WELL AS THE ABILITY TO WORK INDEPENDENTLY AND REMOTELY.\n QUALIFICATIONS\n NEW BUSINESS DEVELOPMENT AND SALES SKILLSEXPERIENCE IN BUSINESS PLANNING AND CONTRACT NEGOTIATIONPROVEN ABILITY TO MANAGE KEY ACCOUNTSEXCELLENT COMMUNICATION AND PRESENTATION SKILLSSTRONG LEADERSHIP AND STRATEGIC THINKINGABILITY TO WORK INDEPENDENTLY AND REMOTELYEXPERIENCE IN THE EXECUTIVE SEARCH OR TALENT ADVISORY INDUSTRY IS A PLUSBACHELOR'S DEGREE IN BUSINESS ADMINISTRATION, MARKETING, OR RELATED FIELDMBA OR ADVANCED DEGREE IS A PLUS\n NOTE: ADDITIONAL SKILLS AND QUALIFICATIONS RELATED TO BUSINESS DEVELOPMENT, LEADERSHIP, AND INDUSTRY EXPERTISE ARE HIGHLY BENEFICIAL.",
    "job_skill_set": [
      "business development",
      "sales",
      "business planning",
      "contract negotiation",
      "account management",
      "communication",
      "presentation skills",
      "talent advisory",
      "bachelor's degree",
      "leadership",
      "strategic thinking",
      "independence",
      "executive search",
      "MBA"
    ],
    "short_keywords": [
      "account",
      "advisory",
      "bachelors",
      "business",
      "businessdevelopment",
      "communication",
      "contract",
      "degree",
      "development",
      "executive",
      "independence",
      "leadership",
      "management",
      "mba",
      "negotiation",
      "of",
      "planning",
      "presentation",
      "president",
      "sales",
      "search",
      "skills",
      "strategic",
      "talent",
      "thinking",
      "vice"
    ]
  },
  {
    "job_id": "3902843957",
    "job_title": "Manager - Business Development - Sales (Located Virtual in CA - Sacramento, North Bay & Vacaville)",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "MANAGER OF BUSINESS DEVELOPMENT - SALES - SACRAMENTO, NORTH BAY, VACAVILLE \n\nWITH OVER 160 YEARS OF INNOVATION, WE ARE MOVING FASTER THAN EVER BY INTRODUCING NEW PRODUCTS, SERVICES, AND STRATEGIES TO BRING GREATER VALUE TO OUR BUSINESS CUSTOMERS.\n\nIF YOU HAVE PROVEN ABILITY TO ESTABLISH NEW BUSINESS RELATIONSHIPS, ADVANCE YOUR SALES CAREER WITH AMERICAN EXPRESS, ONE OF THE WORLD’S MOST RESPECTED AND RECOGNIZED BRANDS.\n\nTHE MANAGER OF BUSINESS DEVELOPMENT'S KEY RESPONSIBILITY IS TO SOLICIT MERCHANTS IN THE SACRAMENTO, NORTH BAY, VACAVILLE AREA TO ACCEPT THE AMERICAN EXPRESS CARD AS A FORM OF PAYMENT FROM THEIR CUSTOMERS FOCUSING ON B2B SALES. THIS POSITION WILL IDENTIFY KEY MERCHANT PROSPECTS WITH UP TO $300M IN ANNUAL REVENUE AND IMPLEMENT EFFECTIVE SALES STRATEGIES AND SOLUTIONS. MANAGERS OF BUSINESS DEVELOPMENT UTILIZE THEIR IN-DEPTH KNOWLEDGE OF AMERICAN EXPRESS, THE INDUSTRY AND THEIR PROSPECTS TO PROVIDE SOLUTIONS. ADDITIONAL RESPONSIBILITIES INCLUDE: GATHERING AND DISSEMINATING MARKETPLACE AND COMPETITIVE INFORMATION, COORDINATING ALL INTERNAL RESOURCES NECESSARY TO FACILITATE EACH SALE, AND EXECUTING PROPER ACCOUNT SET-UP AND MERCHANT TRAINING.\n\nSUCCESSFUL MANAGERS OF BUSINESS DEVELOPMENT USE THEIR PROSPECTING AND COLD CALLING SKILLS TO IDENTIFY, FILTER AND QUALIFY LEADS TO EFFECTIVELY MANAGE A PIPELINE OF PROSPECTS. THEY PLAN STRATEGICALLY, RESEARCH AND ARE KNOWLEDGEABLE ABOUT THE INDUSTRIES AND MARKETS THEY CALL ON. THEY POSSESS STRONG ANALYTICAL, ORGANIZATIONAL, DECISION-MAKING, NEGOTIATION, ORAL, WRITTEN AND INTERPERSONAL SKILLS. STRONG FINANCIAL ACUMEN IS ALSO NECESSARY IN ORDER TO EFFECTIVELY EXPLAIN THE FINANCIAL AND MARKETING VALUE OF PRODUCT SOLUTIONS TO CLOSE SALES. MANAGERS OF BUSINESS DEVELOPMENT MUST ALSO POSSESS THE ABILITY TO PREPARE AND PRESENT FORMAL PRESENTATIONS AND USE THEIR EXCELLENT CONSULTATIVE SOLUTION SELLING SKILLS TO ENSURE LONG-TERM RELATIONSHIP BUILDING AND MEET BUSINESS GOALS.\n\nQUALIFICATIONS\n\nTRACK RECORD OF CONCEIVING, STRUCTURING, SELLING IN, AND IMPLEMENTING CREATIVE, INNOVATIVE DEALSENSURES PROPER BUSINESS PROCESS, CONDUCT AND COMPLIANCE CONTROLS AND ADHERENCEDEMONSTRATED ABILITY TO FORM RELATIONSHIPS AND DRIVE CONSENSUS WITH KEY INTERNAL STAKEHOLDERS, INCLUDING PRICING, LEGAL, CARD ISSUERS, RISK, AND OTHER INTERNAL PARTNERSSTRONG FINANCIAL ACUMEN. EXCELLENT FINANCIAL AND ANALYTICAL SKILLS USED TO PREPARE AND PRESENT QUANTITATIVE ANALYSES TO PROSPECTS.STRONG PRIMARY AND SECONDARY ACCOUNT/ INDUSTRY RESEARCH SKILLS; PROVEN TRACK RECORD TO BRING TO BEAR PROFESSIONAL NETWORK AND THIRD-PARTY SOURCES TO DEVELOP DEEP UNDERSTANDING OF PROSPECT NEEDS, ANTICIPATED OBJECTIONS, AND POTENTIAL LEVERAGE POINTSEXCELLENT INTERPERSONAL SKILLS, BOTH WRITTEN AND VERBAL. STRONG EXECUTIVE PRESENCE WITH COLLABORATORS.STRONG NEGOTIATION SKILLS; PROVEN TRACK RECORD IN ESTABLISHING RAPPORT AND EARNING CREDIBILITY WITH PROSPECTS.FLEXIBLE; COMFORTABLE IN A FAST-PACED ENVIRONMENT WITH EVOLVING PRIORITIES AND CHANGES IN DIRECTION.PROFICIENCY WITH SALESFORCE.COM AN ASSET.EXPERIENCED IN PROSPECTING FOR LEADSWORKING KNOWLEDGE OF RELATED AMERICAN EXPRESS PRODUCTS AND SERVICES IS CONSIDERED AN ASSET.BS/BA DEGREE PREFERRED AND 5 YEARS OF SUCCESSFUL OUTSIDE SALES EXPERIENCE IS STRONGLY PREFERRED.SELF-DISCIPLINED AND SELF-MOTIVATED TO WORK ON OWN IN A HOME OFFICE ENVIRONMENT.CANDIDATE MUST RESIDE IN NORTH CALIFORNIA - PREFERRED LOCATIONS OF: SACRAMENTO, NORTH BAY & VACAVILLE RESIDENCE IN THE TERRITORY IS REQUIRED IN CALIFORNIA WITH UP TO 5% OVERNIGHT TRAVEL WITHIN TERRITORY.COVERAGE WOULD BE THE STATE OF CALIFORNIA \n\nWILL NOT PROVIDE SPONSORSHIP:\n\n EMPLOYMENT ELIGIBILITY TO WORK WITH AMERICAN EXPRESS IN THE U.S. IS REQUIRED AS THE COMPANY WILL NOT PURSUE VISA SPONSORSHIP FOR THESE POSITIONS.\n\nSALARY RANGE: $70,000.00 TO $125,000.00 ANNUALLY + SALES INCENTIVE + BENEFITS\n\nTHE ABOVE REPRESENTS THE EXPECTED SALARY RANGE FOR THIS JOB REQUISITION. ULTIMATELY, IN DETERMINING YOUR PAY, WE'LL CONSIDER YOUR LOCATION, EXPERIENCE, AND OTHER JOB-RELATED FACTORS.\n\nWE BACK OUR COLLEAGUES AND THEIR LOVED ONES WITH BENEFITS AND PROGRAMS THAT SUPPORT THEIR HOLISTIC WELL-BEING. THAT MEANS WE PRIORITIZE THEIR PHYSICAL, FINANCIAL, AND MENTAL HEALTH THROUGH EACH STAGE OF LIFE. BENEFITS INCLUDE:\n\nCOMPETITIVE BASE SALARIES BONUS INCENTIVES 6% COMPANY MATCH ON RETIREMENT SAVINGS PLAN FREE FINANCIAL COACHING AND FINANCIAL WELL-BEING SUPPORT COMPREHENSIVE MEDICAL, DENTAL, VISION, LIFE INSURANCE, AND DISABILITY BENEFITS FLEXIBLE WORKING MODEL WITH HYBRID, ONSITE OR VIRTUAL ARRANGEMENTS DEPENDING ON ROLE AND BUSINESS NEED 20+ WEEKS PAID PARENTAL LEAVE FOR ALL PARENTS, REGARDLESS OF GENDER, OFFERED FOR PREGNANCY, ADOPTION OR SURROGACY FREE ACCESS TO GLOBAL ON-SITE WELLNESS CENTERS STAFFED WITH NURSES AND DOCTORS (DEPENDING ON LOCATION) FREE AND CONFIDENTIAL COUNSELING SUPPORT THROUGH OUR HEALTHY MINDS PROGRAM CAREER DEVELOPMENT AND TRAINING OPPORTUNITIES\n\nFOR A FULL LIST OF TEAM AMEX BENEFITS, VISIT OUR COLLEAGUE BENEFITS SITE.\n\nAMERICAN EXPRESS IS AN EQUAL OPPORTUNITY EMPLOYER AND MAKES EMPLOYMENT DECISIONS WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, VETERAN STATUS, DISABILITY STATUS, AGE, OR ANY OTHER STATUS PROTECTED BY LAW.\n\nWE BACK OUR COLLEAGUES WITH THE SUPPORT THEY NEED TO THRIVE, PROFESSIONALLY AND PERSONALLY. THAT'S WHY WE HAVE AMEX FLEX, OUR ENTERPRISE WORKING MODEL THAT PROVIDES GREATER FLEXIBILITY TO COLLEAGUES WHILE ENSURING WE PRESERVE THE IMPORTANT ASPECTS OF OUR UNIQUE IN-PERSON CULTURE. DEPENDING ON ROLE AND BUSINESS NEEDS, COLLEAGUES WILL EITHER WORK ONSITE, IN A HYBRID MODEL (COMBINATION OF IN-OFFICE AND VIRTUAL DAYS) OR FULLY VIRTUALLY.\n\nUS JOB SEEKERS/EMPLOYEES - CLICK HERE TO VIEW THE “KNOW YOUR RIGHTS” POSTER AND THE PAY TRANSPARENCY POLICY STATEMENT.\n\nIF THE LINKS DO NOT WORK, PLEASE COPY AND PASTE THE FOLLOWING URLS IN A NEW BROWSER WINDOW: HTTPS://WWW.DOL.GOV/AGENCIES/OFCCP/POSTERS TO ACCESS THE THREE POSTERS.",
    "job_skill_set": [
      "B2B Sales",
      "Sales Strategies",
      "Negotiation Skills",
      "Market Research",
      "Consultative Selling",
      "Presentation Skills",
      "Lead Prospecting",
      "Interpersonal Skills",
      "Communication Skills",
      "Decision-Making",
      "Organizational Skills",
      "Self-Motivation",
      "Flexibility",
      "Team Collaboration",
      "Relationship Building",
      "Problem Solving",
      "Executive Presence",
      "Financial Acumen",
      "Analytical Skills",
      "Salesforce.com"
    ],
    "short_keywords": [
      "acumen",
      "analytical",
      "b2b",
      "bay",
      "building",
      "business",
      "businessdevelopment",
      "ca",
      "collaboration",
      "communication",
      "consultative",
      "decisionmaking",
      "development",
      "executive",
      "financial",
      "flexibility",
      "in",
      "interpersonal",
      "lead",
      "located",
      "manager",
      "market",
      "negotiation",
      "north",
      "organizational",
      "presence",
      "presentation",
      "problem",
      "prospecting",
      "relationship",
      "research",
      "sacramento",
      "sales",
      "salesforcecom",
      "selfmotivation",
      "selling",
      "skills",
      "solving",
      "strategies",
      "team",
      "vacaville",
      "virtual"
    ]
  },
  {
    "job_id": "3904721424",
    "job_title": "Business Development Representative - PCA Skin & EltaMD - Hudson Valley",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "# 159850 - WHITE PLAINS, NEW YORK, UNITED STATES\n\nWHO WE ARE\n\nCOLGATE-PALMOLIVE COMPANY IS A CARING, INNOVATIVE GROWTH COMPANY THAT IS REIMAGINING A HEALTHIER FUTURE FOR ALL PEOPLE, THEIR PETS AND OUR PLANET. FOCUSED ON ORAL CARE, PERSONAL CARE, HOME CARE AND PET NUTRITION, WE SELL OUR PRODUCTS IN MORE THAN 200 COUNTRIES AND TERRITORIES UNDER BRANDS SUCH AS COLGATE, PALMOLIVE, ELMEX, HELLO, MERIDOL, SORRISO, TOM’S OF MAINE, ELTAMD, FILORGA, IRISH SPRING, PCA SKIN, PROTEX, SANEX, SOFTSOAP, SPEED STICK, AJAX, AXION, FABULOSO, SOUPLINE AND SUAVITEL, AS WELL AS HILL’S PET NUTRITION.\n\nWE ARE RECOGNIZED FOR OUR LEADERSHIP AND INNOVATION IN PROMOTING SUSTAINABILITY AND COMMUNITY WELLBEING, INCLUDING OUR ACHIEVEMENTS IN DECREASING PLASTIC WASTE AND PROMOTING RECYCLABILITY, SAVING WATER, CONSERVING NATURAL RESOURCES AND IMPROVING CHILDREN’S ORAL HEALTH.\n\nIF YOU WANT TO WORK FOR A COMPANY THAT LIVES BY THEIR VALUES, THEN GIVE YOUR CAREER A REASON TO SMILE AND JOIN OUR GLOBAL TEAM!\n\nCP SKIN HEALTH GROUP IS LOOKING FOR A BUSINESS DEVELOPMENT REPRESENTATIVE TO PROMOTE AND GROW THE PCA SKIN AND ELTAMD BRANDS BY DRIVING SALES AND CONTINUALLY EXPANDING THE MEDICAL AND AESTHETIC CUSTOMER BASE IN A GEOGRAPHIC TERRITORY. THE BUSINESS DEVELOPMENT REPRESENTATIVE WILL ALSO BE MANAGING KEY CORPORATE ACCOUNTS IN THE TERRITORY IN ORDER TO MAXIMIZE PROFESSIONAL SKIN CARE TREATMENTS AND SELL-THRU OPPORTUNITIES FOR THE BRAND. TO BE SUCCESSFUL IN THIS ROLE, THE CANDIDATE MUST BE ENTREPRENEURIAL, SHOW BUSINESS ACUMEN, BE COMPETITIVE IN NATURE, AND A CREATIVE THINKER WITH AN ENGAGING PERSONALITY WHO REPRESENTS THE BRAND IN A PROFESSIONAL AND CUSTOMER-CENTRIC MANNER. THE CANDIDATE MUST ALSO POSSESS THE ABILITY TO BUILD, GROW AND FOSTER RELATIONSHIPS WITH EXISTING AND NEW ACCOUNTS TO GROW THEIR TERRITORY BUSINESS.\n\nWHAT YOU WILL DO:\n\nTRAVEL IN-PERSON WITHIN YOUR TERRITORY TO ENGAGE AND SUPPORT ELTAMD AND PCA SKIN ACCOUNTS TO BUILD, GROW, AND CULTIVATE RELATIONSHIPS TO GENERATE NEW BUSINESS OPPORTUNITIES AND SALES REVENUE GROWTH. ANALYZE SALES DATA AND BUSINESS NEEDS TO CONTINUALLY ASSESS AREAS OF OPPORTUNITY, TRENDS AND CALL ACTIVITY. BUILD AND MAINTAIN TRUSTING RELATIONSHIPS WITH ALL CALL POINTS AT LOCATIONS, TO INCLUDE PHYSICIANS, NURSES, BUSINESS OWNERS, SPA MANAGERS, FRONT DESK ADMINISTRATION, ESTHETICIANS, MASSAGE THERAPISTS AND ALL OTHER SUPPORTING STAFF. CONDUCT PRODUCT TRAININGS AND SPECIAL PROMOTIONAL EVENTS TO DRIVE SALES EFFORTS AND RESULTS, BEING MINDFUL OF THE RETURN ON INVESTMENT (ROI) OF THEIR TIME AND BUDGET INVESTMENTSERVICE EXISTING ACCOUNTS, OBTAIN ORDERS, PLAN AND CONDUCT EDUCATIONAL WORKSHOPS TO MAINTAIN IN-OFFICE TECHNICAL KNOWLEDGE STANDARDS AND ASSIST WITH SELLING TECHNIQUES AND HOME CARE TREATMENT REGIMEN RECOMMENDATIONS TO MAXIMIZE IN OFFICE ADVANCED SKINCARE TREATMENT RESULTS WITH ELTAMD AND PCA SKIN PRODUCTS. SUPPORT CUSTOMERS IN THEIR MARKETING EFFORTS BY FACILITATING AND ATTENDING OPEN HOUSES AND SIMILAR IN-OFFICE EVENTS AND PROMOTIONSSCHEDULE AND ROUTE MONTHLY IN-PERSON ACCOUNT VISITS ON AN APPROPRIATE CALL CYCLE BASED UPON TIERS AND GEOGRAPHY TO SUPPORT AND MAINTAIN TERRITORY COVERAGE PLAN AND OPTIMIZE BUSINESS RESULTS. TRACK ACCOUNT AND SALES ACTIVITIES, ACCOUNT VISITS, CURRENT BUSINESS CONDITIONS, MARKETING ACTIVITY, TRENDS AND COMPETITIVE INFORMATION THROUGH CRM SOFTWARE. RESOLVE CUSTOMER ISSUES BY INVESTIGATING PROBLEMS; DEVELOPING SOLUTIONS; AND WORKING WITH MANAGEMENT. PROSPECTING WITHIN TERRITORY TO OPEN NEW ACCOUNTS AND GROW BUSINESS IN THESE ACCOUNTS. RE-ENGAGE FORMER ACCOUNTS, UNDERSTANDING WHY THEIR PURCHASING HAS DECLINED, ADDRESSING ANY ISSUES, AND BRINGING THEM BACK TO THE BRAND. WORK STRATEGICALLY WITH SCHOOLS TO ENGAGE EMERGING PROFESSIONALS. REPRESENT THE BRAND IN-PERSON AT INDUSTRY TRADE SHOWS AND MEDICAL PROFESSIONAL CONFERENCES. ACHIEVE OR EXCEED SALES OBJECTIVES ON A MONTHLY AND QUARTERLY BASIS TO DELIVER SALES RESULTS AND MAXIMIZE INDIVIDUAL VARIABLE COMPENSATION PAYOUT. \n\nWHAT WE'RE LOOKING FOR:\n\nFORECASTING EXPERIENCE AND BUSINESS ANALYSIS SKILLSCOMPETITIVE DRIVE, BALANCED WITH TEAM ORIENTED, POSITIVE ATTITUDESKILLED PRESENTER, WITH THE ABILITY TO COMMUNICATE VERBALLY AND IN WRITING IN A PROFESSIONAL, TIMELY AND BUSINESSLIKE MANNERCUSTOMER SERVICE MINDSETSTRONG BUSINESS ACUMEN AND TERRITORY MANAGEMENT EXPERIENCERESILIENT AND ABLE TO THRIVE IN A FAST PACED ENVIRONMENT WITH STRONG MULTI-TASKING ABILITIES\n\nREQUIRED QUALIFICATIONS\n\n2+ YEARS’ EXPERIENCE IN SALES AND BUSINESS DEVELOPMENT, PREFERABLY IN AESTHETIC, MEDICAL OR BEAUTY INDUSTRYEXPERIENCE USING CRM TOOLS (E.G. SALESFORCE) A VALID DRIVER’S LICENSE (NOT A HIGH-RISK DRIVER) AND RELIABLE CARABILITY TO FULFILL HEAVY DOMESTIC TRAVEL REQUIREMENT, MOSTLY DRIVING WITHIN GEOGRAPHIC TERRITORY (APPROX. 80-90% OF THE WORK WEEK), AS WELL AS SPORADIC AIR TRAVEL TO INDUSTRY TRADESHOWS OR COMPANY MEETINGS/TRAININGSDEMONSTRABLE PRESENTATION, SELLING AND COMMUNICATION SKILLSMUST OCCASIONALLY LIFT AND/OR MOVE UP TO 25 POUNDSEXPERIENCE IN USING MICROSOFT OFFICE TOOLS (WORD, EXCEL, POWERPOINT) AND/OR GOOGLE SUITE (DOCS, SHEETS, SLIDES)\n\nPREFERRED QUALIFICATIONS\n\nBACHELOR'S DEGREE OR ESTHETICIAN LICENSE BILINGUAL\n\nCOMPENSATION AND BENEFITS\n\nSALARY RANGE $70,000.00 - $80,000.00 USD\n\nPAY IS BASED ON MULTIPLE NON-DISCRIMINATORY, INDIVIDUALIZED FACTORS INCLUDING BUT NOT LIMITED TO EXPERIENCE, JOB-RELATED KNOWLEDGE AND EDUCATION, SKILLS AND OFFICE/MARKET LOCATION. IN ADDITION TO BASE SALARY, SALARIED EMPLOYEES ARE ELIGIBLE FOR ANNUAL DISCRETIONARY BONUSES, PROFIT-SHARING AND, FOR EXECUTIVE-LEVEL (SALARY GRADE 16 AND ABOVE) ROLES ONLY, LONG-TERM INCENTIVES IN THE FORM OF RESTRICTED STOCK UNITS AND/OR STOCK OPTIONS.\n\nSUBJECT TO THE TERMS AND CONDITIONS OF THE APPLICABLE BENEFITS PLANS THEN IN EFFECT, ALL SALARIED EMPLOYEES ARE ALSO ELIGIBLE FOR A COMPETITIVE BENEFITS PACKAGE WHICH INCLUDES:\n\nINSURANCE: EMPLOYEES (AND THEIR ELIGIBLE DEPENDENTS) ARE ELIGIBLE TO PARTICIPATE IN COMPANY-SPONSORED MEDICAL, DENTAL, VISION, BASIC LIFE INSURANCE, ACCIDENTAL DEATH & DISMEMBERMENT AND DISABILITY INSURANCE PLANS. RETIREMENT PLANS: EMPLOYEES ARE ELIGIBLE TO ENROLL IN COLGATE'S 401(K) PLAN, WHICH PROVIDES FOR COMPANY MATCHING CONTRIBUTIONS SUBJECT TO ELIGIBILITY REQUIREMENTSVACATION/PTO: EMPLOYEES RECEIVE A MINIMUM OF 15 DAYS OF VACATION/PTO LEAVE ANNUALLYPAID HOLIDAYS: EMPLOYEES RECEIVE A MINIMUM OF 13 PAID/FLOATING HOLIDAYS ANNUALLYPAID SICK LEAVE: BASED ON LOCATION AND CONSISTENT WITH APPLICABLE STATE AND LOCAL LAW, EMPLOYEES RECEIVE A MINIMUM OF 40 HOURS OF PAID SICK LEAVE ON JANUARY 1ST OF EACH YEARPAID PARENTAL LEAVE: ELIGIBLE EMPLOYEES MAY TAKE UP TO EIGHT WEEKS OF PAID PARENTAL LEAVE AND 12 WEEKS OF UNPAID LEAVE (VARIES FOR EMPLOYEES WITH FEWER THAN 12 MONTHS OF SERVICE AND IS SUBJECT TO HOURS WORKED REQUIREMENTS)\n\nOUR COMMITMENT TO SUSTAINABILITY\n\nWITH THE COLGATE BRAND IN MORE HOMES THAN ANY OTHER, WE ARE PRESENTED WITH GREAT OPPORTUNITIES AND NEW CHALLENGES AS WE WORK TO INTEGRATE SUSTAINABILITY INTO ALL ASPECTS OF OUR BUSINESS AND CREATE POSITIVE SOCIAL IMPACT. WE ARE DETERMINED TO POSITION OURSELVES FOR FURTHER GROWTH AS WE ACT ON OUR 2025 SUSTAINABILITY & SOCIAL IMPACT STRATEGY.\n\nOUR COMMITMENT TO DIVERSITY, EQUITY & INCLUSION\n\nACHIEVING OUR PURPOSE STARTS WITH OUR PEOPLE — ENSURING OUR WORKFORCE REPRESENTS THE PEOPLE AND COMMUNITIES WE SERVE —AND CREATING AN ENVIRONMENT WHERE OUR PEOPLE FEEL THEY BELONG; WHERE WE CAN BE OUR AUTHENTIC SELVES, FEEL TREATED WITH RESPECT AND HAVE THE SUPPORT OF LEADERSHIP TO IMPACT THE BUSINESS IN A MEANINGFUL WAY.\n\nEQUAL OPPORTUNITY EMPLOYER\n\nCOLGATE IS AN EQUAL OPPORTUNITY EMPLOYER AND ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, GENDER, GENDER IDENTITY, SEXUAL ORIENTATION, NATIONAL ORIGIN, ETHNICITY, AGE, DISABILITY, MARITAL STATUS, VETERAN STATUS (UNITED STATES POSITIONS), OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW.\n\nREASONABLE ACCOMMODATION DURING THE APPLICATION PROCESS IS AVAILABLE FOR PERSONS WITH DISABILITIES. PLEASE CONTACT APPLICATION_ACCOMMODATION@COLPAL.COM WITH THE SUBJECT \"ACCOMMODATION REQUEST\" SHOULD YOU REQUIRE ACCOMMODATION.\n\nFOR ADDITIONAL COLGATE TERMS AND CONDITIONS, PLEASE CLICK HERE.\n\n",
    "job_skill_set": [
      "sales",
      "business development",
      "Microsoft Office",
      "data analysis",
      "customer service",
      "product training",
      "marketing",
      "business acumen",
      "competitive drive",
      "communication",
      "relationship building",
      "resilience",
      "creativity",
      "teamwork",
      "multi-tasking",
      "CRM tools",
      "presentation skills",
      "territory management",
      "entrepreneurial mindset"
    ],
    "short_keywords": [
      "acumen",
      "analysis",
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "competitive",
      "creativity",
      "crm",
      "customer",
      "data",
      "development",
      "drive",
      "eltamd",
      "entrepreneurial",
      "hudson",
      "management",
      "marketing",
      "microsoft",
      "mindset",
      "multitasking",
      "office",
      "pca",
      "presentation",
      "product",
      "relationship",
      "representative",
      "resilience",
      "sales",
      "service",
      "skills",
      "skin",
      "teamwork",
      "territory",
      "tools",
      "training",
      "valley"
    ]
  },
  {
    "job_id": "3898159425",
    "job_title": "Sales and Business Development Leader",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "SUMMARY ASSIST, ADMINISTER AND COORDINATE THE SALES AND RELATED MARKETING FUNCTIONS FOR AZTALAN ENGINEERING, INC. AS A MEMBER OF THE LEADERSHIP TEAM TO ACHIEVE SIGNIFICANT SALES GROWTH THROUGH THE EXPANSION OF OUR CUSTOMER BASE TO INCLUDE NEW CUSTOMERS, INDUSTRIES AND PRODUCTS. THIS INCLUDES SALES STRATEGIES FOR MULTIPLE LOCATIONS OF AZTALAN. THIS POSITION IS RESPONSIBLE FOR THE SUCCESSFUL LAUNCH OF THE NEW SALES PROJECTS IN THE COMPANY UP THROUGH, AND INCLUDING, COMPLETION OF FIRST PRODUCTION PARTS TO THE SCHEDULE/PLAN SET AT THE NPL PROCESS.PROVIDE LEADERSHIP TOWARDS THE ACHIEVEMENT OF MAXIMUM PROFITABILITY AND GROWTH IN LINE WITH COMPANY MISSION, VISION AND VALUES.ESSENTIAL RESPONSIBILITIES EXECUTE PLANS AND STRATEGIES TO EXPAND THE CUSTOMER BASE IN THE MARKETING AREA AND CONTRIBUTE TO THE DEVELOPMENT OF TRAINING AND EDUCATIONAL PROGRAMS FOR CURRENT AND NEW CUSTOMERSHOLD MONTHLY/QUARTERLY MEETINGS WITH CUSTOMERS AND POTENTIAL NEW CUSTOMERS BOTH AT AZTALAN AND AT CUSTOMER LOCATIONSOVERSEE THE QUOTING PROCESS, WORK WITH QUOTING ENGINEER, ENTER REQUESTS INTO ERP SYSTEM, MAINTAIN CRM WITH SALES ACTIVITY, REVIEW QUOTE RISK AND MARGIN POTENTIAL WITH SENIOR MANAGEMENTCOLLABORATE WITH MANAGEMENT TO DEVELOP FORECASTS, QUOTAS, SALES POLICIES AND METHODS, PROMOTIONAL IDEAS, BUDGET PREPARATION, ETC.PREPARE MARKET ANALYSIS TO DETERMINE CUSTOMER NEEDS, VOLUME POTENTIAL AND PRICINGDEVELOP A MARKETING PLAN AND SALES STRATEGY THAT ENSURES ATTAINMENT OF COMPANY SALES GOALS AND PROFITABILITYINITIATE AND COORDINATE DEVELOPMENT OF ACTION PLANS TO PENETRATE NEW MARKETSIMPLEMENT SALES AND MARKETING PLANSMAINTAIN THE COMPANY WEBSITE AS A CURRENT MARKETING AND INFORMATION SOURCEPROVIDE TIMELY FEEDBACK TO SENIOR MANAGEMENT REGARDING PERFORMANCE PROVIDE TIMELY, ACCURATE, COMPETITIVE PRICING ON ALL COMPLETED PROSPECT APPLICATIONS SUBMITTED FOR PRICING AND APPROVAL, WHILE STRIVING TO MAINTAIN MAXIMUM PROFIT MARGINCOORDINATE RELATED FUNCTIONS (E.G., PRODUCTION CONTROL, ENGINEERING APPLICATIONS, MARKET RESEARCH, ADVERTISING, TRAINING, DISTRIBUTION, AND SERVICE) TO ACHIEVE SALES GROWTH AND CUSTOMER RETENTION. MAINTAIN ACCURATE RECORDS OF ALL PRICING, COSTING, QUOTES, EXPENSES, CUSTOMER INFORMATION AND SUBMIT ACTIVITY REPORTS CREATE AND CONDUCT PROPOSAL PRESENTATIONS AND RFQ RESPONSESPREPARE PROPOSALS AND PRESENTATIONS CONTROL EXPENSES TO MEET BUDGET GUIDELINESLEAD, COACH AND ELEVATE DEPARTMENT STAFF AND MANAGE PERFORMANCE SUPPORT AND COURAGE AZTALAN’S COMPANY CULTURE, GOALS AND INITIATIVESADHERE TO ALL COMPANY POLICIES, PROCEDURES, AND BUSINESS ETHICS OTHER DUTIES AS ASSIGNEDORGANIZATIONAL RELATIONSHIPSSUPERVISES ALL EMPLOYEES IN THE SALES DEPARTMENT, INCLUDING QUOTING ENGINEERING. THIS POSITION REPORTS DIRECTLY TO THE PRESIDENT & CEO. THE PRESIDENT & CEO ASSIGNS GOALS IN TERMS OF SALES GROWTH, CUSTOMER RETENTION RATES, ON-TIME DELIVERY, COST CONTROLS AND PROFITABILITY.QUALIFICATIONS: TO PERFORM THIS JOB SUCCESSFULLY, AN INDIVIDUAL MUST BE ABLE TO PERFORM EACH ESSENTIAL DUTY SATISFACTORILY. THE REQUIREMENTS LISTED BELOW ARE REPRESENTATIVE OF THE KNOWLEDGE, SKILL, AND/OR ABILITY REQUIRED. REASONABLE ACCOMMODATION MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTION.MUST BE DETAIL ORIENTED AND HAVE PROFICIENT PLANNING AND ORGANIZATIONAL SKILLS MUST DEMONSTRATE INITIATIVE, ACCOUNTABILITY AND PROFESSIONALISM MUST HAVE STRONG COMMUNICATION AND LEADERSHIP SKILLS MUST HAVE THE ABILITY TO WORK EFFICIENTLY AND PRODUCTIVELY WITH CUSTOMERS, SUPPLIERS, AND COLLEAGUES KNOWLEDGEABLE OF MANUFACTURING CAPACITY, COST ACCOUNTING, PRODUCT MARKETS, SALES PRACTICES AND PROCEDURES KNOWLEDGEABLE OF CURRENT FINANCIAL ANALYSIS TECHNIQUES AND STANDARDS KNOWLEDGEABLE OF DATA PROCESSING SYSTEMS AND PROGRAMS IN ORDER PROCESSING AND PRODUCTION SCHEDULING ACCOMPLISHED IN MICROSOFT OFFICE PRODUCTS AND OTHER RELATED COMPUTER APPLICATIONS EDUCATION, EXPERIENCE OR LICENSES 3+ YEARS OF SALES/BUSINESS DEVELOPMENT EXPERIENCE, PREFERREDBACHELOR DEGREE, PREFERRED MUST HAVE VALID DRIVER’S LICENSE ",
    "job_skill_set": [
      "sales strategies",
      "customer relationship management (CRM)",
      "market analysis",
      "budget preparation",
      "Microsoft Office",
      "data processing systems",
      "cost accounting",
      "leadership",
      "sales practices and procedures",
      "communication",
      "initiative",
      "accountability",
      "professionalism",
      "planning",
      "organizational skills",
      "teamwork",
      "customer service",
      "coaching",
      "problem solving",
      "production scheduling",
      "proposal presentations",
      "ERP systems"
    ],
    "short_keywords": [
      "accountability",
      "accounting",
      "analysis",
      "and",
      "budget",
      "business",
      "businessdevelopment",
      "coaching",
      "communication",
      "cost",
      "crm",
      "customer",
      "data",
      "development",
      "erp",
      "initiative",
      "leader",
      "leadership",
      "management",
      "market",
      "microsoft",
      "office",
      "organizational",
      "planning",
      "practices",
      "preparation",
      "presentations",
      "problem",
      "procedures",
      "processing",
      "production",
      "professionalism",
      "proposal",
      "relationship",
      "sales",
      "scheduling",
      "service",
      "skills",
      "solving",
      "strategies",
      "systems",
      "teamwork"
    ]
  },
  {
    "job_id": "3891245999",
    "job_title": "SVP Sales & Business Development",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "SVP SALES & BUSINESS DEVELOPMENT\nJOB SUMMARY: AS WE CONTINUE TO EXPAND OUR FOOTPRINT AND ENHANCE OUR OFFERINGS, WE ARE SEEKING A DYNAMIC AND STRATEGIC SVP OF SALES AND BUSINESS DEVELOPMENT TO LEAD OUR REVENUE GENERATION EFFORTS AND DRIVE GROWTH THROUGH STRATEGIC BUSINESS DEVELOPMENT DEALS AND SALES FORCE OPTIMIZATION. REPORTING TO THE CEO AND PART OF THE EXECUTIVE LEADERSHIP TEAM, YOU WILL BE INSTRUMENTAL IN SHAPING OUR REVENUE STRATEGY, MANAGEMENT/PERFORMANCE/ ACCOUNTABILITY OF ALL SALES PERSONNEL (NATIONAL, REGIONAL AND LOCAL) AND FORGING STRATEGIC PARTNERSHIPS. YOU WILL PLAY A CRITICAL ROLE IN DRIVING REVENUE GROWTH, EXPANDING OUR MARKET PRESENCE AND SALES STRATEGY, ACT AS VOICE OF CUSTOMER, AND SOLIDIFYING OUR POSITION AS A LEADER IN THE PLACE BASED MEDIA/HEALTHCARE MEDIA/RETAIL MEDIA. THIS POSITION OFFERS FLEXIBLE WORK ARRANGEMENTS, ALLOWING YOU TO WORK REMOTELY OR FROM OUR NAPERVILLE, ILLINOIS, INDIANAPOLIS, INDIANA, OR OAKLAND, CA OFFICE. EXTENSIVE TRAVEL, UP TO 30%, WILL BE REQUIRED THROUGHOUT THE YEAR.\nESSENTIAL FUNCTIONS: \n1.DEVELOP AND EXECUTE REVENUE STRATEGY: LEAD THE DEVELOPMENT AND EXECUTION OF A COMPREHENSIVE REVENUE GENERATION STRATEGY ALIGNED WITH OUR BUSINESS OBJECTIVES AND TARGETS. IDENTIFY NEW REVENUE STREAMS, MARKET OPPORTUNITIES, AND GROWTH INITIATIVES TO DRIVE SUSTAINABLE REVENUE GROWTH IN BOTH THE STATIC AND DIGITAL ADVERTISING SPACE.2.SECURE STRATEGIC BUSINESS DEVELOPMENT DEALS: NEGOTIATE AND CLOSE HIGH-VALUE DEALS WITH KEY CLIENTS, ADVERTISERS, AND AGENCIES TO SECURE LONG-TERM PARTNERSHIPS AND PREMIUM PLACEMENTS. IDENTIFY AND PURSUE STRATEGIC PARTNERSHIPS, ALLIANCES, AND BUSINESS DEVELOPMENT OPPORTUNITIES THAT ENHANCE OUR MARKET POSITION AND DRIVE REVENUE GROWTH. 3.OPTIMIZE OUR SALES FORCE, OVERSEEING PEOPLE MANAGEMENT OF NATIONAL SALES TEAM AND LOCAL SALES TEAM, DISPERSED ACROSS THE US (COMBINATION OF OFFICE AND REMOTE WORKERS):LEAD AND DEVELOP THE TEAMS, FOSTERING COLLABORATION WHILE RESPECTING THEIR UNIQUE APPROACHES.DEVELOP AND IMPLEMENT SALES STRATEGIES, PROCESSES, AND TRAINING PROGRAMS TO OPTIMIZE THEIR PRODUCTIVITY AND EFFECTIVENESS.BUILD A CULTURE OF ACCOUNTABILITY AND HIGH PERFORMANCE. INFLUENCE/COLLABORATE AND BRING VALUE WITH RESPECT TO STRATEGIC REVENUE OPERATIONS DECISIONS AND EXECUTION INCLUDING 2ND CHANCE, E-MAIL CADENCES, AND MORE. INFLUENCE/COLLABORATE AND BRING VALUE WITH RESPECT TO LEAD GEN UNIT ECONOMICS AND OPTIMIZATION WORK WITH MARKETING TO ENSURE OUR PRODUCTS POSITIONED THE RIGHT WAY TO THE RIGHT CLUSTERS OF CLIENTS, PROSPECTS 4.DRIVE REVENUE GROWTH:COLLABORATE CROSS-FUNCTIONALLY WITH MARKETING, OPERATIONS, AND FINANCE TEAMS TO DEVELOP INTEGRATED REVENUE GENERATION PLANS. MONITOR KEY PERFORMANCE METRICS, ANALYZE SALES DATA, AND TRACK PROGRESS AGAINST TARGETS TO IDENTIFY AREAS FOR IMPROVEMENT AND DRIVE CONTINUOUS REVENUE GROWTH.5.CULTIVATE CLIENT RELATIONSHIPS, PARTNERING WITH CUSTOMER SUCCESS TEAM:BUILD AND MAINTAIN STRONG RELATIONSHIPS WITH KEY CLIENTS IN BOTH NATIONAL AND LOCAL MARKETS, UNDERSTANDING THEIR NEEDS AND OBJECTIVES TO DELIVER TAILORED SOLUTIONS.ACT AS A TRUSTED ADVISOR AND STRATEGIC PARTNER, LEVERAGING INDUSTRY INSIGHTS AND MARKET TRENDS TO DRIVE MUTUAL SUCCESS.COLLABORATE WITH CUSTOMER SUCCESS TO ENSURE POST CAMPAIGN REPORTING CONTAINS DATA SUFFICIENT TO SECURE RENEWALS. 6.PARTNER WITH SALES OPERATIONS AND ENABLEMENT TO ENABLE TECHNOLOGY AND PROCESSES FOR THE SALES TEAM:CHAMPION AND IMPLEMENT EFFICIENT SALES PROCESSES, TOOLS, AND SYSTEMS TO IMPROVE SALES EFFICIENCY AND EFFECTIVENESS.IDENTIFY AND IMPLEMENT BEST PRACTICES IN SALES ENABLEMENT TO ENSURE THE CONTINUOUS LEARNING AND DEVELOPMENT OF THE SALES TEAM PARTNERING WITH THE SALES OPERATIONS TEAM7.STAY AHEAD OF INDUSTRY TRENDS:MONITOR INDUSTRY TRENDS, MARKET DYNAMICS, AND THE COMPETITIVE LANDSCAPE TO IDENTIFY EMERGING OPPORTUNITIES AND THREATS.ANTICIPATE MARKET SHIFTS AND PROACTIVELY ADAPT REVENUE STRATEGIES TO CAPITALIZE ON NEW TRENDS, TECHNOLOGIES, AND CUSTOMER PREFERENCES.\nREQUIRED SKILLS AND ABILITIES:\nEXCELLENT SALES LEADERSHIP EXPERIENCE AND COMMUNICATION SKILLS WITH THE ABILITY TO INSPIRE, MOTIVATE, AND GUIDE HIGH-PERFORMING, MULTI-CHANNEL, DIVERSE, SALES TEAMS. YOU POSSESS KEEN PERFORMANCE MANAGEMENT SKILLS, FOSTERING A CULTURE OF CONTINUOUS LEARNING AND DEVELOPMENT FOR YOUR TEAM MEMBERS.A CLEAR, CONCISE, AND PERSUASIVE COMMUNICATION STYLE, WITH THE ABILITY TO EFFECTIVELY COMMUNICATE COMPLEX IDEAS TO DIVERSE AUDIENCES, BOTH INTERNALLY AND EXTERNALLY.YOU COMMAND GRAVITAS AND PRESENCE, FOSTERING TRUST AND RESPECT FROM YOUR TEAM, COLLEAGUES, AND CLIENTS.STRATEGIC LEADER, EXPERIENCE LEADING LARGE-SCALE SALES FORCE, WORKING IN AN AMBIGUOUS AND ENTREPRENEURIAL ENVIRONMENT, WILLING TO ROLL UP SLEEVES AND LEARN.AMAZING PEOPLE COACHING AND MANAGEMENT SKILLS WITH THE ABILITY TO EFFICIENTLY COMMUNICATE AND DRIVE RESULTS ACROSS THE ORGANIZATION.EXCELLENT TIME MANAGEMENT SKILLS WITH THE ABILITY TO HIT DEADLINES AND KEEP MANAGEMENT INFORMED. AN ANALYTICAL MINDSET WITH THE ABILITY TO INTERPRET DATA, ANALYZE TRENDS, AND TRANSLATE INSIGHTS INTO ACTIONABLE STRATEGIES AND TACTICS.A STRATEGIC THINKER WITH A PROVEN TRACK RECORD OF DEVELOPING AND EXECUTING DATA-DRIVEN REVENUE GROWTH STRATEGIES. YOU ARE PASSIONATE ABOUT DRIVING RESULTS AND POSSESS A RELENTLESS FOCUS ON CONTINUOUS IMPROVEMENT.AN OPERATIONAL AND PROCESS-ORIENTED MINDSET, WITH A PASSION FOR STREAMLINING AND OPTIMIZING EXISTING PROCESSES TO ACHIEVE GREATER EFFICIENCY AND EFFECTIVENESS.A “WORKING GENERAL” MENTALITY; SOMEONE WHO IS IN CHARGE BUT IS CONTRIBUTING WITH EVEN MORE PASSION THAN THE TEAM, PAVING THE WAY AND INSPIRING THE COMPANY’S WORK ETHIC AND COMMITMENT TO EXCELLENCE.STRONG EXPERTISE IN CRM SYSTEMS, WITH ABILITY TO MANAGE SYSTEMS TO ENSURE ACCURATE DATA CAPTURE AND REPORTING OF SALES PERFORMANCE.\n\nMINIMUM REQUIRED EDUCATION AND WORK EXPERIENCE:\nBACHELOR'S DEGREE IN BUSINESS ADMINISTRATION, MARKETING, OR A RELATED FIELD; MBA PREFERRED.PROVEN TRACK RECORD OF SUCCESS IN REVENUE GENERATION, BUSINESS DEVELOPMENT, AND SALES LEADERSHIP ROLES WITHIN THE OUTDOOR ADVERTISING OR MEDIA INDUSTRY. A MINIMUM OF 3-5 YEARS IN A SALES LEADERSHIP POSITION AND 8+ YEARS OF TOTAL SELLING AND/OR BUSINESS DEVELOPMENT EXPERIENCE IS REQUIRED.\nSTRONG NEGOTIATION SKILLS WITH A DEMONSTRATED ABILITY TO CLOSE COMPLEX, HIGH-VALUE DEALS WITH STRATEGIC PARTNERS AND CLIENTS.\nCULTURE FIT:\nYOU ARE A COLLABORATIVE AND RESULTS-ORIENTED INDIVIDUAL WHO THRIVES IN A FAST-PACED, DYNAMIC ENVIRONMENT.YOU ARE PASSIONATE ABOUT THE OUT-OF-HOME ADVERTISING INDUSTRY AND THE WELLNESS INDUSTRY, AND POSSESS A DEEP UNDERSTANDING OF CURRENT TRENDS AND CHALLENGES.YOU ARE A STRONG ADVOCATE FOR BUILDING AND MAINTAINING A POSITIVE, INCLUSIVE, AND HIGH-PERFORMING COMPANY CULTURE.\nPHYSICAL REQUIREMENTS:\nTHIS IS A STATIONARY POSITION, WITH PROLONGED PERIODS OF SITTING AT A DESK.THIS POSITION WILL REQUIRE PROLONGED PERIODS OF OPERATING A COMPUTER/KEYBOARD/MOUSE/MONITOR AND OTHER OFFICE PRODUCTIVITY MACHINERY SUCH AS A COPY MACHINE, COMPUTER PRINTER, AND TELEPHONE. THE PERSON IN THIS POSITION MUST OCCASIONALLY MOVE ABOUT THE OFFICE TO ACCESS OFFICE MACHINERY OR ATTEND MEETINGS.\nWORK IS PERFORMED IN A TEMPERATURE-CONTROLLED ENVIRONMENT, BUT EMPLOYEE MAY BE REQUIRED TO TRAVEL TO OFF-SITE MEETINGS FOR BUSINESS PURPOSES.\nWHY JOIN US:\nOPPORTUNITY TO LEAD REVENUE GENERATION EFFORTS FOR A LEADING ADVERTISING COMPANY WITH A STRONG REPUTATION FOR INNOVATION AND EXCELLENCE.COMPETITIVE SALARY, BONUS AND ROBUST BENEFITS PACKAGE WITH OPPORTUNITIES FOR PROFESSIONAL GROWTH AND DEVELOPMENT.COLLABORATIVE AND DYNAMIC WORK ENVIRONMENT WITH A TALENTED TEAM OF PROFESSIONALS DEDICATED TO DRIVING SUCCESS.MAKE A SIGNIFICANT IMPACT BY SHAPING THE FUTURE OF SPONSORED WELLNESS ADVERTISING\nIF YOU ARE A STRATEGIC LEADER WITH A PROVEN TRACK RECORD OF SUCCESS IN DRIVING REVENUE GROWTH AND MAXIMIZING SALES TEAM PERFORMANCE WITHIN THE ADVERTISING INDUSTRY, WE INVITE YOU TO APPLY FOR THE POSITION AND JOIN US ON OUR JOURNEY OF INNOVATION AND GROWTH. APPLY NOW TO BE PART OF OUR DYNAMIC TEAM!\n\nEQUAL EMPLOYMENT OPPORTUNITY POLICY: OUR COMPANY PROHIBITS DISCRIMINATION AND HARASSMENT OF ANY TYPE AND AFFORDS EQUAL EMPLOYMENT OPPORTUNITIES TO EMPLOYEES AND APPLICANTS WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, PREGNANCY, AGE, NATIONAL ORIGIN, DISABILITY STATUS, GENETIC INFORMATION, PROTECTED VETERAN STATUS, OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW. OUR COMPANY CONFORMS TO THE SPIRIT AS WELL AS TO THE LETTER OF ALL APPLICABLE LAWS AND REGULATIONS.\nAMERICANS WITH DISABILITIES ACT POLICY: OUR COMPANY WILL REASONABLY ACCOMMODATE QUALIFIED INDIVIDUALS WITH A DISABILITY SO THAT THEY CAN PERFORM THE ESSENTIAL FUNCTIONS OF A JOB UNLESS DOING SO CAUSES A DIRECT THREAT TO THESE INDIVIDUALS OR OTHERS IN THE WORKPLACE AND THE THREAT CANNOT BE ELIMINATED BY REASONABLE ACCOMMODATION OR IF THE ACCOMMODATION CREATES AN UNDUE HARDSHIP TO THE COMPANY. CONTACT THE HUMAN RESOURCES DEPARTMENT WITH QUESTIONS OR REQUESTS FOR ACCOMMODATION",
    "job_skill_set": [
      "sales leadership",
      "business development",
      "negotiation",
      "data analysis",
      "revenue generation strategy",
      "sales strategy development",
      "performance management",
      "market analysis",
      "communication",
      "strategic thinking",
      "team collaboration",
      "client relationship management",
      "time management",
      "coaching and mentoring",
      "adaptability",
      "problem solving",
      "influence",
      "results-oriented",
      "CRM systems",
      "sales training"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "and",
      "business",
      "businessdevelopment",
      "client",
      "coaching",
      "collaboration",
      "communication",
      "crm",
      "data",
      "development",
      "generation",
      "influence",
      "leadership",
      "management",
      "market",
      "mentoring",
      "negotiation",
      "performance",
      "problem",
      "relationship",
      "resultsoriented",
      "revenue",
      "sales",
      "solving",
      "strategic",
      "strategy",
      "svp",
      "systems",
      "team",
      "thinking",
      "time",
      "training"
    ]
  },
  {
    "job_id": "3898164945",
    "job_title": "Business Development Associate",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "THE BUSINESS DEVELOPMENT ASSOCIATE WILL BE RESPONSIBLE FOR DRIVING BUSINESS RESULTS BY ATTENDING INDUSTRY EVENTS, QUALIFYING AND CLOSING NEW LEADS, AND PROVIDING DIRECTION TO THE INSIDE SALES TEAM. THEY WILL REPORT TO THE VICE PRESIDENT OF BUSINESS DEVELOPMENT. \nRESPONSIBILITIES:- ATTEND INDUSTRY EVENTS AND CONFERENCES TO NETWORK, GENERATE NEW LEADS, AND BUILD RELATIONSHIPS WITH PROSPECTS- CONDUCT ONE-ON-ONE APPOINTMENTS AND DEMONSTRATIONS TO QUALIFY LEADS AND CLOSE NEW BUSINESS - ACHIEVE MONTHLY, QUARTERLY, AND ANNUAL SALES TARGETS THROUGH EFFECTIVE LEAD FOLLOW-UP AND ACCOUNT MANAGEMENT- LEVERAGE CRM TO TRACK LEAD PROGRESS AND SALES PERFORMANCE METRICS- COACH AND MENTOR MEMBERS OF THE INSIDE SALES TEAM TO IMPROVE SKILLS, PROCESSES, AND RESULTS- STAY UP-TO-DATE ON INDUSTRY TRENDS, COMPETITIVE LANDSCAPE, AND NEW PROSPECT PAIN POINTS- COLLABORATE CROSS-FUNCTIONALLY TO ENSURE CUSTOMER SUCCESS AND RETENTION - MAINTAIN EXPERT KNOWLEDGE OF COMPANY PRODUCTS/SERVICES AND KEY DIFFERENTIATORS\nREQUIREMENTS:- 5+ YEARS OF EXPERIENCE IN A SALES OR BUSINESS DEVELOPMENT ROLE, WITH A TRACK RECORD OF EXCEEDING TARGETS- EXPERIENCE GENERATING LEADS THROUGH EVENTS, REFERRALS, OUTBOUND CAMPAIGNS - PROVEN ABILITY TO MOVE LEADS THROUGH THE PIPELINE AND CONSISTENTLY CLOSE DEALS- STRONG PRESENTATION, COMMUNICATION, AND OBJECTION HANDLING SKILLS- PROFICIENCY WITH SALESFORCE OR OTHER CRM PLATFORMS- ABILITY TO PRIORITIZE, MULTI-TASK, AND MANAGE TIME EFFECTIVELY - TEAM PLAYER MENTALITY WITH EXPERIENCE LEADING AND COACHING OTHERS- BACHELOR'S DEGREE IN BUSINESS, MARKETING OR RELATED FIELD PREFERRED\nBENEFITS AND WORK ENVIRONMENT\nAT PHYSICIAN LIFE CARE PLANNING, WE OFFER A COMPREHENSIVE BENEFITS PACKAGE THAT SUPPORTS THE PHYSICAL, FINANCIAL, AND EMOTIONAL WELL-BEING OF OUR EMPLOYEES, INCLUDING MEDICAL, DENTAL, VISION, 401(K), LIFE INSURANCE, PAID TIME OFF, AND WELLNESS PROGRAMS. WE FOSTER A COLLABORATIVE AND INCLUSIVE WORK ENVIRONMENT WHERE EMPLOYEES CAN THRIVE AND ACHIEVE THEIR PROFESSIONAL GOALS. OUR CORE VALUES OF COMMITMENT TO EXCELLENCE, SUPERLATIVE EXPERTISE, INTEGRITY, OWNERSHIP, PROFESSIONALISM, PROBLEM SOLVING, AND CUSTOMER CENTRICITY GUIDE OUR ACTIONS AND CULTIVATE A WORKPLACE CULTURE OF RESPECT AND SUCCESS.\nPHYSICIAN LIFE CARE PLANNING, LLC IS AN EQUAL OPPORTUNITY EMPLOYER COMMITTED TO DIVERSITY AND INCLUSION. WE PROHIBIT DISCRIMINATION AND HARASSMENT OF ANY KIND BASED ON RACE, COLOR, SEX, RELIGION, SEXUAL ORIENTATION, NATIONAL ORIGIN, DISABILITY, GENETIC INFORMATION, PREGNANCY, OR ANY OTHER PROTECTED CHARACTERISTIC AS OUTLINED BY FEDERAL, STATE, OR LOCAL LAWS.\nCONFIDENTIALITY\nBUSINESS DEVELOPMENT ASSOCIATES MUST ADHERE TO ALL FEDERAL HIPAA LAWS AND REGULATIONS AND BE WILLING TO SIGN A PHYSICIAN LIFE CARE PLANNING, LLC CONFIDENTIALITY AGREEMENT.",
    "job_skill_set": [
      "lead generation",
      "sales closing",
      "account management",
      "presentation skills",
      "coaching",
      "industry knowledge",
      "communication",
      "teamwork",
      "problem solving",
      "networking",
      "relationship building",
      "adaptability",
      "CRM proficiency",
      "time management",
      "salesforce"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "associate",
      "building",
      "business",
      "businessdevelopment",
      "closing",
      "coaching",
      "communication",
      "crm",
      "development",
      "generation",
      "industry",
      "knowledge",
      "lead",
      "management",
      "networking",
      "presentation",
      "problem",
      "proficiency",
      "relationship",
      "sales",
      "salesforce",
      "skills",
      "solving",
      "teamwork",
      "time"
    ]
  },
  {
    "job_id": "3904503149",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "AT FACTBIRD, WE ARE REVOLUTIONIZING THE WORLD OF MANUFACTURING WITH OUR ADVANCED DIGITAL SOLUTIONS. FOUNDED IN DENMARK, WE HAVE EXPANDED OUR HORIZONS ACROSS THE GLOBE, LEAVING A PROFOUND IMPACT IN EUROPE AND THE US. OUR MISSION IS TO REDEFINE THE BOUNDARIES OF MANUFACTURING INTELLIGENCE BY PROMOTING OPERATIONAL EFFICIENCY, ENHANCED PROCESS OPTIMIZATION, AND SUSTAINABLE PRACTICES. \n\nWHO WE’RE LOOKING FOR WE'RE GOING THROUGH AN EXCITING PHASE OF GROWTH AND LOOKING FOR OUR NEW BUSINESS DEVELOPMENT REPRESENTATIVE TO TAKE CARE OF OUR CUSTOMERS IN THE UNITED STATES, WORKING REMOTELY. THIS POSITION WILL REPORT TO OUR US SALES DIRECTOR. AS A BUSINESS DEVELOPMENT REPRESENTATIVE (BDR), YOU WILL PLAY A CRUCIAL ROLE IN DRIVING THE GROWTH OF OUR US BUSINESS THROUGH PROACTIVE OUTREACH AND STRATEGIC ENGAGEMENT WITH POTENTIAL CLIENTS. YOUR PRIMARY RESPONSIBILITY WILL BE TO GENERATE AND QUALIFY LEADS, NURTURE RELATIONSHIPS, AND ULTIMATELY SECURE NEW OPPORTUNITIES FOR THE ACCOUNT EXECUTIVE TEAM. YOU WILL BE AT THE FOREFRONT OF OUR SALES EFFORTS, IDENTIFYING PROSPECTS, UNDERSTANDING THEIR NEEDS, AND ARTICULATING HOW OUR SOLUTIONS CAN ADDRESS THEIR CHALLENGES \n\nWHAT YOU’LL BE DOINGPROSPECTING AND LEAD GENERATION:CONDUCT TARGETED OUTBOUND PROSPECTING ACTIVITIES TO IDENTIFY AND QUALIFY POTENTIAL LEADS.UTILIZE VARIOUS CHANNELS, SUCH AS EMAIL, PHONE CALLS, SOCIAL MEDIA, VIDEO, AND NETWORKING EVENTS, TO ENGAGE WITH PROSPECTS.QUALIFICATION AND NEEDS ANALYSIS:CONDUCT THOROUGH RESEARCH ON PROSPECTS TO UNDERSTAND THEIR BUSINESS CHALLENGES, PAIN POINTS, AND OBJECTIVES.QUALIFY LEADS AND ASSESS THEIR FIT FOR OUR SOLUTIONS.IDENTIFY KEY DECISION-MAKERS AND INFLUENCERS WITHIN TARGET ORGANIZATIONS.PIPELINE MANAGEMENT:MAINTAIN ACCURATE RECORDS OF ALL PROSPECTIVE INTERACTIONS AND SALES ACTIVITIES IN THE HUBSPOT CRM SYSTEM.TRACK PROGRESS AGAINST SALES TARGETS, KPI’S, AND OBJECTIVES, AND PROVIDE REGULAR REPORTS TO THE SALES DIRECTOR.COLLABORATION AND COMMUNICATION:COLLABORATE CLOSELY WITH THE ACCOUNT EXECUTIVE TEAM TO ENSURE A SMOOTH HANDOVER OF QUALIFIED LEADS.PROVIDE VALUABLE INSIGHTS AND FEEDBACK FROM PROSPECTIVE INTERACTIONS TO INFORM MARKETING AND PRODUCT DEVELOPMENT EFFORTS.COMMUNICATE EFFECTIVELY WITH INTERNAL STAKEHOLDERS TO ALIGN GOALS AND STRATEGIES. \n\nWHAT MAKES YOU A GREAT FIT 😎12 MONTHS OF PROVEN TRACK RECORD OF SUCCESS IN A SALES OR BUSINESS DEVELOPMENT ROLE, PREFERABLY WITHIN THE SAAS INDUSTRY.EXCELLENT COMMUNICATION AND INTERPERSONAL SKILLS, WITH THE ABILITY TO BUILD RAPPORT AND CREDIBILITY WITH PROSPECTS.SELF-MOTIVATED AND RESULTS-ORIENTED, WITH A DRIVE TO EXCEED TARGETS AND GOALS.ABILITY TO THRIVE IN A FAST-PACED, DYNAMIC ENVIRONMENT AND ADAPT TO CHANGING PRIORITIES.HIGHLY MOTIVATED TO SUCCEED WITHIN A FAST-GROWING COMPANY.PRIOR START-UP SALES EXPERIENCE IS A HUGE PLUS. \n\nTHE FACTBIRD STORY  🚀FACTBIRD ORIGINATED FROM THE EMENDO CONSULTING GROUP, RECOGNIZED FOR ITS PROWESS IN LEAN MANUFACTURING AND PROCESS OPTIMIZATION. WHILE OUR ROOTS ARE DEEP IN THIS HERITAGE, WE HAVE CHARTED OUR UNIQUE COURSE, STANDING AT THE FOREFRONT OF MANUFACTURING INTELLIGENCE SOFTWARE TODAY. AT FACTBIRD, WE PRIDE OURSELVES ON DELIVERING PLUG-AND-PLAY HARDWARE THAT CAN BE INSTALLED IN MINUTES. WHEN PAIRED WITH OUR INNOVATIVE WEB-BASED SOFTWARE, OUR SOLUTIONS PROVIDE YOU WITH INSIGHTS ACCESSIBLE FROM ANY DEVICE, ANYWHERE. WITH OUR PRESENCE IN OVER TWENTY-FIVE COUNTRIES AND OFFICES IN DENMARK AND THE UNITED STATES, WE ARE SCALING SIGNIFICANTLY ACROSS THE GLOBE. CURRENTLY, WE HAVE A TEAM OF 50+ TALENTED EMPLOYEES BASED IN DENMARK, THE UNITED STATES, GERMANY, AND SWEDEN, DEDICATED TO OUR MISSION, AND OUR SYSTEM IS USED BY 200+ MANUFACTURERS WORLDWIDE DAILY.  \n\nAT FACTBIRD WE TAKE CARE OF OUR PEOPLE. HERE IS WHAT WE OFFER 🎉EMPLOYEE EQUITY PROGRAM. FLEXIBLE WORKING HOURS. REMOTE WORK OR CO-WORKING SPACE. YOU CHOOSE! MEDICAL, DENTAL, AND VISION INSURANCE. 401 (K) PAID PARENTAL LEAVE POLICY. PLANS FOR CAREER GROWTH, TAILORED TRAINING, MENTORSHIP, AND CROSS-TEAM COOPERATION. GREAT AND STRUCTURED ONBOARDING—WE WANT TO TEACH YOU THE BEST PRACTICES OF A GOOD SALES APPROACH. AN INTERNATIONAL, DIVERSE, AND INCLUSIVE CULTURE. FLEXIBLE PAID TIME OFF/HOLIDAYS  \n\nAPPLICATION PROCESSEXCITED ABOUT THE OPPORTUNITY TO JOIN THE FACTBIRD TEAM?TO START THE PROCESS, PLEASE SEND US YOUR RESUME ALONG WITH A SHORT VIDEO APPLICATION INTRODUCING YOURSELF. IN THE VIDEO, SHARE A BIT ABOUT YOUR EXPERIENCE AND BACKGROUND. ONCE WE REVIEW YOUR VIDEO, WE WILL BEGIN INVITING POTENTIAL FITS TO AN INTERVIEW WITH OUR RECRUITMENT TEAM.FEEL FREE TO PASS THIS INFORMATION ALONG TO ANYONE YOU KNOW WHO MAY BE A SUITABLE CANDIDATE!OUR INTERVIEW PROCESS INCLUDES AN INITIAL CALL WITH OUR RECRUITER, FOLLOWED BY A CONVERSATION WITH OUR SALES DIRECTOR IN NORTH AMERICA, AND A FINAL MEETING WITH OUR LEADERSHIP TEAM. DURING THE INTERVIEW PROCESS, WE WILL ALSO INCLUDE TIME FOR YOU TO MEET THE REST OF THE TEAM.IF YOU HAVE ANY QUESTIONS, REACH OUT TO KHRISTEL APARICIO (KHMA@FACTBIRD.COM).  EQUAL OPPORTUNITY EMPLOYERAT FACTBIRD, WE PROUDLY EMBRACE DIVERSITY AND EQUALITY IN OUR WORKPLACE. WE BELIEVE THAT A THRIVING ORGANIZATION IS BUILT ON THE FOUNDATION OF INCLUSIVITY, WHERE EVERY INDIVIDUAL IS VALUED FOR THEIR UNIQUE PERSPECTIVES, EXPERIENCES, AND IDENTITIES. WE'RE COMMITTED TO FOSTERING AN ENVIRONMENT WHERE OUR EMPLOYEES FEEL EMPOWERED TO BE THEIR AUTHENTIC SELVES, KNOWING THAT THEIR DIFFERENCES ENRICH OUR COLLECTIVE JOURNEY.AT FACTBIRD, WE DO NOT DISCRIMINATE BASED ON FACTORS SUCH AS RACE, ETHNICITY, RELIGION, GENDER, SEXUAL ORIENTATION, AGE, DISABILITY, OR VETERAN STATUS. WE CELEBRATE DIVERSITY AS A SOURCE OF STRENGTH, DRIVING INNOVATION, COLLABORATION, AND GROWTH. OUR COMMITMENT TO EQUALITY EXTENDS TO EVERY ASPECT OF OUR OPERATIONS, FROM RECRUITMENT AND HIRING TO CAREER DEVELOPMENT AND BEYOND.WE UNDERSTAND THAT EACH PERSON MAY HAVE UNIQUE NEEDS, AND WE'RE DEDICATED TO PROVIDING REASONABLE ACCOMMODATIONS TO ENSURE EQUAL OPPORTUNITIES FOR ALL. IF YOU REQUIRE ASSISTANCE OR ACCOMMODATION DURING ANY STAGE OF THE APPLICATION OR INTERVIEW PROCESS, PLEASE REACH OUT TO US AT KHMA@FACTBIRD.COM. WE'RE HERE TO SUPPORT YOU IN EVERY STEP OF YOUR JOURNEY WITH US. AT FACTBIRD, WE BELIEVE THAT EMBRACING DIVERSITY ISN'T JUST THE RIGHT THING TO DO – IT'S THE KEY TO UNLOCKING OUR FULL POTENTIAL AND CREATING A WORKPLACE WHERE EVERYONE CAN THRIVE.",
    "job_skill_set": [
      "prospecting",
      "communication",
      "interpersonal skills",
      "self-motivation",
      "adaptability",
      "team collaboration",
      "problem solving",
      "lead generation",
      "CRM (HubSpot)",
      "sales strategy",
      "data analysis",
      "SaaS knowledge"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "crm",
      "data",
      "development",
      "generation",
      "hubspot",
      "interpersonal",
      "knowledge",
      "lead",
      "problem",
      "prospecting",
      "representative",
      "saas",
      "sales",
      "selfmotivation",
      "skills",
      "solving",
      "strategy",
      "team"
    ]
  },
  {
    "job_id": "3901357508",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "AT DATAIKU, WE'RE NOT JUST ADAPTING TO THE AI REVOLUTION, WE'RE LEADING IT. SINCE OUR BEGINNING IN PARIS IN 2013, WE'VE BEEN PIONEERING THE FUTURE OF AI WITH A PLATFORM THAT MAKES DATA ACTIONABLE AND ACCESSIBLE. WITH OVER 1,000 TEAMMATES ACROSS 25 COUNTRIES AND BACKED BY A RENOWNED SET OF INVESTORS, WE'RE THE ARCHITECTS OF EVERYDAY AI, ENABLING DATA EXPERTS AND DOMAIN EXPERTS TO WORK TOGETHER TO BUILD AI INTO THEIR DAILY OPERATIONS, FROM ADVANCED ANALYTICS TO GENERATIVE AI.\n\nWE ARE LOOKING FOR A RESULTS-DRIVEN AND HANDS-ON BUSINESS DEVELOPMENT REPRESENTATIVE TO DRIVE DATAIKU'S BUSINESS DEVELOPMENT ACTIVITIES. YOU MUST HAVE THE ABILITY TO UNDERSTAND THE SALES DEVELOPMENT PROCESS AND TECHNOLOGY STACK AND ENSURE ITS ADOPTION. WE NEED A SELF-STARTER MOTIVATED TO CONSTANTLY IMPROVE AND OPTIMIZE THE PROCESS TO DRIVE PERFORMANCE. THE POSITION IS HYBRID IN OUR DENVER OFFICE.\n\nHOW YOU'LL MAKE AN IMPACT\n\nMANAGE A LARGE VOLUME OF DAILY INBOUND AND OUTBOUND LEADS - CONNECTING VIA PHONE, EMAIL AND LINKEDIN AND QUALIFYING THEMENGAGE WITH OUR SALES AND MARKETING EXECUTIVES TO DESIGN, RESEARCH AND EXECUTE OUTBOUND VERTICAL AND/OR GEOGRAPHICAL MARKETS CAMPAIGNS TO GROW SALES PIPELINE IN A DEDICATED TERRITORYWORK WITH OUR SALES EXECUTIVES TO PROSPECT AND CLOSE LARGE ENTERPRISE DEALSEDUCATE AND NURTURE EARLY-PHASE PROSPECTS FOR POTENTIAL FUTURE OPPORTUNITIESDEMONSTRATE KNOWLEDGE OF DATAIKU DSS AND ITS VALUE PROPOSITION AND AN UNDERSTANDING OF THE BIG DATA ECOSYSTEM TO CONVERSE WITH DATA AND BUSINESS LEADERS FROM SMB TO HIGH-GROWTH COMPANIES, TO LARGE MULTINATIONALS IN INDUSTRIES SUCH AS E-COMMERCE, RETAIL, BANK, INSURANCE, UTILITIES, AND TRANSPORTANALYZE AND REPORT ON YOUR WEEKLY ACTIVITIES TO IDENTIFY POTENTIAL OPTIMIZATIONS\n\nWHAT YOU'LL NEED TO BE SUCCESSFUL\n\nYOU HAVE STRONG INTERPERSONAL SKILLS AND EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS IN ENGLISHYOU HAVE SOME RELEVANT EXPERIENCE AND PROVEN SUCCESS IN SALES OR BUSINESS DEVELOPMENT IN THE SOFTWARE / TECH INDUSTRY OR IN A STARTUPYOU HAVE DEMONSTRATED ORGANIZATIONAL AND PROJECT MANAGEMENT SKILLS WITH THE ABILITY TO HANDLE PRESSURE AND A HIGH VOLUME OF TASKS IN A RESULT-ORIENTED ENVIRONMENTYOU ARE ANALYTICAL AND UNDERSTAND THE NEED TO TRACK EVERYTHING YOU DOYOU ARE REALLY INTERESTED IN INNOVATIVE ISSUES AS DATA SCIENCE AND PREDICTIVE ANALYSISTHIS IS A GREAT OPPORTUNITY TO BE TRAINED ON EFFICIENT SALES METHODOLOGY IN A GROWING AND COMPETITIVE MARKET WITH GREAT CHANCE TO GROW IN THE COMPANY.\n\nCOMPENSATION AND BENEFITS\n\nTHE FINAL COMPENSATION PACKAGE FOR THIS ROLE WILL BE DETERMINED DURING THE INTERVIEW PROCESS AND IS BASED ON A VARIETY OF FACTORS, INCLUDING, BUT NOT LIMITED TO, GEOGRAPHIC LOCATION, INTERNAL EQUITY, EDUCATION, SKILL SET, EXPERIENCE AND TRAINING. ELIGIBLE ROLES MAY ALSO BE ENTITLED TO RECEIVE COMMISSION OR OTHER VARIABLE COMPENSATION THROUGH DATAIKU'S INCENTIVE COMPENSATION PROGRAM.\n\nDATAIKU ALSO OFFERS COMPREHENSIVE BENEFITS, INCLUDING STOCK OPTIONS, MEDICAL, DENTAL, AND VISION PLANS, FLEXIBLE SPENDING ACCOUNTS, PRE-TAX COMMUTER BENEFITS, A 401K COMPANY MATCH, PAID VACATIONS AND SICK LEAVE, PAID PARENTAL LEAVE, EMPLOYER PAID DISABILITY COVERAGE, AND ADDITIONAL HEALTH AND WELLBEING PERKS AND BENEFITS. DATAIKU RESERVES THE RIGHT TO AMEND OR MODIFY EMPLOYEE PERKS AND BENEFITS AT ANY TIME.\n\nUS ONLY NATIONAL BASE PAY RANGES\n\n$60,000 — $90,000 USD\n\nWHAT ARE YOU WAITING FOR!\n\nAT DATAIKU, YOU'LL BE PART OF A JOURNEY TO SHAPE THE EVER-EVOLVING WORLD OF AI. WE'RE NOT JUST BUILDING A PRODUCT; WE'RE CRAFTING THE FUTURE OF AI. IF YOU'RE READY TO MAKE A SIGNIFICANT IMPACT IN A COMPANY THAT VALUES INNOVATION, COLLABORATION, AND YOUR PERSONAL GROWTH, WE CAN'T WAIT TO WELCOME YOU TO DATAIKU! AND IF YOU’D LIKE TO LEARN EVEN MORE ABOUT WORKING HERE, YOU CAN VISIT OUR DATAIKU LINKEDIN PAGE .\n\nOUR PRACTICES ARE ROOTED IN THE IDEA THAT EVERYONE SHOULD BE TREATED WITH DIGNITY, DECENCY AND FAIRNESS. DATAIKU ALSO BELIEVES THAT A DIVERSE IDENTITY IS A SOURCE OF STRENGTH AND ALLOWS US TO OPTIMIZE ACROSS THE MANY DIMENSIONS THAT ARE NEEDED FOR OUR SUCCESS. THEREFORE, WE ARE PROUD TO BE AN EQUAL OPPORTUNITY EMPLOYER. ALL EMPLOYMENT PRACTICES ARE BASED ON BUSINESS NEEDS, WITHOUT REGARD TO RACE, ETHNICITY, GENDER IDENTITY OR EXPRESSION, SEXUAL ORIENTATION, RELIGION, AGE, NEURODIVERSITY, DISABILITY STATUS, CITIZENSHIP, VETERAN STATUS OR ANY OTHER ASPECT WHICH MAKES AN INDIVIDUAL UNIQUE OR PROTECTED BY LAWS AND REGULATIONS IN THE LOCATIONS WHERE WE OPERATE. THIS APPLIES TO ALL POLICIES AND PROCEDURES RELATED TO RECRUITMENT AND HIRING, COMPENSATION, BENEFITS, PERFORMANCE, PROMOTION AND TERMINATION AND ALL OTHER CONDITIONS AND TERMS OF EMPLOYMENT. IF YOU NEED ASSISTANCE OR AN ACCOMMODATION, PLEASE CONTACT US AT: REASONABLE-ACCOMMODATIONS@DATAIKU.COM\n\n",
    "job_skill_set": [
      "sales development",
      "business development",
      "data analysis",
      "project management",
      "communication tools (phone, email, LinkedIn)",
      "software/tech industry experience",
      "sales methodology",
      "interpersonal skills",
      "verbal communication",
      "written communication",
      "organizational skills",
      "self-motivation",
      "adaptability",
      "pressure handling",
      "analytical thinking",
      "team collaboration",
      "big data ecosystem"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "analytical",
      "big",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "data",
      "development",
      "ecosystem",
      "email",
      "experience",
      "handling",
      "industry",
      "interpersonal",
      "linkedin",
      "management",
      "methodology",
      "organizational",
      "phone",
      "pressure",
      "project",
      "representative",
      "sales",
      "selfmotivation",
      "skills",
      "softwaretech",
      "team",
      "thinking",
      "tools",
      "verbal",
      "written"
    ]
  },
  {
    "job_id": "3904359922",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "WE’RE LOOKING FOR A BUSINESS DEVELOPMENT PROFESSIONAL TO JOIN OUR GROWING US SALES TEAM.\n\nMONTROSE ENVIRONMENTAL GROUP, INC. IS A HIGH-GROWTH ENVIRONMENTAL SERVICES COMPANY OFFERING MEASUREMENT AND ANALYTICAL SERVICES AND ENVIRONMENTAL RESILIENCY AND SUSTAINABILITY SERVICES TO A DIVERSE RANGE OF CLIENTS IN INDUSTRY AND GOVERNMENT THROUGHOUT NORTH AMERICA AND ABROAD. OUR QUALIFIED ENGINEERS, SCIENTISTS, TECHNICIANS, ASSOCIATES AND POLICY EXPERTS ARE PROUD OF OUR ABILITY TO OBJECTIVELY HELP INDUSTRY, THE PUBLIC AND REGULATORS WORK CONSTRUCTIVELY TOGETHER ON ENVIRONMENTAL OPPORTUNITIES.\n\nABOUT MONTROSE’S OPTICAL GAS IMAGING BUSINESS\n\nWE BELIEVE IN HELPING PROTECT THE AIR WE BREATHE, WATER WE DRINK AND SOIL THAT FEEDS US AS OUR PURPOSE.\n\nOUR OPTICAL GAS IMAGING (OGI) BUSINESS HELPS OIL & GAS CLIENTS IDENTIFY FUGITIVE EMISSIONS USING THE LATEST TECHNOLOGY, WHICH IMMEDIATELY TRANSLATES INTO CARBON EMISSION REDUCTION AND ECONOMIC BENEFIT FOR OUR CLIENTS. CLIENTS WORK WITH MONTROSE TO ENSURE COMPLIANCE WITH APPLICABLE ENVIRONMENTAL REGULATIONS AS WELL AS TO SUPPORT VOLUNTARY EMISSION PROGRAMS AS PART OF THEIR ESG GOALS. AS A COMPANY THAT CONTINUALLY INVESTS IN NEW TECHNOLOGY, MONTROSE WAS ONE OF THE FIRST ORGANIZATIONS TO COMMERCIALIZE OGI TECHNOLOGY AND HAS EARNED A MARKET LEADERSHIP POSITION.\n\nABOUT THE BUSINESS DEVELOPMENT (BD) MANAGER ROLE\n\nTHE BD MANAGER FOR OUR GULF REGION PERFORMS A WIDE RANGE OF DUTIES ASSOCIATED WITH INCREASING SALES AS WELL AS FOSTERING STRONG RELATIONSHIPS WITH OUR EXISTING CUSTOMER BASE.\n\nREPORTING TO THE VICE PRESIDENT OF SALES, YOUR PRIMARY RESPONSIBILITIES WILL BE TO:\n\nPROSPECT AND IDENTIFY NEW ACCOUNTS FROM MARKETING QUALIFIED LEADS (MQLS) AND BY LEVERAGING THE LATEST PROSPECTING SOFTWARE PLATFORMS TO CONNECT MONTROSE WITH CLIENTS RESEARCHING SOLUTIONSQUALIFY LEADS VIA PHONE, EMAIL, AND RESEARCH AND RESPOND TO WEB ENQUIRES FOR BOTH OGI SERVICES AND OGI PRODUCTS (CAMERAS, SENSORS, ETC)SERVE AS THE MAIN POINT OF CONTACT BETWEEN CLIENTS AND MONTROSE FOR AN ASSIGNED BOOK OF BUSINESS WITHIN THE GULF REGION OR DEFINED TERRITORYSCHEDULE SALES APPOINTMENTS WITH PROSPECTS AND CLIENTS AND COORDINATE MEETINGS, SPECIAL EVENTS (I.E., LUNCH/LEARNS), AND TRAVEL WITH SUBJECT MATTER EXPERTS (SME)ATTEND CONFERENCES AND TRADE SHOWS TO REPRESENT MONTROSE AND BE A BRAND AMBASSADORDEVELOP AND EXECUTE KEY ACCOUNT PLANS FOR TOP MONTROSE CUSTOMERS TO MAINTAIN BUSINESS AND GROW SHARE OF WALLETFACILITATE AND COORDINATE QUOTE/PROPOSAL/RFP PRODUCTION AND DELIVERY TO CLIENT FROM INITIAL CONTACT THROUGH PURCHASE ORDER, WORKING WITH OUR PROPOSAL CENTER AND OPERATIONAL TEAMSMEET QUARTERLY SALES TARGETS GENERATED FROM PROACTIVE SELLING ACTIVITYPREPARE MONTHLY REPORTS HIGHLIGHTING SALES, QUOTE ACTIVITY, PIPELINE FORECAST, SALIENT CLIENT COMMENTARY, AND MARKET CONDITIONS (IDENTIFY OPPORTUNITIES AND RISKS)ENSURE CUSTOMER SATISFACTION BY MONITORING AND COMMUNICATING WITH CLIENTS, MAKING PERFORMANCE CHANGES WHEN NECESSARY, AND BY SHARING RESULTS WITH THE SENIOR MANAGEMENT TEAM.PRACTICE SAFE WORK PRACTICES BY FOLLOWING ALL COMPANY SAFETY RULES AND OSHA REGULATIONS, INCLUDING ATTENDANCE AT ALL REQUIRED SAFETY TRAINING PROGRAMS.KEEP UP-TO-DATE AND CURRENT ON INDUSTRY TRENDS BY COMPLETING FORMAL TRAINING, REVIEWING PROFESSIONAL PUBLICATIONS, AND ATTENDING PROFESSIONAL WORKSHOPSBE WILLING TO ASSIST/PARTICIPATE IN THOUGHT LEADERSHIP MARKETING ACTIVITIES SUCH AS WEBINARS, BLOG POSTS, WHITE PAPERS, ETC.\n\n\nOUR IDEAL CANDIDATE\n\nLEAD GENERATION AND BUSINESS DEVELOPMENT: THE ABILITY TO PROACTIVELY PROSPECT, PURSUE AND QUALIFY LEADS, AND ASSEMBLE TALKING POINTS, INTRODUCTORY EMAILS, AND PROSPECTING SCRIPTS.PORTFOLIO MANAGEMENT: CAN MANAGE A PORTFOLIO THAT MEETS OR EXCEEDS QUOTA/TARGETS, AND ALWAYS HAVE A CLEAR COMPREHENSION OF THE ACCOUNTS IN YOUR PIPELINE (STAGE, KEY ACTIONS TO MOVE THEM FORWARD), AND TO PROACTIVELY MITIGATE THE RISKS OF LOSING CLIENTS.DISCIPLINED SALES HYGIENE: YOU CAN PROACTIVELY ENGAGE IN HIGH QUALITY SALES ADMINISTRATION ACTIVITIES, SUCH AS A DEVELOPMENT AND MAINTENANCE OF STRATEGIC ACCOUNT PLANS, SALES FORECASTS AND ANALYTICS AND OTHER REPORTING, CONSISTENTLY USING OUR CRM (SALESFORCE) AS THE PRIMARY SOURCE OF TRUTH FOR CLIENT DATA.A NATURAL NETWORKER, ABLE TO CULTIVATE RELATIONSHIPS FROM THE START AND DEEPEN OVER TIME; CAPABLE OF IDENTIFYING AND BUILDING RELATIONSHIPS WITH KEY CONTACTS AND “RIGHT FIT” IDEAL CLIENT COMPANIES.A CLIENT CENTRIC ADVISOR, ABLE TO IDENTIFY AND FILTER YOUR CLIENTS’ SPECIFIC PAIN POINTS AND USE A CONSULTATIVE APPROACH TO THE CUSTOMER ENGAGEMENT TO POSITION MONTROSE OFFERINGS TO ADDRESS THEIR BUSINESS NEEDS.YOU HAVE 5+ YEARS OF SELLING EXPERIENCE WITH A PROVEN TRACK RECORD OF SUCCESS IN BUSINESS DEVELOPMENT FOR TECHNICAL SERVICES OR PRODUCTS, PREFERABLY IN ENVIRONMENTAL RELATED FIELDSA MONTROSE CLIENT STORYTELLER, YOU HAVE MASTERED THE ART AND SCIENCE OF THE SALES CONVERSATION, ASKING THE RIGHT QUESTIONS AT THE RIGHT TIME TO MOVE THE ENGAGEMENT FORWARD AND UNCOVER THE NEED AND THE REAL CHALLENGEABILITY TO STYLE FLEX AND SELL TO A VARIETY OF CLIENT PERSONASCURIOUS, COURAGEOUS AND CHALLENGES THE STATUS QUO AND OFFERS ALTERNATIVE SOLUTIONS TO PROBLEMSA TEAM PLAYER, NOT A LONE WOLF; YOU VALUE THE POWER OF COLLABORATION WITH YOUR TEAMMATES AND LEADERSEMPATHETIC AND GENEROUS, ASSUMING POSITIVE INTENT – YOU HAVE THE ABILITY TO PUT YOURSELF IN OTHERS SHOESAN ANALYTICAL THINKER WHO THRIVES ON SOLVING PROBLEMS AND ARE OF A GROWTH MINDSETA VORACIOUS AND CONTINUOUS LEARNER; YOU INTERROGATE AND INQUIRE TO LEARNPOSITIVE AND RESILIENT IN CHALLENGING AND HIGH PACED ENVIRONMENTS; YOU DO THE JOB THAT’S NEEDED, WITHOUT BEING ASKED, AND YOU ANTICIPATE PROBLEMS AND HAVE A PLAN A SELF-STARTER WITH EXCEPTIONAL TIME MANAGEMENT SKILLS AND THE ABILITY TO THRIVE IN A REMOTE WORK ENVIRONMENT; YOU CAN STEP UP AND LEAD WHEN YOU NEED TO.YOUR APPROACH TO BUSINESS DEVELOPMENT IS TO OPERATE PROACTIVELY WITH A PLAN AND NOT BE OPPORTUNISTIC OR REACTIVEA STRONG COMMUNICATOR, PRESENTER AND INFLUENCER; YOU GET TO THE POINT AND TELL IT STRAIGHT AND HAVE THE ABILITY TO CHALLENGEYOU CLARIFY EXPECTATIONS UP FRONT, AND FOLLOW THROUGHCOACHABLE: YOU’RE OPEN TO FEEDBACK AND ADJUSTING ALONG THE WAYPROFICIENT WITH MICROSOFT EXCEL, WORD, POWERPOINT, AND GMAILFAMILIARITY WITH CRM BEST PRACTICES (SALES FORCE OR SIMILAR)ENJOY BUSINESS TRAVEL (MOSTLY WITHIN THE GULF), AS MUCH AS 50%\n\n\nMANY OF THE ABOVE ARE NICE-TO-HAVES AND NOT ALL ARE NECESSARY SO EVEN IF YOU ARE MISSING A FEW FROM THE LIST, PLEASE APPLY ANYWAY. WE’D LOVE TO MEET YOU!\n\nMORE THAN JUST A BD PROFESSIONAL YOU SHOW UP EMBODYING MONTROSE’S COMMERCIAL TEAM VALUES:\n\nCLIENTS ARE OUR NORTH STAR\n\nWAKE UP AND WIN\n\nOPERATE WITH EMPATHY\n\nBE BOLD AND CURIOUS\n\nOWN IT\n\nONE MONTROSE\n\nCURIOUS ABOUT WHAT THE FIRST FEW MONTHS ON THE JOB WILL LOOK LIKE?\n\nIN YOUR FIRST 3 MONTHS, YOU WILL:\n\nMEET THE MONTROSE TEAM AND BE INTRODUCED TO EACH OF OUR FUNCTIONS THROUGH A SERIES OF 1:1S AND FORMAL ONBOARDINGLEARN OUR SERVICES BY VISITING CLIENT SITES TO OBSERVE OUR OGI TECHNICIANS IN ACTION AND UNDERSTAND THE CLIENT JOURNEYPARTICIPATE IN OUR MONTHLY SALES SKILLS DEVELOPMENT PROGRAM ACROSS THE ENTIRE MONTROSE SALES COMMUNITY WHERE YOU WILL ENGAGE AND LEARN WITH OVER 40 TOP NOTCH SELLERS.INTERACT WITH OUR CRM TO UNDERSTAND OUR SALES CYCLE AND HOW WE TRACK OUR REVENUE GROWTH AND KEY CLIENT INTERACTIONSBUILD RELATIONSHIPS WITH OTHER MEMBERS OF THE SALES TEAM THROUGH GROUP DISCUSSIONS AND 1:1MEETINGSBEGIN SHADOWING SALES CALLS AND SUPPORT OUR SALES TEAMBEGIN WORKING WITH A PREDETERMINED CLIENT SETPROACTIVELY ENGAGE DORMANT AND INACTIVE ACCOUNTS TO GENERATE NEW BUSINESSMANAGE INBOUND LEADS AND LEADS GENERATED FROM OUR MARKETING TEAM (MQLS)STRATEGICALLY DEVELOP PLANS FOR YOUR ACCOUNTS AND OUTLINE HOW YOU WILL TACTICALLY OPERATIONALIZEYOUR PLANSBRING FORWARD IDEAS ON HOW WE CAN PROACTIVELY GROW THE BUSINESS\n\n\nWHY BE PART OF OUR TEAM?\n\nMONTROSE IS A UNIQUE PLACE. WE HAVE SIX CORE VALUES THAT NOT ONLY INFORM HOW WE MAKE DECISIONS AND SERVICE OUR CLIENTS, BUT ALSO ANIMATE OUR INTERACTIONS AS A TEAM. COMPETITIVE COMPENSATION PACKAGE: ANNUAL SALARY RANGING FROM $105,000- $130,000 WITH A POTENTIAL PERFORMANCE BASED INCENTIVE OF 25-35% PAID QUARTERLY. WE OFFER AWESOME PERKS LIKE UNLIMITED VACATION TIME, GROUP BENEFITS, GENEROUS 401K MATCHING AND THE PLEASURE OF BEING SURROUNDED BY INSPIRING COLLEAGUES AND CLIENTS WHO SHARE THE PASSION FOR IN THE INDUSTRY AND OUR MISSION.\n\nHIRING PROCESS & DETAILS\n\nLOCATION: THIS ROLE IS REMOTE BASED, BUT OUR PREFERENCE IS TO HAVE SOMEONE LOCATED IN THE GULF REGION\n\nOUR HIRING PROCESS\n\nTO GIVE YOU MORE INSIGHT INTO WHAT TO EXPECT, QUALIFIED, SELECTED CANDIDATES WILL HAVE:\n\nSTEP 1: COMPLETE A SHORT ON-LINE PROFILE ASSESSMENT\n\nSTEP 2: VIDEO CALL WITH OUR HR BUSINESS PARTNER. IN THIS CALL, WE WILL COVER THE BASICS OF THE ROLE AND OUR COMPANY, AND DISCUSS A HIGH-LEVEL OVERVIEW OF YOUR PAST EXPERIENCES, GOALS AND INTEREST IN THIS ROLE.\n\nSTEP 3: SECOND VIDEO CALL WITH A FEW MEMBERS OF THE BD AND OPERATIONAL TEAMS TO DIVE DEEPER INTO YOUR EXPERIENCES, GOALS AND SALES APPROACH.\n\nSTEP 4: FINAL INTERVIEW WITH THE EVP OF BUSINESS DEVELOPMENT AND A FEW OTHER MEMBERS OF OUR TEAM. DURING THIS INTERVIEW, YOU MAY BE ASKED TO PRESENT TO HIGHLIGHT YOUR EXPERIENCE THROUGH A FORMAL PRESENTATION\n\nSTEP 5: REFERENCES CHECKED FOR THE SUCCESSFUL CANDIDATE(S).\n\nWHILE NOT ALL APPLICANTS WILL BE SELECTED TO GO THROUGH THE INTERVIEW PROCESS, WE DO AIM TO RESPOND TO ALL APPLICATIONS WHEN POSSIBLE.",
    "job_skill_set": [
      "lead generation",
      "business development",
      "CRM (Salesforce)",
      "Microsoft PowerPoint",
      "proposal writing",
      "account management",
      "communication",
      "relationship building",
      "teamwork",
      "presentation skills",
      "sales forecasting",
      "Microsoft Excel",
      "Microsoft Word",
      "analytical skills",
      "market research",
      "problem solving",
      "time management",
      "adaptability",
      "curiosity",
      "empathy",
      "self-motivation"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "analytical",
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "crm",
      "curiosity",
      "development",
      "empathy",
      "excel",
      "forecasting",
      "generation",
      "lead",
      "management",
      "manager",
      "market",
      "microsoft",
      "powerpoint",
      "presentation",
      "problem",
      "proposal",
      "relationship",
      "research",
      "sales",
      "salesforce",
      "selfmotivation",
      "skills",
      "solving",
      "teamwork",
      "time",
      "word",
      "writing"
    ]
  },
  {
    "job_id": "3900077574",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "✨YOUR NEXT “INTRAPRENEUR” CHALLENGE IS JUST ONE CLICK AWAY! THIS IS NOT YOUR AVERAGE SALES JOB -- INSTEAD, THIS IS A LEADERSHIP POSITION THAT IS IN THE FOREFRONT OF MIGSO-PCUBED'S ORGANIZATIONAL GROWTH.OUR SAN FRANCISCO HUB IS LOOKING FOR A BUSINESS MANAGER TO KEEP PACE WITH THE RAPID EXPANSION OF THE MARKET. THIS IS YOUR OPPORTUNITY TO JOIN THE LARGEST GLOBAL CONSULTING COMPANY THAT SPECIALIZES IN PROGRAM PROJECT MANAGEMENT SERVICES AND SOLUTIONS, WHERE YOU WILL HAVE THE CHANCE TO GROW AND MANAGE NEW CLIENT ACCOUNTS, BUILD YOUR TEAM, AND MANAGE YOUR PROFIT CENTER.\nYOUR NEXT CHALLENGEYOUR GOAL IS TO DEVELOP AND EXPAND OUR BUSINESS AND YOUR NETWORK WHILE FOSTERING RELATIONSHIPS WITH CLIENTS, CANDIDATES, AND CONSULTANTS ACROSS DIFFERENT INDUSTRIES.\nBUSINESS MANAGERS TAKE OWNERSHIP OF THREE ESSENTIAL ELEMENTS OF THE ORGANIZATION:BUSINESS DEVELOPMENT: MAINTAINING A BUSINESS DEVELOPMENT ‘DRUMBEAT’ IS CRITICAL. BUSINESS MANAGERS ARE RESPONSIBLE FOR BUILDING THEIR TARGET COMPANY PORTFOLIO, IDENTIFYING GROWTH OPPORTUNITIES WITHIN THEIR BUSINESS UNIT, MANAGE THE SCOPE OF ACTIVITY BY BUILDING RELATIONSHIPS WITH KEY ACCOUNT CUSTOMERS, AND SELL EXPERT-LEVEL PROJECT MANAGEMENT SERVICES.MANAGEMENT AND RECRUITMENT: OUR PEOPLE ARE OUR CORE COMPETENCY. YOU WILL PARTNER WITH OUR TALENT ACQUISITION TEAM TO INTERVIEW AND HIRE THE RIGHT CANDIDATES TO SUPPORT AND DEVELOP YOUR HUB’S CONSULTANT TEAM. THEN, AS A MANAGER AND LEADER OF YOUR TEAM, YOU HELP TO IDENTIFY GROWTH AREAS AND EMPOWER YOUR TEAM TO REACH THEIR POTENTIAL THROUGHOUT THEIR CAREER (COACHING, CAREER PATH DEVELOPMENT, ETC.).PROFIT CENTER MANAGEMENT: ENSURE PROJECT SUCCESS IN PARTNERSHIP WITH YOUR CONSULTANTS, DELIVERY MANAGERS, AND CLIENTS. MANAGE REVENUE GROWTH AND PROFITABILITY OBJECTIVES OF YOUR BUSINESS UNIT, WHILE GUARANTEEING CLIENT SATISFACTION.\nWHO ARE YOU?YOU HAVE AT LEAST A BACHELOR’S DEGREE IN ENGINEERING OR IN BUSINESS, WITH 3-5 YEARS OF EXPERIENCE IN EITHER SALES OR CLIENT ACCOUNT MANAGEMENT EXPERIENCE.\nYOU HAVE A KEEN INTEREST IN VARIOUS INDUSTRIAL SECTORS AND THEIR CHALLENGES. YOU LOVE TO HELP CUSTOMERS SOLVE THEIR CRITICAL PROBLEMS WITH OUR PROJECT MANAGEMENT SERVICES AND SOLUTIONS. IDEALLY, YOU HAVE ALREADY HAD THE OPPORTUNITY TO DISCOVER PROJECT MANAGEMENT OVER THE COURSE OF YOUR PAST EXPERIENCES, BUT WE ARE WILLING TO INVEST IN YOU TO QUICKLY DEVELOP YOUR KNOWLEDGE OF OUR SERVICES AND SOLUTIONS AND THE VALUE BENEFITS THOSE SERVICES BRING TO OUR CUSTOMERS.\nYOU ARE BUSINESS-MINDED AND RESULTS-ORIENTED. YOUR SUCCESS IN THIS POSITION RELIES ON YOUR SELF-DISCIPLINE, CONSISTENCY, AND YOUR DESIRE TO LEAD AND UNITE MULTIDISCIPLINARY TEAMS. YOUR ABILITY TO BUILD AND MAINTAIN IMPACTFUL RELATIONSHIPS INTERNALLY AND WITH CLIENTS IS CRITICAL TO YOUR SUCCESS.\nOUR PROMISEBY JOINING OUR COMPANY AS A BUSINESS MANAGER, YOU WILL BE ABLE TAKE ADVANTAGE OF MENTORSHIP, TRAINING AND DEVELOPMENT PROVIDED BY YOUR HUB LEADERSHIP AND A GLOBAL COMMUNITY OF BUSINESS MANAGERS HERE TO SUPPORT YOUR GOALS AND PROGRESSION. WE WILL TAILOR YOUR ONBOARDING AND CONTINUED SUPPORT FOR YOU IN ALL ASPECTS OF YOUR SKILL DEVELOPMENT—MANAGEMENT AND LEADERSHIP, RECRUITMENT, TECHNICAL KNOWLEDGE, OR SALES TACTICS AND STRATEGIES. YOUR METRICS ARE CLEARLY DEFINED FROM THE BEGINNING, AND YOU WILL HAVE VISIBILITY TO YOUR PROGRESS IN ALIGNMENT TO THOSE METRICS. WE OFFER A GENEROUS INCENTIVE REWARD PACKAGE BASED ON THE ACHIEVEMENT OF YOUR RESULTS AGAINST SET TARGETS ON A QUARTERLY BASIS.\nTODAY, WE ARE RECRUITING OUR LEADERS OF TOMORROW!✨\nCOMPENSATION:MIGSO | PCUBED BELIEVES IN FAIR AND EQUITABLE COMPENSATION. THE REASONABLE ESTIMATE OF THE CURRENT TOTAL COMPENSATORY SALARY RANGE FOR THIS ROLE IS $90,000 - $120,000 DOE ANNUALLY FOR SAN FRANCISCO. IN ADDITION TO BASE SALARY, EMPLOYEES WILL PARTICIPATE IN AN ANNUAL PERFORMANCE-BASED INCENTIVE PROGRAM. THE WAGE RANGE FOR THIS ROLE TAKES INTO ACCOUNT THE WIDE RANGE OF FACTORS THAT ARE CONSIDERED IN MAKING COMPENSATION DECISIONS INCLUDING BUT NOT LIMITED TO SKILL SETS; EXPERIENCE AND TRAINING; CERTIFICATIONS; AND OTHER BUSINESS AND ORGANIZATIONAL NEEDS. BENEFITS AND PERKS:COMPREHENSIVE CONTRIBUTIONS TO MEDICAL, DENTAL, AND VISION FOR COLLEAGUES AND DEPENDENTSNOTABLE PTO AND PAID HOLIDAYS401K WITH COMPANY MATCHPROFESSIONAL DEVELOPMENT OPPORTUNITIESFLEXIBLE, HYBRID WORKING SCHEDULE EQUAL OPPORTUNITY STATEMENTMIGSO | PCUBED RECOGNIZES THE CIVIL RIGHT OF EVERY PERSON TO OBTAIN AND MAINTAIN EMPLOYMENT WITHOUT DISCRIMINATION. WE HAVE A LONGSTANDING POLICY THAT NO INDIVIDUAL MAY BE REFUSED A JOB, DISCHARGED, OR DISCRIMINATED AGAINST IN ANY WAY DUE TO ANY PROTECTED CHARACTERISTICS ESTABLISHED BY LOCAL, STATE AND FEDERAL LAW. IN ALL RESPECTS, MIGSO | PCUBED IS COMMITTED TO A POLICY OF FULL AND FAIR EQUAL EMPLOYMENT UNDER THE LAW AND APPLIES THIS IN ALL EMPLOYMENT DECISIONS, INCLUDING RECRUITMENT, HIRING, COMPENSATION, ENGAGEMENT STAFFING, TRAINING, PROMOTION, TRANSFER, AND TERMINATION.",
    "job_skill_set": [
      "business development",
      "project management",
      "client account management",
      "sales tactics",
      "recruitment",
      "profit management",
      "business degree",
      "leadership",
      "relationship building",
      "self-discipline",
      "team management",
      "coaching",
      "results-oriented",
      "communication",
      "problem solving",
      "engineering"
    ],
    "short_keywords": [
      "account",
      "building",
      "business",
      "businessdevelopment",
      "client",
      "coaching",
      "communication",
      "degree",
      "development",
      "engineering",
      "leadership",
      "management",
      "manager",
      "problem",
      "profit",
      "project",
      "recruitment",
      "relationship",
      "resultsoriented",
      "sales",
      "selfdiscipline",
      "solving",
      "tactics",
      "team"
    ]
  },
  {
    "job_id": "3898162140",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "MUST-HAVES * BACHELOR'S DEGREE  * EXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLS  * 3+ YEARS B2B SALES, COLD CALLING, LEAD GENERATION, AND PROSPECTING  * ABLE TO MANAGE MULTIPLE PROJECTS OR ACCOUNTS SIMULTANEOUSLY  * SALES MINDED, DRIVEN, AND COMPETITIVE PERSONALITY \nPLUSSES * EXPERIENCE LEVERAGING CRM TOOLS, SALESFORCE.COM PREFERRED  * PROFICIENT LEVEL AT MICROSOFT SUITE (WORD, POWERPOINT, OUTLOOK), HIGH PROFICIENCY IN EXCEL \nDAY-TO-DAY INSIGHT GLOBAL'S CLIENT IS SEEKING BUSINESS DEVELOPMENT REPRESENTATIVES TO WORK 5 DAYS ONSITE IN THE BUCKHEAD AREA FOR A DIRECT HIRE OPPORTUNITY. OUR CLIENT IS A LEAD GENERATION, DATA SOLUTIONS, AND DIRECT MARKETING FIRM FOR THE FINANCIAL SERVICES INDUSTRY. AS A BUSINESS DEVELOPMENT REPRESENTATIVE, YOU WILL FOCUS ON BRINGING IN NEW BUSINESS THROUGH COLD CALLING, LEAD GENERATION, AND PROSPECTING; AND WORK CLOSELY WITH ACCOUNT MANAGERS TO CLOSE NEW CLIENTS. THE EXPECTATION IS THAT THIS ROLE GRADUATES TO A FULL ACCOUNT MANAGER WITHIN THE FIRST YEAR AFTER STARTING BASED ON PERFORMANCE. THIS POSITION IS IDEAL FOR SOMEONE WHO THRIVES IN A PROFESSIONAL YET FUN, COMPETITIVE, AND HIGHLY COLLABORATIVE TEAM ENVIRONMENT.   PRINCIPAL DUTIES AND RESPONSIBILITIES  * INITIATE CUSTOMER CONTACT USING VARIOUS METHODS OF COMMUNICATION INCLUDING LINKEDIN, MINTEL, AND OUR SALESFORCE  * COMPLETE INTRODUCTIONS (COLD CALLS), FOLLOW-UPS, DEMONSTRATION CALLS, INTRODUCTION EMAILS, FOLLOW-UP EMAILS, AND DATA AND MARKETING STRATEGY SESSIONS.  * WORK WITH ACCOUNT MANAGERS TO DISCUSS AND CLOSE THE BUSINESS YOU BRING IN.  * PLAN AND ORGANIZE PERSONAL SALES STRATEGIES INCLUDING DAILY/WEEKLY/MONTHLY SCHEDULE.  * MAINTAIN PRODUCT AND INDUSTRY EXPERTISE, INCLUDING NEW PRODUCT OFFERINGS, MARKET CONDITIONS, AND INDUSTRY TRENDS.  * PROACTIVELY MANAGE PIPELINE AND OPPORTUNITIES IN SALESFORCE.COM TO MEET AND/OR EXCEED QUOTA AND ACCOUNT PROGRESS UTILIZING SALESFORCE.COM.  * EFFECTIVELY FORECAST BUSINESS ON A MONTHLY AND QUARTERLY BASIS.",
    "job_skill_set": [
      "B2B Sales",
      "Cold Calling",
      "Lead Generation",
      "Prospecting",
      "Salesforce.com",
      "Microsoft Suite",
      "Excel",
      "Communication",
      "Project Management",
      "Sales Minded",
      "Collaboration",
      "Organizational Skills",
      "CRM Tools",
      "Competitive Personality",
      "Forecasting"
    ],
    "short_keywords": [
      "b2b",
      "business",
      "businessdevelopment",
      "calling",
      "cold",
      "collaboration",
      "communication",
      "competitive",
      "crm",
      "development",
      "excel",
      "forecasting",
      "generation",
      "lead",
      "management",
      "microsoft",
      "minded",
      "organizational",
      "personality",
      "project",
      "prospecting",
      "representative",
      "sales",
      "salesforcecom",
      "skills",
      "suite",
      "tools"
    ]
  },
  {
    "job_id": "3885866733",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "INDUSTRY | SERVICES - BUSINESS SERVICESLOCATION | ALEXANDRIA, VASALARY | $65,000FIRST YEAR POTENTIAL | $90,000BENEFITS | HEALTH, 401KREFERENCE | 008346\nJOB SUMMARYINTERNATIONAL ASSOCIATION IS EXPANDING ITS PROFESSIONAL SALES FORCE. THIS IS AN AMAZING OPPORTUNITY TO GET INTO THE COMPANY AND GROW WITH THEM. THIS ROLE WILL FOCUS SOLELY ON CURRENT ACCOUNT SALES AND TRAINING WITH THE INTENTION OF THE NEW HIRE BEING TRAINED TO BE THE SPECIALIST. CANDIDATES MUST HAVE 2 OR MORE YEARS OF SABLE, CONSULTATIVE B2B SERVICE SALES OR A CORPORATE TRAINER WHO WOULD LIKE TO MAKE MORE MONEY AND MOVE TO THE SALES SIDE IS IDEAL. OR A TEACHER WHO WOULD RATHER SELL. MUST POSSESS EMPATHY AND COMPASSION ALONG WITH INNER SALES DRIVE AND MOTIVATION. BASE SALARY OF $60K - $70K WITH TOTAL EARNINGS OF $75K - $100K IN THE FIRST YEAR. MONEY WILL GROW 2ND YEAR. THEY OFFER AN INCREDIBLE BENEFIT PLAN. OPPORTUNITY IS HYBRID-GOING INTO A NORTHERN VA OFFICE 2 TIMES PER WEEK. APPLY TODAY! EMAIL YOUR RESUME TO INFO@PORTERGROUP.COM",
    "job_skill_set": [
      "B2B Sales",
      "Consultative Selling",
      "Account Management",
      "Empathy",
      "Motivation",
      "Communication",
      "Teamwork",
      "Adaptability",
      "Problem Solving",
      "Sales Training"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "b2b",
      "business",
      "businessdevelopment",
      "communication",
      "consultative",
      "development",
      "empathy",
      "management",
      "motivation",
      "problem",
      "representative",
      "sales",
      "selling",
      "solving",
      "teamwork",
      "training"
    ]
  },
  {
    "job_id": "3904422441",
    "job_title": "Associate, Corporate Business Development",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "COMPANY DESCRIPTION\n\nAT SERVICENOW, OUR TECHNOLOGY MAKES THE WORLD WORK FOR EVERYONE, AND OUR PEOPLE MAKE IT POSSIBLE. WE MOVE FAST BECAUSE THE WORLD CAN’T WAIT, AND WE INNOVATE IN WAYS NO ONE ELSE CAN FOR OUR CUSTOMERS AND COMMUNITIES. BY JOINING SERVICENOW, YOU ARE PART OF AN AMBITIOUS TEAM OF CHANGE MAKERS WHO HAVE A RESTLESS CURIOSITY AND A DRIVE FOR INGENUITY. WE KNOW THAT YOUR BEST WORK HAPPENS WHEN YOU LIVE YOUR BEST LIFE AND SHARE YOUR UNIQUE TALENTS, SO WE DO EVERYTHING WE CAN TO MAKE THAT POSSIBLE. WE DREAM BIG TOGETHER, SUPPORTING EACH OTHER TO MAKE OUR INDIVIDUAL AND COLLECTIVE DREAMS COME TRUE. THE FUTURE IS OURS, AND IT STARTS WITH YOU.\n\nWITH MORE THAN 7,700+ CUSTOMERS, WE SERVE APPROXIMATELY 85% OF THE FORTUNE 500®, AND WE'RE PROUD TO BE ONE OF FORTUNE 100 BEST COMPANIES TO WORK FOR® AND WORLD'S MOST ADMIRED COMPANIES™.\n\nLEARN MORE ON LIFE AT NOW BLOG AND HEAR FROM OUR EMPLOYEES ABOUT THEIR EXPERIENCES WORKING AT SERVICENOW.\n\nUNSURE IF YOU MEET ALL THE QUALIFICATIONS OF A JOB DESCRIPTION BUT ARE DEEPLY EXCITED ABOUT THE ROLE? WE STILL ENCOURAGE YOU TO APPLY! AT SERVICENOW, WE ARE COMMITTED TO CREATING AN INCLUSIVE ENVIRONMENT WHERE ALL VOICES ARE HEARD, VALUED, AND RESPECTED. WE WELCOME ALL CANDIDATES, INCLUDING INDIVIDUALS FROM NON-TRADITIONAL, VARIED BACKGROUNDS, THAT MIGHT NOT COME FROM A TYPICAL PATH CONNECTED TO THIS ROLE. WE BELIEVE SKILLS AND EXPERIENCE ARE TRANSFERRABLE, AND THE DESIRE TO DREAM BIG MAKES FOR GREAT CANDIDATES.\n\nJOB DESCRIPTION\n\nAS AN ASSOCIATE ON THE CORPORATE BUSINESS DEVELOPMENT TEAM, THIS ROLE WILL SUPPORT THE EARLY STAGES OF THE ACQUISITION, PARTNERSHIP, AND INVESTMENT LIFECYCLE, INCLUDING EARLY EVALUATION, DILIGENCE, EXECUTION, AND MONITORING. REPORTING TO THE DIRECTOR OF CORPORATE BUSINESS DEVELOPMENT, THIS ROLE WILL REQUIRE YOU TO WORK CLOSELY WITH BUSINESS LEADERS IN PRODUCT, ENGINEERING, SALES, AND FINANCE.\n\nYOU WILL BE EXPECTED TO BE A KEY INDIVIDUAL CONTRIBUTOR ON OUR CORPORATE BUSINESS DEVELOPMENT TEAM. YOU WILL BUILD THOUGHTFUL FINANCIAL MODELS, PERFORM MARKET RESEARCH AND ANALYSIS, ENGAGE WITH EXTERNAL MARKET PARTICIPANTS, AND CREATE KEY DELIVERABLES THAT SHAPE OUR VIEWS ON THE DIRECTION OF THE COMPANY. YOU ARE EXPECTED TO BE ABLE TO COLLABORATE AND COMMUNICATE ACROSS CROSS-FUNCTIONAL TEAMS TO ENSURE DEAL SUCCESS.\n\nPREFERRED CANDIDATES WILL HAVE 1-3 YEARS OF PROFESSIONAL WORK EXPERIENCE IN A MIX OF INVESTMENT BANKING, GROWTH EQUITY, PRIVATE EQUITY, AND/OR CORPORATE DEVELOPMENT ROLES WITH PRIOR DEAL EXECUTION EXPERIENCE IN ENTERPRISE SOFTWARE OR TECHNOLOGY SECTORS.\n\nWHAT YOU GET TO DO IN THIS ROLE\n\nBUILD RELATIONSHIPS AND COLLABORATE WITHIN CORPORATE DEVELOPMENT AS WELL AS KEY INTERNAL BUSINESS, PRODUCT, SALES/GTM, AND ENGINEERING STAKEHOLDERS ACROSS SERVICENOW ON M&A AND VENTURE INVESTMENT DISCUSSIONSWORK WITH DEAL AND FUNCTIONAL TEAMS IN ALL ASPECTS OF THE TRANSACTION LIFECYCLE, INCLUDING EARLY OPPORTUNITY EVALUATION, BUSINESS MODEL PLANNING, STRATEGY PLANNING, BUSINESS CASE DEVELOPMENT, DUE DILIGENCE, AND EXECUTIONOWN THE DEVELOPMENT OF DETAILED FINANCIAL ANALYSIS TO SUPPORT AND GUIDE THINKING ON M&A AND VENTURE INVESTMENT OPPORTUNITIES, INCLUDING ORIGINATION OF KEY ANALYSES IN COLLABORATION WITH FINANCE STAKEHOLDERS TO EVALUATE TARGET AND PRO FORMA FINANCIAL IMPACTBE THE “GO TO” INDIVIDUAL ON ALL ASPECTS OF BUSINESS VALUATION, FINANCIAL AND M&A TRANSACTION MODELINGRESEARCH STRATEGIC MARKETS, IDENTIFY AND KEEP ABREAST OF TRENDS, AND TRANSLATE FINDINGS INTO ACTIONABLE INSIGHTSASSIST IN BUILDING AND DEVELOPING NETWORK OF RELATIONSHIPS WITH ENTREPRENEURS, VENTURE / PRIVATE EQUITY INVESTORS, BANKERS, AND OTHERS TO ACTIVELY MAINTAIN UNIQUE INSIGHTS INTO THE MARKETDEVELOP AN EXTERNALLY-ORIENTED VIEWPOINT ON RELEVANT MARKET SEGMENTS, INCLUDING VIA PARTICIPATION IN CONFERENCES, TRADE SHOWS, AND SOURCING EFFORTS, AND SHARE INSIGHTS INTERNALLY WITH SERVICENOW BUSINESS UNITS\n\nQUALIFICATIONS\n\nIN ORDER TO BE SUCCESSFUL IN THIS ROLE, WE NEED SOMEONE WHO HAS:\n\nMINIMUM 2 YEARS OF PROFESSIONAL TECHNOLOGY INDUSTRY WORK EXPERIENCE IN A MIX OF INVESTMENT BANKING, GROWTH EQUITY, PRIVATE EQUITY, AND/OR CORPORATE DEVELOPMENT ROLESSTRONG UNDERSTANDING AND PASSION FOR THE SOFTWARE / SAAS DOMAIN INCLUDING UNDERSTANDING OF KEY BUSINESS DRIVERS AND PERFORMANCE INDICATORS (E.G. ACV / TCV, SUBSCRIPTION BILLINGS, EXPANSION RATES, SALES HEADCOUNT PRODUCTIVITY)STRONG UNDERSTANDING AND FAMILIARITY WITH FUNDAMENTAL BUSINESS MODELS AND VALUATION METHODOLOGIES (UNIT ECONOMICS, MULTIPLES-BASED APPROACHES, DCF) AND M&A MODELING (THREE-STATEMENT MODELS, ACCRETION / DILUTION, BREAKEVEN SYNERGIES, DEAL FINANCING STRUCTURES, ETC.)STRONG PRESENTATION AND NEGOTIATION SKILLS FOR INTERNAL AUDIENCES (INCLUDING BUSINESS UNIT EXECUTIVES) AND EXTERNAL INTERACTIONS; ABILITY TO ADAPT PRESENTATIONS FOR BIG PICTURE AND IN-DEPTH DISCUSSIONSEXCELLENT ANALYTICAL / FINANCIAL SKILLS AND COMMUNICATION SKILLSENTREPRENEURIAL SELF-STARTER WHO ENJOYS WORKING IN A FAST-PACED, INNOVATIVE HIGH-GROWTH ENVIRONMENT\n\nEDUCATION\n\nBACHELOR’S DEGREE WITH STRONG TRACK RECORD OF ACADEMIC PERFORMANCE\n\nFOR POSITIONS IN THE BAY AREA, WE OFFER A BASE PAY OF $85,500 - 132,500, PLUS EQUITY (WHEN APPLICABLE), VARIABLE/INCENTIVE COMPENSATION AND BENEFITS. SALES POSITIONS GENERALLY OFFER A COMPETITIVE ON TARGET EARNINGS (OTE) INCENTIVE COMPENSATION STRUCTURE. PLEASE NOTE THAT THE BASE PAY SHOWN IS A GUIDELINE, AND INDIVIDUAL TOTAL COMPENSATION WILL VARY BASED ON FACTORS SUCH AS QUALIFICATIONS, SKILL LEVEL, COMPETENCIES AND WORK LOCATION. WE ALSO OFFER HEALTH PLANS, INCLUDING FLEXIBLE SPENDING ACCOUNTS, A 401(K) PLAN WITH COMPANY MATCH, ESPP, MATCHING DONATIONS, A FLEXIBLE TIME AWAY PLAN AND FAMILY LEAVE PROGRAMS (SUBJECT TO ELIGIBILITY REQUIREMENTS). COMPENSATION IS BASED ON THE GEOGRAPHIC LOCATION IN WHICH THE ROLE IS LOCATED, AND IS SUBJECT TO CHANGE BASED ON WORK LOCATION.\n\nADDITIONAL INFORMATION\n\nSERVICENOW IS AN EQUAL EMPLOYMENT OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, CREED, RELIGION, SEX, SEXUAL ORIENTATION, NATIONAL ORIGIN OR NATIONALITY, ANCESTRY, AGE, DISABILITY, GENDER IDENTITY OR EXPRESSION, MARITAL STATUS, VETERAN STATUS OR ANY OTHER CATEGORY PROTECTED BY LAW.\n\nAT SERVICENOW, WE LEAD WITH FLEXIBILITY AND TRUST IN OUR DISTRIBUTED WORLD OF WORK. CLICK HERE TO LEARN ABOUT OUR WORK PERSONAS: FLEXIBLE, REMOTE AND REQUIRED-IN-OFFICE.\n\nIF YOU REQUIRE A REASONABLE ACCOMMODATION TO COMPLETE ANY PART OF THE APPLICATION PROCESS, OR ARE LIMITED IN THE ABILITY OR UNABLE TO ACCESS OR USE THIS ONLINE APPLICATION PROCESS AND NEED AN ALTERNATIVE METHOD FOR APPLYING, YOU MAY CONTACT US AT TALENT.ACQUISITION@SERVICENOW.COM FOR ASSISTANCE.\n\nFOR POSITIONS REQUIRING ACCESS TO TECHNICAL DATA SUBJECT TO EXPORT CONTROL REGULATIONS, INCLUDING EXPORT ADMINISTRATION REGULATIONS (EAR), SERVICENOW MAY HAVE TO OBTAIN EXPORT LICENSING APPROVAL FROM THE U.S. GOVERNMENT FOR CERTAIN INDIVIDUALS. ALL EMPLOYMENT IS CONTINGENT UPON SERVICENOW OBTAINING ANY EXPORT LICENSE OR OTHER APPROVAL THAT MAY BE REQUIRED BY THE U.S. GOVERNMENT.\n\nPLEASE NOTE: FRAUDULENT JOB POSTINGS/JOB SCAMS ARE INCREASINGLY COMMON. CLICK HERE TO LEARN WHAT TO WATCH OUT FOR AND HOW TO PROTECT YOURSELF. ALL GENUINE SERVICENOW JOB POSTINGS CAN BE FOUND THROUGH THE SERVICENOW CAREERS SITE.\n\nFROM FORTUNE. © 2022 FORTUNE MEDIA IP LIMITED ALL RIGHTS RESERVED. USED UNDER LICENSE.\n\nFORTUNE AND FORTUNE MEDIA IP LIMITED ARE NOT AFFILIATED WITH, AND DO NOT ENDORSE PRODUCTS OR SERVICES OF, SERVICENOW.",
    "job_skill_set": [
      "market research",
      "analytical skills",
      "negotiation skills",
      "presentation skills",
      "SaaS knowledge",
      "collaboration",
      "communication",
      "entrepreneurial mindset",
      "adaptability",
      "relationship building",
      "problem solving",
      "financial modeling",
      "business valuation",
      "M&A modeling",
      "business case development",
      "due diligence"
    ],
    "short_keywords": [
      "adaptability",
      "analytical",
      "associate",
      "building",
      "business",
      "businessdevelopment",
      "case",
      "collaboration",
      "communication",
      "corporate",
      "development",
      "diligence",
      "due",
      "entrepreneurial",
      "financial",
      "knowledge",
      "ma",
      "market",
      "mindset",
      "modeling",
      "negotiation",
      "presentation",
      "problem",
      "relationship",
      "research",
      "saas",
      "skills",
      "solving",
      "valuation"
    ]
  },
  {
    "job_id": "3903472568",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "✨YOUR NEXT “INTRAPRENEUR” CHALLENGE IS JUST ONE CLICK AWAY! THIS IS NOT YOUR AVERAGE SALES JOB -- INSTEAD, THIS IS A LEADERSHIP POSITION THAT IS IN THE FOREFRONT OF MIGSO-PCUBED'S ORGANIZATIONAL GROWTH.OUR NEW YORK CITY HUB, IS LOOKING FOR A BUSINESS MANAGER TO KEEP PACE WITH THE RAPID EXPANSION OF THE MARKET. THIS IS YOUR OPPORTUNITY TO JOIN THE LARGEST GLOBAL CONSULTING COMPANY THAT SPECIALIZES IN PROGRAM PROJECT MANAGEMENT SERVICES AND SOLUTIONS, WHERE YOU WILL HAVE THE CHANCE TO GROW AND MANAGE NEW CLIENT ACCOUNTS, BUILD YOUR TEAM, AND MANAGE YOUR PROFIT CENTER.\nYOUR NEXT CHALLENGEYOUR GOAL IS TO DEVELOP AND EXPAND OUR BUSINESS AND YOUR NETWORK WHILE FOSTERING RELATIONSHIPS WITH CLIENTS, CANDIDATES, AND CONSULTANTS ACROSS DIFFERENT INDUSTRIES.\nBUSINESS MANAGERS TAKE OWNERSHIP OF THREE ESSENTIAL ELEMENTS OF THE ORGANIZATION:BUSINESS DEVELOPMENT: MAINTAINING A BUSINESS DEVELOPMENT ‘DRUMBEAT’ IS CRITICAL. BUSINESS MANAGERS ARE RESPONSIBLE FOR BUILDING THEIR TARGET COMPANY PORTFOLIO, IDENTIFYING GROWTH OPPORTUNITIES WITHIN THEIR BUSINESS UNIT, MANAGE THE SCOPE OF ACTIVITY BY BUILDING RELATIONSHIPS WITH KEY ACCOUNT CUSTOMERS, AND SELL EXPERT-LEVEL PROJECT MANAGEMENT SERVICES.MANAGEMENT AND RECRUITMENT: OUR PEOPLE ARE OUR CORE COMPETENCY. YOU WILL PARTNER WITH OUR TALENT ACQUISITION TEAM TO INTERVIEW AND HIRE THE RIGHT CANDIDATES TO SUPPORT AND DEVELOP YOUR HUB’S CONSULTANT TEAM. THEN, AS A MANAGER AND LEADER OF YOUR TEAM, YOU HELP TO IDENTIFY GROWTH AREAS AND EMPOWER YOUR TEAM TO REACH THEIR POTENTIAL THROUGHOUT THEIR CAREER (COACHING, CAREER PATH DEVELOPMENT, ETC.).PROFIT CENTER MANAGEMENT: ENSURE PROJECT SUCCESS IN PARTNERSHIP WITH YOUR CONSULTANTS, DELIVERY MANAGERS, AND CLIENTS. MANAGE REVENUE GROWTH AND PROFITABILITY OBJECTIVES OF YOUR BUSINESS UNIT, WHILE GUARANTEEING CLIENT SATISFACTION.\nWHO ARE YOU?YOU HAVE AT LEAST A BACHELOR’S DEGREE IN ENGINEERING OR IN BUSINESS, WITH 3-5 YEARS OF EXPERIENCE IN EITHER SALES OR CLIENT ACCOUNT MANAGEMENT EXPERIENCE.\nYOU HAVE A KEEN INTEREST IN VARIOUS INDUSTRIAL SECTORS AND THEIR CHALLENGES. YOU LOVE TO HELP CUSTOMERS SOLVE THEIR CRITICAL PROBLEMS WITH OUR PROJECT MANAGEMENT SERVICES AND SOLUTIONS. IDEALLY, YOU HAVE ALREADY HAD THE OPPORTUNITY TO DISCOVER PROJECT MANAGEMENT OVER THE COURSE OF YOUR PAST EXPERIENCES, BUT WE ARE WILLING TO INVEST IN YOU TO QUICKLY DEVELOP YOUR KNOWLEDGE OF OUR SERVICES AND SOLUTIONS AND THE VALUE BENEFITS THOSE SERVICES BRING TO OUR CUSTOMERS.\nYOU ARE BUSINESS-MINDED AND RESULTS-ORIENTED. YOUR SUCCESS IN THIS POSITION RELIES ON YOUR SELF-DISCIPLINE, CONSISTENCY, AND YOUR DESIRE TO LEAD AND UNITE MULTIDISCIPLINARY TEAMS. YOUR ABILITY TO BUILD AND MAINTAIN IMPACTFUL RELATIONSHIPS INTERNALLY AND WITH CLIENTS IS CRITICAL TO YOUR SUCCESS.\nOUR PROMISEBY JOINING OUR COMPANY AS A BUSINESS MANAGER, YOU WILL BE ABLE TAKE ADVANTAGE OF MENTORSHIP, TRAINING AND DEVELOPMENT PROVIDED BY YOUR HUB LEADERSHIP AND A GLOBAL COMMUNITY OF BUSINESS MANAGERS HERE TO SUPPORT YOUR GOALS AND PROGRESSION. WE WILL TAILOR YOUR ONBOARDING AND CONTINUED SUPPORT FOR YOU IN ALL ASPECTS OF YOUR SKILL DEVELOPMENT—MANAGEMENT AND LEADERSHIP, RECRUITMENT, TECHNICAL KNOWLEDGE, OR SALES TACTICS AND STRATEGIES. YOUR METRICS ARE CLEARLY DEFINED FROM THE BEGINNING, AND YOU WILL HAVE VISIBILITY TO YOUR PROGRESS IN ALIGNMENT TO THOSE METRICS. WE OFFER A GENEROUS INCENTIVE REWARD PACKAGE BASED ON THE ACHIEVEMENT OF YOUR RESULTS AGAINST SET TARGETS ON A QUARTERLY BASIS.TODAY, WE ARE RECRUITING OUR LEADERS OF TOMORROW!✨\nCOMPENSATIONMIGSO-PCUBED BELIEVES IN FAIR AND EQUITABLE COMPENSATION. THE REASONABLE ESTIMATE OF THE CURRENT TOTAL COMPENSATORY SALARY RANGE FOR THIS ROLE IS $90,000 - $120,000 (DEPENDING ON EXPERIENCE) ANNUALLY FOR NEW YORK. IN ADDITION TO BASE SALARY, EMPLOYEES WILL PARTICIPATE IN AN ANNUAL PERFORMANCE-BASED INCENTIVE PROGRAM. THE WAGE RANGE FOR THIS ROLE TAKES INTO ACCOUNT THE WIDE RANGE OF FACTORS THAT ARE CONSIDERED IN MAKING COMPENSATION DECISIONS INCLUDING BUT NOT LIMITED TO SKILL SETS; EXPERIENCE AND TRAINING; CERTIFICATIONS; AND OTHER BUSINESS AND ORGANIZATIONAL NEEDS.\nBENEFITS AND PERKSMP OFFERS COMPREHENSIVE CONTRIBUTIONS TO MEDICAL, DENTAL, AND VISION FOR YOU AND YOUR DEPENDENTS. WE ALSO INCLUDE A NOTABLE PTO PLAN, PAID HOLIDAYS, A 401K WITH COMPANY MATCH, AND PROFESSIONAL DEVELOPMENT OPPORTUNITIES.\nEQUAL OPPORTUNITY STATEMENTMIGSO-PCUBED RECOGNIZES THE CIVIL RIGHT OF EVERY PERSON TO OBTAIN AND MAINTAIN EMPLOYMENT WITHOUT DISCRIMINATION. WE HAVE A LONGSTANDING POLICY THAT NO INDIVIDUAL MAY BE REFUSED A JOB, DISCHARGED, OR DISCRIMINATED AGAINST IN ANY WAY DUE TO ANY PROTECTED CHARACTERISTICS ESTABLISHED BY LOCAL, STATE AND FEDERAL LAW. IN ALL RESPECTS, MIGSO-PCUBED IS COMMITTED TO A POLICY OF FULL AND FAIR EQUAL EMPLOYMENT UNDER THE LAW AND APPLIES THIS IN ALL EMPLOYMENT DECISIONS, INCLUDING RECRUITMENT, HIRING, COMPENSATION, ENGAGEMENT STAFFING, TRAINING, PROMOTION, TRANSFER, AND TERMINATION.",
    "job_skill_set": [
      "business development",
      "client account management",
      "project management",
      "sales tactics",
      "recruitment",
      "profitability management",
      "team management",
      "engineering knowledge",
      "business knowledge",
      "leadership",
      "relationship building",
      "self-discipline",
      "consistency",
      "coaching",
      "communication",
      "problem solving",
      "results-oriented",
      "multidisciplinary teamwork"
    ],
    "short_keywords": [
      "account",
      "building",
      "business",
      "businessdevelopment",
      "client",
      "coaching",
      "communication",
      "consistency",
      "development",
      "engineering",
      "knowledge",
      "leadership",
      "management",
      "manager",
      "multidisciplinary",
      "problem",
      "profitability",
      "project",
      "recruitment",
      "relationship",
      "resultsoriented",
      "sales",
      "selfdiscipline",
      "solving",
      "tactics",
      "team",
      "teamwork"
    ]
  },
  {
    "job_id": "3886450556",
    "job_title": "Business Development Manager - Automotive F&I",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "LIVING OUR VALUES \n\nALL ASSOCIATES ARE GUIDED BY OUR VALUES. OUR VALUES ARE THE UNIFYING FOUNDATION OF OUR COMPANIES. WE STRIVE TO ENSURE THAT EVERY DECISION WE MAKE AND EVERY ACTION WE TAKE DEMONSTRATES OUR VALUES. WE BELIEVE THAT PUTTING OUR VALUES INTO PRACTICE CREATES LASTING BENEFITS FOR ALL OF OUR ASSOCIATES, SHAREHOLDERS, AND THE COMMUNITIES IN WHICH WE LIVE.\n\nJOB SUMMARY\n\nTHE BUSINESS DEVELOPMENT MANAGER (BDM), UNDER THE LEADERSHIP OF THE DIRECTOR, TRAINING & DEVELOPMENT WILL MANAGE AND DEVELOP THE FINANCE AND INSURANCE INCOME ACTIVITY AND RESULTS FOR A DEFINED GROUP OF DEALERSHIPS IN THE NATIONAL SALES DIVISION. THE BDM WILL BE RESPONSIBLE FOR IMPROVING THE PRODUCT AND SERVICES MARKET PENETRATION IN THE CLIENT BASE, IDENTIFYING OPPORTUNITIES TO IMPROVE VOLUME, PRODUCT PRODUCTION INDEX, UNITS UNDER MANAGEMENT, VSA PENETRATIONS, DEALERSHIP FINANCE AND INSURANCE DEPARTMENT PROFITABILITY, AS WELL AS INTRODUCE AND MANAGE NEW AND EXISTING PROGRAMS TO THE CLIENT BASE. THE BDM WILL FOCUS THEIR INCOME DEVELOPMENT EFFORTS TO DELIVER THREE PRIMARY AND MEASURABLE RESULTS: DRIVE THE F&I AND SALES PROCESSES THAT RESULT IN ADDITIONAL VEHICLE DELIVERIES. MANAGE THE DEVELOPMENT ACTIVITY TO CREATE CUSTOMER LOYALTY WITHIN THE DEALERSHIP BASE, PROVIDE ONGOING PROGRAMS, PRODUCTS, SKILLS AND SERVICES WHICH MAKE OUR DEALERS AND GSFS THE MOST PROFITABLE IN THE AUTOMOTIVE INDUSTRY.\n\nESSENTIAL FUNCTIONS\n\nORGANIZE AND SCHEDULE DEALERSHIP VISITS TO DRIVE PRODUCTION, DEVELOPMENT, AND SALES THROUGH IN-STORE SKILLS MODELING AND INCOME DEVELOPMENT; HELP DRIVE PRODUCTION AND DEALER COMMITMENT TO TRITON PRODUCTS. VISITS WILL INCLUDE MEETINGS WITH F&I DEPARTMENT, SERVICE DEPARTMENT, SALES DEPARTMENT, ACCOUNTING DEPARTMENT AND DEALER EXECUTIVE LEADERSHIP.ASSISTING DEALER MANAGEMENT IN SETTING STANDARDS FOR SALES SKILLS AND HOLDING DEALERSHIP PERSONNEL ACCOUNTABLE FOR BEHAVIORAL PERFORMANCE STANDARDS.A WRITTEN SUMMARY/RECAP EMAIL WILL BE SENT TO DEALERSHIP MANAGEMENT TEAM, GSFS DIRECTOR AND TRITON MANAGEMENT AFTER EACH DEALERSHIP VISIT. AS REQUESTED, F&I PERSONNEL RECRUITING/INTERVIEW ASSISTANCE. ACCESS TO THE DEALER'S REPORTING TOOL IN ORDER TO ASSESS DEALERSHIP PERFORMANCE.ATTENDANCE AT IDENTIFIED TRITON MEETINGS, INCLUDING BUT NOT LIMITED TO, REGULARLY SCHEDULE STAFF MEETINGS, QUARTERLY UPDATE SESSIONS AND ANNUAL MEETINGS.COORDINATION WITH GSFS' TRAINING & DEVELOPMENT TEAM FOR INCREMENTAL DEALERSHIP TRAINING IN MARKET.ANALYZE AND REPORT MONTHLY AND QUARTERLY SKILLS AND METRICS OBJECTIVES FOR EACH DEALERSHIP ON A TIMELY BASIS.BUILD LOYALTY AMONG OUR CUSTOMER BASE BY ASSISTING THEIR EFFORTS TO DEVELOP SOLUTIONS THAT WILL IMPROVE SALES PRODUCTIVITY, VOLUME AND PROFITABILITY.DETERMINE ACCOUNT NEEDS AND ARTICULATE TO COMMUNICATION TO ALL STAKEHOLDERS: TRITON NATIONAL MANAGEMENT, DEALER GROUP LEADERSHIP AND DIRECTOR, GSFSGROUP TRAINING & DEVELOPMENT.COMMUNICATE SUGGESTIONS FOR A 90-DAY DEVELOPMENT PLAN WITH GSFSGROUP RESOURCES.MODEL AND DEMONSTRATE GSFSGROUP SALES AND F&I PROCESS SKILLS IN THE RETAIL ENVIRONMENT.CREATE THE WILL TO GROW IN BOTH INEXPERIENCED AND SEASONED DEALERSHIP PERSONNEL.LEARN, TRAIN AND MANAGE SPECIFIC F&I MENUS AND PERFORMANCE REPORTING PLATFORMS.LEARN, APPLY AND MAINTAIN LEGAL AND ETHICAL AUTOMOTIVE COMPLIANCE. OTHER DUTIES AS ASSIGNED.\n\nQUALIFICATIONS\n\nBACHELOR'S DEGREE FROM FOUR-YEAR COLLEGE OR UNIVERSITY; PLUS 5-8 YEARS RELATED EXPERIENCE AND/OR TRAINING; OR EQUIVALENT COMBINATION OF EDUCATION AND EXPERIENCE. PREFERRED EXPERIENCE WILL INCLUDE 3 - 5 YEARS OF INCOME DEVELOPMENT ACTIVITY ON THE PROVIDER LEVEL FOR MULTIPLE DEALERSHIPS AS WELL AS 5 - 8 YEARS OF RETAIL F&I, AND /OR GSM/GM EXPERIENCE.\n\nCUSTOMERS\n\nEXCEED EXPECTATIONS AS IT RELATES TO EXPANDING THE MARKET SHARE FOR ASSIGNED DEALERS AND GSFSGROUP. CONSTANTLY EVALUATE AND IMPROVE THE LEVEL OF SATISFACTION PROVIDED TO THE CLIENT ON BEHALF OF OUR COMPANY.\n\nLEADERSHIP\n\nDISPLAY VISION AS IT RELATES TO INCREASED PRODUCT SALES, WORLD-CLASS SERVICE, EFFECTIVE NEGOTIATING SKILLS, AND ORGANIC GROWTH. ACCEPT THE COMPANY CHALLENGE TO TAKE PERSONAL ACCOUNTABILITY FOR THE RESULTS.DISPLAY THE COURAGE TO ADMIT A MISTAKE, DISAGREE FOR THE RIGHT REASONS, AND ACCEPT COMPROMISE WHEN IT IS IN THE BEST INTEREST OF THE GROUP.EFFECTIVENESS OF COMMUNICATION AND TEAM BUILDING.\n\nCERTIFICATES, LICENSES, REGISTRATIONS*\n\nVALID DRIVER'S LICENSE. WILLING TO COMPLETE THE COURSES AND PASS EXAMS REQUIRED BY SPECIFIC STATES NEEDED TO OBTAIN APPLICABLE LICENSE.\n\nPHYSICAL REQUIREMENTS\n\nTHE PHYSICAL REQUIREMENTS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY AN ASSOCIATE TO SUCCESSFULLY PERFORM THE ESSENTIAL FUNCTIONS OF THE JOB. WHILE PERFORMING THE DUTIES OF THE JOB, THE ASSOCIATE IS REQUIRED ON A DAILY BASIS TO ANALYZE AND INTERPRET DATA, COMMUNICATE, AND REMAIN IN A STATIONARY POSITION FOR A SIGNIFICANT AMOUNT OF THE WORK DAY; AND FREQUENTLY ACCESS, INPUT, AND RETRIEVE INFORMATION FROM THE COMPUTER AND OTHER OFFICE PRODUCTIVITY DEVICES. THE ASSOCIATE IS REGULARLY REQUIRED TO MOVE ABOUT THE OFFICE AND AROUND THE CORPORATE CAMPUS. THE ASSOCIATE IS FREQUENTLY REQUIRED TO TRAVEL TO OTHER SITES, INCLUDING OUT-OF-STATE, WHERE APPLICABLE, FOR BUSINESS PURPOSES. A LARGE AMOUNT OF THIS TRAVEL INVOLVES DRIVING A COMPANY VEHICLE. THE ASSOCIATE MUST FREQUENTLY MOVE UP TO 10 POUNDS AND OCCASIONALLY MOVE UP TO 25 POUNDS.\n\nWORK ENVIRONMENT\n\nTHE WORK ENVIRONMENT CHARACTERISTICS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE AN ASSOCIATE ENCOUNTERS WHILE PERFORMING THE ESSENTIAL FUNCTIONS OF THIS JOB. THE ASSOCIATE WILL REGULARLY BE EXPOSED TO WET AND/OR HUMID CONDITIONS, AREAS IN WHICH MOVING MECHANICAL PARTS, FUMES, TOXIC OR CAUSTIC CHEMICALS ARE PRESENT, AND OUTSIDE WEATHER CONDITIONS. THE NOISE LEVEL FOR THIS POSITION WILL VARY AND THE ASSOCIATE MAY BE EXPOSED TO LOUD NOISE LEVELS.\n\nTRAVEL REQUIRED\n\nTHE JOB REQUIRES SIGNIFICANT DOMESTIC TRAVEL (UP TO 80% OF THE TIME). AS A RESULT, THE DUTIES FOR THIS POSITION OCCUR IN VARIOUS PLACES INCLUDING, BUT NOT LIMITED TO AN OFFICE ENVIRONMENT, CAR DEALERSHIPS, AND SEMI-INDUSTRIAL SETTINGS.\n\nTHE FRIEDKIN GROUP AND ITS AFFILIATES ARE EQUAL OPPORTUNITY EMPLOYERS AND MAINTAIN DRUG-FREE WORKPLACES BY CONDUCTING PRE-EMPLOYMENT DRUG TESTING.\n\nTOTAL REWARDS\n\nOUR TOTAL REWARDS PACKAGE IS AN INTEGRAL PART OF HOW WE RECOGNIZE OUR ASSOCIATES’ CONTRIBUTIONS AS WELL AS ATTRACT, RETAIN AND REWARD THE MOST QUALIFIED EMPLOYEES. WE ARE COMMITTED TO PROVIDING A FAIR AND COMPETITIVE COMPENSATION STRUCTURE THAT INCLUDES BASE PAY AND PERFORMANCE BASED REWARDS, WHERE APPLICABLE. COMPENSATION IS BASED ON VARIOUS FACTORS INCLUDING, BUT NOT LIMITED TO, SKILL SET, EXPERIENCE, QUALIFICATIONS AND JOB-RELATED REQUIREMENTS. OUR BENEFITS INCLUDE MEDICAL, DENTAL, AND VISION ALONG WITH WELLNESS PROGRAMS, RETIREMENT PLANS, PAID LEAVE AND MUCH MORE! TO LEARN MORE ABOUT THESE PROGRAMS AND MANY MORE, TAKE A TOUR OF OUR BENEFITS PAGE AT HTTPS://WWW.FRIEDKIN.COM/BENEFITS.\n\nCOMPENSATION FOR THIS POSITION IS $120,000/YEAR WITH A 15% ANNUAL DISCRETIONARY BONUS OPPORTUNITY.\n\n#HP125\n\n",
    "job_skill_set": [
      "sales processes",
      "data analysis",
      "income development",
      "reporting tools",
      "negotiating skills",
      "performance metrics",
      "communication",
      "team building",
      "leadership",
      "problem solving",
      "customer service",
      "relationship management",
      "strategic thinking",
      "finance and insurance",
      "customer loyalty programs",
      "automotive compliance",
      "training and development",
      "accountability",
      "adaptability",
      "time management"
    ],
    "short_keywords": [
      "accountability",
      "adaptability",
      "analysis",
      "and",
      "automotive",
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "compliance",
      "customer",
      "data",
      "development",
      "fi",
      "finance",
      "income",
      "insurance",
      "leadership",
      "loyalty",
      "management",
      "manager",
      "metrics",
      "negotiating",
      "performance",
      "problem",
      "processes",
      "programs",
      "relationship",
      "reporting",
      "sales",
      "service",
      "skills",
      "solving",
      "strategic",
      "team",
      "thinking",
      "time",
      "tools",
      "training"
    ]
  },
  {
    "job_id": "3902953318",
    "job_title": "Marketing & Business Development Intern",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "MONUMENT ADVOCACY IS LOOKING FOR A MARKETING AND BUSINESS DEVELOPMENT INTERN FOR THE SUMMER 2024 SESSION.MONUMENT ADVOCACY WORKS WITH A WIDE RANGE OF CLIENTS, SUCH AS FORTUNE 100 CORPORATIONS, TRADE ASSOCIATIONS, AND STARTUP COMPANIES TO HELP THEM ENGAGE EFFECTIVELY IN TODAY’S PUBLIC POLICY ENVIRONMENT.\nOUR INTERNSHIP PROGRAM:OUR INTERNSHIP PROGRAM OFFERS INTERNS EXPOSURE TO THE INNER WORKINGS OF HOW A TOP-TIER D.C. GOVERNMENT RELATIONS AND PUBLIC AFFAIRS FIRM OPERATES. INTERNS PARTAKE IN PROFESSIONAL DEVELOPMENT THROUGH NETWORKING COFFEES AND MEETINGS WITH LEADERS AND ASSOCIATES ACROSS ALL LEVELS.\nCURRENT UNDERGRADUATE AND GRADUATE STUDENTS ARE ENCOURAGED TO APPLY FOR THIS POSITION.\nDUTIES WILL INCLUDE, BUT ARE NOT LIMITED TO:\nCREATING CONTENT FOR AND MANAGING SOCIAL MEDIA PLATFORMS INCLUDING X AND LINKEDINDEVELOPING SOCIAL MEDIA CAMPAIGNSCONDUCT MARKET RESEARCHUTILIZE THE FIRM’S CRM TO ENTER DATA, ANALYZE TRENDS, AND MAKE RECOMMENDATIONS TO THE MARKETING AND BUSINESS DEVELOPMENT TEAMCREATE AD-HOC REPORTSIDENTIFY STALLED OR SLOW-MOVING PROSPECTSFORECAST FUTURE REVENUE BASED ON CLIENT PROSPECTSASSIST WITH COPY-EDITING AND QUALITY CONTROL OF ALL INTERNAL AND EXTERNAL CONTENTPERFORM AUDITS OF THE FIRM’S SOCIAL MEDIA CHANNELS, WEBSITE, COLLATERAL AND MORETRACK FIRM AND EMPLOYEE MENTIONS DC PUBLICATIONSTRACK OP-ED PLACEMENTSOTHER DUTIES AS ASSIGNED\nWHAT WE LOOK FOR:\nCURRENT UNDERGRADUATE OR GRADUATE STUDENTS PURSUING A DEGREE IN MARKETING, BUSINESS, OR DIGITAL MARKETINGEXPERIENCE WITH SALESFORCEFAMILIARITY WITH CANVA OR OTHER GRAPHIC DESIGN PLATFORMSEXPERIENCE WITH SPROUT SOCIAL OR OTHER SOCIAL MEDIA MANAGEMENT TOOLSSTRONG TIME MANAGEMENT SKILLS, THE ABILITY TO MULTI-TASK, AND ATTENTION TO DETAIL\nPLEASE SEND YOUR RESUME AND A COVER LETTER TO ICOURCHESNE@MONUMENTADVOCACY.COM BY MAY 1 TO BE CONSIDERED FOR THIS POSITION. DO NOT AUTO-APPLY. THIS IS A PAID POSITION, INTERNS WILL MAKE DC MINIMUM WAGE.",
    "job_skill_set": [
      "market research",
      "CRM software",
      "data analysis",
      "Salesforce",
      "content creation",
      "report generation",
      "time management",
      "multi-tasking",
      "communication",
      "networking",
      "social media management",
      "copy-editing",
      "graphic design",
      "Sprout Social",
      "attention to detail"
    ],
    "short_keywords": [
      "analysis",
      "attention",
      "business",
      "businessdevelopment",
      "communication",
      "content",
      "copyediting",
      "creation",
      "crm",
      "data",
      "design",
      "detail",
      "development",
      "generation",
      "graphic",
      "intern",
      "management",
      "market",
      "marketing",
      "media",
      "multitasking",
      "networking",
      "report",
      "research",
      "salesforce",
      "social",
      "software",
      "sprout",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3905249765",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "COMPANY: US1631 BELLISSIMO DISTRIBUTION, LLC - GRECO CORPORATE\nZIP CODE:91761\nMINIMUM LEVEL OF EDUCATION:BACHELOR’S DEGREE\nMINIMUM YEARS OF EXPERIENCE:3 YEARS\nEMPLOYMENT TYPE:FULL TIME\nTRAVEL PERCENTAGE: UP TO 50%\nCOMPENSATION RANGE:$104,600.00 - $156,900.00\nTHE COMPENSATION RANGE PROVIDED IS IN COMPLIANCE WITH STATE SPECIFIC LAWS. FACTORS THAT MAY BE USED TO DETERMINE YOUR ACTUAL RATE OF PAY INCLUDE YOUR SPECIFIC SKILLS, YEARS OF EXPERIENCE AND OTHER FACTORS. \nYOU MAY BE ELIGIBLE TO PARTICIPATE IN THE COMPANY'S INCENTIVE PLAN.\n\nBENEFITS INFORMATION:FOR INFORMATION ON SYSCO’S BENEFITS, PLEASE VISIT HTTPS://SYSCOBENEFITS.COM\n\nJOB SUMMARYTHE PRIMARY RESPONSIBILITIES OF THIS POSITION ARE TO ANALYZE NEW BUSINESS OPPORTUNITIES, ANALYZE EXISTING CUSTOMER PROFITABILITY AND PARTICIPATE IN NEW BUSINESS STRATEGY AND FEASIBILITY PLANNING.\nRESPONSIBILITIESACQUIRE AND VALIDATE DATA FROM PROSPECTIVE NEW CUSTOMERSPROVIDE RELEVANT DATA AND DIRECTION TO DISTRIBUTION SERVICES, PURCHASING, PROCUREMENT, OPERATIONS, AND FINANCE TO ANALYZE THE IMPACT OF THE NEW BUSINESSVALIDATE THE REASONABILITY OF THE DEPARTMENTAL INPUT AND MODIFY IT AS NECESSARYPROFORMA THE NEW BUSINESSASSIST IN PREPARATION OF RFP SUBMISSIONPARTICIPATE AS REQUESTED IN MEETINGS WITH POTENTIAL NEW CUSTOMERS TO OBTAIN DATA AND EXPLAIN PROPOSALSANALYZE THE PROFITABILITY OF EXISTING CUSTOMERS AND RECOMMEND NEW FEES UPON THE EXPIRATION OF EXISTING CONTRACTSPROFORMA “WHAT IF” SCENARIOS ON WAYS TO IMPROVE GRECO’S PROFITABILITYCONTINUALLY REFINE THE PROFORMA PROCESS TO IMPROVE ACCURACY AND TIMELINESSPARTICIPATE IN GRECO’S STRATEGIC PLANNINGOTHER DUTIES AS ASSIGNED OR NECESSARY\nQUALIFICATIONSEDUCATION4-YEAR DEGREE IN BUSINESS, MARKETING OR RELATED FIELD\nEXPERIENCEPLUS A MINIMUM OF 3 YEARS EXPERIENCE IN SALES, OR THE FOOD DISTRIBUTION INDUSTRY\nPHYSICAL DEMANDSMUST BE ABLE TO COMMUNICATE CLEARLY VIA TELEPHONE AND PERSONAL CONTACT WITH CUSTOMERS AND OTHER COMPANY PERSONNEL\nMENTAL/VISUAL DEMANDSMUST BE ABLE TO READ AT A DISTANCE CLOSE TO THE EYES. DRIVING REQUIRES DISTANCE VISION TRAVELOCCASIONAL TRAVEL BY AUTOMOBILE AND AIR IS REQUIRED EQUIPMENT OPERATEDAUTOMOBILE, PERSONAL COMPUTER WITH MICROSOFT OFFICE SUITE KNOWLEDGE\nLICENSE, CERTIFICATES, AND REGISTRATIONVALID DRIVER’S LICENSE AND CERTIFICATE OF AUTO INSURANCE AS DEFINED IN COMPANY POLICY\nOVERVIEW:SYSCO IS THE GLOBAL LEADER IN FOODSERVICE DISTRIBUTION. WITH OVER 71,000 COLLEAGUES AND A FLEET OF OVER 13,000 VEHICLES, SYSCO OPERATES APPROXIMATELY 333 DISTRIBUTION FACILITIES WORLDWIDE AND SERVES MORE THAN 700,000 CUSTOMER LOCATIONS.\nWE OFFER OUR COLLEAGUES THE OPPORTUNITY TO GROW PERSONALLY AND PROFESSIONALLY, TO CONTRIBUTE TO THE SUCCESS OF A DYNAMIC ORGANIZATION, AND TO SERVE OTHERS IN A MANNER THAT EXCEEDS THEIR EXPECTATIONS. WE’RE LOOKING FOR TALENTED, HARD-WORKING INDIVIDUALS TO JOIN OUR TEAM. COME GROW WITH US AND LET US SHOW YOU WHY SYSCO IS AT THE HEART OF FOOD AND SERVICE.\nAFFIRMATIVE ACTION STATEMENT:APPLICANTS MUST BE CURRENTLY AUTHORIZED TO WORK IN THE UNITED STATES.\nWE ARE PROUD TO BE AN EQUAL OPPORTUNITY AND AFFIRMATIVE ACTION EMPLOYER, AND CONSIDER QUALIFIED APPLICANTS WITHOUT REGARD TO RACE, COLOR, CREED, RELIGION, ANCESTRY, NATIONAL ORIGIN, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, AGE, DISABILITY, VETERAN STATUS OR ANY OTHER PROTECTED FACTOR UNDER FEDERAL, STATE OR LOCAL LAW.\nTHIS OPPORTUNITY IS AVAILABLE THROUGH SYSCO CORPORATION, ITS SUBSIDIARIES AND AFFILIATES.",
    "job_skill_set": [
      "business strategy",
      "sales experience",
      "communication",
      "team collaboration",
      "problem solving",
      "adaptability",
      "customer relationship management",
      "strategic thinking",
      "data analysis",
      "RFP preparation",
      "profitability analysis",
      "Microsoft Office Suite",
      "food distribution knowledge",
      "valid driver's license"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "customer",
      "data",
      "development",
      "distribution",
      "drivers",
      "experience",
      "food",
      "knowledge",
      "license",
      "management",
      "manager",
      "microsoft",
      "office",
      "preparation",
      "problem",
      "profitability",
      "relationship",
      "rfp",
      "sales",
      "solving",
      "strategic",
      "strategy",
      "suite",
      "team",
      "thinking",
      "valid"
    ]
  },
  {
    "job_id": "3887495762",
    "job_title": "Sales Representative/Business Development Representative - B2B (Entry Level)",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "LOCATION:\n\nSTOW, OH, US, 44224\n\nCOMPANY DESCRIPTION\n\nCROWN EQUIPMENT CORPORATION, ONE OF THE WORLD'S LARGEST LIFT TRUCK MANUFACTURERS, OFFERS LOCAL SUPPORT ON A GLOBAL SCALE WITH MORE THAN 15 MANUFACTURING FACILITIES WORLDWIDE AND MORE THAN 500 RETAIL LOCATIONS IN OVER 80 COUNTRIES. OUR GLOBAL SALES AND SERVICE NETWORK PROVIDES OUR CUSTOMERS WITH A LOCAL RESOURCE FOR A WIDE VARIETY OF QUALITY MATERIAL HANDLING EQUIPMENT, FLEET MANAGEMENT SOLUTIONS, WAREHOUSE PRODUCTS AND SUPPORT SERVICES TO MEET THEIR NEEDS ANYTIME, ANYWHERE.\n\nTHIS IS AN ENTRY LEVEL POSITION, AND THE PRIMARY OBJECTIVE IS TO DEVELOP INTO AN ACCOUNT REPRESENTATIVE, AFTERMARKET SALES REPRESENTATIVE, ACCOUNT MANAGER, OR OTHER COMMISSIONED SALES POSITIONS.\n\nJOB RESPONSIBILITIES\n\nSELL SELECT PRODUCTS IN A GEOGRAPHICAL TERRITORY AND/OR ASSIGNED ACCOUNTS.MAY WORK IN A TEAM APPROACH AND ASSIST OTHER SALES POSITIONS WITH TERRITORY MANAGEMENT AND COMMUNICATION. PARTICIPATE IN CORPORATE AND LOCAL CAMPAIGNS. MAKE SALES CALLS TO QUALIFY PROSPECTS IN PERSON AND OVER THE TELEPHONE. GENERATE LEADS. INVOLVEMENT IN INFORMATION GATHERING EFFORTS AND/OR TRACKING AND FOLLOW-UP OF LEADS AND INQUIRIES.PARTICIPATE IN TRAINING ACTIVITIES LOCALLY, IN THE FIELD, AND OCCASIONALLY AT THE NEW BREMEN, OHIO CORPORATE HEADQUARTERS.COLLABORATE WITH VARIOUS DEPARTMENTS WITHIN THE BRANCH.\n\nQUALIFICATIONS\n\nHIGH SCHOOL DIPLOMA OR EQUIVALENT. BACHELOR’S DEGREE IN BUSINESS MANAGEMENT, MARKETING, ENTREPRENEURSHIP, PROFESSIONAL SELLING, OR RELATED BUSINESS PROGRAM IS A PLUS.STRONG COMMUNICATION, ORGANIZATIONAL, AND TIME MANAGEMENT SKILLS.STRONG PROBLEM-SOLVING CAPABILITIES, STRONG SENSE OF RESPONSIBILITY AND SELF-MOTIVATION, AND ABILITY TO WORK IN A TEAM ENVIRONMENT.INTERMEDIATE COMPUTER SKILLS INCLUDING A WORKING KNOWLEDGE OF MICROSOFT OFFICE SUITE.VALID DRIVER’S LICENSE, GOOD DRIVING RECORD, AND THE ABILITY TO SAFELY OPERATE LIFT TRUCKS FOR PRODUCT DEMOS.\n\nWORK AUTHORIZATION\n\nCROWN WILL ONLY EMPLOY THOSE WHO ARE LEGALLY AUTHORIZED TO WORK IN THE UNITED STATES. THIS IS NOT A POSITION FOR WHICH SPONSORSHIP WILL BE PROVIDED. INDIVIDUALS WITH TEMPORARY VISAS OR WHO NEED SPONSORSHIP FOR WORK AUTHORIZATION NOW OR IN THE FUTURE, ARE NOT ELIGIBLE FOR HIRE.\n\nNO AGENCY CALLS PLEASE.\n\nCOMPENSATION AND BENEFITS\n\nCROWN OFFERS AN EXCELLENT WAGE AND BENEFITS PACKAGE FOR FULL-TIME EMPLOYEES INCLUDING HEALTH/DENTAL/VISION/PRESCRIPTION DRUG PLAN, FLEXIBLE BENEFITS PLAN, 401K RETIREMENT SAVINGS PLAN, LIFE AND DISABILITY BENEFITS, PAID PARENTAL LEAVE, PAID HOLIDAYS, PAID VACATION, TUITION REIMBURSEMENT, AND MUCH MORE.\n\nEO/AA EMPLOYER MINORITIES/FEMALES/PROTECTED VETERANS/DISABLED\n\nNEAREST MAJOR MARKET: AKRON\n\nNEAREST SECONDARY MARKET: CLEVELAND\n\nJOB SEGMENT:  ENTRY LEVEL SALES, BUSINESS DEVELOPMENT, SALES REP, ENTRY LEVEL, SALES",
    "job_skill_set": [
      "sales",
      "lead generation",
      "Microsoft Office Suite",
      "territory management",
      "communication",
      "teamwork",
      "problem solving",
      "organizational skills",
      "time management",
      "self-motivation",
      "responsibility",
      "lift truck operation"
    ],
    "short_keywords": [
      "b2b",
      "businessdevelopment",
      "communication",
      "development",
      "entry",
      "generation",
      "lead",
      "level",
      "lift",
      "management",
      "microsoft",
      "office",
      "operation",
      "organizational",
      "problem",
      "representative",
      "representativebusiness",
      "responsibility",
      "sales",
      "selfmotivation",
      "skills",
      "solving",
      "suite",
      "teamwork",
      "territory",
      "time",
      "truck"
    ]
  },
  {
    "job_id": "3901378620",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "THE BUSINESS DEVELOPMENT MANAGER (BDM) IS AN EXPERIENCED SALESPERSON WHO IS HIGHLY MOTIVATED TO BUILD RELATIONSHIPS, PROMOTE THE COMPANY’S OFFERINGS, AND DRIVE SALES. THIS BDM HAS A STRONG UNDERSTANDING OF THE RETAIL INDUSTRY AND SALES PROCESSES. THIS ROLE WILL BE A MAIN POINT OF CONTACT WITH A SPECIFIC RETAILER TEAM AND WILL BE RESPONSIBLE FOR BUILDING AND MAINTAINING EXISTING AND NEW RELATIONSHIPS WITH BOTH MERCHANTS AND SUPPLIER TEAMS. ESSENTIAL DUTIES AND RESPONSIBILITIES:BUILD AND MAINTAIN EXISTING AND NEW RELATIONSHIPS WITH CLIENT HOME OFFICE TEAMS, OPERATIONS PARTNERS, AND SUPPLIER TEAMS.FULLY UNDERSTAND THE LIFE CYCLE OF A SALES AND BE ABLE TO COMMUNICATE IT ACCORDINGLY TO A VARIETY OF AUDIENCES.PROACTIVELY IDENTIFY SALES OPPORTUNITY WITH SUPPLIERS AND MERCHANTS AND SUCCESSFULLY CLOSE SALES.MANAGE A PIPELINE AND SALES QUOTA WITH STRONG COMMUNICATION TO INTERNAL TEAMS/SUPERVISOR.UNDERSTAND CONTRACTS AND WORK ORDERS, AND PROPERLY COMMUNICATE THESE ACCORDINGLY.POSITIVELY PARTNER WITH CROSS-FUNCTIONAL TEAMS, INCLUDING BUT NOT LIMITED TO: OPERATIONS, SYSTEMS, CREATIVE/MARKETING, FULFILLMENT, INSIGHTS, AND MORE.SEEK NEW INFORMATION AND OPPORTUNITIES VIA THE INDUSTRY, CLIENT PARTNERS, AND SUPPLIER CONTACTS TO CONTINUE TO REMAIN RELEVANT AND DRIVE SALES WHILE GROWING RELATIONSHIPS.CREATE AND DELIVER PRESENTATIONS TO A VARIETY OF AUDIENCES.BE FAMILIAR WITH AND FREQUENTLY USE NEGOTIATING TACTICS.MAINTAIN A STRONG AND ASSERTIVE CUSTOMER SERVICE MINDSET WITH STRONG VERBAL AND WRITTEN COMMUNICATION SKILLS.MUST BE ABLE TO PERFORM ALL ROLE EXPECTATIONS WITH A DIRECT SUPERVISOR WHO MAY WORK OFF-SITE/REMOTELY. EDUCATION / EXPERIENCE:BACHELOR’S DEGREE IN RELATED FIELD OR EQUIVALENT WORK EXPERIENCE; PREVIOUS EXPERIENCE IN A SIMILAR OR RETAIL INDUSTRY IS HIGHLY DESIRED. A MINIMUM OF TWO YEARS OF RELATED SALES EXPERIENCE WITHIN THE RETAIL OR CPG INDUSTRY WITH A PROVEN TRACK RECORD FOR MEETING SALES QUOTAS. COMPUTER SKILLS/TOOLS & TECHNOLOGY:STRONG COMPUTER AND TECHNICAL SKILLS INCLUDING MICROSOFT SYSTEMS SUCH AS WINDOWS, OFFICE, ETC.   PHYSICAL DEMANDS:WHILE PERFORMING THE DUTIES OF THIS POSITION, THE TEAM MEMBER IS REGULARLY REQUIRED TO BE ABLE TO: SIT, STAND, TALK, HEAR, AND USE HANDS AND FINGERS TO OPERATE A COMPUTER KEYBOARD, MOUSE AND/OR OTHER PERIPHERALS. LISTEN TO AND UNDERSTAND INFORMATION AND IDEAS PRESENTED THROUGH SPOKENWORDS AND SENTENCES. READ AND UNDERSTAND INFORMATION AND IDEAS PRESENTED IN WRITING. COMMUNICATE INFORMATION AND IDEAS IN SPEAKING SO OTHERS WILL UNDERSTAND. IDENTIFY AND UNDERSTAND THE SPEECH OF ANOTHER PERSON. COMMUNICATE INFORMATION AND IDEAS IN WRITING SO OTHERS WILL UNDERSTAND. LIGHT TO MODERATE LIFTING MAY BE REQUIRED FROM TIME-TO-TIME UP TO 30 LBS. WORK ENVIRONMENT:STANDARD OFFICE ENVIRONMENT. (3) DAYS A WEEK IN THE OFFICE OTHER WORK WILL BE PERFORMED REMOTELY. THIS ROLE REQUIRES LIMITED TRAVEL WITHIN THE US UP TO 10 TIMES PER YEAR TO VISIT CLIENTS AND PERFORM RETAIL AUDITS. LANGUAGE SKILLS:  ABILITY TO PRESENT FACTS AND RECOMMENDATIONS EFFECTIVELY IN ORAL AND WRITTEN FORM. ENGLISH IS THE PRIMARY LANGUAGE SKILL; HOWEVER, BILINGUAL SKILLS MAY BE REQUIRED BASED ON BUSINESS NECESSITY.  PLEASE NOTE THAT THIS JOB DESCRIPTION IS NOT DESIGNED TO COVER OR CONTAIN A COMPREHENSIVE LISTING OF ACTIVITIES, DUTIES, OR RESPONSIBILITIES THAT ARE REQUIRED OF THE EMPLOYEE FOR THIS JOB. DUTIES, RESPONSIBILITIES, AND ACTIVITIES MAY CHANGE AT ANY TIME WITH OR WITHOUT NOTICE. UNDER THE AMERICANS WITH DISABILITIES ACT (ADA), WIS IS COMMITTED TO PROVIDING REASONABLE ACCOMMODATIONS TO QUALIFIED INDIVIDUALS WITH DISABILITIES TO ENABLE THEM TO EFFECTIVELY PERFORM THE ESSENTIAL FUNCTIONS OF THE JOB. WE ARE AN EQUAL OPPORTUNITY EMPLOYER.",
    "job_skill_set": [
      "sales",
      "communication",
      "customer service",
      "teamwork",
      "proactivity",
      "problem solving",
      "listening skills",
      "bilingual communication",
      "relationship building",
      "negotiation",
      "Microsoft Office",
      "sales pipeline management",
      "contract understanding",
      "presentation skills",
      "retail industry knowledge",
      "adaptability",
      "assertiveness"
    ],
    "short_keywords": [
      "adaptability",
      "assertiveness",
      "bilingual",
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "contract",
      "customer",
      "development",
      "industry",
      "knowledge",
      "listening",
      "management",
      "manager",
      "microsoft",
      "negotiation",
      "office",
      "pipeline",
      "presentation",
      "proactivity",
      "problem",
      "relationship",
      "retail",
      "sales",
      "service",
      "skills",
      "solving",
      "teamwork",
      "understanding"
    ]
  },
  {
    "job_id": "3899531572",
    "job_title": "Business Development Associate – Acquisitions",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "BUSINESS DEVELOPMENT ASSOCIATE – ACQUISITIONS\nFOUNDED IN 1948, BLACKMON MOORING / BMSCAT HAS A LONG-STANDING REPUTATION AS A LEADER IN THE RESTORATION INDUSTRY. FROM INITIAL CLEAN-UP TO COMPLETE REBUILDS, BLACKMON MOORING / BMSCAT IS THERE EVERY STEP OF THE WAY. WE WORK ON ANYTHING FROM MULTI-MILLION DOLLAR COMMERCIAL PROJECTS TO SEVERAL THOUSAND DOLLAR RESIDENTIAL LOSSES AND EVERYTHING IN BETWEEN.\nWE ARE A TEAM BUILT ON HIGH ENERGY, HIGH PERFORMING INDIVIDUALS WHO WORK TOGETHER TO MAINTAIN BLACKMON MOORING / BMSCAT AS AN INDUSTRY LEADER.\nARE YOU DETAIL-ORIENTED, MOTIVATED, AND SEEKING A LONG-TERM CAREER WITH GROWTH POTENTIAL? THEN THIS OPPORTUNITY MIGHT BE RIGHT FOR YOU.\nPOSITION SUMMARYTHE ROLE OF BUSINESS DEVELOPMENT ASSOCIATE – ACQUISITIONS WILL INVOLVE RESEARCHING, IDENTIFYING, AND PROSPECTING TO POTENTIAL ACQUISITION TARGETS THROUGH DIRECT OUTREACH VIA EMAIL, SOCIAL MEDIA, AND COLD CALLING. THE BUSINESS DEVELOPMENT ASSOCIATE WILL QUALIFY POTENTIAL CANDIDATES AND MAKE INTRODUCTIONS TO BMS CAT’S ACQUISITION TEAM.\nTHE IDEAL CANDIDATE WILL BE MOTIVATED TO DRIVE BMS CAT’S GROWTH STRATEGY IN ACQUISITIONS BY GAINING A KEEN UNDERSTANDING OF THE MERGER AND ACQUISITION (M&A) ENVIRONMENT WITHIN THE RESTORATION INDUSTRY AND ENHANCE BMS CAT’S REPUTATION AS AN ACQUIRER OF CHOICE. THE IDEAL CANDIDATE SHOULD ALSO THRIVE IN A FAST-PACED ENVIRONMENT, POSSESS A COMPELLING PERSONALITY WITH THE ABILITY TO EXCITE, INSPIRE AND GAIN TRUST IN THE RELATIONSHIP BUILDING PROCESS.\nESSENTIAL FUNCTIONSFAMILIARIZE YOURSELF WITH BMS CAT'S VISION AND MISSION AND SEEK TO ACCOMPLISH SET GOALS AND OBJECTIVES.UTILIZE VARIOUS RESEARCH METHODS TO IDENTIFY POTENTIAL ACQUISITION TARGETS WITHIN SPECIFIED GEOGRAPHIC REGIONS MEETING CERTAIN BUSINESS & FINANCIAL CRITERIA.ENGAGE IN OUTREACH EFFORTS TO INITIATE CONVERSATIONS WITH KEY STAKEHOLDERS AND DECISION-MAKERS AT TARGET COMPANIES.CULTIVATE STRONG RELATIONSHIPS WITH NEW CANDIDATES, WHILE MAINTAINING EXISTING RELATIONSHIPS.COLLABORATE WITH THE M&A TEAM TO ASSESS AND PRIORITIZE LEADS BASED ON STRATEGIC OBJECTIVES AND DEAL CRITERIA.DEMONSTRATE STRONG PEOPLE SKILLS WITH THE ABILITY TO ENGAGE EFFECTIVELY WITH VARIOUS LEVELS OF MANAGEMENT, TEAM MEMBERS, AND POTENTIAL CANDIDATES.COLLECT AND MAINTAIN ACCURATE RECORDS OF CANDIDATE INFORMATION AND LEAD GENERATION ACTIVITIES IN THE CRM AND MANAGE A PIPELINE OF ACTIONABLE OPPORTUNITIES.REPRESENT BMS CAT AT INDUSTRY TRADE SHOWS AND EVENTS, NETWORKING WITH INDUSTRY PROFESSIONALS AND EXPLORING POTENTIAL PARTNERSHIP OPPORTUNITIES.STAY INFORMED ABOUT INDUSTRY TRENDS, MARKET DYNAMICS, AND COMPETITIVE LANDSCAPE TO INFORM DECISION-MAKING AND OPPORTUNITY ASSESSMENT.\nEXPERIENCE AND SKILL REQUIREMENTSBACHELOR'S DEGREE. 3+ YEARS OF EXPERIENCE IN SALES AND/OR PROSPECTING.EXCELLENT COMMUNICATION AND INTERPERSONAL SKILLS, WITH THE ABILITY TO BUILD RAPPORT AND ESTABLISH RELATIONSHIPS WITH STAKEHOLDERS. PROVEN TRACK RECORD OF SUCCESSFULLY SOURCING AND QUALIFYING LEADS WITHIN A TARGET MARKET.ABILITY TO WORK INDEPENDENTLY AND MANAGE MULTIPLE PRIORITIES IN A DEADLINE-DRIVEN ENVIRONMENT.TRAVEL TO INDUSTRY TRADE SHOWS AND EVENTS AS NEEDED. TYPICALLY, ONCE A MONTH FOR A DURATION OF 2 TO 3 DAYS.FAMILIARITY WITH SALESFORCE OR ANOTHER CRM SYSTEM AND OTHER RELEVANT TOOLS/SOFTWARE IS PREFERRED.\nCOMPENSATIONAS THE BUSINESS DEVELOPMENT ASSOCIATE - ACQUISITIONS, YOU WILL RECEIVE A COMPETITIVE SALARY BASED ON EXPERIENCE LEVEL. THIS CAN BE DISCUSSED DURING THE FIRST INTERVIEW. WE OFFER FULLY PAID MEDICAL AND LIFE INSURANCE FOR OUR EMPLOYEES, OPTIONAL DENTAL AND OPTICAL INSURANCE, GENEROUS PAID TIME OFF, A 401 (K) PLAN AND MUCH MORE.\nIF THIS SOUNDS LIKE YOU, PLEASE APPLY TODAY!\nYOU CAN TEXT \"BMSJOBS\" TO 25000 AND ASK QUESTIONS OR START THE PROCESS.\nBMS CAT IS AN EQUAL OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO AGE, RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, OR PROTECTED VETERAN STATUS AND WILL NOT BE DISCRIMINATED AGAINST ON THE BASIS OF DISABILITY.",
    "job_skill_set": [
      "sales",
      "lead generation",
      "communication",
      "interpersonal skills",
      "relationship building",
      "motivation",
      "time management",
      "team collaboration",
      "adaptability",
      "prospecting",
      "CRM",
      "research methods",
      "M&A knowledge",
      "Salesforce"
    ],
    "short_keywords": [
      "acquisitions",
      "adaptability",
      "associate",
      "building",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "crm",
      "development",
      "generation",
      "interpersonal",
      "knowledge",
      "lead",
      "ma",
      "management",
      "methods",
      "motivation",
      "prospecting",
      "relationship",
      "research",
      "sales",
      "salesforce",
      "skills",
      "team",
      "time"
    ]
  },
  {
    "job_id": "3905697483",
    "job_title": "Business Development Manager, Caribbean and Latin America (Spanish speaking)",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ABOUT USFOOD WASTE IS A $1 TRILLION PROBLEM - COSTING THE WORLD OVER 1% OF GLOBAL GDP. WE'RE DEAD SET ON SOLVING THE PROBLEM AND LOOKING FOR PEOPLE TO HELP US ACHIEVE OUR MISSION. WE, AT WINNOW, BELIEVE THAT FOOD IS FAR TOO VALUABLE TO WASTE, AND THAT TECHNOLOGY CAN TRANSFORM THE WAY WE PRODUCE FOOD. OUR TEAM IS MADE OF PEOPLE WHO ALL SHARE A PASSION FOR FOOD AND TECHNOLOGY.WINNOW WAS FOUNDED IN LONDON IN 2013 TO HELP THE HOSPITALITY INDUSTRY PREVENT FOOD WASTE THROUGH INTERNET OF THINGS TOOLS IN THE KITCHEN. WE HAVE WORKED WITH HUNDREDS OF SITES AND ARE OPERATING IN OVER 70 COUNTRIES AROUND THE WORLD SUPPORTED BY OUR OFFICES IN LONDON, DUBAI, SHANGHAI, SINGAPORE, ROMANIA AND NORTH AMERICA. WE ARE A RAPIDLY GROWING COMPANY WITH A STRONG BASE OF CLIENTS WHO ARE ROLLING OUT OUR SYSTEM GLOBALLY. WE HAVE BLUE-CHIP CUSTOMERS INCLUDING ACCOR HOTELS, IKEA, IHG, MARRIOTT, COMPASS GROUP AND MANY OTHERS.WINNOW'S CLIENTS ON AVERAGE REDUCE WASTE BY OVER 50% BY VALUE AND SUSTAIN SAVINGS. WINNOW HAS NOW WORKED WITH HUNDREDS OF SITES TO REDUCE FOOD WASTE, INCLUDING HOTELS, UNIVERSITIES AND SCHOOLS, STAFF RESTAURANTS, EVENT/HOSPITALITY KITCHENS, BUFFETS, PUBS, AND HIGH STREET RESTAURANTS. WHERE THE SYSTEM IS PERMANENTLY ADOPTED, PRE-CONSUMER WASTE VALUE IS REDUCED BY 50% - 70% WITH NO DETRIMENTAL IMPACT TO THE PERCEIVED QUALITY OR VALUE OF THE OFFER TO THEIR CUSTOMERS. THIS REPRESENTS A TYPICAL IMPROVEMENT OF FOOD COST SAVINGS OF 3% TO 8% ON TOTAL FOOD COST SPEND.AS THE GLOBAL LEADER IN ADDRESSING FOOD WASTE, WE ARE COMMITTED TO CONTINUE PUSHING THE ENVELOPE ON WHAT TECHNOLOGY CAN DO TO SOLVE THIS PROBLEM. WINNOW VISION, OUR NEW ARTIFICIAL INTELLIGENCE-BASED TECHNOLOGY, IS TRAINED TO AUTOMATICALLY TRACK ALL FOOD WASTE THROWN AWAY. IT HAS WON AWARDS AT THE WORLD ECONOMIC FORUM AND HAS BEEN RECEIVED TREMENDOUS ENTHUSIASM FROM OUR CLIENTS AND THE INDUSTRY. YOU CAN READ MORE ABOUT IT ON OUR WEBSITE AND THIS ARTICLE IN FORBES.WE ARE PASSIONATE ABOUT LIVING OUR VALUES AND PLACE THEM AT THE CENTRE OF EVERYTHING WE DO. WE ARE EXCITED ABOUT LIKE MINDED TALENT WHO SHARE THESE VALUES, JOINING US IN OUR MISSION:EQUAL PARTS HEAD AND HEART. WE'RE BOTH PASSIONATE AND MEASURED. WE CAREFULLY BALANCE THE NEED FOR QUICK SOLUTIONS AND PRAGMATISM WITH THE ABILITY TO STEP BACK, TAKE IN THE BIGGER PICTURE AND BUILD FOR THE LONG TERM. BRAVELY HONEST. WITH EACH OTHER, THAT MEANS WE'RE A TRANSPARENT ORGANISATION WHERE HEALTHY, RESPECTFUL DEBATE IS ENCOURAGED. WITH OUR CUSTOMERS, WE CHALLENGE THEM IF WE DON'T THINK THEY'RE ACHIEVING THEIR GOALS, WHETHER THEY BE ENVIRONMENTAL OR FINANCIAL. PEOPLE OF ACTION. DONE IS BETTER THAN PERFECT, AND WE LEARN BY BOLDLY DOING THEN RAPIDLY IMPROVING. WE'RE BREAKING NEW GROUND, SO WE KNOW THINGS MIGHT GO WRONG. BUT WE JUDGE OURSELVES AND EACH OTHER ON OUR REACTION AND OUR RESILIENCE. BOUND BY FOOD. WE'RE A DIVERSE BUNCH, BUT OUR BELIEF IN THE VALUE OF FOOD IS THE COMMON THREAD IN EVERYTHING WE DO. WITH EACH OTHER, WE CELEBRATE THROUGH OUR LOVE AND RESPECT FOR FOOD. WITH OUR CUSTOMERS, IT MEANS WE WORK HARD TO DEVELOP CREATIVE TOOLS TO MAKE IT EASY FOR CHEFS TO VALUE FOOD. HUNGRY AND HUMBLE. OUR PRODUCT IS REVOLUTIONARY, OUR PEOPLE ARE IMPRESSIVE, AND WE'RE HUNGRY FOR CHANGE. BUT, WE'RE JUST THE CATALYST FOR A BIGGER MOVEMENT. WE STAY HUMBLE REGARDLESS OF OUR SUCCESS, AND MAKE CHEFS THE HEROES IN THIS JOURNEY. ABOUT THE ROLEDUE TO INCREASING BUSINESS DEMAND, AN EXCITING OPPORTUNITY EXISTS FOR A TALENTED AND DRIVEN BUSINESS DEVELOPMENT MANAGER TO JOIN THE TEAM TO DRIVE OUR BUSINESS GROWTH IN THE CARIBBEAN AND LATIN AMERICA. YOU WILL PLAY A PIVOTAL ROLE IN DEVELOPING THE STRATEGY TO INCREASE WINNOW'S FOOTPRINT ACROSS THE TERRITORIES, AND WILL THEN BE RESPONSIBLE TO LEAD AND DELIVER YOUR STRATEGY.REPORTING TO THE MD FOR THE AMERICAS, THIS ROLE WILL BE BASED IN EVANSTON AND WILL REQUIRE INTERNATIONAL TRAVEL.KEY OBJECTIVESLEAD THE END TO END SALES PROCESS WITH CUSTOMERS IN THE CARIBBEAN AND LATIN AMERICAREVIEW AND DEVELOP THE BUSINESS DEVELOPMENT STRATEGY TO GROW WINNOWS FOOTPRINT IN YOUR REGIONMANAGE THE BUILDING OF A PIPELINE WITHIN THE INDUSTRY IN ORDER TO EXPAND SALES PENETRATION, AND PROVIDE SOLUTIONS-BASED SALES AND SERVICE OFFERING TO CUSTOMERSDEVELOP DEEP RELATIONSHIPS WITH KEY INFLUENCERS IN THE MARKET TO HELP BUILD A DEMAND FOR OUR PRODUCTDEVELOP STRATEGIES FOR WINNING AND GROWING OUR BUSINESS WITH CLIENTS, ENSURING WE OBTAIN THE BUY-IN OF THE FULL DECISION MAKING UNITNURTURE NEW ACCOUNTS, HIGHLIGHTING EARLY SUCCESSES AND ADVOCATING FOR SCALING OF OUR TECHNOLOGY ACROSS THEIR BUSINESSEXPAND EXISTING ACCOUNTS, BUILDING ON PAST SUCCESSES TO ROLL OUT ACROSS ENTIRE PORTFOLIOSIDENTIFY ROUTES INTO OUR TARGET CLIENTS AND BUILD C SUITE-LEVEL RELATIONSHIPSMONITOR CLOSELY THE ACTIVITIES OF COMPETITORS AND LOOK TO POSSIBLE CO-OPERATIONS OR ACQUISITIONSREPRESENT WINNOW TAKING SPEAKING OPPORTUNITIES AT CONFERENCES AND EVENTS TO DRIVE SALES AND GROW OUR NETWORK \n\nREQUIREMENTS\n\nEXPERIENCE IN SAAS SALES WILL BE WELCOMED. YOU ARE PROVEN IN SUCCESSFULLY NAVIGATING THE SALES CYCLE AND IN CREATING URGENCY AND PROGRESSION TO DRIVE SALES SWIFTLY TO A CLOSEEXPERIENCE IN TECHNOLOGY SALES, WITH A TRACK RECORD OF CLOSING DEALS WITH LARGE CORPORATES PREFERREDEXPERIENCE IN A HIGH-PERFORMING SALES TEAM WITH A PROVEN TRACK RECORD OF EXCEEDING SALES TARGETSEXPERIENCE SELLING TO HOSPITALITY, PRIMARILY HOTELS AND CONTRACT CATERING IS A PLUSYOU ARE LIKELY TO BE DEGREE EDUCATED PERSONAL ATTRIBUTES YOU ARE A HIGHLY SELF-MOTIVATED GO-GETTER WHO THRIVES ON WINNING A DEAL AND STRIVES TO BE THE BESTYOU ARE RESULTS DRIVEN AND CAN DEMONSTRATE HOW YOU HAVE DELIVERED EFFECTIVE SOLUTIONS AT PACEYOU CAN DEMONSTRATE SUCCESS IN COLLABORATING CROSS-FUNCTIONALLY IN ORDER TO DELIVER THE BEST TO YOUR CUSTOMERS. YOU VALUE THE NEED TO BUILD STRONG PARTNERSHIPS INTERNALLY AND INVEST TIME IN THIS ACTIVITY YOU ARE ABLE TO ORGANISE SELF, INCLUDING EFFECTIVE SCHEDULING, PRIORITISATION AND TIME MANAGEMENT SKILLS, MANAGING MULTIPLE TASKS IN PARALLEL AND COMPLETING TASKS TO TIGHT DEADLINESYOU DEMONSTRATE EXCELLENT COMMUNICATION SKILLS. YOU ARE A CONFIDENT AND ARTICULATE PRESENTER TO AUDIENCES SMALL AND LARGE. YOU COMMUNICATE CLEARLY IN BOTH WRITTEN AND SPOKEN LANGUAGE. YOU LISTEN ATTENTIVELY; YOU PROCESS AND COMPREHEND WHAT YOU HEARYOU HAVE A TRACK RECORD OF IDENTIFYING AND UNDERSTANDING COMPLEX PROBLEMS, ANALYSING OPTIONS AND DEPLOYING SOUND AND SOMETIMES TOUGH DECISION-MAKING SKILLSYOU HAVE STRONG ANALYTICAL SKILLS AND ARE PROVEN IN USING DATA TO QUICKLY GET TO THE ROOT CAUSE OF AN ISSUE FROM WHICH YOU CAN START TO WORK ON A SOLUTION OUR SHARED ATTRIBUTESYOU ARE BOTH PASSIONATE AND MEASURED. YOU CAREFULLY BALANCE THE NEED FOR QUICK SOLUTIONS AND PRAGMATISM WITH THE ABILITY TO STEP BACK, TAKE IN THE BIGGER PICTURE AND BUILD FOR THE LONG TERMYOU ARE TRANSPARENT IN APPROACH AND ENJOY HEALTHY, RESPECTFUL DEBATE. YOU WORK HARD TO BUILD OPEN AND HONEST COLLABORATIVE RELATIONSHIPSYOU GET THINGS DONE AND SEEK TO CONTINUALLY IMPROVE. YOUR CUSTOMERS WANT YOU ON THEIR TEAMYOU ARE PASSIONATE ABOUT THE VALUE OF FOOD AND ARE COMMITTED TO THE FIGHT AGAINST FOOD WASTEYOU ARE HUMBLE IN APPROACH AND QUICK TO PITCH IN IF YOU SEE SOMEONE STRUGGLING \n\nBENEFITS\n\nCOMPETITIVE BASE SALARY23 DAYS OF PAID VACATION TIME IN ADDITION TO NATIONAL HOLIDAYS, PLUS THE OPTION TO BUY A FURTHER 5 DAYS ANNUAL LEAVECOMPANY STOCK OPTIONS PACKAGE401K CONTRIBUTIONSCOMPANY PART-FUNDED HEALTH INSURANCE AND EYE CARE ALLOWANCE2 WELLNESS HOURS PER MONTH PLUS A 44 USD GROSS MONTHLY WELLNESS ALLOWANCELIFE INSURANCE (3 TIMES BASE SALARY)ELIGIBLE FOR SALES COMMISSIONEMPLOYEE ASSISTANCE PROGRAMME - 24/7 HELPLINE FOR YOUR WELLBEINGLEARNING AND DEVELOPMENT ALLOWANCE OF 370 USD ANNUALLYHYBRID WAY OF WORKING - WE'RE ALL IN THE OFFICE ON TUESDAYS AND WEDNESDAYSCOMPANY PROVIDED BREAKFAST & SNACKS ON OFFICE DAYSEARLY FINISH FRIDAYS - LOG OFF AT 3 PM ON A FRIDAY IF YOU HAVE COMPLETED YOUR TASKS BY THENOUR OWN OFFICE SPACE WITH A GREAT WORKING ENVIRONMENTYOU WILL LOVE WHAT YOU DO - WAKING UP EVERY DAY SOLVING ONE OF THE BIGGEST SOCIAL PROBLEMS OF OUR GENERATION - FOOD WASTECOMMITTED TEAM MEMBERS WITH BROAD EXPERIENCE WHO SHARE A COMMON PASSION TO BUILD A WORLD CLASS BUSINESS",
    "job_skill_set": [
      "technology sales",
      "sales strategy development",
      "pipeline management",
      "data analysis",
      "relationship building",
      "account management",
      "self-motivation",
      "results-driven",
      "collaboration",
      "time management",
      "communication",
      "problem solving",
      "analytical thinking",
      "adaptability",
      "SaaS sales",
      "public speaking",
      "hospitality industry knowledge",
      "humility",
      "passion for food"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "america",
      "analysis",
      "analytical",
      "and",
      "building",
      "business",
      "businessdevelopment",
      "caribbean",
      "collaboration",
      "communication",
      "data",
      "development",
      "food",
      "for",
      "hospitality",
      "humility",
      "industry",
      "knowledge",
      "latin",
      "management",
      "manager",
      "passion",
      "pipeline",
      "problem",
      "public",
      "relationship",
      "resultsdriven",
      "saas",
      "sales",
      "selfmotivation",
      "solving",
      "spanish",
      "speaking",
      "strategy",
      "technology",
      "thinking",
      "time"
    ]
  },
  {
    "job_id": "3904926417",
    "job_title": "Entry-Level Business Development Representative {$72K OTE}",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ARE YOU LOOKING TO GAIN CRITICAL SKILLS TO EITHER PROGRESS IN YOUR CAREER OR HELP BUILD A FOUNDATION TO START YOUR OWN BUSINESS ONE DAY?\nLAUNCHSOURCE IS CHANGING THE WAY RECENT COLLEGE GRADUATES JUMPSTART THEIR CAREER IN FRONT-LINE REVENUE ROLES AT FAST-PACED TECH STARTUPS. THESE COMPANIES PROVIDE OPPORTUNITIES FOR RAPID CAREER ADVANCEMENT, AND ALLOW YOU TO BUILD MODERN & RELEVANT SKILLS NECESSARY TO SUCCEED IN THE INNOVATION ECONOMY. WE'VE PARTNERED WITH 200+ TO BECOME THEIR INTEGRATED PARTNER TO HR/RECRUITING AND SALES TEAMS THAT ARE LOOKING TO FOR AN UNFAIR ADVANTAGE TO ACCESS THE TOP 8% OF QUALIFIED ENTRY-LEVEL TALENT.\nOUR FOCUS IS ON PROVIDING YOU AN EARLY-CAREER OR ENTRY-LEVEL JOB SEEKER GET THE EXPERIENCE, INTERVIEW PREPARATION, DEVELOPMENT, AND ACCESS TO OUR PARTNERS, HIGH-GROWTH TECH STARTUPS AND COMPANIES THAT ARE MODERNIZING THEIR SALES DEPARTMENTS.\nWHAT YOU'LL DO:RESEARCH AND IDENTIFY NEW BUSINESS OPPORTUNITIES CALL PROSPECTIVE CLIENTS IN ORDER TO IDENTIFY QUALIFIED DECISION MAKERS & GENERATE AWARENESSBUILD AN EFFECTIVE PIPELINE, AND SCHEDULE MEETINGS FOR ACCOUNT EXECUTIVESNAVIGATE COMPANY STRUCTURES TO GET PAST GATEKEEPERS AND INFLUENCE DECISION MAKERSMAINTAIN DETAILED RECORDS IN SALESFORCEASSUME OTHER DUTIES AND RESPONSIBILITIES AS NEEDEDFIND CREATIVE AVENUES TO CONNECT WITH A NEW GENERATION OF BUYERS\nYOUR SKILLS AND EXPERIENCE:BA/BS DEGREEENERGETIC, DETERMINED, AND SELF-MOTIVATEDDESIRE TO LEARN AND START A CAREER IN MODERN SALESCOMMITMENT TO CUSTOMER EXCELLENCEEXCEPTIONAL WRITTEN AND VERBAL COMMUNICATION SKILLSLASER SHARP ATTENTION TO DETAIL ABILITY TO ASK INSIGHTFUL QUESTIONS\nREQUIREMENTSMUST BE ABLE TO INTERVIEW AND WORK IN A FULL-TIME ROLE IN THE NEXT 90 DAYS0-3 YEARS OF PROFESSIONAL EXPERIENCEDESIRE TO LEARN AND START A CAREER IN MODERN SALESELIGIBLE TO WORK IN THE UNITED STATESMUST HAVE A 4-YEAR COLLEGE DEGREE\n(STARTUPS, BUSINESS DEVELOPMENT, SALES, AND ENTREPRENEURSHIP)",
    "job_skill_set": [
      "Sales",
      "Business Development",
      "Data Entry",
      "Communication",
      "Customer Excellence",
      "Self-Motivation",
      "Attention to Detail",
      "Problem Solving",
      "Creativity",
      "Teamwork",
      "Salesforce",
      "Research",
      "Pipeline Management"
    ],
    "short_keywords": [
      "72k",
      "attention",
      "business",
      "businessdevelopment",
      "communication",
      "creativity",
      "customer",
      "data",
      "detail",
      "development",
      "entry",
      "entrylevel",
      "excellence",
      "management",
      "ote",
      "pipeline",
      "problem",
      "representative",
      "research",
      "sales",
      "salesforce",
      "selfmotivation",
      "solving",
      "teamwork",
      "to"
    ]
  },
  {
    "job_id": "3885871087",
    "job_title": "Director of Business Development",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "INDUSTRY | SOFTWARE - SAASLOCATION | RESTON, VASALARY | $120,000FIRST YEAR POTENTIAL | $165,000BENEFITS | HEALTH, DENTAL, OPTICAL, 401K, TUITION REIMBURSEMENTREFERENCE | 004405\nJOB SUMMARYNORTHERN VIRGINIA BASED SAAS COMPANY IS SEEKING A DIRECTOR OF BUSINESS DEVELOPMENT TO MANAGE A TEAM OF 10-15 SALES DEVELOPMENT REPRESENTATIVES. THIS COMPANY HAS SEEN EXPLOSIVE ORGANIC GROWTH IN THE LAST SEVERAL YEARS AND DOUBLED THE SIZE OF THE LEAD GENERATION TEAM QUALIFIED CANDIDATES WILL HAVE AT LEAST 3+ CURRENT YEARS OF DIRECTING AND MANAGING A BUSINESS DEVELOPMENT TEAM (BDR/SDR) AND BRING TO THE TABLE STRONG TRAINING AND DEVELOPMENT SKILLS. THIS COMPANY’S PRODUCT SUITE IS FAIRLY TECHNICAL AND REQUIRES THE ABILITY TO UNDERSTAND AND PRESENT A COMPLEX SOLUTION. POSITION IS FULLY REMOTE AND OFFERS A COMPETITIVE SALARY, INCENTIVES, GREAT BENEFITS AND A PHENOMENAL CULTURE. BASE IS FLEXIBLE DEPENDING ON EXPERIENCE BUT IDEALLY IN THE $110-125K RANGE WITH A TARGET EARNINGS OF $140-165K YEAR ONE. READY TO HIRE IMMEDIATELY!!!",
    "job_skill_set": [
      "business development",
      "team management",
      "sales development",
      "training and development",
      "technical understanding",
      "solution presentation",
      "leadership",
      "communication",
      "problem solving",
      "adaptability",
      "collaboration"
    ],
    "short_keywords": [
      "adaptability",
      "and",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "development",
      "director",
      "leadership",
      "management",
      "of",
      "presentation",
      "problem",
      "sales",
      "solution",
      "solving",
      "team",
      "technical",
      "training",
      "understanding"
    ]
  },
  {
    "job_id": "3901476299",
    "job_title": "Senior New Business Development Executive",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "JOB DESCRIPTION TITLE: SENIOR NEW BUSINESS DEVELOPMENT EXECUTIVE (REMOTE HOME OFFICE BASED)REPORTS TO: CHIEF OPERATING OFFICER PRIMARY ROLE:AS A SENIOR NEW BUSINESS DEVELOPMENT EXECUTIVE YOU WILL BE RESPONSIBLE FOR DRIVING REVENUE AND GROSS PROFIT GROWTH – ESTABLISHING AND GROWING A BOOK OF BUSINESS. LEVERAGING YOUR EXTENSIVE EXPERIENCE IN THE IT STAFFING INDUSTRY AND YOUR ESTABLISHED NETWORK OF CONTACTS, YOUR ROLE IS IDENTIFYING, PURSUING, AND CLOSING NEW BUSINESS ACCOUNTS.DUTIES:· UTILIZE YOUR EXISTING NETWORK OF CONTACTS AND RELATIONSHIPS TO GENERATE NEW BUSINESS LEADS AND OPPORTUNITIES· BUILD AND MAINTAIN STRONG RELATIONSHIPS WITH KEY DECISION-MAKERS AND STAKEHOLDERS WITHIN TARGET ORGANIZATIONS TO UNDERSTAND THEIR STAFFING NEEDS AND POSITION OUR COMPANY AS THE PREFERRED STAFFING PARTNER· COLLABORATE WITH THE INTERNAL RECRUITMENT TEAMS TO DEVELOP CUSTOMIZED STAFFING SOLUTIONS TAILORED TO MEET CLIENT SPECIFIC REQUIREMENTS· PROVIDE REGULAR UPDATES ON SALES ACTIVITIES, PIPELINE STATUS, AND MARKET INSIGHTS TO SENIOR MANAGEMENT, LEVERAGING CRM TOOLS AND REPORTING MECHANISMS· DRIVE BUSINESS EXPANSION OPPORTUNITIES WITHIN CLIENT ACCOUNTS BY IDENTIFYING ADDITIONAL STAFFING NEEDS AND CROSS-SELLING COMPLEMENTARY SERVICES (PROJECT DEPLOYMENT AND FIELD DISPATCH SERVICES)· LEAD NEGOTIATIONS, PREPARE PROPOSALS, AND CLOSE DEALS TO SECURE NEW BUSINESS CONTRACTS· PERFORM ADDITIONAL DUTIES AS NEEDED WHAT YOU HAVE TO OFFER: · HIGHLY MOTIVATED, SELF-STARTER WITH A RESULTS-ORIENTED MINDSET BUT ALSO WILLING TO LEARN, TAKE DIRECTION AND OFFER INPUT AND IDEAS AS A POSITIVE TEAM PLAYER· 5 OR MORE YEARS OF PROVEN SUCCESS IN NEW BUSINESS DEVELOPMENT WITHIN THE IT STAFFING INDUSTRY, WITH A DEMONSTRATED TRACK RECORD OF EXCEEDING SALES TARGETS· EXTENSIVE NETWORK OF CONTACTS AND RELATIONSHIPS WITHIN THE IT INDUSTRY, PARTICULARLY WITH HIRING MANAGERS, TA/HR MANAGERS, DIRECTORS AND VP, AND OTHER DECISION-MAKERS / INFLUENCERS· PROVEN ABILITY TO DEVELOP AND EXECUTE STRATEGIC SALES PLANS, PRIORITIZE TASKS, AND MANAGE TIME EFFECTIVELY· STRONG FOLLOW-UP - UNDERSTANDS TASK OWNERSHIP AND OVERCOMING CHALLENGES TO ENSURE SUCCESS · A COMPETITIVE MINDSET TO ACHIEVE HIGH RESULTS AND INDIVIDUAL / TEAM / COMPANY GOALS · EXCELLENT WRITTEN & ORAL COMMUNICATION· ATTENTION TO DETAIL FOR DATA TRACKING AND REPORTING · PROFICIENCY IN CRM SOFTWARE, MICROSOFT OFFICE SUITE (PRIMARILY EXCEL, WORD AND POWERPOINT), EXPERIENCE WITH GOOGLE SUITE – SHEETS, GMAIL· FOCUSED AND ABLE TO WORK INDEPENDENTLY FROM REMOTE HOME OFFICE · WILLINGNESS TO TRAVEL AS NEEDED WHAT YOU WILL RECEIVE:· COMPETITIVE SALARY PLUS COMMISSIONS· COMPANY LAPTOP & PHONE TO WORK REMOTELY· ACCESS TO MEDICAL INSURANCE, VISION, DENTAL, GROUP & INDIVIDUAL LIFE INSURANCE, DISCOUNT PROGRAMS & 401K· UNLIMITED PTO FOR THOSE WHO QUALIFY WITH A VACATION BONUS ONCE ELIGIBLE· WEEKLY COMMISSIONS· TRAINING AND CAREER GROWTH F2ONSITE IS AN EQUAL OPPORTUNITY EMPLOYER. WE DO NOT DISCRIMINATE AGAINST ANY PERSON DUE TO RACE, CREED, RELIGION, SEXUAL ORIENTATION, CULTURE, OR GENDER IDENTITY. MILITARY VETERANS ARE ENCOURAGED TO APPLY. VISIT US AT WWW.F2ONSITE.COM",
    "job_skill_set": [
      "IT staffing",
      "business development",
      "Microsoft Office Suite",
      "sales strategy",
      "data tracking",
      "negotiation",
      "communication",
      "relationship building",
      "self-motivation",
      "teamwork",
      "time management",
      "problem solving",
      "attention to detail",
      "competitive mindset",
      "CRM software",
      "Google Suite"
    ],
    "short_keywords": [
      "attention",
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "competitive",
      "crm",
      "data",
      "detail",
      "development",
      "executive",
      "google",
      "it",
      "management",
      "microsoft",
      "mindset",
      "negotiation",
      "new",
      "office",
      "problem",
      "relationship",
      "sales",
      "selfmotivation",
      "senior",
      "software",
      "solving",
      "staffing",
      "strategy",
      "suite",
      "teamwork",
      "time",
      "to",
      "tracking"
    ]
  },
  {
    "job_id": "3884890945",
    "job_title": "Business Development",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "QUANTUM PAIN AND ORTHOPEDICS IS A PREMIER OUTPATIENT CLINICAL NETWORK SERVING THE SAN ANTONIO AND AUSTIN, TX AREAS. OUR SPECIALTY IS COMBINING HIGH QUALITY HEALTHCARE WITH COMPASSION AND EXCELLENCE. QPO STRIVES TO CREATE A TEAM THAT HIGHLIGHTS OUR CULTURE OF DIVERSITY, ETHICS, AND COLLABORATION. COME JOIN OUR TEAM AT QUANTUM PAIN AND ORTHOPEDICS AND UNCOVER THE EXCELLENCE IN YOU!\n\nOUR TEAM AT QUANTUM PAIN AND ORTHOPEDIC - AUSTIN IS LOOKING TO HIRE A BUSINESS DEVELOPMENT TO JOIN OUR MARKETING DEPARTMENT! THIS CANDIDATE WILL REPRESENT THE COMPANY AT COMMUNITY-RELATED ACTIVITIES, MARKET, ESTABLISH, NURTURE, AND SOLIDIFY REFERRAL RELATIONSHIPS ON BEHALF OF THE COMPANY.\n\nESSENTIAL FUNCTIONS\n\nIDENTIFY AND ESTABLISH RELATIONSHIPS WITH COMMUNITY GROUPS, HEALTHCARE PROFESSIONALS, PHYSICIANS, AND CLINICSCREATE AND DELIVER MARKETING MATERIALS TO EXISTING REFERRALS AND NEW CONTACTSHELP PLAN, COORDINATE AND EXECUTE THE COMPANY'S MARKETING EFFORTS, INCLUDING ATTENDING COMMUNITY EVENTS, TRADESHOWS AND MARKETING EVENTSDELIVERS MEALS OR SNACKS TO CURRENT AND PROSPECTIVE NEW BUSINESS ACCOUNTSMAINTAIN ACCURATE SPREADSHEETS & DOCUMENTATION OF ALL CONTACTS; EXISTING AND NEWGENERATE PERFORMANCE AND REFERRAL REPORTS FOR UPPER MANAGEMENTPROVIDE EDUCATION AND COMMUNICATION TO THE COMPANY FOR BOTH NEW AND EXISTING BUSINESS RELATIONSHIPSSERVE AS A RESOURCE PERSON FOR PROCESSING PURPOSES REGARDING FORMS, PROCEDURES, AND WORKFLOW FOR EXISTING AND NEW BUSINESS RELATIONSHIPSTROUBLESHOOT ANY ISSUES, PROBLEMS & COMPLAINTS WITH EXISTING & NEW BUSINESS RELATIONSHIPSPERFORM MARKETING DEMOGRAPHICS OF EACH COMPANY WITH CELL PHONE NUMBERS FOR MANAGERS, PHYSICIANS, ATTORNEYS & CASE MANAGERSADHERES TO THE COMPANY STANDARDS OF BUSINESS CONDUCTREPORTS ACCIDENTS PROMPTLY AND FOLLOWS THE POLICY AND PROCEDURES SET FORTH BY THE CENTERPERFORMS OTHER JOB DUTIES AS ASSIGNED BY THE CEO/COO AND TEAM LEAD\n\nKNOWLEDGE, SKILLS, AND ABILITIES\n\nMUST BE ENTHUSIASTIC AND ADAPTABLEFLUENT IN MICROSOFT OFFICE SUITE AND/OR OTHER ELECTRONIC FORMATS, IE: SHAREPOINTINDEPENDENT THINKING & DETAIL ORIENTED WITH THE ABILITY TO TRACK DAILY INTERACTIONS WITH ALL BUSINESS RELATIONSHIPSABILITY TO WORK INDEPENDENTLY WITHOUT SUPERVISION ABILITY TO COORDINATE, ANALYZE, OBSERVE, MAKE DECISIONS, AND MEET DEADLINES IN A DETAIL-ORIENTED MANNERABILITY TO SPEAK, READ, WRITE, AND COMMUNICATE EFFECTIVELY AND PROFESSIONALLY \n\nREQUIREMENTS\n\nHIGH SCHOOL DIPLOMA OR EQUIVALENCY1 YEAR'S EXPERIENCE IN MARKETING AVAILABILITY TO WORK EARLY AND LATE DAYS WITH OCCASIONAL WEEKENDS CURRENT TEXAS DRIVER'S LICENSE WITH AN ACCEPTABLE DRIVING RECORD ACCORDING TO COMPANY POLICY\n\nBENEFITS OFFERED\n\n3 MEDICAL PLANS 2 DENTAL PLANS1 VISION PLAN EMPLOYEE ASSISTANCE PROGRAMSHORT AND LONG-TERM DISABILITY INSURANCE BASIC AND VOLUNTARY LIFE WITH AD&D PLAN401(K) WITH A 2-YEAR VESTINGPTO + HOLIDAYS\n\nPLEASE VISIT OUR WEBSITE FOR MORE INFORMATION\n\nHTTPS://WWW.QUANTUMPAINORTHO.COM/\n\nCOMPENSATION TO BE DETERMINED BY THE EDUCATION, EXPERIENCE, KNOWLEDGE, SKILLS, AND ABILITIES OF THE APPLICANT, INTERNAL EQUITY, AND ALIGNMENT WITH MARKET DATA.\n\nJOB POSTED BY APPLICANTPRO",
    "job_skill_set": [
      "Microsoft Office Suite",
      "Marketing",
      "Data Analysis",
      "Documentation",
      "Report Generation",
      "Community Engagement",
      "Relationship Management",
      "Problem Solving",
      "Communication",
      "Adaptability",
      "Independent Thinking",
      "Detail Oriented",
      "Decision Making",
      "Team Collaboration"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "community",
      "data",
      "decision",
      "detail",
      "development",
      "documentation",
      "engagement",
      "generation",
      "independent",
      "making",
      "management",
      "marketing",
      "microsoft",
      "office",
      "oriented",
      "problem",
      "relationship",
      "report",
      "solving",
      "suite",
      "team",
      "thinking"
    ]
  },
  {
    "job_id": "3905886086",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "BUSINESS DEVELOPMENT MANAGER\nGENERAL DESCRIPTIONTHE PERFORMANCE GROUP, A LEADING REGIONAL PROVIDER OF TEMPORARY AND PROFESSIONAL STAFFING SERVICES, IS SEEKING A QUALIFIED AND DYNAMIC BUSINESS DEVELOPMENT MANAGER TO ADD TO OUR TEAM. THE BUSINESS DEVELOPMENT MANAGER WILL HAVE A PRIMARY FOCUS ON IDENTIFYING PROSPECTIVE CLIENTS, AND GENERATING NEW SALES IN OUR YORK AND LEBANON REGIONS. IDEAL CANDIDATES WILL BLEND AN AGGRESSIVE, SALES-ORIENTED PERSPECTIVE WITH A PERSONABLE, CUSTOMER SERVICE-ORIENTED NATURE.THE ABILITY TO WORK EFFECTIVELY WITHIN A TEAM STRUCTURE IS A MUST!\nESSENTIAL JOB FUNCTIONSPROSPECTIVE CLIENTS THROUGH ONLINE RESEARCH, DATABASE SOURCING, PROACTIVE OUTREACH AND COLD-CALLINGCOMMUNICATION AND DEVELOPING RELATIONSHIPS WITH PROSPECTIVE CLIENT DECISION-MAKERS TO COMMUNICATE AND PROMOTE COMPANY SERVICES, PRODUCTS, AND PROMOTIONAL OFFERSPROSPECTIVE AND EXISTING CLIENT FILES IN OUR SYSTEM AND DOCUMENTING KEY INTERACTIONSTAILORED MARKETING MATERIALS AND STRATEGIES TO EFFECTIVELY PROMOTE COMPANY SALESRELEVANT COMPANY SOCIAL MEDIA ACCOUNTS TO PROVIDE CONSISTENT PRESENCE AND TARGETED POSTINGS\nREQUIREMENTS/QUALIFICATIONSYEARS’ EXPERIENCE IN A SALES OR CUSTOMER SERVICE ROLE PREFERREDEXPERIENCE IN THE STAFFING INDUSTRY IS A PLUSTO BALANCE OFFICE HOURS AND FIELD TIME, FOCUSING 50%+ OF THEIR DAY IN THE FIELDIN MICROSOFT WORD, EXCEL, AND OUTLOOKWRITTEN COMMUNICATION SKILLS. MUST BE ABLE TO PRODUCE PROFESSIONAL E-MAILS AND ONLINE COMMUNICATIONS FREE OF GRAMMATICAL AND/OR SPELLING ERRORSVERBAL COMMUNICATION SKILLS. CANDIDATES MUST HAVE THE ABILITY TO COMMUNICATE EFFECTIVELY AND COMFORTABLY BY PHONE, AMONG VARIOUS LEVELS OF AN ORGANIZATIONKNOWLEDGE OF SOCIAL MEDIA PLATFORMS AND PRACTICES\n\n\n\n\nSALARY/COMPENSATIONBASE SALARY + MONTHLY COMMISSIONSBONUSES AND ANNUAL INCENTIVESWITH COMPANY MATCHINSURANCE (MEDICAL/DENTAL/VISION)LIFE INSURANCESICK TIME, AND PAID HOLIDAYS\nLOCATIONTHE BUSINESS DEVELOPMENT MANAGER WILL OPERATE FROM OUR YORK AND LEBANON LOCATIONS.",
    "job_skill_set": [
      "sales",
      "customer service",
      "communication",
      "teamwork",
      "relationship building",
      "problem solving",
      "adaptability",
      "Microsoft Word",
      "Microsoft Excel",
      "Microsoft Outlook",
      "social media",
      "cold-calling",
      "database sourcing",
      "online research"
    ],
    "short_keywords": [
      "adaptability",
      "building",
      "business",
      "businessdevelopment",
      "coldcalling",
      "communication",
      "customer",
      "database",
      "development",
      "excel",
      "manager",
      "media",
      "microsoft",
      "online",
      "outlook",
      "problem",
      "relationship",
      "research",
      "sales",
      "service",
      "social",
      "solving",
      "sourcing",
      "teamwork",
      "word"
    ]
  },
  {
    "job_id": "3895543706",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "COMPANY DESCRIPTION\n\nFRESHWORKS MAKES IT FAST AND EASY FOR BUSINESSES TO DELIGHT THEIR CUSTOMERS AND EMPLOYEES. WE DO THIS BY TAKING A FRESH APPROACH TO BUILDING AND DELIVERING SOFTWARE THAT IS AFFORDABLE, QUICK TO IMPLEMENT, AND DESIGNED FOR THE END USER. HEADQUARTERED IN SAN MATEO, CALIFORNIA, FRESHWORKS HAS A GLOBAL TEAM OPERATING FROM 13 GLOBAL LOCATIONS TO SERVE MORE THAN 65,000 COMPANIES -- FROM STARTUPS TO PUBLIC COMPANIES – THAT RELY ON FRESHWORKS SOFTWARE-AS-A-SERVICE TO ENABLE A BETTER CUSTOMER EXPERIENCE (CRM, CX) AND EMPLOYEE EXPERIENCE (ITSM).\n\nFRESHWORKS’ CLOUD-BASED SOFTWARE SUITE INCLUDES FRESHDESK (OMNI-CHANNEL CUSTOMER SUPPORT), FRESHSALES (SALES AUTOMATION), FRESHMARKETER (MARKETING AUTOMATION), FRESHSERVICE (IT SERVICE DESK), FRESHCHAT (AI-POWERED BOTS), SUPPORTED BY NEO, OUR UNDERLYING PLATFORM OF SHARED SERVICES.\n\nFRESHWORKS IS FEATURED IN GLOBAL NATIONAL PRESS INCLUDING CNBC, FORBES, FORTUNE, BLOOMBERG AND HAS BEEN A BUILTIN BEST PLACE TO WORK IN SAN FRANCISCO AND DENVER FOR THE LAST 3 YEARS. OUR CUSTOMER RATINGS HAVE EARNED FRESHWORKS PRODUCTS TRUSTRADIUS TOP RATED SOFTWARE RATINGS AND G2 BEST OF AWARDS FOR BEST FEATURE SET, BEST VALUE FOR THE PRICE AND BEST RELATIONSHIP.\n\nJOB DESCRIPTION\n\nAS A BUSINESS DEVELOPMENT REPRESENTATIVE WITH FRESHWORKS, YOU WILL PLAY A CRUCIAL ROLE IN OUR COMPANY'S GROWTH BY DRIVING REVENUE THROUGH STRATEGIC OUTREACH AND RELATIONSHIP BUILDING. YOU WILL BE RESPONSIBLE FOR IDENTIFYING AND ENGAGING WITH POTENTIAL CLIENTS, QUALIFYING LEADS, AND ASSISTING IN THE CONVERSION OF PROSPECTS INTO CUSTOMERS.\n\nWHAT YOU'LL DO: \n\nIDENTIFY AND TARGET POTENTIAL CLIENTS THROUGH VARIOUS RESEARCH METHODSCONDUCT COLD AND WARM OUTREACH TO PROSPECTS VIA PHONE, EMAIL, AND SOCIAL MEDIACONDUCT HIGH-LEVEL CONVERSATIONS WITH C-LEVEL EXECUTIVES AND PROSPECT ACCOUNTSQUALIFY LEADS AND SET UP MEETINGS FOR YOUR ACCOUNT EXECUTIVE DEVELOP A DEEP UNDERSTANDING OF OUR PRODUCTS AND SERVICES TO EFFECTIVELY COMMUNICATE THEIR VALUE TO PROSPECTSKEEP ACCURATE RECORDS OF ALL INTERACTIONS AND ACTIVITIES IN OUR CRM SYSTEMMEET OR EXCEED MONTHLY GOALS \n\nPLEASE NOTE THIS ROLE IS STRICTLY IN-PERSON (5 DAYS/WEEK) FROM OUR DENVER OFFICE (1401 LAWRENCE ST.)\n\nQUALIFICATIONS\n\nWHAT YOU'LL BRING: \n\n1-2 YEARS EXPERIENCE IN BUSINESS DEVELOPMENT, SALES, OR RELATED ROLEEXPERIENCE RESEARCHING, PROSPECTING, AND COLD-CALLING ACCOUNTSABILITY TO WORK IN A FAST-PACED ENVIRONMENT EXCELLENT COMMUNICATION AND INTERPERSONAL SKILLSSTRONG PROBLEM-SOLVING AND NEGOTIATION ABILITIESSELF-MOTIVATED AND TARGET-DRIVE WITH A PASSION FOR ACHIEVING RESULTSKNOWLEDGE OF CRM SOFTWARE IS A PLUS\n\nWHAT WE OFFER: \n\nCOMPREHENSIVE BENEFITS INCLUDING MEDICAL, DENTAL, VISION, DISABILITY, AND LIFE INSURANCEEMPLOYEE STOCK PURCHASE PROGRAM (ESPP)FLEXIBLE PTOCONTINUOUS TRAINING AND CHANCES FOR PROFESSIONAL GROWTHA SUPPORTIVE AND COLLABORATIVE TEAM ATMOSPHEREHEALTH AND WELL-BEING PERKS (FREE ONSITE GYM)PROSPECTS FOR CAREER ADVANCEMENT AS OUR COMPANY GROWS \n\nADDITIONAL INFORMATION\n\nCOLORADO PAY RANGE: THE PAY RANGE FOR THIS POSITION IS $68,000 - $81,000. THIS RANGE IS INCLUSIVE OF THE BASE SALARY + COMMISSION\n\nCOMPENSATION OFFERED WILL BE DETERMINED BY FACTORS SUCH AS LOCATION, LEVEL, JOB-RELATED KNOWLEDGE, SKILLS, AND EXPERIENCE. CERTAIN ROLES MAY BE ELIGIBLE FOR INCENTIVE COMPENSATION.\n\nAT FRESHWORKS, WE ARE CREATING A GLOBAL WORKPLACE THAT ENABLES EVERYONE TO FIND THEIR TRUE POTENTIAL, PURPOSE, AND PASSION IRRESPECTIVE OF THEIR BACKGROUND, GENDER, RACE, SEXUAL ORIENTATION, RELIGION AND ETHNICITY. WE ARE COMMITTED TO PROVIDING EQUAL OPPORTUNITY FOR ALL AND BELIEVE THAT DIVERSITY IN THE WORKPLACE CREATES A MORE VIBRANT, RICHER WORK ENVIRONMENT THAT ADVANCES THE GOALS OF OUR EMPLOYEES, COMMUNITIES AND THE BUSINESS.",
    "job_skill_set": [
      "CRM software",
      "sales strategy",
      "research methods",
      "communication",
      "interpersonal skills",
      "problem solving",
      "self-motivation",
      "target-driven",
      "cold calling",
      "lead qualification",
      "negotiation"
    ],
    "short_keywords": [
      "business",
      "businessdevelopment",
      "calling",
      "cold",
      "communication",
      "crm",
      "development",
      "interpersonal",
      "lead",
      "methods",
      "negotiation",
      "problem",
      "qualification",
      "representative",
      "research",
      "sales",
      "selfmotivation",
      "skills",
      "software",
      "solving",
      "strategy",
      "targetdriven"
    ]
  },
  {
    "job_id": "3902810060",
    "job_title": "Business Development (1+ years sales exp req)",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "BUSINESS DEVELOPMENT (1+ YEARS SALES EXP REQ)LOCATION: HOUSTON, TXSALARY: $55,000 BASE + UNCAPPED COMMISSION + BENEFITSBENEFITS: VISION, DENTAL, LIFE INSURANCE, 401K W/ MATCH, FSA, PTO, HOLIDAYSTRAVEL: 50 MILES FROM THE HEART OF HOUSTON- MILEAGE REIMBURSEMENTJOB TYPE: FULL-TIME & ONSITETYPICAL HOURS: M-F, 8 AM – 5 PMSTART DATE: ASAPSPONSORSHIP IS NOT AVAILABLE\nBUSINESS DEVELOPMENT (1+ YEARS SALES EXP REQ) DESCRIPTION\nJOIN AN EXCITING OPPORTUNITY WITH OUR CLIENT IN THE CUTTING-EDGE COMPUTER AND NETWORK SECURITY INDUSTRY. OUR CLIENT IS ON THE LOOKOUT FOR A DYNAMIC BUSINESS DEVELOPMENT REP TO ADD TO THEIR TEAM IN HOUSTON, TX. REPORTING TO THE SALES MANAGER, YOU WILL BE RESPONSIBLE FOR PROSPECTING AND CLOSING NEW CUSTOMER ACCOUNTS, PROJECTS, AND SERVICES WHILE MEETING OR EXCEEDING MONTHLY TARGETS. TO BE SUCCESSFUL IN THE ROLE, YOU MUST BE COMFORTABLE WITH TECHNOLOGY, ENJOY CLIENT NURTURING, AND NOT BE AFRAID TO PICK UP THE PHONE. IF YOU THRIVE IN A FAST-PACED ENVIRONMENT, LOVE EMBRACING NEW TECHNOLOGY, AND EXCEL AT JUGGLING MULTIPLE DEALS WHILE FOSTERING STRONG CUSTOMER RELATIONSHIPS, THIS IS THE PERFECT FIT FOR YOU. DON'T MISS THE CHANCE TO BE PART OF A WELL-ESTABLISHED COMPANY DEDICATED TO FOSTERING A FANTASTIC COMPANY CULTURE. APPLY NOW FOR AN ADVENTURE IN TECH EXCELLENCE!\nBUSINESS DEVELOPMENT (1+ YEARS SALES EXP REQ) RESPONSIBILITIES\n• FOLLOW THE COMPANY SALES STRATEGY• PROSPECT NEW BUSINESS• MAINTAIN ACCURATE ACCOUNT DETAILS IN PROPRIETARY CRM/CMS• SCHEDULE FOLLOW-UP MEETINGS AND TECHNICAL ASSESSMENTS• DEVELOP SALES PROPOSALS AND PRESENTATIONS • CLOSE PROJECTS, OBTAIN PROPER DOCUMENTATION, AND PAYMENT• TRAVEL TO LOCAL CUSTOMER SITES• MEET OR EXCEED MONTHLY REVENUE GOALS\nBUSINESS DEVELOPMENT (1+ YEARS SALES EXP REQ) QUALIFICATIONS\n• 1+ YEARS OF SALES EXPERIENCE REQUIRED• CRM OR CMS EXPERIENCE REQUIRED• PROFICIENCY IN MICROSOFT OFFICE SUITE REQUIRED• TRAVEL EXPECTED 40% OF THE WORKWEEK AROUND HOUSTON",
    "job_skill_set": [
      "sales",
      "CRM",
      "Microsoft Office Suite",
      "prospecting",
      "account management",
      "presentations",
      "customer service",
      "project management",
      "communication",
      "client nurturing",
      "time management",
      "adaptability",
      "relationship building",
      "problem solving",
      "teamwork",
      "self-motivation",
      "sales proposals"
    ],
    "short_keywords": [
      "1",
      "account",
      "adaptability",
      "building",
      "business",
      "businessdevelopment",
      "client",
      "communication",
      "crm",
      "customer",
      "development",
      "exp",
      "management",
      "microsoft",
      "nurturing",
      "office",
      "presentations",
      "problem",
      "project",
      "proposals",
      "prospecting",
      "relationship",
      "req",
      "sales",
      "selfmotivation",
      "service",
      "solving",
      "suite",
      "teamwork",
      "time",
      "years"
    ]
  },
  {
    "job_id": "3904972225",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "AT TAG, WE LOVE WHAT WE DO AND PRIDE OURSELVES ON AN AUTHENTIC CULTURE BUILT ON OUR CORE VALUES OF INTEGRITY, INNOVATION, SUSTAINABILITY, GROWTH, AND ACCOUNTABILITY.\nWE ARE A LEADING CREATIVE PRODUCTION AND SOURCING PARTNER TO BRANDS AND AGENCIES AND WE HAVE OVER 50 YEARS OF MARKETING EXECUTION EXPERIENCE, WORKING WITH THE WORLD’S BEST BRANDS. WE ARE CREATIVE DIRECTORS, GRAPHIC DESIGNERS, CGI ARTISTS, WRITERS, PHOTOGRAPHERS, PRODUCERS, LINGUISTS, OPERATIONS EXPERTS, AND ACCOUNT MANAGERS, COMING TOGETHER TO DELIVER IMPACTFUL CONTENT WITH CRAFT, SCALE, AND SPEED.\nOUR MARKETING EXPERTISE DIGS DEEP INTO INDUSTRY SECTORS AND MARKETING CHANNELS, TO HELP OUR CLIENTS STAND OUT AND SELL MORE, EVERYWHERE.\nAS PEOPLE, WE ARE COLLABORATORS AND MAKERS, LEARNERS, AND LISTENERS, WITH A STRONG COMMITMENT TO DIVERSITY, EQUITY AND INCLUSION, SERVICE, AND WORK-LIFE HARMONY.\nTHE PRIMARY PURPOSE OF A SR BUSINESS DEVELOPMENT DIRECTOR AT TAYLOR JAMES IS TO DRIVE SALES BY BUILDING LONG-TERM AND PROFITABLE RELATIONSHIPS WITH NEW CUSTOMERS AS WELL AS GROWING REVENUES FROM EXISTING CLIENTS. AS PART OF THE BUSINESS DEVELOPMENT TEAM, YOU ARE RESPONSIBLE FOR ELEVATING OUR MARKET POSITION WITHIN YOUR TARGET SECTOR (ADVERTISING AGENCIES AND BRAND/ADVERTISERS) AND TERRITORY (EAST COAST & MID-WEST) IN ORDER TO SECURE PROFITABLE, LONG-TERM CLIENT RELATIONSHIPS FOR THE BUSINESS.\nPROACTIVE ENGAGEMENT IN CORE BUSINESS DEVELOPMENT ACTIVITIES IS REQUIRED TO REACH YOUR SET KPI’S AND TARGETS. STRONG COMMUNICATION SKILLS, BOTH VERBAL AND WRITTEN, AND TEAMWORK ARE ALSO A VITAL PART OF THIS ROLE. A CONSULTATIVE SALES APPROACH IS REQUIRED TO UNCOVER OPPORTUNITIES, WHICH ARE THEN MATCHED WITH THE RELEVANT TAYLOR JAMES SERVICE OFFERING.\nJOB QUALIFICATIONS• UNDERGRADUATE DEGREE OR COLLEGE DIPLOMA IN BUSINESS, MARKETING OR A RELATED FIELD (A COMBINATION OF EDUCATION AND EXPERIENCE CAN BE SUBSTITUTED)• 5+ YEARS’ EXPERIENCE IN BUSINESS DEVELOPMENT WITHIN THE MARKETING, CREATIVE OR PRODUCTION INDUSTRIES IS ESSENTIAL, IDEALLY SELLING TO BRANDS/ADVERTISERS AND ADVERTISING AGENCIES.• PROVEN TRACK RECORD OF EXCEEDING CUSTOMER SATISFACTION AND SALES RESULTS• URGENCY DRIVEN CRITICAL THINKING, DECISION MAKING AND DRIVE• EXCELLENT COMMUNICATION, NEGOTIATION AND ORAL PRESENTATION SKILLS.• STRONG PROFICIENCY IN MICROSOFT OFFICE - EXCEL, WORD, OUTLOOK, POWERPOINT• EXPERIENCE WORKING WITH SALESFORCE/ZOHO IS REQUIRED\nJOB DUTIES(* DENOTES AN “ESSENTIAL FUNCTION”)• *SALES STRATEGY – DEVISE AND IMPLEMENT THE SALES STRATEGY AND ADAPT ACCORDINGLY IN ORDER TO REACH OUR REVENUE AND EBITDA GOALS.• *REVENUE GENERATION - MEETING OR EXCEEDING MONTHLY AND ANNUAL REVENUE TARGETS THROUGH NURTURING NEW BUSINESS OPPORTUNITIES IN BOTH PROSPECTIVE AND EXISTING CLIENTS• *REP CHANNEL – WORKING WITH OUR INDEPENDENT SALES REPS UNDER THE DIRECTION OF VP OF BUSINESS DEVELOPMENT , HOP AND ECD. ENSURING THAT THEY ARE GENERATING BOARD FLOW AND SUITABLE OPPORTUNITIES FOR TAYLOR JAMES AS WELL AS KEEPING THEM UP TO DATE ON OUR SERVICES.• *SALES – DEALING WITH INITIAL CLIENT ENQUIRIES AND THEN WORKING ALONGSIDE THE CREATIVE/PRODUCTION TEAM TO DEVELOP, NEGOTIATE AND CLOSE A WINNING PROPOSAL THAT IS ALSO PROFITABLE FOR THE BUSINESS.• * MEETINGS – CONSISTENTLY ARRANGING CLIENT MEETINGS/SCREENINGS WITH RIGHT LEVELS OF CONTACT THROUGH LEAD GENERATION, COLD CALLING AND EMAILS.• * PRESENTING – OBTAINING, PLANNING, PREPARING AND DELIVERING ENGAGING PRESENTATIONS TO CLIENTS IN BOTH A ONE TO ONE AND LARGER GROUP ENVIRONMENT.• *COMMUNICATION – GOOD AT QUESTIONING, PROBING AND LISTENING TO UNCOVER KEY CLIENT CHALLENGES AND THEN DEMONSTRATING HOW OUR PRODUCTS AND SERVICES MEET THOSE NEEDS• *CLIENT MANAGEMENT – ENSURING OUR CLIENTS ARE GETTING BEST SERVICE FROM US, WHICH LEADS TO REPEAT, LONGER-TERM BUSINESS. KEEPING CUSTOMERS UP TO DATE ON OUR PRODUCT AND SERVICE OFFERING AS WELL AS WORKING WITH OUR PRODUCTION AND CREATIVE TEAMS TO DRAW UP BIDS, SCHEDULES AND KEEP PROJECTS ON TRACK.• *NETWORKING – UTILIZING INDUSTRY EVENTS, PRESS AND CONTACTS TO STAY INFORMED OF CURRENT MARKET TRENDS AND RELAYING THESE BACK TO MANAGEMENT AND MARKETING FOR DEVELOPMENT.\nPER STATE REQUIREMENTS, THIS POSTING REFLECTS THE SALARY RANGE FOR THIS POSITION FOR THE FOLLOWING:NEW YORK BASED INDIVIDUAL: $130,000 MINIMUM $140,000 MAXIMUM PER ANNUM\nCOMPENSATION VARIES DEPENDING ON JOB-RELATED FACTORS SUCH AS EXPERIENCE, RESPONSIBILITIES, AND BUSINESS NEEDS. FOR ALL OTHER STATES, PLEASE INQUIRE WITH THE TAG TALENT ACQUISITION TEAM.\nTHIS IS THE OPPORTUNITY TO WORK IN AN ENVIRONMENT THAT BEST SUITS YOUR NEEDS, FUELED BY FLEXIBLE HOURS AND LOCATIONS, STRONG SUPPORTIVE BENEFITS, CAREER TRAINING AND DEVELOPMENT AND, MOST IMPORTANTLY, AN INCLUSIVE ENVIRONMENT THAT ELIMINATES BARRIERS AND ELEVATES VOICES, GIVING EVERY MEMBER OF THE TAG TEAM AN OPPORTUNITY TO BE SEEN AND HEARD.\nWE’VE MADE A STRONG COMMITMENT TO DIVERSITY AND INCLUSION AND ARE TAKING A STANCE ON EQUALITY IN THE WORKPLACE. WE SUPPORT SUSTAINABILITY, IN OUR ORGANIZATION AND WITH OUR NETWORK OF PARTNERS AND SUPPLIERS.\n\nAS AN ETHICAL EMPLOYER, TAG WILL NEVER ASK JOB APPLICANTS TO PROVIDE PRIVATE, SENSITIVE INFORMATION UPFRONT OR MAKE OFFERS OF EMPLOYMENT CONTINGENT ON FINANCIAL REQUESTS OR RESPONSIBILITIES FROM ANY CANDIDATE.",
    "job_skill_set": [
      "business development",
      "sales strategy",
      "Salesforce",
      "negotiation",
      "presentation skills",
      "customer relationship management",
      "market analysis",
      "revenue generation",
      "lead generation",
      "communication",
      "teamwork",
      "critical thinking",
      "decision making",
      "problem solving",
      "adaptability",
      "listening",
      "networking",
      "creativity",
      "integrity",
      "Microsoft Office"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "business",
      "businessdevelopment",
      "communication",
      "creativity",
      "critical",
      "customer",
      "decision",
      "development",
      "generation",
      "integrity",
      "lead",
      "listening",
      "making",
      "management",
      "manager",
      "market",
      "microsoft",
      "negotiation",
      "networking",
      "office",
      "presentation",
      "problem",
      "relationship",
      "revenue",
      "sales",
      "salesforce",
      "skills",
      "solving",
      "strategy",
      "teamwork",
      "thinking"
    ]
  },
  {
    "job_id": "3895809035",
    "job_title": "Sr Business Development Executive",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ABOUT TELUS INTERNATIONAL\n\nTELUS INTERNATIONAL (NYSE: TIXT) FOCUSES ON THE VALUE OF HUMAN CONNECTION TO DESIGN, BUILD AND DELIVER HIGH-TECH, HIGH-TOUCH CUSTOMER EXPERIENCES POWERED BY NEXT-GEN DIGITAL SOLUTIONS. WITH ALMOST 75,000 TEAM MEMBERS AND DELIVERY CENTERS ACROSS 30 COUNTRIES IN AFRICA, ASIA, NORTH AND CENTRAL AMERICA, AND EUROPE, TELUS INTERNATIONAL EMPOWERS CUSTOMER EXPERIENCE INNOVATION THROUGH DIGITAL ENABLEMENT, SPIRITED TEAMWORK, AGILE THINKING, AND A CARING CULTURE THAT PUTS CUSTOMERS FIRST. THE COMPANY'S SOLUTIONS COVER CUSTOMER EXPERIENCE, CONTENT MODERATION, DIGITAL TRANSFORMATION, IT LIFECYCLE, ADVISORY AND DIGITAL CONSULTING, RISK MANAGEMENT, AND BACK-OFFICE SUPPORT. FUELING ANY STAGE OF COMPANY GROWTH, TELUS INTERNATIONAL PARTNERS WITH SOME OF THE WORLD’S MOST DISRUPTIVE BRANDS FROM FAST-GROWING TECH, FINANCIAL SERVICES AND FINTECH, GAMES, TRAVEL AND HOSPITALITY, HEALTHCARE, AND ICT INDUSTRIES. THE COMPANY SERVES CLIENTS IN OVER 50 LANGUAGES. LEARN MORE AT: TELUSINTERNATIONAL.COM\n\nPOSITION OVERVIEW\n\nTHE CORE PURPOSE OF THE SALES EXECUTIVE ROLE IS TO GENERATE NEW PARTNER OPPORTUNITIES IN COMMUNICATIONS/MEDIA, BFSI, GAMES, AI, DIGITAL OR TECH AND TO CONVERT THOSE OPPORTUNITIES INTO REVENUE-GENERATING PROFITABLE PARTNERSHIPS WITH THE WORLD’S LEADING DISRUPTORS.\n\nPRIMARY RESPONSIBILITIES\n\n “LEADING THE CHARGE” WITHIN THE KEY VERTICALS BY DEVELOPING THE SALES FOR TELUS INTERNATIONAL. DEVELOPING OPPORTUNITIES FROM ZERO TO CLOSE, THROUGH THE CYCLE FROM INITIAL DISCOVERY TO SOLUTION SCOPING AND DEVELOPMENT, PROPOSAL DEVELOPMENT, NEGOTIATION AND CONTRACTING.  CREATIVELY SOURCING ACCESS TO KEY TARGET CLIENTS THROUGH NETWORKING, REFERRALS, EVENTS, MARKETING COLLABORATIONS, OUTBOUND PROSPECTING, ECO-SYSTEM AND CREATIVE IDEAS  TO IDENTIFY, BUILD AND DEVELOP A NETWORK OF KEY BUSINESS STAKEHOLDERS, DECISION MAKERS AND INFLUENCERS IN TARGET AND EXISTING MARKETS  USING INSIGHT BASED SELLING TECHNIQUES BY IDENTIFYING CHALLENGES WITHIN PROSPECTIVE TARGET PARTNER CUSTOMER OPERATIONS AND BUSINESS MODELS TO GAIN ACCESS TO KEY STAKEHOLDERS FOR DEEPER DISCUSSIONS ON HOW TELUS INTERNATIONAL CAN SOLVE THE PROBLEMS  TELUS INTERNATIONAL AIMS TO OWN THE CUSTOMER OPERATIONS MARKET WITH DISRUPTIVE “SCALE-UPS” SO RAISING AND MAINTAINING PROFILE WITHIN THE START-UP AND SCALE-UP COMMUNITIES IN KEY MARKETS WILL BE A KEY ASPECT OF THE ROLE  OUR CLIENTS RANGE FROM START-UPS TO SCALE-UPS AND LARGER MATURE INNOVATORS AND YOU WILL SEAMLESSLY ADAPT TO THE DISTINCT NEEDS AND SOLUTIONS REQUIRED AND THE VARIATION OF BUYING PROCESSES AT EACH STAGE OF MATURITY.  YOU WILL BE SELLING MULTI-YEAR BPO CONTRACTS FOR CX, TECHNICAL SUPPORT, SALES FUNNEL OPERATIONS, COMMUNITY, TRUST, SAFETY, AI AND RISK AND ALSO AUGMENTED OPERATIONS  SOURCING, SCOPING AND CLOSING IS PART IF THE ROLE  WE WILL ALSO BE TRACKING REVENUE BUILD UP BY QUARTER, WHICH IS A NEW ASPECT OF OUR PLANNING SO IT’S VERY IMPORTANT THAT YOU ARE CONSIDERING COVERING DEALS TO HIT THE TARGETS  CREATIVELY AND INTENTIONALLY CAPTURING MARKET INTELLIGENCE FOR THE GREATER GOOD OF TELUS INTERNATIONAL TO INCLUDE AUTOMATION BEHAVIOURS, BUYING PROCESS, DECISION MAKING PROCESS, STAKEHOLDER NEEDS, JOBS TO BE DONE, CONSUMER BEHAVIOUR, ECO-SYSTEM INTELLIGENCE AND COMPETITIVE INTELLIGENCE.  CRAFTING DELIVERABLE SOLUTIONS TO SOLVE THE SPECIFIC CHALLENGES BEING FACED BY PROSPECTIVE CLIENTS.  THESE IDENTIFIED OPPORTUNITIES SHOULD BE TRACKED THROUGH THE PIPELINE AND IN SALESFORCE. WE NEED TO BE SEEING PROGRESS FOR THESE OPPORTUNITIES THROUGH THE FUNNEL AND WE NEED TO SEE THE ACTIONS TO GATHER THE KEY INFORMATION. THE REPORTING OF THE DEALS IS YOUR RESPONSIBILITY. \n\n\nSKILLS & ABILITIES\n\n EXPERIENCED IN DEVELOPING, LEADING AND INFLUENCING C-LEVEL DISCUSSIONS WITH TARGET CLIENTS.  RESOURCEFUL ABILITY TO ACCESS TARGET CLIENT ORGANIZATIONS INTERNATIONALLY TO BUILD RELATIONSHIPS.  YOU WILL HAVE A CURIOSITY TO UNCOVER THE CHALLENGES BEING FACED BY TARGET CLIENTS AND A PROBLEM-SOLVING ABILITY TO DEVELOP A SOLUTION IN REAL-TIME  COMMERCIALLY ASTUTE WITH AN INTUITIVE UNDERSTANDING OF THE STAGE OF A PROSPECT’S DECISION-MAKING PROCESS AND THE STEPS NECESSARY TO MOVE THEM THROUGH THEIR DECISION MAKING PROCESS. AN UNDERSTANDING OF HOW TO EDUCATE CLIENTS ON HOW TO MAKE THE DECISION IS OF RELEVANCE FOR “FIRST TIME OUTSOURCERS”.  STRONG EXPERIENCE AND COMPETENCY IN “CLOSING” DEALS PRIORITIZATION OF TASKS THROUGH LOGICAL ANALYSIS ABILITY TO MAP STAKEHOLDERS AND TO NETWORK WITHIN A TARGET CLIENT ORGANIZATION  DISCIPLINED PROGRESSION AND REPORTING OF OPPORTUNITIES  NATURAL INTEREST IN CAPTURING INTELLIGENCE AND SHARING WITH INTERNAL TEAMS TO ENHANCE THE OVERALL DEVELOPMENT OF THE TELUS INTERNATIONAL \n\n\nQUALIFICATIONS\n\n 7+ YEARS OF HUNTER / SALES EXPERIENCE IN CALL CENTER  PROVEN TRACK RECORD OF CLOSING $5 MILLION+ REVENUE GROWTH PER YEAR IN A CALL CENTER/BPO  BACHELOR'S DEGREE IN BUSINESS OR RELATED FIELD  EXPERIENCE WORKING IN GLOBAL COMPANY \n\n\nLOCATION:\n\nREMOTE POSITION - ANYWHERE IN THE US\n\nPAY:\n\nTHE BASE COMPENSATION RANGE FOR THIS POSITION IS $126,000 - $157,500 USDCOMMENSURATE WITH EXPERIENCE. ACTUAL COMPENSATION WITHIN THAT RANGE WILL BE DEPENDENT UPON THE INDIVIDUAL'S SKILLS, EXPERIENCE, QUALIFICATIONS, AND APPLICABLE LAWS.\n\nTELUS VALUES\n\nTELUS INTERNATIONAL RECOGNIZES AND EMBRACES THE IMPORTANCE OF VALUES IN OUR EVER-CHANGING WORKPLACE. TO BE SUCCESSFUL, ALL APPLICANTS MUST DEMONSTRATE BEHAVIORS THAT ARE REFLECTIVE OF OUR VALUES:\n\n WE PASSIONATELY PUT OUR CUSTOMERS AND COMMUNITIES FIRST  WE EMBRACE CHANGE AND INNOVATE COURAGEOUSLY  WE GROW TOGETHER THROUGH SPIRITED TEAMWORK \n\n\nAT TELUS INTERNATIONAL, WE ARE COMMITTED TO DIVERSITY AND EQUITABLE ACCESS TO EMPLOYMENT OPPORTUNITIES BASED ON ABILITY.\n\nADDITIONAL JOB DESCRIPTION\n\nEEO STATEMENT\n\nAT TELUS INTERNATIONAL, WE ENABLE CUSTOMER EXPERIENCE INNOVATION THROUGH SPIRITED TEAMWORK, AGILE THINKING, AND A CARING CULTURE THAT PUTS CUSTOMERS FIRST. TELUS INTERNATIONAL IS THE GLOBAL ARM OF TELUS CORPORATION, ONE OF THE LARGEST TELECOMMUNICATIONS SERVICE PROVIDERS IN CANADA. WE DELIVER CONTACT CENTER AND BUSINESS PROCESS OUTSOURCING (BPO) SOLUTIONS TO SOME OF THE WORLD'S LARGEST CORPORATIONS IN THE CONSUMER ELECTRONICS, FINANCE, TELECOMMUNICATIONS AND UTILITIES SECTORS. WITH GLOBAL CALL CENTER DELIVERY CAPABILITIES, OUR MULTI-SHORE, MULTI-LANGUAGE PROGRAMS OFFER SAFE, SECURE INFRASTRUCTURE, VALUE-BASED PRICING, SKILLS-BASED RESOURCES AND EXCEPTIONAL CUSTOMER SERVICE - ALL BACKED BY TELUS, OUR MULTI-BILLION DOLLAR TELECOMMUNICATIONS PARENT.\n\nEQUAL OPPORTUNITY EMPLOYER\n\nAT TELUS INTERNATIONAL, WE ARE PROUD TO BE AN EQUAL OPPORTUNITY EMPLOYER AND ARE COMMITTED TO CREATING A DIVERSE AND INCLUSIVE WORKPLACE. ALL ASPECTS OF EMPLOYMENT, INCLUDING THE DECISION TO HIRE AND PROMOTE, ARE BASED ON APPLICANTS’ QUALIFICATIONS, MERITS, COMPETENCE AND PERFORMANCE WITHOUT REGARD TO ANY CHARACTERISTIC RELATED TO DIVERSITY.",
    "job_skill_set": [
      "sales",
      "business development",
      "market intelligence",
      "customer experience",
      "data analysis",
      "communication",
      "problem solving",
      "teamwork",
      "relationship building",
      "adaptability",
      "influencing",
      "logical analysis",
      "discipline",
      "creativity",
      "negotiation",
      "contracting",
      "pipeline management",
      "CRM (Salesforce)",
      "BPO",
      "curiosity"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "bpo",
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "contracting",
      "creativity",
      "crm",
      "curiosity",
      "customer",
      "data",
      "development",
      "discipline",
      "executive",
      "experience",
      "influencing",
      "intelligence",
      "logical",
      "management",
      "market",
      "negotiation",
      "pipeline",
      "problem",
      "relationship",
      "sales",
      "salesforce",
      "solving",
      "sr",
      "teamwork"
    ]
  },
  {
    "job_id": "3898163080",
    "job_title": "Sales Representative Business Development, Business Broker",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "TRANSWORLD BUSINESS ADVISORS OF SOUTH AND WEST TEXAS IS THE LEADER IN BUSINESS BROKERAGE IN HOUSTON, CORPUS CHRISTI, HUNTSVILLE, BEAUMONT, AND SAN ANTONIO AND WE ARE LOOKING TO ADD TO OUR TEAM OF PROFESSIONAL BUSINESS BROKERS. WORK WITH OWNERS OF BUSINESSES, PRESIDENTS, AND CEOS. MATCH BUYERS AND SELLERS OF COMPANIES RANGING FROM $50,000 TO $20 MILLION IN SALES PRICE. CREATE YOUR OWN BUSINESS AND FINANCIAL INDEPENDENCE USING OUR MARKETING AND SALES SUPPORT. HIGH SUCCESS WITH ANNUAL POTENTIAL IN THE HUNDREDS OF THOUSANDS OF DOLLARS. TRANSWORLD PROVIDES TRAINING AND ONGOING SUPPORT. WORLD'S #1 BUSINESS BROKERAGE FIRM.\nDESIRED EXPERTISEOUR MOST SUCCESSFUL BUSINESS BROKERS COME FROM A VARIETY OF BACKGROUNDS:RETIRED SENIOR EXECUTIVESFORMER SMALL OR MEDIUM BUSINESS OWNERSOUTSIDE SALES PROFESSIONALS ACCUSTOMED TO SELLING INTANGIBLE SERVICESFINANCE & ACCOUNTING PROFESSIONALSCOMMERCIAL REAL ESTATE \nSKILLS AND EXPERIENCE:WE ARE SEEKING AN AMBITIOUS INDIVIDUAL WITH A MINIMUM OF 10 YEARS OF BUSINESS EXPERIENCE, A PENCHANT FOR DETAIL, AND THE ABILITY TO EFFECTIVELY COMMUNICATE WITH BUSINESS OWNERS. MUST BE A SELF-MOTIVATED GO-GETTER. IF THAT'S YOU, THE SKY IS THE LIMIT. YOU MUST RESIDE NEAR OR AROUND BEAUMONT, TEXAS. \nBENEFITS:ANNUAL POTENTIAL IN THE HUNDREDS OF THOUSANDS. 1099 COMMISSIONED ROLE. INITIAL AND ONGOING TRAINING AND SUPPORT. PROVEN PROCESSES AND SYSTEMS. ESTABLISHED HOUSTON OFFICE AND SUPPORT TEAM. LEADS PROVIDED. NETWORK OF MORE THAN 200 OFFICES AND 650 BROKERS WORLDWIDE. ESTABLISHED AND RESPECTED NAME IN BUSINESS BROKERAGE.",
    "job_skill_set": [
      "sales support",
      "marketing",
      "finance",
      "lead generation",
      "communication",
      "self-motivation",
      "detail-oriented",
      "negotiation",
      "relationship building",
      "problem solving",
      "business brokerage",
      "accounting",
      "commercial real estate"
    ],
    "short_keywords": [
      "accounting",
      "broker",
      "brokerage",
      "building",
      "business",
      "businessdevelopment",
      "commercial",
      "communication",
      "detailoriented",
      "development",
      "estate",
      "finance",
      "generation",
      "lead",
      "marketing",
      "negotiation",
      "problem",
      "real",
      "relationship",
      "representative",
      "sales",
      "selfmotivation",
      "solving",
      "support"
    ]
  },
  {
    "job_id": "3891068947",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "LRT RESTORATION TECHNOLOGIES IS A PREMIER SPECIALTY CONTRACTOR WITH EXPERTISE IN BUILDING ENVELOPE RESTORATION, STRUCTURAL RESTORATION, WATERPROOFING, AND INDUSTRIAL RESTORATION. SERVICES INCLUDE WATERPROOFING, CONCRETE REPAIR, MASONRY REPAIR, EXPANSION JOINT SYSTEMS, CAULKING, SEALANTS, SPECIALTY COATINGS, POST TENSION REPAIR, CARBON FIBER REPAIRS, AIR BARRIER SYSTEMS, AND HISTORIC RESTORATIONS. FOUNDED BY KEN BAKER IN 1979, LRT HAS GROWN INTO ONE OF THE MIDWEST’S TOP RESTORATION CONTRACTORS WITH THREE OFFICES IN CINCINNATI, COLUMBUS, AND NASHVILLE. OUR SUCCESS GROWS OUT OF OUR CORE VALUES: PEOPLE, HONOR, AND GRIT. LRT IS A PROUD MEMBER OF THE BAKER CONSTRUCTION ENTERPRISES PORTFOLIO OF COMPANIES.\n LRT IS LOOKING FOR AN EFFECTIVE BUSINESS DEVELOPER TO JOIN OUR TEAM. THE BUSINESS DEVELOPER IS A PROFESSIONAL WHO KNOWS HOW TO CONNECT AND GET THINGS DONE. WE ARE CURRENTLY LOOKING FOR SOMEONE TO BE A LEADING FORCE THAT FUELS OUR GROWING CLIENT RELATIONSHIPS AND MARKETS. THE IDEAL PERSON WILL HAVE PROVEN EXPERIENCE BUILDING ON EXISTING RELATIONSHIPS, UNDERSTANDING PRODUCT OFFERINGS, AND ENSURING CUSTOMER SATISFACTION. PRIMARY RESPONSIBILITIES• BUILD AND MAINTAIN LASTING RELATIONSHIPS WITH CLIENTS AND PARTNERS BY UNDERSTANDING FOCUS, NEEDS, AND ANTICIPATING THEM IN ADVANCE. • MANAGES AND MAINTAINS STRONG RELATIONSHIPS WITH CLIENTS ALIGNING WITH LRT’S STRATEGY. • THOROUGHLY UNDERSTANDS THE COMPANY AND ITS CAPABILITIES ACROSS ITS SOLUTIONS. • COORDINATE INTERNAL AND EXTERNAL RESOURCES TO EXPEDITE WORKFLOW. • STAY CURRENT WITH COMPANY OFFERINGS AND INDUSTRY TRENDS.• OVERSEE AND ACHIEVE ORGANIZATIONAL GOALS WHILE UPHOLDING BEST PRACTICES. • SUPPORT AND SOLVE PROBLEMS FOR CLIENTS BY UNDERSTANDING AND EXCEEDING THEIR EXPECTATIONS. • ATTENTION TO DETAIL AND ABILITY TO WORK TO TIME CONSTRAINTS. SKILLS: EXCELLENT WRITTEN, VERBAL, AND CUSTOMER SERVICE SKILLS. ABILITY TO EXPLAIN TECHNICAL ISSUES TO NONTECHNICAL EMPLOYEES AND CUSTOMERS. SUPPORT AND SOLVE PROBLEMS FOR CLIENTS BY UNDERSTANDING AND EXCEEDING THEIR EXPECTATIONS. STRONG ANALYTICAL AND PROBLEM-SOLVING SKILLS. PROFICIENT WITH MICROSOFT OFFICE AND CRM SOFTWARE. \nTRAVEL REQUIREMENTS • REQUIRED TO TRAVEL AS NEEDED TO MEET WITH CLIENTS AND PROSPECTS. • 25-50% TRAVEL • TERRITORY INCLUDES OHIO, KENTUCKY & TENNESSEE MINIMUM QUALIFICATIONS • BACHELOR’S DEGREE IN CONSTRUCTION MANAGEMENT, BUSINESS OR ENGINEERING IS HIGHLY DESIRABLE BUT NOT MANDATORY. ALTERNATE DEGREES OR SIMPLY INDUSTRY EXPERIENCE IS SUFFICIENT DEPENDING ON THE INDIVIDUAL’S SKILLS AND WORK EXPERIENCE. • AT LEAST THREE YEARS OF EXPERIENCE IN CONSTRUCTION, BUSINESS DEVELOPMENT, OR CUSTOMER TECHNICAL SUPPORT • SELECTED CANDIDATE MUST HAVE THE ABILITY TO COMMUTE/RELOCATE.\nLRT IS PROUD TO BE AN EQUAL OPPORTUNITY EMPLOYER AND MEMBER OF THE DRUG-FREE SAFETY",
    "job_skill_set": [
      "CRM software",
      "Microsoft Office",
      "Business development",
      "Customer service",
      "Relationship building",
      "Problem solving",
      "Analytical skills",
      "Communication",
      "Attention to detail",
      "Time management",
      "Construction management",
      "Technical support"
    ],
    "short_keywords": [
      "analytical",
      "attention",
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "construction",
      "crm",
      "customer",
      "detail",
      "development",
      "management",
      "manager",
      "microsoft",
      "office",
      "problem",
      "relationship",
      "service",
      "skills",
      "software",
      "solving",
      "support",
      "technical",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3888483868",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "AT SWORD GROUP, WE ARE DEDICATED TO TRANSFORMING BUSINESSES THROUGH INNOVATIVE TECHNOLOGY SOLUTIONS. WITH OUR EXPERTISE IN DATA, PLATFORM AND APPS, WE HELP ORGANIZATIONS ACHIEVE THEIR GOALS AND DRIVE GROWTH.AS A PIVOTAL MEMBER OF OUR TEAM, THE BUSINESS DEVELOPMENT MANAGER WILL BE INSTRUMENTAL IN DRIVING OUR SUCCESS BY SPEARHEADING THE IDENTIFICATION AND CULTIVATION OF NEW BUSINESS OPPORTUNITIES. COLLABORATING CLOSELY WITH OUR SALES TEAM, YOU WILL HARNESS YOUR EXTENSIVE NETWORK TO FORGE LASTING RELATIONSHIPS WITH POTENTIAL CLIENTS. THIS ROLE PRESENTS A UNIQUE OPPORTUNITY TO DRIVE OUR EXPANSION EFFORTS IN THE US MARKET, CAPITALIZING ON THREE YEARS OF PROVEN SUCCESS AND DRAWING UPON OUR ESTEEMED 30-YEAR LEGACY OF EXCELLENCE ACROSS VARIOUS VERTICALS IN THE UK AND EUROPE. JOIN US IN SHAPING THE FUTURE OF OUR ORGANIZATION AND MAKING A TANGIBLE IMPACT ON OUR CONTINUED GROWTH AND SUCCESS.RESPONSIBILITIES:COLLABORATING SEAMLESSLY WITH OUR SALES FORCE TO PINPOINT AND PURSUE LUCRATIVE BUSINESS OPPORTUNITIES.UTILIZING YOUR NETWORK AND INDUSTRY CONNECTIONS TO UNEARTH PROMISING LEADS AND FORGE MEANINGFUL PARTNERSHIPS WITH POTENTIAL CLIENTS.REPRESENTING SWORD GROUP WITH DISTINCTION AT KEY INDUSTRY GATHERINGS AND EVENTS, ELEVATING OUR PROFILE AND FOSTERING BRAND RECOGNITION.DEVELOP COMPELLING PROPOSALS THAT SPOTLIGHT OUR CUTTING-EDGE SOLUTIONS AND SERVICES, DELIVERING A CLEAR VALUE PROPOSITION THAT RESONATES WITH CLIENTS.ORCHESTRATING SEAMLESS PROJECT DELIVERY BY LIAISING CLOSELY WITH INTERNAL TEAMS, ENSURING OPTIMAL OUTCOMES AND UNPARALLELED CUSTOMER SATISFACTION.REMAINING AT THE FOREFRONT OF MARKET TRENDS AND COMPETITOR ACTIVITIES, IDENTIFYING UNTAPPED AVENUES FOR GROWTH AND INNOVATION. \n\nREQUIREMENTS\n\nA PROVEN TRACK RECORD IN BUSINESS DEVELOPMENT OR SALES, IDEALLY WITHIN THE OIL AND GAS SECTOR.DEMONSTRATED SUCCESS IN SURPASSING SALES TARGETS AND DRIVING REVENUE GROWTH.EXCEPTIONAL COMMUNICATION SKILLS, BOTH VERBAL AND WRITTEN, COUPLED WITH A TALENT FOR BUILDING RAPPORT AND FOSTERING TRUST.A ROBUST NETWORK AND A KNACK FOR FORGING ENDURING RELATIONSHIPS WITH CLIENTS AND STAKEHOLDERS.EXPERIENCE WITH SUBSURFACE AND WELLS DATA WOULD BE A NOTABLE ADVANTAGE, SHOWCASING YOUR INDUSTRY EXPERTISE.A SELF-MOTIVATED, RESULTS-DRIVEN MINDSET, COMPLEMENTED BY A COLLABORATIVE SPIRIT AND A RELENTLESS PURSUIT OF EXCELLENCE.A KEEN EYE FOR INDUSTRY TRENDS AND MARKET DYNAMICS, ENABLING YOU TO CAPITALIZE ON EMERGING OPPORTUNITIES.ABOVE ALL, A CUSTOMER-CENTRIC ETHOS AND A PASSION FOR DELIVERING UNPARALLELED VALUE AND SERVICE. \n\nBENEFITS\n\nSUPPORTED BY SWORD'S ESTABLISHED PRESENCE IN THE ENERGY MARKET, YOU'LL BE WORKING WITH OUR TALENTED TECHNICAL TEAM TO DELIVER DISTINCTIVE SOLUTIONS TO OUR CLIENTS. AS SUCH THE SUCCESSFUL CANDIDATE WILL BE GIVEN THE OPPORTUNITY TO DEVELOP THEIR CAREER WITH SWORD IN LINE WITH OUR AMBITIOUS GROWTH STRATEGY. SWORD OFFERS A BASE SALARY, AN ATTRACTIVE SALES BONUS PLAN AND BENEFITS PACKAGE THAT INCLUDES MEDICAL, DENTAL AND VISION COVERAGE, 401K WITH MATCHING PLAN, TRAINING AND DEVELOPMENT, AND OTHER BENEFITS. SWORD IS COMMITTED TO MAINTAINING A DIVERSE ENVIRONMENT AND IS PROUD TO BE AN EQUAL OPPORTUNITIES EMPLOYER. ALL APPLICANTS RECEIVE EQUAL CONSIDERATION FOR EMPLOYMENT REGARDLESS OF AGE, DISABILITY, GENDER IDENTITY OR REASSIGNMENT, MARITAL OR CIVIL PARTNER STATUS, PREGNANCY OR MATERNITY STATUS, RACE, COLOUR, NATIONALITY, ETHNIC OR NATIONAL ORIGIN, RELIGION OR BELIEF, SEX OR SEXUAL ORIENTATION.IF WE CAN DO ANYTHING TO HELP MAKE THE HIRING PROCESS MORE ACCESSIBLE, PLEASE LET OUR TALENT ACQUISITION TEAM KNOW WHEN YOU APPLY SO WE CAN SUPPORT ANY ADJUSTMENTS.PLEASE NOTE THIS POSITION IS ONLY OPEN TO APPLICANTS WITH RIGHT TO WORK IN THE UNITED STATES OF AMERICA.",
    "job_skill_set": [
      "business development",
      "sales",
      "communication",
      "market analysis",
      "data analysis (subsurface and wells)",
      "self-motivation",
      "results-driven",
      "trend awareness",
      "networking",
      "proposal development",
      "customer service",
      "industry expertise (oil and gas)",
      "relationship building",
      "collaboration",
      "adaptability",
      "customer-centric mindset"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "and",
      "awareness",
      "building",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "customer",
      "customercentric",
      "data",
      "development",
      "expertise",
      "gas",
      "industry",
      "manager",
      "market",
      "mindset",
      "networking",
      "oil",
      "proposal",
      "relationship",
      "resultsdriven",
      "sales",
      "selfmotivation",
      "service",
      "subsurface",
      "trend",
      "wells"
    ]
  },
  {
    "job_id": "3887715249",
    "job_title": "IT Business Development Representative (MSP)",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "IT BUSINESS DEVELOPMENT REPRESENTATIVE (MSP)\nWE ARE A REPUTABLE CLOUD AND MANAGED SERVICE PROVIDER SERVICING VARIOUS SMB CLIENTS IN THE GREATER DALLAS AREA. WE ARE A ONE STOP SHOP FOR ANYTHING IT-RELATED INCLUDING BUSINESS ADVISORY, CLOUD-COMPUTING, NETWORKING, CYBERSECURITY, HELPDESK, WORKFORCE SOLUTIONS, ETC. \nWE CURRENTLY HAVE A NEED FOR A IT BUSINESS DEVELOPMENT REPRESENTATIVE. THE IT BUSINESS DEVELOPMENT REPRESENTATIVE WILL BE RESPONSIBLE FOR FINDING, DEVELOPING AND BRINGING IN NEW MSP BUSINESS ACCOUNTS BY SELLING SOLUTIONS THAT HELP THE CLIENT MEET THEIR BUSINESS OBJECTIVES AS IT RELATES TO IT. THE IT BUSINESS DEVELOPMENT REPRESENTATIVE WILL SIGN THESE CLIENTS UP AND THEN ASSIST WITH THE TRANSITION OVER TO THE SERVICE DESK TEAM ENSURING A SMOOTH TRANSITION AND LONG TERM RELATIONSHIP. \nTHE IT BUSINESS DEVELOPMENT REPRESENTATIVE (MSP) MUST HAVE EXPERIENCE SELLING IT SOLUTIONS IN A MANAGED SERVICE PROVIDER ENVIRONMENT.\nIT BUSINESS DEVELOPMENT REPRESENTATIVE (MSP) RESPONSIBILITIES:SIGN NEW MONTHLY RECURRING REVENUE (MRR) CLIENTS BY EXECUTING COMPANY SALESSTRATEGIESPROSPECT, NETWORK, DEVELOP AND CREATE RELATIONSHIPS WITH KEY DECISION MAKERS AND TURNTHOSE RELATIONSHIPS INTO NEW MRR CLIENTSIDENTIFY, RESEARCH, AND PRIORITIZE TARGET ACCOUNTSPREPARE AND PRESENT PROPOSALSNEGOTIATE AND CLOSE NEW BUSINESSUTILIZE CONSULTATIVE SELLING TECHNIQUES THAT APPLY SOLUTIONS ACROSS OUR FULL SUITE OF PRODUCTOFFERINGSSUPPORT SERVICE TEAM TO INCREASE REVENUE WITH EXISTING CLIENTS\nIT BUSINESS DEVELOPMENT REPRESENTATIVE (MSP) EXPERIENCE:PREVIOUS EXPERIENCE WORKING FOR A MANAGED SERVICE PROVIDER IS REQUIRED1+ YEARS OF IT SALES EXPERIENCE SELLING IT SERVICES IN THE MSP SPACE PREFERREDKNOWLEDGE OF THE MICROSOFT STACK AND OTHER TECHNOLOGIES SUCH AS WINDOWS OS, AZURE, O365, CISCO PRODUCTS, WINDOWS SERVERS, SECURITY SOLUTIONS, ETC.\nIT BUSINESS DEVELOPMENT REPRESENTATIVE (MSP) BENEFITS:BASE SALARY AROUND $70K+ COMMISSION FOR OTE OF AROUND $160KMEDICAL/DENTAL INSURANCEEMPHASIS ON WORK/LIFE BALANCEFAMILY-LIKE COMPANY CULTURE401K + COMPANY MATCH3 WEEKS PTOCONTINUED TRAINING OPPORTUNITIES",
    "job_skill_set": [
      "Consultative selling techniques",
      "Proposal preparation and presentation",
      "Client relationship management",
      "Networking",
      "Relationship building",
      "Communication",
      "Problem solving",
      "Teamwork",
      "Adaptability",
      "IT solutions sales",
      "Managed Service Provider (MSP) experience",
      "Microsoft stack knowledge",
      "Windows OS",
      "Azure",
      "O365",
      "Cisco products",
      "Windows servers",
      "Security solutions",
      "Negotiation"
    ],
    "short_keywords": [
      "adaptability",
      "and",
      "azure",
      "building",
      "business",
      "businessdevelopment",
      "cisco",
      "client",
      "communication",
      "consultative",
      "development",
      "experience",
      "it",
      "knowledge",
      "managed",
      "management",
      "microsoft",
      "msp",
      "negotiation",
      "networking",
      "o365",
      "os",
      "preparation",
      "presentation",
      "problem",
      "products",
      "proposal",
      "provider",
      "relationship",
      "representative",
      "sales",
      "security",
      "selling",
      "servers",
      "service",
      "solutions",
      "solving",
      "stack",
      "teamwork",
      "techniques",
      "windows"
    ]
  },
  {
    "job_id": "3904409104",
    "job_title": "New Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ABOUT US:ONE OF FORBE'S TOP PLACES TO WORK! WE HAD OVER 100% COMPANY GROWTH IN 2023, WHICH IS EXACTLY WHY WE’RE LOOKING FOR OUR NEXT LEADER WHO WILL CONTRIBUTE TOWARDS THE GROWTH AND FORTIFICATION OF THE ENTERPRISE.\nWITH NO EXPERIENCE NECESSARY, A PERSONALIZED MENTOR TO WORK WITH YOU IN PERSONALIZED ONE-ON-ONE TRAINING SESSIONS, FOSTERING AN ENVIRONMENT CONDUCIVE TO INDIVIDUALIZED LEARNING AND SKILL ENHANCEMENTS EXACTLY HOW WE ENDED UP ON FORBES LIST HAPPIEST PLACES TO WORK!\nOUR PARENT COMPANY AIL HAS BEEN IN BUSINESS FOR OVER 72 YEARS. WE ARE A COMPANY THAT WORKS WITH OVER 40,000 DIFFERENT LABOR UNIONS, INCLUDING SOME LARGE COMPANIES YOU MAY KNOW SUCH AS UPS, STOP AND SHOP, RAYTHEON, AND ELECTRIC BOAT. AS WELL AS LARGE CONTRACTS WITH THE NFL, NBA & MLB, WITH OVER 5 MILLION MEMBERS AND COUNTING. OUR COMPANY HAS OVER $75.4 BILLION IN FORCE WITH AN A+ SUPERIOR RATING BY AM BEST FOR ITS FINANCIAL STRENGTH. AMERICAN INCOME LIFE IS ONE THE PREMIER WORKPLACES IN NORTH AMERICA, CONSISTENTLY BEING VOTED ONE OF THE BEST PLACES TO WORK. GIDDENS ORGANIZATIONS / AIL HAS ALSO BEEN NAMED THE 24TH HAPPIEST PLACES TO WORK BY FORBES MAGAZINE!\nPOSITION SUMMARY:YOU WILL BE PUT ON A FAST-PACED 6-10 WEEK TRAINING PROGRAM ALLOWING YOU TO LEARN THE INS AND OUTS OF THIS INDUSTRY. YOU WILL LEARN ABOUT THE HISTORY, VISION, AND MISSION OF THE GIDDENS ORGANIZATION IN OUR GOAL TO PROTECT THE HARD-WORKING MIDDLE CLASS. AFTER BECOMING AN EXPERT IN THE DAY-TO-DAY ASPECTS OF WHAT WE DO, YOU WILL THEN HAVE THE KNOWLEDGE, SKILLS, AND GUIDANCE TO SIGN A CONTRACT AND ENTER YOUR FIRST PROMOTION, EARNING YOU YOUR FIRST 15% RAISE!\nWHAT WILL BE EXPECTED OF ME?\nOBTAIN THE EXPERIENCE, KNOWLEDGE, AND KNOW-HOW TO RUN THE BUSINESS'S DAY-TO-DAY OPERATIONS.WORK HANDS-ON WITH CUSTOMERS WHILE TAILOR-FITTING THEIR PERMANENT BENEFITS TO THEIR FAMILY'S NEEDS.MAINTAIN A POSITIVE AND IMPACTFUL RELATIONSHIP WITH THE LONG-LASTING GROUPS AND ASSOCIATIONS WE WORK WITH SUCH AS THE POLICE ASSOCIATION, NURSES ASSOCIATION, FIREFIGHTERS, POSTAL WORKERS, IRON WORKERS, LABOR UNIONS, AND MANY MORE.ENHANCE AND DEVELOP YOUR SKILLS IN COMMUNICATION, LEADERSHIP, ORGANIZATION, TIME MANAGEMENT, NETWORKING, TEAM BUILDING, AND MUCH MORE.LEARN THE LOGISTICS OF A CORPORATION AND HOW TO MAXIMIZE EARNINGS AND PROFIT MARGIN.DEMONSTRATED CAPACITY FOR MAINTAINING A PROACTIVE AND OPTIMISTIC DEMEANOR, COUPLED WITH A KEEN ENTHUSIASM FOR CONTINUAL PERSONAL AND PROFESSIONAL DEVELOPMENT.\nCRITERIA FOR CONSIDERATION:LEADERSHIP EXPERIENCE IS A PLUS BUT NOT REQUIREDWILLINGNESS TO LEARN, COACHABLEHANDLE CONSTRUCTIVE CRITICISMPEOPLE SKILLS – AND A SENSE OF HUMOR!ORGANIZEDTEAM ORIENTATEDCOACHABILITY\nCOMPANY INCENTIVES:INCENTIVE TRIPS WITH TOP LEADERS TO DESTINATIONS LIKE CABO, VEGAS, CANCUN, AND HAWAIIVISIT CLIENTS VIRTUALLY - FLEXBILITY TO WORK FROM ANYWHERE!WEEKLY TRAINING CALLSWEEKLY PERFORMANCE-BASED BONUSES AND INCENTIVESHEALTH INSURANCELIFE INSURANCERETIREMENT PLAN\nIF YOU HAVE THE PASSION AND DRIVE TO TAKE YOUR CAREER AND YOURSELF TO THE NEXT LEVEL PLEASE SUBMIT YOUR MOST UPDATED RESUME.\nTHIS IS A IN-PERSON ROLE. OUR SAN ANTONIO OFFICE ADDRESS IS 4606 CENTERVIEW DR, SUITE 210, SAN ANTONIO, TX, 78228",
    "job_skill_set": [
      "business operations",
      "customer relationship management",
      "sales",
      "communication",
      "leadership",
      "organization",
      "time management",
      "networking",
      "team building",
      "coachable",
      "people skills",
      "positive attitude",
      "enthusiasm for development",
      "logistics",
      "financial analysis"
    ],
    "short_keywords": [
      "analysis",
      "attitude",
      "building",
      "business",
      "businessdevelopment",
      "coachable",
      "communication",
      "customer",
      "development",
      "enthusiasm",
      "financial",
      "for",
      "leadership",
      "logistics",
      "management",
      "manager",
      "networking",
      "new",
      "operations",
      "organization",
      "people",
      "positive",
      "relationship",
      "sales",
      "skills",
      "team",
      "time"
    ]
  },
  {
    "job_id": "3906095548",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "BUSINESS DEVELOPMENT MANAGERENGINEERED MATERIALS SOLUTIONS\nSALARY RANGE $120K TO $145K, COMMENSURATE WITH EXPERIENCE, PLUS BONUS ELIGIBILITY\nENGINEERED MATERIALS SOLUTIONS (“EMS”) IS SEEKING A DYNAMIC BUSINESS DEVELOPMENT MANAGER TO JOIN THE EMS TEAM, REPORTING DIRECTLY TO THE CEO. THE BUSINESS DEVELOPMENT MANAGER WILL SERVE AS A KEY MEMBER OF THE COMMERCIAL DEVELOPMENT TEAM AND WILL BE RESPONSIBLE FOR GENERATING NEW BUSINESS LEADS, CLOSING OPPORTUNITIES, AND ACTING AS THE PRIMARY CUSTOMER INTERFACE. THE BUSINESS DEVELOPMENT MANAGER WILL ALSO PROVIDE INPUT ON TECHNICAL DEVELOPMENT FOR WICKEDER GROUP, ESPECIALLY MICROMETAL PHOTOCHEMICAL ETCHED PRODUCTS.\nBUSINESS DEVELOPMENT MANAGER QUALIFICATION AND SKILLSB.S. IN ENGINEERING, METALLURGY, OR RELATED DEGREE5 TO 10 YEARS OF BUSINESS DEVELOPMENT EXPERIENCE WITH DEMONSTRABLE RECORD OF SUCCESSEXPERIENCE IN THE METALS INDUSTRY, PARTICULARLY MEDICAL DEVICES OR AUTOMOTIVE IS STRONGLY PREFERREDHIGH ENERGY LEVEL; A PROACTIVE SELF- STARTER MOTIVATED BY SUPERIOR ACHIEVEMENT STANDARDSABILITY TO QUICKLY DEVELOP A DETAILED KNOWLEDGE OF INTERNAL PRODUCTION OPERATIONS, CUSTOMERS’ PRODUCTION OPERATIONS, AND COMPETITIVE LANDSCAPEABILITY TO THINK OUTSIDE THE BOX, PURSUING APPLICATION AREAS BEYOND THE TRADITIONAL FOCUS FOR COMPANY’S PRODUCTS AND APPLYING CREATIVITY TO THAT PROCESSABILITY TO MEET AND EXCEED QUARTERLY OBJECTIVESABILITY TO WORK WELL WITH OTHERS AT ALL LEVELS OF THE ORGANIZATIONCOMPUTER PROFICIENT; ABILITY TO TRACK LEADS AND SALES OPPORTUNITIES IN RELATIONAL DATABASEEXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS; STRONG SALES ACUMENABILITY TO TRAVEL DOMESTICALLY AND INTERNATIONALLY (50-75%), INCLUDING TRAVEL TO EMS IN ATTLEBORO 1 – 2 TIMES PER MONTH\nWHY YOU SHOULD APPLYCOMPREHENSIVE HEALTH BENEFITS INCLUDING ELIGIBILITY ON START DATE INCLUDING NO MEDICAL INSURANCE DEDUCTIBLE!GENEROUS PAID VACATION AND HOLIDAYS, 401K MATCH, AND TUITION REIMBURSEMENTCOMPETITIVE SALARY AND BONUS\nBUSINESS DEVELOPMENT MANAGER JOB RESPONSIBILITIESENHANCE MARKET SHARE, DEVELOP NEW CUSTOMERS, AND CONCEIVE/INTRODUCE NEW, INNOVATIVE PRODUCTS AND APPLICATIONSFUNCTION AS PRIME COMMERCIAL CONTACT FOR ALL ACCOUNTS; SERVE AS OUTSIDE LIAISON FOR CUSTOMERS, THE WICKEDER GROUP AND MICROMETALPERFORM MARKET RESEARCH FOR NEW PRODUCTS TO IDENTIFY SALES OPPORTUNITIES FOR WICKEDER GROUP AND MICROMETALDEVELOP AND RECOMMEND BUSINESS STRATEGIES TO INCLUDE PRODUCTS, PRICING AND DISTRIBUTIONSET REGION AND PRODUCT SALES OBJECTIVESEXECUTE AGREED UPON MARKETING PLAN COORDINATING ALL CORPORATE ACTIVITIES INVOLVED IN THE PLANRECOMMEND AND PARTICIPATE IN TARGETED EXHIBITIONS AND TRADE SHOWSPROVIDE DAILY UPDATES, CALL REPORTS, AND FOLLOW UP TO MANAGEMENTCREATE PROJECTIONS FOR PRODUCT DEMAND ON A MONTHLY, QUARTERLY, ANNUAL, AND THREE-YEAR BASIS MAINTAIN REGULAR COMMUNICATIONS INTERNALLY AND WITH EXTERNAL CONTACTSCOORDINATE WITH TECHNICAL STAFF TO ASSESS CUSTOMERS’ NEEDS AND ASSIST IN SAMPLE PREPARATION AS NEEDEDEVALUATE PRODUCT APPLICATIONS AND SERVICE MARKETABILITY IN TERMS OF CUSTOMERS’ TECHNICAL NEEDS\nABOUT ENGINEERED MATERIALS SOLUTIONSEMS HAS BEEN COMMITTED TO PROVIDING THE BEST QUALITY PRODUCTS AND SERVICES SINCE WE WERE FOUNDED IN 1916 AS GENERAL PLATE COMPANY. TODAY, ENGINEERED MATERIALS SOLUTIONS PROVIDES CLAD METALS USING PT BONDING, WARM BONDING, INLAY CLADDING AND SIDE-TO-SIDE CLADDING FOR THOUSANDS OF APPLICATIONS AROUND THE WORLD. WE AT EMS, ALONG WITH OUR SISTER COMPANIES IN THE WICKEDER GROUP, STRIVE TO DELIVER OUR CUSTOMERS THE \"BEST OF METAL”.\nEDM ARCHITECTURE & ENGINEERING, PC. IS AN EQUAL OPPORTUNITY EMPLOYER, DEDICATED TO BUILDING AN INCLUSIVE AND DIVERSE WORKFORCE.",
    "job_skill_set": [
      "business development",
      "sales",
      "market research",
      "customer relationship management",
      "product development",
      "presentation skills",
      "communication",
      "teamwork",
      "creativity",
      "proactivity",
      "problem solving",
      "motivation",
      "adaptability",
      "time management",
      "interpersonal skills",
      "negotiation",
      "engineering",
      "metallurgy",
      "data analysis",
      "technical knowledge",
      "lead tracking"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "business",
      "businessdevelopment",
      "communication",
      "creativity",
      "customer",
      "data",
      "development",
      "engineering",
      "interpersonal",
      "knowledge",
      "lead",
      "management",
      "manager",
      "market",
      "metallurgy",
      "motivation",
      "negotiation",
      "presentation",
      "proactivity",
      "problem",
      "product",
      "relationship",
      "research",
      "sales",
      "skills",
      "solving",
      "teamwork",
      "technical",
      "time",
      "tracking"
    ]
  },
  {
    "job_id": "3895539234",
    "job_title": "Senior Business Development Manager – Contracted Solutions Strategy",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "POSITION OVERVIEW\n\nNAVISTAR'S SERVICE SOLUTIONS GROUP HAS A GREAT OPPORTUNITY FOR A SENIOR BUSINESS DEVELOPMENT MANAGER - CONTRACTED SOLUTIONS STRATEGY TO JOIN OUR TEAM!\n\nNAVISTAR, INC. IS REIMAGINING HOW TO CREATE MORE COHESIVE RELATIONSHIPS, BUILD HIGHER-PERFORMING TEAMS AND FIND SOLUTIONS WHERE OTHERS DON’T. BASED IN LISLE, ILLINOIS, NAVISTAR OR ITS SUBSIDIARIES AND AFFILIATES PRODUCE CLASS 4-8 INTERNATIONAL® BRAND COMMERCIAL TRUCKS AND ENGINES, IC BUS® BRAND SCHOOL AND COMMERCIAL BUSES, ALL-MAKES ONCOMMAND® CONNECTION ADVANCED CONNECTIVITY SERVICES, AND FLEETRITE®, RENEWED® AND DIAMOND ADVANTAGE® BRANDS AFTERMARKET PARTS. WITH A HISTORY OF INNOVATION DATING BACK TO 1831, NAVISTAR HAS MORE THAN 14,500 EMPLOYEES WORLDWIDE AND IS A MEMBER OF TRATON SE, A GLOBAL CHAMPION OF THE TRUCK AND TRANSPORT SERVICES INDUSTRY.\n\nOUR FUTURE VALUE PROPOSITION GOES FAR BEYOND THE PRODUCT AS WE ARE MAKING A SHIFT FROM OFFERING PRODUCTS TO PROVIDING COMPREHENSIVE SOLUTIONS.\n\nOUR VISION IS TO ACCELERATE THE IMPACT OF SUSTAINABLE MOBILITY. THIS IS OUR GUIDING STAR AND INFORMS ALL FUTURE DECISIONS. WITHIN THE TRANSPORT SECTOR, OUR INDUSTRY ACCOUNTS FOR A SIGNIFICANT PERCENTAGE OF TOTAL EMISSIONS. WE ACCEPT RESPONSIBILITY FOR BENDING THE CURVE ON CARBONIZATION BY DRIVING CHANGE TO ADVANCE SUSTAINABLE SOLUTIONS.\n\nWE ARE INVESTING WISELY IN DIGITALIZATION AND ZERO EMISSIONS. WE ARE CREATING NEW BUSINESS MODELS WHERE IT MAKES MOST SENSE FOR OUR CUSTOMERS. WE ARE LEVERAGING OUR PARTNERSHIPS AND RESOURCES, AS PART OF THE TRATON GROUP, TO ACCELERATE OUR PROGRESS ON TECHNOLOGIES THAT ANTICIPATE AND HELP MANAGE DEMANDS COMING OUR WAY.\n\nOUR NUMBER ONE PRIORITY IS TO BECOME A HEALTHY, WELL-ROUNDED AND PROFITABLE COMPANY. IN PARTNERSHIP WITH OUR DEALER NETWORK, WE STRIVE TO OFFER THE BEST HOLISTIC EXPERIENCE AND SOLUTIONS FOR OUR CUSTOMERS. EACH EMPLOYEE IS EMPOWERED AND TRUSTED TO MAKE THE RIGHT CHOICES, EMBRACING ACCOUNTABILITY FOR OUR LONG-TERM SUCCESS.\n\nTHE SENIOR BUSINESS DEVELOPMENT MANAGER - CONTRACTED SOLUTIONS STRATEGY WILL BE RESPONSIBLE FOR ENHANCING OUR PRODUCT PORTFOLIO TO BETTER SERVE OWNERS OF OUR VEHICLES. PRODUCTS INCLUDE EXTENDED SERVICE CONTRACTS, TELEMATIC PRODUCTS AND OTHER PREDICTIVE OFFERINGS THAT HELP INCREASE CUSTOMER EFFICIENCY AND DRIVE CUSTOMER BRAND LOYALTY.\n\nRESPONSIBILITIES\n\nMANAGES THE DEVELOPMENT OF STRATEGIC MARKET/PRODUCT LINE BUSINESS PLANS TO ENHANCE OR DISTINGUISH PRODUCT PLACEMENTOVERSEES MARKET RESEARCH AND MONITORS COMPETITIVE ACTIVITY TO IDENTIFY BUSINESS OPPORTUNITIES AND ADDRESS CUSTOMER NEEDSIDENTIFIES STRATEGIC CUSTOMERS OR PARTNERSESTABLISHES PRICING STRATEGIESCOMMUNICATE VOC (VOICE OF THE CUSTOMER) AND VOD (VOICE OF DEALER) FOR PRODUCT IMPROVEMENTS AND COMPETITIVE POSITIONINGLEVERAGE FEEDBACK FROM CUSTOMERS TO DEVELOP AFTERSALES SOLUTIONS THAT WILL HELP OPTIMIZE THEIR TOTAL COST OF OWNERSHIPWORK CROSS FUNCTIONALLY TO ENSURE ORGANIZATIONAL ALIGNMENT WITH ALL BUSINESS PLANS TO DEVELOP NEW PRODUCTS OR ENHANCE EXISTING PRODUCT LINESMAY BE ASSIGNED TO WORK ON ONE OR MANY STRATEGIC INITIATIVES TO POSITIVELY TRANSFORM THE CUSTOMER EXPERIENCE\n\nMINIMUM REQUIREMENTS\n\nBACHELOR’S DEGREEAT LEAST 12 YEARS OF MARKETING, SALES OR PRODUCT-RELATED EXPERIENCEAT LEAST 2 YEARS OF LEAD EXPERIENCE\n\nOR\n\nMASTER’S DEGREEAT LEAST 8 YEARS OF MARKETING, SALES OR PRODUCT-RELATED EXPERIENCEAT LEAST 2 YEARS OF LEAD EXPERIENCE\n\nOR\n\nAT LEAST 14 YEARS OF MARKETING, SALES OR PRODUCT-RELATED EXPERIENCEAT LEAST 2 YEARS OF LEAD EXPERIENCE\n\nADDITIONAL REQUIREMENTS\n\nQUALIFIED CANDIDATES, EXCLUDING CURRENT NAVISTAR EMPLOYEES, MUST BE LEGALLY AUTHORIZED ON AN UNRESTRICTED BASIS (US CITIZEN, LEGAL PERMANENT RESIDENT, REFUGEE OR ASYLEE) TO BE EMPLOYED IN THE UNITED STATES. NAVISTAR DOES NOT ANTICIPATE PROVIDING EMPLOYMENT RELATED WORK SPONSORSHIP FOR THIS POSITION (E.G., H-1B STATUS)\n\nDESIRED SKILLS\n\nSUCCESSFUL PRODUCT MANAGEMENT & DEMONSTRATED SUCCESS WITH CONQUEST OR PILOT CUSTOMERSCAPABILITY TO CREATE PROFESSIONAL POWERPOINT PRESENTATIONS FOR LARGE DEALER OR EXECUTIVE MEETINGSDEMONSTRATED STRONG ANALYTICAL SKILLS AND PROFICIENCY IN MS EXCELABILITY TO TRAVEL TO DEALER AND CUSTOMER LOCATIONS IN PERSONCOMFORTABLE WITH NEW TECHNOLOGY (SOFTWARE & HARDWARE)COMFORTABLE PRESENTING TO LARGE GROUPS, IN PERSON OR REMOTESUPERIOR ORGANIZATIONAL AND FOLLOW-UP SKILLSINSURANCE, TELEMATIC, PREDICTIVE AI, DATA DRIVEN MAINTENANCE, OR WARRANTY EXPERIENCE A PLUS\n\nCOMPANY OVERVIEW\n\nNAVISTAR, INC. (“NAVISTAR”) IS A PURPOSE-DRIVEN COMPANY, REIMAGINING HOW TO DELIVER WHAT MATTERS TO CREATE MORE COHESIVE RELATIONSHIPS, BUILD HIGHER-PERFORMING TEAMS AND FIND SOLUTIONS WHERE OTHERS DON’T.\n\nBASED IN LISLE, ILLINOIS, NAVISTAR OR ITS SUBSIDIARIES AND AFFILIATES PRODUCE INTERNATIONAL® BRAND COMMERCIAL TRUCKS AND ENGINES, IC BUS® BRAND SCHOOL AND COMMERCIAL BUSES, ALL-MAKES ONCOMMAND® CONNECTION ADVANCED CONNECTIVITY SERVICES, AND FLEETRITE®, RENEWED® AND DIAMOND ADVANTAGE® BRAND AFTERMARKET PARTS.\n\nWITH A HISTORY OF INNOVATION DATING BACK TO 1831, NAVISTAR HAS MORE THAN 14,500 EMPLOYEES WORLDWIDE AND IS PART OF TRATON SE, A GLOBAL CHAMPION OF THE TRUCK AND TRANSPORT SERVICES INDUSTRY. ADDITIONAL INFORMATION IS AVAILABLE AT WWW.NAVISTAR.COM.\n\nACCELERATING THE IMPACT OF SUSTAINABLE MOBILITY\n\nVISIT US AT WWW.NAVISTAR.COM TO DISCOVER MORE ABOUT OUR ORGANIZATION\n\nNAVISTAR IS AN EQUAL OPPORTUNITY EMPLOYER. WE EVALUATE QUALIFIED APPLICANTS WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, VETERAN STATUS, AND OTHER LEGALLY PROTECTED CHARACTERISTICS.\n\n#RIDEWITHNAVISTAR",
    "job_skill_set": [
      "data analysis",
      "customer relationship management",
      "communication",
      "teamwork",
      "analytical skills",
      "organizational skills",
      "presentation skills",
      "problem solving",
      "adaptability to technology",
      "customer focus",
      "product management",
      "market research",
      "pricing strategies",
      "MS Excel",
      "PowerPoint",
      "telematics",
      "predictive AI",
      "insurance experience",
      "warranty experience"
    ],
    "short_keywords": [
      "adaptability",
      "ai",
      "analysis",
      "analytical",
      "business",
      "businessdevelopment",
      "communication",
      "contracted",
      "customer",
      "data",
      "development",
      "excel",
      "experience",
      "focus",
      "insurance",
      "management",
      "manager",
      "market",
      "ms",
      "organizational",
      "powerpoint",
      "predictive",
      "presentation",
      "pricing",
      "problem",
      "product",
      "relationship",
      "research",
      "senior",
      "skills",
      "solutions",
      "solving",
      "strategies",
      "strategy",
      "teamwork",
      "technology",
      "telematics",
      "to",
      "warranty"
    ]
  },
  {
    "job_id": "3904942719",
    "job_title": "Sale & Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "SALES & BUSINESS DEVELOPMENT MANAGERSORGANIZATION NAME: TSE INDUSTRIES WEBSITE: TSE-INDUSTRIES.COMABOUT OUR ORGANIZATION: TSE INDUSTRIES IS A GLOBAL POLYMER MANUFACTURER PROVIDING PRODUCTS AND SERVICES THAT ARE MADE IN AMERICA. AT TSE, WE HAVE THREE CORE DIVISIONS WITHIN OUR COMPANY: THE FABRICATION OF PLASTICS COMPONENTS; A CONTRACT MANUFACTURER OF SPECIALTY COATINGS, ADHESIVES, SEALANTS, AND ELASTOMERS (CASE) INCLUDING HMPURS, TDI, AND MDI PREPOLYMERS; AND THE MANUFACTURING OF MILLATHANE® MILLABLE POLYURETHANE RUBBER, AND THANECURE® AND THANECAST® PRODUCTS.\nDEPARTMENT: SALES DIVISION: EPD REPORTS TO: VP ENGINEERED POLYMERS JOB LOCATION: CLEARWATER, FL-33760 \nRESPONSIBILITIES:\nIDENTIFY MARKETS, DEVELOP STRATEGY, EXECUTE SALES PLANS, AND MANAGE ACCOUNTS AND SALES ACTIVITIES FOR TSE’S POLYMER DIVISION. PLAN, DIRECT, OR COORDINATE THE ACTUAL DISTRIBUTION OR MOVEMENT OF A PRODUCT OR SERVICE TO THE CUSTOMER. ANALYZE SALES STATISTICS TO DETERMINE SALES POTENTIAL, INVENTORY REQUIREMENTS, AND MONITOR THE PREFERENCES OF CUSTOMERS. \nESSENTIAL DUTIES AND RESPONSIBILITIES INCLUDE THE FOLLOWING. ESTABLISH, TOGETHER WITH THE VICE PRESIDENT, MARKETING GOALS TO ENSURE SHARE OF MARKET AND PROFITABILITY OF PRODUCTS AND/OR SERVICES. DEVELOP AND EXECUTE SALES PLANS AND PROGRAMS, BOTH SHORT AND LONG RANGE, TO ENSURE THE PROFIT GROWTH AND EXPANSION OF COMPANY PRODUCTS AND/OR SERVICES. RECRUIT, DIRECT, AND SUPPORT THE NETWORK OF INDEPENDENT MANUFACTURERS’ REPRESENTATIVES. RESEARCH, ANALYZE, AND MONITOR FINANCIAL, TECHNOLOGICAL, AND DEMOGRAPHIC FACTORS SO THAT MARKET OPPORTUNITIES MAY BE CAPITALIZED ON, AND THE EFFECTS OF COMPETITIVE ACTIVITY MAY BE MINIMIZED. ACHIEVE SATISFACTORY PROFIT/LOSS RATIO AND SHARE OF MARKET PERFORMANCE IN RELATION TO PRE-SET STANDARDS AND TO GENERAL AND SPECIFIC TRENDS WITHIN THE INDUSTRY AND THE ECONOMY. ENSURE EFFECTIVE CONTROL OF MARKETING RESULTS AND THAT CORRECTIVE ACTION TAKES PLACE TO BE CERTAIN THAT THE ACHIEVEMENT OF MARKETING OBJECTIVES IS WITHIN DESIGNATED BUDGETS. EVALUATE MARKET REACTIONS TO ADVERTISING PROGRAMS, MERCHANDISING POLICY, AND PRODUCT PACKAGING AND FORMULATION TO ENSURE THE TIMELY ADJUSTMENT OF MARKETING STRATEGY AND PLANS TO MEET CHANGING MARKET AND COMPETITIVE CONDITIONS. RECOMMEND CHANGES IN BASIC STRUCTURE AND ORGANIZATION OF SALES GROUP TO ENSURE THE EFFECTIVE FULFILMENT OF OBJECTIVES ASSIGNED TO IT AND PROVIDE THE FLEXIBILITY TO MORE SWIFTLY IN RELATION TO MARKETING PROBLEMS AND OPPORTUNITIES. CONDUCT MARKETING SURVEYS ON CURRENT AND NEW PRODUCT CONCEPTS. OTHER DUTIES MAY BE ASSIGNED.\n\n\n\nQUALIFICATIONSYEARS OF EXPERIENCE: 5+ PREFERREDEDUCATION: BACHELOR'S DEGREEDEGREE OR FORMAL TRAINING: BACKGROUND IN POLYMER FORM, FIT AND FUNCTION ADDITIONAL INFORMATION: ENGINEERING DEGREE PREFERRED WITH, BACKGROUND IN POLYMERS IS A PLUS.\n",
    "job_skill_set": [
      "sales strategy development",
      "account management",
      "market analysis",
      "marketing strategy",
      "recruitment",
      "customer relationship management",
      "data analysis",
      "communication",
      "leadership",
      "problem solving",
      "strategic thinking",
      "team collaboration",
      "adaptability",
      "negotiation",
      "analytical thinking",
      "financial analysis",
      "product knowledge (polymers)",
      "budget management"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "analysis",
      "analytical",
      "budget",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "customer",
      "data",
      "development",
      "financial",
      "knowledge",
      "leadership",
      "management",
      "manager",
      "market",
      "marketing",
      "negotiation",
      "polymers",
      "problem",
      "product",
      "recruitment",
      "relationship",
      "sale",
      "sales",
      "solving",
      "strategic",
      "strategy",
      "team",
      "thinking"
    ]
  },
  {
    "job_id": "3905859107",
    "job_title": "Business Development Manager (Remote)",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "AT DIGITAL SPICE, WE BELIEVE IN SUSTAINABLE, LONG-TERM GROWTH THROUGH VALUABLE RELATIONSHIP BUILDING AND NURTURING. WE WELCOME PROSPECTIVE TEAM MEMBERS WHO CAN HELP PUSH OUR VISION FORWARD. \nWE’RE CURRENTLY SEARCHING FOR AN EXPERIENCED BUSINESS DEVELOPMENT MANAGER TO CREATE AND IMPLEMENT AN EFFECTIVE SALES STRATEGIES THAT EXPAND OUR REACH AND STRENGTHEN CLIENT RELATIONSHIPS. \nTHIS IS A RARE OPPORTUNITY TO BUILD A BUSINESS DEVELOPMENT DEPARTMENT FROM THE GROUND UP, WORKING CLOSELY WITH SOME OF THE LEADING EXPERTS IN OUR INDUSTRY. OVER TIME, YOU WILL GAIN AND TRAIN SALES PROFESSIONALS, WHILE ACTIVELY SEEKING OUT OTHER BUSINESS OPPORTUNITIES TO BOOST REVENUE AND DIFFERENTIATE OUR AGENCY ON THE COMPETITIVE MARKET.\nWORK FROM THE COMFORT OF YOUR OWN HOME. THIS IS A FULL-TIME, FULLY REMOTE POSITION.\nOBJECTIVES & RESPONSIBILITIESDEVELOP AND EXECUTE A BUSINESS GROWTH STRATEGY FROM THE GROUND UPSET UP, OPTIMIZE, AND MAINTAIN A CRM SYSTEMREVIEW SALES CONTRACTS TO ENSURE THEY MEET LEGAL AND CORPORATE GUIDELINESNURTURE AND GROW RELATIONSHIPS WITH CLIENTS AND PROSPECTSPROVIDE CONTINUOUS, CONSTRUCTIVE FEEDBACK TO KEY STAKEHOLDERSUSE FINANCIAL TECHNIQUES TO IMPROVE REVENUEMONITOR AND REPORT ON SALES PROGRESS TO ENSURE THAT CORPORATE GOALS ARE BEING METTRACK ALL BUSINESS-RELATED INVOICESTRAIN AND OVERSEE THE WORK OF SALES PROFESSIONALS\n\nSKILLS & QUALIFICATIONSPROVEN RECORD OF BUSINESS AND SALES GROWTHEXPERIENCE IN CUSTOMER SERVICE, MARKETING, OR SALES-RELATED FIELDS EXPERIENCE SPECIFICALLY IN SEO, DIGITAL MARKETING, AND/OR WEB DEVELOPMENT IS A PLUS EXPERIENCE IN MANAGING SALES OR MARKETING TEAMS EDUCATIONAL BACKGROUND IN BUSINESS, MARKETING, OR FINANCE IS DESIRABLEMASTERY OF BUSINESS AND SALES GROWTH TECHNIQUESEXCEPTIONAL PROJECT AND PEOPLE MANAGEMENT SKILLS ORGANIZATIONAL SKILLS PROBLEM-SOLVING SKILLSEXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS NEGOTIATION AND NETWORKING SKILLSENTHUSIASM FOR THE ROLE, OUR AGENCY, AND OUR VISION\n\nCOMPENSATION\nBASE + COMMISSIONTARGET SALARY: $108,000 - $250,0001099 CONTRACT-BASED EMPLOYMENT\n",
    "job_skill_set": [
      "CRM systems",
      "SEO",
      "Digital marketing",
      "Web development",
      "Sales growth techniques",
      "Financial techniques",
      "Sales contracts review",
      "Business development",
      "Relationship building",
      "Project management",
      "People management",
      "Organizational skills",
      "Problem-solving",
      "Communication",
      "Negotiation",
      "Networking",
      "Enthusiasm"
    ],
    "short_keywords": [
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "contracts",
      "crm",
      "development",
      "digital",
      "enthusiasm",
      "financial",
      "growth",
      "management",
      "manager",
      "marketing",
      "negotiation",
      "networking",
      "organizational",
      "people",
      "problemsolving",
      "project",
      "relationship",
      "remote",
      "review",
      "sales",
      "seo",
      "skills",
      "systems",
      "techniques",
      "web"
    ]
  }
]