[
  {
    "job_id": "3889732648",
    "job_title": "Sr. Finance Manager",
    "category": "FINANCE",
    "job_description": "COMPANY\n\nQUALCOMM TECHNOLOGIES, INC.\n\nJOB AREA\n\nFINANCE & ACCOUNTING GROUP, FINANCE & ACCOUNTING GROUP > FINANCE\n\nGENERAL SUMMARY\n\nLOOKING FOR A QUALIFIED CANDIDATE BE PART OF QUALCOMM’S RFFE FINANCE TEAM. THIS PERSON WILL PARTNER WITH THE PRODUCT MANAGEMENT TEAM, BUSINESS DEVELOPMENT TEAM, AND SALES TEAM ON PRICING STRATEGY DEVELOPMENT AND EXECUTION. THIS PERSON WILL WORK CLOSELY WITH ALL FUNCTIONS AND REGIONS WITHIN RFFE BU. THE POSITION IS STRONG TEAM-ORIENTED AND INVOLVES COLLABORATIONS WITH ALL MAJOR QUALCOMM BUSINESS UNITS. THIS PERSON WILL MANAGE THE PRICE PLANNING AND FORECASTING PROCESS AND WORK WITH THE FP&A TEAM ON DELIVERABLES WITHIN THE DEADLINE. THIS PERSON WILL ALSO MANAGE AD HOC AND SPECIAL ANALYSES/PROJECTS FOR MANAGEMENT TEAM. GREAT OPPORTUNITY IN A HIGH VISIBILITY ROLE TO PROVIDE ANALYSIS TO EXECUTIVE TEAM WHILE WORKING WITH OTHER FINANCE ORGANIZATIONS ACROSS THE COMPANY.\n\nMINIMUM QUALIFICATIONS\n\n BACHELOR'S DEGREE. 8+ YEARS OF FINANCE, ACCOUNTING, OR RELATED WORK EXPERIENCE.COMPLETED ADVANCED DEGREES IN A RELEVANT FIELD MAY BE SUBSTITUTED FOR UP TO TWO YEARS (MASTER’S = ONE YEAR, DOCTORATE = TWO YEARS) OF WORK EXPERIENCE.\n\n\n\nPREFERRED QUALIFICATIONS\n\n MBA IS PREFERRED 12+ YEARS OF FINANCE, ACCOUNTING, OR RELATED WORK EXPERIENCE. 3+ YEARS OF WORK EXPERIENCE IN A ROLE REQUIRING INTERACTION WITH EXECUTIVE LEADERSHIP (E.G., VICE PRESIDENT LEVEL AND ABOVE). 4+ YEARS OF EXPERIENCE WORKING IN A LARGE MATRIXED ORGANIZATION. 3+ YEARS IN A LEADERSHIP ROLE WITH OR WITHOUT DIRECT REPORTS. HAS EXPERIENCE WORKING WITH PRODUCT MANAGEMENT, BUSINESS DEVELOPMENT, AND SALES TEAMS.\n\n\n\nALTHOUGH THIS ROLE HAS SOME EXPECTED MINOR PHYSICAL ACTIVITY, THIS SHOULD NOT DETER OTHERWISE QUALIFIED APPLICANTS FROM APPLYING. IF YOU ARE AN INDIVIDUAL WITH A PHYSICAL OR MENTAL DISABILITY AND NEED AN ACCOMMODATION DURING THE APPLICATION/HIRING PROCESS, PLEASE CALL QUALCOMM’S TOLL-FREE NUMBER FOUND HERE FOR ASSISTANCE. QUALCOMM WILL PROVIDE REASONABLE ACCOMMODATIONS, UPON REQUEST, TO SUPPORT INDIVIDUALS WITH DISABILITIES AS PART OF OUR ONGOING EFFORTS TO CREATE AN ACCESSIBLE WORKPLACE.\n\nQUALCOMM IS AN EQUAL OPPORTUNITY EMPLOYER AND SUPPORTS WORKFORCE DIVERSITY.\n\nTO ALL STAFFING AND RECRUITING AGENCIES: OUR CAREERS SITE IS ONLY FOR INDIVIDUALS SEEKING A JOB AT QUALCOMM. STAFFING AND RECRUITING AGENCIES AND INDIVIDUALS BEING REPRESENTED BY AN AGENCY ARE NOT AUTHORIZED TO USE THIS SITE OR TO SUBMIT PROFILES, APPLICATIONS OR RESUMES, AND ANY SUCH SUBMISSIONS WILL BE CONSIDERED UNSOLICITED. QUALCOMM DOES NOT ACCEPT UNSOLICITED RESUMES OR APPLICATIONS FROM AGENCIES. PLEASE DO NOT FORWARD RESUMES TO OUR JOBS ALIAS, QUALCOMM EMPLOYEES OR ANY OTHER COMPANY LOCATION. QUALCOMM IS NOT RESPONSIBLE FOR ANY FEES RELATED TO UNSOLICITED RESUMES/APPLICATIONS.\n\nEEO EMPLOYER: QUALCOMM IS AN EQUAL OPPORTUNITY EMPLOYER; ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, VETERAN STATUS, OR ANY OTHER PROTECTED CLASSIFICATION.\n\nQUALCOMM EXPECTS ITS EMPLOYEES TO ABIDE BY ALL APPLICABLE POLICIES AND PROCEDURES, INCLUDING BUT NOT LIMITED TO SECURITY AND OTHER REQUIREMENTS REGARDING PROTECTION OF COMPANY CONFIDENTIAL INFORMATION AND OTHER CONFIDENTIAL AND/OR PROPRIETARY INFORMATION, TO THE EXTENT THOSE REQUIREMENTS ARE PERMISSIBLE UNDER APPLICABLE LAW.\n\nPAY RANGE\n\n$139,000.00 - $209,000.00\n\nTHE ABOVE PAY SCALE REFLECTS THE BROAD, MINIMUM TO MAXIMUM, PAY SCALE FOR THIS JOB CODE FOR THE LOCATION FOR WHICH IT HAS BEEN POSTED. EVEN MORE IMPORTANTLY, PLEASE NOTE THAT SALARY IS ONLY ONE COMPONENT OF TOTAL COMPENSATION AT QUALCOMM. WE ALSO OFFER A COMPETITIVE ANNUAL DISCRETIONARY BONUS PROGRAM AND OPPORTUNITY FOR ANNUAL RSU GRANTS (EMPLOYEES ON SALES-INCENTIVE PLANS ARE NOT ELIGIBLE FOR OUR ANNUAL BONUS). IN ADDITION, OUR HIGHLY COMPETITIVE BENEFITS PACKAGE IS DESIGNED TO SUPPORT YOUR SUCCESS AT WORK, AT HOME, AND AT PLAY. YOUR RECRUITER WILL BE HAPPY TO DISCUSS ALL THAT QUALCOMM HAS TO OFFER!\n\nIF YOU WOULD LIKE MORE INFORMATION ABOUT THIS ROLE, PLEASE CONTACT QUALCOMM CAREERS.\n\n3059471",
    "job_skill_set": [
      "finance",
      "accounting",
      "forecasting",
      "financial analysis",
      "leadership",
      "project management",
      "data analysis",
      "collaboration",
      "communication",
      "teamwork",
      "problem solving",
      "adaptability",
      "strategic thinking",
      "interpersonal skills",
      "time management",
      "pricing strategy",
      "MBA",
      "FP&A"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "analysis",
      "collaboration",
      "communication",
      "data",
      "finance",
      "financial",
      "forecasting",
      "fpa",
      "interpersonal",
      "leadership",
      "management",
      "manager",
      "mba",
      "pricing",
      "problem",
      "project",
      "skills",
      "solving",
      "sr",
      "strategic",
      "strategy",
      "teamwork",
      "thinking",
      "time"
    ]
  },
  {
    "job_id": "3887700833",
    "job_title": "Equipment Finance Collections Specialist II",
    "category": "FINANCE",
    "job_description": "OVERVIEW\n\nTHIS POSITION PROVIDES ADMINISTRATIVE AND COLLECTION ACTIVITIES TO THE EQUIPMENT FINANCE DIVISION. PERFORMS A FULL RANGE OF COLLECTION ACTIVITIES ON DELINQUENT ACCOUNTS INCLUDING ADDRESSING CONCERNS, NEGOTIATING FOR RESOLUTION, WHILE PROVIDING A CUSTOMER CENTRIC APPROACH TO MITIGATE DELINQUENCY AND LOSSES. MAY PROVIDE TRAINING FOR LESS EXPERIENCED SPECIALISTS IN THE WORK GROUP.\n\nRESPONSIBILITIES\n\nOUTBOUND/INBOUND CALLS - PERFORMS A FULL RANGE OF COLLECTION ACTIVITIES BY CORRESPONDING WITH CUSTOMER TO RESOLVE DELINQUENCY, PROCESS PAYMENTS ACCURATELY, MAINTAINS RECORDS OF COLLECTION EFFORTS AND COMPLETES PROPER FOLLOW UP ACTIONS INCLUDING COLLECTION LETTERS. COMPLETES SKIP TRACING AND SITE INSPECTIONS. PERFORMS A VARIETY OF ADMINISTRATIVE AND OPERATIONAL TASKS THAT FACILITATE THE DAILY WORKFLOW WITHIN MEDIUM TO HIGH COMPLEXITY LEVELS. INTERFACES WITH SALES, OPERATIONS AND FINANCE DEPARTMENTS TO RESOLVE BILLING AND COLLECTION ISSUES.OPERATIONS AND ADMINISTRATION - PERFORMS DUTIES AND SPECIAL PROJECTS AS ASSIGNED BY MANAGEMENT TO ENSURE OPERATIONAL EFFICIENCY. COMPLIES WITH ALL REGULATIONS, BANK POLICIES, PROCEDURES, AND DELEGATED AUTHORITIES TO MANAGE RISK RELATED TO CREDIT, OPERATIONAL, REPUTATIONAL, REGULATORY, AND LEGAL ASPECTS OF PERSONAL INTERACTIONS, CUSTOMER TRANSACTIONS, AND FINANCIAL EXPOSURES. COMPLETES REQUIRED TRAINING BY ESTABLISHED DEADLINES.\n\nQUALIFICATIONS\n\nBACHELOR'S DEGREE AND 0 YEARS OF EXPERIENCE IN COLLECTIONS, CUSTOMER SERVICE, OR FINANCIAL SERVICES OR HIGH SCHOOL DIPLOMA OR GED AND 4 YEARS OF EXPERIENCE IN COLLECTIONS, CUSTOMER SERVICE, OR FINANCIAL SERVICES\n\nPREFERRED AREA OF EXPERIENCE: MID-STAGE COLLECTIONS",
    "job_skill_set": [
      "collections",
      "customer service",
      "administrative tasks",
      "negotiation",
      "record keeping",
      "financial services",
      "regulatory compliance",
      "communication",
      "problem solving",
      "teamwork",
      "customer-centric approach",
      "operational efficiency",
      "skip tracing",
      "training"
    ],
    "short_keywords": [
      "administrative",
      "approach",
      "collections",
      "communication",
      "compliance",
      "customer",
      "customercentric",
      "efficiency",
      "equipment",
      "finance",
      "financial",
      "ii",
      "keeping",
      "negotiation",
      "operational",
      "problem",
      "record",
      "regulatory",
      "service",
      "services",
      "skip",
      "solving",
      "specialist",
      "tasks",
      "teamwork",
      "tracing",
      "training"
    ]
  },
  {
    "job_id": "3902368101",
    "job_title": "AVP, Health Plan Finance (Texas)",
    "category": "FINANCE",
    "job_description": "JOB DESCRIPTION\n\nJOB SUMMARY\n\nWORK LOCATION - STATE OF TEXAS\n\nSUPPORT AN INDIVIDUAL MARKET CFO IN EITHER AN FP&A OR HEALTHCARE ANALYTICS CAPACITY. IN ADDITION TO THEIR MARKET SPECIFIC DUTIES, THE AVP FINANCE WILL SUPPORT MHI REGIONAL CFOS IN VARIOUS DUTIES AS ASSIGNED INCLUDING M&A INTEGRATION AND RFP ACTIVITIES. ACT AS INTERIM CFO OF NEW AND EXISTING MARKETS WHEN REQUIRED.\n\nKNOWLEDGE/SKILLS/ABILITIES\n\nLEAD, COACH AND DEVELOP A TEAM OF STAFF WITHIN THEIR ASSIGNED MARKET(S).LEAD HEALTH PLAN ACTIVITIES RELATING TO THE MONTHLY FISCAL CLOSING CYCLE, INCLUDING VARIOUS ACCRUALS DEVELOPED AT THE MARKET LEVEL, ANALYSIS AND EXPLANATION OF RESULTS, PREPARATION OF MATERIALS FOR MONTH END LEADERSHIP REVIEWS, IDENTIFICATION AND QUANTIFICATION OF RISKS AND OPPORTUNITIES.LEAD DEVELOPMENT OF ANNUAL FINANCIAL PLAN AND QUARTERLY FORECASTS, INCLUDING ANALYSIS OF RESULTS AND EXPLANATION OF DRIVERS OF VARIANCE TO PRIOR OUTLOOK OR EXPECTATIONS.ANALYZE INFORMATION AND REPORTING PROVIDED BY MHI MEDICAL ECONOMICS (ME) FUNCTION. VALIDATE ME OBSERVATIONS AND ADD CLARIFYING MARKET CONTEXT. ASSIST MARKET CFO AND MARKET SLT IN THE PROCESS OF TRANSLATING ME INFORMATION INTO MITIGATING ACTIONS (SCORABLE ACTION ITEMS-SAIS).ENSURE THAT ANY REGULATORY REPORTING REQUIREMENTS ASSIGNED TO THE MARKET FINANCE TEAMS ARE COMPLETED TIMELY, ACCURATELY, EFFICIENTLY.SUPPORT THEIR MARKET PROVIDER NETWORK TEAM WITH ANALYSES AND REPORTING FOR CONTRACT PRICING NEGOTIATION, VBR DEVELOPMENT AND MONITORING, JOINT OPERATING COMMITTEE DATA, ETC.ACT AS HP FINANCE INTEGRATION LEAD FOR M&A ACTIVITIES AND ACTING CFO FOR NEW MARKET RFPS UNTIL A FULL TIME MARKET CFO IS HIRED.WORK WITH INTEGRATION OFFICE AS INTERMEDIARY IN COORDINATING FINANCE RELATED INTEGRATION EFFORTS AND QUESTIONS BETWEEN MOLINA TEAM AND NEW MARKET TEAMLEAD IN THE DEVELOPMENT OF THE HEALTH PLAN BUDGET/FORECAST FOR NEW HEALTH PLANS, WITH FOCUS ON INTEGRATION INTO MOLINA STANDARD FORMATS AND SYSTEMSENGAGE WITH AREA LEADS AND SUBJECT MATTER EXPERTS TO ENSURE TIMELY IDENTIFICATION AND RESOLUTION OF ACCOUNTING AND OTHER REGULATORY ISSUES.COORDINATE TRAINING OF FINANCIAL SYSTEMS, PROCESSES AND POLICIES FOR STAFF OF NEWLEY ACQUIRED HEALTH PLANS AND TROUBLESHOOTING ISSUES AS THEY ARISE.ABILITY TO STEP IN AS NEEDED TO TEMPORARILY FILL VACANT CFO POSITIONS WITHIN MOLINA, HOLDING RESPONSABILITIES AROUND:PARTNERING WITH PLAN LEADERSHIPMONTHLY CLOSE AND REPORTING IN PARTNERSHIP WITH ACTUARIAL AND ACCOUNTING TEAMSPARTNER WITH MEDICAL ECONOMICS IN DRIVING SAI (COST IMPROVEMENT) ACTIVITIES\nJOB QUALIFICATIONS\n\nREQUIRED EDUCATION:\n\nBS OR BA IN FINANCE, ACCOUNTING, BUSINESS ADMINISTRATION, ECONOMICS, OR RELATED FIELD. \n\nREQUIRED EXPERIENCE\n\n10 YEARS PLUS ACCOUNTING AND/OR FINANCIAL ANALYSIS EXPERIENCE WITH AT LEAST 5 YEAR OF SUPERVISORY RESPONSIBILITY.HEALTH INSURANCE EXPERIENCE REQUIRED.SIGNIFICANT EXPERIENCE IN MANAGED CARE, WITH STRONG KNOWLEDGE OF MANAGED CARE FINANCE, FORECASTING AND ANALYTICS.DEMONSTRATED ABILITY TO UTILIZE FINANCIAL AND BUSINESS INTELLIGENCE TOOL SETS TO REPORT AND ANALYZE INFORMATION.ABILITY TO IDENTIFY AND SUMMARIZE DRIVERS OF FINANCIAL PERFORMANCE AND COMMUNICATE THIS INFORMATION SUCCINCTLY TO MULTIPLE LAYERS OF MANAGEMENT.HISTORY OF PROGRESSIVELY INCREASING RESPONSIBILITY IN FINANCIAL MANAGEMENT IN A MANAGED CARE ENVIRONMENT.ABILITY TO COORDINATE CROSS FUNCTIONAL PROJECTS, INCLUDING THE LEADERSHIP QUALITIES NEEDED TO PROJECT MANAGE PEERS OR HIGHER-LEVEL INDIVIDUALS WHO MAY WORK IN NON-FINANCIAL DISCIPLINES.DEMONSTRATED ABILITY TO ACCEPT A GENERAL DESCRIPTION OF A PROJECT’S OBJECTIVES FROM LEADERSHIP AND SUBSEQUENTLY BUILD APPROPRIATE ANALYTIC FRAMEWORKS, GATHER DATA INDEPENDENTLY AND BRING A PROJECT TO CONCLUSION THROUGH AN ITERATIVE PROCESS.\n\nPREFERRED EDUCATION\n\nREQUIRED LICENSE, CERTIFICATION, ASSOCIATION:\n\nMASTER’S DEGREE IN RELATED FIELD\n\nTO ALL CURRENT MOLINA EMPLOYEES: IF YOU ARE INTERESTED IN APPLYING FOR THIS POSITION, PLEASE APPLY THROUGH THE INTRANET JOB LISTING.\n\nMOLINA HEALTHCARE OFFERS A COMPETITIVE BENEFITS AND COMPENSATION PACKAGE. MOLINA HEALTHCARE IS AN EQUAL OPPORTUNITY EMPLOYER (EOE) M/F/D/V.\n\nPAY RANGE: $140,795 - $274,550.26 / ANNUAL\n\nACTUAL COMPENSATION MAY VARY FROM POSTING BASED ON GEOGRAPHIC LOCATION, WORK EXPERIENCE, EDUCATION AND/OR SKILL LEVEL.",
    "job_skill_set": [
      "financial analysis",
      "accounting",
      "financial forecasting",
      "financial reporting",
      "budgeting",
      "data analysis",
      "leadership",
      "team development",
      "communication",
      "project management",
      "problem solving",
      "cross-functional collaboration",
      "analytical thinking",
      "adaptability",
      "coaching",
      "stakeholder engagement",
      "healthcare analytics",
      "M&A integration",
      "business intelligence tools",
      "contract pricing negotiation",
      "regulatory reporting",
      "managed care finance"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "analysis",
      "analytical",
      "analytics",
      "avp",
      "budgeting",
      "business",
      "care",
      "coaching",
      "collaboration",
      "communication",
      "contract",
      "crossfunctional",
      "data",
      "development",
      "engagement",
      "finance",
      "financial",
      "forecasting",
      "health",
      "healthcare",
      "integration",
      "intelligence",
      "leadership",
      "ma",
      "managed",
      "management",
      "negotiation",
      "plan",
      "pricing",
      "problem",
      "project",
      "regulatory",
      "reporting",
      "solving",
      "stakeholder",
      "team",
      "texas",
      "thinking",
      "tools"
    ]
  },
  {
    "job_id": "3900988113",
    "job_title": "Manager, Finance",
    "category": "FINANCE",
    "job_description": "AT THERMO FISHER SCIENTIFIC, OUR FINANCE TEAMS ARE IMPORTANT TO OUR BUSINESS AND FUNCTIONAL TEAMS TO MAKE EDUCATED, SOUND DECISIONS THAT DRIVE OUR MISSION AND MAKE US A STABLE AND TRUSTED INDUSTRY LEADER. FROM FINANCIAL PLANNING & ANALYSIS, TAX, TREASURY, FINANCIAL REPORTING, AUDIT, INVESTOR RELATIONS, STRATEGY & CORPORATE DEVELOPMENT TO ACCOUNTING, OUR FINANCE FUNCTIONS HAVE A DIVERSE AND GLOBAL PRESENCE, PROVIDING SIGNIFICANT OPPORTUNITIES TO DEVELOP OUTSTANDING CAREER EXPERIENCES AND PERSPECTIVES. RANKED #92 ON THE 2022 FORTUNE 500 LIST AND WITH REVENUES OF MORE THAN $40 BILLION, YOU’LL DISCOVER ENDLESS OPPORTUNITIES TO GROW A REWARDING CAREER AS PART OF THE WORLD LEADER SERVING SCIENCE.\n\nHOW YOU WILL MAKE AN IMPACT:\n\nTHE NORTH AMERICAN & EMERGING MARKETS REGION IS A RESEARCH AND SAFETY BUSINESS WITHIN THE CUSTOMER CHANNELS GROUP, WHICH OFFERS CHOICE AND CONVENIENCE THROUGH A MYRIAD OF PRODUCTS AND SERVICES SERVING NUMEROUS END MARKETS. PRIMARY OFFICE AT PITTSBURGH, PA, USA.\n\nOUR FINANCE REPORTING AND COMMERCIAL FP&A FUNCTION IS RESPONSIBLE FOR PROVIDING OVERSIGHT AND SUPPORT FOR OUR FAST-PACED, INNOVATIVE AND GLOBAL SALES TEAMS. BY LEADING ACTIVITIES SUCH AS STRATEGIC PLANNING, BUDGETING, FORECASTING, PRICING AND CLOSE EXERCISES, WHILE LEVERAGING ANALYTICS, FORECASTING AND REPORTING SKILLS, YOU WILL HELP SHAPE THE COMMERCIAL SUCCESS OF OUR BUSINESS AREAS FOR SENIOR LEADERS AND THE SALES TEAMS. YOU WILL DEVELOP A ROBUST SKILL SET AS PART OF THIS FAST-PACED FUNCTION BY INTERACTING WITH A BROAD NUMBER OF INTERNAL BUSINESS PARTNERS AND BUILDING ORGANIZATIONAL CAPABILITIES TO DRIVE PROFITABILITY & CUSTOMER SATISFACTION. THE WORK OF THIS TEAM IS DYNAMIC WITH HIGH VISIBILITY AND IMPACT TO OUR DIVERSE CUSTOMERS, PROVIDING YOU WITH AN EXCITING OPPORTUNITY TO GAIN VALUABLE REGIONAL AND GLOBAL EXPERIENCES AND PROFESSIONAL GROWTH.\n\nSEEKING A FINANCE MANAGER TO LEAD A TEAM OF 5 WITHIN THE COMMERCIAL FINANCE TEAM TO SUPPORT SENIOR LEADERS IN DATA ORGANIZATION AND MAINTENANCE, FINANCIAL REPORTING, AND FORECASTING PROCESSES. THIS ROLE WOULD SUIT AN INDIVIDUAL WITH A REAL DESIRE TO DEVELOP AND SUCCEED WITHIN A FAST-PACED AND INNOVATIVE FP&A FUNCTION!\n\nWHAT YOU WILL DO:\n\nLEAD ON ALL ELEMENTS OF THE COMMERCIAL INCENTIVE FORECAST AND PROCESSING. THIS INCLUDES BUILDING FORECAST MODELS AND DESIGNING EFFECTIVE PROCESSES AND COMMUNICATION FLOWS THAT SCALE WITH BUSINESS GROWTHMEMORIALIZE AND ENFORCE CONTROLS ON ALL ASPECTS OF COMMERCIAL DATA HYGIENE AND FIELD REPORTINGCOLLABORATE WITH BUSINESS LEADERS TO SHARE INSIGHTS AND DRIVE IMPROVED OUTCOMES, PARTNERING WITH FUNCTIONAL TEAMS AS REQUIREDUSE VISUALIZATION TOOLS SUCH AS A POWERBI TO UNDERTAKE AD-HOC ANALYSIS TO SUPPORT MANAGEMENT DECISIONUTILIZE LARGE FINANCIAL DATASETS TO BUILD PREDICTIVE MODELS AND LEAD ON EXPLORATORY DATA ANALYSIS FOR SOPHISTICATED BUSINESS / DATA AND PROBLEM SOLVINGEMBRACE CHANGE AND APPLY A CONTINUOUS PROCESS IMPROVEMENT MINDSET: CONSIDER NEW WAYS TO ANALYZE BUSINESS DATA AND RESULTSHIRE, LEAD, COACH, STRENGTHEN AND DEVELOP THE TEAM TO ENABLE PROFESSIONAL AND TECHNICAL GROWTH AS WELL AS TALENT RETENTION\n\nHOW YOU WILL GET HERE:\n\nEDUCATION: BACHELOR’S DEGREE IN A SCIENCE, TECHNOLOGY, ENGINEERING, MATHEMATICS, FINANCE FIELD\n\nEXPERIENCE: 8+ YEARS OF RELEVANT WORKING EXPERIENCE INCLUDING PRIOR PEOPLE LEADERSHIP EXPOSURE\n\nKNOWLEDGE, SKILLS, ABILITIES\n\nPRIOR EXPERIENCE WITHIN COMMERCIAL FP&ASTRONG FINANCIAL ACUITY, INCLUDING FAMILIARITY WITH CONCEPTS OF FORECASTING, BUDGETING, AND VARIANCE ANALYSISDATA MANAGEMENT EXPERIENCE AND THE ABILITY TO MANAGE LARGE SETS OF DATA AND ACCURATE REPORTSHIGHLY ANALYTICAL AND POSSESS A STRONG BUSINESS SENSEORGANIZED MULTITASKER: YOU PRIORITIZE YOUR WORKLOAD, IN A FAST-PACED, HIGH-GROWTH ENVIRONMENT,STRONG TEAM-BUILDING SKILLS WORKING WITH A DIVERSE GROUP OF PEOPLE, EVEN IF GEOGRAPHICALLY DISPERSEDEXCELLENT COMMUNICATION AND PRESENTATION SKILLS TO COMMUNICATE ANALYSIS AND RECOMMENDATIONS IN A CONCISE INFORMATIVE MANNERABLE TO DELIVER HIGH-QUALITY EFFECTIVE PRESENTATIONS TO COMMUNICATE COMPLEX TOPICSEXCELLENT SKILLS WITH MS EXCEL ARE REQUIRED; ORACLE, HFM/CMR, SAP ANALYTICS CLOUD (SAC) ARE PREFERRED.SELF-MOTIVATED, HIGHER LEVEL OF FLEXIBILITY, AND STRONG WORK ETHIC WITH THE GOAL TO GET THE JOB DONECONTINUOUS IMPROVEMENT: IDENTIFY PROCESS AND CONTROL GAPS AND CHAMPION IMPROVEMENT INITIATIVES THROUGH PRACTICAL PROCESS IMPROVEMENT (PPI)EXHIBIT LEADERSHIP, INITIATIVE, AND THE THERMO FISHER SCIENTIFIC 4-I VALUES OF INTEGRITY, INTENSITY, INNOVATION, AND INVOLVEMENT.\n\nTRAVEL REQUIREMENTS\n\nLESS THAN 10% DOMESTIC/INTERNATIONAL TRAVEL REQUIRED\n\nBENEFITS\n\nWE OFFER COMPETITIVE REMUNERATION, ANNUAL INCENTIVE PLAN BONUS, HEALTHCARE, AND A RANGE OF EMPLOYEE BENEFITS. THERMO FISHER SCIENTIFIC OFFERS EMPLOYMENT WITH AN INNOVATIVE, FORWARD-THINKING ORGANIZATION, AND OUTSTANDING CAREER AND DEVELOPMENT PROSPECTS. WE OFFER AN EXCITING COMPANY CULTURE THAT STANDS FOR INTEGRITY, INTENSITY, INVOLVEMENT, AND INNOVATION!\n\nOUR MISSION IS TO ENABLE OUR CUSTOMERS TO MAKE THE WORLD HEALTHIER, CLEANER AND SAFER. WATCH AS OUR COLLEAGUES EXPLAIN 5 REASONS TO WORK WITH US. AS ONE TEAM OF 100,000+ COLLEAGUES, WE SHARE A COMMON SET OF VALUES - INTEGRITY, INTENSITY, INNOVATION AND INVOLVEMENT - WORKING TOGETHER TO ACCELERATE RESEARCH, SOLVE COMPLEX SCIENTIFIC CHALLENGES, DRIVE TECHNOLOGICAL INNOVATION AND SUPPORT PATIENTS IN NEED. #STARTYOURSTORY AT THERMO FISHER SCIENTIFIC, WHERE DIVERSE EXPERIENCES, BACKGROUNDS AND PERSPECTIVES ARE VALUED.\n\nAPPLY TODAY! HTTP://JOBS.THERMOFISHER.COM\n\nTHERMO FISHER SCIENTIFIC IS AN EEO/AFFIRMATIVE ACTION EMPLOYER AND DOES NOT DISCRIMINATE ON THE BASIS OF RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, PROTECTED VETERAN STATUS, DISABILITY OR ANY OTHER LEGALLY PROTECTED STATUS.\n\nWE WILL ENSURE THAT INDIVIDUALS WITH DISABILITIES ARE PROVIDED REASONABLE ACCOMMODATION TO PARTICIPATE IN THE JOB APPLICATION OR INTERVIEW PROCESS, TO PERFORM ESSENTIAL JOB FUNCTIONS, AND TO RECEIVE OTHER BENEFITS AND PRIVILEGES OF EMPLOYMENT. PLEASE CONTACT US TO REQUEST ACCOMMODATION.\n\nACCESSIBILITY/DISABILITY ACCESS\n\nJOB SEEKERS WITH A DISABILITY: THERMO FISHER SCIENTIFIC OFFERS ACCESSIBILITY SERVICE FOR JOB SEEKERS REQUIRING ACCOMMODATIONS IN THE JOB APPLICATION PROCESS. FOR EXAMPLE, THIS MAY INCLUDE INDIVIDUALS REQUIRING ASSISTANCE BECAUSE OF HEARING, VISION, MOBILITY, OR COGNITIVE IMPAIRMENTS. IF YOU ARE A JOB SEEKER WITH A DISABILITY, OR ASSISTING A PERSON WITH A DISABILITY, AND REQUIRE ACCESSIBILITY ASSISTANCE OR AN ACCOMMODATION TO APPLY FOR ONE OF OUR JOBS, PLEASE SUBMIT A REQUEST BY TELEPHONE AT 1-855-471-2255*. PLEASE INCLUDE YOUR CONTACT INFORMATION AND SPECIFIC DETAILS ABOUT YOUR REQUIRED ACCOMMODATION TO SUPPORT YOU DURING THE JOB APPLICATION PROCESS.\n\nTHIS TELEPHONE LINE IS RESERVED SOLELY FOR JOB SEEKERS WITH DISABILITIES REQUIRING ACCESSIBILITY ASSISTANCE OR AN ACCOMMODATION IN THE JOB APPLICATION PROCESS. MESSAGES LEFT FOR OTHER PURPOSES, SUCH AS NOT BEING ABLE TO GET INTO THE CAREER WEBSITE, FOLLOWING UP ON AN APPLICATION, OR OTHER NON-DISABILITY RELATED TECHNICAL ISSUES WILL NOT RECEIVE A RESPONSE.\n\n",
    "job_skill_set": [
      "financial planning & analysis",
      "forecasting",
      "budgeting",
      "financial reporting",
      "data management",
      "analytics",
      "MS Excel",
      "Oracle",
      "process improvement",
      "leadership",
      "communication",
      "team building",
      "problem solving",
      "organizational skills",
      "flexibility",
      "self-motivation",
      "initiative",
      "customer focus",
      "collaboration",
      "Power BI",
      "HFM/CMR",
      "SAP Analytics Cloud (SAC)",
      "predictive modeling"
    ],
    "short_keywords": [
      "analysis",
      "analytics",
      "bi",
      "budgeting",
      "building",
      "cloud",
      "collaboration",
      "communication",
      "customer",
      "data",
      "excel",
      "finance",
      "financial",
      "flexibility",
      "focus",
      "forecasting",
      "hfmcmr",
      "improvement",
      "initiative",
      "leadership",
      "management",
      "manager",
      "modeling",
      "ms",
      "oracle",
      "organizational",
      "planning",
      "power",
      "predictive",
      "problem",
      "process",
      "reporting",
      "sac",
      "sap",
      "selfmotivation",
      "skills",
      "solving",
      "team"
    ]
  },
  {
    "job_id": "3905334530",
    "job_title": "Mintek Resources- Finance, Senior Manager",
    "category": "FINANCE",
    "job_description": "JOB DESCRIPTION\n\nSUMMARY OF PRIMARY RESPONSIBILTIES\n\n LEADS FINANCIAL REPORTING PROCESSES AND MONITORS THE FINANCIAL PERFORMANCE OF MINTEK.  PROVIDES STRATEGIC ADVICE TO MAXIMIZE OVERALL VALUE CREATION BY MINTEK.  FULL RESPONSIBILITY OF THE MANAGEMENT REPORTING PREPARED FOR MINTEK’S OPERATIONS.  ENSURES THE DATA QUALITY WITHIN THE REPORTING TOOL.  ORGANIZES AND REVIEWS TASKS PERFORMED BY HIS/HER TEAM. \n\nJOB DUTIES (NOT EXHAUSTIVE):\n\nMEMBER OF MINTEK LEADERSHIP TEAM \n\n COLLABORATE WITH SALES, LOGISTICS, OPERATIONS TO CONTINUALLY IMPROVE PROCESSES AND SUPPORT GROWTH.  PRESENTS MONTHLY PERFORMANCE AND FINANCIAL REFORECAST TO MINTEK MANAGEMENT.  PROVIDE STRATEGIC SUPPORT TO MINTEK GENERAL MANAGER AND LEADERSHIP TEAM.  OVERSIGHT OVER THE ANNUAL BUDGETING PROCESS, MONTH END CLOSE PROCESS/SUBMISSION OF FINANCIALS FOR CORPORATE CONSOLIDATION, AND MONTHLY AND WEEKLY FORECAST UPDATES. \n\nTIMELY & ACCURATE SALES TRANSACTION INVOICING AND REPORTING (PRIMARILY REVIEW/OVERSIGHT/ANALYSIS; INVOLVEMENT IN PROCESS IMPROVEMENTS AND ISSUES AS THEY ARISE)\n\n SUPPORT COLLABORATION BETWEEN ACCOUNTING AND LOGISTICS/SUPPLY CHAIN RELATED TO THE FLOW OF SALES DATA FROM SALES ORDER ENTRY IN SALESFORCE TO CUSTOMER INVOICING/GL POSTING IN SAGE.  REVIEW WEEKLY TRANSACTION BATCHES PRIOR TO POSTING; IDENTIFY POSSIBLE ERRORS, UNDERSTAND MARGIN/PRODUCT TRENDS, WEEKLY COMMUNICATION TO LEADERSHIP TEAM.  OTHER – DEMURRAGE INVOICING / PIG RENTAL INVOICING \n\nINVENTORY MANAGEMENT (PRIMARILY REVIEW/OVERSIGHT/ANALYSIS; INVOLVEMENT IN PROCESS IMPROVEMENTS AND ISSUES AS THEY ARISE; MORE INVOLVEMENT IN PRODUCT COSTING AS NECESSARY)\n\n REVIEW WEEKLY INVENTORY BATCHES PRIOR TO POSTING; UNDERSTAND AND COMMUNICATE CHANGES IN INVENTORY COSTS BASED ON SOURCES/FREIGHT.  ITEM MANAGEMENT / SET UP / COSTS / FCB VS. SCB  TERMINAL/RAIL SET UP / COSTS  INVENTORY RECONCILIATION PROCESS  COLLABORATE WITH LOGISTICS ON RAIL PROCESSES. \n\nCOLLECTIONS / CUSTOMER & VENDOR MANAGEMENT (PRIMARILY OVERSIGHT AND REVIEW; HOWEVER, NECESSARY TO STAY ON TOP OF AR AGING AND BE INVOLVED IN CERTAIN COLLECTION ISSUES, HIGHER LEVEL CUSTOMER NEEDS)\n\n NEW CUSTOMER REVIEW / CREDIT DECISIONING  MANAGE CASH RECEIPTS & AP PROCESSES  AR COLLECTIONS – MANAGE STAGES OF COLLECTION PROCESS AND SPECIFIC INVOLVEMENT WITH PROBLEM ACCOUNTS.  REVIEW AND SIGN PURCHASE ORDERS / MSAS / LIEN WAIVERS  SUPPORT OTHER CUSTOMER NEEDS FOR THEIR VENDOR REQUIREMENTS ’. \n\nSALES TAX PROCESS (PRIMARILY REVIEW/OVERSIGHT WITH SPECIFIC RESPONSIBILITIES AS FOLLOWS) \n\n REVIEW OF MONTHLY SALES TAX LIABILITY  MONTHLY FILING & PAYMENTS TO VARIOUS STATES  MANAGE SALES TAX COMMUNICATIONS/REQUESTS FROM STATE ENTITIES.  SUPPORT PROCESS IMPROVEMENTS AND CUSTOMER COMMUNICATIONS TO ENSURE TAX EXEMPTION INFORMATION IS RECEIVED TIMELY. \n\nSYSTEM MANAGEMENT /PROCESS MANAGEMENT\n\n SAGE (ACCOUNTING ERP), EXPERIENCE PREFERRED BUT NOT A MUST  DOCLINK/SMARTCAPTURE OCR (IN PROCESS)  DATA FLOW & LINKS FROM SALESFORCE TO SAGE/SAGE TO SALESFORCE (COMMERCIENT)  WORK DIRECTLY WITH SYSTEM CONSULTANTS (NET @ WORK) & CARMEUSE IT \n\nBASIC REQUIREMENTS\n\n POST-SECONDARY EDUCATION IN FINANCE OR ACCOUNTING; CPA OR CMA ACCREDITATION  STRONG MANAGERIAL AND SUPERVISORY EXPERIENCE  SOLID KNOWLEDGE OF ACCOUNTING STANDARDS AND REGULATORY RULES  EXCELLENT COMMUNICATION SKILLS AND ABILITY TO BUILD RELATIONSHIPS.  ANALYTICAL WITH A LOGICAL APPROACH  PROFICIENCY IN MICROSOFT OFFICE  STRONG PRESENTATION SKILLS  STRONG WRITTEN COMMUNICATION  APPROACHABILITY \n\nREQUIRED KNOWLEDGE\n\n CONTROLLING EXPERTISE (PLANNING, BUDGETING, AND ACCOUNTING)  ADVANCED SKILLS IN EXCEL® AND POWERPOINT®  EXPOSED TO STRATEGIC PROJECTS \n\nREQUIRED SKILLS\n\n EXCELLENT COMMUNICATION AND PRESENTATION SKILLS – GOOD STORY TELLING IS A MUST  EXCELLENT ANALYTICAL SKILLS (ABILITY TO BOTH GO INTO THE DETAILS AND TAKE A HELICOPTER VIEW)  DEMONSTRATED ABILITY TO ASSESS ORGANIZATIONAL AND PEOPLE ISSUES, PROVIDE TRAINING, COACHING AND MENTORING, AND DELIVER SOLUTIONS THAT IMPROVE PERFORMANCE  ABILITY TO INTERPRET AND CHALLENGE CRITICAL KEY PERFORMANCE INDICATORS AND TRANSLATE THESE IN RELEVANT MANAGEMENT REPORTING  CREATIVITY (WILLING TO BRING CREATIVE AND INNOVATIVE SOLUTIONS TO PROBLEMS, REPORTING AND BENCHMARKING NEEDS)  INTELLECTUAL AGILITY (ABILITY TO PLAY WITH FIGURES – THE ABILITY TO UNDERSTAND THE BUSINESS REALITY BEHIND THE FIGURES)  PERSISTENT/TENACITY (WILLING TO GO THE EXTRA MILE), RIGOR, AND ASSERTIVENESS \n\nBENEFITS & COMPENSATION PACKAGE INCLUDES:\n\n PAID HOLIDAYS AND VACATION TIME  GROUP MEDICAL/PHARMACY INSURANCE OPTIONS WITH COMPANY FUNDED HEALTH CARE SPENDING ACCOUNTS  DENTAL INSURANCE & VISION INSURANCE  A 401K ACCOUNT WITH COMPANY MATCHING CONTRIBUTION  A ROBUST WELLNESS PROGRAM WITH FINANCIAL REWARDS  COMPANY-PAID LIFE INSURANCE AND SHORT-TERM AND LONG-TERM DISABILITY INSURANCE  OPTIONS TO PURCHASE ADDITIONAL LIFE INSURANCE (EMPLOYEE, SPOUSE, AND CHILD) AND ADDITIONAL EMPLOYEE LONG-TERM DISABILITY INSURANCE.  EMPLOYEE ASSISTANCE PROGRAM (EAP)  TUITION BENEFITS INCLUDING PROFESSIONAL CERTIFICATIONS  EMPLOYEE REFERRAL PROGRAM \n\nABOUT US\n\nREADY TO JOIN A ROCK-SOLID FAMILY?\n\nCARMEUSE STARTED OUT AS A SMALL FAMILY-RUN BUSINESS IN BELGIUM.\n\nTODAY IT’S A LEADING GLOBAL PRODUCER OF LIME, HIGH CALCIUM LIMESTONE AND DOLOMITIC STONE. ITS PRODUCTS ARE ESSENTIAL TO ENERGY PRODUCERS, ENVIRONMENTAL SERVICES, CONSTRUCTION AND MANUFACTURING.\n\nWITH OVER 90 PRODUCTION FACILITIES SPREAD ACROSS ALMOST EVERY CONTINENT, AND OVER 4,500 EMPLOYEES WORKING AT CARMEUSE EVERY DAY, THE COMPANY’S MOST TREASURED RESOURCES ARE ITS PEOPLE.\n\nCARMEUSE IS DEDICATED TO MAINTAINING A WORKPLACE THAT FOSTERS EQUAL OPPORTUNITY AND CREATES A DIVERSE AND INCLUSIVE WORK ENVIRONMENT. ALL QUALIFIED APPLICANTS WILL BE CONSIDERED FOR EMPLOYMENT REGARDLESS OF RACE, COLOR, RELIGION, SEX, NATIONAL ORIGIN, DISABILITY, PROTECTED VETERAN STATUS, SEXUAL ORIENTATION OR GENDER IDENTITY. IF YOU REQUIRE PARTICULAR ASSISTANCE WITH ANY PART OF THE APPLICATION OR HIRING PROCESS DUE TO A DISABILITY, YOU CAN SUBMIT YOUR REQUEST BY SENDING AN EMAIL TO HRSUPPORT@CARMEUSE.COM. THIS OPTION IS RESERVED FOR PEOPLE REQUIRING ADAPTATION DUE TO A DISABILITY. THE INFORMATION RECEIVED WILL BE PROCESSED BY CARMEUSE AND THEN DIRECTED TO A LOCAL RECRUITER WHO WILL PROVIDE ASSISTANCE TO ENSURE THE PROPER CONSIDERATION OF THE APPLICATION OR HIRING PROCESS.\n\nORGANIZATION\n\nAS A MEMBER OF THE CARMEUSE GROUP, MINTEK RESOURCES, INC. HAS PROVIDED SOLUTIONS TO THE ENVIRONMENTAL, CONSTRUCTION, AGRICULTURAL, OIL & GAS, WASTE WATER TREATMENT, INDUSTRIAL MARKETS & MORE, SINCER 1994. OUR SOLUTIONS ARE ECONOMICAL REAGENTS THAT ASSIST WITH DRYING, MODIFYING, STABILIZING, NEUTRALIZING, AND FIXATING SOILS, SEDIMENTS, WASTE STREAMS, & CONTAMINANTS. WE ARE YOUR ONE-STOP SHOP FOR CALCIMENT, QUICKLIME, BED ASH, FLY ASH, CEMENT, HYDRATE LIME, & MORE!\n\nMINTEK IS DEDICATED TO MAINTAINING A WORKPLACE THAT FOSTERS EQUAL OPPORTUNITY AND CREATES A DIVERSE AND INCLUSIVE WORK ENVIRONMENT. ALL QUALIFIED APPLICANTS WILL BE CONSIDERED FOR EMPLOYMENT REGARDLESS OF RACE, COLOR, RELIGION, SEX, NATIONAL ORIGIN, DISABILITY, PROTECTED VETERAN STATUS, SEXUAL ORIENTATION OR GENDER IDENTITY. IF YOU REQUIRE PARTICULAR ASSISTANCE WITH ANY PART OF THE APPLICATION OR HIRING PROCESS DUE TO A DISABILITY, YOU CAN SUBMIT YOUR REQUEST BY SENDING AN EMAIL TO HRSUPPORT@CARMEUSE.COM. THIS OPTION IS RESERVED FOR PEOPLE REQUIRING ADAPTATION DUE TO A DISABILITY. THE INFORMATION RECEIVED WILL BE PROCESSED BY CARMEUSE AND THEN DIRECTED TO A LOCAL RECRUITER WHO WILL PROVIDE ASSISTANCE TO ENSURE THE PROPER CONSIDERATION OF THE APPLICATION OR HIRING PROCESS.",
    "job_skill_set": [
      "Excel",
      "PowerPoint",
      "inventory management",
      "communication",
      "approachability",
      "team collaboration",
      "presentation skills",
      "financial reporting",
      "budgeting",
      "accounting standards",
      "SAGE (Accounting ERP)",
      "Salesforce",
      "data analysis",
      "sales tax compliance",
      "management reporting",
      "CPA or CMA accreditation",
      "leadership",
      "analytical thinking",
      "problem solving",
      "creativity",
      "mentoring",
      "assertiveness"
    ],
    "short_keywords": [
      "accounting",
      "accreditation",
      "analysis",
      "analytical",
      "approachability",
      "assertiveness",
      "budgeting",
      "cma",
      "collaboration",
      "communication",
      "compliance",
      "cpa",
      "creativity",
      "data",
      "erp",
      "excel",
      "finance",
      "financial",
      "inventory",
      "leadership",
      "management",
      "manager",
      "mentoring",
      "mintek",
      "or",
      "powerpoint",
      "presentation",
      "problem",
      "reporting",
      "resources",
      "sage",
      "sales",
      "salesforce",
      "senior",
      "skills",
      "solving",
      "standards",
      "tax",
      "team",
      "thinking"
    ]
  },
  {
    "job_id": "3904432275",
    "job_title": "Finance Business Partner, MEP",
    "category": "FINANCE",
    "job_description": "YOUR TITLE: FINANCE BUSINESS PARTNER, MEP\n\nJOB LOCATION: WESTMINSTER, COLORADO- IN OFFICE, HYBRID\n\nDEPARTMENT: AECO SECTOR / MECHANICAL, ELECTRICAL, AND PLUMBING (MEP) DIVISION\n\nARE YOU A FINANCIAL ANALYST WHO IS LOOKING TO MOVE YOUR CAREER TO THE NEXT LEVEL?\n\nWHAT YOU WILL DO\n\nAS A FINANCE BUSINESS PARTNER SPECIALIZING IN SUPPORTING DEVELOPMENT, PRODUCT MANAGEMENT, AND CLOUDOPS, YOU WILL PLAY A PIVOTAL ROLE IN DRIVING FINANCIAL STRATEGY AND DECISION MAKING WITH EXPOSURE TO THE SENIOR DIVISION MANAGEMENT TEAM. YOU WILL HELP TO DEVELOP AND TRACK STRATEGIC BUSINESS DECISIONS TO DRIVE EFFICIENT CAPITAL ALLOCATION ALIGNED WITH PRODUCT-LED GROWTH INITIATIVES.\n\nTHIS ROLE PROVIDES A GREAT OPPORTUNITY FOR A FINANCIAL PROFESSIONAL TO GROW THEIR CAREER ON A WIDE VARIETY OF FINANCIAL TOPICS, REPORTING TO THE MEP NORTH AMERICA FINANCE MANAGER.\n\nSUPPORT THE OPERATIONS OF THE TRIMBLE MEP DIVISION WITH A FOCUS ON FORECASTING, VARIANCE ANALYSIS, MODELING, AND REPORTING OF MONTHLY AND QUARTERLY RESULTSSERVE AS A TRUSTED BUSINESS ADVISOR FOR HIGH LEVEL LEADERS, PROVIDING FINANCIAL GUIDANCE AND SUPPORT TO FACILITATE INFORMED DECISION MAKINGANALYZE FINANCIAL PERFORMANCE, IDENTIFY TRENDS, AND PROVIDE ACTIONABLE INSIGHTS TO BUSINESS STAKEHOLDERS TO OPTIMIZE RESOURCE AND CAPITAL ALLOCATION AND BRING ACTION TO INEFFICIENCIES DRIVE PROCESS IMPROVEMENTS AND AUTOMATION INITIATIVES TO STREAMLINE FINANCIAL PROCESSES, ENHANCE EFFICIENCY, AND IMPROVE DATA AND FORECAST ACCURACY\n\nWHAT SKILLS & EXPERIENCE YOU SHOULD BRING\n\n2+ YEARS OF EXPERIENCE IN FINANCIAL PLANNING & ANALYSIS BACHELOR’S DEGREE - FINANCE AND/OR ACCOUNTING BACKGROUND PREFERREDSTRONG MS/GOOGLE OFFICE SKILLS ( EXCEL/GOOGLE SHEETS, WORD, AND POWERPOINT). “ROLL UP THE SLEEVES” SELF-STARTER MENTALITY WITH THE ABILITY TO BOTH DIG INTO THE DETAILS AND THINK HIGHER LEVELBASIC KNOWLEDGE OF US GAAP RESPECT AND PROMOTE INCLUSION AND DIVERSITY\n\nWHAT SKILLS & EXPERIENCE YOU COULD BRING\n\nFAMILIARITY WITH A SUBSCRIPTION/ARR BASED ENVIRONMENTEXPERIENCE WITH DOMO, TABLEAU, SQL OR POWER BI EXPERIENCE WITH WORKDAY ADAPTIVE INSIGHTS, OR OTHER FP&A EPM PLATFORMS IS PREFERREDSOFTWARE INDUSTRY EXPERIENCE IN A HIGH GROWTH ENVIRONMENT IS A PLUS! \n\nABOUT YOUR LOCATION\n\nTHIS ROLE WILL REPORT OUT OF THE WESTMINSTER, COLORADO TRIMBLE OFFICE. THE EXPECTATION IS THAT THE INDIVIDUAL THAT WILL FILL THIS ROLE IS ABLE TO OPERATE AS AN “ONSITE” OR AS A “HYBRID” EMPLOYEE, REPORTING TO THE OFFICE 3-5 DAYS PER WEEK\n\nABOUT OUR MECHANICAL, ELECTRICAL, PLUMBING (MEP) DIVISION\n\nAT TRIMBLE, WE HAVE ONE SIMPLE GOAL: TO TRANSFORM THE WAY THE WORLD WORKS. WITH ADVANCED PRODUCTS AND SERVICES, THE TRIMBLE MEP DIVISION MAKES A DIFFERENCE IN THE INSTALLATION SECTOR. THE COMBINATION OF SOFTWARE AND DATA GIVES US A WINNING PROPOSITION WORLDWIDE. FROM DESIGN SOFTWARE TO AN ONLINE BIM LIBRARY: OUR PRODUCTS HELP INSTALLERS, ENGINEERS, AND CONTRACTORS TO REALIZE BETTER TECHNICAL BUILDING INSTALLATIONS AND DELIVER CONSTRUCTION PROJECTS WITH MORE CONTROL AND MORE PREDICTABILITY.\n\nINFORMATION TO REVIEW\n\nTRIMBLE MEP\n\nMEP EVENTS\n\nVIDEOS TO REVIEW\n\nTRIMBLE: INNOVATION AT ITS BEST\n\nTRIMBLE: A HISTORY OF OUTSTANDING INNOVATIONS\n\nTRIMBLE ACCUBID ANYWHERE\n\nABOUT TRIMBLE\n\nDEDICATED TO THE WORLD’S TOMORROW, TRIMBLE IS A TECHNOLOGY COMPANY DELIVERING SOLUTIONS THAT ENABLE OUR CUSTOMERS TO WORK IN NEW WAYS TO MEASURE, BUILD, GROW AND MOVE GOODS FOR A BETTER QUALITY OF LIFE. CORE TECHNOLOGIES IN POSITIONING, MODELING, CONNECTIVITY AND DATA ANALYTICS CONNECT THE DIGITAL AND PHYSICAL WORLDS TO IMPROVE PRODUCTIVITY, QUALITY, SAFETY, TRANSPARENCY AND SUSTAINABILITY. FROM PURPOSE-BUILT PRODUCTS AND ENTERPRISE LIFECYCLE SOLUTIONS TO INDUSTRY CLOUD SERVICES, TRIMBLE IS TRANSFORMING CRITICAL INDUSTRIES SUCH AS CONSTRUCTION, GEOSPATIAL, AGRICULTURE AND TRANSPORTATION TO POWER AN INTERCONNECTED WORLD OF WORK. FOR MORE INFORMATION ABOUT TRIMBLE (NASDAQ: TRMB), VISIT: WWW.TRIMBLE.COM\n\nTRIMBLE’S INCLUSIVENESS COMMITMENT\n\nWE BELIEVE IN CELEBRATING OUR DIFFERENCES. THAT IS WHY OUR DIVERSITY IS OUR STRENGTH. TO US, THAT MEANS ACTIVELY PARTICIPATING IN OPPORTUNITIES TO BE INCLUSIVE. DIVERSITY, EQUITY, AND INCLUSION HAVE GUIDED OUR CURRENT SUCCESS WHILE ALSO MOVING OUR DESIRE TO IMPROVE. WE ACTIVELY SEEK TO ADD MEMBERS TO OUR COMMUNITY WHO REPRESENT OUR CUSTOMERS AND THE PLACES WE LIVE AND WORK.\n\nWE HAVE PROGRAMS IN PLACE TO MAKE SURE OUR PEOPLE ARE SEEN, HEARD, AND WELCOMED AND MOST IMPORTANTLY THAT THEY KNOW THEY BELONG, NO MATTER WHO THEY ARE OR WHERE THEY ARE COMING FROM.\n\nTRIMBLE INC. IS PROUD TO BE AN EQUAL OPPORTUNITY AND AFFIRMATIVE ACTION EMPLOYER AND CONSIDERS QUALIFIED APPLICANTS FOR EMPLOYMENT WITHOUT REGARD TO RACE, GENDER, AGE, COLOR, RELIGION, NATIONAL ORIGIN, MARITAL STATUS, DISABILITY, SEXUAL ORIENTATION, STATUS AS A COVERED VETERAN IN ACCORDANCE WITH APPLICABLE FEDERAL, STATE AND LOCAL LAWS, OR ANY OTHER PROTECTED FACTOR. EOE/M/F/V/D\n\nTRIMBLE’S PRIVACY POLICY\n\nPAY EQUITY\n\nTRIMBLE PROVIDES THE FOLLOWING COMPENSATION RANGE AND GENERAL DESCRIPTION OF OTHER COMPENSATION AND BENEFITS THAT IT IN GOOD FAITH BELIEVES IT MIGHT PAY AND/OR OFFER FOR THIS POSITION. THIS COMPENSATION RANGE IS BASED ON A FULL TIME SCHEDULE. TRIMBLE RESERVES THE RIGHT TO ULTIMATELY PAY MORE OR LESS THAN THE POSTED RANGE AND OFFER ADDITIONAL BENEFITS AND OTHER COMPENSATION, DEPENDING ON CIRCUMSTANCES NOT RELATED TO AN APPLICANT’S SEX OR OTHER STATUS PROTECTED BY LOCAL, STATE, OR FEDERAL LAW.\n\nHIRING RANGE\n\n70278\n\n91478\n\nBONUS ELIGIBLE?\n\nNO\n\nTRIMBLE OFFERS COMPREHENSIVE CORE BENEFITS THAT INCLUDE MEDICAL, DENTAL, VISION, LIFE, DISABILITY, TIME OFF PLANS AND RETIREMENT PLANS. MOST OF OUR BUSINESSES ALSO OFFER TAX SAVINGS PLANS FOR HEALTH, DEPENDENT CARE AND COMMUTER EXPENSES AS WELL AS PAID PARENTAL LEAVE AND EMPLOYEE STOCK PURCHASE PLAN.\n\nTRIMBLE IS PROUD TO BE AN EQUAL OPPORTUNITY EMPLOYER. WE WELCOME AND EMBRACE OUR\n\nCANDIDATES' DIVERSITY AND TAKE AFFIRMATIVE ACTION TO EMPLOY AND ADVANCE INDIVIDUALS\n\nWITHOUT REGARD TO RACE, COLOR, SEX, GENDER IDENTITY OR EXPRESSION, SEXUAL ORIENTATION,\n\nRELIGION, AGE, PHYSICAL OR MENTAL DISABILITY, VETERAN STATUS, PREGNANCY (INCLUDING\n\nCHILDBIRTH OR RELATED MEDICAL CONDITIONS), NATIONAL ORIGIN, MARITAL STATUS, GENETIC\n\nINFORMATION, AND ALL OTHER LEGALLY PROTECTED CHARACTERISTICS. WE FORBID DISCRIMINATION AND\n\nHARASSMENT IN THE WORKPLACE BASED ON ANY PROTECTED STATUS OR CHARACTERISTIC. A CRIMINAL\n\nHISTORY IS NOT AN AUTOMATIC BAR TO EMPLOYMENT WITH THE COMPANY, AND WE CONSIDER\n\nQUALIFIED APPLICANTS CONSISTENT WITH APPLICABLE FEDERAL, STATE, AND LOCAL LAW.\n\nTHE COMPANY IS ALSO COMMITTED TO PROVIDING REASONABLE ACCOMMODATIONS FOR\n\nINDIVIDUALS WITH DISABILITIES, AND INDIVIDUALS WITH SINCERELY HELD RELIGIOUS BELIEFS IN OUR JOB\n\nAPPLICATION PROCEDURES. IF YOU NEED ASSISTANCE OR AN ACCOMMODATION FOR YOUR JOB, CONTACT\n\nASKPX@PX.TRIMBLE.COM",
    "job_skill_set": [
      "reporting",
      "communication",
      "problem solving",
      "teamwork",
      "self-starter mentality",
      "adaptability",
      "financial analysis",
      "forecasting",
      "variance analysis",
      "modeling",
      "MS Excel",
      "Google Sheets",
      "US GAAP",
      "SQL",
      "Tableau",
      "Power BI",
      "Workday Adaptive Insights",
      "FP&A EPM platforms",
      "strategic thinking",
      "inclusiveness"
    ],
    "short_keywords": [
      "adaptability",
      "adaptive",
      "analysis",
      "bi",
      "business",
      "communication",
      "epm",
      "excel",
      "finance",
      "financial",
      "forecasting",
      "fpa",
      "gaap",
      "google",
      "inclusiveness",
      "insights",
      "mentality",
      "mep",
      "modeling",
      "ms",
      "partner",
      "platforms",
      "power",
      "problem",
      "reporting",
      "selfstarter",
      "sheets",
      "solving",
      "sql",
      "strategic",
      "tableau",
      "teamwork",
      "thinking",
      "us",
      "variance",
      "workday"
    ]
  },
  {
    "job_id": "3905295420",
    "job_title": "Financial Services Risk Management, Structured Finance - Transactions, Manager",
    "category": "FINANCE",
    "job_description": "EY FOCUSES ON HIGH-ETHICAL STANDARDS AND INTEGRITY AMONG ITS EMPLOYEES AND EXPECTS ALL CANDIDATES TO DEMONSTRATE THESE QUALITIES. AT EY, YOU’LL HAVE THE CHANCE TO BUILD A CAREER AS UNIQUE AS YOU ARE, WITH THE GLOBAL SCALE, SUPPORT, INCLUSIVE CULTURE AND TECHNOLOGY TO BECOME THE BEST VERSION OF YOU. AND WE’RE COUNTING ON YOUR UNIQUE VOICE AND PERSPECTIVE TO HELP EY BECOME EVEN BETTER, TOO. JOIN US AND BUILD AN EXCEPTIONAL EXPERIENCE FOR YOURSELF, AND A BETTER WORKING WORLD FOR ALL.\n\nTHIS POSITION COULD BE LOCATED IN NY, TX.\n\nEY IS A LEADER IN SERVING THE GLOBAL FINANCIAL SERVICES MARKETPLACE AND THE ONLY PROFESSIONAL SERVICES FIRM WITH A SEPARATE BUSINESS UNIT DEDICATED TO THE FINANCIAL SERVICES INDUSTRY – THE FINANCIAL SERVICES ORGANIZATION (FSO). OUR FOCUSED MODEL AND BOLD AMBITION HAVE PUT US AT THE CENTER OF THE EVENTS THAT CONTINUE TO RESHAPE AND REDEFINE OUR INDUSTRY, WORKING SIDE BY SIDE WITH A RANGE OF CLIENTS FROM OUR MOST VENERABLE INSTITUTIONS TO DYNAMIC NEW ENTRANTS ACROSS BANKING AND CAPITAL MARKETS, WEALTH AND ASSET MANAGEMENT AND INSURANCE. OUR PURPOSE IS TO HELP BUILD A FINANCIAL SERVICES INDUSTRY IN WHICH FINANCIAL INSTITUTIONS ARE TRUSTED AND FLOURISH, AND THE GLOBAL ECONOMY IS HEALTHY, GROWING AND SECURE. IF YOU HAVE A PASSION FOR RALLYING TOGETHER TO SOLVE COMPLEX CHALLENGES, THEN COME JOIN OUR DYNAMIC FSO TEAM!\n\nTHE OPPORTUNITY\n\nTHE STRUCTURED FINANCE GROUP, IS A GROUP WITHIN FSO THAT SPECIALIZES IN ADDRESSING VARYING NEEDS OF MARKET PARTICIPANTS IN THE SECURITIZATION MARKETPLACE ACROSS ASSET CLASSES, INCLUDING ASSET- BACKED SECURITIES (ABS), COMMERCIAL MORTGAGE- BACKED SECURITIES (CMBS), RESIDENTIAL MORTGAGE- BACKED SECURITIES (RMBS) AND COLLATERALIZED LOAN OBLIGATIONS (CLO). THE SECURITIZATION MARKET IS A DYNAMIC MARKETPLACE, CONTINUOUSLY EVOLVING WITH NEW REGULATIONS AND TECHNOLOGICAL ADVANCES EVERY DAY. THIS A GREAT OPPORTUNITY TO WORK IN THIS FAST-PACED ENVIRONMENT, LEAD DIVERSE ENGAGEMENT TEAMS, WORK WITH A WIDE VARIETY OF CLIENTS AND LEAD BUSINESS DEVELOPMENT ACTIVITIES ON STRATEGIC AND GLOBAL PRIORITY ACCOUNTS.\n\nYOUR KEY RESPONSIBILITIES\n\nTHE STRUCTURED FINANCE VALUATION ANALYSIS AND PRICING (VAP) TEAM PROVIDES AN ARRAY OF SERVICES TO THE FIRM'S AUDIT CLIENTS IN THE ANALYSIS OF THEIR PORTFOLIOS OF FIXED INCOME INVESTMENTS, INCLUDING ABS, CMBS, RMBS AND CLOS. OUR TEAM LEVERAGES OUR MARKET KNOWLEDGE AND THIRD PARTY TECHNOLOGY PLATFORMS IN ORDER TO PROVIDE IN DEPTH ANALYSIS ON STRUCTURED PRODUCT SECURITIES.\n\nMANAGING AND MOTIVATING TEAMS WITH DIVERSE SKILLS AND BACKGROUNDS IN AN INCLUSIVE TEAM-ORIENTED WORK ENVIRONMENTPLAYING AN ACTIVE ROLE IN COUNSELING AND MENTORING JUNIOR CONSULTANTSREVIEWING STRATIFICATIONS OF CLIENT PORTFOLIOS AND LEADING DISCUSSIONS WITH AUDIT TEAMSLEADING DISCUSSIONS WITH AUDIT CLIENTS ON METHODOLOGIES AND ASSUMPTIONS ON THE VALUATION OF FIXED INCOME SECURITIESLEADING TEAMS IN OBTAINING AND EVALUATING CASH FLOW MODELING ASSUMPTIONS FROM THIRD PARTY MARKET PROVIDERSLIAISING WITH THIRD PARTY PRICING PROVIDERS TO STAY ABREAST ON MARKET EVENTS AND SENTIMENT \n\nSKILLS AND ATTRIBUTES FOR SUCCESS\n\nSTRONG LEADERSHIP SKILLS, TECHNICAL SKILLS, RELATIONSHIP- BUILDING SKILLS AND INTEGRITY. THESE SKILLS ALONG WITH HAVING A CONSISTENT COMMITMENT TO DELIVERING ONLY THE HIGHEST QUALITY OF WORK PRODUCTS TO YOUR CLIENTS, WILL ALLOW YOU TO EASILY INTEGRATE INTO A LEADERSHIP ROLE WITHIN THE STRUCTURED FINANCE VAP TEAM AND REACH YOUR PROFESSIONAL DEVELOPMENT GOALS.\n\nTO QUALIFY FOR THE ROLE YOU MUST HAVE\n\nBACHELOR'S DEGREE AND APPROXIMATELY 5 YEARS STRUCTURED FINANCE EXPERIENCE OR MASTER'S DEGREE AND APPROXIMATELY 3 YEARS STRUCTURED FINANCE EXPERIENCE. DEGREE IN FINANCE, ECONOMICS, MATHEMATICS, ACCOUNTING, ENGINEERING OR A RELATED DISCIPLINE; MBA OR MS PREFERREDMODELING AND VALUATION EXPERIENCE WITH FIXED INCOME SECURITIESWORKING KNOWLEDGE OF THE SECURITIES AND EXCHANGE COMMISSION'S REGULATION AB 1122 COMPLIANCE REPORTINGDEMONSTRATED PROJECT MANAGEMENT, TEAMING, ANALYTICAL AND PROBLEM-SOLVING SKILLSFLEXIBILITY AND WILLINGNESS TO TRAVEL AND WORK IN EXCESS OF STANDARD HOURS WHEN NECESSARY TO MEET CLIENT DEADLINES; VALID DRIVER'S LICENSE AND PASSPORT TO MEET TRAVEL REQUIREMENTSPROFICIENT IN MICROSOFT EXCEL, BLOOMBERG, INTEX, MOODY'S WALL STREET ANALYTICS, CITIGROUP YIELDBOOK AND TRANSPARENCY TOOLS OF PRICING VENDORSSTRONG COMMUNICATION SKILLS \n\nIDEALLY, YOU'LL ALSO HAVE\n\nEXPERIENCE LEADING STRUCTURED FINANCE CONSULTING PROJECTS WITHIN A LARGE FINANCIAL INSTITUTION OR CONSULTING FIRM.\n\nWHAT WE LOOK FOR\n\nINDIVIDUALS WHO DEMONSTRATE IN-DEPTH TECHNICAL CAPABILITIES, PROFESSIONAL KNOWLEDGE, THE ABILITY TO QUICKLY ASSIMILATE NEW KNOWLEDGE AND POSSESS GOOD BUSINESS ACUMEN. INTEGRITY WITHIN A PROFESSIONAL ENVIRONMENT\n\nWHAT WE OFFER\n\nWE OFFER A COMPREHENSIVE COMPENSATION AND BENEFITS PACKAGE WHERE YOU’LL BE REWARDED BASED ON YOUR PERFORMANCE AND RECOGNIZED FOR THE VALUE YOU BRING TO THE BUSINESS. THE SALARY RANGE FOR THIS JOB IN MOST GEOGRAPHIC LOCATIONS IN THE US IS $117,300 TO $215,100. THE SALARY RANGE FOR NEW YORK CITY METRO AREA, WASHINGTON STATE AND CALIFORNIA (EXCLUDING SACRAMENTO) IS $140,800 TO $244,400. INDIVIDUAL SALARIES WITHIN THOSE RANGES ARE DETERMINED THROUGH A WIDE VARIETY OF FACTORS INCLUDING BUT NOT LIMITED TO EDUCATION, EXPERIENCE, KNOWLEDGE, SKILLS AND GEOGRAPHY. IN ADDITION, OUR TOTAL REWARDS PACKAGE INCLUDES MEDICAL AND DENTAL COVERAGE, PENSION AND 401(K) PLANS, AND A WIDE RANGE OF PAID TIME OFF OPTIONS. UNDER OUR FLEXIBLE VACATION POLICY, YOU’LL DECIDE HOW MUCH VACATION TIME YOU NEED BASED ON YOUR OWN PERSONAL CIRCUMSTANCES. YOU’LL ALSO BE GRANTED TIME OFF FOR DESIGNATED EY PAID HOLIDAYS, WINTER/SUMMER BREAKS, PERSONAL/FAMILY CARE, AND OTHER LEAVES OF ABSENCE WHEN NEEDED TO SUPPORT YOUR PHYSICAL, FINANCIAL, AND EMOTIONAL WELL-BEING.\n\nCONTINUOUS LEARNING: YOU’LL DEVELOP THE MINDSET AND SKILLS TO NAVIGATE WHATEVER COMES NEXT.SUCCESS AS DEFINED BY YOU: WE’LL PROVIDE THE TOOLS AND FLEXIBILITY, SO YOU CAN MAKE A MEANINGFUL IMPACT, YOUR WAY.TRANSFORMATIVE LEADERSHIP: WE’LL GIVE YOU THE INSIGHTS, COACHING AND CONFIDENCE TO BE THE LEADER THE WORLD NEEDS.DIVERSE AND INCLUSIVE CULTURE: YOU’LL BE EMBRACED FOR WHO YOU ARE AND EMPOWERED TO USE YOUR VOICE TO HELP OTHERS FIND THEIRS.\n\nIF YOU CAN DEMONSTRATE THAT YOU MEET THE CRITERIA ABOVE, PLEASE CONTACT US AS SOON AS POSSIBLE.\n\nTHE EXCEPTIONAL EY EXPERIENCE. IT’S YOURS TO BUILD.\n\nEY | BUILDING A BETTER WORKING WORLD\n\nEY EXISTS TO BUILD A BETTER WORKING WORLD, HELPING TO CREATE LONG-TERM VALUE FOR CLIENTS, PEOPLE AND SOCIETY AND BUILD TRUST IN THE CAPITAL MARKETS.\n\nENABLED BY DATA AND TECHNOLOGY, DIVERSE EY TEAMS IN OVER 150 COUNTRIES PROVIDE TRUST THROUGH ASSURANCE AND HELP CLIENTS GROW, TRANSFORM AND OPERATE.\n\nWORKING ACROSS ASSURANCE, CONSULTING, LAW, STRATEGY, TAX AND TRANSACTIONS, EY TEAMS ASK BETTER QUESTIONS TO FIND NEW ANSWERS FOR THE COMPLEX ISSUES FACING OUR WORLD TODAY.\n\nEY IS AN EQUAL OPPORTUNITY, AFFIRMATIVE ACTION EMPLOYER PROVIDING EQUAL EMPLOYMENT OPPORTUNITIES TO APPLICANTS AND EMPLOYEES WITHOUT REGARD TO RACE, COLOR, RELIGION, AGE, SEX, SEXUAL ORIENTATION, GENDER IDENTITY/EXPRESSION, PREGNANCY, GENETIC INFORMATION, NATIONAL ORIGIN, PROTECTED VETERAN STATUS, DISABILITY STATUS, OR ANY OTHER LEGALLY PROTECTED BASIS, INCLUDING ARREST AND CONVICTION RECORDS, IN ACCORDANCE WITH APPLICABLE LAW.\n\nEY IS COMMITTED TO PROVIDING REASONABLE ACCOMMODATION TO QUALIFIED INDIVIDUALS WITH DISABILITIES INCLUDING VETERANS WITH DISABILITIES. IF YOU HAVE A DISABILITY AND EITHER NEED ASSISTANCE APPLYING ONLINE OR NEED TO REQUEST AN ACCOMMODATION DURING ANY PART OF THE APPLICATION PROCESS, PLEASE CALL 1-800-EY-HELP3, TYPE OPTION 2 (HR-RELATED INQUIRIES) AND THEN TYPE OPTION 1 (HR SHARED SERVICES CENTER), WHICH WILL ROUTE YOU TO EY’S TALENT SHARED SERVICES TEAM OR EMAIL SSC CUSTOMER SUPPORT AT SSC.CUSTOMERSUPPORT@EY.COM",
    "job_skill_set": [
      "project management",
      "regulation compliance",
      "leadership",
      "relationship building",
      "communication",
      "teamwork",
      "analytical skills",
      "problem solving",
      "mentoring",
      "flexibility",
      "structured finance",
      "valuation",
      "fixed income securities",
      "cash flow modeling",
      "Microsoft Excel",
      "Bloomberg",
      "Intex",
      "Moody's Wall Street Analytics",
      "Citigroup YieldBook",
      "pricing tools",
      "integrity"
    ],
    "short_keywords": [
      "analytical",
      "analytics",
      "bloomberg",
      "building",
      "cash",
      "citigroup",
      "communication",
      "compliance",
      "excel",
      "finance",
      "financial",
      "fixed",
      "flexibility",
      "flow",
      "income",
      "integrity",
      "intex",
      "leadership",
      "management",
      "manager",
      "mentoring",
      "microsoft",
      "modeling",
      "moodys",
      "pricing",
      "problem",
      "project",
      "regulation",
      "relationship",
      "risk",
      "securities",
      "services",
      "skills",
      "solving",
      "street",
      "structured",
      "teamwork",
      "tools",
      "transactions",
      "valuation",
      "wall",
      "yieldbook"
    ]
  },
  {
    "job_id": "3905858338",
    "job_title": "Finance Director",
    "category": "FINANCE",
    "job_description": "THE DIRECTOR OF FINANCE IS RESPONSIBLE FOR DIRECTING THE FISCAL FUNCTIONS OF THE CLUB AND ENSURING DEPARTMENTAL PROCESSES ARE PERFORMED IN ACCORDANCE WITH GENERALLY ACCEPTED ACCOUNTING PRINCIPLES (GAAP), ARE IN ADHERENCE WITH STATE AND FEDERAL REGULATORY REQUIREMENTS, AND COMPLY WITH THE CLUB’S BYLAWS. ADMINISTRATE FINANCIAL, ACCOUNTING, PERSONNEL, AND SYSTEMS RELATED FUNCTIONS. DIRECTLY SUPERVISE ACCOUNTING OFFICE PERSONNEL AND ADVISE SENIOR MANAGEMENT IN CONDUCTING RELATED ACTIVITIES. COMPETENCIES INCLUDE FINANCIAL MANAGEMENT, BUSINESS ACUMEN, COMMUNICATION PROFICIENCY, ETHICAL CONDUCT, LEADERSHIP, PROBLEM SOLVING AND ANALYSIS, AND STRATEGIC THINKING. ESSENTIAL DUTIES AND RESPONSIBILITIES INCLUDES BUT IS NOT LIMITED TO THE FOLLOWING: FINANCIAL FUNCTIONS• DEVELOP, IMPLEMENT, DIRECT AND EVALUATE THE ORGANIZATION'S FISCAL FUNCTION AND PERFORMANCE. PARTICIPATE IN THE DEVELOPMENT OF THE CLUB’S PLANS AND PROGRAMS AS A STRATEGIC PARTNER. EVALUATE AND ADVISE ON THE IMPACT OF LONG-RANGE PLANNING, INTRODUCTION OF NEW PROGRAMS, STRATEGIES, AND REGULATORY ACTION.• PREPARE ALL FINANCIAL STATEMENTS, FORECASTS AND ANALYSES FOR ALL ADMINISTRATIVE AND MANAGERIAL FUNCTIONS. DEVELOP CREDIBILITY BY PROVIDING TIMELY AND ACCURATE ANALYSIS OF BUDGETS, FINANCIAL REPORTS AND TRENDS TO ASSIST THE MANAGING DIRECTOR/ GENERAL MANAGER/COO, THE BOARD, AND THE EXECUTIVE TEAM IN PERFORMING THEIR RESPONSIBILITIES.• MANAGE ALL ACCOUNTING OPERATIONS INCLUDING BILLING, A/R, A/P, GL, COST ACCOUNT, AND REVENUE RECOGNITION. MAINTAIN ALL ACCOUNTING RECORDS AND BE RESPONSIBLE FOR DEVELOPMENT, ANALYSIS AND INTERPRETATION OF STATISTICAL AND ACCOUNTING INFORMATION.• CONTINUAL IMPROVEMENT OF THE BUDGETING PROCESS THROUGH EDUCATION OF DEPARTMENT MANAGERS ON FINANCIAL ISSUES IMPACTING DEPARTMENT BUDGETS.• OPTIMIZE THE HANDLING OF BANK AND DEPOSIT RELATIONSHIPS AND INITIATE APPROPRIATE STRATEGIES TO ENHANCE CASH POSITION. SUPPORT MONTH-END AND FISCAL-YEAR END CLOSE PROCESS. COORDINATE AND PREPARE ANNUAL AUDIT.• DEVELOP A RELIABLE CASH FLOW PROJECTION PROCESS AND REPORTING MECHANISM THAT INCLUDES MINIMUM CASH THRESHOLD TO MEET OPERATING NEEDS. ADVISE FROM FINANCIAL PERSPECTIVE ON ANY CONTRACTS INTO WHICH THE CLUB MAY ENTER.• EVALUATE THE FINANCE DIVISION STRUCTURE AND TEAM PLAN FOR CONTINUAL IMPROVEMENT OF THE EFFICIENCY AND EFFECTIVENESS OF THE GROUP AS WELL AS PROVIDE INDIVIDUALS WITH PROFESSIONAL AND PERSONAL GROWTH WITH EMPHASIS ON OPPORTUNITIES (WHERE POSSIBLE) OF INDIVIDUALS.• COORDINATE AND ASSIST WITH THE DEVELOPMENT OF OPERATING AND CAPITAL BUDGETARY PROCESSES• PARTICIPATE IN BOARD AND COMMITTEE FUNCTIONS AS REQUIRED, INCLUDING ATTENDING MONTHLY SCHEDULED MEETINGS• ASSURE CLUB INSURANCE PACKAGES PROVIDE OPTIMAL PROTECTION AND COMPETITIVE PRICING• ASSIST WITH DEVELOPMENT AND IMPLEMENTATION OF COST CONTROL PROCEDURES• ANALYZE AND INTERPRET FINANCIAL DATA AND PROVIDE FINANCIAL ATTESTATIONS• UNDERSTAND AND MITIGATE KEY ELEMENTS OF THE CLUB’S RISK PROFILE. FILE VERIFIED REPORTS REQUIRED BY REGULATORY AGENCIES INCLUDING FORMS 940, 941, 990, 1120, W-9, AND SEC. 125  ACCOUNTING FUNCTIONS • ENSURE THE ACCURACY OF MEMBER EQUITY DISTRIBUTIONS• MAINTAIN THE INTEGRITY OF MANAGEMENT INFORMATION SYSTEMS• EXAMINE AND APPROVE RECEIVABLE, PAYABLE AND PAYROLL TRANSACTIONS• SUPERVISE COLLECTION ACTIVITIES IN ACCORDANCE WITH CLUB BYLAWS• RESPOND TO MEMBERSHIP AND MANAGEMENT INQUIRIES• DESIGN AND IMPLEMENT INTERNAL AUDIT PROCEDURES• RECONCILE GENERAL LEDGER ACCOUNTS AND MAINTAIN WORK PAPERS• PLAN AND COORDINATE EXTERNAL AUDIT ACTIVITIES PERSONNEL FUNCTIONS• ADVISE SENIOR MANAGEMENT OF LABOR REGULATORY REQUIREMENTS• SUPERVISE WORKERS COMP AUDIT• SUPERVISE ACCOUNTING DEPARTMENT SYSTEMS FUNCTIONS• OPTIMIZE SYSTEMS FUNCTIONALITY AND UTILIZATION• ANALYZE FEASIBILITY STUDIES ON SYSTEMS ENHANCEMENTS• MONITOR SYSTEMS SECURITY PROCEDURES• OVERSEE SYSTEMS SUPPORT SERVICES• EVALUATE AND DIRECT USER TRAINING PROCESSES QUALIFICATIONSTO PERFORM THIS JOB SUCCESSFULLY, AN INDIVIDUAL MUST BE ABLE TO PERFORM EACH ESSENTIAL DUTY SATISFACTORILY. THE REQUIREMENTS LISTED BELOW ARE REPRESENTATIVE OF THE KNOWLEDGE, SKILL, AND/OR ABILITY REQUIRED. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS. EDUCATION AND/OR EXPERIENCE BACHELOR'S DEGREE IN ACCOUNTING OR FINANCE WITH STRONG ANALYTICAL, FINANCIAL SKILLS AND THE ABILITY TO PROVIDE SUCCINCT REPORTS AND RECOMMENDATIONS; MASTER’S DEGREE PREFERRED. MINIMUM 5 YEARS’ EXPERIENCE FUNCTIONING AS DOF/CONTROLLER IN HOSPITALITY FIELD; KNOWLEDGEABLE WITH REGARDS TO CLUB FINANCIAL ISSUES OF FUNDING, CASH FLOW, TREND ANALYSIS, FORECASTING, AND MAJOR PROJECT EXPERIENCE. PRIOR PRIVATE COUNTRY CLUB EXPERIENCE, CERTIFIED PUBLIC ACCOUNTANT (CPA) AND/OR CERTIFIED HOSPITALITY ACCOUNTING EXECUTIVE (CHAE) PREFERRED. OTHER SKILLS AND ABILITIES EMPLOYEE MUST DEMONSTRATE DETAIL-ORIENTED, ANALYTICAL CAPABILITIES, AND POSITIVE INTERPERSONAL SKILLS. SKILLED IN MATH APPLICATION, 10-KEY ADDING MACHINE OPERATIONS, COMPUTER DATA ENTRY, DESKTOP SPREADSHEET AND WORD PROCESSING PROGRAMS.  \n WORK ENVIRONMENT THE WORK ENVIRONMENT CHARACTERISTICS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE AN EMPLOYEE ENCOUNTERS WHILE PERFORMING THE ESSENTIAL FUNCTIONS OF THIS JOB. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS. GENERAL OFFICE ENVIRONMENT. SOME STRESS MAY OCCUR. THIS JOB OPERATES IN A CLERICAL OFFICE SETTING. THIS ROLE ROUTINELY USES STANDARD OFFICE EQUIPMENT SUCH AS COMPUTERS, PHONES, PHOTOCOPIERS, FILING CABINETS AND FAX MACHINES. THIS IS A FULL-TIME POSITION. DAYS AND HOURS OF WORK ARE MONDAY THROUGH FRIDAY, 8:30 A.M. TO 5 P.M. OCCASIONAL EVENING AND WEEKEND WORK MAY BE REQUIRED AS JOB DUTIES DEMAND.  PHYSICAL DEMANDS THE PHYSICAL DEMANDS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY AN EMPLOYEE TO SUCCESSFULLY PERFORM THE ESSENTIAL FUNCTIONS OF THIS JOB. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS. WHILE PERFORMING THE DUTIES OF THIS JOB, THE EMPLOYEE IS REGULARLY REQUIRED TO USE HANDS TO FINGER, HANDLE, OR FEEL TO USE A TELEPHONE KEYPAD AND COMPUTER KEYBOARD AND MOUSE. THE EMPLOYEE FREQUENTLY IS REQUIRED TO TALK OR HEAR. BENDING, STOOPING, SITTING, STANDING, AND LIFTING (UP TO 35 LBS.) MAY BE ENCOUNTERED WHILE PERFORMING REQUIRED DUTIES. SPECIFIC VISION ABILITIES REQUIRED BY THIS JOB INCLUDE CLOSE VISION.  AAP/EEO STATEMENTQUAIL CREEK COUNTRY CLUB, INC. PROVIDES EQUAL EMPLOYMENT OPPORTUNITIES (EEO) TO ALL EMPLOYEES AND APPLICANTS FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, NATIONAL ORIGIN, AGE, DISABILITY OR GENETICS. IN ADDITION TO FEDERAL LAW REQUIREMENTS, QUAIL CREEK COUNTRY CLUB, INC. COMPLIES WITH APPLICABLE STATE AND LOCAL LAWS GOVERNING NONDISCRIMINATION IN EMPLOYMENT IN EVERY LOCATION IN WHICH THE COMPANY HAS FACILITIES. THIS POLICY APPLIES TO ALL TERMS AND CONDITIONS OF EMPLOYMENT, INCLUDING RECRUITING, HIRING, PLACEMENT, PROMOTION, TERMINATION, LAYOFF, RECALL, TRANSFER, LEAVES OF ABSENCE, COMPENSATION AND TRAINING.QUAIL CREEK COUNTRY CLUB, INC. EXPRESSLY PROHIBITS ANY FORM OF WORKPLACE HARASSMENT BASED ON RACE, COLOR, RELIGION, GENDER, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, NATIONAL ORIGIN, AGE, GENETIC INFORMATION, DISABILITY, OR VETERAN STATUS. IMPROPER INTERFERENCE WITH THE ABILITY OF QUAIL CREEK COUNTRY CLUB, INC.’S EMPLOYEES TO PERFORM THEIR JOB DUTIES MAY RESULT IN DISCIPLINE UP TO AND INCLUDING DISCHARGE.OTHER DUTIESPLEASE NOTE THIS JOB DESCRIPTION IS NOT DESIGNED TO COVER OR CONTAIN A COMPREHENSIVE LISTING OF ACTIVITIES, DUTIES OR RESPONSIBILITIES THAT ARE REQUIRED OF THE EMPLOYEE FOR THIS JOB. DUTIES, RESPONSIBILITIES AND ACTIVITIES MAY CHANGE AT ANY TIME WITH OR WITHOU",
    "job_skill_set": [
      "financial management",
      "accounting principles (GAAP)",
      "budgeting",
      "financial analysis",
      "forecasting",
      "internal audit procedures",
      "financial reporting",
      "cost control procedures",
      "Microsoft Excel",
      "financial statements preparation",
      "risk management",
      "leadership",
      "communication",
      "problem solving",
      "strategic thinking",
      "interpersonal skills",
      "detail-oriented",
      "analytical skills",
      "team management",
      "cash flow management",
      "statistical analysis",
      "regulatory compliance",
      "data entry",
      "accounts receivable (A/R)",
      "accounts payable (A/P)",
      "general ledger (GL)",
      "revenue recognition",
      "CPA certification",
      "CHAE certification",
      "ethical conduct",
      "training and development"
    ],
    "short_keywords": [
      "accounting",
      "accounts",
      "analysis",
      "analytical",
      "and",
      "ap",
      "ar",
      "audit",
      "budgeting",
      "cash",
      "certification",
      "chae",
      "communication",
      "compliance",
      "conduct",
      "control",
      "cost",
      "cpa",
      "data",
      "detailoriented",
      "development",
      "director",
      "entry",
      "ethical",
      "excel",
      "finance",
      "financial",
      "flow",
      "forecasting",
      "gaap",
      "general",
      "gl",
      "internal",
      "interpersonal",
      "leadership",
      "ledger",
      "management",
      "microsoft",
      "payable",
      "preparation",
      "principles",
      "problem",
      "procedures",
      "receivable",
      "recognition",
      "regulatory",
      "reporting",
      "revenue",
      "risk",
      "skills",
      "solving",
      "statements",
      "statistical",
      "strategic",
      "team",
      "thinking",
      "training"
    ]
  },
  {
    "job_id": "3900945133",
    "job_title": "Public Finance - Mid-Level Associate Attorney - DEN",
    "category": "FINANCE",
    "job_description": "DESCRIPTION\n\nTHE DENVER OFFICE HAS AN OPENING FOR A PUBLIC FINANCE ASSOCIATE WITH 3-7 YEARS OF EXPERIENCE. THIS POSITION WILL INCLUDE PUBLIC FINANCE MATTERS INVOLVING STATE AND LOCAL GOVERNMENTAL ENTITIES AND NONPROFITS: MUNICIPAL BONDS, NOTES AND OTHER OBLIGATIONS, COMMERCIAL LOANS, TAX EXEMPT OR TAXABLE, FOR PUBLIC INFRASTRUCTURE AND OTHER CAPITAL IMPROVEMENT PROJECTS; NONPROFIT HEALTH CARE, EDUCATIONAL, CULTURAL, AND OTHER FACILITIES; AND PUBLIC PRIVATE PARTNERSHIPS.\n\nDUTIES & RESPONSIBILITIES\n\nDRAFT TRANSACTION DOCUMENTS INCLUDING TRUST INDENTURE RESOLUTIONS, LOAN AGREEMENTS, CLOSING CERTIFICATES, AND THIRD-PARTY CONSENTS.ASSIST WITH REVIEW OF DUE DILIGENCE MATERIALS.DRAFT SECURITIES DISCLOSURE OFFERING DOCUMENTS, INCLUDING LIMITED OFFERING MEMORANDUMS AND OFFICIAL STATEMENTS.\n\nQUALIFICATIONS & PRIOR EXPERIENCE\n\n3-7 YEARS OF RELEVANT EXPERIENCE IN PUBLIC FINANCE AND/OR REAL ESTATE FINANCEJD FROM ACCREDITED LAW SCHOOLADMISSION TO THE COLORADO BAR (OR ELIGIBLE TO WAIVE IN WITH UBE SCORE)EXCELLENT ACADEMIC CREDENTIALSEXCELLENT LEGAL RESEARCH, WRITING, AND INTERPERSONAL COMMUNICATION SKILLS REQUIRED\n\nTHE EXPECTED ANNUALIZED BASE SALARY RANGE FOR THIS POSITION IS $190,000 - $240,000. ACTUAL PAY WILL BE ADJUSTED BASED ON EXPERIENCE AND OTHER JOB-RELATED FACTORS PERMITTED BY LAW. FULL TIME EMPLOYEES MAY BE ELIGIBLE FOR A DISCRETIONARY BONUS, HEALTH INSURANCE WITH AN OPTIONAL HSA, SHORT TERM DISABILITY, LONG TERM DISABILITY, DENTAL INSURANCE, VISION CARE, LIFE INSURANCE, HEALTHCARE AND DEPENDENT CARE FLEXIBLE SPENDING ACCOUNTS, 401K, VACATION, SICK TIME, AND AN EMPLOYEE ASSISTANCE PROGRAM. ADDITIONAL VOLUNTARY PROGRAMS INCLUDE: VOLUNTARY ACCIDENT INSURANCE, VOLUNTARY LIFE, VOLUNTARY DISABILITY, VOLUNTARY LONG TERM CARE, VOLUNTARY CRITICAL ILLNESS AND CANCER INSURANCE AND PET INSURANCE.\n\nGREENBERG TRAURIG IS COMMITTED TO DIVERSITY AND INCLUSION IN THE WORKPLACE. INDIVIDUALS SEEKING EMPLOYMENT AT GREENBERG TRAURIG ARE CONSIDERED WITHOUT REGARDS TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTIFICATION, NATIONAL ORIGIN, AGE, MARITAL STATUS, ANCESTRY, DISABILITY, VETERAN STATUS, OR GENETIC INFORMATION, AMONG OTHER PROTECTED BASES.\n\nEXEMPLIFYING OUR COMMITMENT TO PROMOTING INCLUSION AND EQUITY ACROSS OUR PLATFORM, THE FIRM PARTICIPATES IN THE MANSFIELD RULE CERTIFICATION PROGRAM (MANSFIELD). MANSFIELD, WHICH IS FACILITATED BY THE DIVERSITY LAB, FOCUSES ON EQUAL OPPORTUNITY, FAIRNESS, AND INCLUSIVITY. THE MANSFIELD REQUIREMENTS ARE ANCHORED IN THE CONSIDERATION OF EXPANDED TALENT POOLS CONSIDERED FOR SELECT POSITIONS AND OPEN ROLES WITHIN THE LAW FIRM AND THE IMPLEMENTATION OF AND ACCESS TO TRANSPARENT PROCESSES. UTILIZING THE MANSFIELD FRAMEWORK, THE FIRM’S PROGRESS AND OUTCOMES ARE MEASURED AND DOCUMENTED THROUGH MANSFIELD CERTIFICATION PLUS METRICS. IN 2023, GT ACHIEVED MANSFIELD 6.0 CERTIFICATION PLUS. WE ARE EXCITED ABOUT OUR ONGOING PARTICIPATION IN MANSFIELD GIVEN THE PROGRAM’S ALIGNMENT WITH THE FIRM’S COMMITMENT TO OPPORTUNITIES FOR ADVANCEMENT THAT ARE INCLUSIVE FOR EVERYONE. PROVIDING YOUR DATA DURING THE APPLICATION PROCESS HELPS US WITH ACHIEVING OUR GOALS AND WITH MEETING REPORTING/RECORD-KEEPING OBLIGATIONS UNDER FEDERAL AND STATE LAW AND OTHER LEGAL REQUIREMENTS. PROVIDING YOUR DATA IS ENTIRELY VOLUNTARY AND WILL NOT BE CONSIDERED IN THE HIRING PROCESS OR THEREAFTER. ANY INFORMATION THAT YOU DO PROVIDE WILL BE TREATED CONFIDENTIALLY.",
    "job_skill_set": [
      "public finance",
      "writing",
      "drafting transaction documents",
      "due diligence",
      "municipal bonds",
      "interpersonal communication",
      "attention to detail",
      "teamwork",
      "problem solving",
      "time management",
      "legal research",
      "securities disclosure",
      "JD from accredited law school",
      "Colorado Bar admission",
      "commercial loans",
      "public-private partnerships"
    ],
    "short_keywords": [
      "accredited",
      "admission",
      "associate",
      "attention",
      "attorney",
      "bar",
      "bonds",
      "colorado",
      "commercial",
      "communication",
      "den",
      "detail",
      "diligence",
      "disclosure",
      "documents",
      "drafting",
      "due",
      "finance",
      "from",
      "interpersonal",
      "jd",
      "law",
      "legal",
      "loans",
      "management",
      "midlevel",
      "municipal",
      "partnerships",
      "problem",
      "public",
      "publicprivate",
      "research",
      "school",
      "securities",
      "solving",
      "teamwork",
      "time",
      "to",
      "transaction",
      "writing"
    ]
  },
  {
    "job_id": "3891842032",
    "job_title": "Regional Finance Process Manager",
    "category": "FINANCE",
    "job_description": "REGIONAL FINANCE PROCESS MANAGER LOCATION: BLUE BELL, PA\n\nABOUT SKF:SKF HAS BEEN MAKING THE WORLD SPIN SINCE 1907! SKF IS AN INDUSTRY-LEADING MANUFACTURER DEDICATED TO A CULTURE OF BELONGING, WHERE OUR PEOPLE FLOURISH IN AN EQUITABLE ENVIRONMENT THAT PROMOTES LEADERSHIP DEVELOPMENT AND CAREER GROWTH. SKF BEARINGS PLAYED AN INTEGRAL ROLE IN HELPING MARS ROVER COLLECT ROCK AND REGOLITH SAMPLES ON THE PLANET’S SURFACE.\n\nAS AN SKF TEAM MEMBER, YOU WILL JOIN 40,000 COLLEAGUES FROM MORE THAN 130 COUNTRIES DEVELOPING BEARING TECHNOLOGY AND SERVICES THAT MAKE ROTATION MORE RELIABLE AND SUSTAINABLE. SUSTAINABILITY IS AT THE HEART OF EVERYTHING WE DO. SKF AIMS TO HAVE NET ZERO GREENHOUSE GAS EMISSIONS AT ALL OUR PRODUCTION FACILITIES BY 2030.\n\nSKF PRODUCTS KEEP VEHICLES ROLLING, POWER THE MACHINES THAT PUT FOOD ON YOUR TABLE, AND EVEN REACH INTO THE COSMOS AS PART OF THE MARS ROVER MISSION. FOUNDED IN SWEDEN IN 1907, TODAY SKF IS PUBLICLY TRADED ON THE NASDAQ STOCKHOLM WITH ANNUAL SALES IN 2020 OF APPROXIMATELY $10 BILLION.\n\nJOB SUMMARY:SKF HAS ESTABLISHED A REGIONAL FINANCE SUPPORT STRUCTURE IN THE AMERICAS, BASED IN BLUE BELL, PA, SUPPORTING SKF FINANCE OPERATIONS CENTERS (FOC’S) IN NORTH AMERICA (NAM) AND LATIN AMERICA (LAM). AT SKF FINANCE HAS HAVE A POWERFUL ROLE RELATED TO A LEAN, EFFICIENT, AND DIGITAL ENVIRONMENT, AND WE ARE AIMING TO BE IN THE FRONTLINE OF NEXT GENERATION BUSINESS FINANCE.\n\nTHE FINANCE OPERATIONS CENTERS AT SKF IN THE AMERICAS INCLUDES ACCOUNTING & REPORTING (RECORD TO REPORT – R2R), ACCOUNTS PAYABLE (PROCURE TO PAY – P2P), ACCOUNTS RECEIVABLE (ORDER TO CASH – O2C), CENTRAL CONTROLLING, INTERNAL CONTROL, AND FINANCE PROCESSES. FINANCE OPERATIONS AMERICAS HAS TWO FOC’S LOCATED IN BLUE BELL, USA AND PUEBLA, MX.\n\nAS A FINANCE REGIONAL PROCESS MANAGER IN THE AMER REGION, YOU WILL BE PART OF THE REGIONAL SUPPORT AMERICAS TEAM AND REPORT TO THE FINANCE SUPPORT MANAGER AMERICAS, PART OF THE GLOBAL FINANCE OPERATIONS & DEVELOPMENT ORGANIZATION. YOU WILL BE RESPONSIBLE FOR OVERALL FINANCE PROCESS GOVERNANCE WITHIN SKF FINANCE PROCESS GUIDELINES, FRAMEWORK, AND TOOLS IN PROCESS SCOPE, PROVIDING SUPPORT TO FOC’S TEAMS IN THE REGION. THIS POSITION WILL ALSO BE PART OF THE IMPLEMENTATION TEAM OF THE SAP FINANCE MODULE AS PART OF THE AMERICAS SEP PROJECT AND OTHER FINANCE-RELATED SYSTEM IMPLEMENTATIONS AND PROCESS IMPROVEMENT ACTIVITIES.\n\nRESPONSIBILITIES: ACCOUNTABLE FOR IMPLEMENTATION OF PROCESS CHANGES WITHIN THE PROCESS SCOPE, RESPONSIBLE FOR IDENTIFYING TOPICS FOR CROSS-PROCESS ALIGNMENT.IDENTIFY BUSINESS REQUIREMENTS AND HOW THESE IMPACT PROCESS DESIGN.IDENTIFY IMPROVEMENT OPPORTUNITIES AND DRIVE CONTINUOUS IMPROVEMENT, OPTIMIZATION, AND AUTOMATION OF PROCESS.IDENTIFY THE COMPETENCIES NEEDED AND DEVELOP COMPETENCY DEVELOPMENT PLAN.SUPPORT IMPLEMENTATION OF DEFINED PROCESS MEASUREMENTS (KPIS), EVALUATE AND SUGGEST PROCESS FIXES TO IMPROVE RESULTS.PROVIDE PROBLEM RESOLUTION SUPPORT FOR FINANCE APPLICATIONS ISSUES.SUPPORT MASTER DATA MANAGEMENT IN SCOPE.WORK TOGETHER WITH IT TEAMS TO PERFORM PROCESS AND SYSTEM EVALUATIONS TO IMPROVE BUSINESS OPERATIONS.NEW SYSTEMS AND PROCESSES: TESTING, EVALUATION, AND MODIFICATION OF LOCAL PROCEDURES WHEN APPLICABLEPERFORM ON-SITE AND REMOTE/ONLINE TRAINING ON THE FINANCE APPLICATIONS.SUPPORT AUDITS (TAX, ACCOUNTING, SICS, GOVERNMENT)BE A KEY USER OF THE FINANCE APPLICATIONS IN SCOPE.BE A TEAM PLAYER AND COOPERATE ACROSS PROCESSES AND ORGANIZATIONS.\n\nREQUIREMENTS BACHELOR’S DEGREE IN ACCOUNTING.SEVEN OR MORE YEARS OF EXPERIENCE WITHIN FINANCE AND ACCOUNTING FUNCTIONS/DEPARTMENT.UNDERSTANDING OF FINANCE PROCESSES AND PROCESS DEVELOPMENT, AND EXPERTISE OF PROCESSES IN OWN PROCESS SCOPE.PROCESS DEPLOYMENT, PROJECT AND CHANGE MANAGEMENT SKILLS.DRIVING BUSINESS NEEDS MANAGEMENT.SERVICE-ORIENTED APPROACH, GOOD COMMUNICATION, NEGOTIATION, NETWORKING, AND TEAMING SKILLS.CONTINUOUS IMPROVEMENT MINDSET, CAPABILITY TO FACILITATE AND DRIVE CHANGE WITHIN A GLOBAL ORGANIZATION.HANDS-ON EXPERIENCE WITH FINANCE APPLICATIONS (SAP, BLACKLINE, CADENCY).STRONG ANALYTICAL AND PC SKILLS (O365, EXCEL, POWER BI, ETC.).\n\nWHAT YOU’LL LOVE ABOUT SKF:REST AND RELAXATION. ENJOY A GENEROUS PTO POLICY AND 13 PAID HOLIDAYS.\n\nWORK/LIFE INTEGRATION. SKF SUPPORTS WORK/LIFE INTEGRATION, HOME, FAMILY, COMMUNITY, PERSONAL WELL-BEING AND HEALTH. FLEXIBLE WORK OPTIONS AVAILABLE, DEPENDING ON ROLE.\n\nDIVERSITY IN THE WORKPLACE.\n\nAT SKF, WE STRIVE TO EMBED DIVERSITY, EQUITY, AND INCLUSION IN EVERYTHING WE DO. BY DEVELOPING A CULTURE OF BELONGING, OUR PEOPLE CAN FLOURISH; LEADING TO AN INCLUSIVE, EQUITABLE ENVIRONMENT THAT PROMOTES LEADERSHIP, ENGAGEMENT, AND INNOVATION.\n\nBEST IN CLASS BENEFITS. SKF CARES ABOUT THE WELLBEING OF OUR EMPLOYEES. COMPREHENSIVE HEALTHCARE OPTIONS TO FIT YOUR NEEDS AND OPT OUT PAYMENT. ADDED BENEFITS INCLUDE COMPANY PAID LIFE INSURANCE, STD, LTD. SUPPLEMENTAL BENEFITS INCLUDE CRITICAL ILLNESS COVERAGE, TUITION REIMBURSEMENT, EMPLOYEE DISCOUNT PROGRAMS, AND MUCH MORE!\n\nINVEST IN YOUR FUTURE. PARTICIPATE IN OUR 401K PROGRAM THAT BOASTS A 10% EMPLOYER CONTRIBUTION: 100% MATCH UP TO 5% OF YOUR ELECTED CONTRIBUTION (100% VESTED) PLUS AN ADDITIONAL 5% COMPANY CONTRIBUTION.REPORTS TO: MANAGER FINANCE SUPPORTLOCATION: BLUE BELL, PAJOB ID: 19647SKF PROVIDES EQUAL EMPLOYMENT [AND AFFIRMATIVE ACTION] OPPORTUNITIES TO APPLICANTS AND EMPLOYEES WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, PROTECTED VETERAN STATUS, OR DISABILITY.BY APPLYING TO THIS JOB YOU ACKNOWLEDGE HOW SKF TREATS CANDIDATE DATA. CLICK HERE TO REVIEW THE SKF DATA PRIVACY CONSENT STATEMENT. PANDOLOGIC. KEYWORDS: PROCESS MANAGER, LOCATION: LANSDALE, PA - 19446",
    "job_skill_set": [
      "accounting",
      "finance processes",
      "data management",
      "project management",
      "process improvement",
      "analytical skills",
      "communication",
      "teamwork",
      "problem solving",
      "change management",
      "service-oriented approach",
      "continuous improvement mindset",
      "SAP",
      "O365",
      "Excel",
      "Power BI",
      "Blackline",
      "Cadency",
      "negotiation",
      "facilitation",
      "networking"
    ],
    "short_keywords": [
      "accounting",
      "analytical",
      "approach",
      "bi",
      "blackline",
      "cadency",
      "change",
      "communication",
      "continuous",
      "data",
      "excel",
      "facilitation",
      "finance",
      "improvement",
      "management",
      "manager",
      "mindset",
      "negotiation",
      "networking",
      "o365",
      "power",
      "problem",
      "process",
      "processes",
      "project",
      "regional",
      "sap",
      "serviceoriented",
      "skills",
      "solving",
      "teamwork"
    ]
  },
  {
    "job_id": "3902757119",
    "job_title": "Accounting and Finance Intern",
    "category": "FINANCE",
    "job_description": "POSITION: ACCOUNTING AND FINANCE INTERN\n\nLOCATION: BOSTON (SEAPORT), MA\n\nDURATION: SUMMER 2024, 3 MONTHS\n\nCOMPENSATION: $25.00/HR\n\nABOUT US\n\nFLEXCAR IS AN AUTOMOTIVE STARTUP COMPANY DEDICATED TO REPLACING CAR OWNERSHIP FOR THE MAJORITY OF CAR OWNERS. WE BRING ACCESS TO MOBILITY, WHEN IT MAY OTHERWISE BE UNREACHABLE, THROUGH A FLEXIBLE VEHICLE SUBSCRIPTION THAT INCLUDES INSURANCE, MAINTENANCE, ROADSIDE ASSISTANCE, AND THE COST OF THE VEHICLE ALL IN ONE AFFORDABLE PAYMENT.\n\nINTERNSHIP OVERVIEW\n\nWE ARE SEEKING A MOTIVATED ACCOUNTING AND FINANCE INTERN TO JOIN OUR TEAM FOR A 3-MONTH SUMMER INTERNSHIP. THIS ROLE WILL BE IMMERSED IN OUR ACCOUNTING AND FINANCE TEAM, LEARNING ALL OUR PROCESSES BY DOING THE WORK, AND DOCUMENTING AND MEMORIALIZING PROCESSES. YOU WILL GAIN A FUNDAMENTAL UNDERSTANDING OF THE DAY-TO-DAY ACCOUNTING AND FINANCE SKILLS REQUIRED IN A STARTUP ORGANIZATION, INCLUDING HOW DECISIONS ARE MADE, HOW WE PIVOT QUICKLY BASED ON REAL TIME DATA, AND WHAT GOES INTO SUCCESSFULLY BUILDING A FORECAST AND COMPLETING MONTH END CLOSE.\n\nWHAT YOU’LL DO\n\nASSIST THE ACCOUNTING TEAM THROUGH MONTH END CLOSE FOR THREE COUNTRIES – THE UNITED STATES, JAMAICA, AND INDIA. PREPARE RECONCILIATIONS FOR BALANCE SHEET ACCOUNTS AND WORK WITH STAKEHOLDERS TO UNDERSTAND VARIANCES FROM FORECAST. ASSIST THE ACCOUNTING TEAM WITH DAY-TO-DAY MAINTENANCE AND MANAGEMENT OF NETSUITE, ORACLE FUSION, BILL.COM, BILL SPEND AND EXPENSE AND TRAVEL PERK. ASSIST IN PREPARATION OF FINANCIAL REPORTS, INCLUDING WEEKLY AND MONTHLY ANALYSES. MAINTAIN KEY PERFORMANCE METRICS AND PROVIDE INSIGHTS INTO FINANCIAL PERFORMANCE. COLLABORATE WITH CROSS-FUNCTIONAL TEAMS TO GATHER DATA AND SUPPORT FINANCIAL INITIATIVES. PARTICIPATE IN TEAM MEETINGS AND CONTRIBUTE IDEAS FOR PROCESS IMPROVEMENTS. OTHER DUTIES AS ASSIGNED BY MANAGEMENT. \n\nWHAT DRIVES SUCCESS FOR THIS ROLE\n\nCURRENTLY ENROLLED IN A BACHELOR’S DEGREE PROGRAM, PREFERABLY IN BUSINESS ADMINISTRATION, ACCOUNTING OR FINANCE, OR A RELATED FIELD. EAGERNESS TO WORK IN EVER-CHANGING CONDITIONS ON SIMPLE AND COMPLEX PROCESSES. ABILITY TO WORK BOTH WITH A TEAM AND INDEPENDENTLY IN A FAST-PACED ENVIRONMENT. WILLINGNESS TO GET YOUR HANDS DIRTY AND BE INVOLVED WITH EVERY FACET OF THE BUSINESS. EXCELLENT COMMUNICATION AND INTERPERSONAL ABILITIES. PROFICIENCY IN MICROSOFT OFFICE SUITE (WORD, EXCEL, POWERPOINT). PRIOR INTERNSHIP OR WORK EXPERIENCE IN A PROFESSIONAL SETTING IS A PLUS, BUT NOT REQUIRED. \n\nWHO ARE WE? \n\nFLEXCAR EMPOWERS ALL WALKS OF LIFE THE FLEXIBILITY TO HAVE A CAR OF THEIR OWN WITHOUT THE HASSLES OF TRADITIONAL CAR OWNERSHIP. CONVENIENT AND AFFORDABLE, FLEXCAR IS HERE TO DISRUPT A $110 BILLION INDUSTRY BY PROVIDING CUSTOMERS AN ALTERNATIVE TO CAR-SHARING, LEASES, OWNERSHIP, AND CAR RENTALS.\n\nFLEXCAR IS RAPIDLY GROWING, AND WE WANT YOU TO BE A FLEXSTER. OUR SPECIAL TEAM IS PASSIONATE, KIND, COLLABORATIVE, DRIVEN, AND ALL-IN ON BUILDING THE NEXT AUTOMOTIVE GAME-CHANGER FROM THE GROUND-UP. THIS TRULY IS AN AMAZING OPPORTUNITY TO NOT ONLY CONTRIBUTE YOUR TALENTS AS A TEAM-MEMBER, BUT ALSO TO HELP BUILD THE FUTURE FLEXCAR.\n\nTHE EXTRA MILE\n\nWE ENCOURAGE FLEXSTERS TO BRING THEIR WHOLE SELVES TO WORK - UNIQUE PERSPECTIVES, PERSONAL EXPERIENCES, BACKGROUNDS, AND HOWEVER THEY IDENTIFY. WE ARE PROUD TO BE AN EQUAL OPPORTUNITY EMPLOYER – M/F/D/V.\n\nWHO ARE WE?\n\nFLEXCAR EMPOWERS ALL WALKS OF LIFE THE FLEXIBILITY TO HAVE A CAR OF THEIR OWN WITHOUT THE HASSLES OF TRADITIONAL CAR OWNERSHIP. CONVENIENT AND AFFORDABLE, FLEXCAR IS HERE TO DISRUPT A 110 BILLION DOLLAR INDUSTRY BY PROVIDING CUSTOMERS AN ALTERNATIVE TO CAR-SHARING, LEASES, OWNERSHIP, AND CAR RENTALS.\n\nFLEXCAR IS RAPIDLY GROWING AND WE WANT YOU TO BE A FLEXTER. OUR SPECIAL TEAM IS PASSIONATE, KIND, COLLABORATIVE, DRIVEN, AND ALL-IN ON BUILDING THE NEXT AUTOMOTIVE GAME-CHANGER FROM THE GROUND-UP. THIS TRULY IS AN AMAZING OPPORTUNITY TO NOT ONLY CONTRIBUTE YOUR TALENTS AS A TEAM-MEMBER, BUT ALSO TO HELP BUILD THE FUTURE FLEXCAR.\n\nTHE EXTRA MILE\n\nWE ENCOURAGE FLEXSTERS TO BRING THEIR WHOLE SELVES TO WORK - UNIQUE PERSPECTIVES, PERSONAL EXPERIENCES, BACKGROUNDS, AND HOWEVER THEY IDENTIFY. WE ARE PROUD TO BE AN EQUAL OPPORTUNITY EMPLOYER – M/F/D/V.",
    "job_skill_set": [
      "accounting",
      "finance",
      "financial reporting",
      "data analysis",
      "reconciliation",
      "forecasting",
      "communication",
      "teamwork",
      "adaptability",
      "problem solving",
      "initiative",
      "collaboration",
      "Microsoft Office Suite",
      "Netsuite",
      "Oracle Fusion",
      "Bill.com"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "analysis",
      "and",
      "billcom",
      "collaboration",
      "communication",
      "data",
      "finance",
      "financial",
      "forecasting",
      "fusion",
      "initiative",
      "intern",
      "microsoft",
      "netsuite",
      "office",
      "oracle",
      "problem",
      "reconciliation",
      "reporting",
      "solving",
      "suite",
      "teamwork"
    ]
  },
  {
    "job_id": "3902356406",
    "job_title": "Finance Manager",
    "category": "FINANCE",
    "job_description": "INSIGHT GLOBAL IS LOOKING FOR A FINANCE MANAGER TO WORK FOR A LARGE FINANCIAL CLIENT IN THE UPTOWN AREA. THE FINANCE MANAGER WILL BE RESPONSIBLE FOR:COLLABORATING CLOSELY WITH LIQUIDITY BUSINESS OPERATIONS LEAD TO UNDERSTANDING OPERATIONAL PRIORITIES. PROVIDE ANALYSIS AND RECOMMENDATIONS TO SUPPORT DECISION MAKING.PERFORMING EXCEL ANALYSIS AND RECONCILIATIONS OF BUSINESS SYSTEMS, AND PREPARING AND DELIVERING RECURRING AND AD-HOC REPORTING, ANALYZING AND FORMATTING DATA FOR REVIEW WITH LEADERSHIP, INCLUDING PRESENTATION OF KEY METRICS AND TRENDING.IDENTIFYING PROCESS AREAS THAT NEED IMPROVEMENT AND IMPLEMENTING NEW SOLUTIONS. MONITORING PROGRESS, TRACKING MILESTONES AND ADDRESSING ISSUES THAT MAY ARISE.\nREQUIRED SKILLS AND EXPERIENCE:ABILITY TO ANALYZE AND MANIPULATE LARGE QUANTITIES OF DATA WITH GREAT ATTENTION TO DETAIL AS WELL AS UNDERSTAND THE FLOW OF DATA WITHIN DATABASE APPLICATIONSEXCELLENT TIME MANAGEMENT SKILLS, INCLUDING THE ABILITY TO MEET DEADLINES, AND MANAGE MULTIPLE PRIORITIES WITHOUT SACRIFICING QUALITY OR TIMELINESSTRONG ANALYTICAL SKILLSSTRONG EXCEL SKILLSSTRONG COMMUNICATION (WRITTEN AND ORAL)SELF-MOTIVATED, SELF-DIRECTEDPROFICIENT WITH MICROSOFT TOOLS (WORD, POWERPOINT)3+ YEARS OF FINANCIAL AND/OR DATA ANALYTICS EXPERIENCE WITH A FINANCIAL INSTITUTIONSTRONG SENSE OF URGENCYBACHELOR’S DEGREE IN FINANCE, ACCOUNTING, ECONOMICS, BUSINESS OR A RELATED FIELD - OR RELATED WORK EXPERIENCE\nDESIRED SKILLS AND EXPERIENCE:UNDERSTANDING OF TREASURY / LIQUIDITY CONCEPTS AND LIQUIDITY REGULATIONS",
    "job_skill_set": [
      "Excel",
      "Data Analysis",
      "Financial Analysis",
      "Microsoft Word",
      "Microsoft PowerPoint",
      "Data Reconciliation",
      "Financial Reporting",
      "Process Improvement",
      "Liquidity Concepts",
      "Attention to Detail",
      "Time Management",
      "Analytical Skills",
      "Communication",
      "Self-Motivation",
      "Problem Solving",
      "Collaboration",
      "Urgency",
      "Database Management"
    ],
    "short_keywords": [
      "analysis",
      "analytical",
      "attention",
      "collaboration",
      "communication",
      "concepts",
      "data",
      "database",
      "detail",
      "excel",
      "finance",
      "financial",
      "improvement",
      "liquidity",
      "management",
      "manager",
      "microsoft",
      "powerpoint",
      "problem",
      "process",
      "reconciliation",
      "reporting",
      "selfmotivation",
      "skills",
      "solving",
      "time",
      "to",
      "urgency",
      "word"
    ]
  },
  {
    "job_id": "3887856246",
    "job_title": "AVP Financial Analyst - Commercial Transportation Finance",
    "category": "FINANCE",
    "job_description": "WE ARE HIRING FOR AN AVP FINANCIAL ANALYST SUPPORTING OUR COMMERCIAL TRANSPORTATION FINANCE PORTFOLIO. IN THIS ROLE YOU WILL BE ASSIGNED A REVOLVING PORTFOLIO OF CLIENTS ANALYZING FINANCIAL STATEMENTS AND CREATING THE CREDIT WRITE UPS FOR LINES OF CREDIT.\n\nFACILITATES DECISIONING AND ANALYSIS OF ALL TYPES OF CREDIT INFORMATION TO SUPPORT LENDING DECISIONS AND PROCESSES FOR THE BANK. MAINTAINS AND PROMOTES A CLIENT SERVICE ENVIRONMENT TO SATISFY AND EXCEED CUSTOMER NEEDS AND EXPECTATIONS. THIS ROLE WILL MAKE CREDIT DECISIONS AND RECOMMENDATIONS IN ACCORDANCE WITH SOUND CREDIT-GRANTING PRINCIPLES AND IN COMPLIANCE WITH BANK POLICIES & PROCEDURES.\n\nESTABLISHES CROSS-SELLING INITIATIVES TO INCREASE PENETRATION WITH CLIENT.APPLIES DEEP EXPERTISE IN BANK PRODUCTS, PROCESSES AND SYSTEMS AND EFFECTIVELY TROUBLE SHOOTING TO ENSURE A HIGH-QUALITY CLIENT EXPERIENCE.MAY COORDINATE CLOSING WITH CLOSING DEPARTMENT, CLIENTS AND ATTORNEYS.SERVES AS A DAILY ESCALATION RESOURCE TO ENSURE CLIENT EXPECTATIONS ARE MET OR EXCEEDED.ACTS AS A TRUSTED ADVISOR TO ASSIGNED BUSINESS/GROUP.INFLUENCES AND NEGOTIATES TO ACHIEVE BUSINESS OBJECTIVES.RECOMMENDS AND IMPLEMENTS SOLUTIONS BASED ON ANALYSIS OF ISSUES AND IMPLICATIONS FOR THE BUSINESS.CONDUCTS INDEPENDENT ANALYSIS AND ASSESSMENT TO RESOLVE STRATEGIC ISSUES.HELPS DETERMINE BUSINESS PRIORITIES AND BEST SEQUENCE FOR EXECUTION OF BUSINESS/GROUP STRATEGY.ACTS AS THE PRIME SUBJECT MATTER EXPERT FOR INTERNAL/EXTERNAL STAKEHOLDERS.PARTICIPATES IN THE DEVELOPMENT OF FINANCIAL MODELS AND OTHER ANALYTICAL TOOLS TO ASSIST CLIENTS IN EVALUATING CAPITAL STRUCTURE.DESIGNS AND PRODUCES REGULAR AND AD-HOC REPORTS, AND DASHBOARDS.MAINTAINS CURRENT ON FINANCING TRENDS IN TARGET CLIENTS' MARKETS, AND COMMUNICATE SAME TO TEAM MEMBERS.LEADS OR PARTICIPATES IN DEFINING THE COMMUNICATION PLAN DESIGNED TO POSITIVELY INFLUENCE OR CHANGE BEHAVIOUR; DEVELOPS TAILORED MESSAGING; AND IDENTIFIES APPROPRIATE DISTRIBUTION CHANNELS.OVERSEES PREPARATION OF CONCISE, WELL REASONED CREDIT CORRESPONDENCE.COORDINATES THE PREPARATION OF LENDING PROPOSALS AND PITCHES TO PROSPECTIVE CLIENTS WITH EFFORTS TO MAXIMIZE PENETRATION AND RETURNS.NEGOTIATES TRANSACTIONS WITH CLIENTS AND PROVIDES DEAL STRUCTURING EXPERTISE.OVERSEES DOCUMENTATION AND ONGOING MONITORING OF ASSET AND CLIENT PERFORMANCE.MAY MANAGE WORK FLOW OF OTHER ANALYSTS BY ALIGNING TASKS WITH DEPARTMENTAL GOALS AND OBJECTIVES.PROVIDES ACCURATE FINANCIAL ANALYSIS AND RISK ASSESSMENT OF NEW AND EXISTING CUSTOMERS.PARTNERS WITH INTERNAL STAKEHOLDERS FOR ACCURATE, DETAILED CLIENT INFORMATION.DEVELOPS CREDIT INFORMATION TO MAKE LENDING DECISIONS ON NEW, RENEWAL AND EXTENSION LOANS.ASSISTS IN NEGOTIATIONS OF TERMS AND CONDITIONS OF ALL DECISIONS MADE VIA PHONE AND E-MAIL INTERACTION WITH CLIENTS.PREPARES SUMMARY, PRESENT FACTS AND OFFER OPINIONS CONCERNING CREDIT WORTHINESS.MINIMIZES BMO’S RISK EXPOSURE BY ADHERING TO INTERNAL CREDIT POLICIES AND PROCEDURES WITH RESPECT TO LENDING DECISIONS.PROVIDES INPUT INTO THE PLANNING AND IMPLEMENTATION OF OPERATIONAL PROGRAMS.BUILDS EFFECTIVE RELATIONSHIPS WITH INTERNAL/EXTERNAL STAKEHOLDERS.FOCUS IS PRIMARILY ON BUSINESS/GROUP WITHIN BMO; MAY HAVE BROADER, ENTERPRISE-WIDE FOCUS.PROVIDES SPECIALIZED CONSULTING, ANALYTICAL AND TECHNICAL SUPPORT.EXERCISES JUDGMENT TO IDENTIFY, DIAGNOSE, AND SOLVE PROBLEMS WITHIN GIVEN RULES.WORKS INDEPENDENTLY AND REGULARLY HANDLES NON-ROUTINE SITUATIONS.BROADER WORK OR ACCOUNTABILITIES MAY BE ASSIGNED AS NEEDED. \n\nQUALIFICATIONS:\nTYPICALLY BETWEEN 5 - 7 YEARS OF RELEVANT EXPERIENCE AND POST-SECONDARY DEGREE IN RELATED FIELD OF STUDY OR AN EQUIVALENT COMBINATION OF EDUCATION AND EXPERIENCE.DEEP KNOWLEDGE AND TECHNICAL PROFICIENCY GAINED THROUGH EXTENSIVE EDUCATION AND BUSINESS EXPERIENCE.VERBAL & WRITTEN COMMUNICATION SKILLS - IN-DEPTH.COLLABORATION & TEAM SKILLS - IN-DEPTH.ANALYTICAL AND PROBLEM SOLVING SKILLS - IN-DEPTH.INFLUENCE SKILLS - IN-DEPTH.DATA DRIVEN DECISION MAKING - IN-DEPTH.\n\n\nCOMPENSATION AND BENEFITS:\n\n$87,000.00 - $161,400.00\n\nPAY TYPE:\n\nSALARIED\n\nTHE ABOVE REPRESENTS BMO FINANCIAL GROUP’S PAY RANGE AND TYPE.\n\nSALARIES WILL VARY BASED ON FACTORS SUCH AS LOCATION, SKILLS, EXPERIENCE, EDUCATION, AND QUALIFICATIONS FOR THE ROLE, AND MAY INCLUDE A COMMISSION STRUCTURE. SALARIES FOR PART-TIME ROLES WILL BE PRO-RATED BASED ON NUMBER OF HOURS REGULARLY WORKED. FOR COMMISSION ROLES, THE SALARY LISTED ABOVE REPRESENTS BMO FINANCIAL GROUP’S EXPECTED TARGET FOR THE FIRST YEAR IN THIS POSITION.\n\nBMO FINANCIAL GROUP’S TOTAL COMPENSATION PACKAGE WILL VARY BASED ON THE PAY TYPE OF THE POSITION AND MAY INCLUDE PERFORMANCE-BASED INCENTIVES, DISCRETIONARY BONUSES, AS WELL AS OTHER PERKS AND REWARDS. BMO ALSO OFFERS HEALTH INSURANCE, TUITION REIMBURSEMENT, ACCIDENT AND LIFE INSURANCE, AND RETIREMENT SAVINGS PLANS. TO VIEW MORE DETAILS OF OUR BENEFITS, PLEASE VISIT: HTTPS://JOBS.BMO.COM/GLOBAL/EN/TOTAL-REWARDS\n\nWE’RE HERE TO HELP\n\nAT BMO WE ARE DRIVEN BY A SHARED PURPOSE: BOLDLY GROW THE GOOD IN BUSINESS AND LIFE. IT CALLS ON US TO CREATE LASTING, POSITIVE CHANGE FOR OUR CUSTOMERS, OUR COMMUNITIES AND OUR PEOPLE. BY WORKING TOGETHER, INNOVATING AND PUSHING BOUNDARIES, WE TRANSFORM LIVES AND BUSINESSES, AND POWER ECONOMIC GROWTH AROUND THE WORLD.\n\nAS A MEMBER OF THE BMO TEAM YOU ARE VALUED, RESPECTED AND HEARD, AND YOU HAVE MORE WAYS TO GROW AND MAKE AN IMPACT. WE STRIVE TO HELP YOU MAKE AN IMPACT FROM DAY ONE – FOR YOURSELF AND OUR CUSTOMERS. WE’LL SUPPORT YOU WITH THE TOOLS AND RESOURCES YOU NEED TO REACH NEW MILESTONES, AS YOU HELP OUR CUSTOMERS REACH THEIRS. FROM IN-DEPTH TRAINING AND COACHING, TO MANAGER SUPPORT AND NETWORK-BUILDING OPPORTUNITIES, WE’LL HELP YOU GAIN VALUABLE EXPERIENCE, AND BROADEN YOUR SKILLSET.\n\nTO FIND OUT MORE VISIT US AT HTTPS://JOBS.BMO.COM/US/EN\n\nBMO IS COMMITTED TO AN INCLUSIVE, EQUITABLE AND ACCESSIBLE WORKPLACE. BY LEARNING FROM EACH OTHER’S DIFFERENCES, WE GAIN STRENGTH THROUGH OUR PEOPLE AND OUR PERSPECTIVES. BMO IS AN EQUAL OPPORTUNITY/AFFIRMATIVE ACTION EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO SEX, GENDER IDENTITY, SEXUAL ORIENTATION, RACE, COLOR, RELIGION, NATIONAL ORIGIN, DISABILITY, PROTECTED VETERAN STATUS, AGE, OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW. ACCOMMODATIONS ARE AVAILABLE ON REQUEST FOR CANDIDATES TAKING PART IN ALL ASPECTS OF THE SELECTION PROCESS. TO REQUEST ACCOMMODATION, PLEASE CONTACT YOUR RECRUITER.\n\nNOTE TO RECRUITERS: BMO DOES NOT ACCEPT UNSOLICITED RESUMES FROM ANY SOURCE OTHER THAN DIRECTLY FROM A CANDIDATE. ANY UNSOLICITED RESUMES SENT TO BMO, DIRECTLY OR INDIRECTLY, WILL BE CONSIDERED BMO PROPERTY. BMO WILL NOT PAY A FEE FOR ANY PLACEMENT RESULTING FROM THE RECEIPT OF AN UNSOLICITED RESUME. A RECRUITING AGENCY MUST FIRST HAVE A VALID, WRITTEN AND FULLY EXECUTED AGENCY AGREEMENT CONTRACT FOR SERVICE TO SUBMIT RESUMES.",
    "job_skill_set": [
      "financial analysis",
      "data analysis",
      "financial modeling",
      "risk assessment",
      "reporting",
      "capital structure evaluation",
      "negotiation",
      "communication",
      "collaboration",
      "problem solving",
      "influence",
      "independent work",
      "relationship building",
      "strategic thinking",
      "teamwork",
      "credit assessment",
      "lending processes",
      "troubleshooting",
      "customer service"
    ],
    "short_keywords": [
      "analysis",
      "analyst",
      "assessment",
      "avp",
      "building",
      "capital",
      "collaboration",
      "commercial",
      "communication",
      "credit",
      "customer",
      "data",
      "evaluation",
      "finance",
      "financial",
      "independent",
      "influence",
      "lending",
      "modeling",
      "negotiation",
      "problem",
      "processes",
      "relationship",
      "reporting",
      "risk",
      "service",
      "solving",
      "strategic",
      "structure",
      "teamwork",
      "thinking",
      "transportation",
      "troubleshooting",
      "work"
    ]
  },
  {
    "job_id": "3901672554",
    "job_title": "Finance Associate",
    "category": "FINANCE",
    "job_description": "WHAT YOU’LL DOAS A FINANCE ASSOCIATE WITH IMAGINE PEDIATRICS, YOU WILL HELP BUILD A BEST-IN-CLASS VALUE-BASED CARE (VBC) FINANCE FUNCTION FROM THE GROUND UP. THIS ROLE IS HANDS-ON, HIGHLY VISIBLE, AND WILL REPORT DIRECTLY TO THE SENIOR MANAGER OF FINANCE. YOU WILL HAVE DIRECT RESPONSIBILITY FOR CORE ASPECTS OF THE FINANCE FUNCTION. THIS ROLE WILL BE HEAVILY WEIGHTED TOWARDS STRATEGIC FINANCE PROJECTS THAT INCLUDE RISK REVENUE ESTIMATION AND PLANNING, DEVELOPING LEADING INDICATORS OF COMPANY PERFORMANCE, LONG-TERM FINANCIAL PLANNING, AND WILL SUPPORT OPERATIONS, VBC SETTLEMENTS, AND BUSINESS DEVELOPMENT (BD) PRICING. PRIMARY FUNCTIONS FOR THIS ROLE WILL INCLUDE:ANALYZING, SYNTHESIZING, PREPARING, AND PRESENTING INSIGHTFUL MONTHLY FINANCIAL AND BUSINESS PERFORMANCE RESULTS FOR EXECUTIVE LEADERSHIPCOLLABORATING WITH ACTUARIES TO DERIVE RISK REVENUE RECOGNITION ESTIMATES THAT REQUIRE COMPLEX AND NUANCED ANALYSISBUILDING AND MAINTAINING DETAILED BOTTOMS-UP OPERATIONAL AND FINANCIAL FORECAST MODELS THAT INFORM NEAR-TERM AND LONG-TERM BUSINESS INITIATIVES.PERFORMING FINANCIAL AND OPERATIONAL ANALYSES THAT PROVIDE DECISION-MAKING SUPPORT FOR EXECUTIVE LEADERSHIP AND ENABLE PROFITABLE GROWTH FOR IMAGINE.PERFORM ROI AND PRICING ANALYSES FOR THE UNDERWRITING OF NEW DEALS/PAYOR CONTRACTSEXECUTING AD-HOC ASSIGNMENTS TO SUPPORT BUILDING IMAGINE’S CORPORATE OPERATIONS.SUPPORTING THE FINANCIAL VIABILITY OF IMAGINE OPERATIONS INCLUDING TREASURY, INVESTMENT, GOVERNANCE, AND PROFITABILITY ANALYSIS.HELPING TO SET HIRING AND PERFORMANCE TARGETS FOR MARKET-LEVEL STAFF AND TRACK PERFORMANCE TO PLANANALYZE AND REPORT LEADING AND LAGGING INDICATORS FOR OPERATIONS\nWHAT YOU BRING & HOW YOU QUALIFYFIRST AND FOREMOST, YOU’RE PASSIONATE AND COMMITTED TO REIMAGINING PEDIATRIC HEALTH CARE AND CREATING A WORLD WHERE EVERY CHILD WITH COMPLEX MEDICAL CONDITIONS GETS THE CARE AND SUPPORT THEY DESERVE. YOU WANT AN ACTIVE ROLE IN BUILDING A DIVERSE AND VALUES-DRIVEN CULTURE. THINGS CHANGE QUICKLY IN A START-UP ENVIRONMENT; YOU ACCEPT THAT AND ARE WILLING AND ABLE TO REACT QUICKLY TO TIME-SENSITIVE NEEDS OF THE BUSINESS WITH AGILITY AND ACCURACY. YOU WILL NOT BE EXPECTED TO KNOW EVERYTHING, BUT A SENSE OF INTELLECTUAL CURIOSITY AND WILLINGNESS TO ASK QUESTIONS WILL BE CRITICAL TO YOUR DEVELOPMENT. IN THIS ROLE, YOU WILL NEED2-3 YEARS OF ANALYST EXPERIENCE IN INVESTMENT BANKING, PRIVATE EQUITY, OR MANAGEMENT CONSULTING, OR 3-5 YEARS OF CORPORATE FP&A/RELATED EXPERIENCESTRONG PREFERENCE FOR EXPERIENCE IN VALUE-BASED HEALTHCARE BUT NOT REQUIREDBACHELOR’S DEGREE IN FINANCE, ACCOUNTING, ECONOMICS, OR RELATED MAJORDESIRE TO WORK IN A FAST-PACED START-UP ENVIRONMENT.INDUSTRIOUS, RESOURCEFUL, ORGANIZED, SELF-SUFFICIENT, AND COMFORTABLE WITH AMBIGUITY.TEAM PLAYER WITH A POSITIVE ATTITUDE AND STRONG WILLINGNESS TO LEARN.DEMONSTRATED ABILITY AS A SELF-STARTER WITH AN EXCEPTIONAL WORK ETHIC.ABILITY TO RUN FAIRLY INDEPENDENTLY WITH STRATEGIC ANALYSISWILLINGNESS TO TACKLE A VARIETY OF CHALLENGING ASSIGNMENTS ACROSS ALL AREAS OF THE BUSINESS.TAKES FULL OWNERSHIP OF PROJECTS FROM PROBLEM STATEMENT TO PRESENTING/JUSTIFYING RESULTSCAN SYNTHESIZE COMPLEX ANALYSES AND MODELS INTO SUCCINCT AND QUALITY PRESENTATIONS/REPORTS WITH MINIMAL GUIDANCE FROM SUPERVISOR/CFOCAN TAKE ON TIME-SENSITIVE TASKS WITH A SENSE OF URGENCY.STRONG ATTENTION TO DETAILEXCEPTIONAL CRITICAL THINKER AND PROBLEM SOLVERSKILLED IN EXCEL, POWERPOINT, AND WORDDISPLAYS FOUNDATIONAL ACCOUNTING AND FINANCE KNOWLEDGEEFFECTIVELY SOURCES DATA AND INFORMATION FROM THE RIGHT PLACEDISPLAYS INTUITIVE BUSINESS ACUMENFOSTERS AN ENVIRONMENT OF LEARNING AND DEVELOPMENT FOR JUNIOR PEERSPARTICIPATES IN BUILDING A POSITIVE WORK CULTURE\n\nWHAT WE OFFER (BENEFITS + PERKS)WE OFFER A COMPETITIVE BASE SALARY FOR THIS POSITION IN ADDITION TO A COMPETITIVE COMPANY BENEFITS PACKAGE AND ELIGIBILITY TO PARTICIPATE IN AN EMPLOYEE EQUITY PURCHASE PROGRAM (AS APPLICABLE). WHEN DETERMINING COMPENSATION, WE ANALYZE AND CAREFULLY CONSIDER SEVERAL FACTORS INCLUDING JOB-RELATED KNOWLEDGE, SKILLS AND EXPERIENCE. THESE CONSIDERATIONS MAY CAUSE YOUR COMPENSATION TO VARY.\nWE PROVIDE THESE ADDITIONAL BENEFITS AND PERKS:FULL MEDICAL, DENTAL, AND VISION INSURANCEHEALTHCARE AND DEPENDENT CARE FSA401(K) WITH 4% MATCH, VESTED 100% FROM DAY ONE20 DAYS PTO + 10 COMPANY HOLIDAYS & 2 FLOATING HOLIDAYSPAID PARENTAL LEAVEADDITIONAL BENEFITS TO BE DETAILED IN OFFER",
    "job_skill_set": [
      "financial analysis",
      "Excel",
      "financial reporting",
      "accounting knowledge",
      "data sourcing",
      "risk revenue estimation",
      "business development pricing",
      "teamwork",
      "problem solving",
      "communication",
      "adaptability",
      "intellectual curiosity",
      "ownership",
      "attention to detail",
      "critical thinking",
      "positive attitude",
      "learning and development",
      "forecast modeling",
      "PowerPoint",
      "ROI analysis"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "analysis",
      "and",
      "associate",
      "attention",
      "attitude",
      "business",
      "communication",
      "critical",
      "curiosity",
      "data",
      "detail",
      "development",
      "estimation",
      "excel",
      "finance",
      "financial",
      "forecast",
      "intellectual",
      "knowledge",
      "learning",
      "modeling",
      "ownership",
      "positive",
      "powerpoint",
      "pricing",
      "problem",
      "reporting",
      "revenue",
      "risk",
      "roi",
      "solving",
      "sourcing",
      "teamwork",
      "thinking",
      "to"
    ]
  },
  {
    "job_id": "3903840909",
    "job_title": "Analyst, Finance Change Management",
    "category": "FINANCE",
    "job_description": "SMBC GROUP IS A TOP-TIER GLOBAL FINANCIAL GROUP. HEADQUARTERED IN TOKYO AND WITH A 400-YEAR HISTORY, SMBC GROUP OFFERS A DIVERSE RANGE OF FINANCIAL SERVICES, INCLUDING BANKING, LEASING, SECURITIES, CREDIT CARDS, AND CONSUMER FINANCE. THE GROUP HAS MORE THAN 130 OFFICES AND 80,000 EMPLOYEES WORLDWIDE IN NEARLY 40 COUNTRIES. SUMITOMO MITSUI FINANCIAL GROUP, INC. (SMFG) IS THE HOLDING COMPANY OF SMBC GROUP, WHICH IS ONE OF THE THREE LARGEST BANKING GROUPS IN JAPAN. SMFG’S SHARES TRADE ON THE TOKYO, NAGOYA, AND NEW YORK (NYSE: SMFG) STOCK EXCHANGES.\n\nIN THE AMERICAS, SMBC GROUP HAS A PRESENCE IN THE US, CANADA, MEXICO, BRAZIL, CHILE, COLOMBIA, AND PERU. BACKED BY THE CAPITAL STRENGTH OF SMBC GROUP AND THE VALUE OF ITS RELATIONSHIPS IN ASIA, THE GROUP OFFERS A RANGE OF COMMERCIAL AND INVESTMENT BANKING SERVICES TO ITS CORPORATE, INSTITUTIONAL, AND MUNICIPAL CLIENTS. IT CONNECTS A DIVERSE CLIENT BASE TO LOCAL MARKETS AND THE ORGANIZATION’S EXTENSIVE GLOBAL NETWORK. THE GROUP’S OPERATING COMPANIES IN THE AMERICAS INCLUDE SUMITOMO MITSUI BANKING CORP. (SMBC), SMBC NIKKO SECURITIES AMERICA, INC., SMBC CAPITAL MARKETS, INC., SMBC RAIL SERVICES LLC, MANUFACTURERS BANK, JRI AMERICA, INC., SMBC LEASING AND FINANCE, INC., BANCO SUMITOMO MITSUI BRASILEIRO S.A., AND SUMITOMO MITSUI FINANCE AND LEASING CO., LTD.\n\nTHE ANTICIPATED SALARY RANGE FOR THIS ROLE IS BETWEEN $66,000.00 AND $90,000.00. THE SPECIFIC SALARY OFFERED TO AN APPLICANT WILL BE BASED ON THEIR INDIVIDUAL QUALIFICATIONS, EXPERIENCES, AND AN ANALYSIS OF THE CURRENT COMPENSATION PAID IN THEIR GEOGRAPHY AND THE MARKET FOR SIMILAR ROLES AT THE TIME OF HIRE. THE ROLE MAY ALSO BE ELIGIBLE FOR AN ANNUAL DISCRETIONARY INCENTIVE AWARD. IN ADDITION TO CASH COMPENSATION, SMBC OFFERS A COMPETITIVE PORTFOLIO OF BENEFITS TO ITS EMPLOYEES.\n\nROLE DESCRIPTION\n\nOVERVIEW\n\nTO SUPPORT SMBC AMERICAS' BUSINESS GROWTH STRATEGY, SMBC FINANCE IS EXECUTING A MAJOR INITIATIVE TO REVIEW AND ENHANCE CRITICAL FINANCE PROCESSES WITHIN ITS US OPERATIONS, INCLUDING FINANCIAL PLANNING, REPORTING, AND DATA MANAGEMENT. WORKING WITH CORE FINANCE TEAMS AND OTHER KEY COLLEAGUES (TECHNOLOGY, RISK, COMPLIANCE, ETC.), FINANCE CHANGE IS PRIMARILY RESPONSIBLE FOR ESTABLISHING AND MANAGING LARGE-SCALE PROGRAMS FOCUSED ON IMPLEMENTATION OF PROCESSES, METHODOLOGIES, AND SYSTEMS THAT MEET REGULATORY REQUIREMENTS AND INDUSTRY BEST PRACTICES. THE ANALYST WILL BE RESPONSIBLE FOR PROVIDING PROJECT MANAGEMENT SUPPORT, AS WELL AS DATA-BASED ANALYSIS AS NEEDED, TO SUPPORT SUCCESSFUL PROJECT COMPLETION.\n\nROLE OBJECTIVES: DELIVERY\n\nRESPONSIBILITIES\n\n ASSIST WITH THE MANAGEMENT OF PLANNING AND EXECUTION OF PROJECT DELIVERABLES, COORDINATING ACROSS PROJECT STAKEHOLDERS TO DRIVE AND MONITOR PROGRESS. EXECUTE BUSINESS ANALYST RESPONSIBILITIES, AS NEEDED, TO PERFORM CRITICAL ANALYSIS, ASSESSMENT, AND DOCUMENTATION OF BUSINESS REQUIREMENTS. SUPPORT DELIVERY OF KEY FINANCE PROGRAMS, MANAGING CREATION AND MAINTENANCE OF PROJECT ARTIFACTS SUCH AS PROJECT PLANS, PROJECT CHARTERS, BUSINESS CASES, AND STATUS REPORTS. CONDUCT DETAILED ANALYSES TO SUPPORT PROJECT WORK EFFORTS. DEVELOP CONSTRUCTIVE RELATIONSHIPS WITHIN AND OUTSIDE THE TEAM, INCLUDING COMMUNICATION OF KEY MESSAGES AND UPDATES TO RELEVANT STAKEHOLDERS IN A TIMELY MANNER AND MANAGING CLIENT EXPECTATIONS AND DETERMINING ACTIONS TO IMPROVE SERVICES, AS NECESSARY.\n\nQUALIFICATIONS AND SKILLS\n\nQUALIFICATIONS \n\n 0-2 YEARS EXPERIENCE IN CHANGE/PROJECT MANAGEMENT, FINANCIAL SERVICES OR RELATED EXPERIENCE EXCELLENT COMMUNICATION SKILLS AND THE ABILITY TO EFFECTIVELY BUILD AND MANAGE RELATIONSHIPS WITH TEAM MEMBERS AND COLLEAGUES ACROSS ALL LEVELS. PROACTIVE SELF-STARTER WITH ABILITY TO PRIORITIZE EFFORTS ACROSS MULTIPLE PROJECTS AND MANAGE COMPETING DEADLINES. COLLABORATIVE AND DEMONSTRATED ABILITY TO WORK AS PART OF A TEAM. STRONG VERBAL AND WRITTEN COMMUNICATION AND PRESENTATION SKILLS. PROFICIENCY IN WORD, POWERPOINT, AND EXCEL APPLICATIONS.\n\nADDITIONAL REQUIREMENTS\n\nSMBC’S EMPLOYEES PARTICIPATE IN A HYBRID WORKFORCE MODEL THAT PROVIDES EMPLOYEES WITH AN OPPORTUNITY TO WORK FROM HOME, AS WELL AS, FROM AN SMBC OFFICE. SMBC REQUIRES THAT EMPLOYEES LIVE WITHIN A REASONABLE COMMUTING DISTANCE OF THEIR OFFICE LOCATION. PROSPECTIVE CANDIDATES WILL LEARN MORE ABOUT THEIR SPECIFIC HYBRID WORK SCHEDULE DURING THEIR INTERVIEW PROCESS.\n\nWE ARE AN EQUAL EMPLOYMENT OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, GENDER, NATIONAL ORIGIN, DISABILITY STATUS, PROTECTED VETERAN STATUS OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW. SMBC PROVIDES REASONABLE ACCOMMODATIONS FOR EMPLOYEES AND APPLICANTS WITH DISABILITIES CONSISTENT WITH APPLICABLE LAW. IF YOU NEED A REASONABLE ACCOMMODATION DURING THE APPLICATION PROCESS, PLEASE LET US KNOW AT ACCOMMODATIONS@SMBCGROUP.COM.",
    "job_skill_set": [
      "project management",
      "financial analysis",
      "data management",
      "Microsoft Excel",
      "Microsoft PowerPoint",
      "Microsoft Word",
      "communication",
      "relationship management",
      "teamwork",
      "proactive",
      "self-starter",
      "prioritization",
      "collaboration",
      "presentation skills"
    ],
    "short_keywords": [
      "analysis",
      "analyst",
      "change",
      "collaboration",
      "communication",
      "data",
      "excel",
      "finance",
      "financial",
      "management",
      "microsoft",
      "powerpoint",
      "presentation",
      "prioritization",
      "proactive",
      "project",
      "relationship",
      "selfstarter",
      "skills",
      "teamwork",
      "word"
    ]
  },
  {
    "job_id": "3906241082",
    "job_title": "Director of Finance",
    "category": "FINANCE",
    "job_description": "KÖRBER IS THE HOME FOR PASSIONATE PEOPLE WHO INNOVATE, COLLABORATE AND LOVE WHAT THEY DO. THE ENTREPRENEURIAL SPIRIT IS OUR JOINT DNA. WE DEVELOP FUTURE TECHNOLOGIES AND SUPPORT TALENTS TO DEPLOY THEIR SKILLS AND REACH THEIR FULL POTENTIAL. WE COMBINE OUR STRONG HERITAGE WITH OUR UNDERSTANDING FOR LOCAL SPECIFICS AND A GLOBAL MINDSET TO BRING PEOPLE TOGETHER AND CREATE VALUABLE SOLUTIONS FOR OUR CUSTOMERS. WE AIM FOR BEING THE FIRST TO DO THE RIGHT THING AT THE RIGHT TIME.\n\nJOIN OUR DYNAMIC TEAM OF INNOVATIVE INDIVIDUALS WHO ENJOY THE BENEFITS OF WORK CHALLENGES AND ACCOMPLISHMENTS. WE OFFER A POSITIVE WORK ENVIRONMENT, EXCELLENT GROUP HEALTH AND DENTAL PLAN, AND A GENEROUS PAID TIME OFF PROGRAM. COME JOIN OUR TEAM!\n\nYOUR ROLE ON OUR TEAM\n\n\nYOU WILL MANAGE MONTHLY REPORTING, PROJECTIONS I, II, III AND BUDGET PLANNING WITH THE BA. YOU WILL DEVELOP A STRUCTURED PROJECT CONTROLLING WITH ONGOING MONTHLY ANALYSIS TO ENSURE SUSTAINABLE BUSINESS DEVELOPMENT. YOU WILL IMPROVE PROJECT PROGRESS TRACKING AND PROJECT FORECASTING METHODS \n\n\nYOUR PROFILE\n\n\nYOU HAVE A DIPLOMA OR DEGREE IN BUSINESS ADMINISTRATION OR CHARTERED ACCOUNTANT. YOU HAVE 3 YEARS’ OF EXPERIENCE IN MATRIX ORGANIZATIONS. YOU HAVE STRONG EXPERIENCE IN PROJECT CONTROLLING. YOUR INTERNATIONAL ACCOUNTING, GERMAN GAAP BACKGROUND IS REQUIRED. YOU HAVE COMPREHENSIVE KNOWLEDGE AND STRONG EXPERIENCE IN PROJECT CONTROLLING FOR SEVERAL PROJECTS. YOUR ERP SYSTEMS WITH SAP BACKGROUND EXPERIENCE IS A PLUS. YOU HAVE MS EXCEL SKILLS. YOU POSSESS RESILIENCE, AND ABILITY TO WORK IN A FAST-PACE HIGH-PRESSURE ENVIRONMENT. YOU HAVE VERY STRONG COMMUNICATION SKILLS, AND CAN COMMUNICATE WITH ALL HIERARCHY LEVELS AND INSPIRE PEOPLE. YOU DEMONSTRATE STRONG PERSUASIVENESS AND PERSISTENCE. YOU ARE A TEAM PLAYER, WITH A HIGH DEGREE OF SELF-RESPONSIBILITY. YOU EXHIBIT INTEGRITY AND DISCRETION. YOU ARE OPEN AND CURIOUS, AND HAVE THE ABILITY TO ANALYSE, AND QUICKLY REACT TO CHANGES. YOU ARE FLEXIBLE WITH THE CAPABILITY OF SETTING PRIORITIES. YOU HAVE HANDS-ON MENTALITY, AND CAPABILITY FOR SETTING PRIORITIES \n\n\nCAN YOU FIND YOURSELF IN THIS PROFILE? THEN KÖRBER IS THE RIGHT PLACE FOR YOU. WE ARE LOOKING FORWARD TO GETTING TO KNOW YOU!\n\nYOUR ENVIRONMENT AT KÖRBER\n\nKÖRBER SUPPLY CHAIN IS THE LEADING PROVIDER IN BEST-IN-CLASS SUPPLY CHAIN SOLUTIONS THAT GOES BEYOND SOFTWARE TO INCLUDE AUTOMATION, VOICE, ROBOTICS, MATERIALS HANDLING, AND PARCEL LOGISTICS – PLUS THE SYSTEMS INTEGRATION EXPERTISE TO TIE IT ALL TOGETHER. OUR DEDICATED TEAM OF HIGHLY-TRAINED EMPLOYEES OFFERS FLEXIBLE AND INNOVATIVE SOLUTIONS TO KEEP THOUSANDS OF SUPPLY CHAINS MOVING THROUGHOUT THE WORLD FOR OUR CUSTOMERS.\n\nYOUR BENEFITS\n\n\nYOU WILL WORK IN A MODERN, FLEXIBLE WORK ENVIRONMENT WITH OPEN CULTURE TOWARDS IMPROVEMENTS AND NEW IDEAS YOU WILL BE WORKING IN A FAST-PACED AND DYNAMIC ENVIRONMENT, WITH INTERNATIONAL CLIENTS AND COLLEAGUES YOU WILL RECEIVE GENEROUS TIME OFF AND A COMPETITIVE SALARY YOU WILL HAVE ACCESS TO ATTRACTIVE BENEFITS, INCLUDING EDUCATIONAL AND EMPLOYEE ASSISTANCE PROGRAMS, AND 401(K) CONTRIBUTION MATCHING YOU WILL BE PROVIDED WITH COMPANY-PAID BENEFITS SUCH AS BASIC LIFE INSURANCE AND AD&D INSURANCE, SHORT AND LONG-TERM DISABILITY PLANS, AND MANY MORE \n\n\nEQUAL EMPLOYER OPPORTUNITY\n\nKÖRBER IS AN EQUAL OPPORTUNITY EMPLOYER. AS SUCH, KÖRBER OFFERS EQUAL EMPLOYMENT OPPORTUNITIES WITHOUT REGARD TO RACE, COLOR, GENDER, RELIGION, AGE, NATIONALITY, SOCIAL OR ETHNIC ORIGIN, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, MARITAL STATUS, PREGNANCY, DISABILITY, VETERAN STATUS OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW. WE ENCOURAGE U.S. MILITARY VETERANS TO APPLY.",
    "job_skill_set": [
      "Budget Planning",
      "Monthly Reporting",
      "Communication",
      "Teamwork",
      "Resilience",
      "Integrity",
      "Flexibility",
      "Analytical Skills",
      "Self-Responsibility",
      "Ability to Set Priorities",
      "Project Controlling",
      "International Accounting",
      "German GAAP",
      "ERP Systems (SAP)",
      "MS Excel",
      "Forecasting Methods",
      "Persuasiveness",
      "Curiosity"
    ],
    "short_keywords": [
      "ability",
      "accounting",
      "analytical",
      "budget",
      "communication",
      "controlling",
      "curiosity",
      "director",
      "erp",
      "excel",
      "finance",
      "flexibility",
      "forecasting",
      "gaap",
      "german",
      "integrity",
      "international",
      "methods",
      "monthly",
      "ms",
      "of",
      "persuasiveness",
      "planning",
      "priorities",
      "project",
      "reporting",
      "resilience",
      "sap",
      "selfresponsibility",
      "set",
      "skills",
      "systems",
      "teamwork",
      "to"
    ]
  },
  {
    "job_id": "3906230836",
    "job_title": "Director, Global Client Finance",
    "category": "FINANCE",
    "job_description": "BUSINESS OVERVIEW \nIPG MEDIABRANDS IS THE MEDIA AND MARKETING SOLUTIONS DIVISION OF INTERPUBLIC GROUP (NYSE: IPG). IPG MEDIABRANDS MANAGES OVER $47 BILLION IN MARKETING INVESTMENT GLOBALLY ON BEHALF OF ITS CLIENTS ACROSS ITS FULL-SERVICE AGENCY NETWORKS UM, INITIATIVE AND MEDIAHUB AND THROUGH ITS AWARD-WINNING SPECIALTY BUSINESS UNITS HEALIX, KINESSO, MAGNA, MEDIABRANDS CONTENT STUDIO, ORION HOLDINGS, RAPPORT, AND THE IPG MEDIA LAB. IPG MEDIABRANDS CLIENTS INCLUDE MANY OF THE WORLD’S MOST RECOGNIZABLE AND ICONIC BRANDS FROM A BROAD PORTFOLIO OF INDUSTRY SECTORS INCLUDING AUTOMOTIVE, PERSONAL FINANCE, CONSUMER PRODUCT GOODS (CPG), PHARMA, HEALTH AND WELLNESS, ENTERTAINMENT, FINANCIAL SERVICES, ENERGY, TOYS AND GAMING, DIRECT TO CONSUMER AND E-COMMERCE, RETAIL, HOSPITALITY, FOOD AND BEVERAGE, FASHION AND BEAUTY. THE COMPANY EMPLOYS MORE THAN 18,000 DIVERSE MARKETING COMMUNICATION PROFESSIONALS IN MORE THAN 130 COUNTRIES. LEARN MORE AT WWW.IPGMEDIABRANDS.COM.\nPOSITION SUMMARY\nTHE GLOBAL COMMERCIAL FINANCE (GCF) DEPARTMENT AT MEDIABRANDS IS TASKED WITH THE FINANCIAL AND COMMERCIAL MANAGEMENT OF THE GLOBAL CLIENTS WHICH INCLUDE JOHNSON & JOHNSON, AMAZON, NIKE, EXXONMOBIL, BMW, UNILEVER, SONY, AMERICAN EXPRESS, AND OTHERS. THE PRIMARY GOAL OF THIS TEAM IS TO DRIVE INCREASED GLOBAL CLIENT PROFITABILITY AND REVENUE ACROSS THE MEDIABRANDS COMPANIES. GCF PARTNERS WITH AGENCY LEADERSHIP IN CLIENT NEGOTIATIONS, INTRODUCES INNOVATIVE COMPENSATION MODELS WHERE POSSIBLE AND PROVIDES GLOBAL FINANCIAL LEADERSHIP AND BEST PRACTICES. GCF ALSO PLAYS A CRITICAL ROLE IN NEW BUSINESS PITCHES WITH RESPECT TO COMPENSATION AND OPERATIONAL RESPONSE. MEDIABRANDS IS A GLOBAL NETWORK AND GCF FREQUENTLY INTERACTS WITH THE GLOBAL MARKETS. THIS TEAM IS ALSO RESPONSIBLE FOR REGULAR REPORTING OF CLIENT PROFITABILITY AND SUPPORT FOR THE MEDIABRANDS GLOBAL CFO ON VARIOUS OPERATIONAL INITIATIVES. THIS ROLE WILL SUPPORT THE GCF TEAM IN THE OVERALL MANAGEMENT OF GLOBAL CLIENTS.\nRESPONSIBILITIESSUPPORT EVP, GLOBAL COMMERCIAL OPERATIONS WITH MANAGEMENT OF A SELECT GROUP OF GLOBAL CLIENTS INCLUDING LEADING REVIEWS OF FINANCIAL PERFORMANCE AGAINST TARGETS, MARKET ISSUES AND GROWTH OPPORTUNITIES, AND ATTEND REGULAR MEETINGS WITH CLIENT BUSINESS PARTNERSMANAGE PREPARATION OF PROFITABILITY ANALYSIS AND INTERNAL REPORTING, CONTRACT DEVELOPMENT AND MAINTENANCE, CLIENT REPORTING, AND COMPENSATION NEGOTIATIONSUPPORT COMMERCIAL PORTION OF NEW BUSINESS PITCHES INCLUDING RFP RESPONSES, PITCH BUDGET MANAGEMENT, COMPENSATION MODELLING, AND CONTRACT DEVELOPMENT.MANAGE AND COACH DIRECT REPORT THROUGH DAILY TASKS AND ENSURING CONSISTENT QUALITY OF WORKSUPPORT IPG, MB AND CLIENT BUSINESS LEADS WITH AD-HOC FINANCIAL INFORMATION AND REPORTSPROACTIVELY HIGHLIGHT POTENTIAL OPPORTUNITIES AND RISKSCOLLECT AND ANALYZE FINANCIAL INFORMATION FROM INTERNATIONAL MARKETS TO REVIEW WITH MANAGERS AND DETERMINE PROPER COURSES OF ACTION AND/OR FOLLOW UPSREVIEW SPECIFIC MARKET VARIANCES TO FORECAST AND TARGETWORK WITH GCF TEAM TO UPDATE AGENCY LEADERSHIP QUARTERLY ON CHANGES IN CLIENTS’ FINANCIALS OR GLOBAL ECONOMIC FORCES THAT AFFECT HOW MEDIABRANDS DOES BUSINESS.ENSURE COMPLIANCE ACROSS INTERNATIONAL MARKETS: REVIEW REPORTING AND ANALYZE WITH CLIENT FINANCE, MARKETING AND PROCUREMENT LEADSSUPPORT GLOBAL CLIENT REPORTING DELIVERABLES AND CONTRACTUAL COMMITMENTS THROUGHOUT THE YEARSOURCE DATA AS NEEDED FROM VARIOUS FINANCIAL SYSTEMS AND CREATE AD HOC ANALYSES\nDESIRED SKILLS & EXPERIENCE\nPROVEN TRACK RECORD WITH 7+ YEARS OF AGENCY OR CLIENT WORK EXPERIENCE, PREFERABLY IN COMMERCIAL, PROCUREMENT, OR MARKETING AGENCY MANAGEMENT ROLESSTRONG ANALYTICAL SKILLS WITH A VERY STRONG LEVEL OF ATTENTION TO DETAILACCURATE, CURIOUS, AND EFFICIENT IN WORK WITH EXCELLENT COMMUNICATIONS SKILLS (SPOKEN AND WRITTEN)ABILITY TO ALWAYS FIND A WAY TO DELIVER, WHETHER IT’S BY ROLLING UP YOUR SLEEVES TO GET IT DONE YOURSELF, MANAGING THROUGH INFLUENCE, OR GUIDING/MOTIVATING A TEAM TO RALLY THROUGH OBSTACLES WITH ENTHUSIASMEXCELLENT TIME MANAGEMENT SKILLS WITH AN ADAPTABLE/FLEXIBLE ATTITUDEAN EVEN-KEELED DEMEANOR THAT CONVEYS PROFESSIONALISMSELF-CONFIDENCE & RESILIENCETOLERANCE FOR AMBIGUITY, ABILITY TO TAKE A FLEXIBLE APPROACHABLE TO WORK CALMLY UNDER PRESSURESTRONG PERSONAL AWARENESS AND INSIGHT – RECEIVES AND REACTS UPON FEEDBACKLEADS WITH INTEGRITY, HONESTY, AND TRUSTPROACTIVE TASK-ORIENTED AND TEAM APPROACHEXCELLENT ATTENTION TO DETAILPROFICIENCY WITH MICROSOFT WORD, OUTLOOK, POWERPOINT, AND ESPECIALLY EXCELEXPERIENCE IN MEDIA PLANNING AND/OR BUYING AN ASSET BUT NOT NECESSARYEXPERIENCE WITH HYPERION IS AN ASSET BUT NOT NECESSARYFOREIGN LANGUAGE AN ASSET BUT NOT NECESSARY\nWE SEE YOU AT IPG MEDIABRANDS, WE ARE UNIFIED BEHIND A COMMITMENT TO FOSTERING A CULTURE OF INCLUSION AND BELONGING. TOGETHER, WE SHINE THROUGH A SET OF SHARED VALUES AND BEHAVIORS. WE TAKE PRIDE IN OUR RESPONSIBILITY TO OUR CLIENTS, COMMUNITIES, AND TO EACH OTHER. WE EMBRACE DIFFERENCES AND RECOGNIZE THE UNIQUE VALUE THAT EACH OF US BRINGS TO OUR COMMUNITY.\nWE ENCOURAGE YOU TO APPLY, AS UNIQUE BACKGROUNDS, PERSPECTIVES, AND LIVED EXPERIENCES ARE WELCOMED.\nWE SEE YOU AT IPG MEDIABRANDS.\nWAGE AND BENEFITS\nWE OFFER A TOTAL REWARDS PACKAGE THAT INCLUDES MEDICAL AND DENTAL COVERAGE, 401(K) PLANS, FLEX SPENDING, LIFE INSURANCE, DISABILITY, EMPLOYEE DISCOUNT PROGRAM, EMPLOYEE STOCK PURCHASE PROGRAM AND PAID FAMILY BENEFITS TO SUPPORT YOU AND YOUR FAMILY. TO GIVE YOU THE ABILITY TO BETTER MEET YOUR PERSONAL NEEDS, AND IN SUPPORT OF YOUR PHYSICAL AND EMOTIONAL WELL-BEING, YOU WILL RECEIVE DISCRETIONARY TIME OFF DAYS AND COMPANY-WIDE APPRECIATION WEEKS AND WELLNESS DAYS.\nWE ALSO OFFER A COMPETITIVE TOTAL COMPENSATION PACKAGE, INCLUDING A COMPETITIVE SALARY AND ELIGIBILITY FOR AN ANNUAL DISCRETIONARY INCENTIVE AWARD OR A RELEVANT INCENTIVE AWARD.\nTHE SALARY RANGE FOR THIS POSITION IS POSTED BELOW. WHERE AN EMPLOYEE OR PROSPECTIVE EMPLOYEE IS PAID WITHIN THIS RANGE WILL DEPEND ON, AMONG OTHER FACTORS, ACTUAL RANGES FOR CURRENT/FORMER EMPLOYEES IN THE SUBJECT POSITION, MARKET CONSIDERATIONS, BUDGETARY CONSIDERATIONS, TENURE AND STANDING WITH THE COMPANY (APPLICABLE TO CURRENT EMPLOYEES), AS WELL AS THE EMPLOYEE’S/APPLICANT’S SKILL SET, LEVEL OF EXPERIENCE, AND QUALIFICATIONS.\nEMPLOYMENT TRANSPARENCY\nIT IS THE POLICY OF MEDIABRANDS, DIVISION OF THE INTERPUBLIC GROUP, TO PROVIDE EQUAL EMPLOYMENT OPPORTUNITIES TO ALL EMPLOYEES AND APPLICANTS FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, ETHNICITY, GENDER, AGE, RELIGION, CREED, NATIONAL ORIGIN, SEXUAL ORIENTATION, GENDER IDENTITY, MARITAL STATUS, CITIZENSHIP, GENETIC INFORMATION, VETERAN STATUS, DISABILITY, OR ANY OTHER BASIS PROHIBITED BY APPLICABLE FEDERAL, STATE, OR LOCAL LAW.\nPLEASE NOTE THIS JOB DESCRIPTION IS NOT DESIGNED TO COVER OR CONTAIN A COMPREHENSIVE LISTING OF ACTIVITIES, DUTIES, OR RESPONSIBILITIES THAT ARE REQUIRED OF THE EMPLOYEE FOR THIS JOB. DUTIES, RESPONSIBILITIES, AND ACTIVITIES MAY CHANGE AT ANY TIME WITH OR WITHOUT NOTICE.\nTHE EMPLOYER WILL MAKE REASONABLE ACCOMMODATIONS IN COMPLIANCE WITH THE AMERICAN WITH DISABILITIES ACT OF 1990. THE JOB DESCRIPTION WILL BE REVIEWED PERIODICALLY AS DUTIES AND RESPONSIBILITIES CHANGE WITH BUSINESS NECESSITY. ESSENTIAL AND OTHER JOB FUNCTIONS ARE SUBJECT TO MODIFICATION. REASONABLE ACCOMMODATIONS MAY BE PROVIDED TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS.\nFOR APPLICANTS TO JOBS IN THE UNITED STATES: IN COMPLIANCE WITH THE CURRENT AMERICANS WITH DISABILITIES ACT AND STATE AND LOCAL LAWS, IF YOU HAVE A DISABILITY AND WOULD LIKE TO REQUEST AN ACCOMMODATION TO APPLY FOR A POSITION WITH MEDIABRANDS, PLEASE EMAIL ACCOMMODATION@MBWW.COM.\nABOUT IPG MEDIABRANDS\nIPG MEDIABRANDS IS THE MEDIA AND MARKETING SOLUTIONS DIVISION OF INTERPUBLIC GROUP (NYSE: IPG). IPG MEDIABRANDS MANAGES OVER $47 BILLION IN MARKETING INVESTMENT GLOBALLY ON BEHALF OF ITS CLIENTS ACROSS ITS FULL-SERVICE AGENCY NETWORKS UM, INITIATIVE AND MEDIAHUB AND THROUGH ITS AWARD-WINNING SPECIALTY BUSINESS UNITS HEALIX, KINESSO, MAGNA, MEDIABRANDS CONTENT STUDIO, ORION HOLDINGS, RAPPORT, AND THE IPG MEDIA LAB. IPG MEDIABRANDS CLIENTS INCLUDE MANY OF THE WORLD’S MOST RECOGNIZABLE AND ICONIC BRANDS FROM A BROAD PORTFOLIO OF INDUSTRY SECTORS INCLUDING AUTOMOTIVE, PERSONAL FINANCE, CONSUMER PRODUCT GOODS (CPG), PHARMA, HEALTH AND WELLNESS, ENTERTAINMENT, FINANCIAL SERVICES, ENERGY, TOYS AND GAMING, DIRECT TO CONSUMER AND E-COMMERCE, RETAIL, HOSPITALITY, FOOD AND BEVERAGE, FASHION AND BEAUTY. THE COMPANY EMPLOYS MORE THAN 18,000 DIVERSE MARKETING COMMUNICATION PROFESSIONALS IN MORE THAN 130 COUNTRIES. LEARN MORE AT WWW.IPGMEDIABRANDS.COM.\nSALARY RANGE$140,000-$155,000 USD",
    "job_skill_set": [
      "financial analysis",
      "profitability analysis",
      "Microsoft Excel",
      "reporting",
      "data analysis",
      "communication",
      "team management",
      "problem solving",
      "time management",
      "adaptability",
      "professionalism",
      "self-confidence",
      "resilience",
      "integrity",
      "proactivity",
      "attention to detail",
      "tolerance for ambiguity",
      "contract development",
      "compensation modeling",
      "media planning",
      "Hyperion"
    ],
    "short_keywords": [
      "adaptability",
      "ambiguity",
      "analysis",
      "attention",
      "client",
      "communication",
      "compensation",
      "contract",
      "data",
      "detail",
      "development",
      "director",
      "excel",
      "finance",
      "financial",
      "for",
      "global",
      "hyperion",
      "integrity",
      "management",
      "media",
      "microsoft",
      "modeling",
      "planning",
      "proactivity",
      "problem",
      "professionalism",
      "profitability",
      "reporting",
      "resilience",
      "selfconfidence",
      "solving",
      "team",
      "time",
      "to",
      "tolerance"
    ]
  },
  {
    "job_id": "3887909422",
    "job_title": "D365 Finance Business Analyst",
    "category": "FINANCE",
    "job_description": "3010758\n\nCOMPANY OVERVIEW:\n\nTHE NEXT GENERATION OF ADT COMMERCIAL IS HERE. AT EVERON, WE TRULY BELIEVE THAT OUR PEOPLE ARE THE DIFFERENCE – FOR OUR ORGANIZATION, THE CUSTOMERS WE SERVE AND THE COMMUNITIES WE PROTECT. WHEN YOU’RE A PART OF EVERON, YOU’LL HAVE THE OPPORTUNITY TO BE A PART OF THAT DIFFERENCE EVERY DAY. WITH MORE THAN 100 LOCATIONS, A DEEP NATIONAL PRESENCE, AND COMPREHENSIVE PORTFOLIO OF SOLUTIONS AND SERVICES, OUR EMPLOYEES ARE ALWAYS POISED FOR CAREER ADVANCEMENT AND GROWTH. FOR MORE INFORMATION, VISIT WWW.EVERONSOLUTIONS.COM OR FOLLOW US ON LINKEDIN.\n\nPOSITION SUMMARY:\n\nMICROSOFT DYNAMICS 365 FINANCE BUSINESS ANALYST WILL WORK CLOSELY WITH BUSINESS STAKEHOLDERS, SYSTEM INTEGRATORS AND OTHER FUNCTIONAL WORKSTREAMS TO UNDERSTAND THE ORGANIZATION’S BUSINESS REQUIREMENTS AND DRIVE IMPLEMENTATION OF THOSE REQUIREMENTS IN THE MICROSOFT DYNAMICS 365 FINANCE AND SUPPLY CHAIN (F&SC) PLATFORM. THIS POSITION WILL ALSO BE RESPONSIBLE FOR ENSURING THAT THE MICROSOFT DYNAMICS 365 SOLUTION IS DESIGNED AND IMPLEMENTED TO MEET THE NEEDS OF EVERON SOLUTIONS.\n\nTHE CANDIDATE WILL HAVE A STRONG FOUNDATION IN FINANCE BUSINESS AREAS SUCH AS GL, AP, AR, CASH AND BANK MANAGEMENT, FIXED ASSETS AND PROJECT MANAGEMENT & ACCOUNTING. THEY WILL ALSO POSSESS AN IN-DEPTH UNDERSTANDING OF BUSINESS PROCESSES AND POSSESS THE ABILITY TO TRANSLATE BUSINESS REQUIREMENTS INTO FUNCTIONAL SPECIFICATIONS, AS WELL AS THE ABILITY TO ASCERTAIN THE DAY-TO-DAY OPERATIONAL NEEDS OF BUSINESS AND IDENTIFY AREAS FOR IMPROVEMENT IN BUSINESS PROCESSES AND PROPOSE SOLUTIONS.\n\nESSENTIAL FUNCTIONS AND RESPONSIBILITIES:\n\nLIAISE WITH BUSINESS USERS TO UNDERSTAND BUSINESS PROCESSES AND IDENTIFY EFFECTIVE WAYS OF IMPROVING PROCESS EFFICIENCY AND BOOSTING ORGANIZATIONAL PRODUCTIVITY. THE RESPONSIBILITIES OF THE MICROSOFT DYNAMICS 365 FINANCE BUSINESS ANALYST INCLUDE:\n\nANALYZE BUSINESS REQUIREMENTS AND TRANSLATE THEM INTO FUNCTIONAL SPECIFICATIONS FOR THE MICROSOFT DYNAMICS 365 F&SC PLATFORM. COLLABORATE WITH BUSINESS STAKEHOLDERS TO ENSURE THAT THE MICROSOFT DYNAMICS 365 SOLUTION MEETS THE UNIQUE NEEDS OF EVERON SOLUTIONS. STRONG UNDERSTANDING OF THE DYNAMICS 365 F&SC DATA STRUCTURE, ENTITIES, RELATIONSHIPS, FIELDS, AND DATA TYPES. STRONG UNDERSTANDING OF INTEGRATION METHODOLOGIES TO PROVIDE FUNCTIONAL SUPPORT FOR INTEGRATION DYNAMICS 365 F&SC TO OTHER SYSTEMSIDENTIFY REPORTS TO MEET BUSINESS NEEDS OF STAKEHOLDERS AND PROVIDE FUNCTIONAL SUPPORT TO BUILD REPORTS AND ANALYTICAL DASHBOARDS USING POWER BI. DEVELOP AND MAINTAIN DOCUMENTATION FOR MICROSOFT DYNAMICS 365 F&SC CONFIGURATIONS, CUSTOMIZATIONS, AND INTEGRATIONS. PERFORM TESTING AND VALIDATION OF MICROSOFT DYNAMICS 365 F&SC SOLUTIONS. PARTICIPATE IN DESIGN AND REVIEW SESSIONS WITH DEVELOPMENT TEAMS TO ENSURE THAT THE MICROSOFT DYNAMICS 365 F&SC SOLUTION IS DESIGNED TO MEET BUSINESS REQUIREMENTS PARTICIPATE IN DEVELOPING PROJECT PLANS, SCOPING, AND COSTING TO ENSURE SUCCESSFUL IMPLEMENTATION.ENSURE ADHERENCE TO PROJECT TIMELINES AND BUDGETS.COMMUNICATE PROGRESS AND STATUS OF THE IMPLEMENTATION TO THE PROJECT TEAM AND BUSINESS STAKEHOLDERS.CONFIGURE FLOWS AND WORKFLOWS TO AUTOMATE BUSINESS PROCESSES. PROVIDE TRAINING AND SUPPORT TO END-USERS OF THE MICROSOFT DYNAMICS 365 F&SC SOLUTION. IDENTIFY AND RECOMMEND OPPORTUNITIES FOR IMPROVING BUSINESS PROCESSES USING THE MICROSOFT DYNAMICS 365 F&SC SOLUTION.\n\nEXPERIENCE, SKILLS, AND QUALITIES:\n\n4+ YEARS OF EXPERIENCE AS A MICROSOFT DYNAMICS 365 F&SC BUSINESS ANALYST/FINANCE CONSULTANT. EXPERIENCE WITH 2-3 FULL LIFE CYCLE MICROSOFT DYNAMICS 365 F&SC IMPLEMENTATIONS.EXPERIENCE WITH MICROSOFT DYNAMICS 365 F&SC MODULES SUCH GL, AP, AR, CASH AND BANK MANAGEMENT, FIXED ASSETS AND PROJECT MANAGEMENT & ACCOUNTINGEXPERIENCE OR KNOWLEDGE OF D365 F&SC SECURITY (SECURITY ROLES, DUTIES, PERMISSIONS, SEGREGATION OF DUTIES) IS A PLUS EXPERIENCE WITH MICROSOFT DYNAMICS 365 REPORTING TOOLS.STRONG ANALYTICAL SKILLS AND THE ABILITY TO TROUBLESHOOT ISSUES AND IDENTIFY SOLUTIONS. EXCELLENT COMMUNICATION SKILLS AND THE ABILITY TO COMMUNICATE EFFECTIVELY WITH A WIDE VARIETY OF TECHNICAL AND NON-TECHNICAL AUDIENCES EFFECTIVE TIME MANAGEMENT AND PROBLEM-SOLVING SKILLS DESIRE TO STAY CURRENT WITH NEW TECHNOLOGIES AND SOLUTIONS ABILITY TO WORK INDEPENDENTLY AND ACROSS MULTIDISCIPLINARY TEAMS DETAIL-ORIENTED AND ABLE TO USE GOOD JUDGMENT WHEN MAKING DECISIONS DEMONSTRATED COMMITMENT TO THE IMPORTANCE OF COLLABORATION, TEAMWORK, AND A POSITIVE AND STRONG ORGANIZATIONAL CULTURE.ADVANCED IN MICROSOFT OFFICE 365 SUITE OF PRODUCTS (E.G., WORD, EXCEL, AND POWERPOINT). EXPERIENCE WITH OR KNOWLEDGE OF ANY D365 CE TOOLS SUCH AS SALES, CUSTOMER INSIGHTS – JOURNEY, CUSTOMER SERVICE, FIELD SERVICE AND PROJECT OPERATIONS AND POWER PLATFORM TOOLS SUCH AS POWER APPS, POWER AUTOMATE OR POWER BI IS A PLUS.MICROSOFT DYNAMICS 365 CERTIFICATIONS ARE A PLUS.CPA CERTIFICATION IS A PLUS\n\nPAY AND BENEFITS DISCLOSURE\n\nTHE SALARY RANGE FOR THIS ROLE IS $120,000 - $140,000 AND IS BASED ON EXPERIENCE AND QUALIFICATIONS. CERTAIN ROLES ARE ELIGIBLE FOR ANNUAL BONUS. THESE AWARDS ARE ALLOCATED BASED ON COMPANY AND INDIVIDUAL PERFORMANCE. WE OFFER EMPLOYEES ACCESS TO HEALTHCARE BENEFITS, A 401(K) PLAN AND COMPANY MATCH, SHORT TERM AND LONG TERM DISABILITY COVERAGE, LIFE INSURANCE, WELLBEING BENEFITS AND PAID TIME OFF AMONG OTHERS. EMPLOYEES ACCRUE UP TO 120 HOURS IN THEIR FIRST YEAR. YOUR ACCRUAL RATE INCREASES AFTER YOUR FIRST YEAR. WE ALSO OFFER 6 PAID HOLIDAYS.\n\nADT COMMERCIAL IS AN EQUAL OPPORTUNITY/AFFIRMATIVE ACTION EMPLOYER. WE PROVIDE EQUAL EMPLOYMENT OPPORTUNITIES TO APPLICANTS AND EXISTING EMPLOYEES AND EVALUATE QUALIFIED CANDIDATES WITHOUT REGARD TO RACE, GENDER, NATIONAL ORIGIN, ANCESTRY, AGE, COLOR, RELIGION, MARITAL STATUS, GENETIC INFORMATION, SEXUAL ORIENTATION, GENDER IDENTITY, GENDER EXPRESSION, SEX (INCLUDING PREGNANCY, BREASTFEEDING, AND RELATED MEDICAL CONDITIONS), MENTAL OR PHYSICAL DISABILITY, MEDICAL CONDITION, MILITARY AND VETERAN STATUS, OR ANY OTHER STATUS OR CONDITION PROTECTED BY LAW. VIEW THE EEO POSTER HERE. VIEW THE PAY TRANSPARENCY NONDISCRIMINATION PROVISION HERE. VIEW THE E-VERIFY POSTING HERE.\n\nADT COMMERCIAL IS COMMITTED TO PROVIDING REASONABLE ACCOMMODATIONS TO INDIVIDUALS WITH DISABILITIES. IF YOU NEED A REASONABLE ACCOMMODATION BECAUSE OF A DISABILITY TO SEARCH AND APPLY FOR A CAREER OPPORTUNITY, PLEASE SEND AN E-MAIL TO COMMERCIALRECRUITING@ADT.COM AND LET US KNOW YOUR CONTACT INFORMATION AND THE NATURE OF YOUR REQUEST.\n\nADT COMMERCIAL IS AN EQUAL OPPORTUNITY/AFFIRMATIVE ACTION EMPLOYER. WE PROVIDE EQUAL EMPLOYMENT OPPORTUNITIES TO APPLICANTS AND EXISTING EMPLOYEES AND EVALUATE QUALIFIED CANDIDATES WITHOUT REGARD TO RACE, GENDER, NATIONAL ORIGIN, ANCESTRY, AGE, COLOR, RELIGION, MARITAL STATUS, GENETIC INFORMATION, SEXUAL ORIENTATION, GENDER IDENTITY, GENDER EXPRESSION, SEX (INCLUDING PREGNANCY, BREASTFEEDING, AND RELATED MEDICAL CONDITIONS), MENTAL OR PHYSICAL DISABILITY, MEDICAL CONDITION, MILITARY AND VETERAN STATUS, OR ANY OTHER STATUS OR CONDITION PROTECTED BY LAW. VIEW THE EEO POSTER HERE. VIEW THE PAY TRANSPARENCY NONDISCRIMINATION PROVISION HERE. VIEW THE E-VERIFY POSTING HERE.\n\nADT COMMERCIAL IS COMMITTED TO PROVIDING REASONABLE ACCOMMODATIONS TO INDIVIDUALS WITH DISABILITIES. IF YOU NEED A REASONABLE ACCOMMODATION BECAUSE OF A DISABILITY TO SEARCH AND APPLY FOR A CAREER OPPORTUNITY, PLEASE SEND AN E-MAIL TO COMMERCIALRECRUITING@ADT.COM AND LET US KNOW YOUR CONTACT INFORMATION AND THE NATURE OF YOUR REQUEST.",
    "job_skill_set": [
      "Finance Business Analysis",
      "Documentation",
      "Project Management",
      "Communication",
      "Analytical Skills",
      "Problem Solving",
      "Collaboration",
      "Microsoft Dynamics 365 F&SC",
      "Power BI",
      "Integration Methodologies",
      "Reporting Tools",
      "Microsoft Office 365 Suite",
      "D365 F&SC Modules (GL, AP, AR, Cash Management, Fixed Assets, Project Management & Accounting)",
      "Testing and Validation",
      "Configuration of Flows and Workflows",
      "Time Management",
      "Detail-Oriented",
      "Independence",
      "Adaptability to New Technologies"
    ],
    "short_keywords": [
      "365",
      "accounting",
      "adaptability",
      "analysis",
      "analyst",
      "analytical",
      "and",
      "ap",
      "ar",
      "assets",
      "bi",
      "business",
      "cash",
      "collaboration",
      "communication",
      "configuration",
      "d365",
      "detailoriented",
      "documentation",
      "dynamics",
      "finance",
      "fixed",
      "flows",
      "fsc",
      "gl",
      "independence",
      "integration",
      "management",
      "methodologies",
      "microsoft",
      "modules",
      "new",
      "of",
      "office",
      "power",
      "problem",
      "project",
      "reporting",
      "skills",
      "solving",
      "suite",
      "technologies",
      "testing",
      "time",
      "to",
      "tools",
      "validation",
      "workflows"
    ]
  },
  {
    "job_id": "3889744181",
    "job_title": "Finance Analyst (Job #247) ($77,056 - $85,028)",
    "category": "FINANCE",
    "job_description": "\n\nGENERAL PURPOSE: \nTHE FINANCIAL ANALYST WILL PLAY A CRUCIAL ROLE IN SUPPORTING THE FINANCIAL OPERATIONS OF RCAC BY PROVIDING ANALYTICAL INSIGHTS, PREPARING FINANCIAL REPORTS, ASSISTING IN BUDGETING AND FINANCIAL PLANNING, ANALYZING INTERNAL CONTROLS AND RISK MANAGEMENT, PROVIDING RECOMMENDATION IN STREAMLINING SYSTEMS AND PROCESSES. REPORTING DIRECTLY TO THE CFO, THE FINANCIAL ANALYST WILL CONTRIBUTE TO STRATEGIC DECISION-MAKING PROCESSES AND ENSURE THE ORGANIZATION'S FINANCIAL HEALTH AND COMPLIANCE WITH REGULATORY REQUIREMENTS.\nFINANCIAL ANALYST POSITION WILL SUPPORT THE CFO AND CONTROLLER IN PREPARING FINANCIAL REPORTS TO BOARD OF DIRECTORS, EXTERNAL PARTNERS AND SENIOR LEADERSHIP; SERVE AS A LIAISON BETWEEN FINANCE AND OTHER RCAC DEPARTMENTS, SPECIFICALLY GRANTS AND CONTRACTS ADMINISTRATION (GCA), IN GATHERING AND RECONCILING FINANCIAL INFORMATION; MONITOR AND TRACK CORPORATE AND DEPARTMENTAL BUDGETS; REVIEW FINANCIAL STATEMENTS AND REPORTS FOR RCAC; MANAGE FINANCE TEAM PROJECTS, FILL IN AS BACK-UP FOR THE OTHER POSITIONS IN THE FINANCE DEPARTMENT.\nSPECIFIC JOB GOALS, OBJECTIVES AND TASKS ARE ESTABLISHED FOR EACH EMPLOYEE AS PART OF THE ANNUAL EVALUATION AND WORK PLAN PROCESS. THE STATEMENTS ARE INTENDED TO DESCRIBE THE GENERAL NATURE AND LEVEL OF WORK BEING PERFORMED BY PEOPLE ASSIGNED TO THIS JOB. THEY ARE NOT INTENDED TO BE AN EXHAUSTIVE LIST OF ALL QUALIFICATIONS, RESPONSIBILITIES, DUTIES, AND SKILLS REQUIRED.\n\nJOB DUTIES AND RESPONSIBILITIES:PERFORM FINANCIAL ANALYSIS OF INTERNAL AND AUDITED FINANCIAL STATEMENTS, OPERATIONS, GENERAL LEDGER ACCOUNTS, FUNDING SOURCE BALANCES, PERFORMANCE METRICS AND FINANCIAL RATIOS TO IDENTIFY TRENDS, VARIANCES, OPPORTUNITIES FOR IMPROVEMENT AND TO PROVIDE ACTIONABLE INSIGHTS.PERFORM FINANCIAL ANALYSIS OF OPERATIONS; PREPARE AD HOC MANAGEMENT REPORTS; CONDUCT ONGOING ANALYSIS OF GENERAL LEDGER ACCOUNTS AND FUNDING SOURCE BALANCES; COORDINATE MEETINGS WITH FINANCE TEAM LEADERS TO DISCUSS FINDINGS.PERFORM GCA CONTACT LEAD RESPONSIBILITIES FOR UNRESTRICTED COST CENTER, INDIRECT COST CENTER AND OTHER GRANTS AND CONTRACTS.SUPPORT GCA AND CORPORATE DEVELOPMENT TEAM WITH FINANCIAL AND BUDGET ANALYSIS FOR FUNDER AND INVESTOR PROPOSALS.DEVELOP CUSTOMIZED FINANCIAL REPORTS FOR INTERNAL AND EXTERNAL PARTNERS, ENSURING COMPLIANCE WITH REGULATORY STANDARDS AND ORGANIZATIONAL POLICIES FOR ACCURATE AND TIMELY FINANCIAL REPORTS.ASSIST IN THE DEVELOPMENT OF ANNUAL OPERATING BUDGETS AND SHORT AND LONG-TERM FINANCIAL FORECASTS. COLLABORATE WITH DEPARTMENT HEADS TO REVIEW BUDGET VARIANCES, MONITOR BUDGET VS. ACTUAL PERFORMANCE AND IDENTIFY AREAS FOR COST OPTIMIZATION.DEVELOP AND MAINTAIN FINANCIAL MODELS TO SUPPORT STRATEGIC PLANNING INITIATIVES, SCENARIO ANALYSIS, AND DECISION-MAKING PROCESSES. EVALUATE FINANCIAL IMPACTS OF PROPOSED PROJECTS, PROGRAMS, AND INITIATIVES.MONITOR GRANT EXPENDITURES, ENSURE COMPLIANCE WITH GRANT REQUIREMENTS, AND PREPARE FINANCIAL REPORTS FOR GRANTORS AS NEEDED.ASSIST WITH REVIEWING MONTHLY BANK ACCOUNT BALANCES, CASH FLOW STATEMENTS, LENDING CAPITAL, LOAN FUND TRANSACTIONS, IDENTIFY AND RESEARCH DISCREPANCIES. ASSIST CFO AND CONTROLLER ON INVESTMENT AND CASH MANAGEMENT COMPLIANCE, FINANCIAL ANALYSIS, TREASURY OPERATIONS, BANKING RELATIONSHIPS, INVESTMENT MANAGEMENT, RISK MANAGEMENT, AND DEBT MANAGEMENT.COMPARE BUDGETED AND ACTUAL INDIRECT SALARY DOLLARS, IDENTIFY DISCREPANCIES AND WORK WITH PROGRAM MANAGERS AND PAYROLL MANAGER-TO MODIFY INDIRECT HOURS DISTRIBUTION BUDGET.IDENTIFY FINANCIAL RISKS AND RECOMMEND APPROPRIATE MITIGATION STRATEGIES. MONITOR KEY FINANCIAL INDICATORS AND ASSIST IN DEVELOPING RISK MANAGEMENT POLICIES AND PROCEDURES.IDENTIFY OPPORTUNITIES TO STREAMLINE FINANCIAL PROCESSES, ENHANCE EFFICIENCY, AND STRENGTHEN INTERNAL CONTROLS IMPLEMENTING BEST PRACTICES TO OPTIMIZE FINANCIAL REPORTING AND ANALYSIS FUNCTIONS.WORK CLOSELY WITH CROSS-FUNCTIONAL TEAMS TO SUPPORT ORGANIZATIONAL GOALS AND INITIATIVES PROVIDING FINANCIAL EXPERTISE AND GUIDANCE TO DEPARTMENTAL LEADERS AS NEEDED.\nATTEND INTERNAL AND EXTERNAL MEETINGS IN LIEU OF THE CFO AS NEEDED, INTERACTING WITH AND RESPONDING TO URGENT REQUESTS FROM CFO, C-SUITE AND SENIOR LEADERSHIP TEAMS AND THE BOARD OF DIRECTORS.\n\nSUPERVISION EXERCISED:MAY SUPERVISE UP TO THREE POSITIONS.\n\nMINIMUM QUALIFICATIONS AND NECESSARY REQUIREMENTS:\n\nEDUCATION: BACHELOR'S DEGREE IN BUSINESS ADMINISTRATION, FINANCE, ACCOUNTING OR MANAGEMENT. \n\nEXPERIENCE: MINIMUM OF 3-5 YEARS OF EXPERIENCE IN FINANCIAL ANALYSIS OR ACCOUNTING.LICENSE/CERTIFICATION: VALID DRIVER'S LICENSE AND PROOF OF INSURANCE THAT MEETS THE MINIMUM REQUIREMENTS ($100,000/$300,000) OF RCAC CORPORATE LIABILITY POLICY.\nMUST PASS A CRIMINAL BACKGROUND INVESTIGATION PRIOR TO EMPLOYMENT.\n\nKNOWLEDGE, SKILLS, AND ABILITIES:COMMUNICATE EFFECTIVELY WITH ALL LEVELS OF MANAGEMENT, STAFF, FUNDERS, INVESTORS, OTHER EXTERNAL PARTNERS AND MEMBERS OF THE BOARD OF DIRECTORS.STRONG ANALYTICAL SKILLS WITH THE ABILITY TO INTERPRET COMPLEX FINANCIAL DATA. EXPERIENCE IN FINANCIAL STATEMENT ANALYSIS, FINANCIAL MODELING, BUDGETING, AND FORECASTING TECHNIQUES.KNOWLEDGE OF MICROSOFT OFFICE SUITE, SPECIFICALLY WORD, EXCEL (ADVANCED), POWER POINT AND TEAMS. ADVANCED SKILLS IN FISCAL MANAGEMENT SOFTWARE.\nABILITY TO WORK WITHOUT CLOSE SUPERVISION IN A DEMANDING ENVIRONMENT.\nABILITY TO GATHER DATA, COMPILE INFORMATION, AND PREPARE REPORTS. ABILITY TO ESTABLISH AND MAINTAIN PROFESSIONAL RELATIONSHIPS WITH INDIVIDUALS OF VARYING SOCIAL AND CULTURAL BACKGROUNDS AND WITH CO-WORKERS AND COLLEAGUES AT ALL LEVELS.EXCELLENT WRITTEN, COMMUNICATION AND INTERPERSONAL SKILLS, WITH THE ABILITY TO EFFECTIVELY COMMUNICATE FINANCIAL INFORMATION TO DIVERSE AUDIENCES.DETAIL-ORIENTED WITH A COMMITMENT TO ACCURACY AND INTEGRITY.ABILITY TO MAINTAIN CONFIDENTIALITY, MEET STRICT TIMELINES, AND FREQUENT TIME SENSITIVE PRIORITY REQUESTS.FACILITATION, MEDIATION, AND MEETING MANAGEMENT SKILLS\n\nPREFERRED REQUIREMENTS:NONPROFIT FINANCIAL ANALYSIS OR ACCOUNTING. FAMILIARITY WITH ACCOUNTING AND FINANCIAL SOFTWARE. KNOWLEDGE OF NONPROFIT ACCOUNTING PRINCIPLES AND REGULATIONS SUCH AS GAAP AND IRS REGULATIONS.PROFESSIONAL CERTIFICATIONS SUCH AS CFA, CPA, CPM, OR INTERNAL AUDIT.\n\nPHYSICAL DEMANDS:\nWHILE PERFORMING THE DUTIES OF THIS JOB, THE EMPLOYEE IS REGULARLY REQUIRED TO SIT AND STAND; USE HANDS TO FINGER, HANDLE, OR FEEL; REACH WITH HANDS AND ARMS; AND TALK OR HEAR. THE EMPLOYEE FREQUENTLY IS REQUIRED TO WALK. THE EMPLOYEE OCCASIONALLY IS REQUIRED TO STOOP, KNEEL, CROUCH, OR CRAWL. THE EMPLOYEE MUST OCCASIONALLY LIFT AND/OR MOVE UP TO 25 POUNDS. SPECIFIC VISION REQUIREMENTS INCLUDE CLOSE VISION, DISTANCE VISION, COLOR VISION, AND DEPTH PERCEPTION.\n\nWORKING CONDITIONS:\nWORK IS TYPICALLY PERFORMED IN AN OFFICE WITH A MODERATE NOISE LEVEL. EVENING AND/OR WEEKEND WORK MAY BE REQUIRED. \n \nRCAC IS AN EQUAL OPPORTUNITY EMPLOYER AND CONSIDERS ALL EMPLOYEES AND JOB APPLICANTS WITHOUT REGARD TO RACE, RELIGION, COLOR, GENDER, SEX, AGE, NATIONAL ORIGIN, DISABILITY, VETERAN STATUS, SEXUAL ORIENTATION, GENDER IDENTITY OR MARITAL STATUS, OR ANY OTHER STATUS PROTECTED BY LAW. RCAC STRIVES TO REFLECT THE DIVERSE CONSTITUENCIES THAT THE ORGANIZATION SERVES.\n \nPI239310910",
    "job_skill_set": [
      "budgeting",
      "financial reporting",
      "Microsoft Excel (advanced)",
      "fiscal management software",
      "communication",
      "interpersonal skills",
      "problem solving",
      "attention to detail",
      "teamwork",
      "time management",
      "adaptability",
      "strategic thinking",
      "financial analysis",
      "financial modeling",
      "GAAP knowledge",
      "risk management",
      "data analysis",
      "financial statement analysis",
      "confidentiality",
      "facilitation skills"
    ],
    "short_keywords": [
      "247",
      "77056",
      "85028",
      "adaptability",
      "advanced",
      "analysis",
      "analyst",
      "attention",
      "budgeting",
      "communication",
      "confidentiality",
      "data",
      "detail",
      "excel",
      "facilitation",
      "finance",
      "financial",
      "fiscal",
      "gaap",
      "interpersonal",
      "job",
      "knowledge",
      "management",
      "microsoft",
      "modeling",
      "problem",
      "reporting",
      "risk",
      "skills",
      "software",
      "solving",
      "statement",
      "strategic",
      "teamwork",
      "thinking",
      "time",
      "to"
    ]
  },
  {
    "job_id": "3901965347",
    "job_title": "Oracle Finance Solution Expert (CoE Expert)",
    "category": "FINANCE",
    "job_description": "ROLE: ORACLE FINANCE SOLUTION EXPERT (COE EXPERT)LOCATIONS: CHICAGO, IL / JERSEY CITY, NJ / NEW YORK, NY / ATLANTA, GAFULLTIME WITH BENEFITS & ANNUAL BONUS\nCLIENT IS LOOKING FOR SOMEONE WHO HAS DONE PRESALES ACTIVITY, SOLUTION ARCHITECT, STRONG IN ORACLE FINANCE SIDE.JOB DESCRIPTION:CLIENT IS SEEKING STRONG ORACLE FINANCE SOLUTION EXPERT (COE EXPERT) TO LEAD BUSINESS ENTERPRISE TRANSFORMATION. THE COE IS THE DEAL SHAPING, PRE-SALES AND GO-TO-MARKET LEADING TEAM IN CHARGE OF CRAFTING AND SELLING OUR BUSINESS TRANSFORMATION OFFERS ACROSS ALL REGIONS (AMERICAS, EUROPE, APAC). OF THE JOB]RESPONSIBILITIES:YOU ARE A KEY PLAYER IN LARGE ORACLE TRANSFORMATION PROGRAMS FOR GLOBAL CUSTOMERS (TEAM SIZE OF 50+ PEOPLE)UNDERSTAND YOUR CLIENT’S BUSINESS AND ARE ABLE TO ADVISE THEM ON HOW TO GET THE MOST OUT OF THEIR ORACLE TRANSFORMATION.LEAD CLIENT PRESENTATIONS, LEAD POC DEVELOPMENTS, AND LEAD RFP RESPONSES.ENDOWED WITH A NATURAL LEADERSHIP, YOUR QUALITIES OF CUSTOMER RELATIONSHIP AND BUSINESS DEVELOPMENT.REQUIRED SKILLS:MORE THAN 15 YEARS OF VALIDATED EXPERIENCE IN ORACLE EITHER IN VALUE STREAM LEADERSHIP, BUSINESS, OR DOMAIN EXPERTEXPERIENCE IN PRESENTING TO SENIOR CLIENT PARTNERS AND GOES UP TO INCLUDING CXO-LEVEL.MASTER AND EXCEL IN ORACLE FINANCE AREA INCLUDING PROVEN EXPERIENCE IN ORACLE CLOUD (FUSION) FINANCE.EXPERTISE IN THE FOLLOWING SUB MODULES/SOLUTION AREAS – MODULES- GL (GENERAL LEDGER), AP (ACCOUNTS PAYABLE, AR (ACCOUNTS RECEIVABLES), FA (FIXED ASSETS) AND AHC (ACCOUNTING HUB CLOUD) IS REQUIRED.KNOWLEDGE OF ENTERPRISE PERFORMANCE MANAGEMENT SOLUTIONS LIKE CONSOLIDATION, RECONCILIATION, ENTERPRISE PLANNING AND BUDGETING ETC, WOULD BE AN ADDED ADVANTAGE.SHOULD HAVE A DEPTH OF CONSULTING AND FUNCTIONAL EXPERIENCE ACROSS ORACLE AND PARTNER COMPONENTS IN YOUR AREA OF EXPERTISE, AND A GOOD UNDERSTANDING OF THE STRATEGIC DIRECTION OF ORACLE IN YOUR EXPERTISE DOMAIN.EXPERIENCE WORKING WITH CLIENT COLLABORATORS IN CONDUCTING REQUIREMENTS GATHERING, DEMO & DESIGN WORKSHOPS, AND/OR HAVE LEAD BUSINESS DISCUSSIONS WITH FINANCE CUSTOMERS TO UNDERSTAND THE ERP FINANCE PROCESSES, CURRENT CHALLENGES ETC.\n",
    "job_skill_set": [
      "Oracle Finance",
      "General Ledger (GL)",
      "Accounts Payable (AP)",
      "Accounts Receivable (AR)",
      "Fixed Assets (FA)",
      "Leadership",
      "Customer Relationship Management",
      "Presentation Skills",
      "Communication",
      "Collaboration",
      "Problem Solving",
      "Solution Architecture",
      "Pre-sales Activity",
      "Oracle Cloud (Fusion) Finance",
      "Accounting Hub Cloud (AHC)",
      "Enterprise Performance Management Solutions",
      "Requirements Gathering",
      "Business Development"
    ],
    "short_keywords": [
      "accounting",
      "accounts",
      "activity",
      "ahc",
      "ap",
      "ar",
      "architecture",
      "assets",
      "business",
      "cloud",
      "coe",
      "collaboration",
      "communication",
      "customer",
      "development",
      "enterprise",
      "expert",
      "fa",
      "finance",
      "fixed",
      "fusion",
      "gathering",
      "general",
      "gl",
      "hub",
      "leadership",
      "ledger",
      "management",
      "oracle",
      "payable",
      "performance",
      "presales",
      "presentation",
      "problem",
      "receivable",
      "relationship",
      "requirements",
      "skills",
      "solution",
      "solutions",
      "solving"
    ]
  },
  {
    "job_id": "3900956645",
    "job_title": "Portfolio Analyst-Finance (Indiana: Hybrid/Remote)",
    "category": "FINANCE",
    "job_description": "THE PORTFOLIO ANALYST COLLABORATES WITH THE FINANCE, CONTRACTS MANAGEMENT, SERVICE OPERATIONS, AND FIELD OPERATIONS TEAMS TO SUPPORT EXISTING CLIENTS' SERVICE PROGRAMS. THIS POSITION IS RESPONSIBLE FOR REVIEW AND ADJUSTMENT OF CONTRACT STRUCTURES, RESEARCH, ANALYSIS, AND PRICING OF NEW SERVICES, CREATING CLIENT BUDGETS, AND GENERATING FINANCIAL SALES SUPPORT MATERIALS FOR GROWTH OPPORTUNITIES IN THE ASSIGNED OPERATIONAL TERRITORY. THE PORTFOLIO ANALYST WILL SUPPORT THE MANAGEMENT OF CUSTOMER CONTRACTS. THIS ROLE REQUIRES FREQUENT INTERACTION WITH OPERATIONAL MANAGEMENT TO DEFINE, ANALYZE AND BUILD THE SERVICE PROGRAM. IN ADDITION THE PORTFOLIO ANALYST MAY BE REQUIRED TO PRESENT RECOMMENDATIONS TO THE CLIENT.\nLOCATION: INDIANAPOLIS, INDIANA; WE ARE SEEKING CANDIDATES CURRENTLY LIVING IN THE CENTRAL INDIANA REGION; WITHIN APPROXIMATELY A 70 MILE RANGE OF INDIANAPOLIS. OUR CENTRAL (CORPORATE) OFFICE IS LOCATED ON THE NORTHWEST SIDE OF INDIANAPOLIS. POSITION IS A HYBRID (A MIX OF REMOTE & IN-OFFICE, AS WELL AS ANY NECESSARY BUSINESS TRAVEL).\nRESPONSIBILITIESACCOUNT MANAGEMENT ANALYSIS \nPROVIDE TIMELY AND ACCURATE QUARTERLY PRICE ADJUSTMENTSLEAD ACCOUNT REVIEW AND PRICING EFFORTSDEVELOP ACCURATE CUSTOMER BUDGET FORECASTSWORK WITH CONTRACT MANAGEMENT AND F&A FOR CONTRACT RENEWAL AND CONTRACT LINKING SUPPORTCONDUCT PROGRAM ANALYSIS TO PROVIDE ACCURATE SALES QUOTESASSIST IN DATA ANALYSIS AND INVENTORY RECONCILIATIONSUPPORT THE MANAGEMENT OF CUSTOMER CONTRACTS AND REQUIRED REPORTING AND ANALYSISENSURE ACCOUNT ACTIVITIES ALIGN WITH CUSTOMER CONTRACTINDEPENDENTLY LEAD CUSTOMER ENGAGEMENT MEETINGSPROBLEM SOLVE TO ASSIST AND DEVELOP RESPONSES TO CUSTOMER REQUESTS AND QUESTIONS\nPROJECT MANAGEMENT (SPECIAL PROJECTS) \nUNDER DIRECTION FROM SENIOR LEADERS, ASSIST IN LEAD SPECIAL PROJECTS DESIGNED TO IMPROVE DEPARTMENTAL AND INTER-DEPARTMENTAL PROCESS EFFICIENCY AND EFFECTIVENESSPROVIDE ANALYSIS ON EXISTING SERVICE PROGRAMS\nPROJECT ADMINISTRATION \nCOORDINATE PROJECT PLANS AND TIMELINESPROVIDE ANALYSIS ON EXISTING SERVICE PROGRAMSRESPONSIBLE FOR THE COMPLETION OF REQUIRED PROJECT DELIVERABLESPARTICIPATE IN TRANSITIONING NEW BUSINESS WINS TO CLINICAL ENGINEERING SERVICESALL OTHER DUTIES AS ASSIGNED.\nSKILLS AND EXPERIENCE\nMINIMUM 2 YEARS OF EXPERIENCE IN A PROFESSIONAL CLIENT SERVICES ROLEEXPERIENCE IN PERFORMING FINANCIAL OR DATA ANALYSIS AND ASSESSMENTSSTRONG MICROSOFT EXCEL SKILLS REQUIRED; ACCESS SKILLS DESIREDWORKDAY EXPERIENCE A PLUSABILITY TO WORK BOTH SOLO AND IN A COLLABORATIVE TEAM FORMATABILITY TO CREATE AND MANAGE A PROJECT PLAN AND A PROJECT TEAMHIGH ATTENTION TO DETAIL WITH STRONG DRIVE FOR ACCURACYABILITY TO PRIORITIZE WORK AND BALANCE MULTIPLE PROJECTSABILITY TO BUILD, ESTABLISH, AND MANAGE COLLABORATIVE RELATIONSHIPSEXCELLENT PROBLEM SOLVING AND ANALYTICAL THINKING SKILLSSTRONG WRITTEN, VERBAL, AND PRESENTATIONAL COMMUNICATION SKILLS\nEDUCATION AND QUALIFICATIONS\nASSOCIATES DEGREE OR EQUIVALENT REQUIRED. BACHELORS DEGREE PREFERRED. PREFERENCE TO FINANCE, MATH, BUSINESS, ECONOMICS, OR DEMONSTRABLE ANALYTICAL FIELD.",
    "job_skill_set": [
      "financial analysis",
      "data analysis",
      "Microsoft Excel",
      "analytical thinking",
      "collaboration",
      "communication",
      "problem solving",
      "attention to detail",
      "time management",
      "relationship building",
      "independence",
      "project management",
      "budget forecasting",
      "contract management",
      "Workday"
    ],
    "short_keywords": [
      "analysis",
      "analystfinance",
      "analytical",
      "attention",
      "budget",
      "building",
      "collaboration",
      "communication",
      "contract",
      "data",
      "detail",
      "excel",
      "finance",
      "financial",
      "forecasting",
      "hybridremote",
      "independence",
      "indiana",
      "management",
      "microsoft",
      "portfolio",
      "problem",
      "project",
      "relationship",
      "solving",
      "thinking",
      "time",
      "to",
      "workday"
    ]
  },
  {
    "job_id": "3901991230",
    "job_title": "Finance Manager",
    "category": "FINANCE",
    "job_description": "JOB TAG:  POSTED: APRIL 18,2024 \n\nSKYWATER IS THRILLED TO BE PARTNERING WITH A PE-BACKED MANUFACTURING COMPANY TO ADD A FINANCE MANAGER TO THEIR TEAM! I KNOW THE PE COMPANY WELL AS I’VE BEEN NETWORKING WITH THEM FOR YEARS (KUDOS TO THE TA DIRECTOR FOR HELPING ME GET INTO RECRUITING!) AND HAVE JUST HEARD ABSOLUTELY AMAZING THINGS ABOUT BOTH THE PE COMPANY AND ALL OF ITS PORTFOLIO COMPANIES. SO I’M REALLY PUMPED TO FINALLY HAVE A CHANCE TO PARTNER WITH ONE OF THEIR PORTFOLIO COMPANIES!!!\n\nTHIS IS AN INCREDIBLE OPPORTUNITY TO JOIN A RAPIDLY GROWING ORGANIZATION AND IMMEDIATELY MAKE YOUR MARK! REPORTING DIRECTLY TO THE CFO, YOU’LL BE HIS RIGHT-HAND PERSON FOR ALL THINGS FINANCE AND PRODUCT COSTING RELATED. HE’S REALLY LOOKING FOR SOMEONE TO COME IN, CREATE AND IMPROVE PROCESSES, AND THEN DELEGATE DOWN. YOU’LL BE OVERSEEING TWO COST ANALYSTS SO IT’S A GREAT OPPORTUNITY TO CULTIVATE YOUR PEOPLE MANAGEMENT SKILLS. HUGE FOCUS ON WORK/ LIFE BALANCE AND FLEXIBILITY, WITH A CEO WHO THE CFO DESCRIBES AS “INSPIRING AND IMPACTFUL.”\n\nI WOULD TAKE A STRAIGHT COST ACCOUNTANT LOOKING TO PIVOT INTO MORE OF A FINANCE ROLE OR A MANUFACTURING FINANCE PROFESSIONAL WITH STRONG COST ACCOUNTING KNOWLEDGE.\n\nIF YOU’RE INTERESTED IN HEARING MORE, PLEASE REACH OUT! CRABON@SKYWATERSEARCH.COM | 952.767.9025\n\nRESPONSIBILITIES\n\n REVIEW NEW JOBS AHEAD OF RELEASING TO SHOP FLOOR AND CAPTURE COST AND MARGIN DETAIL  REVIEW COMPLETED JOBS AND CAPTURE ACTUAL COST  DRIVE MONTH-END INVENTORY REPORTING AND ASSOCIATED ENTRIES FOR RAW MATERIALS, COMPONENTS, WORK-IN-PROCESS AND FINISHED GOODS  COMPILE MONTHLY AND QUARTERLY RESERVE CALCULATIONS FOR OBSOLETE INVENTORY  CALCULATE PRODUCT YIELD AND PARTNER WITH PRODUCTION AND ENGINEERING TO ESTABLISHED FORECASTED YIELDS FOR VOLUME PROGRAMS \n\nDESIRED SKILLS AND EXPERIENCE\n\n BACHELOR’S DEGREE IN ACCOUNTING OR FINANCE  4+ YEARS OF PROFESSIONAL EXPERIENCE IN A FAST-PACED ENVIRONMENT  STRONG FOUNDATION OF COST ACCOUNTING  EXTENSIVE EXPERIENCE PARTNERING WITH OPERATIONS AND ANALYZING PRODUCT COSTING  PASSION TO LEARN AND GROW  PREVIOUS EXPERIENCE MANAGING PREFERRED",
    "job_skill_set": [
      "cost accounting",
      "financial analysis",
      "budgeting",
      "forecasting",
      "data analysis",
      "financial reporting",
      "process improvement",
      "people management",
      "bachelor's degree in accounting or finance",
      "communication",
      "teamwork",
      "problem solving",
      "adaptability",
      "leadership",
      "passion to learn and grow",
      "inventory reporting"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "analysis",
      "and",
      "bachelors",
      "budgeting",
      "communication",
      "cost",
      "data",
      "degree",
      "finance",
      "financial",
      "forecasting",
      "grow",
      "improvement",
      "in",
      "inventory",
      "leadership",
      "learn",
      "management",
      "manager",
      "or",
      "passion",
      "people",
      "problem",
      "process",
      "reporting",
      "solving",
      "teamwork",
      "to"
    ]
  },
  {
    "job_id": "3898170689",
    "job_title": "Sr Manager, Distribution Finance",
    "category": "FINANCE",
    "job_description": "APEX TOOL GROUP IS AN EQUAL OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, NATIONAL ORIGIN, RELIGION, AGE, COLOR, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, DISABILITY, OR PROTECTED VETERAN STATUS.\n\n SR MANAGER, DISTRIBUTION FINANCE - US - APEX, NC \n\nTHE BLUEPRINT (ROLE SUMMARY)\n\nTHE SR MANAGER, DISTRIBUTION FINANCE WILL WORK CLOSELY WITH THE NORTH AMERICAN OPERATIONS FINANCE TEAMS TO LEAD FINANCIAL OPERATIONS ACTIVITIES SUCH AS PLANNING, CONTROLLING AND INVESTMENTS.\n\nCOME BUILD YOUR FUTURE WITH US!\n\nTHE BUILD (ROLE RESPONSIBILITIES)\n\n COORDINATE AND DIRECT THE FINANCIAL PLANNING, CONTROLLING, BUDGETING, PROCUREMENT, AND CAPITAL INVESTMENT ACTIVITIES. PREPARE OR DIRECT PREPARATION OF FINANCIAL STATEMENTS, BUSINESS ACTIVITY REPORTS, FINANCIAL POSITION FORECASTS, ANNUAL BUDGETS, AND OTHER REPORTS PERTAINING TO ASSIGNED LOCATIONS. ANALYZE THE FINANCIAL DETAILS OF PAST, PRESENT, AND EXPECTED OPERATIONS TO IDENTIFY DEVELOPMENT OPPORTUNITIES AND AREAS WHERE IMPROVEMENT IS NEEDED. LEAD, COACH AND DEVELOP ASSOCIATES PERFORMING OPERATIONS FINANCIAL REPORTING, ACCOUNTING, CONTROLLING AND BUDGETING DUTIES. INTERFACE WITH BUSINESS LEADERS TO UNDERSTAND FORECASTED DEMAND. USE LEAN TOOLS SUCH AS ROOT CAUSE ANALYSIS, COUNTERMEASURES, AND ACTION PLANNING TO ESTABLISH AND MANAGE CONTINUOUS IMPROVEMENT. VALIDATE SOURCING, PROCESS IMPROVEMENT AND CAPITAL ALLOCATION REQUEST SAVINGS FOR GROSS MARGIN FLOW-THROUGH. ENSURE ACCURACY OF THE PHYSICAL INVENTORY AND REPORTED RESULTS. INVESTIGATE AND EXPLAIN BOOK TO PHYSICAL ADJUSTMENTS. MAINTAIN AND REVIEW OF RECORDS OF ITEMS PURCHASED, COSTS, DELIVERIES, PRODUCT PERFORMANCE, AND INVENTORIES TO ASSIST IN MANAGING CONTINUOUS IMPROVEMENT. ASSIST WITH REVIEW AND PREPARATION OF CAPITAL APPROPRIATION REQUESTS. MAINTAIN CURRENT KNOWLEDGE OF ORGANIZATIONAL POLICIES AND PROCEDURES, GOVERNMENTAL POLICIES AND DIRECTIVES, AND CURRENT ACCOUNTING STANDARDS. CONDUCT OR COORDINATE AUDITS OF COMPANY ACCOUNTS AND FINANCIAL TRANSACTIONS TO ENSURE COMPLIANCE WITH COMPANY ACCOUNTING PROCEDURES.\n\nTHE TOOLBOX (REQUIREMENTS)\n\n BS DEGREE IN ACCOUNTING OR FINANCE 8+ YEARS’ PROGRESSIVE EXPERIENCE IN AN ACCOUNTING OR CONTROLLING FUNCTION WITHIN A MANUFACTURING ENVIRONMENT WITH 3+ YEARS’ MANUFACTURING COST EXPERIENCE. ADVANCED ERP KNOWLEDGE (SAP REQUIRED), HYPERION AND MICROSOFT EXCEL SOFTWARE. KNOWLEDGE OF GAAP, FINANCIAL CONSOLIDATION SYSTEMS (HYPERION) AND INTERNAL CONTROL FRAMEWORK. DEMONSTRATED STRONG FINANCIAL ANALYTICAL AND PROBLEM-SOLVING SKILLS. PROVEN ABILITY TO PERFORM WITH A HIGH DEGREE OF ACCURACY UNDER TIGHT DEADLINES AND TO MANAGE MULTIPLE PROJECTS. TRAVEL REQUIRED (~10%).\n\nAT APEX TOOL GROUP (WWW.APEXTOOLGROUP.COM), WE’RE PASSIONATE ABOUT INNOVATION. WHETHER THAT BE PRODUCTS, PROCESSES OR OPERATIONS, OUR ASSOCIATES STRIVE TO FIND NEW WAYS EACH DAY TO HELP OUR END-USERS SOLVE THEIR MOST COMPLEX CHALLENGES. BY HARNESSING OUR GLOBAL RESOURCES, UNPRECEDENTED INSIGHTS AND SPIRIT FOR SERVICE, WE BUILD MORE THAN JUST TOOLS FOR THE JOB SITE – WE HELP BUILD THE FUTURE.\n\nATG IS A GLOBAL MANUFACTURER OF HAND AND POWER TOOLS, TOOL STORAGE AND ACCESSORIES, CHAIN, AND ELECTRONIC SOLDERING SOLUTIONS WITH MORE THAN $1.4 BILLION IN ANNUAL REVENUES. OUR 6,900 GLOBAL ASSOCIATES HAVE BUILT POWERHOUSE BRANDS LIKE GEARWRENCH®, SATA®, CRESCENT®, CLECO®, WELLER® AND APEX® THAT PROFESSIONAL TRADES AND DIY ENTHUSIASTS ALIKE CAN TRUST TO GET THE JOB DONE. WITH OUR ROOTS DATING BACK TO THE 1800S, OUR TOOLS HAVE DRIVEN TECHNOLOGICAL ADVANCEMENTS THAT DRIVE EFFICIENCY, SPEED AND END-USER SAFETY IN A BROAD RANGE OF COMMERCIAL AND CONSUMER MARKETS.\n\nAS PART OF THE ATG TEAM, YOU WILL MOVE FAST, THINK GLOBALLY, LEARN FROM YOUR COLLEAGUES AND GROW YOUR CAREER. YOU’LL ENJOY COMPETITIVE BENEFITS, A HEALTHY WORK/LIFE BALANCE AND HAVE OPPORTUNITIES TO GIVE BACK TO THE COMMUNITIES WE SERVE.\n\nOUR SIX CORE VALUES – CUSTOMERS COME FIRST, INTEGRITY IN ALL WE DO, CONTINUOUS IMPROVEMENT, INNOVATION FOR GROWTH, PASSION TO SUCCEED AND BEST TALENT, ONE TEAM - DRIVE OUR DAILY DECISIONS. CONNECT WITH US ON SOCIAL MEDIA TO LEARN MORE – LINKEDIN, INSTAGRAM, FACEBOOK AND TWITTER.\n\nIF YOUR GOAL IS TO WORK WHERE FINDING A BETTER WAY NEVER ENDS AND YOUR IDEAS BECOME A REALITY, JOIN US! #WEBUILDATG",
    "job_skill_set": [
      "budgeting",
      "financial analysis",
      "GAAP",
      "ERP (SAP)",
      "Microsoft Excel",
      "accounting",
      "cost management",
      "internal controls",
      "auditing",
      "leadership",
      "problem solving",
      "communication",
      "teamwork",
      "time management",
      "analytical thinking",
      "coaching",
      "adaptability",
      "financial planning",
      "Hyperion"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "analysis",
      "analytical",
      "auditing",
      "budgeting",
      "coaching",
      "communication",
      "controls",
      "cost",
      "distribution",
      "erp",
      "excel",
      "finance",
      "financial",
      "gaap",
      "hyperion",
      "internal",
      "leadership",
      "management",
      "manager",
      "microsoft",
      "planning",
      "problem",
      "sap",
      "solving",
      "sr",
      "teamwork",
      "thinking",
      "time"
    ]
  },
  {
    "job_id": "3899544052",
    "job_title": "Sr. Finance Systems Specialist",
    "category": "FINANCE",
    "job_description": "EDF TRADING NORTH AMERICA, LLC IS A MAJOR PARTICIPANT IN WHOLESALE ENERGY MARKETS AND DELIVERS CUSTOMIZED ENERGY SOLUTIONS FOR OUR CUSTOMERS.\nWE OPERATE IN EVERY MARKET AND PROVIDE COAST TO COAST COVERAGE OF FINANCIAL AND PHYSICAL PRODUCTS IN POWER, NATURAL GAS AND NGLS, ENVIRONMENTAL PRODUCTS AND FINANCIAL CRUDE OIL PRODUCTS. WE PROVIDE OUR CUSTOMERS WITH PRODUCTS AND SERVICES THAT DELIVER ACCESS TO MARKETS, OPTIMIZE THEIR ENERGY PORTFOLIO, HEDGE RISK AND MANAGE ASSETS. OUR WHOLESALE BUSINESS OPERATES THROUGHOUT THE VALUE CHAIN IN THE NORTH AMERICAN WHOLESALE POWER MARKETS AND WE ARE ONE OF THE LEADING WHOLESALE NATURAL GAS MARKETERS. ADDITIONALLY, WE PROVIDE ENVIRONMENTAL, CONGESTION MANAGEMENT AND VALUE ADDED DERIVATIVE PRODUCTS. WITH EXTENSIVE PIPELINE AGREEMENTS, WE CAN MANAGE NATURAL GAS OFFTAKES, DELIVERIES, CAPACITIES AND SUPPLY ANYWHERE ACROSS THE CONTINENT. \nEDF TRADING NORTH AMERICA, LLC IS PART OF THE EDF GROUP, A GLOBAL LEADER IN LOW-CARBON ENERGIES. \nJOB DESCRIPTION:AS A SR. FINANCE SYSTEMS SPECIALIST, YOU WILL BE RESPONSIBLE FOR MANAGING THE FINANCE AND ACCOUNTING SYSTEMS AND IMPLEMENT SOLUTIONS THAT ADDRESS KEY BUSINESS OBJECTIVES, IMPROVE PRODUCTIVITY, AND SUPPORT COMPLIANCE. A STRONG PROCESS ARCHITECTURE MINDSET AND SYSTEM IMPLEMENTATION EXPERIENCE IN FINANCE AND ACCOUNTING SYSTEMS SPANNING ACROSS ALL TRACKS (RECORD TO REPORT (RTR), ORDER TO CASH (OTC), PROCURE TO PAY (PTP), AND FP&A) IS CRITICAL TO BE SUCCESSFUL IN THIS ROLE.\nRESPONSIBILITIES:MANAGE FINANCE AND ACCOUNTING TECHNOLOGY PROJECTS/INITIATIVES TO SUPPORT OPPORTUNITIES FOR EFFICIENCY AND ORGANIZATIONAL EFFECTIVENESSPARTNER WITH FINANCE AND ACCOUNTING TEAMS TO CONCEPTUALIZE SYSTEMS SOLUTIONS THAT ENABLE THE BUSINESS TO MEET MARKETPLACE AND REGULATORY DEMANDS AND PARTNER WITH IT FOR DELIVERYIDENTIFY KEY ACCOUNTING AND FINANCE PROCESS AND SYSTEMS ISSUES, COLLABORATE WITH VARIOUS BUSINESS STAKEHOLDERS AND IT TO DESIGN SOLUTIONS TO ENTERPRISE-WIDE CHALLENGES, AND LEAD THE DELIVERY OF COMPLEX PROJECTS THAT MEET BUSINESS REQUIREMENTS, AND BRIDGE ANY GAPS BETWEEN PROCESSES AND THE CURRENT FINANCE AND ACCOUNTING TECHNOLOGY SYSTEMS PROVIDE TECHNICAL TRAINING AND SUPPORT TO FINANCE AND ACCOUNTING USERSDRIVE THE PRIORITIZATION OF FINANCE IT INITIATIVES IN THE OVERALL IT SYSTEMS ROADMAPENSURE THAT SOLUTION ARCHITECTURE (SOFTWARE) DESIGNS ARE IN SYNC WITH BUSINESS NEEDSMONITOR THE ACTIVITIES OF EXTERNAL VENDORS/PARTNERS WORKING ON THE PROJECT(S)IDENTIFY AND MITIGATE EXISTING BUSINESS RISK OR RISKS ASSOCIATED WITH SOLUTION ARCHITECTURE\nREQUIREMENTS:BACHELOR DEGREE IN ACCOUNTING OR FINANCECPA DESIGNATION IS PREFERRED3+ YEARS TECHNICAL EXPERIENCE WITH IMPLEMENTATIONS AND ENHANCEMENTS OF FINANCE AND ACCOUNTING PLATFORMS – WORKDAY, ACCOUNTING CENTER, PRISM PREFERREDEXPERIENCE LEADING FINANCE AND ACCOUNTING TRANSFORMATIONAL INITIATIVES FOR DYNAMIC ORGANIZATIONSEXPERIENCE WORKING WITH VENDORS AND SYSTEM INTEGRATORS TO IMPLEMENT AND SUPPORT FINANCE, ACCOUNTING, AND BOUNDARY SYSTEMS AND WORK ON ENHANCEMENTS RELATED TO THE SAMEEXPERIENCE BUILDING IT GENERAL CONTROLS IN ACCOUNTING AND FINANCE PROCESSES AND SYSTEMSEXPERIENCE WITH IMPLEMENTATION AND INTEGRATION OF FP&A SYSTEMS IS STRONGLY PREFERRED\nNOTE: EDF IS AN EEO EMPLOYER\nWE ARE AN EQUAL OPPORTUNITY EMPLOYER AND ALL QUALIFIED CANDIDATES WILL RECEIVE CONSIDERATION FOR ALL POSITIONS WITHOUT REGARD TO RACE, COLOR, AGE, RELIGION, SEX (INCLUDING PREGNANCY), SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, VETERAN STATUS, DISABILITY, GENETIC INFORMATION, OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW.\nEDF PARTICIPATES IN THE E-VERIFY EMPLOYMENT VERIFICATION PROGRAM.\nEDF IS NOT CURRENTLY ACCEPTING UNSOLICITED RESUMES FROM SEARCH FIRMS. REGARDLESS OF PAST PRACTICE, ALL RESUMES SUBMITTED BY SEARCH FIRMS TO ANY EMPLOYEE AT EDF VIA-EMAIL, THE INTERNET OR DIRECTLY TO HIRING MANAGERS AT EDF IN ANY FORM WITHOUT A VALID WRITTEN AGREEMENT IN PLACE FOR THAT SPECIFIC POSITION WILL BE DEEMED THE SOLE PROPERTY OF EDF. AS A RESULT, NO FEE WILL BE PAID IN THE EVENT THE CANDIDATE IS HIRED BY EDF.",
    "job_skill_set": [
      "Project Management",
      "Collaboration",
      "Problem Solving",
      "Communication",
      "Training and Support",
      "Risk Management",
      "Finance and Accounting Systems",
      "Process Architecture",
      "System Implementation",
      "Workday",
      "Accounting Center",
      "Prism",
      "FP&A Systems",
      "IT General Controls"
    ],
    "short_keywords": [
      "accounting",
      "and",
      "architecture",
      "center",
      "collaboration",
      "communication",
      "controls",
      "finance",
      "fpa",
      "general",
      "implementation",
      "it",
      "management",
      "prism",
      "problem",
      "process",
      "project",
      "risk",
      "solving",
      "specialist",
      "sr",
      "support",
      "system",
      "systems",
      "training",
      "workday"
    ]
  },
  {
    "job_id": "3904375309",
    "job_title": "Director of Finance",
    "category": "FINANCE",
    "job_description": "\nOVERVIEW\n\nTHIS EXECUTIVE LEVEL POSITION WILL OVERSEE ALL ASPECTS OF THE THE FINANCE/ACCOUNTING DEPARTMENT IN A CENTRALIZED ENVIRONMENT. WILL ACT AS A MENTOR AND BE VERY INVOLVED WITH THE DAY-TO-DAY OPERATIONS OF THE HOTEL AND THE DEPARTMENT\n\nRESPONSIBILITIES\n",
    "job_skill_set": [
      "financial analysis",
      "accounting principles",
      "financial reporting",
      "forecasting",
      "data analysis",
      "communication",
      "problem solving",
      "interpersonal skills",
      "budgeting",
      "regulatory compliance",
      "financial modeling",
      "ERP software",
      "leadership",
      "mentoring",
      "team management",
      "strategic thinking",
      "decision making"
    ],
    "short_keywords": [
      "accounting",
      "analysis",
      "budgeting",
      "communication",
      "compliance",
      "data",
      "decision",
      "director",
      "erp",
      "finance",
      "financial",
      "forecasting",
      "interpersonal",
      "leadership",
      "making",
      "management",
      "mentoring",
      "modeling",
      "of",
      "principles",
      "problem",
      "regulatory",
      "reporting",
      "skills",
      "software",
      "solving",
      "strategic",
      "team",
      "thinking"
    ]
  },
  {
    "job_id": "3905864665",
    "job_title": "Finance Manager BUF Vision MEDCEE",
    "category": "FINANCE",
    "job_description": "APPLY NOW\n\nSHARE\n\nDESCRIPTION\n\nAT JOHNSON & JOHNSON, WE BELIEVE HEALTH IS EVERYTHING. OUR STRENGTH IN HEALTHCARE INNOVATION EMPOWERS US TO BUILD A WORLD WHERE COMPLEX DISEASES ARE PREVENTED, TREATED, AND CURED, WHERE TREATMENTS ARE SMARTER AND LESS INVASIVE, AND SOLUTIONS ARE PERSONAL. THROUGH OUR EXPERTISE IN INNOVATIVE MEDICINE AND MEDTECH, WE ARE UNIQUELY POSITIONED TO INNOVATE ACROSS THE FULL SPECTRUM OF HEALTHCARE SOLUTIONS TODAY TO DELIVER THE BREAKTHROUGHS OF TOMORROW, AND PROFOUNDLY IMPACT HEALTH FOR HUMANITY. LEARN MORE AT HTTPS://WWW.JNJ.COM/.  \n\n FINANCE MANAGER BUF VISION MEDCEE \n\n PRIMARY LOCATION: WARSAW, OTHER LOCATION: PRAGUE \n\nGENERAL\n\n THE RESPONSIBILITIES & THE IMPACT YOU WILL HAVE: \n\n PROVIDE FINANCIAL LEADERSHIP AND CONTROLLERSHIP FOR THE FULL P&L OF VISION CARE MEDCEE SERVE AS KEY BUSINESS PARTNER TO THE GENERAL MANAGER AND THE LEADERSHIP TEAM HELPING TO SHAPE STRATEGY AND PROVIDING FINANCIAL ADVICE AND SUPPORT TO ENABLE DECISION MAKING. ENSURE CLOSE RELATIONS AND ROBUST SUPPORT FROM THE X-SECTOR / X-TIER FINANCE PARTNERS. MANAGEMENT OF 1 SENIOR FINANCE ANALYST BASED IN THE REGION,\n\nFINANCE REPORTING AND BUDGET PLANNING\n\n PRO-ACTIVE PARTICIPATION IN MONTHLY, QUARTERLY AND YEAR END CLOSING, ENSURE TIMELY SUBMISSION OF ACCURATE FINANCIAL INFORMATION TO EMA REGION, PARTNER & ENGAGE WITH ASSOCIATES FROM GS AND FP&A, P&L VARIANCE ANALYSIS, REVIEWING AND ANALYSING ALL INTERNAL REPORTS TO ENSURE INFORMED TIMELY CORRECTIVE RECOMMENDATIONS AND ACTION PLANS. PRO-ACTIVE MANAGEMENT OF THE P&L TO ENSURE DELIVERY ON FINANCIAL COMMITMENTS THROUGH CLOSE MONITORING OF RISKS & OPPORTUNITIES. BUSINESS PLANNING AND FORECASTS: ACTIVE PARTICIPATION IN BUDGET CONSTRUCTION, CLOSE PARTNERING WITH THE CLUSTER MANAGEMENT TEAM TO ANALYSE AND UNDERSTAND THEIR NEEDS AND CHALLENGES. IN COLLABORATION WITH THE FP&A COE UPDATING AND SUBMISSION OF BUSINESS PLAN TO EMA REGION. COMPLIANCE: ENSURE COMPLIANCE WITH J&J WORLDWIDE PROCEDURES, SOX REQUIREMENTS AND LOCAL TAX/ACCOUNTING STANDARDS. IMPROVE AND MAINTAIN INTERNAL CONTROLS DOCUMENTATION IN CONJUNCTION WITH REGIONAL SOX MANAGER. LEADING PROJECTS, INCLUDING THE OPTIMIZATION OF PROCESSES AND ACTIVITIES WITH A FOCUS ON CONTINUOUS IMPROVEMENT.\n\nBUSINESS PARTNERING\n\n IN-DEPTH COLLABORATION WITH GENERAL MANAGER AND THE MARKET MANAGEMENT TEAM TO PROVIDE PROACTIVE & INNOVATIVE SOLUTIONS TO UNDERSTAND CHALLENGES & RESOLVE BUSINESS CONCERNS. PARTNER WITH COMMERCIAL, MARKETING AND DELIVER TEAM TO BUILD BUSINESS CASES AND MONITOR PRODUCT/CUSTOMER CONTRIBUTION IMPROVEMENT. REVENUE TRACKING, PRICING AND RETURN OF INVESTMENTS ANALYSIS TO FACILITATE PROFITABILITY IMPROVEMENT. RESPONDS TO AD-HOC ANALYSIS REQUESTS FROM CLUSTER AND REGIONAL MANAGEMENT ON A TIMELY BASIS. CONTINUOUS IMPROVEMENT IN METHODOLOGY OF WORKING TO ENHANCE EFFICIENCY AND EFFECTIVENESS OF THE TEAM. COMPLIANCE: ADVOCATE ORGANIZATIONAL COMPLIANCE TO HCBI, HCC, COMMERCIAL/COMPETITION LAW AND REGULATIONS. EXPOSURE TO THE MEDCEE FINANCE MANAGEMENT, THE REGIONAL MANAGING DIRECTOR AND THE EMA VISION CARE BOARD.\n\nQUALIFICATIONS\n\n WE WOULD LOVE TO HEAR FROM YOU, IF YOU HAVE: \n\n BACHELOR DEGREE IN BUSINESS ADMINISTRATION, FINANCE, OR ANY OTHER RELEVANT FIELD. 7 YEARS OF BUSINESS EXPERIENCE IN CONTROLLING, AUDITING, FINANCE OR CONSULTING. KNOWLEDGE OF US GAAP ACCOUNTING AND SARBANES OXLEY REQUIREMENTS. STRONG BUSINESS ACUMEN, ADEPT AND COMFORTABLE SUPPORTING AND CHALLENGING THE BUSINESS. PROVEN ABILITY TO OPERATE EFFECTIVELY AT MANAGEMENT LEVEL. EXCELLENT INTERPERSONAL & COMMUNICATION SKILLS, POSITIVE AND CURIOUS MINDSET. PROVEN ABILITY TO OPERATE EFFECTIVELY WITH VERY DIVERSE CULTURES. STRONG TIME MANAGEMENT SKILLS AND ABILITY TO WORK IN AUTONOMY, ABLE TO DEAL WITH COMPLEXITY, WITH THE RIGHT LEVEL OF ATTENTION TO DETAIL WHILE NOT LOSING THE BIG PICTURE. FLUENT ENGLISH.\n\nLEADERSHIP BEHAVIORS REQUIRED\n\n LIVE OUR CREDO: PUTS THE NEEDS OF OUR CREDO STAKEHOLDERS FIRST, PURSUES THE HIGHEST STANDARDS OF QUALITY, SAFETY, COMPLIANCE & ETHICS AND ENSURES EVERYDAY ACTIONS CONTRIBUTE TO OUR PURPOSE CONNECT: BUILDS INTERNAL AND EXTERNAL RELATIONSHIPS BASED ON RESPECT, COLLABORATES OPENLY ACROSS BOUNDARIES AND ACTS AS A TEAM PLAYER.\n\nTHIS IS WHAT AWAITS YOU AT J&J\n\n AN OPPORTUNITY TO BE PART OF A GLOBAL MARKET LEADER. A DYNAMIC AND INSPIRING WORKING ENVIRONMENT. MANY OPPORTUNITIES TO WORK ON CHALLENGING PROJECTS AND ASSIGNMENTS. AN OPPORTUNITY TO PARTICIPATE IN EMPLOYEE ENGAGEMENT ACTIVITIES ON A VOLUNTARY BASIS BASED ON INDIVIDUAL PREFERENCE POSSIBILITIES FOR FURTHER PERSONAL AS WELL AS PROFESSIONAL DEVELOPMENT. MANY EMPLOYEES BENEFITS:\n\n FOR MORE THAN 130 YEARS, DIVERSITY, EQUITY & INCLUSION (DEI) HAVE BEEN PART OF OUR CULTURAL FABRIC AT JOHNSON & JOHNSON AND WOVEN INTO HOW WE DO BUSINESS EVERY DAY. OUR COMMITMENT TO RESPECT THE DIGNITY AND DIVERSITY OF ALL IS EMBEDDED IN OUR CREDO. \n\n WE KNOW THAT THE SUCCESS OF OUR BUSINESS DEPENDS ON HAVING THE BEST TALENT IN A WORKFORCE THAT REFLECTS THE DIVERSE MARKETS WE SERVE AROUND THE WORLD AND AN INCLUSIVE CULTURE THAT VALUES DIFFERENT PERSPECTIVES AND LIFE EXPERIENCES \n\n THAT IS WHY WE IN JOHNSON & JOHNSON ARE WORKING TO CREATE AN INCLUSIVE ENVIRONMENT WHERE DIVERSE BACKGROUNDS, PERSPECTIVES AND EXPERIENCES ARE VALUED AND EACH AND EVERY ONE OF OUR PEOPLE FEELS THAT THEY BELONG AND CAN REACH THEIR POTENTIAL. NO MATTER WHO THEY ARE. \n\n DIVERSITY, EQUITY & INCLUSION AT JOHNSON & JOHNSON MEANS “YOU BELONG”!",
    "job_skill_set": [
      "financial leadership",
      "financial analysis",
      "project management",
      "communication",
      "interpersonal skills",
      "teamwork",
      "problem solving",
      "time management",
      "adaptability",
      "leadership",
      "strategic thinking",
      "collaboration",
      "P&L management",
      "budget planning",
      "financial reporting",
      "US GAAP accounting",
      "Sarbanes-Oxley compliance",
      "internal controls",
      "business case development",
      "cultural awareness"
    ],
    "short_keywords": [
      "accounting",
      "adaptability",
      "analysis",
      "awareness",
      "budget",
      "buf",
      "business",
      "case",
      "collaboration",
      "communication",
      "compliance",
      "controls",
      "cultural",
      "development",
      "finance",
      "financial",
      "gaap",
      "internal",
      "interpersonal",
      "leadership",
      "management",
      "manager",
      "medcee",
      "pl",
      "planning",
      "problem",
      "project",
      "reporting",
      "sarbanesoxley",
      "skills",
      "solving",
      "strategic",
      "teamwork",
      "thinking",
      "time",
      "us",
      "vision"
    ]
  },
  {
    "job_id": "3904507874",
    "job_title": "Financial Analyst, Motion Picture Finance",
    "category": "FINANCE",
    "job_description": "SONY PICTURES ENTERTAINMENT IS A LEADING CREATOR AND DISTRIBUTOR OF ENTERTAINMENT PRODUCTS, SERVICES, AND TECHNOLOGY. OUR GLOBAL OPERATIONS ENCOMPASS MOTION PICTURE PRODUCTION AND DISTRIBUTION, TELEVISION PROGRAMMING AND SYNDICATION, HOME VIDEO ACQUISITIONS AND DISTRIBUTION, OPERATION OF STUDIO FACILITIES, DEVELOPMENT OF NEW ENTERTAINMENT TECHNOLOGIES, AND DISTRIBUTION OF FILMED ENTERTAINMENT WORLDWIDE.\n\nCURRENTLY, WE ARE SEEKING A FINANCIAL ANALYST FOR OUR MOTION PICTURE DIVISION FINANCE GROUP IN CULVER CITY, CA OFFICE. THIS INDIVIDUAL WILL BE RESPONSIBLE, IN PART, FOR THE SONY PICTURES ANIMATION AND SCREEN GEMS LABELS INCLUDING FORECASTING AND ANALYSES OF DEVELOPMENT (APPROXIMATELY 50% OF ROLE), CASH FORECASTING AND CONSOLIDATION (APPROXIMATELY 25% OF ROLE) AND OVERHEAD CONSOLIDATION RESPONSIBILITIES (APPROXIMATELY 25% OF ROLE).\n\nPRIMARY RESPONSIBILITIES\n\nSCREEN GEMS AND ANIMATION LABELS\n\nASSIST IN THE MAINTENANCE OF FILM MODELS, INCLUDING MONTHLY CLEANUP AND ENSURING THE LATEST MODELS ARE UPLOADED INTO THE FINANCIAL SYSTEM FOR CLOSE AND FORECAST/BUDGETMAINTAIN AND UPDATE LABEL DECKS FOR FORECASTS AND BUDGET/MRPREVIEW FILM PERFORMANCE AT LEAST QUARTERLY; ANALYZE TRENDS BY MARKET AS NEEDED TO ASSESS REASONABLENESSPREPARE MONDAY MORNING REPORTS FOR THEATRICAL RELEASES AS NEEDEDFORECAST DEVELOPMENT SPEND AND EXPENSE; RECONCILE VARIANCES ON A MONTHLY BASISPREPARE QUARTERLY WRITE-OFF SCHEDULES TO REVIEW WITH DIVISION HEADSREVIEW QUARTERLY COMMITMENTS WITH DIVISION HEADS; WITH CREATIVE AND BUSINESS AFFAIRS, ENSURE BUDGETS ARE MET\n\nCASH FORECASTING\n\nSUPPORT DIRECTOR’S CONSOLIDATION OF CASH RECEIPTS AND DISBURSEMENTSPREPARE DRIVERS OF DIFFERENCE FOR FORECAST AND BUDGET/MRPFORECAST SPECIFIC ACCOUNTS E.G. AMOUNTS PAID TO PARTICIPANTS, INVESTOR RECOUPMENT, GUILD PAYMENTS, AND OVERHEADASSIST IN EXPLAINING P&L TO OPERATING CASH VARIANCES, KEY ACCOUNT BALANCE MOVEMENTS AND PREPARING INDIRECT CASH FLOW STATEMENTSPREPARE AD HOC SCHEDULES AS NEEDED\n\nOVERHEAD PLANNING\n\nPREPARE OVERHEAD FORECAST AND BUDGET/MRP FOR MPG LABELSASSIST IN CONSOLIDATION OF OVERHEAD FOR ENTIRE MPG DIVISION, INCLUDING WORLDWIDE THEATRICAL, SONY PICTURES WORLDWIDE ACQUISITIONS, IMAGEWORKS, STUDIO OPERATIONS, AND DISTRIBUTION CONTENT SERVICESPREPARE DETAILED FORECAST AND BUDGET RECONCILIATIONS FOR ALL MPG DIVISIONSASSIST IN PREPARATION OF OVERHEAD PRESENTATION SLIDES FOR FORECAST AND BUDGETREVIEW MONTHLY OVERHEAD ACTUALS FOR MATERIAL VARIANCES AND PROVIDE EXPLANATIONS TO MANAGERPREPARE AD HOC ANALYSIS AS NEEDED\n\nQUALIFICATIONS\n\nKNOWLEDGE AND SKILLS:\n\n1 TO 2 YEARS OF WORK EXPERIENCE PREFERREDBS/BA DEGREE WITH ACCOUNTING/FINANCE/ECONOMICS FOCUS REQUIREDCPA AND ENTERTAINMENT EXPERIENCE AND SAP KNOWLEDGE ARE A PLUS BUT NOT REQUIREDSTRONG MS EXCEL SKILLS REQUIRED (LOOK-UPS, PIVOT TABLES, MACROS)ABILITY TO QUICKLY GRASP NEW CONCEPTS AND PROBLEM SOLVE; PROVIDE INNOVATIVE SOLUTIONS TO SHORTEN EXISTING PROCESSESSTRONG INITIATIVE AND ABILITY TO MANAGE MULTIPLE PROJECTS WHILE WORKING IN A CROSS-FUNCTIONAL TEAM ENVIRONMENT.STRONG ACCOUNTING KNOWLEDGEABILITY TO PERFORM TASKS WITH REASONABLE INDEPENDENCE; ARTICULATE IN EXPRESSING ISSUES AND POTENTIAL SOLUTIONSSTRONG LEVEL OF COMMUNICATION WITH MANAGEMENT, STAFF, AND OTHER LINES OF BUSINESS; GOOD INTERPERSONAL SKILLS\n\nTHE ANTICIPATED BASE SALARY FOR THIS POSITION IS $64,000-$80,000. THIS ROLE MAY ALSO QUALIFY FOR ANNUAL INCENTIVE AND/OR COMPREHENSIVE BENEFITS. THE ACTUAL BASE SALARY OFFERED WILL DEPEND ON A VARIETY OF FACTORS, INCLUDING WITHOUT LIMITATION, THE QUALIFICATIONS OF THE INDIVIDUAL APPLICANT FOR THE POSITION, YEARS OF RELEVANT EXPERIENCE, LEVEL OF EDUCATION ATTAINED, CERTIFICATIONS OR OTHER PROFESSIONAL LICENSES HELD, AND IF APPLICABLE, THE LOCATION OF THE POSITION.\n\nSONY PICTURES ENTERTAINMENT IS AN EQUAL OPPORTUNITY EMPLOYER. WE EVALUATE QUALIFIED APPLICANTS WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, NATIONAL ORIGIN, DISABILITY, VETERAN STATUS, AGE, SEXUAL ORIENTATION, GENDER IDENTITY, OR OTHER PROTECTED CHARACTERISTICS.\n\nTO REQUEST AN ACCOMMODATION FOR PURPOSES OF PARTICIPATING IN THE HIRING PROCESS, YOU MAY CONTACT US AT SPE_ACCOMMODATION_ASSISTANCE@SPE.SONY.COM.",
    "job_skill_set": [
      "financial analysis",
      "budgeting",
      "accounting knowledge",
      "MS Excel",
      "variance reconciliation",
      "P&L analysis",
      "problem solving",
      "communication",
      "initiative",
      "cross-functional teamwork",
      "independence",
      "interpersonal skills",
      "project management",
      "cash forecasting",
      "SAP knowledge",
      "film models maintenance",
      "ad hoc analysis"
    ],
    "short_keywords": [
      "accounting",
      "ad",
      "analysis",
      "analyst",
      "budgeting",
      "cash",
      "communication",
      "crossfunctional",
      "excel",
      "film",
      "finance",
      "financial",
      "forecasting",
      "hoc",
      "independence",
      "initiative",
      "interpersonal",
      "knowledge",
      "maintenance",
      "management",
      "models",
      "motion",
      "ms",
      "picture",
      "pl",
      "problem",
      "project",
      "reconciliation",
      "sap",
      "skills",
      "solving",
      "teamwork",
      "variance"
    ]
  },
  {
    "job_id": "3906255474",
    "job_title": "Billing Analyst - Finance",
    "category": "FINANCE",
    "job_description": "OVERVIEW\n\nTHE BILLING ANALYST POSITION IS AN INTERMEDIATE LEVEL PROFESSIONAL ACCOUNTANT POSITION RESPONSIBLE FOR PREPARING, MONITORING AND REPORTING OF THE GOVERNMENT CONTRACT BILLING FUNCTIONS OF THE FINANCE DIRECTORATE, PROVIDING PROGRAM AND PROJECT SUPPORT TO THE SUPERVISOR OF ACCOUNTS RECEIVABLE. INTERPRETS ACCOUNTING DATA, PREPARES AND ANALYZES REPORTS AND MAKES RECOMMENDATIONS. PREPARES VARIOUS ACCOUNTING DOCUMENTS, SCHEDULES, EXHIBITS, AND SUMMARIES. WORKS CLOSELY WITH MEMBERS OF RESEARCH DIVISIONS, DIRECTORATES, AND/OR VENDORS TO RESOLVE A VARIETY OF PROBLEMS. PROVIDES SUPPORT TO THE ACCOUNTS RECEIVABLE SUPERVISOR AS NEEDED. A CRITICAL TEAM MEMBER WORKING TO MAINTAIN THE INTEGRITY OF THE RECEIVABLES FUNCTION INCLUDING THE PREPARATION, VERIFICATION, VALIDATION AND INPUT OF ASSOCIATED JOURNAL ENTRIES.\n\nRESPONSIBILITIES\n\n MAINTAINS A STRONG UNDERSTANDING OF FEDERAL AND STATE LAWS AND REGULATIONS TO INCLUDE INTERPRETING, RESEARCHING AND ENSURING COMPLIANCE.  MAINTAINS A CURRENT WORKING KNOWLEDGE OF ACCOUNTING PRINCIPLES AND PRACTICES AND RELEVANT GOVERNMENT REGULATIONS AND APPLIES THIS KNOWLEDGE TO POSITION RESPONSIBILITIES.  RESPONSIBLE FOR PREPARING ASSIGNED GENERAL LEDGER RECONCILIATIONS AND TIMELY RESOLVING OPEN ITEMS.  RESPONSIBLE FOR PREPARING ASSIGNED GENERAL LEDGER RECONCILIATIONS, TIMELY RESOLVING OPEN ITEMS AND PREPARING ANALYSIS OF ACCOUNTS AS REQUESTED.  PREPARES ASSIGNED MONTHLY JOURNAL ENTRIES WITH SUPPORTING DOCUMENTATION AND WRITTEN DESCRIPTION IN SUPPORT OF RECONCILIATION RESPONSIBILITIES.  ASSISTS IN COMPILING AND ANALYZING RECEIVABLES AUDIT RESPONSES PRIOR TO SUBMISSION TO OUTSIDE AUDITORS.  PARTICIPATES IN PROBLEM SOLVING AND SPECIAL PROJECTS WITHIN THE RECEIVABLE’S ENVIRONMENT.  MAINTAINS STRONG UNDERSTANDING OF THE FINANCIAL SYSTEM, INCLUDING COMPREHENSION OF IMPACT OF VARIOUS TRANSACTIONS, IN ORDER TO PARTICIPATE IN DEVELOPMENT AND IMPLEMENTATION OF ACCOUNTING SYSTEMS, METHODS, PROCEDURES, AND CONTROLS.  PREPARES GOVERNMENT CONTRACT BILLINGS IN ACCORDANCE TO FAR, CONTRACT TERMS AND GUIDELINES; RESOLVES ISSUES; MAINTAINS APPROPRIATE FILES.  WORKS WITH THE TREASURY TEAM TO RESOLVE RECEIVABLE ISSUES.  PROVIDES SUPPORT IN RELATION TO CONTRACT BILLINGS, INCLUDING UNBILLED.  RECONCILES BILLING SYSTEM DATA TO FINANCIAL SYSTEM DATA.  RESPONDS TO INTERNAL AND EXTERNAL BILLING RELATED INQUIRIES.  WORKS WITH THE CONTRACTS TEAM FOR CONTRACT BILLING GUIDELINES.  SUPPORTS WORK IN CONJUNCTION WITH AUDITS AND INCURRED COST SUBMISSION.  MAINTAINS A CURRENT WORKING KNOWLEDGE OF ACCOUNTING PRINCIPLES AND PRACTICES AND RELEVANT GOVERNMENT REGULATIONS. \n\nQUALIFICATIONS\n\n BS DEGREE, PREFERABLY IN ACCOUNTING, OR IN RELATED FIELD WITH COURSE WORK IN ACCOUNTING.  MINIMUM OF 3 YEARS WORK EXPERIENCE IN ACCOUNTING, FINANCE, OR GOVERNMENT CONTRACTING; FAMILIARITY WITH GENERAL BUSINESS PRACTICES. TWO OF THE YEARS SHOULD, PREFERABLY, PERTAIN TO COST ACCOUNTING EXPERIENCE.  THOROUGH KNOWLEDGE AND DEMONSTRATED SKILLS IN MATTERS RELATED TO ACCOUNTING AND FINANCIAL POLICIES, PROCEDURES, AND REPORTING.  WORKING UNDERSTANDING OF U.S. GENERALLY ACCEPTED ACCOUNTING PRINCIPLES (GAAP).  COMPUTER LITERACY INCLUDING FAMILIARITY WITH STANDARD BUSINESS OFFICE SOFTWARE SUCH AS MICROSOFT OFFICE; EXPERIENCE USING COMPUTERIZED ACCOUNTING SOFTWARE.  EXPERIENCE WITH DELTEK/COSTPOINT SOFTWARE REQUIRED.  EXCELLENT INTERPERSONAL SKILLS AND THE ABILITY TO COMMUNICATE EFFECTIVELY BOTH ORALLY AND IN WRITING WITH ALL LEVELS OF EMPLOYEES.  USE OF CRITICAL, ANALYTICAL, AND CREATIVE THINKING TO IDENTIFY AND SOLVE PROBLEMS.  ABILITY TO ESTABLISH AND MAINTAIN EFFECTIVE WORKING RELATIONSHIPS WITH OTHER EMPLOYEES; ABILITY TO UNDERSTAND AND FOLLOW ORAL AND WRITTEN INSTRUCTION; ABILITY TO ORGANIZE AND PERFORM WORK INDEPENDENTLY WITH GENERAL INSTRUCTIONS.  ABILITY TO WORK EFFECTIVELY BOTH INDEPENDENTLY AND AS PART OF A TEAM AND HAVE A STRONG UNDERSTANDING OF THE THEORETICAL AND PRACTICAL COMPONENTS OF THE POSITION APART FROM JUST BEING FAMILIAR WITH PERFORMING ASSIGNED TASKS.  STRONG ATTENTION TO DETAIL, EXCELLENT ORGANIZATIONAL SKILLS AND ABILITY TO EFFECTIVELY PRIORITIZE WORK TO MEET DEADLINES.  STRONG GENERAL LEDGER RECONCILIATION SKILLS.  SUCCESSFUL COMPLETION OF A CRIMINAL BACKGROUND CHECK IS REQUIRED. \n\nU.S. CITIZENSHIP IS REQUIRED\n\nABILITY TO OBTAIN AND MAINTAIN A SECURITY CLEARANCE IS REQUIRED\n\nIDA IS AN EQUAL OPPORTUNITY EMPLOYER COMMITTED TO PROVIDING A FAIR RECRUITING PROCESS AND WORKING ENVIRONMENT FREE FROM DISCRIMINATION. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTIFY, NATIONAL ORIGIN, DISABILITY OR PROTECTED VETERAN STATUS. CLICK HERE TO LEARN MORE ABOUT IDA'S COMMITMENT TO DIVERSITY, EQUITY, AND INCLUSION.\n\nIDA IS COMMITTED TO WORKING WITH AND PROVIDING REASONABLE ACCOMMODATIONS TO INDIVIDUALS WITH DISABILITIES. IF, BECAUSE OF A MEDICAL CONDITION OR DISABILITY, YOU NEED A REASONABLE ACCOMMODATION FOR ANY PART OF THE APPLICATION PROCESS OR IN ORDER TO PERFORM THE ESSENTIAL FUNCTIONS OF A POSITION, PLEASE SEND AN EMAIL TO EMPLOYMENT@IDA.ORG AND LET US KNOW THE NATURE OF YOUR REQUEST AND CONTACT INFORMATION.\n\nHTTP://WWW.DOL.GOV/OFCCP/SELFIDVIDEO.HTML",
    "job_skill_set": [
      "accounting principles",
      "general ledger reconciliation",
      "financial reporting",
      "billing systems",
      "Microsoft Office",
      "analytical skills",
      "communication",
      "problem solving",
      "teamwork",
      "attention to detail",
      "organizational skills",
      "independent work",
      "interpersonal skills",
      "critical thinking",
      "GAAP",
      "Deltek/Costpoint software",
      "financial systems",
      "government regulations"
    ],
    "short_keywords": [
      "accounting",
      "analyst",
      "analytical",
      "attention",
      "billing",
      "communication",
      "critical",
      "deltekcostpoint",
      "detail",
      "finance",
      "financial",
      "gaap",
      "general",
      "government",
      "independent",
      "interpersonal",
      "ledger",
      "microsoft",
      "office",
      "organizational",
      "principles",
      "problem",
      "reconciliation",
      "regulations",
      "reporting",
      "skills",
      "software",
      "solving",
      "systems",
      "teamwork",
      "thinking",
      "to",
      "work"
    ]
  },
  {
    "job_id": "3904955829",
    "job_title": "Business Development Manager - VMS/MSP",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "BUSINESS DEVELOPMENT MANAGER – MSP/VMS\nHYBRID ROLE\nMUST HAVE EXPERIENCE WORKING FOR A STAFFING COMPANY SELLING TO LARGE MSP’S\nABOUT THE ROLE:\nAS A BUSINESS DEVELOPMENT MANAGER - MSP/VMS, YOU WILL PLAY A CRUCIAL ROLE IN DRIVING NEW BUSINESS GROWTH THROUGH MANAGED SERVICE PROVIDERS (MSPS) AND VENDOR MANAGEMENT SYSTEMS (VMS) PLATFORMS. YOU WILL LEVERAGE YOUR EXPERTISE IN THE CONTINGENT WORKFORCE INDUSTRY TO IDENTIFY AND CULTIVATE RELATIONSHIPS WITH KEY DECISION-MAKERS, DEVELOP COMPELLING PROPOSALS, AND ULTIMATELY SECURE NEW PARTNERSHIPS THAT EXPAND OUR REACH AND REVENUE.\nRESPONSIBILITIES:\nPROSPECTING AND LEAD GENERATION:\nPROACTIVELY IDENTIFY AND QUALIFY POTENTIAL MSP AND VMS PARTNERS ACROSS DIVERSE INDUSTRIES.UTILIZE VARIOUS CHANNELS LIKE INDUSTRY EVENTS, CONFERENCES, ONLINE PLATFORMS, AND NETWORKING TO GENERATE LEADS.DEVELOP AND EXECUTE TARGETED OUTREACH CAMPAIGNS TO ENGAGE WITH KEY CONTACTS.\nRELATIONSHIP BUILDING AND NEGOTIATION:\nBUILD STRONG AND LASTING RELATIONSHIPS WITH KEY DECISION-MAKERS WITHIN MSPS AND VMS PLATFORMS.UNDERSTAND AND ADDRESS THE SPECIFIC NEEDS AND CHALLENGES FACED BY POTENTIAL PARTNERS.NEGOTIATE MUTUALLY BENEFICIAL CONTRACTS THAT ALIGN WITH OUR BUSINESS GOALS.\nPROPOSAL DEVELOPMENT AND PRESENTATION:\nCREATE COMPELLING AND CUSTOMIZED PROPOSALS THAT SHOWCASE THE VALUE PROPOSITION OF OUR SOLUTIONS.DELIVER EFFECTIVE PRESENTATIONS TO COMMUNICATE OUR EXPERTISE AND ADDRESS PARTNER CONCERNS.\nMARKET ANALYSIS AND COMPETITIVE INTELLIGENCE:\nSTAY INFORMED ABOUT THE LATEST TRENDS AND DEVELOPMENTS IN THE MSP/VMS LANDSCAPE.CONDUCT COMPETITIVE ANALYSIS TO IDENTIFY OPPORTUNITIES AND DIFFERENTIATE OUR OFFERINGS.CONTRIBUTE INSIGHTS TO DEVELOP EFFECTIVE SALES AND MARKETING STRATEGIES.\nSALES SUPPORT AND COLLABORATION:\nCOLLABORATE CLOSELY WITH THE SALES TEAM TO CLOSE DEALS AND ENSURE SMOOTH ONBOARDING OF NEW PARTNERS.PROVIDE ONGOING SUPPORT AND GUIDANCE TO PARTNERS TO MAXIMIZE THEIR SUCCESS WITH OUR SOLUTIONS.PARTICIPATE IN TEAM MEETINGS AND SHARE BEST PRACTICES TO DRIVE COLLECTIVE GROWTH.\nQUALIFICATIONS:\nMINIMUM 2-5 YEARS OF EXPERIENCE IN BUSINESS DEVELOPMENT WITHIN THE STAFFING OR CONTINGENT WORKFORCE INDUSTRY.PROVEN TRACK RECORD OF SUCCESS IN SECURING NEW PARTNERSHIPS WITH MSPS AND VMS PLATFORMS.STRONG UNDERSTANDING OF THE MSP/VMS ECOSYSTEM AND ITS VALUE PROPOSITION.EXCELLENT COMMUNICATION, PRESENTATION, AND NEGOTIATION SKILLS.ABILITY TO BUILD STRONG RELATIONSHIPS AND MANAGE MULTIPLE STAKEHOLDERS EFFECTIVELY.PROFICIENT IN CRM SOFTWARE AND OTHER RELEVANT BUSINESS TOOLS.SELF-MOTIVATED, RESULTS-ORIENTED, AND ABLE TO WORK INDEPENDENTLY IN A FAST-PACED ENVIRONMENT.\nADDITIONAL REQUIREMENTS (MAY VARY):\nTRAVEL WILLINGNESSKNOWLEDGE OF SPECIFIC INDUSTRIES (E.G., IT, HEALTHCARE)\nBENEFITS:\nTHIS ROLE OFFERS A COMPETITIVE COMPENSATION PACKAGE, OPPORTUNITIES FOR PROFESSIONAL DEVELOPMENT, AND THE CHANCE TO BE PART OF A DYNAMIC AND GROWING COMPANY.\nWHY JOIN US?\nVDART IS A GLOBAL DIGITAL SOLUTIONS AND PROFESSIONAL SERVICES FIRM HEADQUARTERED IN ATLANTA, GA, USA, DELIVERING INNOVATIVE TECHNOLOGY SOLUTIONS, SPECIALIZED TALENT, SUPERIOR PERFORMANCE, AND SEAMLESS EXECUTION TO MEET CHALLENGING BUSINESS NEEDS OF CUSTOMERS WORLDWIDE INCLUDING USA, CANADA, MEXICO, BRAZIL, UK, JAPAN, AUSTRALIA & INDIA.\nWE ARE COMMITTED TO PROVIDING OUR CLIENTS WITH THE HIGHEST QUALITY OF SERVICE AND DELIVERING THE BEST TALENT FOR THEIR NEEDS. WE ARE ALSO A GREAT PLACE TO WORK, WITH A SUPPORTIVE AND COLLABORATIVE TEAM ENVIRONMENT. IF YOU ARE LOOKING FOR A CHALLENGING AND REWARDING CAREER OPPORTUNITY, WE ENCOURAGE YOU TO APPLY TODAY!\nVDART IS AN EQUAL OPPORTUNITY EMPLOYER AND VALUES DIVERSITY AT OUR COMPANY. WE DO NOT DISCRIMINATE BASED ON RACE, RELIGION, COLOR, NATIONAL ORIGIN, GENDER, SEXUAL ORIENTATION, AGE, MARITAL STATUS, VETERAN STATUS, OR DISABILITY STATUS. WE ALSO COMPLY WITH ALL APPLICABLE FEDERAL, STATE, AND LOCAL EQUAL EMPLOYMENT OPPORTUNITY LAWS AND REGULATIONS.",
    "job_skill_set": [
      "business development",
      "proposal development",
      "communication",
      "negotiation",
      "relationship building",
      "stakeholder management",
      "self-motivation",
      "results-oriented",
      "team collaboration",
      "MSP",
      "VMS",
      "CRM software",
      "market analysis",
      "competitive intelligence"
    ],
    "short_keywords": [
      "analysis",
      "building",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "competitive",
      "crm",
      "development",
      "intelligence",
      "management",
      "manager",
      "market",
      "msp",
      "negotiation",
      "proposal",
      "relationship",
      "resultsoriented",
      "selfmotivation",
      "software",
      "stakeholder",
      "team",
      "vms",
      "vmsmsp"
    ]
  },
  {
    "job_id": "3904357527",
    "job_title": "Business Development Specialist",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "GENERAL DESCRIPTION: THE BUSINESS DEVELOPMENT UNIT (BDU) SPECIALIST IS PRIMARILY RESPONSIBLE AND FOCUSED ON SUPPORTING PREMIER NATIONAL AGENCY RELATIONSHIPS (CLIENTS) AS DEVELOPED AND ASSIGNED BY SALES MANAGEMENT. THIS POSITION ALSO FOCUSES ON THE GROWING AND DEVELOPMENT OF NEW BUSINESS INITIATIVES, INCLUDING BUT NOT LIMITED TO PROVIDING TRANSACTIONAL, ADMINISTRATIVE AND TECHNICAL SUPPORT FOR PROCESSING. THE BDU SPECIALIST IS RESPONSIBLE FOR SUPPORTING BDU MANAGEMENT IN COMMUNITY EVALUATION, BOOK ROLL PROCESSING, NEW BUSINESS REVIEW, RELATIONSHIP DEVELOPMENT, TROUBLESHOOTING RATING DIFFERENCES, ERROR CORRECTION, TRANSACTIONAL SUPPORT AND PROCESSING AS INSTRUCTED AND WITHIN LEVEL OF AUTHORITY ASSIGNED. WILL ASSIST IN TEAM PROJECTS AS INSTRUCTED AND NECESSARY TO MAINTAIN A HIGH LEVEL OF QUALITY AND TIMELY BUSINESS DEVELOPMENT AND PRE-SALE SUPPORT TO TEAM MEMBER STANDARDS.  ESSENTIAL DUTIES AND RESPONSIBILITIES:  FOSTER RELATIONSHIPS WITH KEY STAKEHOLDERS BOTH INTERNALLY AND EXTERNALLY, ESPECIALLY WITH TARGETED NATIONAL ‘HIGH VOLUME’ PRODUCTION ACCOUNTS. READ, ANALYZE, FOLLOW PROCEDURES, AND MAINTAIN TRANSACTIONAL DOCUMENTATION.  SOLVE PRACTICAL PROBLEMS AND DEAL WITH A VARIETY OF VARIABLES, REFERRING TO SUPERVISOR IF NEEDED. REPORT DISCREPANCIES IN PROCEDURES AND POLICY DETAILS TO MANAGEMENT, AS NECESSARY.  MAINTAIN POSITIVE MARKET IMAGE AND FOCUS ACTION ON NEW BUSINESS CUSTOMER SATISFACTIONS. FOLLOW A VARIETY OF INSTRUCTIONS FURNISHED IN WRITTEN, ORAL, OR DIAGRAM FORM.  ACCEPT, ACKNOWLEDGE, AND PROCESS NEW BUSINESS AND RELATED ENDORSEMENTS AND DOCUMENTATION WITHIN LEVEL OF AUTHORITY DESIGNATED IN THE BDU. INDEX AND ROUTE BDU INBOUND DOCUMENTS, FAXES, EMAILS AND TRANSACTIONS INTO IMAGE SYSTEM. UNDERSTAND OVERALL DEPARTMENTAL SUPPORT OBJECTIVES AND MAINTAIN A WILLINGNESS TO EXECUTE BDU STRATEGIES TO ACHIEVE THESE GOALS WITHIN THE ROLE. PROVIDE SUPPORT AS NEEDED IN THE COMMUNITY ANALYSIS PROCESS.  SUPPORT AND MAINTAIN A STRONG WORKING RELATIONSHIP WITH HIGH PROFILE/HIGH PRODUCTION DISTRIBUTION PARTNERS TARGETED FOR LARGE-SCALE PRODUCTION. PROCESS, EFFECTIVELY AND ACCURATELY, TARGETED NEW BUSINESS PRODUCTION, BOOK ROLLS, AND SPECIALIZED NEW BUSINESS OPPORTUNITIES IN A HIGH-VOLUME ENVIRONMENT. PERFORM OTHER DUTIES AS ASSIGNED. SUPPLEMENTARY INFORMATION THIS JOB DESCRIPTION HAS BEEN PREPARED TO INDICATE THE GENERAL NATURE AND LEVEL OF THE WORK THAT EMPLOYEES PERFORM WITHIN THEIR CLASSIFICATION. THIS DESCRIPTION IS NOT AND CANNOT BE INTERPRETED AS AN INVENTORY OF ALL THE DUTIES, TASKS, RESPONSIBILITIES AND QUALIFICATIONS REQUIRED FOR THE EMPLOYEES ASSIGNED TO THIS JOB. EDUCATION AND / OR EXPERIENCE: HIGH SCHOOL DIPLOMA OR EQUIVALENT. SOME COLLEGE OR POST-SECONDARY TRAINING IN BUSINESS OPERATIONS OR INSURANCE IS PREFERRED. MINIMUM OF FIVE (5) YEARS OF RELATED EXPERIENCE AND/OR TRAINING. WORKING KNOWLEDGE OF GUIDEWIRE PLATFORM. MUST BE DETAIL-ORIENTED AND POSSESS GOOD INTERPERSONAL AND PROBLEM-SOLVING SKILLS. MUST BE FLEXIBLE AND ABLE TO ADAPT IN A CHANGING BUSINESS ENVIRONMENT.  MUST HAVE THE ABILITY TO KEYBOARD ENTER AT A SPEED OF NOT LESS THAN 50 WPM. BASIC KNOWLEDGE AND UNDERSTANDING OF MICROSOFT OFFICE SUITE. MUST BE WILLING TO WORK FLEXIBLE SCHEDULES TO SUPPORT MULTIPLE TIME ZONES. MUST BE WILLING TO TRAVEL FOR CLIENT MEETINGS OR TRAINING PURPOSES. MUST POSSESS STRONG COMMUNICATION, ORGANIZATIONAL AND TEAMWORK SKILLS. LICENSES AND / OR CERTIFICATIONS:  2-20 OR 440 LICENSES PREFERRED. ",
    "job_skill_set": [
      "business operations",
      "insurance knowledge",
      "Microsoft Office Suite",
      "transactional support",
      "data analysis",
      "communication",
      "teamwork",
      "problem-solving",
      "interpersonal skills",
      "flexibility",
      "organizational skills",
      "relationship development",
      "Guidewire platform",
      "keyboard entry (50 WPM)"
    ],
    "short_keywords": [
      "50",
      "analysis",
      "business",
      "businessdevelopment",
      "communication",
      "data",
      "development",
      "entry",
      "flexibility",
      "guidewire",
      "insurance",
      "interpersonal",
      "keyboard",
      "knowledge",
      "microsoft",
      "office",
      "operations",
      "organizational",
      "platform",
      "problemsolving",
      "relationship",
      "skills",
      "specialist",
      "suite",
      "support",
      "teamwork",
      "transactional",
      "wpm"
    ]
  },
  {
    "job_id": "3895204786",
    "job_title": "Business Development Executive (Delaware & Maryland)",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "THIS POSITION SERVES AS THE LEAD FIELD CONTACT FOR ASSIGNED AGENTS WITH OWNERSHIP FOR PROFITABLE GROWTH.\n\nYOU WILL REPORT TO THE DIRECTOR, REGIONAL SALES.\n\nPOSITION COMPENSATION RANGE\n\n$95,000.00 - $161,000.00\n\nPAY RATE TYPE\n\nSALARY\n\nCOMPENSATION MAY VARY BASED ON THE JOB LEVEL AND YOUR GEOGRAPHIC WORK LOCATION.\n\nPRIMARY ACCOUNTABILITIES\n\nPROSPECT AND APPOINT AGENTS WITH THE OVERALL REGIONAL STRATEGY FOR EXPANSION OF DISTRIBUTION OUTLETS.UTILIZE MARKET ANALYTICS TO ASSESS GEOGRAPHIC TERRITORY TO IDENTIFY PROSPECT AND CURRENT CUSTOMERS WITH HIGHEST GROWTH POTENTIAL.APPOINT NEW CUSTOMERS BASED ON BOOK TRANSFER.IDENTIFY VULNERABLE COMPETITORS WITHIN ASSIGNED AGENCY PLANT TO LEVERAGE BOOK ROLL AND OR BOOK THINNING OPPORTUNITIES.BUILD DETAILED BUSINESS PLANS FOR ASSIGNED AGENTS.DETERMINE APPROPRIATE VISITATION AND ESTABLISH AN AGREED TO CONTACT SCHEDULE FOR ASSIGNED AGENTS BASED UPON BOOK TRANSFER AND SIGNIFICANT FLOW OPPORTUNITIES.\n\nSPECIALIZED KNOWLEDGE & SKILLS REQUIREMENTS\n\n5+ YEARS OF EXPERIENCE WITH THE TERRITORY AND THE REGION INCLUDING AGENCY COMPETITOR DEMOGRAPHICS AND ECONOMIC TRENDS.ABILITY TO DEVELOP AND MAINTAIN STRONG WORKING RELATIONSHIPS AT ALL LEVELS.EXCELLENT WRITTEN, VERBAL AND INTERPERSONAL SKILLS.ABILITY TO NAVIGATE AN ORGANIZATION AND LEVERAGE RELATIONSHIPS.DEMONSTRATE RESILIENCY.STRONG KNOWLEDGE OF BUSINESS PROCESS IMPROVEMENT METHODOLOGIES AND TECHNIQUES.ABILITY TO MULTI-TASK AND PRIORITIZE AND WORK INDEPENDENTLY.\n\nLICENSES\n\nNOT APPLICABLE.\n\nTRAVEL REQUIREMENTS\n\nUP TO 40%.\n\nPHYSICAL REQUIREMENTS\n\nWORK THAT PRIMARILY INVOLVES SITTING/STANDING.\n\nWORKING CONDITIONS\n\nNOT APPLICABLE.\n\nTHIS IS A TERRITORY SALES ROLE. YOU WILL COVER FROM BALTIMORE, MD TO DOVER, DELAWARE. YOU WILL WORK FROM HOME AND IN THE FIELD.\n\nON OCCASION YOU MAY BE ASKED TO TRAVEL TO AN OFFICE LOCATION FOR IN PERSON ENGAGEMENT ACTIVITIES SUCH AS TEAM MEETINGS, TRAININGS, AND CULTURE EVENTS.\n\nWE ENCOURAGE YOU TO APPLY EVEN IF YOU DO NOT MEET ALL OF THE REQUIREMENTS LISTED ABOVE. SKILLS CAN BE USED IN MANY DIFFERENT WAYS, AND YOUR LIFE AND PROFESSIONAL EXPERIENCE MAY BE RELEVANT BEYOND WHAT A LIST OF REQUIREMENTS WILL CAPTURE. WE ENCOURAGE THOSE WHO ARE PASSIONATE ABOUT WHAT WE DO TO APPLY!\n\nWE PROVIDE BENEFITS THAT SUPPORT YOUR PHYSICAL, EMOTIONAL, AND FINANCIAL WELLBEING. YOU WILL HAVE ACCESS TO COMPREHENSIVE MEDICAL, DENTAL, VISION AND WELLBEING BENEFITS THAT ENABLE YOU TO TAKE CARE OF YOUR HEALTH. WE ALSO OFFER A COMPETITIVE 401(K) CONTRIBUTION, A PENSION PLAN, AN ANNUAL INCENTIVE, 9 PAID HOLIDAYS AND A PAID TIME OFF PROGRAM (23 DAYS ACCRUED ANNUALLY FOR FULL-TIME EMPLOYEES). IN ADDITION, OUR STUDENT LOAN REPAYMENT PROGRAM AND PAID-FAMILY LEAVE ARE AVAILABLE TO SUPPORT OUR EMPLOYEES AND THEIR FAMILIES. INTERNS AND CONTINGENT WORKERS ARE NOT ELIGIBLE FOR AMERICAN FAMILY INSURANCE GROUP BENEFITS.\n\nWE ARE AN EQUAL OPPORTUNITY EMPLOYER. IT IS OUR POLICY TO COMPLY WITH ALL APPLICABLE FEDERAL, STATE AND LOCAL LAWS PERTAINING TO NON-DISCRIMINATION, NON-HARASSMENT AND EQUAL OPPORTUNITY. WE ALSO CONSIDER QUALIFIED APPLICANTS WITH CRIMINAL HISTORIES, CONSISTENT WITH APPLICABLE FEDERAL, STATE AND LOCAL LAW.\n\n",
    "job_skill_set": [
      "business process improvement",
      "relationship management",
      "sales strategy development",
      "customer acquisition",
      "data analysis",
      "communication",
      "interpersonal skills",
      "resilience",
      "multi-tasking",
      "independence",
      "problem solving",
      "organizational skills",
      "market analytics",
      "territory management"
    ],
    "short_keywords": [
      "acquisition",
      "analysis",
      "analytics",
      "business",
      "businessdevelopment",
      "communication",
      "customer",
      "data",
      "delaware",
      "development",
      "executive",
      "improvement",
      "independence",
      "interpersonal",
      "management",
      "market",
      "maryland",
      "multitasking",
      "organizational",
      "problem",
      "process",
      "relationship",
      "resilience",
      "sales",
      "skills",
      "solving",
      "strategy",
      "territory"
    ]
  },
  {
    "job_id": "3903827844",
    "job_title": "Business Development Assistant - Grocery",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "GETTING THE RIGHT PRODUCTS AT THE RIGHT PRICE IN THE RIGHT STORE AT THE RIGHT TIME IS NO SMALL TASK. THAT'S WHAT OUR MERCHANDISING PARTNERS DO EVERY DAY. THEY BRING EXPERTISE IN PROCUREMENT, MERCHANDISING, CULINARY, ANALYSIS, PRICING, QUALITY ASSURANCE, DEMO PROGRAMMING, AND INVENTORY PLANNING.\n\nAS A BUSINESS DEVELOPMENT ASSISTANT I, YOU'LL REVIEW, PRIORITIZE, TRACK ACTIONS, AND RESOLVE COMPLEX ISSUES IN SUPPORT OF H-E-B BUSINESS DEVELOPMENT MANAGERS (BDMS) AND ASSIGNED CATEGORIES.\n\nONCE YOU'RE ELIGIBLE, YOU'LL BECOME AN OWNER IN THE COMPANY, SO WE'RE LOOKING FOR COMMITMENT, HARD WORK, AND FOCUS ON QUALITY AND CUSTOMER SERVICE. 'PARTNER-OWNED' MEANS OUR MOST IMPORTANT RESOURCES--PEOPLE--DRIVE THE INNOVATION, GROWTH, AND SUCCESS THAT MAKE H-E-B THE GREATEST OMNICHANNEL RETAILING COMPANY.\n\nDO YOU HAVE A:\n\nHEART FOR PEOPLE... COMMUNICATION, COLLABORATION, AND CUSTOMER SERVICE SKILLS?\n\nHEAD FOR BUSINESS... ABILITY TO RESEARCH AND RESOLVE MODERATELY COMPLEX ISSUES ON YOUR OWN?\n\nPASSION FOR RESULTS... CAPABILITY TO PERFORM MULTIPLE CONCURRENT TASKS IN A FAST-PACED, MANY-DEADLINE ENVIRONMENT?\n\nWE ARE LOOKING FOR:\n\n 0+ YEARS OF EXPERIENCE\n\nWHAT IS THE WORK?\n\nADMINISTRATION:\n\n SUPPORTS BDM ENSURES PRODUCTS ARE COMPETITIVELY PRICED, MEETING PRICE IMAGE AND FINANCIAL OBJECTIVES AS DIRECTED BY BDM EXECUTES CONSISTENT PRICING STRATEGY FOR BDM IN COMMUNICATION MATERIALS / BRANDING THROUGHOUT PRICING PROGRAMS, PROCESSES, POLICIES, AND OTHER H-E-B INITIATIVES MANAGES DATA ENTRY OF COST AND RETAIL RELATIONSHIPS TO SUPPORT MARKETING AND MERCHANDISING STRATEGIES USES EXISTING TEMPLATES AND PROCESSES TO TRACK CATEGORY PERFORMANCE AND RUN CATEGORY REPORTS IDENTIFIES / RESEARCHES / RESOLVES SIMPLE TO MODERATELY COMPLEX ISSUES WITH MINIMAL BDM INVOLVEMENT REPRESENTS BDM IN MEETINGS (E.G., NOTE TAKING, PRESENTING UPDATES, CLARIFYING, NOTIFYING BDM OF PRIORITY ACTION STEPS) CREATES PROMOTIONAL PRODUCT SURVEYS IN TOOL FOR PROMOTIONAL EVENTS (E.G., FORECASTING, STORE ALLOCATION) EXECUTES PROMOTIONAL EVENT TASKS (E.G., COUPONS, SUPPORT FOR COMPANY SELLING INITIATIVES) PERFORMS POST-PROMOTION ANALYSIS AND EXPENSE TRACKING EXECUTES BROKER FUNCTIONS WHEN NO BROKER EXISTS (E.G., SECURING PRODUCT SAMPLES) COORDINATES TEST SETS DRAFTS COMMUNICATIONS / PRESENTATIONS SOLVES MINOR PROCESS PROBLEMS; IMPLEMENTS SOLUTIONS TO ROUTINE ISSUES APPROVES / REVIEWS / TRACKS VENDOR COST CHANGE SUBMISSIONS SUPPORTS SUPPLIER COMMUNICATION MANAGES NEW VENDOR / NEW ITEM SET UP REVIEW, APPROVAL SUPPORTS STORE REQUESTS MANAGES NEW ITEM SUBMISSION AND SET UP PROCESS AFTER ITEMS ARE SELECTED BY BDM, INCLUDING ECOMMERCE ASSISTS IN PLANNING / MONITORING / MAINTAINING SUITABLE INVENTORY LEVELS PERFORMS BASIC ANALYSIS FOR SUPPLIER NEGOTIATION\n\nWHAT IS YOUR BACKGROUND?\n\n A RELATED DEGREE OR COMPARABLE FORMAL TRAINING, CERTIFICATION, OR WORK EXPERIENCE 0+ YEARS OF EXPERIENCE EXPERIENCE IN BUSINESS, MERCHANDISING / PROCUREMENT, OR STORE OPERATIONS EXPERIENCE IN MERCHANDISING SOFTWARE SYSTEMS (A PLUS)\n\nDO YOU HAVE WHAT IT TAKES TO BE A FIT AS AN H-E-B BDA I?\n\n KNOWLEDGE OF COMPUTER USE, AND SOFTWARE PROGRAMS REQUIRED BY THE JOB INCLUDING ECOMMERCE, BI UNDERSTANDING OF PRODUCT INFORMATION DATA FLOW (ITEM, VENDOR, COST, PRICE) STRONG VERBAL / WRITTEN COMMUNICATION SKILLS STRONG INTERPERSONAL SKILLS STRONG ORGANIZATION AND TIME MANAGEMENT SKILLS STRONG PC SKILLS, INCLUDING PROFICIENCY IN MS EXCEL ABILITY TO WORK COHESIVELY ON INTERNAL / EXTERNAL CONTACTS ABILITY TO WORK ON CROSS-FUNCTIONAL TEAMS ABILITY TO MANAGE MULTIPLE PRIORITIES AND SHIFT FOCUS BETWEEN PROJECTS / TASKS UNDER PRESSURE ABILITY AND WILLINGNESS TO LEARN / ADAPT TO / USE NEW SYSTEMS AND PROCESSES ABILITY TO MAKE GOOD DECISIONS ABILITY TO COMPREHEND PRODUCT INFORMATION DATA FLOW (ITEM, VENDOR, COST, PRICE) AND GUIDE VENDORS THROUGH H- E-B PROCESSES AND POLICIES CUSTOMER SERVICE-ORIENTED\n\nCAN YOU...\n\n FUNCTION IN A FAST-PACED, RETAIL, OFFICE ENVIRONMENT TRAVEL BY CAR OR PLANE WITH OVERNIGHT STAYS WORK EXTENDED HOURS; SIT FOR EXTENDED PERIODS REGULARLY LIFT 20 LBS OR MORE\n\n05-2023",
    "job_skill_set": [
      "vendor negotiation",
      "communication",
      "customer service",
      "collaboration",
      "organization",
      "time management",
      "problem solving",
      "adaptability",
      "decision making",
      "interpersonal skills",
      "ability to work under pressure",
      "ability to manage multiple priorities",
      "data entry",
      "merchandising software systems",
      "MS Excel",
      "eCommerce",
      "basic analysis",
      "product information data flow"
    ],
    "short_keywords": [
      "ability",
      "adaptability",
      "analysis",
      "assistant",
      "basic",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "customer",
      "data",
      "decision",
      "development",
      "ecommerce",
      "entry",
      "excel",
      "flow",
      "grocery",
      "information",
      "interpersonal",
      "making",
      "manage",
      "management",
      "merchandising",
      "ms",
      "multiple",
      "negotiation",
      "organization",
      "pressure",
      "priorities",
      "problem",
      "product",
      "service",
      "skills",
      "software",
      "solving",
      "systems",
      "time",
      "to",
      "under",
      "vendor",
      "work"
    ]
  },
  {
    "job_id": "3900965147",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "THE NUC IOT BUSINESS DEVELOPMENT MANAGER WILL BE RESPONSIBLE FOR IDENTIFYING AND PURSUING NEW OPPORTUNITIES, BUILDING AND MAINTAINING CUSTOMER AND PARTNER RELATIONSHIPS, AND DEVELOPING STRATEGIES TO GROW OUR NUC IOT FOOTPRINT ACROSS RELEVANT VERTICALS. THE ASUS NUC PRODUCT PORTFOLIO INCLUDES NUC MINI PCS, CONFIGURABLE KITS, AND SYSTEM BOARDS FOR EDGE SOLUTIONS FOCUSED ON RETAIL, BANKING, HOSPITALITY, CITIES, TRANSPORTATION, HEALTHCARE, FEDERAL, AND INDUSTRIAL USAGES.  IN THIS ROLE, YOU WILL EDUCATE PARTNERS ON THE NUC PRODUCT PORTFOLIO AND WORK CLOSELY WITH THE LOCAL ASUS IOT SALES AND PARTNERS TO GROW THEIR BUSINESS WITH THE NUC SYSTEMS AND SOLUTIONS. YOU WILL HAVE THE OPPORTUNITY TO DIRECTLY INFLUENCE FUTURE NUC PRODUCT DEFINITIONS AND ECOSYSTEM ENGAGEMENT THROUGH FEEDBACK AND INSIGHTS FROM CUSTOMERS AND THE MARKET. AS PART OF DRIVING THE OVERALL NUC IOT AMERICAS SALES AND MARKETING STRATEGY, THIS ROLE WILL ALSO REQUIRE UNDERSTANDING OF KEY TARGETED VERTICALS INCLUDING RETAIL, DIGITAL SIGNAGE, HOSPITALITY, FEDERAL, AND INDUSTRIAL APPLICATIONS. THE QUALIFIED CANDIDATE MUST BE ENERGETIC, WELL-SPOKEN AND EAGER TO CLOSE SALES. ESSENTIAL DUTIES AND RESPONSIBILITIES:IDENTIFYING, QUALIFYING, AND SECURING BUSINESS OPPORTUNITIES: COORDINATING BUSINESS GENERATION ACTIVITIES; DEVELOPING CUSTOMIZED TARGETED SALES STRATEGIESBUILDING BUSINESS RELATIONSHIPS WITH CURRENT AND POTENTIAL CLIENTS INCLUDING DISTRIBUTORS, RESELLERS, ISVS, CSPS, AND SOLUTIONS INTEGRATORSUNDERSTANDING CLIENT NEEDS AND OFFERING SOLUTIONS, INCLUDING RESPONDING TO CLIENT PROPOSALS AND DRIVING FOLLOW-UP CALLS TO ANSWER POTENTIAL QUESTIONSCOLLABORATING WITH MANAGEMENT ON SALES GOALS, PLANNING, AND FORECASTINGDEVELOP AND MANAGE DEAL OPPORTUNITY PIPELINE TO BRING NUC BASED EDGE SOLUTIONS TO MARKET. INCLUDING MAINTAIN UP-TO-DATE STATUS ON OPPORTUNITIES PIPELINE DRIVEN BY ASUS SALES, AND PROVIDING NUC PRODUCT SPECIFIC INSIGHTS TO WIN THE OPPORTUNITY.CREATING INFORMATIVE PRESENTATIONS FOR TRAINING OF SALES PARTNERS AND CUSTOMERS, AS WELL AS DELIVERY AT INDUSTRY EXHIBITS, TRADE SHOWS, AND CONFERENCESACT AS THE REGIONAL NUC PORTFOLIO SUBJECT MATTER EXPERT FOR IOT IN THE AMERICAS, CREATIVELY ALIGNING OPTIMUM PRODUCTS WITH CUSTOMER NEEDS; MAINTAINING KNOWLEDGE OF RELATED PRODUCT AND SERVICE OFFERINGS.UNDERSTAND CATEGORY-SPECIFIC LANDSCAPES AND TRENDS, IDENTIFYING MARKET REQUIREMENTS AND REPRESENTING THESE TO NUC BUSINESS UNIT TO SHAPE FUTURE PRODUCT DEFINITION.IDENTIFY IOT MARKET TRENDS AND WORK WITH INDUSTRY PARTNERS TO EVALUATE POTENTIAL OPPORTUNITIES WITH CURRENT OR UPCOMING PRODUCTS.MAINTAIN CONTACT WITH OTHER IOT BDMS TO IDENTIFY HOW THE NUC PRODUCTS ARE BEING USED IN OTHER MARKETS TO BRING THOSE EXAMPLES TO OUR CUSTOMER ENGAGEMENTSMAINTAIN GOOD ATTENDANCE AND PUNCTUALITY\nKNOWLEDGE AND SKILLS:HAVE WORK EXPERIENCE AND STRONG UNDERSTANDING OF EMBEDDED/EDGE CHANNEL ROUTES TO MARKET, IOT MARKET TRENDS, TECHNOLOGIES, AND APPLICATIONS.A PROVEN TRACK RECORD OF GENERATING LEADS, CLOSING DEALS, AND MEETING OR EXCEEDING SALES GOALSABILITY TO COMMUNICATE, PRESENT AND INFLUENCE AT MULTIPLE LEVELS OF THE ORGANIZATION AND PARTNERSPROVEN ABILITY TO DRIVE THE SALES PROCESS FROM PLAN TO CLOSEPROVEN ABILITY TO ARTICULATE THE DISTINCT ASPECTS OF PRODUCTS AND SERVICESPROVEN ABILITY TO POSITION PRODUCTS AGAINST COMPETITORSEXCELLENT LISTENING, NEGOTIATION AND PRESENTATION SKILLSABILITY TO WORK CONFIDENTLY IN A RAPIDLY CHANGING, FAST-PACED AND RESULTS-ORIENTED CORPORATE ENVIRONMENT WHERE A HIGH DEGREE OF FLEXIBILITY IS REQUIREDPROVEN ABILITY TO COLLABORATE AND WORK WITH OTHER TEAMMATESEXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLS IN ENGLISH REQUIRED QUALIFICATIONS:YEARS OF EDUCATIONA BACHELOR’S DEGREE IN BUSINESS, ENGINEERING, OR RELATED FIELD\nWORK EXPERIENCE5+ YEARS OF EXPERIENCE IN BUSINESS DEVELOPMENT AND/OR COMMERCIAL (SI/VAR) SALES, OR MARKETING IN THE INTERNET OF THINGS DOMAIN WORKING CONDITIONS:ABILITY TO TRAVEL (NORTH AMERICA REGION), THIS MAY INVOLVE ON-SITE CUSTOMER VISITS, TRADE SHOWS, AND ASSIGNED TASKS. TRAVEL 30% OF THE TIME, WITH POTENTIAL FOR INTERNATIONAL TRAVEL (CANADA, TAIWAN).REQUIRES SITTING, OPERATING A COMPUTER KEYBOARD, TELEPHONE AND OTHER OFFICE EQUIPMENT FOR EXTENDED PERIODS OF TIMEMEET FACE TO FACE WITH LOCAL ASUS TEAM TO COLLABORATE AS NEEDED.WORK REMOTE OR HYBRID IN OFFICE IF NEAR ASUS OFFICE LOCATION.",
    "job_skill_set": [
      "business development",
      "sales strategies",
      "lead generation",
      "negotiation",
      "presentation skills",
      "customer relationship management",
      "market analysis",
      "communication",
      "team collaboration",
      "problem solving",
      "flexibility",
      "influence",
      "listening",
      "adaptability",
      "time management",
      "customer focus",
      "creativity",
      "IOT market trends",
      "embedded/edge technologies",
      "pipeline management"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "creativity",
      "customer",
      "development",
      "embeddededge",
      "flexibility",
      "focus",
      "generation",
      "influence",
      "iot",
      "lead",
      "listening",
      "management",
      "manager",
      "market",
      "negotiation",
      "pipeline",
      "presentation",
      "problem",
      "relationship",
      "sales",
      "skills",
      "solving",
      "strategies",
      "team",
      "technologies",
      "time",
      "trends"
    ]
  },
  {
    "job_id": "3903476451",
    "job_title": "Manager, Business Development and Accounts (PR Agency)",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ARE YOU WORKING FOR A LARGER FIRM AND LIKE THE IDEA OF IMMEDIATELY HELPING TO FUEL A SMALLER FIRM’S GROWTH? DO YOU ALREADY WORK FOR A SMALL OR MID-SIZED FIRM BUT DON’T FEEL FULFILLED BY THE BUSINESS YOU’RE PURSUING? ARE YOU SEARCHING FOR A FIRM WITH A DEEP COMMITMENT TO PURPOSE AND POSITIVE IMPACT IN BOTH CLIENT WORK AND HOW THE FIRM OPERATES?\nIF YOU ANSWERED YES TO ANY OF THE ABOVE QUESTIONS, TAFT MAY BE THE PLACE FOR YOU.\nTAFT COMMUNICATIONS IS A BOUTIQUE COMMUNICATIONS CONSULTANCY FOCUSED ON PURPOSE AND IMPACT THAT IS PART OF THE GLOBAL PROI NETWORK. WE APPLY OUR DEEP COMMUNICATIONS EXPERIENCE AND PASSION FOR MAKING A DIFFERENCE TO HELP CLIENTS BETTER ARTICULATE THEIR CORE PURPOSE AND ENERGIZE HOW THEY ENGAGE EMPLOYEES, DRIVE SOCIAL IMPACT, STRENGTHEN DEI, COMMIT TO SUSTAINABILITY, AND PROMOTE BETTER HEALTH. OUR CLIENTS – MANY IN THE HEALTH AND CLEAN ENERGY SPACE -- ARE BOTH CORPORATE AND NONPROFIT AND BASED THROUGHOUT THE US AND BEYOND. IN TAFT, YOU’LL FIND A VALUES-BASED FIRM THAT HAS MORE THAN TRIPLED IN SIZE OVER THE LAST DECADE AND IS COMMITTED TO SUSTAINABLE GROWTH FOR YEARS TO COME.\nTAFT IS LOOKING FOR A RISING AND ENERGETIC “BUILDER” WITH A DESIRE TO SHARE OUR FOCUS, A FIRE TO HELP US GROW OUR BUSINESS, AND THE CONFIDENCE TO HELP TELL OUR STORY BEFORE ANY AUDIENCE.\nOUR MANAGER, BUSINESS DEVELOPMENT AND ACCOUNTS WILL PRIMARILY FOCUS ON MANAGING OUR EFFORTS TO SECURE NEW OPPORTUNITIES FOR THE FIRM, IN COLLABORATION WITH SENIOR FOCUS AREA LEADS. THIS POSITION IS PERFECT FOR A COMMUNICATIONS PROFESSIONAL WHO WANTS TO ACCUMULATE BROAD-BASED EXPERIENCE AS THEY NAVIGATE A PATH TO AGENCY LEADERSHIP.\nMORE SPECIFICALLY, THE MANAGER WILL:\n· MANAGE OUR BUSINESS DEVELOPMENT COMMITTEE BASED ON CEO DIRECTION, REMOVING ROADBLOCKS AND IMPROVING COLLABORATION· DRIVE PROPOSAL PROCESS FOR KEY OPPORTUNITIES, INCLUDING UPDATING BD TOOLKIT AND MANAGING CUSTOMIZED PROPOSAL AND PRESENTATION DEVELOPMENT, WITH SUPPORT OF OTHER TEAM MEMBERS, DESIGN RESOURCES AND PROJECT COORDINATOR· CONDUCT TARGETED DIRECT OUTREACH TO SECURE TAFT INTRODUCTORY MEETINGS AND INVITATIONS FOR TAFT TO BID ON NEW BUSINESS· REGULARLY UPDATE TAFT CRM, ENSURE WE TRACK PROGRESS AGAINST KEY METRICS, AND FOLLOW UP REGULARLY WITH TEAM MEMBERS AND PROSPECTS TO HELP WIN NEW BUSINESS· PARTICIPATE IN CLIENT ONBOARDING PROCESS TO PREPARE NEW CLIENTS FOR FULL TRANSITION TO ACCOUNT TEAMS.· COORDINATE AND PROJECT MANAGE PLANNING AND ACTIVITIES OF MARKETING COMMITTEE·CONTRIBUTE TO CREATIVE CONTENT FOR TAFT MARKETING ACTIVITIES INCLUDING WEBSITES, VIDEO, DIGITAL ADVERTISING, AND SOCIAL MEDIA· LIAISE WITH PARTNER AGENCIES AND VENDORS WHO CAN STRENGTHEN THE TAFT OFFERINGS AND/OR PROVIDE REFERRAL BUSINESS· FOCUS ON PROJECT MANAGEMENT OR ACCOUNT SERVICES (POTENTIALLY INCLUDING MEDIA RELATIONS OR DIGITAL/SOCIAL SUPPORT) FOR A LIMITED NUMBER OF AGENCY CLIENTS\nTHE SUCCESSFUL CANDIDATE SHOULD HAVE:\n· MINIMUM OF 5 YEARS OF EXPERIENCE IN MEDIA RELATIONS, JOURNALISM, PUBLIC RELATIONS, PUBLIC AFFAIRS OR RELATED MARKETING FIELD. PR AGENCY EXPERIENCE REQUIRED.\n·EXPERIENCE WORKING WITH HEALTH/LIFE SCIENCES, EDUCATION OR RENEWABLE ENERGY/ENVIRONMENTAL COMPANIES (OR CLIENTS) IS PREFERRED.\n·FAMILIARITY WITH DIFFERENT TYPES OF PROJECTS AND DELIVERABLES, INCLUDING BUT NOT LIMITED TO COMMUNICATIONS STRATEGY, CREATIVE CONCEPTING, VIDEO, DIGITAL, AND VENDOR MANAGEMENT. PROJECT MANAGEMENT CERTIFICATE (PMP) IS A PLUS.\n· EXCELLENT ORGANIZATIONAL SKILLS TO CLOSELY MANAGE THE FIRM’S BUSINESS DEVELOPMENT ACTIVITIES.\n· A SENSE OF HUMOR AND DESIRE TO WORK WITH A TIGHT-KNIT TEAM\n· AN AUTHENTIC INTEREST IN OUR PURPOSE-FOCUSED WORK AND MAKING A POSITIVE IMPACT ON THE WORLD\nSALARY RANGE:$65,000 - $91,000 PLUS INCENTIVES WHAT TAFT OFFERS:· THE CHANCE TO MAKE A QUICK IMPACT ON A GROWING FIRM· A COMPETITIVE COMP PACKAGE – INCLUDING BOTH BASE SALARY AND SIGNIFICANT SUCCESS-BASED INCENTIVES – AS WELL AS OPPORTUNITY TO ADVANCE· LOTS OF FLEXIBILITY: OUR MAIN OFFICE IS IN TRENTON, NJ, AND THE POSITION WILL BE REQUIRED TO BE AT THE OFFICE TWO DAYS PER WEEK AS OF JANUARY 2024. THE POSITION WILL INVOLVE OCCASIONAL TRAVEL, PRIMARILY IN THE TRI-STATE REGION· A FULL BENEFITS PACKAGE, INCLUDING GENEROUS PTO, MEDICAL, DENTAL, AND 401K· A SMART, FUN, AND VALUES-BASED TEAM· A DEEP COMMITMENT TO JUSTICE, EQUITY, DIVERSITY AND INCLUSION WITHIN OUR OWN FIRM AND IN HOW WE USE COMMUNICATIONS TO STRENGTHEN OUR CLIENTS.\n WHAT WE OFFER:\n· COMPETITIVE SALARY· HEALTH AND DENTAL INSURANCE, PRESCRIPTION DRUG PLAN, VISION DISCOUNT PLAN· 401K PLAN WITH EMPLOYER MATCH· GENEROUS PAID FAMILY LEAVE· 16 DAYS' PTO· SUMMER FRIDAYS AND FLEXIBLE HOURS· WORK-FROM-HOME OPTION· ANNUAL BONUSES BASED ON COMPANY PROFITABILITY AND INDIVIDUAL PERFORMANCE· TEAM-BUILDING ACTIVITIES· PROFESSIONAL DEVELOPMENT· BUSINESS CASUAL DRESS CODE· EMPLOYEE ASSISTANCE PROGRAM· HOLIDAY CELEBRATIONS· EMPLOYEE REFERRAL PROGRAM· NEW BUSINESS SUCCESS PROGRAM\nPLEASE EMAIL YOUR COVER LETTER AND RESUME TO CAREERS@TAFTCOMMUNICATIONS.COM.  NO PHONE CALLS PLEASE.\nTAFT COMMUNICATIONS LLC IS AN EQUAL OPPORTUNITY EMPLOYER",
    "job_skill_set": [
      "business development",
      "project management",
      "digital marketing",
      "vendor management",
      "teamwork",
      "communication",
      "organizational skills",
      "problem solving",
      "adaptability",
      "relationship building",
      "media relations",
      "public relations",
      "CRM management",
      "proposal development",
      "communications strategy",
      "creative content development",
      "health/life sciences knowledge",
      "education sector knowledge",
      "renewable energy knowledge",
      "PMP certification",
      "sense of humor",
      "passion for purpose-driven work"
    ],
    "short_keywords": [
      "accounts",
      "adaptability",
      "agency",
      "and",
      "building",
      "business",
      "businessdevelopment",
      "certification",
      "communication",
      "communications",
      "content",
      "creative",
      "crm",
      "development",
      "digital",
      "education",
      "energy",
      "for",
      "healthlife",
      "humor",
      "knowledge",
      "management",
      "manager",
      "marketing",
      "media",
      "of",
      "organizational",
      "passion",
      "pmp",
      "pr",
      "problem",
      "project",
      "proposal",
      "public",
      "purposedriven",
      "relations",
      "relationship",
      "renewable",
      "sciences",
      "sector",
      "sense",
      "skills",
      "solving",
      "strategy",
      "teamwork",
      "vendor",
      "work"
    ]
  },
  {
    "job_id": "3900077978",
    "job_title": "Business Development Associate",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "OWN IS THE LEADING DATA PLATFORM TRUSTED BY THOUSANDS OF ORGANIZATIONS TO PROTECT AND ACTIVATE SAAS DATA TO TRANSFORM THEIR BUSINESSES. OWN EMPOWERS CUSTOMERS TO ENSURE THE AVAILABILITY, SECURITY AND COMPLIANCE OF MISSION-CRITICAL DATA, WHILE UNLOCKING NEW WAYS TO GAIN DEEPER INSIGHTS FASTER. BY PARTNERING WITH SOME OF THE WORLD’S LARGEST SAAS ECOSYSTEMS SUCH AS SALESFORCE, SERVICENOW AND MICROSOFT DYNAMICS 365, OWN ENABLES CUSTOMERS AROUND THE WORLD TO TRULY OWN THE DATA THAT POWERS THEIR BUSINESS.\n\nIT’S THEIR PLATFORM. IT’S YOUR DATA. OWN IT.\n\nTHE JOB\n\nOWN IS LOOKING FOR A PASSIONATE, DEDICATED, AND HIGHLY MOTIVATED BUSINESS DEVELOPMENT ASSOCIATE TO JOIN OUR ELITE BUSINESS DEVELOPMENT TEAM.\n\nAS PART OF THE BUSINESS DEVELOPMENT TEAM, THIS ROLE WILL OFFER HANDS-ON EXPERIENCE AND SKILLS ESSENTIAL FOR WORKING IN THE SALES DOMAIN. YOU SERVE AS THE INITIAL CONTACT FOR PROSPECTIVE CUSTOMERS INQUIRING ABOUT OUR DATA SOLUTIONS. YOUR RESPONSIBILITIES INCLUDE IDENTIFYING AND ASSESSING LEADS GENERATED THROUGH INBOUND CHANNELS, PLAYING A PIVOTAL ROLE IN FOSTERING BUSINESS GROWTH. THIS ENTRY-LEVEL ROLE PROVIDES A CHANCE TO BUILD FUNDAMENTAL SKILLS IN BUSINESS DEVELOPMENT WITHIN A DYNAMIC AND INNOVATIVE SETTING.\n\nAS YOU PROGRESS IN THE BUSINESS DEVELOPMENT ASSOCIATE ROLE, WE'RE DEDICATED TO ASSISTING YOU IN SHAPING YOUR LONG-TERM CAREER PATH AT OWN. YOU WILL HAVE THE OPPORTUNITY TO GAIN EXPOSURE TO VARIOUS BUSINESS FUNCTIONS THROUGHOUT YOUR JOURNEY WITH US.\n\nAS PART OF OWN COMPANY'S SUMMER 2024 EMERGING TALENT PROGRAM, THE START DATE FOR THIS ROLE WILL BE JUNE 3RD, 2024. WE AT OWN PRIORITIZE A LEARNING ENVIRONMENT, AND THROUGH OUR EMERGING TALENT PROGRAM WILL BE OFFERING EARLY CAREER HIRES A COMPREHENSIVE DEVELOPMENT PROGRAM. THROUGH LUNCH AND LEARNS, WORKSHOPS AND EVENTS FEATURING INTERNAL AND EXTERNAL SPEAKERS, NEW HIRES WILL ENHANCE THEIR UNDERSTANDING OF THE SAAS INDUSTRY WHILE REFINING COMMUNICATION, PRESENTATION, AND LEADERSHIP SKILLS.\n\nYOUR DAY-TO-DAY ROLE\n\nHANDLE LEADS FROM VARIOUS MARKETING CHANNELS (CHAT, EMAIL, PHONE, SOCIAL MEDIA)WORK WITHIN A PROCESS-DRIVEN FRAMEWORK THAT DRIVES CAMPAIGN ACCOUNTABILITYRESEARCH AND ENRICH LEAD DATA TO UNDERSTAND PROSPECTS’ NEEDS, EVALUATE OWN’S IMPACT, AND ASSESS THE OPPORTUNITY SCALEQUALIFY MARKETING QUALIFIED LEADS (MQLS) TO SECURE MEETINGS FOR GLOBAL ACCOUNT EXECUTIVES AND ALLIANCES MANAGERSCOLLABORATE WITH FELLOW BDA TO ENSURE TIMELY RESPONSES TO HOT AND WARM LEADSCONTINUOUSLY DEVELOP PRODUCT AND INDUSTRY KNOWLEDGE THROUGH BOTH CLASS-BASED AND SELF-PACED TRAINING AND ENABLEMENTDEMONSTRATE MATURITY IN INTERACTIONS WITH CONSULTANCIES, PARTNERS, AND WHEN MAKING INTRODUCTIONSPERSONALIZE COMMUNICATIONS FOR HIGH-VALUE LEADSSUSTAIN ACTIVE ENGAGEMENT WITH PROSPECTS THROUGH PERSISTENT OUTREACHPROVIDE FEEDBACK FOR CONTINUAL IMPROVEMENT OF YOUR FUNNEL AND PERFORMANCE\n\n\n\nYOUR WORK EXPERIENCE\n\nBACHELOR'S DEGREE PREFERREDCOLLABORATIVE TEAM PLAYERQUICK LEARNER IN A FAST-PACED INDUSTRYPASSIONATE COMMITMENT TO ACHIEVING SALES EXCELLENCEHIGH ENERGY AND ENTHUSIASMEXCELLENT COMMUNICATION AND INTERPERSONAL SKILLSEFFECTIVE MULTITASKING ABILITYSTRONG ORGANIZATIONAL AND FOLLOW-UP SKILLS\n\n\n\nIMPORTANT DETAILS\n\nTHIS IS A FULL-TIME POSITION. THE IDEAL CANDIDATE WILL WORK OUT OF OUR ENGLEWOOD CLIFFS, NJ OFFICE A MINIMUM OF 3 DAYS PER WEEK TO MAXIMIZE COLLABORATION AND INTERACTION WITH THE BUSINESS. TRAVEL MAY BE REQUIRED.\n\nOWN IS DEDICATED TO CREATING AN ENVIRONMENT WHERE EMPLOYEES THRIVE, WHICH IS WHY BASE PAY IS ONLY ONE PART OF THE TOTAL COMPENSATION PACKAGE THAT IS PROVIDED TO COMPENSATE AND RECOGNIZE EMPLOYEES FOR THEIR WORK. THIS ROLE MAY ALSO BE ELIGIBLE FOR UNLIMITED PTO, GENEROUS MEDICAL BENEFITS, A 401(K) SAVINGS PLAN WITH A 4% EMPLOYER MATCH, DISCRETIONARY BONUSES/INCENTIVES, AND STOCK OPTIONS. WE ALSO OFFER CATERED LUNCHES IN THE OFFICE FIVE DAYS A WEEK, A FULL FITNESS CENTER, AND FREE SHUTTLE BUS SERVICE TO AND FROM NEW YORK CITY.\n\nCREATING AN ENVIRONMENT WHERE EMPLOYEES THRIVE ALSO MEANS MAKING SURE EVERY EMPLOYEE FEELS ACCEPTED. AS WE SCALE TO HELP ALL TYPES OF COMPANIES PROTECT PRECIOUS DATA, OUR TEAM MUST REFLECT THE DIVERSITY WE SERVE. OWN IS AN EQUAL OPPORTUNITY EMPLOYER AND WE BELIEVE THAT EVERY EMPLOYEE IN THE COMPANY BRINGS A UNIQUE PERSPECTIVE THAT THEY CAN AND SHOULD CONTRIBUTE IN ORDER TO MAKE AN IMPACT EVERY DAY. WE STRIVE TO BE ONE TEAM AND ONE CULTURE THAT BUILDS TRUST THROUGH TRANSPARENCY. WE DO NOT DISCRIMINATE BASED ON RACE, COLOUR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, AGE, NATIONAL ORIGIN, PROTECTED VETERAN STATUS OR DISABILITY STATUS.\n\nLEARN MORE AT OWNDATA.COM.\n\n",
    "job_skill_set": [
      "lead generation",
      "data analysis",
      "sales techniques",
      "market research",
      "communication tools",
      "team collaboration",
      "adaptability",
      "problem solving",
      "time management",
      "interpersonal skills",
      "customer engagement",
      "CRM software",
      "presentation skills",
      "enthusiasm"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "associate",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "crm",
      "customer",
      "data",
      "development",
      "engagement",
      "enthusiasm",
      "generation",
      "interpersonal",
      "lead",
      "management",
      "market",
      "presentation",
      "problem",
      "research",
      "sales",
      "skills",
      "software",
      "solving",
      "team",
      "techniques",
      "time",
      "tools"
    ]
  },
  {
    "job_id": "3906222550",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "DESCRIPTION\n\nIMRE IS A FIERCELY INDEPENDENT MARKETING AGENCY THAT CREATES PURPOSE DRIVEN IDEAS THAT WORK. WE ARE A PASSIONATE TEAM OF CREATORS HARNESSING THE TWIN POWERS OF OPTIMISM AND EMPATHY TO TURN PATIENTS AND HEALTHCARE PROVIDERS INTO BRAND BELIEVERS. WE ARE ONE OF THE FASTEST GROWING AND MOST EXCITING AGENCIES WORKING IN PHARMACEUTICAL MARKETING TODAY, AND WE’RE LOOKING TO ADD A BUSINESS DEVELOPMENT MANAGER TO OUR TEAM OF EXPERTS.\n\nJOB DUTIES / RESPONSIBILITIES:\n\nIDENTIFY AND MAINTAIN A ROBUST AND QUALIFIED DATABASE OF PROSPECTIVE CLIENTS USING THE AGENCY’S CRM AND BUSINESS INTELLIGENCE TOOLCONDUCT OUTREACH TO DRIVE LEADS FOR THE AGENCY AMONG ITS KEY PROSPECTIVE CLIENT CATEGORIES SECURE INTRODUCTORY AND CAPABILITIES CALLS WITH KEY PROSPECTS AND, IDEALLY, INVITATIONS TO PITCH AND WIN WORKTRACK, MONITOR AND REPORT ON ACCOUNTS EXPECTED TO GO INTO REVIEW, SEEKING A NEW PARTNER AND INDUSTRY MOVEMENT OF PROSPECTIVE CLIENTSCOLLABORATE WITH THE AGENCY MARKETING TEAM TO RECOMMEND AND REVIEW AGENCY CONTENT INTENDED TO EXCITE AND IGNITE CONVERSATIONS WITH PROSPECTIVE CLIENTSLEVERAGE AGENCY CLIENT NEWS, CAMPAIGNS, CASE STUDIES AND OTHER FORMS OF THOUGHT LEADERSHIP TO ENSURE IMRE REMAINS TOP OF MIND FOR OUR PROSPECT LISTEFFECTIVELY USE OUR BUSINESS INTELLIGENCE TOOLS TO MONITOR INDUSTRY NEWS AND DEVELOP OUTREACH ACCORDINGLYATTEND AND SUPPORT INDUSTRY NETWORKING EVENTSMAINTAIN THE AGENCY’S EVENT, CONFERENCE AND AWARDS CALENDARS. ASSISTING WITH THE CONFERENCE APPROVAL PROCESS FOR INTERNAL TEAMS AND MAINTAINING EVENT LOGISTICS AND OUTPUTS SUCH AS SOCIAL POSTS, POVS, TABLES, GUEST LIST, ETC.TRAVEL DOMESTICALLY (10-15%) \nKNOWLEDGE & SKILLS:\n\nBACHELOR'S DEGREE IN MARKETING OR RELATED FIELD5+ YEARS' EXPERIENCE IN AN AGENCY OR PROFESSIONAL SERVICES FIRM ENVIRONMENTSTRONG ORGANIZATION SKILLS AND ATTENTION TO DETAIL ABILITY TO MANAGE SIMULTANEOUS PROJECTS STRONG WRITTEN, VERBAL AND EDITORIAL REVIEW ABILITIES PROFICIENT IN MICROSOFT WORD, EXCEL, AND POWERPOINT ABILITY TO WORK WITH A WIDE RANGE OF PEOPLE AT THE MOST SENIOR LEVEL \nIMRE IS AN EQUAL EMPLOYMENT OPPORTUNITY EMPLOYER. EMPLOYMENT DECISIONS ARE BASED ON MERIT, QUALIFICATIONS, ABILITIES AND BUSINESS NEEDS. IMRE DOES NOT DISCRIMINATE IN EMPLOYMENT OPPORTUNITIES OR PRACTICES ON THE BASIS OF RACE, COLOR, CITIZENSHIP STATUS, NATIONAL ORIGIN, ANCESTRY, GENDER, SEXUAL ORIENTATION, GENDER IDENTITY, AGE, RELIGION, CREED, PHYSICAL OR MENTAL DISABILITY, MARITAL STATUS, VETERAN STATUS, GENETIC INFORMATION OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW. THIS POLICY GOVERNS ALL TERMS AND CONDITIONS OF EMPLOYMENT, INCLUDING SELECTION, JOB ASSIGNMENT, COMPENSATION, DISCIPLINE, TERMINATION AND ACCESS TO BENEFITS AND TRAINING.\n\nSALARY RANGE: $90K-$120K\n\n",
    "job_skill_set": [
      "CRM",
      "Microsoft Word",
      "Microsoft Excel",
      "Microsoft PowerPoint",
      "Project Management",
      "Marketing",
      "Data Analysis",
      "Communication",
      "Organization",
      "Attention to Detail",
      "Networking",
      "Collaboration",
      "Problem Solving",
      "Adaptability",
      "Business Intelligence Tools"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "attention",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "crm",
      "data",
      "detail",
      "development",
      "excel",
      "intelligence",
      "management",
      "manager",
      "marketing",
      "microsoft",
      "networking",
      "organization",
      "powerpoint",
      "problem",
      "project",
      "solving",
      "to",
      "tools",
      "word"
    ]
  },
  {
    "job_id": "3904363458",
    "job_title": "Retirement Plan Services Internal Business Development Consultant",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "IF YOU’RE DRIVEN BY A COMMITMENT TO CLIENT SATISFACTION, THRIVE IN A TEAM ENVIRONMENT THAT VALUES ATTENTION TO DETAIL, ADAPTABILITY, AND RELATIONSHIP-BUILDING, AND ARE EAGER TO CONTRIBUTE YOUR EXPERTISE TO A COLLABORATIVE TEAM DEDICATED TO EXCELLENCE, WE ENCOURAGE YOU TO APPLY FOR THIS EXCITING OPPORTUNITY AS AN INTERNAL BUSINESS DEVELOPMENT CONSULTANT. JOIN US IN SHAPING THE FUTURE OF RETIREMENT PLANNING AND MAKING A POSITIVE DIFFERENCE IN THE LIVES OF OUR CLIENTS.\n DESCRIPTION AND REQUIREMENTS FOR OUR RETIREMENT PLAN SERVICES INTERNAL BUSINESS DEVELOPMENT CONSULTANT\n AS AN INTERNAL BUSINESS DEVELOPMENT CONSULTANT, YOU WILL PLAY A PIVOTAL ROLE IN SUPPORTING AND COLLABORATING WITH THE BUSINESS DEVELOPMENT MANAGER TO CULTIVATE AND NURTURE A ROBUST PIPELINE OF QUALIFIED RETIREMENT PLAN (QRP) OPPORTUNITIES. THIS OPPORTUNITY OFFERS THE CHANCE TO WORK IN A CLOSE-KNIT GROUP WITH A LOT OF ROOM FOR PROFESSIONAL GROWTH. YOUR PRIMARY RESPONSIBILITIES WILL INCLUDE LIAISING WITH INTERNAL AND EXTERNAL STAKEHOLDERS, PROVIDING RECOMMENDATIONS ON PLAN DESIGN, FACILITATING THE SALES PROCESS, AND ENSURING THE SEAMLESS TRANSITION OF CLOSED OPPORTUNITIES INTO THE PLAN CONVERSION PHASE. YOUR MAIN GOALS IN THIS ROLE ARE TO GENERATE REVENUE, CREATE REFERRAL OPPORTUNITIES, AND BUILD RELATIONSHIP.\n WHAT ARE THE \"MUST HAVE\" SKILLS YOU WILL NEED TO BE SUCCESSFUL?\n FINANCIAL SERVICES EXPERIENCE: PROVEN TENURE AND A MINIMUM OF SEVEN TO TEN YEARS' EXPERIENCE IN FINANCIAL SERVICES SALES WITH A DEMONSTRATED ABILITY TO DEVELOP A QUALIFIED RETIREMENT PLAN SALES PIPELINE IS REQUIRED. EDUCATION: BACHELOR’S DEGREE IN BUSINESS ADMINISTRATION OR A RELATED FIELD FROM AN ACCREDITED COLLEGE OR UNIVERSITY INDUSTRY DESIGNATIONS/CERTIFICATIONS: WE WOULD HIGHLY PREFER SOMEONE WITH A CRPS DESIGNATION, BUT A MINIMUM FINANCIAL LICENSE SERIES 65 IS REQUIRED. RETIREMENT PLAN KNOWLEDGE: YOU MUST HAVE A GENERAL UNDERSTANDING OF RETIREMENT PLAN DESIGN, ERISA, AND QUALIFIED RETIREMENT PLAN REGULATIONS. TECHNICAL SKILLS: YOU WILL POSSESS A PROFICIENCY IN MICROSOFT WORD, EXCEL, POWERPOINT, AND OUTLOOK. IF YOU HAVE PRIOR SALESFORCE EXPERIENCE, THAT WOULD BE A BONUS. CRITICAL THINKING AND PROBLEM-SOLVING: YOU WILL USE YOUR ABILITY TO THINK CRITICALLY AND ANALYTICALLY TO PROACTIVELY SOLVE PROBLEMS THAT DRIVE BUSINESS OUTCOMES. CLIENT-FOCUSED MINDSET: YOU WILL WORK CLOSELY AND PARTNER WITH THE BUSINESS DEVELOPMENT MANAGER TO IDENTIFY AND ADVANCE QRP OPPORTUNITIES THROUGH WITHIN OUR PIPELINE. YOU WILL METICULOUSLY PREPARE PROPOSALS, RFPS, FEE BENCHMARKING, AND PRICING SCENARIOS WHILE EFFECTIVELY COMMUNICATING THE CORE INVESTMENT PHILOSOPHY TO PROSPECTIVE PLAN SPONSORS. YOU WILL HAVE A PASSION FOR DELIVERING EXCEPTIONAL CLIENT SERVICE AND SATISFACTION WITH METICULOUS ATTENTION TO DETAIL. STRONG RELATIONSHIP BUILDER: YOU WILL COLLABORATE WITH INTERNAL AND EXTERNAL EXPERTS TO OFFER TAILORED RECOMMENDATIONS ON PLAN DESIGN, ALIGNING WITH THE GOALS AND OBJECTIVES OF PLAN SPONSORS AND PARTICIPANTS. THROUGH YOUR PROVEN ABILITY TO BUILD AND NURTURE RELATIONSHIPS, YOU WILL FOSTER TRUST AND BUILD RAPPORT WITH SAVANT ADVISORS, STAKEHOLDERS, AND CLIENTS TO DRIVE PROGRESSION OF OPPORTUNITIES THROUGH THE PIPELINE. EFFECTIVE COMMUNICATOR: YOUR EXPERTISE IN COMMUNICATION WITH ALLOW YOU TO ARTICULATE COMPLEX CONCEPTS AND RECOMMENDATIONS TO CLIENTS AND INTERNAL STAKEHOLDERS IN A WAY THAT IS EASY TO UNDERSTAND. THROUGH YOUR EXCEPTIONAL COMMUNICATION SKILLS, YOU WILL FACILITATE SMOOTH TRANSITIONS OF CLOSED OPPORTUNITIES INTO THE PLAN CONVERSION PHASE. PROCESS DRIVEN: YOU WILL BE A PROACTIVE SUPPORT IN FOLLOWING AND CONSISTENTLY ADHERING TO SAVANT’S INTERNAL PROCESSES.  \nA COUPLE THINGS TO NOTE ABOUT OUR RETIREMENT PLAN SERVICES INTERNAL BUSINESS DEVELOPMENT CONSULTANT:\n THIS POSITION HAS THE FLEXIBILITY TO WORK REMOTELY WITHIN A COMMUTABLE DISTANCE TO ANY OF OUR SAVANT LOCATIONS. TO BE CONSIDERED, YOU MUST LIVE IN A STATE WHERE WE ALREADY HAVE A SAVANT OFFICE. THIS POSITION HAS THE FLEXIBILITY TO WORK A HYBRID SCHEDULE AFTER THE INITIAL TRAINING PERIOD. THIS SCHEDULE CONSISTS OF 3 DAYS IN OFFICE 2 FROM HOME.THIS ROLE MAY REQUIRE THE FLEXIBILITY TO TRAVEL TO OTHER OFFICES WHEN FULL TEAM MEETINGS ARE TAKING PLACE. YOU CAN EXPECT A MAXIMUM 30% TRAVEL REQUIREMENT.THIS IS A FULL-TIME POSITION, WITH A MINIMUM EXPECTED HOUR AMOUNT OF 40 HOURS PER WEEK. THE TYPICAL SCHEDULE IS MONDAY-FRIDAY, 8AM-5PM. \n WHY JOIN US?\n WE ARE A GROWING FIRM, WITH OPPORTUNITIES FOR FUTURE GROWTH AND ADVANCEMENT IN YOUR ROLE.WE OFFER HEALTH, VISION, DENTAL, AND 401K BENEFIT OPTIONS FOR YOU AND YOUR FAMILY.WE BELIEVE IN COLLABORATION, INNOVATION, EXCELLENCE, DOING WHAT’S RIGHT, AND HELPING OUR TEAM TO PROVIDE A WORLD CLASS SERVICEOUR CULTURE IS STEEPED IN SAVANT’S MIDWESTERN ROOTS AS DESCRIBED THROUGH OUR CORPORATE VALUES OF EXCELLENCE, INTEGRITY, LIFELONG LEARNING, RESPECT, GROWTH, AND SERVANT LEADERSHIP. WE ARE DEDICATED TO LIVING THESE VALUES THROUGH OUR RELATIONSHIPS WITH CLIENTS, EACH OTHER, AND THE GREATER COMMUNITY. OUR CORE VALUES TRULY DEFINE THE SAVANT WAY.\n LET US HELP YOU ON YOUR PATH TO YOUR IDEAL CAREER - APPLY TODAY!  \n COLLECTIVE WISDOM. WE'RE BETTER TOGETHER. \nAT SAVANT WEALTH MANAGEMENT, WE ARE DRIVEN BY A PURPOSE TO SERVE OUR CLIENTS WITH SKILL, PASSION AND INTEGRITY. INSPIRED BY COLLABORATION, OUR TEAM CRAVES INNOVATION, COMMITMENT TO EXCELLENCE AND ABOVE ALL, DOING WHAT IS RIGHT. WE ARE UP FOR ANY CHALLENGE. SINCE 1986 WE HAVE FOCUSED ON COMMITTING TO HELPING CLIENTS ACHIEVE PEACE OF MIND THROUGH OUR COLLECTIVE INSIGHT AND WISDOM.\n IF YOU WANT TO BE PART OF A CULTURE THAT IS DEFINED THROUGH STRONG VALUES - SAVANT IS RIGHT FOR YOU.  \nTHE ABOVE STATEMENTS ARE INTENDED TO DESCRIBE THE GENERAL NATURE AND LEVEL OF WORK BEING PERFORMED BY PEOPLE ASSIGNED TO THIS JOB. THEY ARE NOT INTENDED TO BE AN EXHAUSTIVE LIST OF ALL RESPONSIBILITIES, DUTIES, AND SKILLS REQUIRED OF THE INCUMBENT IN THIS POSITION. ANY COMBINATION OF EQUIVALENT EDUCATION AND WORK EXPERIENCE WILL BE CONSIDERED.SAVANT CAPITAL, LLC IS AN EQUAL OPPORTUNITY EMPLOYER",
    "job_skill_set": [
      "critical thinking",
      "problem-solving",
      "client-focused mindset",
      "relationship building",
      "effective communication",
      "adaptability",
      "teamwork",
      "financial services experience",
      "CRPS designation",
      "financial license series 65",
      "retirement plan knowledge",
      "Microsoft Word",
      "Microsoft Excel",
      "Microsoft PowerPoint",
      "Microsoft Outlook",
      "Salesforce",
      "attention to detail",
      "process driven"
    ],
    "short_keywords": [
      "65",
      "adaptability",
      "attention",
      "building",
      "business",
      "businessdevelopment",
      "clientfocused",
      "communication",
      "consultant",
      "critical",
      "crps",
      "designation",
      "detail",
      "development",
      "driven",
      "effective",
      "excel",
      "experience",
      "financial",
      "internal",
      "knowledge",
      "license",
      "microsoft",
      "mindset",
      "outlook",
      "plan",
      "powerpoint",
      "problemsolving",
      "process",
      "relationship",
      "retirement",
      "salesforce",
      "series",
      "services",
      "teamwork",
      "thinking",
      "to",
      "word"
    ]
  },
  {
    "job_id": "3887855844",
    "job_title": "Business Development Manager, Facial- Allergan Aesthetics Sugar Land, TX",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "COMPANY DESCRIPTION\n\nABBVIE'S MISSION IS TO DISCOVER AND DELIVER INNOVATIVE MEDICINES AND SOLUTIONS THAT SOLVE SERIOUS HEALTH ISSUES TODAY AND ADDRESS THE MEDICAL CHALLENGES OF TOMORROW. WE STRIVE TO HAVE A REMARKABLE IMPACT ON PEOPLE'S LIVES ACROSS SEVERAL KEY THERAPEUTIC AREAS – IMMUNOLOGY, ONCOLOGY, NEUROSCIENCE, AND EYE CARE – AND PRODUCTS AND SERVICES IN OUR ALLERGAN AESTHETICS PORTFOLIO. FOR MORE INFORMATION ABOUT ABBVIE, PLEASE VISIT US AT WWW.ABBVIE.COM. FOLLOW @ABBVIE ON TWITTER, FACEBOOK, INSTAGRAM, YOUTUBE AND LINKEDIN.\n\nJOB DESCRIPTION\n\nALLERGAN PLC (NYSE: AGN) IS A BOLD, GLOBAL PHARMACEUTICAL COMPANY AND A LEADER IN A NEW INDUSTRY MODEL - GROWTH PHARMA. ALLERGAN IS FOCUSED ON DEVELOPING, MANUFACTURING AND COMMERCIALIZING BRANDED PHARMACEUTICAL, DEVICE, BIOLOGIC, SURGICAL AND REGENERATIVE MEDICINE PRODUCTS FOR PATIENTS AROUND THE WORLD.\n\nALLERGAN MARKETS A PORTFOLIO OF LEADING BRANDS AND BEST-IN-CLASS PRODUCTS FOR THE CENTRAL NERVOUS SYSTEM, EYE CARE, MEDICAL AESTHETICS AND DERMATOLOGY, GASTROENTEROLOGY, WOMEN'S HEALTH, UROLOGY AND ANTI-INFECTIVE THERAPEUTIC CATEGORIES. WITH COMMERCIAL OPERATIONS IN APPROXIMATELY 100 COUNTRIES, ALLERGAN IS COMMITTED TO WORKING WITH PHYSICIANS, HEALTHCARE PROVIDERS AND PATIENTS TO DELIVER INNOVATIVE AND MEANINGFUL TREATMENTS THAT HELP PEOPLE AROUND THE WORLD LIVE LONGER, HEALTHIER LIVES EVERY DAY.\n\nALLERGAN IS A COMPANY THAT WILL INSPIRE YOU TO AIM HIGH WITH YOUR AMBITION. WHERE YOU CAN BUILD BRIDGES ALL OVER THE WORLD. WHERE YOU CAN POWER IDEAS THAT DRIVE CHANGE. AND WHERE YOU WILL ACT FAST AND DRIVE RESULTS FOR CUSTOMERS AND PATIENTS. POWER YOUR FUTURE & JOIN OUR BOLD TEAM.\n\nPOSITION OVERVIEW:\n\nBUSINESS DEVELOPMENT MANAGER REPRESENTS THE FACIAL AESTHETICS PRODUCT PORTFOLIO TO TARGETED AESTHETIC CUSTOMERS WITHIN A DESIGNATED GEOGRAPHICAL AREA. RESPONSIBLE FOR CREATING PRODUCT ACCEPTANCE AND ENHANCING PORTFOLIO GROWTH THROUGH BUSINESS DEVELOPMENT ACTIVITIES. THE BDM PROVIDES TECHNICAL PRODUCT AND PROCEDURE EXPERTISE AS WELL AS COMPETITIVE PRODUCT DIFFERENTIATION. ASSIGNED SALES GOALS ARE OBTAINED THROUGH CREATIVE, CONSULTATIVE SELLING AND IMPLEMENTATION OF THE U.S. SALES/MARKETING PLAN. THE COMPANY OFFERS FLEXIBLE CAREER PATHS WITH A STRONG EMPHASIS ON OPPORTUNITY FOR INTERNAL MOBILITY.\n\nMAIN AREAS OF RESPONSIBILITIES\n\nTHE BUSINESS DEVELOPMENT MANAGER (BDM) LEVERAGES ALLERGAN MEDICAL RESOURCES TO ENHANCE ADOPTION OF THE FACIAL AESTHETICS PORTFOLIO. SYNERGISTICALLY WORKS AND COORDINATES ACTIVITIES WITH OTHER ALLERGAN SALES PERSONNEL AND SUPPORT TEAMS (INCLUDE, BUT ARE NOT LIMITED TO, FACIAL AESTHETICS, BREAST AESTHETIC, APCS, NEUROLOGY, TOPICAL AESTHETICS, MEDICAL DERMATOLOGY, MARKETING, AND OTHER ALLERGAN SALES FORCES). COMPLIES WITH REQUIRED REPORTS, REQUESTS, AND COMPLIANCE POLICIES. EFFECTIVELY MANAGES FIELD ASSETS AND RESOURCES TO INCLUDE, BUT NOT LIMITED TO, EXPENSE MANAGEMENT, COMPUTER AND OTHER ALLOCATED EQUIPMENT.\n\nSIGNIFICANT WORK ACTIVITIES -CONTINUOUS STANDING FOR PROLONGED PERIODS (MORE THAN 2 CONSECUTIVE HOURS IN AN 8 HOUR DAY)\n\nQUALIFICATIONS\n\nEDUCATION:\n\nBACHELOR’S DEGREE OR HIGHER REQUIRED\n\nREQUIREMENTS:\n\n3 TO 5 YEARS SUCCESSFUL MEDICAL SALES/PRACTICE MANAGEMENT EXPERIENCE7 TO 10 YEARS BUSINESS EXPERIENCEEXPERIENCE AND KNOWLEDGE OF GENERAL MARKETING PRINCIPLES AND CONCEPTS WITHIN THE HEALTHCARE ENVIRONMENTEXPERIENCE AND KNOWLEDGE OF INNER WORKINGS OF A PHYSICIANS PRACTICEVALID DRIVER’S LICENSE\n\nPREFERRED SKILLS AND QUALIFICATIONS\n\nANALYTICAL SKILLSSTRONG BUSINESS ACUMENPROVEN SELLING SKILLSSTRONG AND EFFECTIVE CONSULTATIVE SKILLSSTRONG CONFLICT AND PROBLEM RESOLUTION SKILLSABILITY TO DEVELOP KEY STRATEGIES AND EXECUTESTRONG COMMUNICATION SKILLS, BOTH VERBAL AND WRITTENSTRONG INTERPERSONAL SKILLSSTRONG CONTRACT/NEGOTIATING SKILLSFINANCIAL/BUDGETARY EXPERIENCEABILITY TO TRAVELABILITY TO LIFT 50 LBS.PROFICIENCY ON EXCEL, WORD, POWER POINT AND OTHER SOFTWARE SKILLS'\n\nADDITIONAL INFORMATION\n\nAPPLICABLE ONLY TO APPLICANTS APPLYING TO A POSITION IN ANY LOCATION WITH PAY DISCLOSURE REQUIREMENTS UNDER STATE OR LOCAL LAW:\n\nTHE COMPENSATION RANGE DESCRIBED BELOW IS THE RANGE OF POSSIBLE BASE PAY COMPENSATION THAT THE COMPANY BELIEVES IN GOOD FAITH IT WILL PAY FOR THIS ROLE AT THE TIME OF THIS POSTING BASED ON THE JOB GRADE FOR THIS POSITION. INDIVIDUAL COMPENSATION PAID WITHIN THIS RANGE WILL DEPEND ON MANY FACTORS INCLUDING GEOGRAPHIC LOCATION, AND WE MAY ULTIMATELY PAY MORE OR LESS THAN THE POSTED RANGE. THIS RANGE MAY BE MODIFIED IN THE FUTURE. WE OFFER A COMPREHENSIVE PACKAGE OF BENEFITS INCLUDING PAID TIME OFF (VACATION, HOLIDAYS, SICK), MEDICAL/DENTAL/VISION INSURANCE AND 401(K) TO ELIGIBLE EMPLOYEES. THIS JOB IS ELIGIBLE TO PARTICIPATE IN OUR SHORT-TERM INCENTIVE PROGRAMS. \n\nNOTE: NO AMOUNT OF PAY IS CONSIDERED TO BE WAGES OR COMPENSATION UNTIL SUCH AMOUNT IS EARNED, VESTED, AND DETERMINABLE. THE AMOUNT AND AVAILABILITY OF ANY BONUS, COMMISSION, INCENTIVE, BENEFITS, OR ANY OTHER FORM OF COMPENSATION AND BENEFITS THAT ARE ALLOCABLE TO A PARTICULAR EMPLOYEE REMAINS IN THE COMPANY'S SOLE AND ABSOLUTE DISCRETION UNLESS AND UNTIL PAID AND MAY BE MODIFIED AT THE COMPANY’S SOLE AND ABSOLUTE DISCRETION, CONSISTENT WITH APPLICABLE LAW.\n\nABBVIE IS COMMITTED TO OPERATING WITH INTEGRITY, DRIVING INNOVATION, TRANSFORMING LIVES, SERVING OUR COMMUNITY AND EMBRACING DIVERSITY AND INCLUSION. IT IS ABBVIE’S POLICY TO EMPLOY QUALIFIED PERSONS OF THE GREATEST ABILITY WITHOUT DISCRIMINATION AGAINST ANY EMPLOYEE OR APPLICANT FOR EMPLOYMENT BECAUSE OF RACE, COLOR, RELIGION, NATIONAL ORIGIN, AGE, SEX (INCLUDING PREGNANCY), PHYSICAL OR MENTAL DISABILITY, MEDICAL CONDITION, GENETIC INFORMATION, GENDER IDENTITY OR EXPRESSION, SEXUAL ORIENTATION, MARITAL STATUS, STATUS AS A PROTECTED VETERAN, OR ANY OTHER LEGALLY PROTECTED GROUP STATUS.\n\n",
    "job_skill_set": [
      "marketing principles",
      "analytical skills",
      "product knowledge",
      "business development",
      "communication",
      "interpersonal skills",
      "problem solving",
      "strategic thinking",
      "team collaboration",
      "adaptability",
      "time management",
      "customer focus",
      "leadership",
      "medical sales",
      "consultative selling",
      "contract negotiation",
      "financial management",
      "Excel",
      "Word",
      "PowerPoint",
      "conflict resolution"
    ],
    "short_keywords": [
      "adaptability",
      "aesthetics",
      "allergan",
      "analytical",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "conflict",
      "consultative",
      "contract",
      "customer",
      "development",
      "excel",
      "facial",
      "financial",
      "focus",
      "interpersonal",
      "knowledge",
      "land",
      "leadership",
      "management",
      "manager",
      "marketing",
      "medical",
      "negotiation",
      "powerpoint",
      "principles",
      "problem",
      "product",
      "resolution",
      "sales",
      "selling",
      "skills",
      "solving",
      "strategic",
      "sugar",
      "team",
      "thinking",
      "time",
      "tx",
      "word"
    ]
  },
  {
    "job_id": "3905271422",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "ROLE OVERVIEW\nWE SEEK AN AMBITIOUS AND COMPETITIVE BUSINESS DEVELOPMENT REPRESENTATIVE (BDR) TO JOIN OUR FAST-GROWING SOFTWARE COMPANY. THE BDR WILL FOCUS ON CLIENT PROSPECTING AND LEAD GENERATION FOR OUR SALES TEAM, PRIMARILY THROUGH OUTREACH COMMUNICATION EFFORTS AND INBOUND LEAD MANAGEMENT. THIS ROLE WILL BE FUNDAMENTAL IN SHAPING OUR SALES AND MARKETING STRATEGY AND DRIVING THE COMPANY'S GROWTH.\nKEY RESPONSIBILITIES\nLEAD GENERATION: IDENTIFY POTENTIAL CLIENTS AND DECISION-MAKERS WITHIN THE TARGET SERVICENOW MARKETS TO EXPAND THE COMPANY'S CUSTOMER BASE. USE OUTBOUND PROSPECTING METHODS, SUCH AS COLD CALLING, EMAILING, AND SOCIAL MEDIA OUTREACH.INBOUND LEAD MANAGEMENT: RESPOND TO AND QUALIFY INBOUND MARKETING LEADS, ENSURING A SMOOTH TRANSITION TO OUR SALES TEAM.CLIENT RELATIONSHIP MANAGEMENT: MAINTAIN ACTIVE ENGAGEMENT WITH NEW AND EXISTING LEADS THROUGH CREATIVE FOLLOW-UP COMMUNICATIONS DESIGNED TO INCREASE CUSTOMER INTEREST IN OUR SOFTWARE PRODUCTS.MARKET AND PRODUCT UNDERSTANDING: KEEP CURRENT WITH MARKET TRENDS AND THE COMPETITIVE LANDSCAPE. UNDERSTAND THE FEATURES AND BENEFITS OF OUR SOFTWARE PRODUCTS IN THE SERVICENOW MARKET TO EFFECTIVELY COMMUNICATE THE VALUE PROPOSITION TO PROSPECTIVE CLIENTS.COLLABORATE WITH SALES AND MARKETING: WORK CLOSELY WITH SALES AND MARKETING TEAMS TO ACHIEVE COMPANY SALES GOALS AND CONTRIBUTE TO TEAM-WIDE STRATEGIES.\nQUALIFICATIONS\nBACHELOR'S DEGREE OR EQUIVALENT EXPERIENCE IN BUSINESS, MARKETING, INFORMATION TECHNOLOGYEXPERIENCE AS A BUSINESS DEVELOPMENT REPRESENTATIVE, SALES REPRESENTATIVE, OR SIMILAR ROLE IN THE IT SOFTWARE INDUSTRY.EXCELLENT COMMUNICATION, INTERPERSONAL, AND ORGANIZATIONAL SKILLS.EXCELLENT UNDERSTANDING OF TOOLS SUCH AS HUBSPOT, OUTREACH.IO, LINKEDIN SALES NAVIGATOR, ZOOMINFO, ETC.GOOD UNDERSTANDING OF PRODUCT LED GROWTH SELLING WITH TECHNICAL-DRIVEN DEMOSABILITY TO WORK REMOTELY IN A FAST-PACED STARTUP AND TEAM-ORIENTED ENVIRONMENT.SELF-STARTER WITH A SUCCESSFUL LEAD GENERATION AND RELATIONSHIP-BUILDING TRACK RECORD.KNOWLEDGE OF THE IT SOFTWARE MARKET AND A TECHNICAL UNDERSTANDING OF SOFTWARE PRODUCTS WILL BE A STRONG ADVANTAGE.\nABOUT US\nXTYPE.IO IS A SEED-FUNDED SOFTWARE STARTUP OUT OF ISRAEL AND CALIFORNIA FOCUSED ON THE SERVICENOW MARKET TO BECOME THE DE-FACTO STANDARD AND LEADER IN SERVICENOW PLATFORM ENGINEERING. WE OFFER COMPETITIVE SALARIES, A COMPREHENSIVE BENEFITS PACKAGE, AND A DYNAMIC AND INCLUSIVE WORK ENVIRONMENT. IF YOU HAVE A PASSION FOR BUILDING STARTUPS AND TECHNOLOGY AND WANT TO BE PART OF A TEAM THAT MAKES A DIFFERENCE, WE WANT TO HEAR FROM YOU. \nNOTE: WHILE THIS POSITION IS BASED ON THE EAST COAST TIME ZONE, FLEXIBILITY IS STILL NECESSARY TO COMMUNICATE WITH GLOBAL CLIENTS. \nXTYPE.IO IS AN EQUAL OPPORTUNITY EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, OR VETERAN STATUS.",
    "job_skill_set": [
      "lead generation",
      "client prospecting",
      "outbound prospecting",
      "inbound lead management",
      "market understanding",
      "communication",
      "interpersonal skills",
      "organizational skills",
      "self-starter",
      "teamwork",
      "adaptability",
      "CRM tools (HubSpot, Outreach.io, LinkedIn Sales Navigator, ZoomInfo)",
      "product led growth selling",
      "technical understanding of software products"
    ],
    "short_keywords": [
      "adaptability",
      "business",
      "businessdevelopment",
      "client",
      "communication",
      "crm",
      "development",
      "generation",
      "growth",
      "hubspot",
      "inbound",
      "interpersonal",
      "lead",
      "led",
      "linkedin",
      "management",
      "market",
      "navigator",
      "of",
      "organizational",
      "outbound",
      "outreachio",
      "product",
      "products",
      "prospecting",
      "representative",
      "sales",
      "selfstarter",
      "selling",
      "skills",
      "software",
      "teamwork",
      "technical",
      "tools",
      "understanding",
      "zoominfo"
    ]
  },
  {
    "job_id": "3861704803",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "HELLO FOLKS,HOPE YOU ARE WELL AND DOING GREAT,\nTHIS IS SOHAIL FROM KASTECH SOFTWARE SOLUTIONS WE DO HAVE AN URGENT OPENING FOR BUSINESS DEVELOPMENT MANAGER @ AUSTIN, TX. PLEASE GO THROUGH WITH THE JOB DESCRIPTION AND SHARE ME YOUR UPDATED RESUME IF YOUR EXPERIENCE & SKILLS MATCH WITH CLIENT REQUIREMENT.\nJOB TITLE: BDM (BUSINESS DEVELOPMENT MANAGER)LOCATION: AUSTIN (TX) - ONSITE EXPERIENCE: 5- 8 YEARS SALARY STRUCTURE: BASE SALARY + INCENTIVES EMPLOYMENT TYPE: FTE/DIRECT HIRE   \nAS A BDM, YOU WILL HANDLE ALL ASPECTS:  · DEVELOP NEW CLIENT ACCOUNTS (DIRECT / TIER 1 PARTNERS) FOR IT STAFFING BUSINESS IN USA. INTERACT WITH CLIENTS ON DAILY BASIS AND IDENTIFY STAFFING OPPORTUNITIES TO FULFILL. · GET INVOLVED IN COMPLETE RECRUITMENT CYCLE - FROM SOURCING TO PLACING. · BE ACCOUNTABLE FOR REVENUE TARGETS. · CLIENT RELATIONSHIP MANAGEMENT. · BUILDING ACCOUNTS WITH CONTRACTOR STAFFING NEEDS AND ONGOING SUPPORT. · PARTNERING AND IDENTIFYING OPPORTUNITIES FOR IT SERVICES PROJECT. · LEVERAGE YOUR EXISTING RELATIONSHIPS AND NETWORK TO OPEN NEW BUSINESS.  REQUIRED EXPERIENCE: · MINIMUM OF 5-8 YEARS OF EXPERIENCE IN IT STAFFING BUSINESS DEVELOPMENTS/ACCOUNT MANAGEMENT IN THE US  MARKET. · MUST HAVE PRIOR RELATIONSHIPS WITH TIER-1 PARTNERS / END CLIENTS WITH A CONSISTENT TRACK RECORD OF PLACEMENTS WITH  THEM. · AGGRESSIVE AND TARGET ORIENTED WITH ABILITY TO WORK IN HIGH PRESSURE ENVIRONMENT, MULTI-TASKING AND SELF-  MOTIVATED. · SHOULD BE ABLE TO WORK INDEPENDENTLY WORK - END TO END IN PURSUING PLACEMENTS/REVENUE TARGETS. · EXPERT LEVEL TECHNICAL RECRUITMENT SKILLS. · SHARP, ARTICULATE AND ENERGETIC WITH A CAN-DO ATTITUDE.\n\nSOHAIL HUSSAIN,SENIOR TALENT ACQUISITION SPECIALIST,KASTECH SOFTWARE SOLUTIONS PVT. LTD.CONTACT NUMBER: +1 8322258022SOHAILH@KASTECHSSG.COM",
    "job_skill_set": [
      "account management",
      "client relationship management",
      "revenue target accountability",
      "business development",
      "IT services project management",
      "target oriented",
      "self-motivated",
      "multi-tasking",
      "independent work",
      "communication",
      "can-do attitude",
      "articulate",
      "IT staffing",
      "technical recruitment",
      "sourcing",
      "placing",
      "contractor staffing",
      "aggressive",
      "energetic"
    ],
    "short_keywords": [
      "account",
      "accountability",
      "aggressive",
      "articulate",
      "attitude",
      "business",
      "businessdevelopment",
      "cando",
      "client",
      "communication",
      "contractor",
      "development",
      "energetic",
      "independent",
      "it",
      "management",
      "manager",
      "multitasking",
      "oriented",
      "placing",
      "project",
      "recruitment",
      "relationship",
      "revenue",
      "selfmotivated",
      "services",
      "sourcing",
      "staffing",
      "target",
      "technical",
      "work"
    ]
  },
  {
    "job_id": "3902835133",
    "job_title": "Business Development Associate / Physician Liaison",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "WHY CLS HEALTH?CLS HEALTH IS THE LARGEST PHYSICIAN-OWNED COMPREHENSIVE CARE PRACTICE IN THE HOUSTON METRO AREA. FOR 25 YEARS CLS HEALTH HAS PROVIDED EXCEPTIONAL CARE TO OUR COMMUNITY, GROUNDED IN A PATIENT-FIRST PHILOSOPHY. CURRENTLY, WE ARE GROWING RAPIDLY AND BUILDING MULTIPLE COMPREHENSIVE CARE CENTERS ACROSS THE GREATER HOUSTON AREA AND ARE LOOKING FOR GREAT TEAM MEMBERS TO HELP WITH OUR EXPANSION.\nWE ARE LOOKING FOR:CLS HEALTH IS SEEKING A BUSINESS DEVELOPMENT ASSOCIATE (BDA) / PHYSICIAN LIAISON TO JOIN OUR BD DEPARTMENT AT OUR MAIN OFFICE IN WEBSTER, TX. THE BDA WILL BE RESPONSIBLE FOR FIELD MARKETING, REFERRAL GENERATION, ATTENDING NETWORKING EVENTS, AND BUILDING VARIOUS STRATEGIC RELATIONSHIPS. THIS POSITION WILL BE PRIMARILY BASED ON GREATER HOUSTON - WEST (CYPRESS, KATY, SUGAR LAND, ETC.)\nESSENTIAL FUNCTIONS AND RESPONSIBILITIES:RESPONSIBLE FOR BUILDING AND MAINTAINING RELATIONSHIPS WITH VARIOUS HEALTHCARE PROVIDERS & GROUPS AROUND GREATER HOUSTON.VISIT AT LEAST (10) CLINICS PER DAY, PROMOTING NEWLY ONBOARDED CLS PROVIDERS TO POSSIBLE REFERRING PHYSICIANS.ATTEND AND ASSIST WITH VARIOUS HEALTH FAIRS & NETWORKING EVENTS HOSTING EXHIBITIONS/BOOTHS TO PROMOTE CLS HEALTH.ESCORT AND ATTEND MEETINGS WITH VARIOUS CLS PHYSICIANS ENSURING A COMPREHENSIVE & DETAILED FIELD MARKETING PLAN.EDUCATE AND PROMOTE EXISTING CLS PROVIDERS/SERVICE LINES TO SURROUNDING PHYSICIANS & PRACTICES IN THE GENERAL VICINITY OF CLS CLINICS.PROVIDE EVENT PLANNING COORDINATION AND SUPPORT.HOST AT LEAST (1) WEEKLY LUNCH/EDUCATIONAL SEMINAR WITH A NON-CLS CLINIC.PROVIDE BI-WEEKLY STATUS REPORTS ON ALL SITE VISITS, PHONE CALLS, AND OTHER ACTIVITIES.PROVIDE SUPPORT TO M&A TEAM.ADDITIONAL TASKS AND RESPONSIBILITIES AS ASSIGNED.\nREQUIRED EDUCATION AND EXPERIENCE:HEALTHCARE BACKGROUND PREFERRED.SALES/MARKETING BACKGROUND PREFERRED.BACHELOR’S DEGREE PREFERRED (HEALTHCARE ADMIN, MARKETING, BUSINESS)A WILLINGNESS TO TRAVEL AS NEEDED AROUND THE HOUSTON AREA. (MILEAGE INCLUDED)2+ YEARS OF EXPERIENCE IN AN OUTSIDE SALES/FIELD MARKETING ROLE.BE SKILLED AT ESTABLISHING AND JUGGLING PRIORITIES AND MEETING DEADLINES.BE ABLE TO SUCCEED IN A FAST-PACED ENVIRONMENT WITH MINIMAL SUPERVISION.",
    "job_skill_set": [
      "sales",
      "traveling",
      "communication",
      "time management",
      "teamwork",
      "adaptability",
      "problem solving",
      "self-motivation",
      "field marketing",
      "referral generation",
      "event planning",
      "marketing",
      "healthcare knowledge",
      "relationship building",
      "reporting"
    ],
    "short_keywords": [
      "adaptability",
      "associate",
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "development",
      "event",
      "field",
      "generation",
      "healthcare",
      "knowledge",
      "liaison",
      "management",
      "marketing",
      "physician",
      "planning",
      "problem",
      "referral",
      "relationship",
      "reporting",
      "sales",
      "selfmotivation",
      "solving",
      "teamwork",
      "time",
      "traveling"
    ]
  },
  {
    "job_id": "3904950228",
    "job_title": "Business Development Vice President - Healthcare / Pharma Vertical (Remote)",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "DICE IS THE LEADING CAREER DESTINATION FOR TECH EXPERTS AT EVERY STAGE OF THEIR CAREERS. OUR CLIENT, EPSILON, IS SEEKING THE FOLLOWING. APPLY VIA DICE TODAY!\n\nJOB DESCRIPTION\n\nAS THE VICE PRESIDENT BUSINESS DEVELOPMENT OF DATA SALES FOCUSED ON THE HEALTHCARE / PHARMA SECTOR AT EPSILON, YOU WILL LEAD AND DRIVE NEW LOGO OPPORTUNITIES AND SALES EFFORTS RELATED TO DATA PRODUCTS AND SERVICES SPECIFICALLY DESIGNED TO SUPPORT ORGANIZATIONS IN THE HEALTHCARE / PHARMA SECTOR. YOU WILL STRATEGIZE, COLLABORATE, AND EXECUTE SALES PLANS, AIMING TO ENHANCE THE IMPACT OF DATA-DRIVEN SOLUTIONS IN THE HEALTHCARE / PHARMA SPACE. THE SALES EXECUTIVE WILL BE BOLSTERED BY A LEAD GENERATION TEAM.\n\n DUTIES AND RESPONSIBILITIES: \n\n STRATEGIC LEADERSHIP: \n\nPROVIDE LEADERSHIP, VISION, AND DIRECTION TO THE DATA SALES TEAM FOCUSING ON THE HEALTHCARE / PHARMA SECTOR.DEVELOP AND COMMUNICATE SALES STRATEGIES THAT NOT ONLY ALIGN WITH BUSINESS GOALS WITHIN THE HEALTHCARE / PHARMA ORGANIZATIONS.\n\n SALES PLANNING AND EXECUTION: \n\nDEVELOP COMPREHENSIVE SALES PLANS TAILORED TO THE HEALTHCARE / PHARMA SECTOR.EXCEED SALES TARGETS, INCREASE MARKET SHARE, AND DRIVE POSITIVE SOCIAL IMPACT, EMPHASIZING DIVERSITY AND INCLUSION.RESPONSIBLE FOR GENERATING $1,000.000.00 ANNUALLY IN NEW SIGNINGS.\n\n COLLABORATION AND ALIGNMENT: \n\nCOLLABORATE WITH INTERNAL TEAMS, INCLUDING PRODUCT DEVELOPMENT, MARKETING, AND ANALYTICS, TO ENSURE THE ALIGNMENT OF DATA OFFERINGS WITH THE DIVERSE REQUIREMENTS AND GOALS OF HEALTHCARE / PHARMA ORGANIZATIONS.\n\n MARKET INSIGHTS AND INNOVATION: \n\nSTAY INFORMED ABOUT INDUSTRY TRENDS, COMPETITOR ACTIVITIES, AND MARKET SHIFTS WITHIN THE HEALTHCARE / PHARMA SPACE.IDENTIFY NEW OPPORTUNITIES, INNOVATIONS AND EMERGING DATA-DRIVEN STRATEGIES THAT CAN BENEFIT HEALTHCARE / PHARMA ORGANIZATIONS.\n\n REPORTING AND ANALYSIS: \n\nUTILIZE SALES PERFORMANCE DATA TO GENERATE REPORTS, ANALYZE RESULTS, AND PRESENT FINDINGS TO SENIOR MANAGEMENT.MAKE DATA-DRIVEN RECOMMENDATIONS FOR FUTURE STRATEGIES AND DEVELOPMENTS.\n\n NEW LOGO PURSUIT: \n\nIDENTIFY AND LEAD THE PURSUIT OF TARGETED NEW LOGO BUSINESS AND CONTRACT EXPANSION OPPORTUNITIES WITHIN TARGET ACCOUNTS.CREATE AND CULTIVATE RESOURCES WHILE ACTIVELY SEEKING AND NURTURING NEW BUSINESS PROSPECTS.IDENTIFY AND MANAGE RESOURCES TO DEVELOP PROPOSALS THAT POSITION THE FULL RANGE OF EPSILON'S CAPABILITIES AND DATA SOLUTIONS TO CUSTOMERS.\n\n PREFERRED QUALIFICATIONS: \n\nDEMONSTRATED EXPERIENCE AND KNOWLEDGE OF THE HEALTHCARE / PHARMA SECTOR.PROVEN TRACK RECORD OF SUCCESSFUL SALES LEADERSHIP WITHIN THE HEALTHCARE / PHARMA SECTOR.UNDERSTANDING OF DATA-DRIVEN TECHNOLOGIES AND ANALYTICS IN THE HEALTHCARE / PHARMA SECTOR.ABILITY TO CREATE AND EXECUTE SALES STRATEGIES ALIGNED WITH THE GOALS AND MISSION OF HEALTHCARE / PHARMA ORGANIZATIONS.PROVEN ABILITY TO BUILD AND MAINTAIN RELATIONSHIPS WITH KEY STAKEHOLDERS.EXPERIENCE WORKING COLLABORATIVELY WITH CROSS-FUNCTIONAL TEAMS SUCH AS PRODUCT DEVELOPMENT, MARKETING, ANALYTICS, AND OTHER RELEVANT DEPARTMENTS TO ALIGN DATA OFFERINGS WITH THE HEALTHCARE / PHARMA SECTOR.KNOWLEDGE OF DIRECT-TO-CONSUMER AND DIRECT-TO-PRACTITIONER MARKETING PROGRAMS.STRONG BUSINESS, COMMUNICATION AND PRESENTATION SKILLS AND THE ABILITY TO ADVOCATE FOR THE VALUE OF DATA-DRIVEN SOLUTIONS.\n\n REQUIREMENTS: \n\nBACHELOR'S DEGREE IN BUSINESS ADMINISTRATION, SALES, MARKETING, OR RELATED FIELD. MASTER'S DEGREE PREFERRED.8-10+ YEARS OF SUCCESSFUL SALES EXPERIENCE, WITH A FOCUS ON DATA-DRIVEN PRODUCTS OR SERVICES, ESPECIALLY WITHIN THE HEALTHCARE / PHARMA SECTOR.PROVEN LEADERSHIP EXPERIENCE IN SALES ROLES, WITH A TRACK RECORD OF DRIVING REVENUE GROWTH AND FOSTERING STRONG CLIENT RELATIONSHIPS.EXCELLENT COMMUNICATION, NEGOTIATION, AND COLLABORATION SKILLS, WITH A PASSION FOR SOCIAL IMPACT AND DEDICATION TO MAKING A DIFFERENCE THROUGH DATA-DRIVEN SOLUTIONS.ABILITY TO TRAVEL AS NEEDED, FOR CLIENT MEETINGS AND INDUSTRY EVENTS.\n\nADDITIONAL INFORMATION\n\nABOUT EPSILON\n\nEPSILON IS A GLOBAL ADVERTISING AND MARKETING TECHNOLOGY COMPANY POSITIONED AT THE CENTER OF PUBLICIS GROUPE. EPSILON ACCELERATES CLIENTS' ABILITY TO HARNESS THE POWER OF THEIR FIRST-PARTY DATA TO ACTIVATE CAMPAIGNS ACROSS CHANNELS AND DEVICES, WITH AN UNPARALLELED ABILITY TO PROVE OUTCOMES. THE COMPANY'S INDUSTRY-LEADING TECHNOLOGY CONNECTS ADVERTISERS WITH CONSUMERS TO DRIVE PERFORMANCE WHILE RESPECTING AND PROTECTING CONSUMER PRIVACY. EPSILON'S PEOPLE-BASED IDENTITY GRAPH ALLOWS BRANDS, AGENCIES AND PUBLISHERS TO REACH REAL PEOPLE, NOT COOKIES OR DEVICES, ACROSS THE OPEN WEB. FOR MORE INFORMATION, VISIT EPSILON.COM.\n\nWHEN YOU'RE ONE OF US, YOU GET TO RUN WITH THE BEST.FOR DECADES, WE'VE BEEN HELPING MARKETERS FROM THE WORLD'S TOP BRANDS PERSONALIZE EXPERIENCES FOR MILLIONS OF PEOPLE WITH OUR CUTTING-EDGE TECHNOLOGY, SOLUTIONS AND SERVICES. EPSILON'S BEST-IN-CLASS IDENTITY GIVES BRANDS A CLEAR, PRIVACY-SAFE VIEW OF THEIR CUSTOMERS, WHICH THEY CAN USE ACROSS OUR SUITE OF DIGITAL MEDIA, MESSAGING AND LOYALTY SOLUTIONS. WE PROCESS 400+ BILLION CONSUMER ACTIONS EACH DAY AND HOLD MANY PATENTS OF PROPRIETARY TECHNOLOGY, INCLUDING REAL-TIME MODELING LANGUAGES AND CONSUMER PRIVACY ADVANCEMENTS. THANKS TO THE WORK OF EVERY EMPLOYEE, EPSILON HAS BEEN CONSISTENTLY RECOGNIZED AS INDUSTRY-LEADING BY FORRESTER, ADWEEK AND THE MRC. POSITIONED AT THE CORE OF PUBLICIS GROUPE, EPSILON IS A GLOBAL COMPANY WITH MORE THAN 8,000 EMPLOYEES AROUND THE WORLD. CHECK OUT A FEW OF THESE RESOURCES TO LEARN MORE ABOUT WHAT MAKES EPSILON SO EPIC:\n\nOUR CULTURE: ;/LI>LIFE AT EPSILON: ;/LI>DE&I: ;/LI>CSR: ;/LI>\n\nGREAT PEOPLE DESERVE GREAT BENEFITS\n\nWE KNOW THAT WE HAVE SOME OF THE BRIGHTEST AND MOST TALENTED ASSOCIATES IN THE WORLD, AND WE BELIEVE IN REWARDING THEM ACCORDINGLY. IF YOU WORK HERE, EXPECT COMPETITIVE PAY, COMPREHENSIVE HEALTH COVERAGE, AND ENDLESS OPPORTUNITIES TO ADVANCE YOUR CAREER.\n\nEPSILON IS AN EQUAL OPPORTUNITY EMPLOYER. EPSILON'S POLICY IS NOT TO DISCRIMINATE AGAINST ANY APPLICANT OR EMPLOYEE BASED ON ACTUAL OR PERCEIVED RACE, AGE, SEX OR GENDER (INCLUDING PREGNANCY), MARITAL STATUS, NATIONAL ORIGIN, ANCESTRY, CITIZENSHIP STATUS, MENTAL OR PHYSICAL DISABILITY, RELIGION, CREED, COLOR, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION (INCLUDING TRANSGENDER STATUS), VETERAN STATUS, GENETIC INFORMATION, OR ANY OTHER CHARACTERISTIC PROTECTED BY APPLICABLE FEDERAL, STATE OR LOCAL LAW. EPSILON ALSO PROHIBITS HARASSMENT OF APPLICANTS AND EMPLOYEES BASED ON ANY OF THESE PROTECTED CATEGORIES. EPSILON WILL PROVIDE ACCOMMODATIONS TO APPLICANTS NEEDING ACCOMMODATIONS TO COMPLETE THE APPLICATION PROCESS.\n\nFOR SAN FRANCISCO BAY AND LOS ANGELES AREAS: EPSILON WILL CONSIDER FOR EMPLOYMENT QUALIFIED APPLICANTS WITH CRIMINAL HISTORIES IN A MANNER CONSISTENT WITH THE CITY OF LOS ANGELES' FAIR CHANCE INITIATIVE FOR HIRING ORDINANCE AND SAN FRANCISCO POLICE CODE SECTIONS 4901-4919, COMMONLY REFERRED TO AS THE SAN FRANCISCO FAIR CHANCE ORDINANCE.APPLICANTS WITH CRIMINAL HISTORIES ARE WELCOME TO APPLY.\n\nREF218830U BUSINESS DEVELOPMENT VICE PRESIDENT - HEALTHCARE / PHARMA VERTICAL (REMOTE)\n\n",
    "job_skill_set": [
      "sales strategy",
      "healthcare knowledge",
      "leadership",
      "market analysis",
      "sales planning",
      "collaboration",
      "reporting and analysis",
      "negotiation",
      "business development",
      "communication",
      "relationship building",
      "teamwork",
      "problem solving",
      "presentation skills",
      "adaptability",
      "data-driven solutions",
      "data analytics",
      "social impact awareness"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "analytics",
      "and",
      "awareness",
      "building",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "data",
      "datadriven",
      "development",
      "healthcare",
      "impact",
      "knowledge",
      "leadership",
      "market",
      "negotiation",
      "pharma",
      "planning",
      "presentation",
      "president",
      "problem",
      "relationship",
      "remote",
      "reporting",
      "sales",
      "skills",
      "social",
      "solutions",
      "solving",
      "strategy",
      "teamwork",
      "vertical",
      "vice"
    ]
  },
  {
    "job_id": "3899521967",
    "job_title": "Business Development Specialist",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "A RAPIDLY EXPANDING WHOLESALE DISTRIBUTOR SPECIALIZING IN TOP-TIER DIAMOND BLADES AND CORE BITS IS LOOKING FOR HIGHLY MOTIVATED BUSINESS DEVELOPMENT REPRESENTATIVES TO BUILD STRONG BUSINESS-TO-BUSINESS RELATIONSHIPS. THE IDEAL CANDIDATES POSSESSES A DEEP UNDERSTANDING OF SALES AND A KNACK FOR CUSTOMER SERVICE.\nOUR CLIENT HAS THREE NEWLY CREATED ROLES THE WEST COAST, CENTRAL, AND GULF TERRITORIES! SALARY: BASE SALARY OF $55,000-$70,000 DOEUNCAPPED COMMISSION - 1ST YEAR OTE $8,000-$14,000ANNUAL BONUS - $5,000-$10,000 BENEFITS STIPENDLAPTOPCELL PHONEAMEX FOR COMPANY TRAVEL AND EXPENSE.\nLOCATION: DALLAS, TX OR PHOENIX, AZ OR INDIANAPOLIS, IN - REMOTETYPE OF POSITION: DIRECT HIRE RESPONSIBILITIES: GENERATE SALES USING TELEPHONE, EMAIL COMMUNICATION, AND SITE VISITS ACROSS THE WESTCOAST REGION.MAKE INTRODUCTORY AND FOLLOW-UP CALLS TO GENERATE AND CLOSE SALES.GROW EXISTING BUSINESS BY EFFECTIVELY COMMUNICATING PRODUCTS.STAY KNOWLEDGEABLE ON MARKET AND PRODUCT TRENDS.ATTEND TRADESHOWS.COMMUNICATE WITH CLIENTS REGARDING NEW PRODUCTS AND PRICING.ESTABLISH AND BUILD LASTING RELATIONSHIPS WITHIN YOUR TERRITORY.\nREQUIREMENTS:HIGH SCHOOL OR EQUIVALENT PREFERRED2+ YEAR EXPERIENCE IN B2B SALES AND CUSTOMER SERVICE REQUIRED.MUST BE A QUICK LEARNER WITH THE ABILITY TO RAPIDLY BUILD STRONG B2B RELATIONSHIPS.AN ENGAGING PERSONALITY IS CRITICAL TO GENERATE SALES USING TELEPHONE, EMAIL COMMUNICATION, AND SITE VISITS.PROFESSIONAL COMMUNICATION, DEMEANOR, AND APPEARANCE REQUIRED.ATTENTION TO DETAIL WITH GREAT ORGANIZATIONAL AND FOLLOW-UP SKILLS.MUST BE EXTREMELY SELF-MOTIVATED AND VERY COMFORTABLE WITH MAKING INTRODUCTORY AND FOLLOW-UP CALLS IN ORDER TO GENERATE AND CLOSE SALES.LOCAL AND REGIONAL TRAVEL REQUIRED. 5-10% OVERNIGHT TRAVEL TO BE EXPECTED.RELIABLE TRANSPORTATION AND A CLEAN DRIVING RECORD, PHONE, INTERNET, AND EMAIL ACCESS REQUIRED.MUST BE AVAILABLE TO PHONE, EMAIL, AND VISIT CUSTOMERS DURING REGULAR BUSINESS HOURS.",
    "job_skill_set": [
      "B2B Sales",
      "Customer Service",
      "Sales Generation",
      "Market Knowledge",
      "Organizational Skills",
      "Communication Skills",
      "Follow-up Skills",
      "Self-Motivation",
      "Relationship Building",
      "Engaging Personality",
      "Attention to Detail",
      "Professionalism",
      "Travel Management"
    ],
    "short_keywords": [
      "attention",
      "b2b",
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "customer",
      "detail",
      "development",
      "engaging",
      "followup",
      "generation",
      "knowledge",
      "management",
      "market",
      "organizational",
      "personality",
      "professionalism",
      "relationship",
      "sales",
      "selfmotivation",
      "service",
      "skills",
      "specialist",
      "to",
      "travel"
    ]
  },
  {
    "job_id": "3904989753",
    "job_title": "Senior Business Development Manager - Lithium-Ion Batteries",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "SENIOR BUSINESS DEVELOPMENT MANAGER - LITHIUM-ION BATTERIES\nI AM HIRING FOR AN EXPERIENCED BUSINESS DEVELOPMENT MANAGER TO JOIN A BATTERY SCALE-UP REVOLUTIONISING WHAT IS POSSIBLE FOR LI-ION BATTERIES. THEIR TECHNOLOGY ENABLES A DRASTIC INCREASE IN OUTPUT AND CAN BE UTILISED ACROSS A VARIETY OF INDUSTRIES FROM ELECTRIC VEHICLES TO DRONES. \nYOU WILL BE THE FIRST ON THE GROUND SO IT'S IMPORTANT TO HAVE A HUNTER MENTALITY AND PROVEN TRACK RECORD WITHIN THE BATTERY INDUSTRY. SOMEONE COMFORTABLE MANAGING THE FULL SALES CYCLE FROM CREATING THE INITIAL STRATEGY, COLD OUTREACH, RIGHT THROUGH TO CLOSING/NEGOTIATING DEALS.\nQUALIFICATIONSA PROVEN TRACK RECORD MANAGING THE FULL SALES CYCLE. ABILITY TO GENERATE NEW BUSINESS FROM SCRATCH. STRONG BATTERY KNOWLEDGE.ABILITY TO WORK AUTONOMOUSLY. HAVE A HUNTER MENTALITY.\nIF THIS SOUNDS INTERESTING AND YOU'D LIKE TO LEARN MORE, CLICK THE LINK BELOW TO APPLY OR EMAIL ME WITH A COPY OF YOUR CV ON SK@EU-RECRUIT.COM\nBY APPLYING TO THIS ROLE YOU UNDERSTAND THAT WE MAY COLLECT YOUR PERSONAL DATA AND STORE AND PROCESS IT ON OUR SYSTEMS. FOR MORE INFORMATION PLEASE SEE OUR PRIVACY NOTICE (HTTPS://EU-RECRUIT.COM/ABOUT-US/PRIVACY-NOTICE/)",
    "job_skill_set": [
      "business development",
      "sales cycle management",
      "cold outreach",
      "negotiation",
      "strategy creation",
      "autonomous work",
      "hunter mentality",
      "proven track record",
      "communication",
      "battery technology"
    ],
    "short_keywords": [
      "autonomous",
      "batteries",
      "battery",
      "business",
      "businessdevelopment",
      "cold",
      "communication",
      "creation",
      "cycle",
      "development",
      "hunter",
      "lithiumion",
      "management",
      "manager",
      "mentality",
      "negotiation",
      "outreach",
      "proven",
      "record",
      "sales",
      "senior",
      "strategy",
      "technology",
      "track",
      "work"
    ]
  },
  {
    "job_id": "3902351411",
    "job_title": "Business Development Manager",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "BUSINESS DEVELOPMENT MANAGER ARE YOU AN EXPERT AT FINDING UNTAPPED BUSINESS OPPORTUNITIES AND CULTIVATING NEW RELATIONSHIPS WITH PROSPECTIVE CLIENTS? ARE YOU PASSIONATE ABOUT SOLVING CLIENT PROBLEMS AND UNDERSTAND THE CHALLENGE OF SELLING SERVICES OVER PRODUCTS? OUR CLIENTS HIRE US FOR AUTOMATION, CONTENT MANAGEMENT, PRODUCT MANAGEMENT, AND BUSINESS ANALYSIS SERVICES AND SOMETIMES WE SELL THEM OUR PARTNERS’ SOFTWARE PLATFORMS TOO. DO YOU HAVE A GIFT FOR SELLING AND POSSESS A STRONG TECHNICAL APTITUDE? WE ARE LOOKING FOR A BUSINESS DEVELOPMENT MANAGER TO BOOST SALES AND CONTRIBUTE TO OUR LONG-TERM BUSINESS GROWTH. YOU WILL BE TRUSTED TO DIVE IN, DEVELOP A STRATEGY, USE INITIATIVE, AND TAKE THE LEAD. AN INDEPENDENT, SELF-STARTER WHO HAS AN ENTREPRENEURIAL SPIRIT WHILE BEING ACHIEVEMENT-ORIENTED WILL THRIVE IN THIS ROLE. THE IDEAL CANDIDATE FOR THIS POSITION WILL HAVE EXPERIENCE SELLING PROFESSIONAL SERVICES RELATED TO AUTOMATIONS, IPAAS, OR BUSINESS PROCESS MANAGEMENT IMPLEMENTATIONS. ANY GREAT CANDIDATE MUST HAVE A PROVEN TRACK RECORD OF FINDING AND DEVELOPING NEW LEADS, COLLABORATING ON THE DEVELOPMENT AND IMPLEMENTATION OF MARKETING CAMPAIGNS, AND CONSISTENTLY EXCEEDING SALES QUOTAS. THEY WILL HAVE STELLAR WRITTEN AND VERBAL COMMUNICATION SKILLS AND A HIGH EMOTIONAL IQ TO CULTIVATE STRONG RELATIONSHIPS WITH CUSTOMERS – FROM THE BEGINNING OF THE SALES CYCLE THROUGH CLOSING THE DEAL---AND TRANSITIONING TO INTERNAL DELIVERY TEAMS. IF YOU ENJOY WORKING IN A TEAM ENVIRONMENT, ARE SELF-MOTIVATED AND RESULTS-DRIVEN, AND WANT TO DO YOUR BEST WORK - WE’D LIKE TO MEET YOU! \nESSENTIAL DUTIES AND RESPONSIBILITIES: BUILD A PIPELINE OF QUALIFIED LEADS, AND SPEARHEAD NEW BUSINESS OPPORTUNITIES THROUGH THE SALES PROCESS- INCLUDING WORKING COLLABORATIVELY WITH MARKETING, SALES, TECHNOLOGY, AND EXECUTIVE TEAMS PROACTIVELY CONDUCT RESEARCH INTO TARGET ORGANIZATIONS TO UNCOVER BUSINESS NEEDS AND OPPORTUNITIES AND DEMONSTRATE KNOWLEDGE OF GO-TO-MARKET PROPOSITIONS AND PRODUCT OFFERINGS, BUSINESS CHALLENGES, AND CUSTOMER OPPORTUNITIES UTILIZE A CONSULTATIVE APPROACH TO BUILDING MEANINGFUL RELATIONSHIPS WITH PROSPECTS THAT OPENS ACCESS TO KEY DECISION MAKERS TO UNCOVER NEW OPPORTUNITIES AND VALUE-ADDED RELATIONSHIPS TAKE THE LEAD ROLE IN DEVELOPING NEW-BUSINESS PROPOSALS THAT CREATE AND NURTURE OPPORTUNITIES AND PARTNERSHIPS DRIVE NEW REVENUE AND GROWTH FOR THE ORGANIZATION BY IDENTIFYING OPPORTUNITIES TO CROSS-SELL AND UP-SELL OPPORTUNITIES FOR EXPANSION MANAGING MULTIPLE QUALIFIED OPPORTUNITIES SIMULTANEOUSLY THROUGH THE SALES PROCESS AND CLOSING SALES DEFINE, EVANGELIZE, AND EXECUTE SHORT-, MEDIUM-, AND LONG-TERM STRATEGIES RESPONSIBLE FOR CREATING, PLANNING, AND DELIVERING ENGAGING CUSTOMER-FACING CONTENT (SALES DECKS, ETC.) MAINTAIN AND SHARE PROFESSIONAL KNOWLEDGE THROUGH EDUCATION, NETWORKING EVENTS, AND PRESENTATIONS CONTACT POTENTIAL CLIENTS THROUGH COLD CALLS AND EMAILS \nREQUIREMENTS: 5+ YEARS OF EXPERIENCE AS A BUSINESS DEVELOPMENT MANAGER FOR A PROFESSIONAL SERVICES ORGANIZATION EXPERIENCE SELLING SOFTWARE PLATFORMS WITH IDEAL CANDIDATES HAVING SOLD AUTOMATION SOFTWARE SUCH AS WORKATO, BOOMI, MULESOFT, APPIAN, JITTERBIT EXPERIENCE WITH HUBSPOT, SALESINTEL, AND TASK MANAGEMENT SOFTWARE OUTSTANDING LISTENING SKILLS: CANDIDATE MUST BE ABLE TO LISTEN TO CLIENT CHALLENGES AND UNSPOKEN OBJECTIONS, AND DEVELOP INSIGHTS INTO WINNING STRATEGIES A SELF-STARTER WITH HIGH ATTENTION TO DETAIL AND AN ABILITY TO MANAGE AND EXECUTE MANY PRIORITIES SIMULTANEOUSLY EXCEPTIONAL VERBAL, WRITTEN, AND PRESENTATION SKILLS- MUST BE ABLE TO CRAFT PERSUASIVE AND POLISHED WRITTEN COMMUNICATIONS MUST BE AUTHENTIC, DISCIPLINED, AND COMFORTABLE PRESENTING TO EXECUTIVE-LEVEL AUDIENCES IN TECHNOLOGY MAINTAIN ACCURATE PIPELINE MANAGEMENT WITH EXPERT-LEVEL FORECASTING \n\n",
    "job_skill_set": [
      "business development",
      "sales",
      "presentation skills",
      "communication",
      "relationship building",
      "self-motivation",
      "initiative",
      "teamwork",
      "problem solving",
      "attention to detail",
      "emotional intelligence",
      "adaptability",
      "entrepreneurial spirit",
      "automation software",
      "software platforms",
      "pipeline management",
      "market research",
      "consultative selling",
      "HubSpot",
      "SalesIntel",
      "task management software",
      "forecasting"
    ],
    "short_keywords": [
      "adaptability",
      "attention",
      "automation",
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "consultative",
      "detail",
      "development",
      "emotional",
      "entrepreneurial",
      "forecasting",
      "hubspot",
      "initiative",
      "intelligence",
      "management",
      "manager",
      "market",
      "pipeline",
      "platforms",
      "presentation",
      "problem",
      "relationship",
      "research",
      "sales",
      "salesintel",
      "selfmotivation",
      "selling",
      "skills",
      "software",
      "solving",
      "spirit",
      "task",
      "teamwork",
      "to"
    ]
  },
  {
    "job_id": "3901372756",
    "job_title": "Business Development Representative",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "BUSINESS DEVELOPMENT REPRESENTATIVE \nAT SEARCH SOLUTION GROUP, BUSINESS DEVELOPMENT REPRESENTATIVES ARE AT THE TOP OF THE SALES FUNNEL; BUILDING CONNECTIONS AND WORKING TO GET POTENTIAL CLIENTS ON THE PHONE WITH BUSINESS DEVELOPMENT EXECUTIVES. \nTHE IDEAL CANDIDATE WILL BE RESPONSIBLE FOR CREATING AND EXECUTING OUR EMAIL MARKETING STRATEGY. YOU WILL LEAD OUR EMAIL/SALES MARKETING CAMPAIGNS, EVALUATE OUR EMAIL MARKETING/SALES PERFORMANCE METRICS, AND COLLABORATE WITH INTERNAL TEAMS. YOU WILL HAVE A STRONG DESIRE/PASSION TO GET NEW BUSINESS. THE IDEAL CANDIDATE HAS A BACKGROUND WITH EXCELLENT COMMUNICATION SKILLS AND ATTENTION TO DETAIL. \nTHIS POSITION REQUIRES NO COLD CALLING. \nBUSINESS DEVELOPMENT REPRESENTATIVES HAVE MOVED INTO VARIOUS ROLES WITHIN OUR COMPANY INCLUDING ROLES SUCH AS BUSINESS DEVELOPMENT EXECUTIVE; EXECUTIVE RECRUITER; MARKETING MANAGER; AND MORE. \nWHILE WE PUT A LOT OF THOUGHT INTO THIS JOB DESCRIPTION, IT IS BY NO MEANS ALL-ENCOMPASSING. BEING AN “ATHLETE” ABLE TO TAKE ON NEW OR EXPANDED RESPONSIBILITIES IS A CORE VALUE FOR OUR COMPANY. \nPOSITION SUMMARY • BUILDING AN ORGANIZED PLAN TO PENETRATE THE NATIONAL MARKET, DEVELOPING NEW BUSINESS FOR OUR EXECUTIVE SEARCH SERVICES • UNDERSTAND AND SELL THE VALUE PROPOSITION IN WORKING WITH SSG AND OUR DIFFERENT DIVISIONS • PARTNER WITH OUR EXECUTIVE LEADERSHIP TEAM • ENSURE REPORTING AND METRICS ARE UPDATED WEEKLY OR AS REQUIRED • STAY AWARE OF LOCAL AND NATIONAL BUSINESS NEWS—AND HOW THAT COULD IMPACT THEIR HIRING DECISIONS \nEDUCATION AND EXPERIENCE • STRONG RESEARCH SKILLS COUPLED WITH CREATIVE THINKING • BACHELOR’S DEGREE OR EQUIVALENT EXPERIENCE REQUIRED. • STRONG ORAL AND WRITTEN SKILLS ARE REQUIRED • MUST HAVE A HIGH ATTENTION TO DETAIL AND POSSESS STRONG ORGANIZATIONAL AND MULTI-TASKING SKILLS • HIGHLY PROFICIENT IN WORD, EXCEL, AND OUTLOOK • EXCELLENT RELATIONSHIP BUILDING SKILLS • ENJOYS WORKING IN A FAST-PACED INDUSTRY • OVERALL HAPPINESS—A POSITIVE OUTLOOK AND MINDSET IS AN IMPORTANT PART OF OUR FIRM",
    "job_skill_set": [
      "email marketing",
      "sales performance metrics",
      "Microsoft Word",
      "Microsoft Excel",
      "Microsoft Outlook",
      "communication",
      "attention to detail",
      "organizational skills",
      "multi-tasking",
      "relationship building",
      "creative thinking",
      "adaptability",
      "research skills",
      "positive outlook"
    ],
    "short_keywords": [
      "adaptability",
      "attention",
      "building",
      "business",
      "businessdevelopment",
      "communication",
      "creative",
      "detail",
      "development",
      "email",
      "excel",
      "marketing",
      "metrics",
      "microsoft",
      "multitasking",
      "organizational",
      "outlook",
      "performance",
      "positive",
      "relationship",
      "representative",
      "research",
      "sales",
      "skills",
      "thinking",
      "to",
      "word"
    ]
  },
  {
    "job_id": "3902360084",
    "job_title": "Director of Business Development - Alliance Partnerships",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "OM1 IS ON A MISSION TO IMPROVE HEALTH OUTCOMES BY UNLOCKING THE POWER OF DATA. WE ARE A HEALTHCARE DATA AND TECHNOLOGY COMPANY FOCUSED ON REAL WORLD CLINICAL DATA AND OUTCOMES, ACCELERATING MEDICAL RESEARCH AND PERSONALIZING HEALTHCARE. OUR INTERDISCIPLINARY TEAM USES EXPERTISE IN MEDICINE, SOFTWARE, BIG DATA, MACHINE LEARNING, PUBLIC HEALTH AND MATHEMATICS TO TRANSFORM RECORDS FROM A DIVERSE SET OF SOURCES INTO ENRICHED, RESEARCH GRADE DATA WHICH ALLOWS US TO GENERATE UNIQUE INSIGHTS IN A VARIETY OF DISEASE AREAS.\nTHE DIRECTOR / SR. DIRECTOR, BUSINESS DEVELOPMENT - ALLIANCE PARTNERSHIPS WILL FOCUS ONFORMING ALLIANCES WITH PROFESSIONAL ORGANIZATIONS AND CHANNEL PARTNERS AND WILL ASSUME A MULTIFACETED ROLE COMBINING STRATEGIC LEADERSHIP WITH HANDS-ON BUSINESS DEVELOPMENT EFFORTS TO ENHANCE ORGANIZATIONAL GROWTH. \nTHIS ROLE IS DESIGNED FOR A DYNAMIC AND STRATEGIC INDIVIDUAL RESPONSIBLE FOR DRIVING BUSINESS GROWTH THROUGH DEVELOPING AND MANAGING ALLIANCES WITH PROFESSIONAL ORGANIZATIONS AND CHANNEL PARTNERS. \nWHAT YOU'LL DO AT OM1PARTNERSHIP MANAGEMENT: CULTIVATE, DEVELOP, AND MAINTAIN RELATIONSHIPS WITH KEY STAKEHOLDERS WITHIN PARTNER ORGANIZATIONS. NEGOTIATE AND MANAGE PARTNERSHIP AGREEMENTS TO ENSURE MUTUALLY BENEFICIAL OUTCOMES. COLLABORATE WITH INTERNAL TEAMS TO ENSURE THE SUCCESSFUL EXECUTION OF PARTNERSHIP INITIATIVES.SALES AND BOOKINGS GENERATION: DIRECTLY ENGAGE WITH PARTNERS IN BUSINESS DEVELOPMENT ACTIVITIES TO ACHIEVE INDIVIDUAL SALES TARGETS THROUGH THOSE PARTNERS. MONITOR AND REPORT ON THE PERFORMANCE AND EFFECTIVENESS OF PARTNERSHIP INITIATIVES, ENSURING THE ATTAINMENT OF BOOKINGS GOALS. THIS WILL INCLUDE MANAGEMENT OF CHANNEL CONFLICT BETWEEN PARTNER AND DIRECT SALES.OPERATIONAL EXCELLENCE: ENSURE THE INTEGRATION OF PARTNERSHIPS ALIGNS WITH THE OVERALL BUSINESS STRATEGY AND OBJECTIVES.OPTIMIZE PROCESSES AND RESOURCES TO ENSURE THE EFFICIENT EXECUTION OF BUSINESS DEVELOPMENT ACTIVITIES.UNDERSTAND YOUR PARTNERS’ STRENGTHS, WEAKNESSES, AND OPPORTUNITIES TO PROMOTE SUCCESSFUL CLIENT ENGAGEMENTS AND PROVIDE SALES SUPPORT TO ENCOURAGE EXPANDING INTO AREAS WHERE THE PARTNER MAY NOT REALIZE OM1 CAN PROVIDE SOLUTIONS.RAPIDLY ITERATE WITH SALES LEADERSHIP, SALES ENABLEMENT TEAM, MARKETING, AND OTHER KEY STAKEHOLDERS TO ACCELERATE AND EXECUTE ON GO-TO-MARKET AND DRIVE NEW BUSINESS OPPORTUNITIES ACROSS OUR TARGET MARKETS THROUGH THE DESIGNATED CHANNEL PARTNERS. THIS INCLUDES CO-MARKETING AND CO-BRANDING OPPORTUNITIES WHEN APPROPRIATE.PLAN AND SUPPORT ALL INDIRECT SALES ACTIVITIES, INCLUDING PROSPECTING, LEAD DEVELOPMENT / FOLLOW-UP, CUSTOMER MEETINGS, PRESENTATION, PROPOSAL AND BUDGET DEVELOPMENT.ANALYZE POTENTIAL OPPORTUNITIES AND DEVELOP SALES STRATEGIES FOR EACH PARTNERSHIP, IDEALLY LEVERAGING PRE-EXISTING RELATIONSHIPS AND CUSTOMER NETWORKS.CULTIVATE MEANINGFUL, LONG-TERM RELATIONSHIPS WITH KEY PARTNER SALES AND SUPPORT PERSONNEL AND DEVELOP DEEP KNOWLEDGE OF THE PARTNER ORGANIZATION.ACTIVELY NETWORK IN THE INDUSTRY TO ESTABLISH RELATIONSHIPS AND TO IDENTIFY POTENTIAL OPPORTUNITIES.UNDERSTAND PARTNER SALES ACTIVITIES AND MONITOR PARTNERS’ REPRESENTATION OF OM1 AS THEIR LEAD PARTNER SOLUTION. UNDERSTAND REASONS FOR AWARDS AND NON-AWARDS FOR PARTNER OPPORTUNITIES.ENSURE APPROPRIATE PROPOSAL/DELIVERY APPROACH TO BEST ADDRESS THE NEEDS OF EACH PROPOSED OPPORTUNITY. MONITOR CLIENT AND PARTNER RESPONSE TO PROPOSALS TO IMPROVE FUTURE PROPOSALS.WORK WITH THE PARTNER TO OPTIMIZE OM1 VALUE AND THOUGHT LEADERSHIP IN PARTNER PROPOSALS TO CLIENTS. ASSIST AND CO-SELL AS NEEDED PROPOSAL AND BUDGET DEVELOPMENT TEAMS TO PRESENT THE APPROPRIATE SOLUTION FOR EACH PROJECT AND CONTINUOUSLY IMPROVE ON OUR PROPOSAL AND BID DEFENSE PROCESSES AS WELL AS OUR DESCRIPTIONS OF SERVICES / DELIVERY.MAINTAIN CUSTOMER/PARTNER PRESENTATION TEMPLATES TO ENSURE THEY HIGHLIGHT THE PRIMARY VALUE OF OM1’S APPROACH AND PRESENT THE KEY MESSAGES, USE CASES, AND OPERATIONAL PLANS CUSTOMERS EXPECT.ESTABLISH BRAND RECOGNITION; COMMUNICATE WITH INTERNAL PROJECT MANAGERS TO ASSESS OVERALL LEVEL OF CUSTOMER SATISFACTION AND PROGRESS OF PROJECTS.HANDLE FOLLOW-UP RELATED TO THE SALE AND DRIVE COMPLETION OF CONTRACTUAL DOCUMENTS.UTILIZE CRM TO ESTABLISH REPORTS AND DASHBOARDS TO ANALYZE BUSINESS DEVELOPMENT AND SALES ACTIVITIES AND TRACK PROGRESS.MAINTAIN HIGH VISIBILITY WITHIN CUSTOMER ORGANIZATION.\nWHAT EXPERIENCE YOU'LL BRINGEXCELLENT NEGOTIATION, COMMUNICATION, AND INTERPERSONAL SKILLS.ABILITY TO ANALYZE MARKET TRENDS AND FORMULATE STRATEGIC BUSINESS PLANS.STRATEGIC BUSINESS AWARENESS AND ANALYTICAL SKILLS.ADAPTABILITY AND FLEXIBILITY TO CHANGING PRIORITIES.DEMONSTRATED ABILITY TO WORK CREATIVELY AND EFFECTIVELY IN A FAST-PACED, ENTREPRENEURIAL ENVIRONMENT.PROFICIENT IN GOOGLE SUITE, MICROSOFT OFFICE SUITE AND CRM SOFTWARE.7+ YEARS OF EXPERIENCE IN BUSINESS DEVELOPMENT OR SALES, WITH A PROVEN TRACK RECORD OF FORMING SUCCESSFUL PARTNERSHIPS AND 5 YEARS OF EXPERIENCE IN A LEADERSHIP ROLE PREFERRED. BACHELOR’S DEGREE IN BUSINESS, MARKETING, OR RELATED FIELD; MASTER’S DEGREE PREFERRED.\nPHYSICAL REQUIREMENTSPROLONGED PERIODS OF SITTING AT A DESK AND WORKING ON A COMPUTER.MUST BE ABLE TO LIFT UP TO 15 POUNDS AT TIMES. MUST BE ABLE TO TRAVEL AS NEEDED",
    "job_skill_set": [
      "communication",
      "Microsoft Office Suite",
      "business development",
      "data analysis",
      "interpersonal skills",
      "creativity",
      "networking",
      "customer satisfaction",
      "problem solving",
      "team collaboration",
      "negotiation",
      "CRM software",
      "Google Suite",
      "sales strategies",
      "strategic planning",
      "partnership management",
      "adaptability",
      "flexibility",
      "leadership",
      "strategic awareness"
    ],
    "short_keywords": [
      "adaptability",
      "alliance",
      "analysis",
      "awareness",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "creativity",
      "crm",
      "customer",
      "data",
      "development",
      "director",
      "flexibility",
      "google",
      "interpersonal",
      "leadership",
      "management",
      "microsoft",
      "negotiation",
      "networking",
      "of",
      "office",
      "partnership",
      "partnerships",
      "planning",
      "problem",
      "sales",
      "satisfaction",
      "skills",
      "software",
      "solving",
      "strategic",
      "strategies",
      "suite",
      "team"
    ]
  },
  {
    "job_id": "3901349670",
    "job_title": "Principal Business Development Specialist, Portal North Bridge",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "FORBES LIST OF AMERICA'S BEST-IN-STATE EMPLOYERS 2022MOVE FORWARD WITH US! AT NJ TRANSIT, YOU’LL JOIN US IN TRANSFORMING THE THIRD-LARGEST TRANSPORTATION AGENCY IN NORTH AMERICA. WE ARE COMMITTED TO DELIVERING SAFE, RELIABLE SERVICE THAT GETS OUR CUSTOMERS TO THEIR DESTINATIONS ON TIME- AND WE’RE LOOKING TO HIRE TALENTED FOLKS WITH A COMMITMENT TO EXCELLENCE.  ROLES AND RESPONSIBILITIES:AS A MEMBER OF NJ TRANSIT’S OFFICE OF BUSINESS DEVELOPMENT (OBD), LEADS AND PERFORMS THE ADMINISTRATION OF THE DISADVANTAGED BUSINESS ENTERPRISE (DBE) PROGRAM REQUIREMENTS FOR CONTRACT COMPLIANCE, IN ACCORDANCE WITH FEDERAL REGULATION 49 CFR PART 26, FOR ALL ASPECTS OF THE PORTAL NORTH BRIDGE (PNB) MEGA PROJECT. LEADS AND PERFORMS ALL ASPECTS OF THE ON-GOING MONITORING, EVALUATION AND CONTINUING GOOD FAITH EFFORTS OF THE PNB CONTRACTOR’S DBE UTILIZATION AND GOAL ATTAINMENT, IN CONFORMANCE TO THE DBE REQUIREMENTS OF THE CONTRACT, FEDERAL REGULATIONS AND NJ TRANSIT POLICY GOVERNING PROCUREMENT ACTIVITIES. WORKS WITH THE CAPITAL PROGRAMS PM AND CM GROUP (CP/PM-CM), PROCUREMENT AND THE CONTRACTOR TO ENSURE ONGOING EFFORTS TO INCREASE DBE UTILIZATION ARE IDENTIFIED AND CONSIDERED FOR ANY NEW ADDITIONAL WORK, ESPECIALLY FOR CHANGE ORDERS TO THE PROJECT.INTERFACES REGULARLY AND CONSISTENTLY WITH CONTRACTOR/DBES TO OBTAIN FEEDBACK AND REPORTS ON PROCESSES, PROVIDE TECHNICAL GUIDANCE, AND IDENTIFY ANY POTENTIAL PERFORMANCE/PARTNERSHIP ISSUES OR CONCERNS. MANAGES PERFORMANCE CONCERNS AND PAYMENT DISPUTES. FACILITATES, NEGOTIATES AND SUPPORTS RESOLUTION OF DISPUTES AND COMPLAINTS BETWEEN CONTRACTOR, DBES AND/OR NJ TRANSIT. PROVIDES DIRECTION/GUIDANCE IN THE REVIEW, RESEARCH, EVALUATION AND CONTRACT RESOLUTION OF RELATED DBE ISSUES. RECOMMENDS AND IMPLEMENTS APPROPRIATE REMEDIES (I.E. WITHHOLD PAYMENT OF INVOICES, ASSESS LIQUIDATED DAMAGES) WHEN/IF CONTRACTOR OR DBES ARE IN BREACH OF DBE COMPLIANCE ASPECTS OF THE CONTRACT.LEADS EFFORTS TOWARD ENHANCED DBE COMPLIANCE OVERSIGHT RELATED TO PNB. PARTNERS WITH CP/PM-CM TO DEVELOP, IMPLEMENT, MANAGE AND ENHANCE THE PROCESS FOR PNB RELATED COMPLIANCE INVESTIGATIONS AT THE PROJECT SITE(S), AND VARIOUS CONTRACTOR/DBE OFFICES. REVIEWS CONTRACTOR/SUBCONTRACTOR PAYROLL RECORDS AND COPIES OF CANCELLED CHECKS TO ENSURE PROMPT PAYMENT AND COMMERCIALLY USEFUL FUNCTION. COORDINATES WITH INTERNAL AUDIT (IA) TO PERFORM ENHANCED REVIEWS AND SUPPORT THE TIMELY DELIVERY OF DBE FRAUD MONITORING DELIVERABLES AS NEEDED / REQUESTED. DEVELOPS REPORTS AND COMMUNICATION PIECES ON ENHANCED EFFORTS TO PREVENT FRAUD, WASTE AND ABUSE IN THE DBE ASPECTS OF PNB. REGULARLY MANAGES AND INTERFACES IA ON INQUIRIES AND CONCERNS, AND UPDATES ON ALL PNB RELATED ACTIVITIES.SUPERVISES, SUPPORTS AND PROVIDES DIRECTLY (AS NEEDED) TRAINING, GUIDANCE, AND COACHING TO OBD TEAM MEMBERS, DBE CONTRACTOR, CONSULTANT TEAMMATES AND INTERNAL BUSINESS PARTNERS, ON ALL ASPECTS OF THE DBE PROGRAM APPLICABLE TO DBE COMPLIANCE MANAGEMENT FOR THE PNB PROJECT. LEADS AND PERFORMS THE DEVELOPMENT/ENHANCEMENT OF TRAINING AND INFORMATIONAL MATERIALS, FORMS, AND ALL STANDARD DOCUMENTATION FOR ALL NEW AND EXISTING OBD PROCESSES APPLICABLE TO DBE COMPLIANCE MANAGEMENT FOR THE PNB PROJECT. DEVELOPS AND IMPLEMENTS QUALITY ASSURANCE AND QUALITY CONTROLS (E.G. PEER REVIEW, MANAGER/DIRECTOR SIGNOFF.) FOR KEY OBD PROCESSES APPLICABLE TO DBE COMPLIANCE MANAGEMENT FOR THE PNB PROJECT, TO ENSURE WORK PERFORMANCE IS ALIGNED WITH OBD POLICES, STANDARDS, GOALS AND OBJECTIVES.REPRESENT OBD AT AND PARTICIPATE IN INTERNAL/EXTERNAL BUSINESS MEETINGS, OUTREACH EVENTS, WORKSHOPS, AND TRAINING EVENTS, INTERAGENCY AND INTERDEPARTMENTAL FUNCTIONS, AS NEEDED.SUPPORTS AND PARTNERS WITH OBD COMPLIANCE OPERATIONS ON OBD PROGRAMS AND INITIATIVES, AS ASSIGNED.\nEDUCATION, EXPERIENCE AND QUALIFICATIONS:BACHELOR’S DEGREE FROM A US DEPARTMENT OF EDUCATION ACCREDITED COLLEGE OR UNIVERSITYFIVE (5) YEARS OF WORK EXPERIENCE IN A PROFESSIONAL/CORPORATE SETTING, INCLUDING AT LEAST FOUR (4) YEARS OF APPLIED EXPERIENCE IN PUBLIC OR PRIVATE SECTOR D/S/M/W/BE PROGRAM ADMINISTRATION OR PROCUREMENT/CONTRACT ADMINISTRATION (IN A COMPLIANCE FUNCTION) AT THE FEDERAL AND/OR STATE LEVEL.\nKNOWLEDGE AND SKILLS:DEMONSTRATED PROFICIENCY IN DEMONSTRATED PROFICIENCY IN PROJECT MANAGEMENT, BUSINESS PARTNERSHIP MANAGEMENT, PROFESSIONAL COMMUNICATION (ORAL AND WRITTEN) AND PRESENTATION SKILLS REQUIRED..DEMONSTRATED ABILITY TO DEVELOP, ANALYZE AND OPERATIONALIZE PRODUCTIVITY REPORTS.MICROSOFT OFFICE, WORD, EXCEL AND POWERPOINT PROFICIENCY REQUIRED.EXPERIENCE WORKING SUCCESSFULLY IN A METRICS DRIVEN BUSINESS ENVIRONMENT PREFERRED.ONE YEAR OF CLOSELY RELATED EXPERIENCE CAN BE SUBSTITUTED FOR EACH YEAR OF EDUCATION REQUIRED. AT NJ TRANSIT YOU WILL ENJOY A COMPETITIVE SALARY AND EXCELLENT BENEFIT PACKAGE: COMPREHENSIVE FAMILY HEALTH INSURANCE – PRESCRIPTION, DENTAL, VISION FLEXIBLE SPENDING ACCOUNT LIFE INSURANCE PAID LEAVE 401(A), 401(K) RETIREMENT PLANS - UP TO 9% EMPLOYER CONTRIBUTION TUITION ASSISTANCE QUALIFIED TRANSPORTATION EXPENSE PLAN (QTE) \nAT NJ TRANSIT WE SUPPORT AND DEPEND UPON THE DIVERSITY OF OUR STAFF. NJ TRANSIT IS AN EQUAL OPPORTUNITY EMPLOYER.",
    "job_skill_set": [
      "Microsoft Office",
      "Data Analysis",
      "Report Development",
      "Communication",
      "Problem Solving",
      "Interpersonal Skills",
      "Collaboration",
      "Feedback Management",
      "DBE Program Administration",
      "Contract Compliance",
      "Project Management",
      "Quality Assurance",
      "Procurement Administration",
      "Fraud Monitoring",
      "Presentation Skills",
      "Negotiation",
      "Team Leadership",
      "Training and Coaching"
    ],
    "short_keywords": [
      "administration",
      "analysis",
      "and",
      "assurance",
      "bridge",
      "business",
      "businessdevelopment",
      "coaching",
      "collaboration",
      "communication",
      "compliance",
      "contract",
      "data",
      "dbe",
      "development",
      "feedback",
      "fraud",
      "interpersonal",
      "leadership",
      "management",
      "microsoft",
      "monitoring",
      "negotiation",
      "north",
      "office",
      "portal",
      "presentation",
      "principal",
      "problem",
      "procurement",
      "program",
      "project",
      "quality",
      "report",
      "skills",
      "solving",
      "specialist",
      "team",
      "training"
    ]
  },
  {
    "job_id": "3904391045",
    "job_title": "Senior Business Development Manager, Manufacturing Segment",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "THIS POSITION WILL PROSPECT FOR NEW CLIENTS/BUSINESS BY NETWORKING, COLD CALLING, ADVERTISING OR OTHER MEANS OF GENERATING INTEREST FROM POTENTIAL CLIENTS. THEY MUST THEN PLAN PERSUASIVE APPROACHES AND PITCHES THAT WILL CONVINCE POTENTIAL CLIENTS TO DO BUSINESS WITH ABM. THEY ARE ALSO REQUIRED TO GROW AND RETAIN EXISTING ACCOUNTS BY PRESENTING NEW SOLUTIONS AND SERVICES TO CLIENTS. BUSINESS DEVELOPMENT MANAGERS WORK WITH MID AND SENIOR LEVEL MANAGEMENT, MARKETING, AND TECHNICAL STAFF. STRATEGIC PLANNING IS A KEY PART OF THIS JOB DESCRIPTION, SINCE IT IS THE BUSINESS MANAGER’S RESPONSIBILITY TO DEVELOP THE PIPELINE OF NEW BUSINESS COMING IN TO ABM. THIS REQUIRES A THOROUGH KNOWLEDGE OF THE MARKET, THE SOLUTIONS/SERVICES ABM CAN PROVIDE, AND OF ABM’S COMPETITORS.\n\nBENEFIT INFORMATION\n\nABM OFFERS A COMPREHENSIVE BENEFITS PACKAGE. FOR INFORMATION ABOUT ABM’S BENEFITS, VISIT ABM 2023 EMPLOYEE BENEFITS | STAFF & MANAGEMENT\n\nESSENTIAL FUNCTION\n\nSEEK FOR NEW BUSINESS BY COLD CALL ACTIVITIES, NETWORKING, AND LEAD GENERATION & QUALIFICATION. PROSPECT FOR POTENTIAL NEW CLIENTS AND TURN THIS INTO INCREASED BUSINESS. COLD CALL AS APPROPRIATE WITHIN YOUR MARKET OR GEOGRAPHIC AREA TO ENSURE A ROBUST PIPELINE OF NEW OPPORTUNITIES. MEET POTENTIAL CLIENTS BY GROWING, MAINTAINING, AND LEVERAGING YOUR NETWORK. UNDERSTAND CUSTOMER’S NEEDS AND PERFORM SITE SURVEYS. WORK WITH OPERATIONS AND SALES SUPPORT TEAMS TO DEVELOP PROPOSALS THAT MEET THE CLIENT’S NEEDS, CONCERNS, AND OBJECTIVES. PARTICIPATE IN PRICING THE SOLUTION/SERVICE. HANDLE OBJECTIONS BY CLARIFYING, EMPHASIZING AGREEMENTS AND WORKING THROUGH DIFFERENCES TO A POSITIVE CONCLUSION. MAINTAIN REPORTING OF LEADS, IN-PROGRESS ACTIVE PROSPECTS AND SALES FORECAST IN SALESFORCE. FORECAST SALES TARGETS AND ENSURE THEY ARE MET. TRACK AND RECORD ACTIVITY ON ACCOUNTS AND HELP TO CLOSE DEALS TO MEET THESE TARGETS. SPECIAL PROJECTS AND OTHER DUTIES AS ASSIGNED. \n\nREQUIRED QUALIFICATIONS\n\nEDUCATION: \n\nBACHELOR’S DEGREE OR EQUIVALENT EXPERIENCE. \n\nEXPERIENCE\n\n5+ YEARS OF EXPERIENCE, INCLUDING FINDING, QUALIFYING, AND CLOSING NEW BUSINESS PRIMARILY THROUGH COLD CALLS AND SELF-GENERATED LEADS. \n\nOTHER\n\nDEMONSTRATED SUCCESS IN SELLING SERVICES OR OTHER INTANGIBLE BUSINESS OFFERINGS. MUST BE COMFORTABLE PRESENTING COMPLETE SOLUTIONS IN GROUPS SETTINGS. PREFERRED EXPERIENCE SELLING FACILITIES SERVICES WITHIN MANUFACTURING, PHARMACEUTICAL, SANITATION, FOOD & BEVERAGE, ETC. TRACK RECORD OF BEING ORGANIZED, EFFICIENT, AND ABLE TO MANAGE A HIGH NUMBER OF PROSPECTS AT DIFFERENT STAGES OF THE SALES PROCESS. HUNTER SALES MENTALITY, GOAL DRIVEN AND SELF-MOTIVATED. COLLABORATIVE WITH ABILITY TO WORK SUCCESSFULLY WITH INTERNAL OPERATIONS AND SALES SUPPORT TEAMS. ADVANCED COMPUTER SKILLS IN MS OFFICE. KNOWLEDGE OF SALESFORCE OR ANOTHER CRM DESIRABLE. SELF-DISCIPLINED, RESULTS DRIVEN, AND ACCUSTOMED TO WINNING SALES AWARDS THROUGH CONSISTENT HIGH PERFORMANCE. \n\n \n\nLICENSES\n\nA VALID DRIVER'S LICENSE.",
    "job_skill_set": [
      "lead generation",
      "sales forecasting",
      "market knowledge",
      "account management",
      "business development",
      "presentation skills",
      "communication",
      "strategic planning",
      "problem solving",
      "collaboration",
      "self-motivation",
      "organization",
      "goal-driven",
      "customer understanding",
      "adaptability",
      "cold calling",
      "Salesforce",
      "MS Office",
      "proposal development"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "business",
      "businessdevelopment",
      "calling",
      "cold",
      "collaboration",
      "communication",
      "customer",
      "development",
      "forecasting",
      "generation",
      "goaldriven",
      "knowledge",
      "lead",
      "management",
      "manager",
      "manufacturing",
      "market",
      "ms",
      "office",
      "organization",
      "planning",
      "presentation",
      "problem",
      "proposal",
      "sales",
      "salesforce",
      "segment",
      "selfmotivation",
      "senior",
      "skills",
      "solving",
      "strategic",
      "understanding"
    ]
  },
  {
    "job_id": "3902745795",
    "job_title": "Director, Business Development, Enterprise",
    "category": "BUSINESS-DEVELOPMENT",
    "job_description": "OVERVIEW\n\nTHE DIRECTOR OF BUSINESS DEVELOPMENT FOR ENTERPRISE HOLDS THE CRUCIAL RESPONSIBILITY OF BUILDING A TEAM TO PROPEL GROWTH AND REVENUE WITHIN THE ENTERPRISE VERTICAL MARKETS. THIS MULTIFACETED ROLE INVOLVES DEVELOPING AND EXECUTING THE OVERALL SALES STRATEGY, SETTING LONG-TERM GOALS, CREATING SALES POLICIES, COLLABORATING WITH OTHER DEPARTMENTS TO ALIGN SALES EFFORTS WITH BROADER BUSINESS OBJECTIVES, IDENTIFYING AND CULTIVATING TARGET END USERS, EXPANDING MARKET SHARE, AND ENSURING A STELLAR CUSTOMER EXPERIENCE THAT ALIGNS WITH OUR BRAND. THE SUCCESSFUL CANDIDATE WILL BE INSTRUMENTAL IN ENHANCING OUR COMPANY'S PRESENCE IN THIS VITAL VERTICAL.\n\nBASE PAY RANGE $148,000 - $215,000\n\nWE WILL BE ACCEPTING APPLICATIONS UNTIL A FINAL CANDIDATE IS IDENTIFIED.\n\nTHE ABOVE REFLECTS THE PAY RANGE THAT QSC REASONABLY EXPECTS TO PAY FOR THIS ROLE. THIS PAY RANGE ALSO DEPENDS ON VARIOUS FACTORS SUCH AS JOB DUTIES AND REQUIREMENTS, RELEVANT EXPERIENCE AND SKILLS AND GEOGRAPHIC LOCATION. IN ADDITION TO THE BASE SALARY RANGE, QSC OFFERS A COMPREHENSIVE PACKAGE INCLUDING BUT NOT LIMITED TO HEALTH BENEFITS, 401K OR ROTH RETIREMENT PLANS, GENEROUS TIME OFF AND PROFIT SHARING.\n\nQSC THRIVES WHERE INNOVATIVE TECHNOLOGY AND COMPELLING AUDIO-VISUAL EXPERIENCES INTERSECT. FOR OVER 50 YEARS, QSC HAS PIONEERED THE TECHNOLOGY AND SOLUTIONS THAT ENABLE IMMERSIVE CINEMA, LIVE PERFORMANCE AUDIO, THEMED ENTERTAINMENT, DIGITAL COLLABORATION AND MEETING EXPERIENCES FOR OUR CUSTOMERS AND PARTNERS AROUND THE WORLD. A GLOBALLY RECOGNIZED INNOVATOR IN THE DESIGN, ENGINEERING, AND MANUFACTURE OF CATEGORY LEADING HIGH-PERFORMANCE LOUDSPEAKERS, DIGITAL MIXERS, POWER AMPLIFIERS, AUDIO PROCESSORS, DIGITAL CINEMA SOLUTIONS, AND THE Q-SYS™ SOFTWARE-BASED AUDIO, VIDEO AND CONTROL ECOSYSTEM.\n\nBY JOINING THE QSC TEAM, YOU WILL BE IN A CHALLENGING, COLLABORATIVE, FUN, AND INNOVATIVE ENVIRONMENT. WE ENCOURAGE EMPLOYEES TO TAKE OWNERSHIP, TO COLOR OUTSIDE THE LINES, AND TO IMAGINE POSSIBILITIES. OUR CULTURE IS CASUAL BUT DYNAMIC, WITH CROSS-FUNCTIONAL TEAMS COLLABORATING ON CREATING MEMORABLE AUDIO-VISUAL EXPERIENCES THAT DELIVER JOY TO PEOPLE, WHEREVER THEY ARE. AT QSC, FUN AND HARD WORK GO HAND IN HAND. JOIN US AND MAKE A DIFFERENCE IN THE WAY PEOPLE EXPERIENCE MOVIES, MEETINGS, PRESENTATIONS, LIVE PERFORMANCES, AND MUCH MORE.\n\nQ-SYS IS A CLOUD-MANAGEABLE AUDIO, VIDEO AND CONTROL (AV&C) PLATFORM BUILT AROUND A MODERN, STANDARDS-BASED IT ARCHITECTURE. WITH ESTABLISHED SOLUTIONS ACROSS CORPORATE, EDUCATION, HOSPITALITY, VENUES & EVENTS, CINEMA, GOVERNMENT, HEALTHCARE, AND TRANSPORTATION, Q-SYS REDEFINES WHAT IS POSSIBLE FOR LIVE AND VIRTUAL EXPERIENCES BY UNITING HARDWARE AND SOFTWARE PARTNERS, DEVELOPERS, AND CREATORS.\n\nQSC PRO AUDIO DELIVERS HIGH-PERFORMANCE LOUDSPEAKERS, DIGITAL MIXERS, POWER AMPLIFIERS, SOFTWARE AND ACCESSORIES. OUR INNOVATIVE PRODUCTS AND SOLUTIONS, SUPPORTED WITH FREE TRAINING & EDUCATION AND UNPARALLELED CUSTOMER SERVICE, SET THE STAGE FOR CREATORS, PERFORMERS, AND ENTERTAINMENT PROVIDERS TO CONFIDENTLY DELIVER IMPACTFUL EXPERIENCES FOR THEIR AUDIENCES.\n\nRESPONSIBILITIES\n\nKEY RESPONSIBILITIES:\n\nCREATE VERTICAL MARKET STRATEGIES\n\n WORK CLOSELY WITH THE CROSS-FUNCTIONAL LEADERSHIP TEAM TO CREATE PLANS THAT DRIVE SUSTAINABLE GROWTH AND INCREASE SALES. CONDUCT THOROUGH MARKET RESEARCH TO IDENTIFY TRENDS, OPPORTUNITIES, AND CHALLENGES. ANALYZE COMPETITOR ACTIVITIES AND MARKET DYNAMICS TO FORMULATE EFFECTIVE STRATEGIES. DEVELOP AND EXECUTE A COMPREHENSIVE BUSINESS DEVELOPMENT PLAN TO EXPAND OUR PRESENCE IN KEY VERTICALS. WORK WITH THE ALLIANCES AND ECOSYSTEM TEAM TO SECURE PARTNERSHIPS THAT DRIVE REVENUE AND ENHANCE THE COMPANY'S POSITION IN THE MARKET. MONITOR AND REPORT ON KEY PERFORMANCE INDICATORS RELATED TO REVENUE AND MARKET SHARE.\n\nVERTICAL MARKET EXECUTION\n\n CREATE AND IMPLEMENT INNOVATIVE SALES STRATEGIES TO DRIVE REVENUE GROWTH. COLLABORATE WITH THE SALES, MARKETING, AND OTHER TEAMS TO SET AND ACHIEVE PERFORMANCE TARGETS WITHIN EACH SUB-VERTICAL. BUILD, LEAD, MOTIVATE AND MENTOR A TEAM OF BUSINESS DEVELOPMENT PROFESSIONALS IN ENGAGING POTENTIAL CLIENTS AND STAKEHOLDERS TO GROW OUR BUSINESS, PROVIDING GUIDANCE AND SUPPORT. FOSTER A CULTURE OF COLLABORATION, INNOVATION, AND ACCOUNTABILITY. DEVELOP AND MANAGE THE BUDGET FOR BUSINESS DEVELOPMENT ACTIVITIES FOR HOSPITALITY AND ENTERTAINMENT AND ENSURE COST-EFFECTIVE USE OF RESOURCES WHILE MAXIMIZING ROI. PARTICIPATE IN/LEAD VERTICAL MARKET EVENTS, PANELS AND OVERALL MARKET ENGAGEMENT\n\nBUILD KEY ACCOUNT MANAGEMENT PRACTICE\n\n CULTIVATE AND MAINTAIN STRONG RELATIONSHIPS WITH EXISTING CLIENTS. ENSURE CLIENT SATISFACTION AND ADDRESS ANY ISSUES OR CONCERNS PROMPTLY. WORKING IN HARMONY WITH ADJACENT FUNCTIONAL SALES TEAMS (CONSULTANT LIAISON & CHANNEL MANAGERS) TO COORDINATE PROJECTS DRIVE REVENUE GROWTH BY CLOSING DEALS AND SECURING LONG-TERM ADOPTION.\n\nOTHER RESPONSIBILITIES INCLUDE\n\n RECRUITING NEW SALES TALENT INTO THE ORGANIZATION  ASSISTING WITH NEW HIRE ONBOARDING AND FILLING TRAINING GAPS WITHIN THE EXISTING BD TEAM.  HELP WITH OCCASIONAL SPECIAL PROJECTS.  ORGANIZING AND CONDUCTING EFFECTIVE TEAM CADENCE MEETINGS  ENFORCE DATA INTEGRITY FOR BISDEV’S ACCOUNT, CONTACT, OPPORTUNITY, AND QUOTE RECORDS.  ATTENDING TRAINING TO DEVELOP RELEVANT KNOWLEDGE, TECHNIQUES, AND SKILLS.  FOSTER A POSITIVE AND COLLABORATIVE WORK ENVIRONMENT, MOTIVATING AND SUPPORTING THE BUSINESS DEVELOPMENT TEAM TO ACHIEVE THEIR OBJECTIVES.  SETTING VERTICAL MARKET END USER STRATEGY WITH INVOLVEMENT FROM KEY LEADERS ACROSS THE ORGANIZATION  ONBOARDING, TRAINING, LEVELING-UP TEAM SKILLS  WORKING WITH CROSS FUNCTIONAL GROUPS IN Q-SYS TO RESPOND TO CUSTOMER REQUESTS  DEVELOPING AND REFINING PROCESSES TO ENHANCE THE EFFICIENCY AND EFFECTIVENESS OF THE TEAM  ATTENDING CUSTOMER FACING MEETINGS IN TANDEM WITH BUSINESS DEVELOPMENT TEAM MEMBERS AND PARTICIPATING IN MARKET EVENTS \n\nQUALIFICATIONS\n\n HS DIPLOMA  BACHELOR’S DEGREE OR HIGHER PREFERRED  MINIMUM 15 YEARS OF EXPERIENCE IN THE AUDIOVISUAL, IT, OR RELATED INDUSTRY, WITH AT LEAST 10 YEARS IN AN END-CUSTOMER FOCUSED LEADERSHIP ROLE.  EXTENSIVE EXPERIENCE IN TECHNICAL SELLING ENVIRONMENTS AND A DEEP UNDERSTANDING OF END CUSTOMER ENGAGEMENT BEST PRACTICES.  PROVEN TRACK RECORD OF LEADING AND DEVELOPING HIGH-PERFORMING SALES TEAMS.  EXCELLENT COMMUNICATION, PRESENTATION, AND INTERPERSONAL SKILLS, INCLUDING THE ABILITY TO COMMUNICATE COMPLEX TECHNICAL CONCEPTS TO DIVERSE AUDIENCES.  HIGHLY CUSTOMER-ORIENTED, WITH A PASSION FOR DELIVERING EXCEPTIONAL CUSTOMER EXPERIENCES.  STRONG ANALYTICAL, PROBLEM-SOLVING, AND DECISION-MAKING SKILLS, WITH THE ABILITY TO HANDLE MULTIPLE PROJECTS AND TASKS SIMULTANEOUSLY.  EXCELLENT ORGANIZATIONAL AND TIME MANAGEMENT SKILLS.  ABILITY TO BUILD POSITIVE WORKING RELATIONSHIPS AT ALL LEVELS",
    "job_skill_set": [
      "business development",
      "sales strategy",
      "market research",
      "customer engagement",
      "team leadership",
      "budget management",
      "analytical skills",
      "project management",
      "communication",
      "interpersonal skills",
      "problem-solving",
      "collaboration",
      "customer orientation",
      "organizational skills",
      "time management",
      "mentoring",
      "motivation",
      "creativity",
      "technical selling",
      "data integrity"
    ],
    "short_keywords": [
      "analytical",
      "budget",
      "business",
      "businessdevelopment",
      "collaboration",
      "communication",
      "creativity",
      "customer",
      "data",
      "development",
      "director",
      "engagement",
      "enterprise",
      "integrity",
      "interpersonal",
      "leadership",
      "management",
      "market",
      "mentoring",
      "motivation",
      "organizational",
      "orientation",
      "problemsolving",
      "project",
      "research",
      "sales",
      "selling",
      "skills",
      "strategy",
      "team",
      "technical",
      "time"
    ]
  }
]