[
  {
    "job_id": "3904988667",
    "job_title": "Salesperson",
    "category": "SALES",
    "job_description": "JOB DESCRIPTION\n\nWHAT IS A SALESPERSON?\n\nENTRY LEVEL SALES POSITION CAPABLE OF SUPPORTING THE DIY BUSINESS AND ACHIEVE OUR SALES AND SERVICE OBJECTIVES. THE ROLE HAS GOOD KNOWLEDGE OF STORE SYSTEMS, BASIC AUTOMOTIVE SYSTEM KNOWLEDGE AND BASIC PART KNOWLEDGE. THE ROLE HAS THE BASIC ABILITY TO SOURCE FROM STORES, HUBS, PDQ, AND EXTERNAL SUPPLIERS. THE ROLE HAS IN-DEPTH KNOWLEDGE OF THE STORE INVENTORY AND MAINTENANCE PROCESSES. POSITION CAN BE PART TIME OR FULL TIME. FLEET SAFETY CERTIFICATION PREFERRED.\n\nPRIMARY RESPONSIBILITIES\n\nPROVIDE EXCELLENT SELLING EXPERIENCE FOR DIY CUSTOMER VISITS AND PHONE CALLSACHIEVE PERSONAL SALES GOAL AND HELP STORE ACHIEVE ITS SALES GOALSPROVIDE DIY SERVICES INCLUDING BATTERY INSTALLATION, TESTING, WIPER INSTALLS, ETC.MAINTAIN STORE PRODUCT AND OPERATIONAL STANDARDSRESPONSIBLE FOR INVENTORY PROCESSES INCLUDING TRUCK PUT AWAY, SHOOT OUTS, CYCLE COUNTS, BACK STOCK, ETC.\n\nSECONDARY RESPONSIBILITIES\n\nSTORE CLEANLINESS INCLUDING FLOORS, BATHROOMS, FACING, DUSTING, PARKING LOTGENERAL STOCKING INCLUDING TRUCK STOCKING AND BACK STOCKSAFELY DELIVER PARTS TO CUSTOMERS AS NEEDED\n\nSUCCESS FACTORS\n\nBASIC DRIVING AND NAVIGATION ABILITYABILITY TO USE DELIVERY BOARD SYSTEMFRIENDLY COMMUNICATIONABILITY TO LOCATE AND STOCK PARTSSAFETY KNOWLEDGE AND SKILLSOPERATING INVENTORY SYSTEMS AND STORE EQUIPMENTPARTS AND AUTOMOTIVE SYSTEM KNOWLEDGE SKILLSOPERATING POS AND PARTS LOOKUP SYSTEMSEXPERT AT TESTING AND DIAGNOSTIC EQUIPMENT FOR DIY SERVICE\n\nESSENTIAL JOB SKILLS NECESSARY FOR SUCCESS AS A SALESPERSON\n\nSPEAK AND WRITE ENGLISH (SPANISH A PLUS); COMMUNICATE EFFECTIVELY AND BUILD STRONG RELATIONSHIPS WITH CUSTOMERS, PEERS AND MANAGEMENTREAD AND INTERPRET DOCUMENTS SUCH AS SAFETY RULES, OPERATING AND MAINTENANCE INSTRUCTIONS, PARTS CATALOGS, AND PROCEDURE MANUALSUSE BASIC MATH ACCURATELY: ADD, SUBTRACT, MULTIPLY, AND DIVIDE IN ALL UNITS OF MEASURE, USING WHOLE NUMBERS, COMMON FRACTIONS, AND DECIMALSABILITY TO WORK AN ASSORTMENT OF DAYS, EVENINGS, AND WEEKENDS AS NEEDED\n\nPRIOR EXPERIENCE THAT SETS A SALESPERSON UP FOR SUCCESS \n\n2-3 YEARS OF SUCCESSFUL SALES EXPERIENCE IN A DIVERSE RETAIL ENVIRONMENT, PROVIDING SUPERIOR CUSTOMER EXPERIENCES\n\nPHYSICAL DEMANDS \n\nTHE PHYSICAL DEMANDS AND WORK ENVIRONMENT DESCRIBED HERE ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY AN EMPLOYEE TO SUCCESSFULLY PERFORM THE ESSENTIAL FUNCTIONS OF THIS JOB, WITH OR WITHOUT REASONABLE ACCOMMODATION. WHILE PERFORMING THE DUTIES OF THIS JOB, THE EMPLOYEE WILL PREDOMINANTLY BE WALKING OR STANDING. THE EMPLOYEE IS REQUIRED TO BE ABLE TO TALK AND HEAR, AND USE HANDS AND FINGERS TO HANDLE OR FEEL; REACH WITH HANDS AND ARMS; CLIMB OR BALANCE; AND STOOP, KNEEL, CROUCH, OR CRAWL. THE EMPLOYEE MUST FREQUENTLY LIFT AND/OR MOVE UP TO 50 POUNDS AND OCCASIONALLY LIFT AND/OR MOVE UP TO 100 POUNDS. SPECIFIC VISION ABILITIES REQUIRED BY THIS JOB INCLUDE CLOSE VISION, DISTANCE VISION, COLOR VISION, DEPTH PERCEPTION, AND ABILITY TO ADJUST FOCUS.\n\nWORK ENVIRONMENT\n\nTHE WORK ENVIRONMENT CHARACTERISTICS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE AN EMPLOYEE ENCOUNTERS WHILE PERFORMING THE ESSENTIAL FUNCTIONS OF THIS JOB, WITH OR WITHOUT REASONABLE ACCOMMODATION. WHILE PERFORMING THE DUTIES OF THIS JOB, THE EMPLOYEE IS USUALLY WORKING INSIDE; HOWEVER, THEY WILL OCCASIONALLY BE OUTSIDE AND EXPOSED TO VARIOUS WEATHER CONDITIONS WHILE PERFORMING SUCH TASKS AS INSTALLING BATTERIES AND WIPER BLADES. THE EMPLOYEE IS ALSO OCCASIONALLY EXPOSED TO MOVING MECHANICAL PARTS; HIGH, PRECARIOUS PLACES; TOXIC OR CAUSTIC CHEMICALS; RISK OF ELECTRICAL SHOCK; EXPLOSIVES; AND VIBRATION. THE NOISE LEVEL IN THE WORK ENVIRONMENT IS USUALLY MODERATE.\n\nCOMPENSATION RANGE\n\n15.95 USD PER HOUR - 16.95 USD PER HOUR\n\nBENEFITS INFORMATION\n\nHTTPS://JOBS.ADVANCEAUTOPARTS.COM/US/EN/BENEFITS\n\nCALIFORNIA RESIDENTS CLICK BELOW FOR PRIVACY NOTICE\n\nHTTP://WWW.WORLDPACCAREERS.COM/UPLOADS/2/4/0/4/24047148/ADVANCE_AUTO_PARTS_--_CALIFORNIA_CANDIDATE_PRIVACY_NOTICE.PDF\n\nR-0425401\n\nWE ARE AN EQUAL OPPORTUNITY EMPLOYER AND DO NOT DISCRIMINATE AGAINST ANY EMPLOYEE OR APPLICANT FOR EMPLOYMENT BECAUSE OF RACE, COLOR, SEX, AGE NATIONAL ORIGIN, RELIGION, SEXUAL ORIENTATION, GENDER IDENTITY, STATUS AS A VETERAN AND BASIS OF DISABILITY OR ANY OTHER FEDERAL, STATE OR LOCAL PROTECTED CLASS.",
    "job_skill_set": [
      "inventory management",
      "communication",
      "customer service",
      "relationship building",
      "teamwork",
      "adaptability",
      "problem solving",
      "time management",
      "friendly demeanor",
      "automotive system knowledge",
      "basic math",
      "POS systems",
      "parts lookup systems",
      "battery installation",
      "diagnostic equipment",
      "safety knowledge",
      "store systems knowledge"
    ],
    "short_keywords": [
      "adaptability",
      "automotive",
      "basic",
      "battery",
      "building",
      "communication",
      "customer",
      "demeanor",
      "diagnostic",
      "equipment",
      "friendly",
      "installation",
      "inventory",
      "knowledge",
      "lookup",
      "management",
      "math",
      "parts",
      "pos",
      "problem",
      "relationship",
      "safety",
      "sales",
      "salesperson",
      "service",
      "solving",
      "store",
      "system",
      "systems",
      "teamwork",
      "time"
    ]
  },
  {
    "job_id": "3901169322",
    "job_title": "District Sales Manager",
    "category": "SALES",
    "job_description": "MUST LIVE OR WILLING TO RELOCATE TO SAN ANTONIO, TX TO BE CONSIDERED FOR POSITION.  THE DISTRICT SALES MANAGER (RETAIL TEAM MANAGER) MANAGE AND DIRECTS ACTIVITIES OF THE DISTRICT TO ACHIEVE APPROPRIATE TERRITORY COVERAGE AND TO MAXIMIZE EFFECTIVENESS IN DISTRIBUTION, MERCHANDISING OF SMOKING AND SMOKELESS TOBACCO PRODUCTS IN ALL RETAIL ACCOUNTS IN ORDER TO ACCOMPLISH COMPANY, REGION AND DISTRICT OBJECTIVES.\nRESPONSIBILITIES: MANAGES AND PROVIDES DIRECTION TO ALL ASSIGNED DISTRICT PERSONNEL IN SUPPORT OF COMPANY, REGION AND DISTRICT DISTRIBUTION AND MERCHANDISING GOALS AND OBJECTIVES.FOR ALL DISTRICT PERSONNEL, OVERSEES AND MANAGES APPROPRIATE ROUTING AND CALL COVERAGE OF RETAIL ACCOUNTS TO INSURE PROPER EXECUTION OF DISTRIBUTION AND MERCHANDISING OBJECTIVES BY TERRITORY.ANALYZES THE NEEDS IN REGARD TO BUSINESS BUILDING OPPORTUNITIES AND DEVELOPS EXECUTIONAL PLANS FOR THE UTILIZATION OF DISTRICT PERSONNEL'S TIME AND EFFORTS IN ACCOMPLISHING SPECIFIC COMPANY, REGION AND DISTRICT GOALS AND STANDARDS.RECRUITS, INTERVIEWS AND SELECTS NEW TERRITORY REPRESENTATIVES IN ACCORDANCE WITH COMPANY RECRUITING AND SELECTION GUIDELINES AND POLICIES.PROVIDES TRAINING, DEVELOPMENT AND DIRECTION AND MEASURE RESULTS OF DISTRICT PERSONNEL USING PERFORMANCE MANAGEMENT PRINCIPLES AND PRACTICES.MAINTAINS RECORDS NEEDED TO MANAGE THE OPERATION OF THE DISTRICT AND INSURES ACCURATE AND TIMELY REPORTING OF RETAIL STORE DISTRIBUTION AND MERCHANDISING ACTIVITIES AND CONDITIONS AS WELL AS REPORTS PROGRESS, CONDITIONS AND NEEDS TO RETAIL OPERATIONS MANAGER.EDUCATION:BACHELOR’S DEGREE PREFERRED.\nEXPERIENCE/SKILLS:MUST LIVE OR WILLING TO RELOCATE TO SAN ANTONIO, TXMINIMUM 2 YEARS’ EXPERIENCE IN NON-DURABLE CONSUMER GOODS AREA, INCLUDING FIELD SALES AND OR MANAGEMENT.MUST HAVE CHAIN ACCOUNT MANAGEMENT EXPERIENCE.2 PLUS YEARS OF PEOPLE MANAGEMENT EXPERIENCESTRONG PLANNING AND ORGANIZING, LEADERSHIP, COACHING, JUDGEMENT AND TEAMWORK SKILLS.STRONG COMPUTER SKILLS WITH MICROSOFT OFFICE SUITE, CATEGORY MANAGEMENT SYSTEM (NIELSEN), AND INDUSTRY DATA SYSTEMS.\nCOMPENSATION AND BENEFITS:WE OFFER AN EXCELLENT COMPENSATION AND BENEFITS PACKAGE, INCLUDING THE FOLLOWING:SWEDISH MATCH OFFERS HIGHLY COMPETITIVE SALARIES (PLUS BONUS)MEDICAL, DENTAL, AND VISION BENEFITS EFFECTIVE ON DATE OF HIRE.MATCHING 401(K) WITH PROFIT SHARINGCOMPANY VEHICLE FOR BUSINESS AND PERSONAL USE3 WEEKS’ VACATION, 12 PAID HOLIDAYS, 3 PERSONAL HOLIDAYS, AND A VACATION PURCHASE OPTIONPAID BONDING LEAVE: THIS BENEFIT IS IN ADDITION TO SHORT-TERM DISABILITY BENEFITS, IF APPLICABLEADOPTION ASSISTANCETUITION REIMBURSEMENT\nTHE STARTING SALARY RANGE FOR THIS POSITION IS BETWEEN $80,000 - $106,200 . THIS POSITION IS ELIGIBLE TO RECEIVE AN ANNUAL INCENTIVE BASED ON REGIONAL PERFORMANCE.\nTHIS INFORMATION REFLECTS THE ANTICIPATED BASE SALARY RANGE FOR THIS POSITION BASED ON CURRENT NATIONAL DATA. STARTING PAY WILL BE DETERMINED BASED ON AN INDIVIDUAL’S SKILLS, EXPERIENCE, EDUCATION, AND OTHER JOB-RELATED FACTORS PERMITTED BY LAW. THESE FACTORS COULD RESULT IN A STARTING PAY THAT IS HIGHER THAN THE SALARY RANGE LISTED.\nAN EQUAL OPPORTUNITY EMPLOYER M/F/DISABILITY/VET",
    "job_skill_set": [
      "chain account management",
      "field sales",
      "people management",
      "leadership",
      "coaching",
      "planning and organizing",
      "teamwork",
      "judgment",
      "communication",
      "Microsoft Office Suite",
      "category management system (Nielsen)",
      "industry data systems"
    ],
    "short_keywords": [
      "account",
      "and",
      "category",
      "chain",
      "coaching",
      "communication",
      "data",
      "district",
      "field",
      "industry",
      "judgment",
      "leadership",
      "management",
      "manager",
      "microsoft",
      "nielsen",
      "office",
      "organizing",
      "people",
      "planning",
      "sales",
      "suite",
      "system",
      "systems",
      "teamwork"
    ]
  },
  {
    "job_id": "3900959517",
    "job_title": "Casual Sales Ambassador - Woodland Hills Mall",
    "category": "SALES",
    "job_description": "POSITION: CASUALSALES AMBASSADOR\n\nWEEKLY: 0-19 HOURS\n\n INTERVIEW PLAN \n\nSALES AMBASSADOR\n\nSALES AMBASSADORS AT LUSH ARE EXPERTS IN PRODUCT AND BRAND KNOWLEDGE, AS WELL AS PROVIDING EXCEPTIONAL CUSTOMER CONSULTATIONS AND PRODUCT DEMONSTRATIONS. SALES AMBASSADORS CULTIVATE STRONG TEAM RELATIONSHIPS AND CONTRIBUTE TO OVERALL SHOP EXCELLENCE IN BOTH SALES AND OPERATIONS. ON THE SHOP FLOOR, THEY CONSISTENTLY SURPASS DAILY SALES GOALS WHILE CREATING A FUN AND INCLUSIVE TEAM ENVIRONMENT THAT KEEPS CUSTOMERS COMING BACK FOR MORE.\n\nWE ENCOURAGE YOU TO PUT YOURSELF IN THE CUSTOMER'S SHOES AND THINK ABOUT WHAT WOULD MAKE THEIR DAY. WHETHER IT'S PROVIDING PERSONALIZED PRODUCT RECOMMENDATIONS OR SHARING YOUR KNOWLEDGE AND EXPERTISE, YOU HAVE THE POWER TO CREATE A UNIQUE AND MEMORABLE EXPERIENCE FOR EVERY SHOPPER.\n\nFOR OUR SALES AMBASSADORS, IT'S NOT JUST ABOUT SELLING SOAP – IT'S ABOUT MAKING A POSITIVE IMPACT ON THE WORLD, ONE BAR AT A TIME!\n\nRESPONSIBILITIES:\n\nSALES AND CUSTOMER EXPERIENCE:\n\n DRIVING SALES: UTILIZE STOREFORCE DASHBOARD RESULTS AND SEEK FEEDBACK TO EXCEED SALES GOALS. TAKE OWNERSHIP OF YOUR RESULTS AND ACTIVELY WORK TO GROW YOUR CONTRIBUTION TO THE STORE’S OVERALL SALES.  CUSTOMER EXPERIENCE: CONSISTENTLY DELIVER A WORLD-CLASS CUSTOMER EXPERIENCE TO EVERY CUSTOMER WHO WALKS THROUGH OUR DOORS. CONNECT WITH CUSTOMERS AND IDENTIFY THEIR NEEDS BY LISTENING ATTENTIVELY AND ASKING OPEN-ENDED QUESTIONS. SHOW OFF OUR AMAZING PRODUCTS BY DEMONSTRATING THEIR UNIQUE BENEFITS AND FEATURES. SEEK OPPORTUNITIES TO MAKE CUSTOMERS' DAY AND LEAVE THE WORLD LUSHER THAN WE FOUND IT.  BUILDING THE BRAND: EDUCATE CUSTOMERS ON OUR BRAND VALUES INCLUDING OUR STANCE ON FIGHTING ANIMAL TESTING, FRESHEST COSMETICS, ETHICAL BUYING, 100% VEGETARIAN, HANDMADE, AND NAKED PACKAGING. EXPERTLY ARTICULATE THESE VALUES IN THE SHOP AND THROUGH COMMUNITY ENGAGEMENT BY HOSTING STORE PARTIES AND OTHER INITIATIVES THAT HELP BRING IN MORE TRAFFIC. SPREAD THE WORD ABOUT WHAT MAKES LUSH UNIQUE, AND INSPIRE OTHERS TO JOIN US IN MAKING A POSITIVE IMPACT ON THE WORLD!  PRODUCT PASSION: CONTINUALLY EXPAND YOUR PRODUCT KNOWLEDGE WITH ONGOING LEARNING AND DIVING DEEP INTO ALL THINGS LUSH. STAY UP-TO-DATE ON OUR PRODUCTS, INGREDIENTS, AND UNIQUE BENEFITS TO CONFIDENTLY AND CONSISTENTLY MAKE INFORMED PRODUCT RECOMMENDATIONS FOR EVERY CUSTOMER'S NEEDS. \n\nTEAM INVOLVEMENT:\n\n DEVELOPMENT: UTILIZE LUSH RESOURCES TO DEVELOP EFFECTIVE SALES TECHNIQUES AND PRODUCT KNOWLEDGE TO IMPROVE YOUR PERFORMANCE, SUPPORT THE GROWTH OF YOUR TEAM, AND INCREASE SALES. TAKE OWNERSHIP OF YOUR DEVELOPMENT, ASSESS YOUR PERFORMANCE, AND ACTIVELY SEEK FEEDBACK, RESOURCES, AND OPPORTUNITIES TO IMPROVE AND ELEVATE YOUR SKILLS, KNOWLEDGE, AND ABILITIES.  DIVERSITY, EQUITY, INCLUSION, AND BELONGING: ENCOURAGE OPEN COMMUNICATION AND ACTIVELY LISTEN TO TEAM MEMBERS’ PERSPECTIVES RELATED TO DIVERSITY, EQUITY, INCLUSION, AND BELONGING (DEIB). FOSTER A SENSE OF BELONGING BY PROMOTING TEAMWORK, ENCOURAGING COLLABORATION, AND RECOGNIZING AND VALUING EACH EMPLOYEE'S UNIQUE CONTRIBUTIONS. \n\nOPERATIONAL EXCELLENCE:\n\n TIME AND ATTENDANCE: BE PUNCTUAL, RELIABLE, AND PRESENT AT WORK. ACTIVELY PARTICIPATE IN TEAMWORK, PRIORITIZE YOUR WELLBEING BY TAKING BREAKS WHEN NECESSARY, AND KEEP UP-TO-DATE WITH COMPANY NEWS AND UPDATES.  VISUALS AND MERCHANDISING: MAINTAIN A CLEAN, ORGANIZED, AND VISUALLY APPEALING STORE TO ENHANCE THE CUSTOMER'S SHOPPING EXPERIENCE AND DRIVE SALES.  STOCK AND INVENTORY: UTILIZE VISUAL MERCHANDISING GUIDELINES TO MAKE REAL-TIME ADJUSTMENTS TO PRODUCT DISPLAYS BASED ON SALES TO IMPROVE THE CUSTOMER EXPERIENCE.  POLICIES AND PROCEDURES: ENSURE YOU ARE PRACTICING COMPANY STANDARDS FOR OPENING AND CLOSING, PRODUCT INTEGRITY, RESPECTFUL WORKPLACE, AND HEALTH AND SAFETY. \n\nQUALIFICATIONS:\n\nREQUIRED: \n\n EXCELLENT CUSTOMER SERVICE SKILLS  FLEXIBILITY TO ADAPT TO CHANGING SITUATIONS AND PRIORITIES IN A FAST-PACED ENVIRONMENT  KNOWLEDGE AND PASSION FOR SKINCARE, NATURAL BEAUTY, AND ETHICAL BUSINESS  FLEXIBLE SCHEDULE TO ACCOMMODATE STORE NEEDS, INCLUDING EVENINGS, WEEKENDS, AND HOLIDAYS \n\nPREFERRED: \n\n EXPERIENCE WITH CONSULTATION-BASED CUSTOMER SERVICE MODELS  STRONG PROBLEM-SOLVING SKILLS TO ADDRESS ISSUES THAT ARISE IN DAY-TO-DAY OPERATIONS  EXPERIENCE WORKING IN A TEAM ENVIRONMENT  EXPERIENCE WORKING IN SKINCARE OR COSMETICS  EXPERIENCE IN CROSS CULTURAL COLLABORATION AND DEIB OR SOCIAL JUSTICE TRAINING  FLUENCY IN SPANISH, FRENCH, OR OTHER LANGUAGES \n\nWOODLAND HILLS PAY\n\n$13 — $13 USD",
    "job_skill_set": [
      "customer service",
      "sales techniques",
      "inventory management",
      "consultation-based service",
      "bilingual (Spanish, French)",
      "communication",
      "problem solving",
      "active listening",
      "customer engagement",
      "product knowledge",
      "visual merchandising",
      "teamwork",
      "flexibility",
      "adaptability",
      "inclusivity"
    ],
    "short_keywords": [
      "active",
      "adaptability",
      "ambassador",
      "bilingual",
      "casual",
      "communication",
      "consultationbased",
      "customer",
      "engagement",
      "flexibility",
      "french",
      "hills",
      "inclusivity",
      "inventory",
      "knowledge",
      "listening",
      "mall",
      "management",
      "merchandising",
      "problem",
      "product",
      "sales",
      "service",
      "solving",
      "spanish",
      "teamwork",
      "techniques",
      "visual",
      "woodland"
    ]
  },
  {
    "job_id": "3899537951",
    "job_title": "Sales Coordinator",
    "category": "SALES",
    "job_description": "OUR STORY STEAM LOGISTICS WAS FOUNDED IN 2012 TO TACKLE THE MOST STRATEGIC CHALLENGE MANY COMPANIES FACE: HOW TO ALIGN THE SUPPLY CHAIN SO GOODS MOVE EFFICIENTLY, QUICKLY, AND ECONOMICALLY. AS A FULL-SERVICE PROVIDER, WE OFFER END-TO-END SERVICES TO HELP OUR CUSTOMERS MOVE COMMODITIES AROUND THE WORLD, FROM THEIR ORIGIN POINT TO THEIR FINAL DESTINATION. WE’VE RETHOUGHT THE BROKERAGE PARADIGM AND ARE INNOVATION LEADERS IN OUR SPACE, LOOKING FOR THE RIGHT PEOPLE TO JOIN US AS WE SCALE. WE ARE EXTRAORDINARILY PROUD OF THE COMPANY WE’VE BUILT SO FAR. OUR PEOPLE ARE STEAM’S BIGGEST COMPETITIVE ADVANTAGE, AND WE’LL CONTINUE INVESTING IN OUR PEOPLE-FIRST CULTURE.\nOUR DOMESTIC SALES TEAM FOCUSES ON THE MOVEMENT OF COMMODITIES FROM ONE CITY TO ANOTHER (DOMESTICALLY- SEE WHAT WE DID THERE?). WE OPERATE WHAT’S CALLED A CRADLE TO GRAVE MODEL, MEANING YOU ARE RESPONSIBLE FOR YOUR ACCOUNTS FROM START TO FINISH. ON THIS SALES TEAM, YOU WILL BE COLD CALLING CUSTOMERS AND PROSPECTS, PRICING OUT DOMESTIC LANES, SPEAKING WITH CARRIERS TO DETERMINE AVAILABILITY, BOOKING TRUCKS TO MOVE COMMODITIES, SCHEDULING APPOINTMENTS, ETC. YOU’LL OWN YOUR ACCOUNTS FROM START TO FINISH, IT’S ALWAYS A ONE-WAY MOVE, AND ANY FREIGHT MOVING ACROSS AMERICA IS FAIR GAME. \nRESPONSIBILITIES- \nCREATE LEAD LISTS USING PANJIVA, ZOOMINFO, SALESFORCE, AND OTHER RESOURCESPROSPECT POTENTIAL CUSTOMERS THROUGH COLD-CALLING AND EMAIL OUTREACHRESEARCH MARKET PRICES FOR LANES AND CREATE TARGET PRICE POINTS TO FINALIZE CUSTOMER QUOTES FACILITATE THE ONBOARDING OF NEW CUSTOMERS AND CARRIERSBOOK FREIGHT WITH A CARRIER, SCHEDULE PICK-UP AND DELIVERY APPOINTMENTS, AND MANAGE THE SHIPMENT FROM START TO FINISHABILITY TO BE EMPATHETIC TO CUSTOMER NEEDS AND TRANSLATE THOSE NEEDS INTO VALUE-DRIVEN SOLUTIONSCOLLABORATE WITH ALL STEAM DEPARTMENTSREQUIRED SKILLS, QUALIFICATIONS, AND EXPERIENCE-\nLOGISTICS EXPERIENCE OR SALES EXPERIENCE PREFERRED BUT NOT NECESSARY – WE WANT YOUR HUSTLECREATIVITY, ORIGINALITY, AND ENTHUSIASM- WE WANT YOUR UNIQUENESSWILLINGNESS TO LEARN- WE WANT TO TEACH YOU SUPPLY CHAIN STRONG VERBAL & WRITTEN COMMUNICATION SKILLS- WE WANT YOUR SERVICE-CENTRIC MINDSETWHAT WE OFFER-\nCOLLABORATIVE & COMMITTED TEAM ENVIRONMENT – DOESN’T MATTER WHERE THE IDEA CAME FROM, IF IT MAKES US BETTER TOGETHER, WE WANT TO HEAR IT.COMPETITIVE SALARY WITH UNCAPPED COMMISSION PAID OUT ON A SLIDING SCALE – THE MORE YOU SELL, THE MORE YOU MAKE!CLEAR, DEFINED PERSONAL & PROFESSIONAL GROWTH OPPORTUNITIESMEDICAL, VISION, DENTAL, LIFE INSURANCE & 401K MATCHGENEROUS TIME OFF POLICY FOR OUR EMPLOYEESMORE ABOUT US-\nSTEAM LOGISTICS IS A FAST GROWTH, INTEGRATED THIRD-PARTY LOGISTICS COMPANY, FOCUSED ON INTERNATIONAL FREIGHT FORWARDING, DRAYAGE, INTERMODAL AND DOMESTIC TRANSPORTATION. BASED IN CHATTANOOGA, TENNESSEE, WITH OFFICES THROUGHOUT THE COUNTRY, STEAM IS ONE OF THE FASTEST GROWING 3PLS IN THE U.S. WE HAVE BEEN FEATURED IN INC. MAGAZINE'S LIST OF AMERICA'S FASTEST GROWING COMPANIES EACH OF THE PREVIOUS FIVE YEARS AND ARE ALSO REGISTERED AS A GREAT PLACE TO WORK. WE ARE AN EQUAL OPPORTUNITY EMPLOYER THAT IS COMMITTED TO PROVIDING REASONABLE ACCOMMODATION AND WILL WORK WITH YOUR NEEDS. IF YOU ARE A PERSON WITH A DISABILITY AND REQUIRE ASSISTANCE DURING THE APPLICATION PROCESS, PLEASE DO NOT HESITATE TO REACH OUT! WE CELEBRATE OUR INCLUSIVE WORK ENVIRONMENT AND WELCOME MEMBERS OF ALL BACKGROUNDS AND PERSPECTIVES.",
    "job_skill_set": [
      "logistics",
      "sales",
      "customer service",
      "appointment scheduling",
      "communication",
      "collaboration",
      "willingness to learn",
      "cold calling",
      "market research",
      "Salesforce",
      "Panjiva",
      "ZoomInfo",
      "freight booking",
      "creativity",
      "empathy",
      "enthusiasm"
    ],
    "short_keywords": [
      "appointment",
      "booking",
      "calling",
      "cold",
      "collaboration",
      "communication",
      "coordinator",
      "creativity",
      "customer",
      "empathy",
      "enthusiasm",
      "freight",
      "learn",
      "logistics",
      "market",
      "panjiva",
      "research",
      "sales",
      "salesforce",
      "scheduling",
      "service",
      "to",
      "willingness",
      "zoominfo"
    ]
  },
  {
    "job_id": "3902329031",
    "job_title": "FT Deli Bakery Sales Associate",
    "category": "SALES",
    "job_description": "ADDRESS: USA-VA-POWHATAN-1800 SOUTH CREEK ONE\n\nSTORE CODE: STORE 02610 DELI (7234891)\n\nFOOD LION HAS BEEN PROVIDING AN EASY, FRESH AND AFFORDABLE SHOPPING EXPERIENCE TO THE COMMUNITIES WE SERVE SINCE 1957. TODAY, OUR 82,000 ASSOCIATES SERVE MORE THAN 10 MILLION CUSTOMERS A WEEK ACROSS 10 SOUTHEASTERN AND MID-ATLANTIC STATES.\n\nPRIMARY PURPOSE\n\nPROVIDE QUALITY CUSTOMER SERVICE WITHIN THE DELI BAKERY DEPARTMENT. RESPONSIBLE FOR MAINTAINING STANDARDS IN ACCORDANCE WITH THE STANDARD PRACTICE MANUAL, MAXIMIZING SALES THROUGH EXCELLENT CUSTOMER SERVICE AND MINIMIZING SHRINK THROUGH PROPER UTILIZATION OF STANDARD PRACTICE.\n\nDUTIES AND RESPONSIBILITIES\n\n MAINTAIN AN ATMOSPHERE OF ENTHUSIASTIC CUSTOMER AWARENESS WITH PRIMARY EMPHASIS ON FAST, FRIENDLY, AND ACCURATE CUSTOMER SERVICE TO CREATE A POSITIVE SHOPPING EXPERIENCE COURTEOUS AND HELPFUL TO OTHER ASSOCIATES FOLLOWS ALL TECHNICAL MANUALS FOR PROCESSING OF PRODUCT, LABEL PLACEMENT, ETC. ENSURE THAT ORDERING, RECEIVING, PREPARATION, CONDITIONING AND DISPLAYING OF MERCHANDISE IS DONE IN ACCORDANCE WITH POLICIES AND GUIDELINES ENSURES PROPER SANITATION OF DEPARTMENT, EQUIPMENT AND PROPER FOOD HANDLING/PREPARATION UNDERSTAND AND USE COMPANY TOOLS SUCH AS; AVERAGE COST INVENTORY SYSTEM (ACIS) AND ORDERING (CAO) MAINTAIN A COMPLETE UNDERSTANDING OF AND ADHERENCE TO COMPANY GUIDELINES, POLICIES AND STANDARD PRACTICE UNDERSTAND AND FOLLOW FOOD SAFETY AND WORKPLACE SAFETY GUIDELINES AND PROCEDURES OBSERVE AND CORRECT ALL UNSAFE CONDITIONS THAT COULD CAUSE ASSOCIATE OR CUSTOMER ACCIDENTS REPORT ALL ASSOCIATE AND CUSTOMER ACCIDENTS IN ACCORDANCE WITH ESTABLISHED FOOD LION PROCEDURES TO THE MANAGER ON DUTY ENSURE COMPLIANCE WITH LOCAL, STATE AND FEDERAL REGULATIONS WEAR THE FOOD LION UNIFORM, COMPLETE WITH NAME BADGE, WHEN ON DUTY, HAS A NEAT AND CLEAN APPEARANCE WHILE ADHERING TO THE FOOD LION DRESS CODE SUCCESSFULLY COMPLETE COMPUTER BASED TRAINING (CBT), TRAINING PACKET AND TRAINING AID COURSES PERFORM ALL OTHER DUTIES AS ASSIGNED\n\nQUALIFICATIONS\n\n HIGH SCHOOL GRADUATE OR EQUIVALENT PREFERRED EXCELLENT INTERPERSONAL, ORGANIZATIONAL, COMMUNICATION AND CUSTOMER SERVICE SKILLS ABILITY AND WILLINGNESS TO LEARN MULTIPLE TASKS AND TECHNICAL REQUIREMENTS OF THE JOB ABILITY TO USE TECHNICAL INFORMATION TO SOLVE PROBLEMS MUST MEET MINIMUM AGE REQUIREMENTS TO PERFORM SPECIFIC JOB FUNCTIONS MUST BE ABLE TO MEET THE PHYSICAL REQUIREMENTS OF THE POSITION, WITH OR WITHOUT REASONABLE ACCOMMODATIONS\n\nPHYSICAL REQUIREMENTS\n\n ABILITY TO USE COMPUTERS AND OTHER COMMUNICATION SYSTEMS REQUIRED TO PERFORM JOB FUNCTIONS PERFORM REPETITIVE HAND AND ARM MOTIONS BEND AND LIFT PRODUCTS WEIGHING UP TO 15 LBS. CONTINUOUSLY, 25 LBS. FREQUENTLY, AND 50 LBS. ON OCCASION PULL OR PUSH UP TO 75 LBS. ON OCCASION STAND 100% OF THE TIME, FREQUENTLY WALKING SHORT DISTANCES BE ABLE TO HANDLE A VARIETY OF SUBSTANCES ASSOCIATED WITH CLEANING AND PACKAGING MATERIALS FREQUENT REACHING AND GRASPING AT WAIST LEVEL: OCCASIONALLY ABOVE SHOULDER OR BELOW WAIST LEVEL MEET ESTABLISHED VOLUME ACTIVITY STANDARDS FOR THE POSITION TOLERATE WORKING IN EXTREME HOT/COLD TEMPERATURES FOR UP TO 20 MINUTES AT A TIME\n\nFOOD LION PROVIDES EQUAL EMPLOYMENT OPPORTUNITIES TO ALL ASSOCIATES AND APPLICANTS FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX (INCLUDING PREGNANCY, CHILDBIRTH AND RELATED CONDITIONS) NATIONAL ORIGIN, AGE, DISABILITY, SEXUAL ORIENTATION, VETERAN STATUS, GENDER IDENTITY OR GENDER EXPRESSION OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW.\n\nJOB REQUISITION: 374305_EXTERNAL_USA-VA-POWHATAN",
    "job_skill_set": [
      "customer service",
      "merchandising",
      "communication",
      "interpersonal skills",
      "teamwork",
      "problem solving",
      "organizational skills",
      "adaptability",
      "attention to detail",
      "food safety",
      "sanitation",
      "inventory management",
      "computer skills",
      "technical knowledge",
      "food handling",
      "enthusiasm"
    ],
    "short_keywords": [
      "adaptability",
      "associate",
      "attention",
      "bakery",
      "communication",
      "computer",
      "customer",
      "deli",
      "detail",
      "enthusiasm",
      "food",
      "ft",
      "handling",
      "interpersonal",
      "inventory",
      "knowledge",
      "management",
      "merchandising",
      "organizational",
      "problem",
      "safety",
      "sales",
      "sanitation",
      "service",
      "skills",
      "solving",
      "teamwork",
      "technical",
      "to"
    ]
  },
  {
    "job_id": "3906255426",
    "job_title": "Senior Manager, Strategic Sales",
    "category": "SALES",
    "job_description": "YOUR OPPORTUNITY\nNEW RELIC IS LOOKING TO ADD A KEY MEMBER TO OUR OUTSTANDING SALES LEADERSHIP TEAM. THE SENIOR MANAGER, STRATEGIC SALES WILL ASSUME RESPONSIBILITY FOR GROWING OUR STRATEGIC SALES ORGANIZATION IN THE REGION(?). WE'RE LOOKING FOR A CUSTOMER-FOCUSED INDUSTRY LEADER WITH A CONSISTENT RECORD OF EXCEEDING SALES GROWTH GOALS OF SAAS PRODUCTS, SPECIFICALLY WITHIN ENTERPRISE ACCOUNTS > 5,000 EMPLOYEES.\n\nYOU HAVE THE ABILITY TO LEAD AND SUPPORT THE PURSUIT OF MAJOR SALES ACTIVITIES WHILE BEING A GREAT TEAMMATE. YOU KNOW HOW TO BUILD AND LEAD THE ALIGNMENT AMONG BUSINESS DEVELOPMENT, OPERATIONS, SALES ENGINEERING, PROPOSAL AND CONTRACT FUNCTIONS. IN ADDITION TO LEADING NEW LOGO GROWTH, YOU’LL BE TASKED WITH GROWING EXISTING FOOTPRINTS AND EXECUTING ENTERPRISE AGREEMENTS.\n\nWE’RE SEEKING OUT AMBITIOUS, DATA-DRIVEN EXECUTIVES WITH AN OPEN, COLLABORATIVE AND TEAM-BASED APPROACH TO LEADERSHIP AND MANAGEMENT. IF YOU THINK YOU’VE GOT WHAT IT TAKES, READ ON!\n\nWHAT YOU'LL DO\n\nPASSIONATELY LEAD, DRIVE AND DELIVER THE NEW RELIC VISION AND MISSION FOR THE STRATEGIC BUSINESSDRIVE PORTFOLIO BUSINESS OF HIGH VELOCITY NEW “LANDS” AS WELL AS THE EXPANSION OF STRATEGIC ACCOUNTSLEAD STRATEGIC AES IN ACHIEVING INDIVIDUAL, TEAM, AND ORGANIZATIONAL QUOTASLEAD RECRUITMENT AND RETENTION ACTIVITIESCRAFT AND DRIVE NEW AND STRATEGIC GO-TO-MARKET PLANS TO MEET COMPANY GROWTH AND MARKET SHARE GOALSDRIVE STRATEGIC DEALS AND ACCOUNTS TO SIX-FIGURE AND SEVEN-FIGURE DEAL VICTORIESDRIVE AND MONITOR ACCOUNT PLANNING AND EXECUTION TO DELIVER MAXIMUM REVENUE POTENTIALPROVIDE STRATEGIC EXECUTIVE LEADERSHIP FOR SALES FORECASTING, TERRITORY ASSIGNMENTS, SALES MENTORSHIP, AND COMMISSION PLANNINGCOACH SALES TEAMS BY HELPING STRUCTURE SALES OPPORTUNITIES AND DEALS; FURTHER ASSIST WITH SELLING ACTIVITIES AS APPROPRIATE; ENSURE THE SALES TEAM IS WORKING COHESIVELY WITH OPERATIONS, SALES ENGINEERING, AND OTHER INTERNAL/EXTERNAL TEAMSDEVELOP ANNUAL SALES FORECASTS USING A COMBINATION OF TOP-DOWN AND BOTTOM-UP INPUTSTAY AHEAD OF INDUSTRY TRENDS, COMPETITIVE ACTIVITY, AND CLIENT OPPORTUNITIES; ATTEND TRADE SHOWS, INDUSTRY EVENTS, INTERNAL MEETINGS, AND CONFERENCESBE RESPONSIBLE FOR REGIONAL CUSTOMER HAPPINESS AND RENEWALS\n\n\nTHIS ROLE REQUIRES\n\n5+ YEARS OF EXPERIENCE AS A SALES LEADER WITH DIRECT REPORTS SELLING ENTERPRISE APPLICATION SOFTWARE TO DEVELOPERS, IT/OPERATIONS, APPLICATION OWNERS, AND/OR BUSINESS LEADERSKNOWLEDGE OF SAAS/CLOUD/APPLICATION PERFORMANCE MONITORING SPACEDEMONSTRATED ENTERPRISE ACCOUNT SALES LEADERSHIP EXPERIENCE AND TRACK RECORD OF SUCCESSABILITY TO BUILD AND LEAD A SALES ORGANIZATION, INCLUDING QUOTA-CARRYING AND FORECASTING EXPERIENCEEXCELLENT CROSS-ORGANIZATION PARTNERSHIP AND INTERPERSONAL SKILLSEXPERIENCE DEVISING SALES STRATEGY AND CONTRIBUTING TO ENABLEMENT PROGRAMSBACHELOR DEGREE \n\n\nBONUS POINTS IF YOU HAVE\n\nTECHNICAL BACKGROUND, WITH A BASIC UNDERSTANDING OF INFRASTRUCTURES AND SAAS INDUSTRY IN GENERALEXPOSURE TO OR HAVING PREVIOUSLY REPRESENTED OBSERVABILITY SOLUTIONS\n\n\nFOSTERING A DIVERSE, WELCOMING AND INCLUSIVE ENVIRONMENT IS IMPORTANT TO US. WE WORK HARD TO MAKE EVERYONE FEEL COMFORTABLE BRINGING THEIR BEST, MOST AUTHENTIC SELVES TO WORK EVERY DAY. WE CELEBRATE OUR TALENTED RELICS’ DIFFERENT BACKGROUNDS AND ABILITIES, AND RECOGNIZE THE DIFFERENT PATHS THEY TOOK TO REACH US – INCLUDING NONTRADITIONAL ONES. THEIR EXPERIENCES AND PERSPECTIVES INSPIRE US TO MAKE OUR PRODUCTS AND COMPANY THE BEST THEY CAN BE. WE’RE LOOKING FOR PEOPLE WHO FEEL CONNECTED TO OUR MISSION AND VALUES, NOT JUST CANDIDATES WHO CHECK OFF ALL THE BOXES.\n\nIF YOU REQUIRE A REASONABLE ACCOMMODATION TO COMPLETE ANY PART OF THE APPLICATION OR RECRUITING PROCESS, PLEASE VISIT HTTPS://NEWRELIC.AVATURE.NET/ACCOMMODATIONS TO SUBMIT YOUR REQUEST.\n\nWE BELIEVE IN EMPOWERING ALL RELICS TO ACHIEVE PROFESSIONAL AND BUSINESS SUCCESS THROUGH A FLEXIBLE WORKFORCE MODEL. THIS MODEL ALLOWS US TO WORK IN A VARIETY OF WORKPLACES THAT BEST SUPPORT OUR SUCCESS, INCLUDING FULLY OFFICE-BASED, FULLY REMOTE, OR HYBRID.\n\nOUR HIRING PROCESS\n\nPLEASE NOTE THAT VISA SPONSORSHIP IS NOT AVAILABLE FOR THIS POSITION.\n\nIN COMPLIANCE WITH APPLICABLE LAW, ALL PERSONS HIRED WILL BE REQUIRED TO VERIFY IDENTITY AND ELIGIBILITY TO WORK AND TO COMPLETE EMPLOYMENT ELIGIBILITY VERIFICATION. NOTE: OUR STEWARDSHIP OF THE DATA OF THOUSANDS OF CUSTOMERS’ MEANS THAT A CRIMINAL BACKGROUND CHECK IS REQUIRED TO JOIN NEW RELIC.\n\nWE WILL CONSIDER QUALIFIED APPLICANTS WITH ARREST AND CONVICTION RECORDS BASED ON INDIVIDUAL CIRCUMSTANCES AND IN ACCORDANCE WITH APPLICABLE LAW INCLUDING, BUT NOT LIMITED TO, THE SAN FRANCISCO FAIR CHANCE ORDINANCE.\n\nHEADHUNTERS AND RECRUITMENT AGENCIES MAY NOT SUBMIT RESUMES/CVS THROUGH THIS WEBSITE OR DIRECTLY TO MANAGERS. NEW RELIC DOES NOT ACCEPT UNSOLICITED HEADHUNTER AND AGENCY RESUMES, AND WILL NOT PAY FEES TO ANY THIRD-PARTY AGENCY OR COMPANY THAT DOES NOT HAVE A SIGNED AGREEMENT WITH NEW RELIC.\n\nNEW RELIC IS PROUD TO BE AN EQUAL OPPORTUNITY EMPLOYER. WE FOSTER A DIVERSE, EQUITABLE, AND INCLUSIVE ENVIRONMENT, FREE FROM ALL TYPES OF DISCRIMINATION, SO OUR RELICS CAN THRIVE. WE HIRE PEOPLE WITH DIFFERENT BACKGROUNDS, EXPERIENCES, ABILITIES AND PERSPECTIVES.\n\nCANDIDATES ARE EVALUATED BASED ON QUALIFICATIONS, REGARDLESS OF RACE, RELIGION, ETHNICITY, NATIONAL ORIGIN, SEX, SEXUAL ORIENTATION, GENDER EXPRESSION OR IDENTITY, AGE, DISABILITY, NEURODIVERSITY, VETERAN OR MARITAL STATUS, POLITICAL VIEWPOINT, OR OTHER LEGALLY PROTECTED CHARACTERISTICS.\n\nREVIEW OUR APPLICANT PRIVACY NOTICE AT HTTPS://NEWRELIC.COM/TERMSANDCONDITIONS/APPLICANT-PRIVACY-POLICY.\n\nESTIMATED ON-TARGET EARNINGS RANGE: $ 340000 - $ 424000\n\nTHE PAY RANGE ABOVE REPRESENTS A REASONABLE ESTIMATE OF THE ON TARGET EARNINGS (SALARY PLUS TARGET SALES INCENTIVES) FOR THE LISTED POSITION. THIS ROLE IS ELIGIBLE FOR A COMMISSION PLAN (AS DEFINED IN THE SALES INCENTIVE PLAN DOCUMENT). PAY WITHIN THIS RANGE VARIES BY WORK LOCATION AND MAY ALSO DEPEND ON JOB-RELATED FACTORS SUCH AS AN APPLICANT’S SKILLS, QUALIFICATIONS, AND EXPERIENCE.\n\nNEW RELIC PROVIDES A VARIETY OF BENEFITS FOR THIS ROLE, INCLUDING HEALTHCARE, DENTAL, VISION, PARENTAL LEAVE AND PLANNING, MENTAL HEALTH BENEFITS, A 401(K) PLAN AND MATCH, FLEX TIME-OFF, 11 PAID HOLIDAYS, VOLUNTEER TIME OFF, AND OTHER COMPETITIVE BENEFITS DESIGNED TO IMPROVE THE LIVES OF OUR EMPLOYEES.\n\n",
    "job_skill_set": [
      "Sales Leadership",
      "Sales Strategy",
      "Account Management",
      "Sales Enablement",
      "Team Leadership",
      "Interpersonal Skills",
      "Collaboration",
      "Coaching",
      "Customer Focus",
      "Communication",
      "Problem Solving",
      "Adaptability",
      "Strategic Thinking",
      "SaaS",
      "Sales Forecasting",
      "Enterprise Software Sales",
      "Data-Driven Decision Making",
      "Quota Management",
      "Contract Negotiation",
      "Diversity and Inclusion Awareness"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "and",
      "awareness",
      "coaching",
      "collaboration",
      "communication",
      "contract",
      "customer",
      "datadriven",
      "decision",
      "diversity",
      "enablement",
      "enterprise",
      "focus",
      "forecasting",
      "inclusion",
      "interpersonal",
      "leadership",
      "making",
      "management",
      "manager",
      "negotiation",
      "problem",
      "quota",
      "saas",
      "sales",
      "senior",
      "skills",
      "software",
      "solving",
      "strategic",
      "strategy",
      "team",
      "thinking"
    ]
  },
  {
    "job_id": "3904576339",
    "job_title": "Salesforce Developer",
    "category": "SALES",
    "job_description": "JOB TITLE: SALESFORCE DEVELOPERPOSITION TYPE: 100% REMOTEPAY: $68.00/HR ON W2\nEXPERIENCE DESIGNING COMPREHENSIVE SALESFORCE SOLUTION FOR SALESFORCE SALES CLOUD, SERVICE CLOUD AND COMMUNITIES. HANDS-ON EXPERIENCE WITH SALESFORCE REST APIS AND CODING IN APEX. THIS INDIVIDUAL IS COLLABORATIVE AND HAS WORKED WITHIN AN AGILE ENVIRONMENT. EXPERIENCE WITH UI DESIGN IS A PLUS.\nESSENTIAL RESPONSIBILITIES:PRIMARY RESPONSIBILITES WILL FOCUS ON BUILDING CUSOTM BUSINESS APPLICATIONS AND SOLUTIONS BY WRITING CODE IN APEX LWC/AURA.SOLUTION DESIGN AND IMPLEMENTATION OF SALESFORCE SERVICE CLOUDDEVELOP INTEGRATION CROSS SALESFORCE INSTANCESRESPONSIBLE FOR CUSTOMIZING, DEVELOPING AND SUPPORTING SOLUTIONS ON THE FORCE.COM PLATFORM, DRIVE SALESFORCE ENHANCEMENTS AND IMPROVEMENTSBUILD INTEGRATIONS BETWEEN SALESFORCE AND OTHER INTERNAL SYSTEMS TO AUTOMATE BUSINESS PROCESSESDEVELOP CUSTOM CODE, PERFORM CODE REVIEWS AND ENSURE SUCCESSFUL DEPLOYMENTSPREFERRED SKILLS/EXPERIENCEEXPERIENCE WITH SALESFORCE SERVICE CLOUD, COMMUNITY CLOUD AND CTI INTEGRATION (AMAZON CONNECT)FIVE YEARS OF EXPERIENCE AS A SALESFORCE DEVELOPEREXPERIENCE IMPLEMENTING SALESFORCE SALES CLOUD, SERVICE CLOUD AND COMMUNITIESDESIGN EXPERIENCE IN SALESFORCE LIGHTNING UIEXPERIENCE WITH REST/SOAP API INTEGRATIONEXPERIENCE WITH SYSTEM MIGRATIONS EXTENSIVE KNOWLEDGE IN MODELING AND APPLICATION DESIGN AND ARCHITECTUREEXPERT KNOWLEDGE IN IT/SOFTWARE QUALITY ASSURANCE, SYSTEM TESTING TOOLS AND SYSTEM/APPLICATION TESTING AND IMPLEMENTATIONENTIRELY SELF-DIRECTED, CAN SOLVE BUSINESS PROBLEMS FROM INCEPTION TO IMPLEMENTATION, CAN SOLVE BUSINESS PROBLEMS WITHOUT EXPLICIT DIRECTIONCREATIVE, FLEXIBLE, AND WILLING TO CONTINUOUSLY CHANGE, EVOLVE, AND IMPROVE SOFTWARE DEVELOPMENT PROCESSESSTRONG TIME MANAGEMENT SKILLS AND COMMUNICATION/LEADERSHIP SKILLSADEPT WITH AGILE SOFTWARE DEVELOPMENT LIFECYCLE AND DEVOPS PRINCIPLES",
    "job_skill_set": [
      "Collaboration",
      "Problem Solving",
      "Time Management",
      "Communication",
      "Leadership",
      "Salesforce",
      "Apex",
      "REST APIs",
      "SOAP APIs",
      "Salesforce Service Cloud",
      "Salesforce Sales Cloud",
      "Salesforce Communities",
      "LWC/AURA",
      "CTI Integration (Amazon Connect)",
      "System Migrations",
      "Application Design and Architecture",
      "Software Quality Assurance",
      "System Testing Tools",
      "Agile Software Development",
      "DevOps Principles",
      "Creativity",
      "Flexibility"
    ],
    "short_keywords": [
      "agile",
      "amazon",
      "and",
      "apex",
      "apis",
      "application",
      "architecture",
      "assurance",
      "cloud",
      "collaboration",
      "communication",
      "communities",
      "connect",
      "creativity",
      "cti",
      "design",
      "developer",
      "development",
      "devops",
      "flexibility",
      "integration",
      "leadership",
      "lwcaura",
      "management",
      "migrations",
      "principles",
      "problem",
      "quality",
      "rest",
      "sales",
      "salesforce",
      "service",
      "soap",
      "software",
      "solving",
      "system",
      "testing",
      "time",
      "tools"
    ]
  },
  {
    "job_id": "3906254719",
    "job_title": "Sleep Expert - Sales",
    "category": "SALES",
    "job_description": "NOW HIRING! \n\nSLEEP EXPERT – SALES \n\nIS YOUR CURRENT JOB A NIGHTMARE? MAKE IT A DREAM!\n\nMATTRESS FIRM\n\nTHE MOST TRUSTED AUTHORITY ON SLEEP\n\nWE’RE NO ORDINARY MATTRESS COMPANY. IN JUST OVER 30 YEARS, MATTRESS FIRM HAS BECOME AMERICA’S LARGEST SPECIALTY MATTRESS RETAILER. WITH MORE THAN 2,400 STORES NATIONWIDE AND A TEAM OF MORE THAN 6,000 SLEEP EXPERTS®, WE HAVE HELPED MILLIONS OF PEOPLE GET BETTER SLEEP. THAT’S WHO WE ARE AND WHAT WE DO—BECAUSE EVERYONE DESERVES A GREAT NIGHT’S SLEEP.\n\nHELPING PEOPLE SLEEP WELL SO THEY LIVE WELL\n\nDID YOU KNOW WE SPEND A THIRD OF OUR LIVES IN BED? THAT’S WHY OUR PRIORITY IS MAKING SURE EVERYONE’S EIGHT HOURS ARE PERFECT. WE’RE LOOKING FOR PASSIONATE, AMBITIOUS PEOPLE: INNOVATORS, ACTION TAKERS, GROWTH SEEKERS AND LIFE CHANGERS. YOUR JOURNEY WILL BEGIN WITH AN EXTENSIVE, CUSTOMER-CENTRIC RETAIL SALES TRAINING PROGRAM THAT EMPOWERS YOU TO CREATE A LIFE-CHANGING IN-STORE EXPERIENCE AND HELP CUSTOMERS BUILD THE PERFECT SLEEP SANCTUARY. HELPING PEOPLE SLEEP WELL SO THEY LIVE WELL IS AT THE CORE OF WHAT WE DO. THE RIGHT MATTRESS MATTERS, AND SO DOES THE RIGHT CAREER.\n\nMATTRESS FIRM TAKES PRIDE IN OUR PURPOSE OF HELPING PEOPLE SLEEP WELL TO LIVE WELL, AND WE DEEPLY INVEST IN EVERY NEW SALES ASSOCIATE COMING ON BOARD TO LIVE UP TO THAT PROMISE. OUR AWARD-WINNING TALENT DEVELOPMENT PROGRAMS INCLUDE AN EDUCATION PATH DESIGNED TO SUPPORT ALL NEW SALES ASSOCIATES' LEARNING PROFICIENCY FOR SPECIALTY RETAIL. NOT ONLY DO WE INVEST IN TRAINING, BUT ALL NEW SALES ASSOCIATES ARE ELIGIBLE FOR A PERFORMANCE-BASED BONUS AFTER THEIR SIXTH MONTH OF EMPLOYMENT.\n\nWHY WORK FOR MATTRESS FIRM?\n\nOUR TEAMS ARE PASSIONATE, AND OUR CULTURE IS INSPIRING YOU’LL BE SURROUNDED BY AMBITIOUS PEOPLE: INNOVATORS, ACTION TAKERS; LIFE CHANGERS THAT WILL INSPIRE YOU EXCELLENT GROWTH OPPORTUNITIES THROUGH EDUCATION AND DEVELOPMENT PROGRAMS GREAT BENEFITS GET PAID ON DEMAND MENTAL HEALTH AND LIFE RESOURCES GREAT EMPLOYEE DISCOUNTS: MATTRESSES AND SLEEP ACCESSORIES CELL PHONES AND ELECTRONICS TRAVEL CAR AND HOME LOANS AND MORE MEDICAL, DENTAL, PRESCRIPTION, AND VISION PLANS 401(K) WITH EMPLOYER MATCHING SOME POSITIONS HAVE BASE PAY OR UNCAPPED COMMISSION \n\nJOB DESCRIPTION\n\nTHE SLEEP EXPERT WILL ELEVATE AND ENHANCE THE CUSTOMER'S IN-STORE EXPERIENCE BY BEING A TRUSTED SLEEP AUTHORITY AND OFFERING BEST-IN-CLASS PRODUCTS. SLEEP EXPERTS WILL EXECUTE THE MATTRESS FIRM SELLING PROGRAMS AND SUPPORT A SEAMLESS OMNI-CHANNEL EXPERIENCE TO CREATE A COMPELLING AND ENGAGING ENVIRONMENT THAT PUTS THE CUSTOMER AT THE CENTER.\n\nCREATE AN ENVIRONMENT WHERE THE CUSTOMER IS ALWAYS AT THE CENTER BY CULTIVATING STRONG RELATIONSHIPS PROVIDE TECHNICAL AND PRODUCT KNOWLEDGE INFORMATION TO CUSTOMERS, SERVE AS SUBJECT MATTER EXPERT DRIVE INDIVIDUAL SALES PERFORMANCE AND KPIS WHILE DEMONSTRATING COMPANY VALUES AND SUPPORTING COMPANY INITIATIVES EXECUTE CURRENT VISUAL MERCHANDISING AND POP STANDARDS ADHERE TO COMPANY MERCHANDISING AND MARKETING PROGRAMS TO STANDARD FOLLOW COMPANY POLICY AND EXECUTE COMPANY STANDARDS ON APPEARANCE AND FUNCTIONALITY MAINTAIN CUSTOMER RELATIONSHIPS DURING AND POST-PURCHASE (E.G., RESOLVING ISSUES, DELIVER REMINDERS, RESOLVING CONCERNS ETC.) SEEK AND ACCEPT CONSTRUCTIVE FEEDBACK FOR CONTINUOUS PERSONAL, PROFESSIONAL AND PERFORMANCE DEVELOPMENT CONTINUE TO DEVELOP SKILLS, COMPETENCIES, PRODUCT KNOWLEDGE THROUGH ASSIGNED COURSE WORK, TRAINING AND OTHER COMPANY LED ACTIVITIES MAINTAIN AWARENESS OF COMPETITION, ADVERTISEMENTS AND SERVICES OFFERED, DEVELOP STRATEGIES TO COUNTER LEVERAGE SOCIAL MEDIA TO POSITIVELY IMPACT BRAND AWARENESS AND INCREASE SALES ENSURE TIMELY OPEN AND CLOSING PROCEDURES FOLLOW ALL COMPANY PROCEDURES ON CASH HANDLING INCLUDING ACCEPTANCE OF PAYMENT AND DEPOSIT PROCESSES ABILITY TO PUSH AND PULL AND LIFT UP TO 50 POUNDS TO ASSIST CUSTOMERS WITH LOAD OUTS AND IN STORE PURCHASES ADHERE TO ALL SALES PROCESSING POLICIES TO ENSURE THE PROPER CREATION AND EXECUTION OF CUSTOMER INVOICING PROFESSIONAL COMMUNICATION AND REPRESENTATION OF COMPANY BRAND IN ALL INTERNAL AND EXTERNAL INTERACTIONS COMPLETE ALL REQUIRED TRAINING MODULES AND CERTIFICATIONS PRIOR TO THE DUE DATE ENSURE ALL SAFETY POLICIES AND PROCEDURES ARE FOLLOWED TO MAINTAIN A SAFE WORK ENVIRONMENT FOR ALL COMMUNICATE PROFESSIONALLY WITH ALL INTERNAL AND EXTERNAL CONTACTS FOLLOW ALL COMPANY POLICIES AND EXECUTE COMPANY STANDARDS ON APPEARANCE AND FUNCTIONALITY AS WELL AS APPROPRIATE BRAND REPRESENTATION COMMUNICATES ANY CONCERNS OR ISSUES TO LEADERSHIP TO ENSURE PROPER EFFICIENCY OF DEPARTMENT AND COMPANY OPERATIONS \n\nLIFE AT MATTRESS FIRM\n\nOUR MISSION AND VISION\n\nAS AMERICA’S MOST TRUSTED AUTHORITY ON SLEEP, OUR MISSION IS TO HELP PEOPLE FIND THE MATTRESS OF THEIR DREAMS. WITH LOW PRICES, THE BEST BRANDS AND THE KNOWLEDGE OF OUR SLEEP EXPERTS®, WE MAKE IT EASY TO GET A GREAT NIGHT’S SLEEP, EVERY NIGHT.\n\nHISTORY\n\nIN JUST OVER 30 YEARS, MATTRESS FIRM HAS BECOME AMERICA’S LARGEST SPECIALTY MATTRESS RETAILER. WITH MORE THAN 2,400 STORES NATIONWIDE AND A TEAM OF MORE THAN 6,000 SLEEP EXPERTS®, WE HAVE HELPED MILLIONS OF PEOPLE GET BETTER SLEEP.\n\nBENEFITS BEYOND A PAYCHECK\n\nWE SUPPORT YOU JUST LIKE WE SUPPORT OUR CUSTOMERS—THAT’S WHY WE OFFER AN EXTENSIVE RANGE OF BENEFITS DESIGNED TO SUPPORT YOU, YOUR FAMILY, AND YOUR FUTURE.\n\nDIVERSITY, EQUITY AND INCLUSION\n\nWE BELIEVE IN AN INCLUSIVE ENVIRONMENT THAT ATTRACTS, DEVELOPS AND RETAINS TOP TALENT. OUR DIVERSITY, EQUITY & INCLUSION COUNCIL WORKS TO PROMOTE THE CULTIVATION OF A WORK ENVIRONMENT THAT EMBRACES AND CELEBRATES ALL THE INDIVIDUALS, BACKGROUNDS AND PERSPECTIVES THAT REFLECT THE COMMUNITIES WE SERVE.\n\nGIVING BACK TO OUR COMMUNITY\n\nWHETHER IT’S VOLUNTEERING AT A FOSTER CARE AGENCY, FOOD BANK OR EVEN AN ANIMAL SHELTER, WE BELIEVE IN GIVING BACK TO OUR ASSOCIATES AND THE COMMUNITIES THEY LIVE AND WORK IN. THAT'S WHY WE'RE PROUD TO SUPPORT ORGANIZATIONS DEDICATED TO HELPING PEOPLE FOLLOW THEIR DREAMS AND THRIVE.\n\nDIVERSE CANDIDATES ARE ENCOURAGED TO APPLY\n\nMATTRESS FIRM IS AN EQUAL EMPLOYMENT OPPORTUNITY EMPLOYER AND IS COMMITTED TO MAINTAINING A NON-DISCRIMINATORY WORK ENVIRONMENT AND DOES NOT DISCRIMINATE AGAINST ANY APPLICANT OR EMPLOYEE FOR EMPLOYMENT ON THE BASIS OF RACE, COLOR, RELIGION, SEX, NATIONAL ORIGIN, AGE, DISABILITY, VETERAN STATUS, MARITAL STATUS, SEXUAL ORIENTATION, GENDER IDENTITY, OR ANY OTHER CHARACTERISTIC PROTECTED BY APPLICABLE LAW. MATTRESS FIRM IS COMMITTED TO CREATING A DYNAMIC WORK ENVIRONMENT THAT VALUES DIVERSITY AND INCLUSION, RESPECT AND INTEGRITY, CUSTOMER FOCUS, AND INNOVATION.\n\nPAY RANGE\n\n60,000-90,000\n\nNOW DON’T FALL ASLEEP OUT THERE… THE SOONER THAT WE RECEIVE YOUR APPLICATION, THE CLOSER YOU ARE TO THE CAREER OF YOUR DREAMS!\n\nDIVERSE CANDIDATES ARE ENCOURAGED TO APPLY\n\nMATTRESS FIRM IS AN EQUAL EMPLOYMENT OPPORTUNITY EMPLOYER AND IS COMMITTED TO MAINTAINING A NON-DISCRIMINATORY WORK ENVIRONMENT, AND DOES NOT DISCRIMINATE AGAINST ANY APPLICANT OR EMPLOYEE FOR EMPLOYMENT ON THE BASIS OF RACE, COLOR, RELIGION, SEX, NATIONAL ORIGIN, AGE, DISABILITY, VETERAN STATUS, MARITAL STATUS, SEXUAL ORIENTATION, GENDER IDENTITY, OR ANY OTHER CHARACTERISTIC PROTECTED BY APPLICABLE LAW. MATTRESS FIRM IS COMMITTED TO CREATING A DYNAMIC WORK ENVIRONMENT THAT VALUES DIVERSITY AND INCLUSION, RESPECT AND INTEGRITY, CUSTOMER FOCUS, AND INNOVATION.",
    "job_skill_set": [
      "customer service",
      "product knowledge",
      "visual merchandising",
      "cash handling",
      "training and development",
      "communication",
      "relationship building",
      "teamwork",
      "problem solving",
      "adaptability",
      "customer focus",
      "initiative",
      "sales performance",
      "lifting (up to 50 pounds)",
      "omni-channel experience",
      "social media marketing",
      "feedback acceptance"
    ],
    "short_keywords": [
      "50",
      "acceptance",
      "adaptability",
      "and",
      "building",
      "cash",
      "communication",
      "customer",
      "development",
      "experience",
      "expert",
      "feedback",
      "focus",
      "handling",
      "initiative",
      "knowledge",
      "lifting",
      "marketing",
      "media",
      "merchandising",
      "omnichannel",
      "performance",
      "pounds",
      "problem",
      "product",
      "relationship",
      "sales",
      "service",
      "sleep",
      "social",
      "solving",
      "teamwork",
      "to",
      "training",
      "up",
      "visual"
    ]
  },
  {
    "job_id": "3894895288",
    "job_title": "Territory Sales Manager",
    "category": "SALES",
    "job_description": "LOOKING FOR A SELF STARTER THAT ENJOYS OUTSIDE SALES. THIS TERRITORY COVERS THE GREATER NEW ORLEANS AREA. IF YOU ENJOY CREATING RELATIONSHIPS WITH CUSTOMERS, A TEAM CULTURE OF WINNERS, THAN THIS MIGHT BE THE JOB FOR YOU. SEND ME YOUR RESUME. VISIT OUR WEBSITE AT WWW.WURTHUSA.COM.\nSEND RESUMES TO ANTHONY.GILLESPIE@WURTHUSA.COM",
    "job_skill_set": [
      "outside sales",
      "customer relationship management",
      "self-starter",
      "teamwork",
      "communication"
    ],
    "short_keywords": [
      "communication",
      "customer",
      "management",
      "manager",
      "outside",
      "relationship",
      "sales",
      "selfstarter",
      "teamwork",
      "territory"
    ]
  },
  {
    "job_id": "3904727703",
    "job_title": "Counter Sales Representative",
    "category": "SALES",
    "job_description": "JOB POSTING: \n\nFERGUSON IS NORTH AMERICA’S LEADING VALUE-ADDED DISTRIBUTOR ACROSS RESIDENTIAL, NON-RESIDENTIAL, NEW CONSTRUCTION AND REPAIR, MAINTENANCE, AND IMPROVEMENT (RMI) END MARKETS. SPANNING 34,000 SUPPLIERS AND MORE THAN ONE MILLION CUSTOMERS, WE DELIVER LOCAL EXPERTISE, VALUE-ADDED SOLUTIONS, AND THE INDUSTRY’S MOST EXTENSIVE PORTFOLIO OF PRODUCTS. FROM INFRASTRUCTURE, PLUMBING, AND APPLIANCES, TO HVAC, FIRE PROTECTION, FABRICATION, AND MORE, WE MAKE OUR CUSTOMERS’ COMPLEX PROJECTS SIMPLE, SUCCESSFUL, AND SUSTAINABLE.\n\nFERGUSON IS SEEKING THE RIGHT INDIVIDUAL TO FILL AN IMMEDIATE NEED FOR A COUNTER SALES REPRESENTATIVE.\n\nSCHEDULE: MONDAY-FRIDAY 7 AM - 5 PM \n\nRESPONSIBILITIES:\n\nPROVIDES ADVICE TO CUSTOMERS REGARDING THE BEST PRODUCTS TO FIT THEIR NEEDSPROCESSING ORDERS VIA ORDER MANAGEMENT SYSTEMOPERATE CASH REGISTERS AND FOLLOW ESTABLISHED CASH HANDLING PROCEDURESPREPARE AND STAGE ORDERS FOR CUSTOMER PICK UPMAINTAIN STORE APPEARANCE AND MERCHANDISING STANDARDS AS ADVISEDENSURE THAT MERCHANDISE IS RESTOCKED AND PLACED IN THEIR RESPECTIVE AREASMAINTAIN A SAFE WORKING ENVIRONMENT INCLUDING PPE (PERSONAL PROTECTIVE EQUIPMENT)\n\nQUALIFICATIONS:\n\n3-5 YEARS EXPERIENCE PREFERREDBASIC KNOWLEDGE OF PRODUCTS IS PREFERREDGENERAL COMPUTER SKILLS, INCLUDING KNOWLEDGE OF MICROSOFT OFFICE APPLICATIONS REQUIREDABILITY TO LIFT, LOAD, AND DELIVER MERCHANDISEGENERAL MATH SKILLS TO ALLOW FOR CASH ACCOUNTINGAN ABILITY TO LEARN IS A MUST HAVE!EXCELLENT DECISION MAKING AND COMMUNICATION SKILLS\n\nFERGUSON IS DEDICATED TO PROVIDING MEANINGFUL BENEFITS PROGRAMS AND PRODUCTS TO OUR ASSOCIATES AND THEIR FAMILIES—GEARED TOWARD BENEFITS, WELLNESS, FINANCIAL PROTECTION, AND RETIREMENT SAVINGS. FERGUSON OFFERS A COMPETITIVE BENEFITS PACKAGE THAT INCLUDES MEDICAL, DENTAL, VISION, RETIREMENT SAVINGS WITH COMPANY MATCH, PAID LEAVE (VACATION, SICK, PERSONAL, HOLIDAY, AND PARENTAL), EMPLOYEE ASSISTANCE PROGRAMS, ASSOCIATE DISCOUNTS, COMMUNITY INVOLVEMENT OPPORTUNITIES, AND MUCH MORE!\n\nPAY RANGE:\n\n$15.00 - $21.68\n\nESTIMATED RANGES DISPLAYED ARE MONTHLY FOR SALARIED ROLES OR HOURLY FOR ALL OTHER ROLES.\n\nTHIS ROLE IS BONUS OR INCENTIVE PLAN ELIGIBLE.\n\nTHE COMPANY IS AN EQUAL OPPORTUNITY EMPLOYER AS WELL AS A GOVERNMENT CONTRACTOR THAT SHALL ABIDE BY THE REQUIREMENTS OF 41 CFR 60-300.5(A), WHICH PROHIBITS DISCRIMINATION AGAINST QUALIFIED PROTECTED VETERANS AND THE REQUIREMENTS OF 41 CFR 60-741.5(A), WHICH PROHIBITS DISCRIMINATION AGAINST QUALIFIED INDIVIDUALS ON THE BASIS OF DISABILITY.\n\nFERGUSON ENTERPRISES, LLC. IS AN EQUAL EMPLOYMENT EMPLOYER F/M/DISABILITY/VET/SEXUAL ORIENTATION/GENDER IDENTITY.\n\nEQUAL EMPLOYMENT OPPORTUNITY AND REASONABLE ACCOMMODATION INFORMATION",
    "job_skill_set": [
      "cash handling",
      "general math skills",
      "customer service",
      "communication",
      "decision making",
      "ability to learn",
      "teamwork",
      "order management system",
      "Microsoft Office",
      "lifting and loading merchandise"
    ],
    "short_keywords": [
      "ability",
      "and",
      "cash",
      "communication",
      "counter",
      "customer",
      "decision",
      "general",
      "handling",
      "learn",
      "lifting",
      "loading",
      "making",
      "management",
      "math",
      "merchandise",
      "microsoft",
      "office",
      "order",
      "representative",
      "sales",
      "service",
      "skills",
      "system",
      "teamwork",
      "to"
    ]
  },
  {
    "job_id": "3901354670",
    "job_title": "Salesforce Architect - Omnistudio",
    "category": "SALES",
    "job_description": "AT OMNISKOPE, OUR MISSION IS TO ACCELERATE DIGITAL TRANSFORMATION, KEEPING PEOPLE AT THE FOREFRONT OF WHAT WE DO AND DOING IT WELL BY DOING GOOD. OUR PEOPLE ARE OUR EMPLOYEES, OUR CUSTOMERS, AND THE COMMUNITIES AROUND US.\nWE ARE A GROWING COMPANY HEADQUARTERED IN SAINT LOUIS, USA, EXPANDING OUR SALESFORCE TEAM IN INDIA. WE PARTNERED WITH INDUSTRY LEADERS LIKE SALESFORCE.COM, GOOGLE, AND ORACLE TO ENHANCE CUSTOMER BUSINESS EXPERIENCES. OUR EXPERT SERVICES HAVE MADE US A TRUSTED TECHNOLOGY PARTNER TO INDUSTRY LEADERS ACROSS THE UNITED STATES.\nOMNISKOPE IS AN EXCELLENT FIT IF YOU LIKE SMALL TEAMS, ARE PART OF AN INITIAL GROWTH TEAM, AND BELIEVE IN IMPACTING OUR CUSTOMERS, PEOPLE, AND COMMUNITIES.\nTO SIMPLIFY, WE WANTED TO BE YOUR PLATFORM FOR SUCCESS AND MAKE YOUR DREAMS COME TRUE.\nOUR VALUES\nCUSTOMER SUCCESS & EXCELLENCE.OWN & INSPIRENEVER STOP LEARNINGCOLLABORATE & COMMUNICATEEMPATHIC & PEOPLE-FIRSTBE A MULTIPLIERFOSTER EQUALITYHAVE FUN\nLEARN MORE ABOUT OMNISKOPE AT HTTPS://WWW.OMNISKOPE.COM/\n\nJOB OVERVIEW:\nWE'RE SEEKING A HIGHLY SKILLED SALESFORCE ARCHITECT WITH EXPERTISE IN OMNISTUDIO/VLOCITY. IN THIS ROLE, YOU'LL BE THE GO-TO EXPERT FOR DESIGNING, DEVELOPING, AND IMPLEMENTING CUTTING-EDGE CUSTOMER ENGAGEMENT SOLUTIONS. YOU'LL LEVERAGE YOUR EXPERTISE IN THE SALESFORCE PLATFORM AND OMNISTUDIO TO BRIDGE THE GAP BETWEEN BUSINESS NEEDS AND EXCEPTIONAL USER EXPERIENCES.\nRESPONSIBILITIES:\nANALYZE COMPLEX BUSINESS REQUIREMENTS AND TRANSLATE THEM INTO ROBUST, SCALABLE OMNISTUDIO SOLUTIONS.DESIGN INTRICATE OMNICHANNEL CUSTOMER JOURNEYS UTILIZING THE FULL POTENTIAL OF OMNISCRIPT, DATARAPTOR, FLEXCARDS, AND LIGHTNING COMPONENTS.LEVERAGE VLOCITY INDUSTRY CLOUD SOLUTIONS AND CONFIGURE THEM TO MEET SPECIFIC BUSINESS NEEDS.UNDERSTAND AND INTEGRATE WITH SALESFORCE CORE FUNCTIONALITIES LIKE OBJECTS, WORKFLOWS, AND APEX.DEVELOP REUSABLE OMNISCRIPT FLOWS WITH A FOCUS ON USER-FRIENDLINESS, EFFICIENCY, AND MAINTAINABILITY.LEVERAGE DATARAPTOR FOR SEAMLESS DATA INTEGRATION AND MANIPULATION WITHIN OMNISTUDIO EXPERIENCES.DESIGN DYNAMIC AND ENGAGING FLEXCARD LAYOUTS THAT PROVIDE A CAPTIVATING USER INTERFACE.COLLABORATE WITH STAKEHOLDERS TO DOCUMENT TECHNICAL DESIGNS, USER STORIES, AND SYSTEM SPECIFICATIONS.STAY UP-TO-DATE ON THE LATEST ADVANCEMENTS IN SALESFORCE OMNISTUDIO, VLOCITY, AND SALESFORCE ARCHITECTURE BEST PRACTICES.\nQUALIFICATIONS:\nPROVEN EXPERIENCE AS A SALESFORCE ARCHITECT, WITH A FOCUS ON OMNISTUDIO AND VLOCITY, AND A STRONG UNDERSTANDING OF SALESFORCE PLATFORM CAPABILITIES AND LIMITATIONS.EXPERTISE IN SALESFORCE OMNISTUDIO COMPONENTS (OMNISCRIPT, DATARAPTOR, FLEXCARDS).STRONG UNDERSTANDING OF VLOCITY CONCEPTS AND CAPABILITIES (FAMILIARITY WITH SPECIFIC INDUSTRY CLOUDS A PLUS).EXTENSIVE KNOWLEDGE OF OMNISTUDIO FEATURES, INCLUDING JOURNEY BUILDER, INTERACTION STUDIO, AUDIENCE STUDIO, AND DATA STUDIO.EXPERIENCE WITH SALESFORCE INTEGRATIONS, PARTICULARLY WITH EXTERNAL SYSTEMS AND DATA SOURCES.STRONG ANALYTICAL AND PROBLEM-SOLVING SKILLS, WITH THE ABILITY TO TRANSLATE COMPLEX BUSINESS REQUIREMENTS INTO TECHNICAL SOLUTIONS.EXCELLENT COMMUNICATION AND INTERPERSONAL SKILLS, WITH THE ABILITY TO COLLABORATE EFFECTIVELY WITH CROSS-FUNCTIONAL TEAMS AND CLIENTS.\nCERTIFICATIONS:\nSALESFORCE CERTIFIED OMNISTUDIO CONSULTANTSALESFORCE CERTIFIED OMNISTUDIO DEVELOPERSALESFORCE CERTIFIED PLATFORM DEVELOPER ISALESFORCE CERTIFIED APPLICATION ARCHITECTSALESFORCE CERTIFIED DATA ARCHITECTSALESFORCE CERTIFIED INTEGRATION ARCHITECT\n\nOMNISKOPE INC IS AN EQUAL EMPLOYMENT OPPORTUNITY EMPLOYER. THIS ORGANIZATION PARTICIPATES IN E-VERIFY AND CONDUCTS PRE-EMPLOYMENT CRIMINAL HISTORY BACKGROUND CHECKS. OMNISKOPE INC. IS COMMITTED TO EMPLOYING A DIVERSE WORKFORCE.",
    "job_skill_set": [
      "Analytical Skills",
      "Problem Solving",
      "Communication",
      "Interpersonal Skills",
      "Collaboration",
      "Adaptability",
      "Customer Focus",
      "Salesforce",
      "Omnistudio",
      "Vlocity",
      "Omniscript",
      "Dataraptor",
      "Flexcards",
      "Lightning Components",
      "Salesforce Integrations",
      "Data Studio",
      "Journey Builder",
      "Interaction Studio",
      "Audience Studio",
      "Apex",
      "Technical Design Documentation"
    ],
    "short_keywords": [
      "adaptability",
      "analytical",
      "apex",
      "architect",
      "audience",
      "builder",
      "collaboration",
      "communication",
      "components",
      "customer",
      "data",
      "dataraptor",
      "design",
      "documentation",
      "flexcards",
      "focus",
      "integrations",
      "interaction",
      "interpersonal",
      "journey",
      "lightning",
      "omniscript",
      "omnistudio",
      "problem",
      "sales",
      "salesforce",
      "skills",
      "solving",
      "studio",
      "technical",
      "vlocity"
    ]
  },
  {
    "job_id": "3894982645",
    "job_title": "Technical Sales Engineer ",
    "category": "SALES",
    "job_description": "THIS POSITION IS A MID-LEVEL POSITION RESPONSIBLE FOR SELLING PRODUCTS, SOLUTIONS, AND SERVICES TO NEW AND / OR EXISTING CUSTOMERS DIRECTLY OR THROUGH SALES CHANNELS AND ESTABLISHES AND /OR MAINTAINS CUSTOMER RELATIONSHIPS. THIS INCLUDES GUIDING THE DAY-TO-DAY OPERATION OF A TERRITORY AND /OR SALES CUSTOMER TO ENSURE ACHIEVEMENT OF BUSINESS TARGETS. THIS POSITION REPORTS TO THE DIRECTOR KEY CORPORATE ACCOUNTS. \nDUTIES AND REQUIREMENTS INCLUDED, BUT ARE NOT LIMITED TO: \nDIRECT EXPERIENCE IN ANY OF THE BELOW AREAS:PRODUCT SALES EXPERIENCE IN THE SEMICONDUCTOR PACKAGING INDUSTRY AND/OR ASSEMBLY SERVICES.SPECIFIC CUSTOMER FACING EXPERIENCE IN THE SEMICONDUCTOR INDUSTRY.PROCESS AND PROJECT MANAGEMENT PREFERRED BUT NOT REQUIRED.AN INTERMEDIATE LEVEL OF UNDERSTANDING OF THE SEMICONDUCTOR MARKET AND INDUSTRY.WORKING KNOWLEDGE OR FAMILIARITY WITH IC ASSEMBLY PRODUCTS AND PACKAGING PROCESS TECHNOLOGIES.FACILITATE AND EVENTUALLY LEAD CROSS SITE PROJECTS AND TECHNICAL MEETINGS.ABILITY TO CLEARLY UNDERSTAND CUSTOMER ISSUES AND MANAGE TIMELY RESOLUTION WORKING WITH LOCAL TEAM MEMBERS AND SUPPLY CENTER.ABILITY TO DISTINGUISH BETWEEN CUSTOMER’S EQUIPMENT, PROCESS SPECIFICATIONS AND REQUIREMENTS VERSUS CONTINUOUS IMPROVEMENT PROJECTS THAT ARE OUTSIDE OF CUSTOMER AGREED SPECIFICATIONS.ABILITY TO WORK WITH GLOBAL ORGANIZATION AND GROUPS.FACILITATE COMPLEX EQUIPMENT BUYOFF PROCEDURES BETWEEN THE FACTORY PRODUCT GROUP AND CUSTOMER REQUIREMENTS.ABILITY TO WORK WITH INTERNAL AND EXTERNAL CUSTOMER AND SUPPLIERS.A DYNAMIC ‘CAN DO’ PERSONALITY WITH EXCELLENT RELATIONSHIP BUILDING SKILLS, AND RESULT-ORIENTED APPROACH.EXCELLENT COMMUNICATION SKILLS (WRITTEN, VERBAL), STRONG PRESENTATION SKILLS INCLUDING ABILITY TO PRESENT TO CUSTOMERS UP TO SENIOR MANAGEMENT LEVEL.FACILITATE URGENT EQUIPMENT DOWN SPARE PART DELIVERY WITH THE CUSTOMER AND SUPPLY CENTER.APPLY WORKING LEVEL KNOWLEDGE OF THE EQUIPMENT SUPPLY AGREEMENTS TO HELP FACILITATE AND NEGOTIATE COMMERCIAL CLOSURE WITH THE CUSTOMER.PROFICIENCY IN MICROSOFT OFFICE TOOLS (POWER POINT, EXCEL, PROJECT, WORD ETC.) IS ESSENTIAL.MOTIVATED, SELF-STARTER WITH DEMONSTRATED LEADERSHIP SKILLS AND ABILITY TO MANAGE MULTIPLE PROJECTS WITHOUT DIRECT SUPERVISION.APPROXIMATELY 30% DOMESTIC AND INTERNATIONAL TRAVEL MAY BE REQUIRED.   \nEDUCATION AND EXPERIENCE REQUIREMENTS:\nFIVE (5+) YEARS MINIMUM EXPERIENCE IN IC PACKAGING AND ASSEMBLY.BS DEGREE IN TECHNICAL FIELD.  \nRELOCATION WILL BE CONSIDERED.",
    "job_skill_set": [
      "customer relationship management",
      "communication",
      "relationship building",
      "problem solving",
      "teamwork",
      "product sales",
      "semiconductor packaging",
      "project management",
      "IC assembly products",
      "Microsoft Office",
      "technical presentations",
      "negotiation",
      "leadership",
      "self-starter",
      "adaptability"
    ],
    "short_keywords": [
      "adaptability",
      "assembly",
      "building",
      "communication",
      "customer",
      "engineer",
      "ic",
      "leadership",
      "management",
      "microsoft",
      "negotiation",
      "office",
      "packaging",
      "presentations",
      "problem",
      "product",
      "products",
      "project",
      "relationship",
      "sales",
      "selfstarter",
      "semiconductor",
      "solving",
      "teamwork",
      "technical"
    ]
  },
  {
    "job_id": "3904090053",
    "job_title": "Partner Sales Manager, Startups, AGS - Startup - NAMER - Partner Sales",
    "category": "SALES",
    "job_description": "DESCRIPTION\n\nAS A PARTNER SALES MANAGER FOR STARTUPS IN NORTH AMERICA, YOU WILL HAVE THE EXCITING OPPORTUNITY TO DELIVER ON OUR STRATEGY TO BUILD MIND SHARE OF AMAZON WEB SERVICES AND GROW ADOPTION OF CLOUD-BASED SOLUTIONS. IN THE ROLE, YOU WILL ESTABLISH AND MAINTAIN C-LEVEL, SALES, AND PRODUCT RELATIONSHIPS WITH STRATEGIC CONSULTING AND TECHNOLOGY PARTNERS TO DRIVE AWS SERVICES REVENUE WITH AWS ACCOUNT TEAMS AND OUR STARTUP CUSTOMERS.\n\nBY ESTABLISHING AND GROWING BUSINESS AND TECHNICAL RELATIONSHIPS, AND MANAGING THE DAY-TO-DAY INTERACTIONS WITH THESE ACCOUNTS, YOU WILL BE RESPONSIBLE FOR CREATING AND CLOSING OPPORTUNITIES WITH PARTNERS THAT DRIVE TOP LINE AWS REVENUE GROWTH AND OVERALL MARKET ADOPTION WITH OUR AWS STARTUP CUSTOMERS. THE CHOSEN CANDIDATE WILL POSSESS BOTH A BUSINESS BACKGROUND THAT ENABLES THEM TO ENGAGE AT THE CXO LEVEL, AS WELL AS A SALES BACKGROUND THAT ENABLES THEM TO EASILY INTERACT WITH ENTERPRISE CUSTOMERS AND SALES EXECUTIVES TO SUPPORT THE AWS AND PARTNER SALES PROCESSES. YOU SHOULD ALSO HAVE A DEMONSTRATED ABILITY TO THINK STRATEGICALLY ABOUT BUSINESS, PRODUCT, AND TECHNICAL CHALLENGES, WITH THE ABILITY TO BUILD AND CONVEY COMPELLING VALUE PROPOSITIONS. THEY SHOULD BE A SELF-STARTER WHO IS PREPARED TO DEVELOP AND EXECUTE AGAINST PARTNER ACCOUNT PLANS AND A TERRITORY COVERAGE PLAN AND CONSISTENTLY DELIVER ON REVENUE TARGETS. THE POSITION ALSO REQUIRES A STRONG TECHNICAL ACUMEN, ALONG WITH WORKING KNOWLEDGE OF SOFTWARE ARCHITECTURE AND THE ENTERPRISE SOFTWARE LANDSCAPE.\n\nKEY JOB RESPONSIBILITIES\n\n DRIVE REVENUE AND MARKET SHARE IN A DEFINED TERRITORY OR INDUSTRY VERTICAL WITH MULTIPLE ACCOUNT TEAMS AND PARTNERS AND/OR WITH A SPECIFIC LIST OF STRATEGIC PARTNERS WITH DEFINED REVENUE AND WIN TARGETS MEET OR EXCEED QUARTERLY REVENUE TARGETS BY HELPING PARTNERS ORIGINATE AND WORK WITH AWS SALES TEAMS TO CLOSE OPPORTUNITIES THAT DRIVE AWS REVENUES WITH PROSPECTS AND CUSTOMERS. MAINTAIN A ROBUST SALES PIPELINE. CREATE & ARTICULATE COMPELLING VALUE PROPOSITIONS AROUND AWS SERVICES TO CUSTOMERS AND PARTNERS. BUILD DEEP RELATIONSHIPS WITH CUSTOMERS AND STRATEGIC PARTNER(S) APPROPRIATE TO YOUR TERRITORY TO FULLY UNDERSTAND THEIR BUSINESS, SOLUTIONS AND TECHNICAL NEEDS. WORK WITH PARTNERS TO EXTEND REACH & DRIVE AWS ADOPTION. SUPPORT PARTNERS AS THEY DEVELOP THEIR SOLUTIONS THROUGH FORMAL AWS APN PROGRAMS. PROVIDE TECHNICAL AND ARCHITECTURAL RESOURCES TO ASSIST YOUR PARTNERS IN CUSTOMER ENGAGEMENTS. DRIVE BUSINESS DEVELOPMENT INITIATIVES IN YOUR TERRITORY IN PARTNERSHIP WITH PARTNER DEVELOPMENT RESOURCES TO HELP DRIVE OPPORTUNITIES TO SOLUTIONS BUILT ON AWS AND ENSURE THAT AWS IS THEIR PREFERRED PLATFORM. DEVELOP AND EXECUTE AGAINST A COMPREHENSIVE ACCOUNT/TERRITORY PLAN SUPPORTING MULTIPLE ACCOUNT TEAMS AND/OR SPECIFIC ASSIGNED PARTNERS TO DRIVE ACHIEVEMENT OF REVENUE AND WIN GOALS. EXECUTE THIS PLAN WHILE WORKING WITH KEY INTERNAL STAKEHOLDERS (E.G. ACCOUNT TEAMS, SPECIALIST SALES TEAMS, SERVICES TEAMS AND BD, PARTNER MARKETING AND PARTNER DEVELOPMENT RESOURCES). PREPARE AND GIVE BUSINESS REVIEWS TO AWS SENIOR MANAGEMENT TEAMS. MANAGE CONTRACT NEGOTIATIONS AND AWS FUNDING PROGRAMS.\n\nABOUT THE TEAM\n\nWORK/LIFE BALANCE\n\nOUR TEAM ALSO PUTS A HIGH VALUE ON WORK-LIFE BALANCE. STRIKING A HEALTHY BALANCE BETWEEN YOUR PERSONAL AND PROFESSIONAL LIFE IS CRUCIAL TO YOUR HAPPINESS AND SUCCESS HERE, WHICH IS WHY WE AREN’T FOCUSED ON HOW MANY HOURS YOU SPEND AT WORK OR ONLINE. INSTEAD, WE’RE HAPPY TO OFFER A FLEXIBLE SCHEDULE SO YOU CAN HAVE A MORE PRODUCTIVE AND WELL-BALANCED LIFE—BOTH IN AND OUTSIDE OF WORK.\n\nMENTORSHIP & CAREER GROWTH\n\nOUR TEAM IS DEDICATED TO SUPPORTING NEW MEMBERS. WE HAVE A BROAD MIX OF EXPERIENCE LEVELS AND TENURES, AND WE’RE BUILDING AN ENVIRONMENT THAT CELEBRATES KNOWLEDGE SHARING AND MENTORSHIP. WE CARE ABOUT YOUR CAREER GROWTH AND STRIVE TO ASSIGN PROJECTS BASED ON WHAT WILL HELP EACH TEAM MEMBER DEVELOP INTO A BETTER-ROUNDED PROFESSIONAL AND ENABLE THEM TO TAKE ON MORE COMPLEX TASKS IN THE FUTURE.\n\nINCLUSIVE AND DIVERSE CULTURE\n\nHERE AT AWS, WE EMBRACE OUR DIFFERENCES. WE ARE COMMITTED TO FURTHERING OUR CULTURE OF INCLUSION. WE HAVE TWELVE EMPLOYEE-LED AFFINITY GROUPS, REACHING 40,000 EMPLOYEES IN OVER 190 CHAPTERS GLOBALLY. WE HAVE INNOVATIVE BENEFIT OFFERINGS, AND WE HOST ANNUAL AND ONGOING LEARNING EXPERIENCES, INCLUDING OUR CONVERSATIONS ON RACE AND ETHNICITY (CORE) AND AMAZECON (GENDER DIVERSITY) CONFERENCES. AMAZON’S CULTURE OF INCLUSION IS REINFORCED WITHIN OUR 14 LEADERSHIP PRINCIPLES, WHICH REMIND TEAM MEMBERS TO SEEK DIVERSE PERSPECTIVES, LEARN AND BE CURIOUS, AND EARN TRUST.\n\nWE ARE OPEN TO HIRING CANDIDATES TO WORK OUT OF ONE OF THE FOLLOWING LOCATIONS:\n\nDENVER, CO, USA | NEW YORK, NY, USA | SAN FRANCISCO, CA, USA\n\nBASIC QUALIFICATIONS\n\n BA/BS DEGREE OR EQUIVALENT WORK EXPERIENCE REQUIRED 5+ YEARS OF TECHNOLOGY RELATED SALES OR BUSINESS DEVELOPMENT EXPERIENCE 5+ YEARS OF DIRECT FIELD EXPERIENCE SELLING SOFTWARE OR CLOUD SOLUTIONS EXPERIENCE COMMUNICATING AND PRESENTING TO SR. LEADERSHIP MUST CURRENTLY RESIDE IN THE GREATER DENVER, NEW YORK METROPOLITAN OR SAN FRANCISCO AREAS, OR BE WILLING TO RELOCATE TO ONE OF THESE AREAS\n\nPREFERRED QUALIFICATIONS\n\n EXPERIENCE MANAGING JOINT GTM SUCCESS WITH CONSULTING AND TECHNOLOGY PARTNERS, INCLUDING DEVELOPMENT AND TRACKING OF JOINT SELL-WITH AND SELL-THROUGH BUSINESS ACTIVITIES. EXPERIENCE IN PARTNER SALES OR OVERLAY SALES ROLES -- BUILDING BRIDGES AND COLLABORATING BETWEEN PARTNER AND COMPANY FIELD SALES ORGANIZATIONS TO BUILD MUTUAL TRUST, SALES ENABLEMENT AND JOINT SALES MOTIONS EXPERIENCE DEVELOPING AND PROMOTING CONSULTING AND/OR TECHNOLOGY PARTNER VALUE PROPOSITIONS TO DIRECT SALES ORGANIZATIONS. IDEALLY WORKING WITH THE SMALL & MEDIUM BUSINESS SEGMENT. EXPERIENCE IN ENTERPRISE SOFTWARE AND FAMILIARITY WITH CLOUD COMPUTING PLATFORMS AND SERVICES. EXPERIENCE IMPLEMENTING EFFECTIVE JOINT GTM PROGRAMS FOR CONSULTING AND TECHNOLOGY PARTNERS INCLUDING JOINT SALES ENABLEMENT, DEMAND GENERATION, LEAD TRACKING, DEAL REGISTRATION AND JOINT SALES REPORTING. DEMONSTRATED LEADERSHIP, INTERPERSONAL SKILLS, AS WELL AS A PROFOUND WILLINGNESS TO COLLABORATE WITH MULTI-LOCATIONAL, CROSS-FUNCTIONAL TEAMS INTERNALLY AND EXTERNALLY. SALES DNA WITH A DESIRE TO COORDINATE FIELD TEAMS TO DEVELOP AND CLOSE HIGH-PROFILE DEALS. MEETS/EXCEEDS AMAZON’S LEADERSHIP PRINCIPLES REQUIREMENTS FOR THIS ROLE. MEETS/EXCEEDS AMAZON’S FUNCTIONAL/TECHNICAL DEPTH AND COMPLEXITY FOR THIS ROLE.\n\nAMAZON IS COMMITTED TO A DIVERSE AND INCLUSIVE WORKPLACE. AMAZON IS AN EQUAL OPPORTUNITY EMPLOYER AND DOES NOT DISCRIMINATE ON THE BASIS OF RACE, NATIONAL ORIGIN, GENDER, GENDER IDENTITY, SEXUAL ORIENTATION, PROTECTED VETERAN STATUS, DISABILITY, AGE, OR OTHER LEGALLY PROTECTED STATUS. FOR INDIVIDUALS WITH DISABILITIES WHO WOULD LIKE TO REQUEST AN ACCOMMODATION, PLEASE VISIT HTTPS://WWW.AMAZON.JOBS/EN/DISABILITY/US.\n\nPURSUANT TO THE SAN FRANCISCO FAIR CHANCE ORDINANCE, WE WILL CONSIDER FOR EMPLOYMENT QUALIFIED APPLICANTS WITH ARREST AND CONVICTION RECORDS.\n\nOUR COMPENSATION REFLECTS THE COST OF LABOR ACROSS SEVERAL US GEOGRAPHIC MARKETS. THE BASE PAY FOR THIS POSITION RANGES FROM $83,100/YEAR IN OUR LOWEST GEOGRAPHIC MARKET UP TO $177,800/YEAR IN OUR HIGHEST GEOGRAPHIC MARKET. PAY IS BASED ON A NUMBER OF FACTORS INCLUDING MARKET LOCATION AND MAY VARY DEPENDING ON JOB-RELATED KNOWLEDGE, SKILLS, AND EXPERIENCE. AMAZON IS A TOTAL COMPENSATION COMPANY. THIS POSITION IS ELIGIBLE FOR VARIABLE PAY VIA A SALES COMPENSATION PLAN. THESE PLANS PAY ACCORDING TO ACHIEVEMENT LEVEL AGAINST SALES TARGETS AND/OR BUSINESS OBJECTIVES. DEPENDENT ON THE POSITION OFFERED, EQUITY, SIGN-ON PAYMENTS, AND OTHER FORMS OF COMPENSATION MAY BE PROVIDED AS PART OF A TOTAL COMPENSATION PACKAGE, IN ADDITION TO A FULL RANGE OF MEDICAL, FINANCIAL, AND/OR OTHER BENEFITS. FOR MORE INFORMATION, PLEASE VISIT HTTPS://WWW.ABOUTAMAZON.COM/WORKPLACE/EMPLOYEE-BENEFITS. THIS POSITION WILL REMAIN POSTED UNTIL FILLED. APPLICANTS SHOULD APPLY VIA OUR INTERNAL OR EXTERNAL CAREER SITE.\n\n\nCOMPANY - AMAZON WEB SERVICES, INC.\n\nJOB ID: A2617739",
    "job_skill_set": [
      "business development",
      "sales",
      "customer engagement",
      "relationship building",
      "self-starter",
      "leadership",
      "problem solving",
      "cloud solutions",
      "AWS services",
      "software architecture",
      "account management",
      "contract negotiation",
      "technical acumen",
      "GTM programs",
      "sales pipeline management",
      "communication",
      "strategic thinking",
      "collaboration",
      "mentorship",
      "presentation skills",
      "adaptability"
    ],
    "short_keywords": [
      "account",
      "acumen",
      "adaptability",
      "ags",
      "architecture",
      "aws",
      "building",
      "business",
      "cloud",
      "collaboration",
      "communication",
      "contract",
      "customer",
      "development",
      "engagement",
      "gtm",
      "leadership",
      "management",
      "manager",
      "mentorship",
      "namer",
      "negotiation",
      "partner",
      "pipeline",
      "presentation",
      "problem",
      "programs",
      "relationship",
      "sales",
      "selfstarter",
      "services",
      "skills",
      "software",
      "solutions",
      "solving",
      "startup",
      "startups",
      "strategic",
      "technical",
      "thinking"
    ]
  },
  {
    "job_id": "3895234651",
    "job_title": "H&M Retail Sales Associate",
    "category": "SALES",
    "job_description": "JOB DESCRIPTION\n\nAT H&M, AS A RETAIL SALES ASSOCIATE YOU WILL BE ADVISING OUR CUSTOMERS AND KEEPING THEM IN STYLE! A RETAIL SALES ASSOCIATE, OR SALES ADVISOR, AS REFERRED TO INTERNALLY, IS RESPONSIBLE FOR DELIVERING THE BEST CUSTOMER EXPERIENCE THAT CONTRIBUTES TO THE STORE’S SALES AND PROFIT. AS A RETAIL SALES ASSOCIATE, YOU WILL ALWAYS PUT CUSTOMERS FIRST, OFFER ASSISTANCE, AND SHARE YOUR PRODUCT AND FASHION KNOWLEDGE. YOU WILL CREATE AN ENVIRONMENT THAT IS EASY FOR OUR CUSTOMERS TO SHOP THROUGH STORE OPERATIONS AND GREAT GARMENT CARE. BY SHARING KNOWLEDGE AND SKILLS WITH COLLEAGUES, YOU WILL ACTIVELY CONTRIBUTE TO CREATING A BEST TEAM TO MEET OUR CUSTOMERS’ EXPECTATIONS. THIS ROLE WILL WORK IN ACCORDANCE WITH H&M STANDARDS, POLICIES, PROCEDURES, AND LEGAL REQUIREMENTS.\n\nTHIS POSITION REPORTS TO OUR DEPARTMENT MANAGERS AND HAS A DOTTED LINE TO THE DEPARTMENT SUPERVISOR.\n\nYOUR DAY TO DAY* \n\nACTIVELY GREET AND ENGAGE WITH OUR CUSTOMERS IN THE SERVICE AREAS AND ON THE SALES FLOOR TO PROVIDE THE BEST CUSTOMER EXPERIENCE SUPPORT IN THE MAINTENANCE OF A NEAT AND TIDY SALES FLOOR TO ENSURE A POSITIVE SHOPPING EXPERIENCE INCLUSIVE OF FOLDING, HANGING, DISPLAYING, AND MERCHANDISING GARMENTS PER H&M GUIDELINES TO MAXIMIZE SELLING OPPORTUNITIES UNLOAD DELIVERY TRUCK, RECEIVE, OPEN, AND UNPACK MERCHANDISE AND LABEL MERCHANDISE WITH SECURITY TAGS WITHIN EFFICIENCY TIMELINE GOALS ACTIVELY PROCESS, STOCK, AND REPLENISH GARMENTS ON SALES FLOOR AND STOCK ROOM RING ON THE REGISTER, REPORT AND HANDLE ALL REQUIRED TRANSACTIONS, ISSUE RECEIPTS, AND FOLD AND PLACE MERCHANDISE IN APPROPRIATE BAG FOLLOWING THE REGISTER BEST PRACTICES ROUTINE EAGER TO EDUCATE AND PROMOTE OUR H&M LOYALTY PROGRAM TO OUR CUSTOMERS SHARE YOUR KNOWLEDGE AND SKILLS WITH YOUR COLLEAGUES, OFFERING HELP WHERE NEEDED TO BUILD A POSITIVE WORKING ENVIRONMENT WORK IN ACCORDANCE WITH H&M STANDARDS AND LOCAL LEGISLATION WITH HEALTH & SAFETY AND SECURITY ROUTINES, TO GUARANTEE YOU, YOUR COLLEAGUES, AND CUSTOMER SAFETY AT ALL TIMES FOLLOW ALL PROCEDURES AND ROUTINES REGARDING SAFETY, SECURITY, AND ADMINISTRATIVE PROCESSES IN ALL AREAS OF THE STORE \n\n\nQUALIFICATIONS\n\nWHO YOU ARE \n\nPASSIONATE FOR CUSTOMER SERVICE AND HELPING PEOPLE FIND THEIR STYLE A MULTI-TASKER WHO ENJOYS WORKING IN A FAST-PACED ENVIRONMENT INCLUSIVE, POSITIVE, CREATIVE, AND WILLING TO LEARN ON THE JOB! A TEAM PLAYER WITH A FLEXIBLE APPROACH YOU HAVE THE ABILITY TO LIFT IN EXCESS OF 20 POUNDS ABILITY TO STAND FOR LONG PERIODS OF TIME, BEND, STRETCH, ENGAGE IN REPETITIVE MOTIONS, PUSH, PULL AND CARRY ITEMS (MANNEQUINS, CLOTHING, TOTES, TORSOS, ETC.) FOR A SHORT DISTANCE ABILITY TO CLIMB A LADDER AND USE A STEP STOOL MUST BE ABLE TO WORK A FLEXIBLE WORK SCHEDULE INCLUDING NIGHTS AND WEEKENDS \n\n\nADDITIONAL INFORMATION\n\nWHY YOU’LL LOVE WORKING FOR H&M \n\nDYNAMIC, TEAM-DRIVEN WORK ENVIRONMENT WITH A GROUP OF UNIQUE, DIVERSE AND KIND INDIVIDUALS. ENDLESS GROWTH & DEVELOPMENT OPPORTUNITIES. DRESS YOUR PERSONALITY. WE ENCOURAGE YOU TO DRESS YOUR PERSONALITY, ALL DAY, EVERY DAY. DID WE MENTION OUR DISCOUNT AT H&M, &OTHER STORIES, AND COS? \n\n\nJOB STATUS: HOURLY, NON-EXEMPT\n\nEEOC CODE: SLS\n\nTHIS JOB POSTING HIGHLIGHTS THE MOST CRITICAL RESPONSIBILITIES AND REQUIREMENTS OF THE JOB. IT’S NOT ALL-INCLUSIVE. THERE MAY BE ADDITIONAL DUTIES, RESPONSIBILITIES ASSIGNED FOR THIS JOB AT THE COMPANY’S DISCRETION.H&M, IN GOOD FAITH, BELIEVES THAT THIS POSTED RATE OF COMPENSATION IS THE ACCURATE RANGE FOR THIS ROLE AT THIS LOCATION AT THE TIME OF THIS POSTING. THIS RANGE MAY BE MODIFIED IN THE FUTURE.\n\n\nCOMPENSATION: \n\nSALES ASSOCIATES START AT $15.00 PER HOUR**\n\nINCLUSION & DIVERSITY: \n\nH&M IS A PART OF H&M GROUP. AT H&M GROUP, WE’RE DETERMINED TO CREATE AND MAINTAIN INCLUSIVE, DIVERSE AND EQUITABLE WORKPLACES THROUGHOUT OUR ORGANIZATION. OUR TEAMS SHOULD CONSIST OF A VARIETY OF PEOPLE THAT SHARE AND COMBINE THEIR KNOWLEDGE, EXPERIENCE AND IDEAS. HAVING A DIVERSE WORKFORCE LEADS TO A POSITIVE IMPACT ON HOW WE ADDRESS CHALLENGES, ON WHAT WE PERCEIVE POSSIBLE AND ON HOW WE CHOOSE TO RELATE TO OUR COLLEAGUES AND CUSTOMERS ALL OVER THE WORLD. HENCE, ALL DIVERSITY DIMENSIONS ARE CONSIDERED IN OUR RECRUITMENT PROCESS.\n\nWE STRIVE TO HAVE A FAIR AND EQUAL PROCESS AND THEREFORE KINDLY ASK YOU NOT TO ATTACH A COVER LETTER IN YOUR APPLICATION AS THEY OFTEN CONTAIN INFORMATION THAT EASILY CAN TRIGGER UNINTENTIONAL BIASES.\n\nCOMPANY DESCRIPTION:\n\nH&M IS A FASHION BRAND THAT OFFERS THE LATEST STYLES AND INSPIRATION, FROM FASHION PIECES AND UNIQUE DESIGNER COLLABORATIONS TO AFFORDABLE WARDROBE ESSENTIALS. OUR BUSINESS IDEA IS FASHION & QUALITY AT THE BEST PRICE IN A SUSTAINABLE WAY. LEARN MORE ABOUT H&M HERE.",
    "job_skill_set": [
      "customer service",
      "merchandising",
      "cash register operation",
      "stock management",
      "product knowledge",
      "safety procedures",
      "teamwork",
      "communication",
      "multitasking",
      "positive attitude",
      "creativity",
      "adaptability",
      "willingness to learn",
      "lifting (20 pounds)",
      "flexible work schedule"
    ],
    "short_keywords": [
      "20",
      "adaptability",
      "associate",
      "attitude",
      "cash",
      "communication",
      "creativity",
      "customer",
      "flexible",
      "hm",
      "knowledge",
      "learn",
      "lifting",
      "management",
      "merchandising",
      "multitasking",
      "operation",
      "positive",
      "pounds",
      "procedures",
      "product",
      "register",
      "retail",
      "safety",
      "sales",
      "schedule",
      "service",
      "stock",
      "teamwork",
      "to",
      "willingness",
      "work"
    ]
  },
  {
    "job_id": "3889170666",
    "job_title": "Salesperson",
    "category": "SALES",
    "job_description": "SALESPERSON\nSHAPING THE DIGITAL FUTURE OF PET LOVERS EVERYWHERE\nABOUT US:WITH A LEGACY SPANNING OVER 20 YEARS IN THE PET INDUSTRY, CENTRAL PARK PUPPIES HAVE CARVED A NICHE FOR OURSELVES AS THOUGHT LEADERS AND INNOVATORS. OUR LATEST BRAND, POOCHES AROMAS, A LUXURIOUS DOG FRAGRANCE, CRAFTED ESPECIALLY FOR ALL BELOVED CANINE COMPANIONS IS LOOKING TO MAKE ITS MARK AMONG PUPPY LOVERS EVERYWHERE. \nJOB SUMMARY:WE ARE LOOKING FOR A DYNAMIC AND RESULTS-DRIVEN SALESPERSON WHO WILL BE RESPONSIBLE FOR DRIVING SALES GROWTH BY DEVELOPING AND MAINTAINING RELATIONSHIPS WITH PET STORES, VETERINARY CLINICS, GROOMERS, AND OTHER BUSINESSES WITHIN THE PET INDUSTRY (B2B SALES). THE IDEAL CANDIDATE WILL HAVE A PASSION FOR PETS, EXCELLENT COMMUNICATION SKILLS, AND A PROVEN TRACK RECORD OF ACHIEVING SALES TARGETS. \nRESPONSIBILITIES:IDENTIFY AND PROSPECT POTENTIAL CLIENTS WITHIN THE PET INDUSTRY, INCLUDING PET STORES, VETERINARY CLINICS, GROOMERS, AND OTHER RELEVANT BUSINESSES. BUILD AND MAINTAIN STRONG RELATIONSHIPS WITH EXISTING AND PROSPECTIVE CLIENTS THROUGH REGULAR COMMUNICATION AND VISITS.PRESENT OUR PRODUCTS AND SERVICES TO CLIENTS, EFFECTIVELY COMMUNICATING THE FEATURES, BENEFITS, AND VALUE PROPOSITION.UNDERSTAND CLIENTS' NEEDS AND PROVIDE TAILORED SOLUTIONS TO MEET THEIR REQUIREMENTS.NEGOTIATE TERMS AND CLOSE SALES DEALS TO ACHIEVE REVENUE TARGETS.COLLABORATE WITH THE MARKETING TEAM TO DEVELOP AND IMPLEMENT SALES STRATEGIES, PROMOTIONS, AND CAMPAIGNS.KEEP ABREAST OF INDUSTRY TRENDS, COMPETITOR ACTIVITIES, AND MARKET DEVELOPMENTS TO IDENTIFY NEW OPPORTUNITIES.PROVIDE TIMELY AND ACCURATE REPORTS ON SALES ACTIVITIES, PIPELINE, AND FORECASTS.\nQUALIFICATIONS: BACHELOR'S DEGREE IN BUSINESS ADMINISTRATION, MARKETING, OR A RELATED FIELD (PREFERRED).PROVEN EXPERIENCE IN SALES, PREFERABLY WITHIN THE PET INDUSTRY.STRONG NEGOTIATION AND PERSUASION SKILLS.EXCELLENT COMMUNICATION AND INTERPERSONAL SKILLS.ABILITY TO WORK INDEPENDENTLY AND AS PART OF A TEAM.RESULTS-ORIENTED WITH A FOCUS ON ACHIEVING SALES TARGETS.KNOWLEDGE OF THE PET INDUSTRY AND PET PRODUCTS IS A PLUS.VALID DRIVER'S LICENSE AND WILLINGNESS TO TRAVEL AS NEEDED.\nBENEFITS:THIS ROLE OFFERS A SALARY AND AN ATTRACTIVE COMMISSION STRUCTURE.FLEXIBILITY IN WORK HOURS AND THE OPTION TO WORK REMOTELY.AN INNOVATIVE WORK ENVIRONMENT THAT ENCOURAGES COLLABORATION AND GROWTH.\nIF YOU BELIEVE IN OUR GLOBAL VISION AND THINK YOU CAN MAKE A MEANINGFUL CONTRIBUTION TO CENTRAL PARK PUPPIES, WE WOULD LOVE TO HEAR FROM YOU.\nATTACH YOUR MOST RECENT CV/ RESUME AND PORTFOLIOCOVER LETTER (OPTIONAL): A BRIEF NOTE ON WHY YOU BELIEVE YOU'RE THE RIGHT FIT FOR THIS ROLE WOULD BE APPRECIATED.REFERENCES (OPTIONAL): ANY NOTABLE REFERENCES THAT CAN VOUCH FOR YOUR SKILLS AND PROFESSIONALISM.\nPLEASE EMAIL YOUR UPDATED RESUME TO: CAREERS@CENTRALPARKPUPPIES.COM\n\n\n\n\n",
    "job_skill_set": [
      "Valid Driver's License",
      "Communication",
      "Interpersonal Skills",
      "Relationship Building",
      "Results-Oriented",
      "Teamwork",
      "Independence",
      "Adaptability",
      "Problem Solving",
      "B2B Sales",
      "Sales Target Achievement",
      "Negotiation",
      "Market Research",
      "Product Presentation",
      "Sales Reporting",
      "Pet Industry Knowledge",
      "Bachelor's Degree in Business or Marketing"
    ],
    "short_keywords": [
      "achievement",
      "adaptability",
      "b2b",
      "bachelors",
      "building",
      "business",
      "communication",
      "degree",
      "drivers",
      "in",
      "independence",
      "industry",
      "interpersonal",
      "knowledge",
      "license",
      "market",
      "marketing",
      "negotiation",
      "or",
      "pet",
      "presentation",
      "problem",
      "product",
      "relationship",
      "reporting",
      "research",
      "resultsoriented",
      "sales",
      "salesperson",
      "skills",
      "solving",
      "target",
      "teamwork",
      "valid"
    ]
  },
  {
    "job_id": "3898163419",
    "job_title": "Regional Sales Manager",
    "category": "SALES",
    "job_description": "WE ARE SEEKING A HIGHLY MOTIVATED AND EXPERIENCED REGIONAL SALES MANAGER TO JOIN OUR TEAM. AS A REGIONAL SALES MANAGER, YOU WILL BE RESPONSIBLE FOR DRIVING SALES GROWTH AND MANAGING KEY ACCOUNTS WITHIN YOUR ASSIGNED REGION. THIS IS A DYNAMIC AND CHALLENGING ROLE THAT REQUIRES STRONG SALES SKILLS, EXCELLENT COMMUNICATION ABILITIES, MULTI-TASKING AND A PROVEN TRACK RECORD OF SUCCESS IN TECHNOLOGY SALES.\nRESPONSIBILITIESCOMPREHEND AND COMMUNICATE THE COMPANY'S COMPETITIVE ADVANTAGES AND GO TO MARKET STRATEGIES.BUILD AND MAINTAIN STRONG RELATIONSHIPS WITH KEY CLIENTS, PROSPECTS, AND INDUSTRY STAKEHOLDERS TO IDENTIFY BUSINESS OPPORTUNITIES AND DRIVE REVENUE GROWTH.USE THESE RELATIONSHIPS TO SUPPORT AND GROW THE SALES OF THE COMPANY'S PRODUCTS AND SOLUTIONS TO THE RESELLERS IN THE TERRITORY.NETWORK IN THE MARKET TO FIND SOURCES OF LEAD OPPORTUNITIES AND FOLLOW THEM THROUGH TO CLOSING.WORK AND COMMUNICATE CLOSELY WITH REMOTE STAFF TO REPORT SALES ACTIVITY AND OPPORTUNITIES WITHIN OUR CRM SYSTEM.PREPARE AND PRESENT REGULAR SALES REPORTS, FORECASTS, AND INSIGHTS TO SENIOR MANAGEMENT.COLLABORATE WITH CROSS-FUNCTIONAL TEAMS INCLUDING MARKETING, PRODUCT DEVELOPMENT, AND CUSTOMER SERVICE TO ENSURE SEAMLESS EXECUTION OF SALES INITIATIVES.TRAVEL TO THE VARIOUS AREAS IN THE TERRITORY TO CONDUCT PERSONAL MEETINGS AND SALES CALLS ON A REGULAR BASIS. (65% TRAVEL)\nEDUCATION AND EXPERIENCEBACHELORS' DEGREE, PREFERABLY IN A MAJOR WITH EMPHASIS ON BUSINESS, COMMUNICATION OR MARKETING.POST GRADUATE WORK A PLUS.AT LEAST THREE YEARS OF EXPERIENCE IN SALES MANAGEMENT IN A TECHNOLOGY SECTOR OR B-TO-B.SELF-CONFIDENCE AND ABILITY TO THRIVE IN A FAST-PACED, DYNAMIC ENVIRONMENT AND ADAPT TO CHANGING PRIORITIES.GOOD INTERPERSONAL AND COMMUNICATION SKILLS.AN ABILITY TO LEVERAGE GOOD JUDGMENT WHEN CHALLENGED WITH PRICING PRESSURE AND COMPETITIVE STRENGTHS.ABILITY TO CONDUCT PRESENTATIONS OF TECHNICAL INFORMATION CONCERNING SPECIFIC PROJECTS OR TECHNOLOGIES.STRONG COMPUTER SKILLS INCLUDING EXCEL, WORD AND POWERPOINT.ABILITY TO PERFORM IN A SELF-MANAGED ENVIRONMENT MUST BE A \"SELF-STARTER\".MUST BE ABLE TO TRAVEL UP TO 65 % AS NEEDED.MUST HAVE VALID AND LEGAL DRIVER’S LICENSE.MUST BE LOCATED IN TEXAS.",
    "job_skill_set": [
      "sales management",
      "Excel",
      "Word",
      "PowerPoint",
      "business analysis",
      "presentation skills",
      "communication",
      "relationship building",
      "multi-tasking",
      "self-confidence",
      "interpersonal skills",
      "adaptability",
      "judgment",
      "self-management",
      "team collaboration",
      "technology sales",
      "CRM systems"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "building",
      "business",
      "collaboration",
      "communication",
      "crm",
      "excel",
      "interpersonal",
      "judgment",
      "management",
      "manager",
      "multitasking",
      "powerpoint",
      "presentation",
      "regional",
      "relationship",
      "sales",
      "selfconfidence",
      "selfmanagement",
      "skills",
      "systems",
      "team",
      "technology",
      "word"
    ]
  },
  {
    "job_id": "3889476885",
    "job_title": "Sales and Business Development Manager, Minerals and Nutrients - Singapore",
    "category": "SALES",
    "job_description": "\n\nCOMPANY OVERVIEW:\nBALCHEM CORPORATION DEVELOPS, MANUFACTURES, AND MARKETS SPECIALTY INGREDIENTS THAT IMPROVE AND ENHANCE THE HEALTH AND WELL-BEING OF LIFE ON THE PLANET, PROVIDING STATE-OF-THE-ART SOLUTIONS AND THE FINEST QUALITY PRODUCTS FOR A RANGE OF INDUSTRIES WORLDWIDE. OUR CORPORATE HEADQUARTERS IS LOCATED IN MONTVALE, NEW JERSEY AND WE HAVE A BROAD NETWORK OF SALES OFFICES, MANUFACTURING SITES, AND R&D CENTERS, PRIMARILY LOCATED IN THE US AND EUROPE. FOUNDED IN 1967, BALCHEM IS A PUBLICLY TRADED COMPANY (NASDAQ BCPC) WITH ANNUAL REVENUES OVER $900 MILLION AND A MARKET CAP EXCEEDING $4.0 BILLION. THE COMPANY CONSISTS OF THREE BUSINESS SEGMENTS: HUMAN NUTRITION & HEALTH; ANIMAL NUTRITION & HEALTH; AND SPECIALTY PRODUCTS. BALCHEM EMPLOYS OVER 1,400 PEOPLE WORLDWIDE WHO ARE ENGAGED IN DIVERSE ACTIVITIES, COMMITTED TO DEVELOPING THE COMPANY INTO GLOBAL MARKET LEADERSHIP POSITIONS. TO LEARN MORE ABOUT OUR DYNAMIC, STABLE AND GROWING COMPANY, VISIT WWW.BALCHEM.COM.\n\nPOSITION SUMMARY:\nTHIS ROLE WILL BE RESPONSIBLE FOR BUILDING A DIRECT CUSTOMER BASE IN THE SOUTHEAST ASIAN (SEA) REGION AND WILL MANAGE DIRECT ACCOUNTS AS WELL AS DISTRIBUTORS WITHIN SAME TERRITORY. POSITION WILL IDEALLY RESIDE IN SINGAPORE.\n\nESSENTIAL FUNCTIONS:\n THE BDM HAS SALES BUDGET RESPONSIBILITY AND ACCOUNTABILITY FOR SINGAPORE, MALAYSIA, THAILAND, VIETNAM, INDONESIA AND THE PHILIPPINES\n RESPONSIBLE FOR THE MANAGEMENT OF THE DISTRIBUTOR BASE IN SEA AS WELL AS MANAGING AND BUILDING THE DIRECT CUSTOMER BASE\n MAXIMIZE PROFITABILITY AND MANAGE COST\n DAILY COMMUNICATION ON NEW AND EXISTING PROSPECTS/CLIENTS OF DISTRIBUTOR OR DIRECT CUSTOMERS, ASSIST/LEAD IN TECH AND COMMERCIAL DISCUSSIONS\n THE BDM IS EXPECTED TO TRAVEL UP TO 50% OF THEIR TIME TO VISIT BOTH EXISTING AND NEW CLIENTS, EITHER TOGETHER WITH DISTRIBUTOR OR ALONE\n MANAGE ALL INTERNATIONAL OR LOCAL KEY ACCOUNTS (RELATIONSHIP/PROJECT LEVEL) BASED IN THE SEA REGION\n THE BDM IS EXPECTED TO INITIATE NEW CLIENT RELATIONSHIPS WITHIN INDUSTRY AND MANAGE PROJECT TO FRUITION\n THE BDM IS RESPONSIBLE TO CREATE AND MANAGE AN OVERALL MARKET OPERATION PLAN\n BDM IS THE LEAD COMMUNICATOR TO MARKETING FOR ALL LOCAL INITIATIVES\n\nREQUIREMENTS:\n TERTIARY EDUCATION IN NUTRA & OR FOOD MANUFACTURING DISCIPLINE OR BUSINESS MANAGEMENT OR BOTH\n EXTENSIVE EXPERIENCE IN FUNCTIONAL INGREDIENTS\n MIN 10 YEARS INDUSTRY EXPERIENCE IN SIMILAR ROLE\n FAMILIAR WITH NUTRA & FOOD CUSTOMER BASE, MULTI-LEVEL CONTACTS WITHIN INDUSTRY\n SOUND UNDERSTANDING OF THE REGULATORY LANDSCAPE IN THE SOUTHEAST ASIAN COUNTRIES\n STRONG PROJECT MANAGEMENT EXPERTISE AND PROVEN ABILITY TO CLOSE DEALS\n STRONG ANALYTICAL AND MARKET PLANNING ABILITIES\n PROFICIENT IN ENGLISH, MS OFFICE & CRM APPLICATIONS\n EXCELLENT COMMUNICATOR AND PRESENTER AND DEVELOPED LEADERSHIP SKILLS\n MUST BE PERMITTED TO WORK IN SINGAPORE (OR AGREED ALTERNATIVE LOCATION)\n#IN\nBALCHEM IS COMMITTED TO A WORKPLACE CULTURE THAT VALUES AND PROMOTES DIVERSITY, INCLUSION, EQUAL EMPLOYMENT OPPORTUNITIES, AND A WORK ENVIRONMENT FREE OF HARASSMENT AND HOSTILITY. \nPI239290805",
    "job_skill_set": [
      "communication",
      "customer service",
      "teamwork",
      "sales management",
      "project management",
      "market planning",
      "CRM applications",
      "analytical skills",
      "nutraceuticals",
      "food manufacturing",
      "regulatory knowledge",
      "MS Office",
      "leadership",
      "relationship management",
      "negotiation",
      "problem solving"
    ],
    "short_keywords": [
      "analytical",
      "and",
      "applications",
      "business",
      "communication",
      "crm",
      "customer",
      "development",
      "food",
      "knowledge",
      "leadership",
      "management",
      "manager",
      "manufacturing",
      "market",
      "minerals",
      "ms",
      "negotiation",
      "nutraceuticals",
      "nutrients",
      "office",
      "planning",
      "problem",
      "project",
      "regulatory",
      "relationship",
      "sales",
      "service",
      "singapore",
      "skills",
      "solving",
      "teamwork"
    ]
  },
  {
    "job_id": "3901943541",
    "job_title": "Manager of Customer & Sales Operations",
    "category": "SALES",
    "job_description": "MANAGER OF CUSTOMER & SALES OPERATIONS:\nPHARMSOURCE LLC. ARE LOOKING FOR A MANAGER OF CUSTOMER & SALES OPERATIONS TO JOIN THEIR TEAM IN SUNRISE, FLORIDA. \nABOUT THE JOB:THIS POSITION ENSURES THAT THE DEPARTMENT IS CONSISTENTLY PROVIDING SERVICES THAT EXCEED THE EXPECTATIONS OF CUSTOMERS AND SUPERVISES DAILY TASKS OF THE SALES TEAM, BUSINESS DEVELOPMENT TEAM AND CSS TEAM.\nJOB DUTIES: HANDLES ESCALATED ISSUES BY WORKING CLOSELY WITH BUSINESS DEVELOPMENT VP, ACCOUNT SALES MANAGERS, CUSTOMERS, AND/OR CSS TEAM. FINDS SOLUTIONS THAT BENEFIT BOTH THE CUSTOMER AND THE COMPANY. OVERSEES CUSTOMER ACCOUNTS MAINTENANCE, ORDER PROCESSING, DEPARTMENT REPORTS. CONSTANTLY LOOK AT WAYS TO IMPROVE EFFICIENCY AND OVERALL PRODUCTIVITY BY TRACKING ACCURACY, ORDERS ENTERED, AND OTHER METRICS. PROVIDES CUSTOMER SERVICE AT HIGH STANDARDS TO INTERNAL (ALL LEVEL OF EMPLOYEES) AND EXTERNAL CUSTOMERS. OVERSEE ORDER PROCESSING THROUGH ALL PORTALS. MONITORS AND PROCESSES ORDER REQUESTS, AS WELL AS LOOK FOR WAY TO IMPROVE ACCURACY/EFFICIENCY, AND CREATE STANDARDIZED RESPONSES FOR BOTH INTERNAL & EXTERNAL COMMUNICATIONS REGARDING ORDERS. CREATE IN-HOUSE MARKETING MATERIAL FOR PAH, INCLUDING FOR BUSINESS DEVELOPMENT FUNCTION (EMAIL AND PDF FORMAT). LEADS THE CREATION OF MARKETING MATERIALS – BOTH INTERNAL & EXTERNAL – AS WELL AS PRODUCING THE WEBINAR SERIES FOR BOTH LIVE BROADCASTING AND RECORDED VIEWING. GENERATE AND COORDINATE ALL RELATED TO CE WEBINARS. GENERATE EMAIL BLASTS TO CUSTOMERS ACCORDING TO AH STANDARDS. GENERATE AND OVERSEE CSS WEEKLY REPORTS, ALL AH SALES REPORTS, PROMO REPORTS, AND MISC. REPORTS. ENSURE PRICES AND PRODUCTS ARE ACCURATE ON ALL PAH PLATFORMS AND WEBSITES. MONITORS INDIVIDUAL CSS PERFORMANCES AND PROVIDES COACHING IF NECESSARY. BACK UP FOR CSS REPS. MAIN POINT OF CONTACT, COMMUNICATION, AND SUPPORT FOR NETSUITE, BLUELINE, AND ANY OTHER WEBSITE OR PLATFORM FOR AH TEAM AND CUSTOMERS. OVERSEES ALL PLATFORMS AND WEBSTORE MAINTENANCE, ACCOUNTING/ACQUISITIONS FOR CORPORATE ACCOUNTS, CREATING SOPS FOR INTER-DEPARTMENTAL COMMUNICATIONS, CREATING/ASSISTING UPDATES FOR PROMOTIONS ACROSS PLATFORMS, AND PROVIDING SUPPORT FOR TELECOM SYSTEMS AND ERP TROUBLESHOOTING. RESOLVES OPEN ORDERS PASSED THEIR SHIPPING WINDOW, INVOICES ERRORS, BILLING ISSUES, OR POTENTIAL CREDITS. WORKS CLOSELY WITH PURCHASING DEPARTMENT AND WAREHOUSE MANAGERS TO ADDRESS BACKORDERS OR OTHER SHIPPING/INVENTORY ISSUES. RESPONSIBLE FOR SETTING UP NEW ACCOUNTS, AND GROUPS – SPOT CHECKING & IMPORTING (LARGE CORPORATE GROUPS) GENERATE REPORTS ON A WEEKLY, MONTHLY, AND QUARTERLY BASIS FOR VP OF BUSINESS DEVELOPMENT AND VP SALES AND LEADERS IN THE COMPANY. PROVIDES TRAINING ON ALL RELATED WEBSITES AND PLATFORMS FOR NEW HIRES AND ONGOING TRAINING, AND ENFORCES COMPANY STANDARDS, POLICIES, AND PROCEDURES. MANAGE THE SHIPPING FEE AUDIT REPORT MONTHLY. DEVELOP AND COMMUNICATE STANDARD OPERATIONAL PROCEDURES TO THE AH TEAM. INDIRECTLY SUPERVISES THE SALES EMPLOYEES WITHIN THE ANIMAL HEALTH DEPARTMENT. MAINTAIN CONSTANT COMMUNICATION WITH ANIMAL HEALTH VP OF BUSINESS DEVELOPMENT AND VP SALES REGARDING EMPLOYEES DIRECTING WORK; APPRAISING PERFORMANCE; REWARDING AND DISCIPLINING EMPLOYEES; ADDRESSING COMPLAINTS AND RESOLVING PROBLEMS. ASSIST WITH FLOOR SUPPORT AND SPOT COACHING AS NEED IT. WORK CLOSELY AND SUPPORT THE VICE PRESIDENT OF BUSINESS DEVELOPMENT AS NEEDED. MAIN POINT OF CONTACT AND SUPPORT FOR NETSUITE. PERFORMS OTHER RELATED DUTIES AS ASSIGNED BY MANAGEMENT. \nSKILLS AND REQUIREMENTS: BACHELOR’S DEGREE (B.A.) OR EQUIVALENT. FOUR TO SIX YEARS RELATED EXPERIENCE. DEMONSTRATED PROFICIENCY IN SUPERVISING AND MOTIVATING SUBORDINATES. COMMITMENT TO EXCELLENCE AND HIGH STANDARDS. EXCELLENT WRITTEN AND ORAL COMMUNICATION SKILLS. EXCELLENT CUSTOMER SERVICE SKILLS. STRONG ORGANIZATIONAL, PROBLEM-SOLVING, AND ANALYTICAL SKILLS; ABILITY TO MANAGE PRIORITIES AND WORKFLOW. ABILITY TO DEAL EFFECTIVELY WITH A DIVERSITY OF INDIVIDUALS AT ALL ORGANIZATIONAL LEVELS. CREATIVE, FLEXIBLE, AND INNOVATIVE TEAM PLAYER. ABILITY TO WORK WITH TECHNOLOGY AND DIFFERENT PLATFORMS. PROFICIENT WITH POWERPOINT, EXCEL AND WORD. EXPERIENCE WITH ERP SYSTEMS AND PROCESSING (NETSUITE PREFERRED) ABILITY TO MAINTAIN A HIGH LEVEL OF ACCURACY AND STRONG DETAIL-ORIENTATION. DEMONSTRATED ABILITY TO BALANCE DEPARTMENT EFFICIENCY AND PATIENT SERVICE EXCELLENCE. WILLINGNESS TO ASSIST TEAMMATES IN ORDER TO ACHIEVE DEPARTMENTAL GOALS. \nCOMPENSATIONS & BENEFITS: SALARY COMMENSURATE WITH EXPERIENCE (50K- 55K PER YEAR) BENEFITS INCLUDE (401 K, HEALTH, MEDICAL, DENTAL AND VISION, LIFE INSURANCE, PAID TIME OFF/VACATION, ETC.)",
    "job_skill_set": [
      "customer service",
      "supervising",
      "problem-solving",
      "analytical skills",
      "organizational skills",
      "PowerPoint",
      "Word",
      "order processing",
      "marketing materials creation",
      "technology proficiency",
      "detail orientation",
      "communication",
      "teamwork",
      "flexibility",
      "creativity",
      "commitment to excellence",
      "ability to manage priorities",
      "interpersonal skills",
      "ERP systems",
      "Excel",
      "data reporting",
      "training and coaching"
    ],
    "short_keywords": [
      "ability",
      "analytical",
      "and",
      "coaching",
      "commitment",
      "communication",
      "creation",
      "creativity",
      "customer",
      "data",
      "detail",
      "erp",
      "excel",
      "excellence",
      "flexibility",
      "interpersonal",
      "manage",
      "manager",
      "marketing",
      "materials",
      "of",
      "operations",
      "order",
      "organizational",
      "orientation",
      "powerpoint",
      "priorities",
      "problemsolving",
      "processing",
      "proficiency",
      "reporting",
      "sales",
      "service",
      "skills",
      "supervising",
      "systems",
      "teamwork",
      "technology",
      "to",
      "training",
      "word"
    ]
  },
  {
    "job_id": "3901682279",
    "job_title": "Sales Engineer",
    "category": "SALES",
    "job_description": "DESCRIPTION\n\nOUR MISSION IS TO PROTECT DATA FROM INSIDER THREATS AND CYBERATTACKS\n\nWHO WE ARE\n\nWE SEE THE WORLD OF CYBERSECURITY FROM A UNIQUE PERSPECTIVE HERE AT VARONIS. WE’RE FIGHTING THE BATTLE ON A DIFFERENT FRONT THAN CONVENTIONAL CYBERSECURITY COMPANIES, RELENTLESSLY FOCUSED ON SECURING DATA. DATA ASSETS ARE THE MOST VALUABLE – AND VULNERABLE – COMPONENTS OF THE GLOBAL ECONOMY. ALONG WITH EMPLOYEES, DATA IS AT THE HEART OF ALMOST EVERY ORGANIZATION, YET CONVENTIONAL CYBERSECURITY SOLUTIONS, BY THEMSELVES, HAVE FAILED TO PROTECT IT.\n\nWHAT WE DO\n\nWE GIVE COMPANIES A VISION OF WHO IS DOING WHAT, WHERE, AND WHEN IN THEIR ENVIRONMENT. WE CAN SHOW THEM WHERE THEIR SENSITIVE DATA IS STORED, WHO HAS ACCESS TO IT AND WHO SHOULDN’T HAVE ACCESS TO IT. WE CAN ALERT ON UNWANTED ACTIVITY WITHIN MINUTES AND STOP THE BAD GUYS IN THEIR TRACKS. WE ARE THE SECRET WEAPON COMPANIES NEED TO HAVE IN THEIR ARSENAL.\n\nSUMMARY\n\nTHE SALES ENGINEER IS RESPONSIBLE FOR ASSISTING A SALES REPRESENTATIVE AND PARTNERS WITH THE TECHNICAL SALES ACTIVITIES IN NET-NEW AND PRE-EXISTING OPPORTUNITIES.\n\nTHE VARONIS SALES ENGINEER WILL BE ALIGNED WITH A LOCAL SALES REPRESENTATIVE. THE GOAL WILL BE TO DELIVER THE TECHNICAL VALUE OF THE VARONIS PRODUCT TO THE END-USER. AS A TEAM, THE GOAL WILL BE TO BUILD A STRONG BUSINESS JUSTIFICATION FOR THE END USER, WHILE ENSURING THAT THE GIVEN ANNUAL QUOTA IS MET/EXCEEDED.\n\nRESPONSIBILITIES\n\nUNDERSTAND CUSTOMER REQUIREMENTS AND INTEGRATE VARONIS SOLUTIONS INTO THE CUSTOMERS’ ENVIRONMENT.DELIVER SALES PRESENTATIONS, PRESENT TECHNICAL INFORMATION ABOUT VARONIS’ PRODUCTS AND SERVICES, AND CONDUCT PRODUCT DEMONSTRATIONS.MANAGE ALL PHASES OF PRODUCT EVALUATIONS INCLUDING INSTALLATIONS, PRESENTING AT SEMINARS, RESPONDING TO RFP’S AND RFI’S AND THE TECHNICAL DEVELOPMENT OF VARONIS PARTNERS.ABILITY TO WORK INDEPENDENTLY AND TEAM COLLABORATIVELY IN A FAST-PACED ENVIRONMENT.ABILITY TO ARTICULATE THE IMPORTANCE OF DATA GOVERNANCE AND EVANGELIZE VARONIS AS THE LEADER IN THE DATA GOVERNANCE MARKET TO END-USERS OF ALL LEVELS.PERCENT OF TRAVEL VARIES BY TERRITORY.\n\n\nREQUIREMENTS\n\nBACHELOR’S DEGREE OR EQUIVALENT FROM A FOUR-YEAR COLLEGE OR TECHNICAL SCHOOL AND 3-5 YEARS OF EXPERIENCE IN A CUSTOMER-FACING ROLE OR EQUIVALENT COMBINATION OF EDUCATION AND EXPERIENCE.STRONG WRITTEN, ORAL, AND PRESENTATION SKILLS.ABILITY TO DISCUSS HIGHLY TECHNICAL CONCEPTS WITH ALL AUDIENCES, RANGING FROM NON-TECHNICAL TO EXECUTIVE-LEVEL TECHNICAL DECISION-MAKERS.EXTENSIVE KNOWLEDGE OF ACTIVE DIRECTORY AND RELATED DIRECTORY SERVICES.EXTENSIVE KNOWLEDGE OF WINDOWS AND UNIX FILE SYSTEMS.EXPOSURE TO SECURITY HARDWARE AND SOFTWARE.EXPOSURE TO MICROSOFT EXCHANGE PREFERABLY IN A SYSTEMS ADMINISTRATION ROLE.MCSE, MCP MICROSOFT CERTIFICATIONS ARE PREFERRED.\n\n\nCOMPETENCIES\n\nTO PERFORM THIS JOB SUCCESSFULLY, AN INDIVIDUAL SHOULD DEMONSTRATE THE FOLLOWING COMPETENCIES:\n\nANALYTICAL: COLLECTS AND RESEARCHES DATA; DESIGNS WORKFLOWS AND PROCEDURES; IDENTIFIES DATA RELATIONSHIPS AND DEPENDENCIES; SYNTHESIZES COMPLEX OR DIVERSE INFORMATION; USES INTUITION AND EXPERIENCE TO COMPLEMENT DATA.TECHNICAL SKILLS: ASSESSES OWN STRENGTHS AND WEAKNESSES; STRIVES TO CONTINUOUSLY BUILD KNOWLEDGE AND SKILLS; SHARES EXPERTISE WITH OTHERS.SENSE OF URGENCY: DISPLAYS A MATTER OF UTMOST URGENCY; UNDERSTANDS THE IMPORTANCE OF MAKING A CRITICAL BUSINESS DECISION IN A TIMELY MANNER WITH STRONG ATTENTION TO DETAIL; REALIZES THAT EFFICIENCY AND PRIORITIZATION IS CRITICAL TO SUCCESS.CUSTOMER SERVICE: MANAGES DIFFICULT OR EMOTIONAL CUSTOMER SITUATIONS; MEETS COMMITMENTS; RESPONDS PROMPTLY TO CUSTOMER NEEDS; SOLICITS CUSTOMER FEEDBACK TO IMPROVE SERVICE.PROBLEM-SOLVING: IDENTIFIES AND RESOLVES PROBLEMS IN A TIMELY MANNER; GATHERS AND ANALYZES INFORMATION SKILLFULLY; DEVELOPS ALTERNATIVE SOLUTIONS.WRITTEN COMMUNICATIONS: EDITS WORK FOR SPELLING AND GRAMMAR; PRESENTS NUMERICAL DATA EFFECTIVELY; VARIES WRITING STYLE TO MEET NEEDS; WRITES CLEARLY AND INFORMATIVELY.ORAL COMMUNICATION: DEMONSTRATES GROUP PRESENTATION SKILLS; LISTENS AND GETS CLARIFICATION; RESPONDS WELL TO QUESTIONS; SPEAKS CLEARLY AND PERSUASIVELY.ADAPTABILITY: ADAPTS TO CHANGES IN THE WORK ENVIRONMENT; MANAGES COMPETING DEMANDS; CHANGES APPROACH OR METHOD TO BEST FIT THE SITUATION; ABLE TO DEAL WITH FREQUENT CHANGE, DELAYS, OR UNEXPECTED EVENTS.PLANNING/ORGANIZING: PRIORITIZES AND PLANS WORK ACTIVITIES; USES TIME EFFICIENTLY; PLANS FOR ADDITIONAL RESOURCES; SETS GOALS AND OBJECTIVES; DEVELOPS REALISTIC ACTION PLANS.\n\n\nWE INVITE YOU TO CHECK OUT OUR INSTAGRAM PAGE TO GAIN FURTHER INSIGHT INTO THE VARONIS CULTURE!\n\n@VARONISLIFE\n\nVARONIS IS AN EQUAL-OPPORTUNITY EMPLOYER. WE EVALUATE QUALIFIED APPLICANTS WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, NATIONAL ORIGIN, DISABILITY, VETERAN STATUS, AND OTHER LEGALLY PROTECTED CHARACTERISTICS",
    "job_skill_set": [
      "Customer Service",
      "Oral Communication",
      "Adaptability",
      "Planning/Organizing",
      "Active Directory",
      "Windows File Systems",
      "Unix File Systems",
      "Security Hardware",
      "Security Software",
      "Microsoft Exchange",
      "MCSE Certification",
      "MCP Certification",
      "Analytical Skills",
      "Technical Skills",
      "Problem-Solving",
      "Written Communication",
      "Team Collaboration",
      "Presentation Skills",
      "Attention to Detail",
      "Sense of Urgency"
    ],
    "short_keywords": [
      "active",
      "adaptability",
      "analytical",
      "attention",
      "certification",
      "collaboration",
      "communication",
      "customer",
      "detail",
      "directory",
      "engineer",
      "exchange",
      "file",
      "hardware",
      "mcp",
      "mcse",
      "microsoft",
      "of",
      "oral",
      "planningorganizing",
      "presentation",
      "problemsolving",
      "sales",
      "security",
      "sense",
      "service",
      "skills",
      "software",
      "systems",
      "team",
      "technical",
      "to",
      "unix",
      "urgency",
      "windows",
      "written"
    ]
  },
  {
    "job_id": "3904388105",
    "job_title": "Senior Retail Sales Associate",
    "category": "SALES",
    "job_description": "A SENIOR RETAIL SALES ASSOCIATE (FULL-TIME) IS A VALUED MEMBER OF A HIGH PERFORMING TEAM WHO IS EMPOWERED & EQUIPPED TO DO THEIR JOB YOU WILL KNOW WHY YOUR WORK MATTERS AND BE ABLE TO TAKE PRIDE IN WHAT YOU DO! THIS ROLE IS PERFECT FOR YOU IF YOU HAVE THE DESIRE TO DEVELOP AS A LEADER AND IS PASSIONATE ABOUT A CAREER IN RETAIL.\n\nTHE ANTICIPATED RATE FOR THIS POSITION IS $15.30 PER HOUR DEPENDING ON LOCATION, KNOWLEDGE, SKILLS, EDUCATION AND EXPERIENCE. IN ADDITION, WE OFFER COMPREHENSIVE AND COMPETITIVE BENEFITS TO ASSOCIATES (AND THEIR FAMILIES) SUCH AS MEDICAL, DENTAL, VISION, LIFE INSURANCE, SHORT-TERM AND LONG-TERM DISABILITY. ELIGIBLE ASSOCIATES ARE ABLE TO ENROLL IN OUR COMPANY’S 401K PLAN. ASSOCIATES WILL ACCRUE PAID TIME OFF UP TO 152 HOURS PER YEAR (INCLUSIVE OF PTO, FLOATING HOLIDAYS, AND PAID HOLIDAYS). PAID SICK TIME UP TO 64 HOURS PER YEAR UNLESS OTHERWISE REQUIRED BY LAW.\n\nWHY YOU’LL LOVE IT\n\nPEOPLE FIRST CULTUREPAID TIME OFFASSOCIATE DISCOUNTSMEDICAL/DENTAL/VISION INSURANCE FOR ALL ASSOCIATESCOMPANY MATCHED 401(K)RESPECTFUL SCHEDULINGCLOSED ON THANKSGIVING, CHRISTMAS & EASTERSTABLE EMPLOYMENT WITH GROWING COMPANYCLEAR PATH TO PROMOTION WITH FULL-TIME OPPORTUNITIES\n\nWHAT YOU’LL DO:\n\nPROVIDE A GREAT EXPERIENCE FOR OUR CUSTOMERSHANDLE VARIOUS SALES TRANSACTIONSENCOURAGE CUSTOMERS TO PARTICIPATE IN COMPANY PROGRAMSMAINTAIN A SAFE, CLEAN, AND ORGANIZED STORECROSS-TRAIN IN ALL AREAS OF STORE OPERATIONS INCLUDING STOCKING/SALES ASSOCIATE DUTIES, AND RESPONSIBILITIESOTHER DUTIES AS ASSIGNED\n\nREQUIREMENTSWHO YOU ARE\n\nMUST BE AT LEAST 18 YEARS OLD.PREFERRED: 1 YEAR EXPERIENCE IN RETAIL OR CUSTOMER SERVICE ABILITY TO COMMUNICATE CLEARLY WITH CUSTOMERS, AND ASSOCIATES.OPEN AVAILABILITY WITH THE ABILITY TO WORK EVENINGS, WEEKENDS, AND HOLIDAYS. ADHERENCE TO ATTENDANCE POLICY IS NECESSARY. ABILITY TO INTERMITTENTLY LIFT, PUSH AND/OR PULL UP TO 50 POUNDS, AND STAND/MOVE FOR ENTIRE SHIFT.ABILITY TO LIFT, BEND, KNEEL, CLIMB, CRAWL AND/OR TWIST, AND SAFELY CLIMB UP/DOWN A LADDER.PHYSICALLY ABLE AND WILLING TO BECOME CERTIFIED TO OPERATE A FORKLIFT IN ACCORDANCE WITH IPP. (INJURY, AND ILLNESS PREVENTION PROGRAM)",
    "job_skill_set": [
      "retail experience",
      "customer service",
      "sales transactions",
      "stocking",
      "communication",
      "teamwork",
      "customer experience",
      "organizational skills",
      "flexibility",
      "forklift operation certification",
      "leadership"
    ],
    "short_keywords": [
      "associate",
      "certification",
      "communication",
      "customer",
      "experience",
      "flexibility",
      "forklift",
      "leadership",
      "operation",
      "organizational",
      "retail",
      "sales",
      "senior",
      "service",
      "skills",
      "stocking",
      "teamwork",
      "transactions"
    ]
  },
  {
    "job_id": "3902785730",
    "job_title": "Sales Specialist",
    "category": "SALES",
    "job_description": "WHO WE ARE:\n\nMARAVAI LIFESCIENCES TRANSLATES EXTRAORDINARY SCIENCE INTO EVERYDAY MIRACLES, HELPING BIOTECH, BIOPHARMA, AND LIFE SCIENCES COMPANIES EVERYWHERE DELIVER NOVEL VACCINES, THERAPEUTICS, AND DIAGNOSTICS. WE ARE GLOBAL LEADERS IN PROVIDING PRODUCTS AND SERVICES WITHIN THE FIELDS OF NUCLEIC ACID PRODUCTION AND BIOLOGICS SAFETY TESTING TO MANY OF THE WORLD'S LEADING BIOPHARMA, VACCINE, DIAGNOSTICS, AND CELL AND GENE THERAPY COMPANIES.\n\nAT MARAVAI, WE BELIEVE THAT DIVERSE PERSPECTIVES ARE THE FOUNDATION OF INNOVATION. THROUGH AN INCLUSIVE AND EQUITABLE CULTURE WHERE EVERY TEAM MEMBER IS INSPIRED TO BRING THEIR BEST SELVES TO WORK, WE CULTIVATE AN ENVIRONMENT IN WHICH WE CAN LEAD TOGETHER, PROVIDING DIFFERENTIATED VALUE TO OUR CUSTOMERS, AND ENABLING THE MIRACLES OF SCIENCE. FOR OVER 35 YEARS, MARAVAI’S PORTFOLIO COMPANIES HAVE SERVED AS A CATALYST FOR INNOVATIVE, LIFESAVING TECHNOLOGY FOR HUMANITY. PIONEERING NUCLEOTIDE RESEARCH SINCE ITS INCEPTION, WE ARE NOW LEADING THE WAY IN THE RAPIDLY EXPANDING MRNA MARKET.\n\nYOUR NEXT ROLE AS A MIRACLE MAKER\n\nMARAVAI LIFESCIENCES IS SEEKING A #MIRACLEMAKER TO JOIN OUR SALES TEAM AS A SALES SPECIALIST. AS A SALES SPECIALIST YOU WILL PLAY A FUNDAMENTAL ROLE IN ACHIEVING OUR AMBITIOUS CUSTOMER ACQUISITION AND REVENUE GROWTH OBJECTIVES THROUGH LEAD GENERATION, CLIENT COMMUNICATION TO CLOSE SALES, TECHNICAL AND OPERATIONAL SUPPORT FOR COMMERCIAL TEAM, AND POST-SALES FOLLOW UP. THIS ROLE COLLABORATES WITH OTHER SALES FUNCTIONS TO FORM A COHESIVE LEAD GENERATION TO CLOSED SALE AND ANY FOLLOW UP AS NECESSARY.\n\nHOW YOU WILL MAKE AN IMPACT:\n\nMEET QUARTERLY AND ANNUAL SALES GOALS AND OBJECTIVES FOR RESEARCH USE ONLY PRODUCT LINES. THIS ROLE GENERATES CRITICAL REVENUE FOR THE ORGANIZATION SOURCE NEW SALES OPPORTUNITIES THROUGH INBOUND LEAD FOLLOW-UP AND OUTBOUND COLD CALLS AND EMAILS RESEARCH ACCOUNTS, IDENTIFY KEY PLAYERS AND GENERATE INTEREST USING MULTIPLE DATABASES BUILD PIPELINE AND ASSIST WITH CUSTOMER REQUIREMENTS ACROSS ALL POINTS IN THE SALES CYCLE ROUTE QUALIFIED OPPORTUNITIES (GMP, SUPPLY AGREEMENTS, ETC.) TO THE BUSINESS DEVELOPMENT TEAM FOR FURTHER DEVELOPMENT AND CLOSURE PROVIDE SALES AND TECHNICAL SUPPORT AND QUOTING THROUGHOUT THE ENTIRE SALES CYCLE, GLOBALLY FOR ISS, BD, ALLIANCE MANAGEMENT AND GMP LOG AND TRACK ALL CLIENT INTERACTIONS THROUGH CRM (SALESFORCE), NETSUITE AND APPROPRIATE SOFTWARE. REPORT, TRACK AND MAINTAIN A FOLLOW UP SCHEDULE FOR PRODUCT OPEN OPPORTUNITIES. GATHER ALL RELEVANT INFORMATION FROM CUSTOMERS FOR QUOTE GENERATION HAVE FULL KNOWLEDGE OF QUOTING PROCESS AND DO QUOTING AS NECESSARY PROVIDE EFFECTIVE ONLINE PRESENTATIONS TO PROSPECTS WORK WITHIN A TEAM TO ASSIST WITH OPERATIONAL SALES FUNCTIONS SALES SUPPORT FOLLOWING UP ON ANY ESCALATIONS AT EVERY POINT IN THE SALES CYCLE ATTEND NETWORKING EVENTS WITH NEW BUSINESS CONTACTS ORGANIZE COLLATERAL AND ASSIST WITH MARKETING RESPONSIBILITIES AT INDUSTRY CONFERENCES. TRAVEL AND MEET WITH NEW AND CURRENT CUSTOMER PERFORM OTHER FUNCTIONS AND DUTIES AS REQUIRED \n\n\nTHE SKILLS AND EXPERIENCE THAT YOU WILL BRING:\n\nBACHELOR’S DEGREE IN LIFE SCIENCES MINIMUM OF 1 YEAR OF LIFE SCIENCE INDUSTRY EXPERIENCE IN SALES, LAB, OR MARKETING PREFERRED PROFICIENT IN SALESFORCE PREFERRED PROFESSIONAL COMMUNICATION PROFICIENCY WITH STRONG PHONE AND VIDEO CONFERENCING PRESENCE RESULTS DRIVEN WITH TRACK RECORD OF OVER-ACHIEVING COMFORTABLE WITH PUBLIC SPEAKING OPPORTUNITIES AND LARGE GROUP PRESENTATIONS ABILITY TO MULTI-TASK, PRIORITIZE, AND MANAGE TIME EFFECTIVELY QUICK LEARNER, PROBLEM SOLVING/ANALYTICAL THINKING AGILITY AND FLEXIBILITY ARE A MUST \n\n\nTHE ANTICIPATED SALARY RANGE FOR THIS POSITION IS $60,000 - $76,000. IN ADDITION, HIGHLY COMPETITIVE LONG-TERM INCENTIVES IN THE FORM OF COMPANY EQUITY, BONUS PARTICIPATION AND COMPANY SPONSORED BENEFITS ARE PROVIDED AS PART OF THE TOTAL COMPENSATION PACKAGE. THE SALARY OFFER WILL DEPEND ON MULTIPLE FACTORS WHICH MAY INCLUDE THE SUCCESSFUL CANDIDATE'S SKILLS, EXPERIENCE AND OTHER QUALIFICATIONS, AS WELL AS THE LOCATION OF THE ROLE.\n\nTHE BENEFITS OF BEING A #MIRACLEMAKER:\n\nYOU HAVE THE POTENTIAL TO CHANGE, IMPROVE, AND SAVE LIVES AROUND THE WORLD. YOU HAVE THE OPPORTUNITY TO BE A PART OWNER IN MARAVAI THROUGH RSU GRANTS AND OPTIONAL EMPLOYEE STOCK PURCHASE PLANS. WE OFFER COMPREHENSIVE MEDICAL PLANS AND HSA/FSA OPTIONS. FERTILITY & FAMILY PLANNING ASSISTANCE. A VARIETY OF ADDITIONAL OPTIONAL BENEFITS AND INSURANCE OPTIONS, INCLUDING PET INSURANCE. RETIREMENT CONTRIBUTIONS. HOLIDAYS & PAID TIME OFF. \n\n\nSEE A COMPREHENSIVE LIST OF BENEFITS AT OUR BENEFITS & GROWTH SITE AT HTTPS://WWW.MARAVAI.COM/CAREERS/BENEFITS-AND-GROWTH/\n\nTO VIEW MORE OPPORTUNITIES TO BECOME A #MIRACLEMAKER, VISIT OUR CAREER SITE AT HTTPS://WWW.MARAVAI.COM/CAREERS/\n\nMARAVAI LIFESCIENCES IS AN EQUAL OPPORTUNITY/AFFIRMATIVE ACTION EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX INCLUDING SEXUAL ORIENTATION, AND GENDER IDENTITY, NATIONAL ORIGIN, DISABILITY, PROTECTED VETERAN STATUS, OR ANY OTHER CHARACTERISTIC PROTECTED BY APPLICABLE FEDERAL, STATE, OR LOCAL LAW.\n\nCLICK HERE TO VIEW MARAVAI LIFESCIENCES PRIVACY NOTICE\n\nHIRING SCAM ALERT\n\nRECENTLY, INDIVIDUALS IMPERSONATING MARAVAI LIFESCIENCES HUMAN RESOURCES MEMBERS HAVE OFFERED FRAUDULENT INTERVIEWS AND JOB OFFERS TO UNSUSPECTING CANDIDATES. TO HELP PROTECT YOU FROM THESE SCAM ARTISTS, PLEASE BE AWARE THAT:\n\nMARAVAI LIFESCIENCES WILL NEVER INTERVIEW A CANDIDATE OVER RINGCENTRAL, SIMILAR MESSAGING APPS OR SOCIAL MEDIA (E.G. TELEGRAM, GOOGLE HANGOUTS, WHATSAPP, FACEBOOK MESSENGER, ETC.) MARAVAI LIFESCIENCES WILL NEVER SEND A COMPANY CHECK OR ASK AN APPLICANT TO PAY A FEE OR PURCHASE AT HOME WORK/TRAINING MATERIALS IN CONNECTION WITH AN APPLICATION FOR EMPLOYMENT. MARAVAI LIFESCIENCES WILL NEVER PROVIDE EXCESS MONEY TO AN APPLICANT AND ASK THE APPLICANT TO WRITE A CHECK FOR REPAYMENT. \n\n\n IF YOU HAVE ANY DOUBT ABOUT A JOB OFFER OR ANY OTHER COMMUNICATION PURPORTING TO COME FROM MARAVAI LIFESCIENCES, PLEASE REACH OUT TO US DIRECTLY AT TAOPS@MARAVAI.COM. IF YOU BELIEVE YOU HAVE BEEN A VICTIM OF FRAUD, YOU CAN REPORT THIS ACTIVITY AT: WWW.IC3.GOV OR WWW.STOPFRAUD.GOV.",
    "job_skill_set": [
      "Lead generation",
      "CRM software",
      "Analytical thinking",
      "Communication",
      "Teamwork",
      "Problem solving",
      "Results-driven",
      "Multi-tasking",
      "Salesforce",
      "Quoting process",
      "Technical support",
      "Public speaking",
      "Life sciences knowledge",
      "Time management",
      "Flexibility"
    ],
    "short_keywords": [
      "analytical",
      "communication",
      "crm",
      "flexibility",
      "generation",
      "knowledge",
      "lead",
      "life",
      "management",
      "multitasking",
      "problem",
      "process",
      "public",
      "quoting",
      "resultsdriven",
      "sales",
      "salesforce",
      "sciences",
      "software",
      "solving",
      "speaking",
      "specialist",
      "support",
      "teamwork",
      "technical",
      "thinking",
      "time"
    ]
  },
  {
    "job_id": "3900982741",
    "job_title": "Event Sales Specialist",
    "category": "SALES",
    "job_description": "COMPANY DESCRIPTION\n KESTONE IS A 27-YEAR-OLD B2B MARKETING AGENCY THAT SPECIALIZES IN CREATING INTEGRATED MARKETING CAMPAIGNS. WE ARE A TEAM OF CREATIVE DESIGNERS, TECHNO-MARKETERS, AND GROWTH HACKERS WHO ARE FOCUSED ON DELIVERING RESULTS THROUGH B2B MARKETING STRATEGIES. OUR GOAL IS TO MAKE A POSITIVE IMPACT ON OUR CLIENTS' BUSINESSES BY LEVERAGING VARIOUS MARKETING TOOLS AND CREATING EXCEPTIONAL EXPERIENCES.\n ROLE DESCRIPTION\n THIS IS A FULL-TIME REMOTE ROLE FOR AN EVENT SALES SPECIALIST. THE EVENT SALES SPECIALIST WILL BE RESPONSIBLE FOR MANAGING CUSTOMER RELATIONSHIPS, PLANNING AND EXECUTING EVENTS, AND COMMUNICATING EFFECTIVELY WITH BOTH INTERNAL AND EXTERNAL STAKEHOLDERS. THE ROLE WILL REQUIRE A PROACTIVE APPROACH TO DRIVING SALES AND MEETING REVENUE GOALS, AS WELL AS PROVIDING EXCEPTIONAL CUSTOMER SERVICE THROUGHOUT THE EVENT PLANNING AND EXECUTION PROCESS.\n QUALIFICATIONS\n CUSTOMER SERVICE AND SALES SKILLSEXPERIENCE IN EVENT MANAGEMENT AND EVENT PLANNINGSTRONG COMMUNICATION SKILLSABILITY TO BUILD AND MAINTAIN CUSTOMER RELATIONSHIPSEXCELLENT ORGANIZATIONAL AND TIME MANAGEMENT SKILLSABILITY TO WORK INDEPENDENTLY AND REMOTELYEXPERIENCE IN THE B2B MARKETING INDUSTRY IS A PLUSBACHELOR'S DEGREE IN MARKETING, BUSINESS ADMINISTRATION, OR RELATED FIELD",
    "job_skill_set": [
      "event management",
      "event planning",
      "customer service",
      "sales",
      "organizational skills",
      "time management",
      "communication",
      "relationship building",
      "proactive approach",
      "independent work",
      "B2B marketing"
    ],
    "short_keywords": [
      "approach",
      "b2b",
      "building",
      "communication",
      "customer",
      "event",
      "independent",
      "management",
      "marketing",
      "organizational",
      "planning",
      "proactive",
      "relationship",
      "sales",
      "service",
      "skills",
      "specialist",
      "time",
      "work"
    ]
  },
  {
    "job_id": "3903839780",
    "job_title": "PT Sales Associate, San Marcos, TX",
    "category": "SALES",
    "job_description": "WHO WE ARE\n\nKONTOOR BRANDS, INC. (KTB) IS THE PARENT COMPANY OF WRANGLER®, LEE® AND ROCK & REPUBLIC®, WITH OWNED MANUFACTURING FACILITIES IN MEXICO AND NICARAGUA. KONTOOR ALSO OWNS AND OPERATES OVER 140 RETAIL STORES ACROSS THE GLOBE. OUR GLOBAL COMPANY EMPLOYS MORE THAN 15,000 PEOPLE IN 65 COUNTRIES, WITH WORLD HEADQUARTERS IN GREENSBORO, NORTH CAROLINA, AND REGIONAL HEADQUARTERS IN GENEVA AND HONG KONG.\n\nJOB POSTING\n\nPART-TIME SALES ASSOCIATE\n\nKEY RESPONSIBILITIES\n\nBRAND EXPERIENCE/CUSTOMER SERVICE:\n\nEMBRACES THE BRANDS BY WEARING THE BRANDS AT WORK AND HAVING A PASSION FOR THE LEE AND WRANGLER PRODUCTS.GREETS EACH CUSTOMER.ACTIVELY ENGAGES CUSTOMERS ON THE SALES FLOOR BY ASKING OPEN-ENDED QUESTIONS.ASSISTS CUSTOMER IN THE FITTING ROOM.SUGGEST THE BEST PRODUCTS FOR THE CUSTOMERS’ NEEDS.\n\nOPERATIONS, LOSS PREVENTION, AND SAFETY\n\nFOLLOWS ALL COMPANY AND STORE POLICIES, PROCESSES, AND PROCEDURES.REACT QUICKLY TO ALL CUSTOMERS AND/OR ASSOCIATE INJURIES AND REPORT THEM IMMEDIATELY TO THE MANAGER ON DUTY.\n\nVISUAL MERCHANDISING\n\nFOLLOWS ALL DIRECTIONS REGARDING VISUAL MERCHANDISING STANDARDS FOR THE STORE.\n\nSTORE CULTURE\n\nRESPECTS THE BACKGROUND, EXPERIENCE, AND UNIQUE DIFFERENCES OF OTHERS, UPHOLDING THE INTEGRITY AND VALUES OF KONTOOR BRANDS.PROMOTES AN ENVIRONMENT THAT ENCOURAGES PARTICIPATION, CREATIVITY, AND LEARNING BY SHARING BEST PRACTICES AND IDEAS.CONTINUOUSLY LOOKS FOR WAYS TO MAKE THE STORE SUSTAINABLE AND RECOGNIZE THE IMPACT THE STORE HAS ON THE ENVIRONMENT.EMBRACE THE CULTURE AND WILLING TO MAKE CHANGES AS DIRECTED BY A MEMBER OF MANAGEMENT.\n\nJOB REQUIREMENTS\n\nMAINTAIN A POSITIVE ATTITUDE AND FOCUS ON CUSTOMER SATISFACTION.PREVIOUS RETAIL OR SERVICE-ORIENTED EXPERIENCE PREFERRED BY NOT REQUIRED.ABILITY TO WORK WITH A TEAM TO EXCEED SALES RESULTS.COMFORTABLE APPROACHING AND INITIATING CONVERSATION WITH CUSTOMERS.ABILITY TO WORK A FLEXIBLE SCHEDULE TO MEET THE NEEDS OF THE BUSINESS; WILL REQUIRE WEEKENDS, EVENINGS, AND HOLIDAYS.\n\nESSENTIAL FUNCTIONS\n\nOPERATE OFFICE EQUIPMENT AND TECHNOLOGY (I.E., CASH REGISTER, COMPUTERS, PHONES, SCANNERS, ETC.).ABILITY TO STAND DURING SCHEDULED SHIFTS FOR UP TO 8 HOURS.WALKING AND MOVING TO ASSIST CUSTOMERS, RETRIEVE MERCHANDISE AND RECOVER THE STORE.LIFTING AND CARRYING, ABILITY TO MANEUVER AND/OR LIFT UP TO 25 LBS. REGULARLY, AND UP TO 50 LBS. OCCASIONALLY.ABILITY TO PUSH/PULL FULL RACKS OF MERCHANDISE FOR RESTOCKING THE STORE.ABILITY TO REACH, STRETCH, BEND, STOOP, AND CROUCH TO RETRIEVE ITEMS FROM SHELVES, RESTOCK, AND MAINTAIN STORE CLEANLINESS.MANUAL LABOR IS REQUIRED OCCASIONALLY TO ASSEMBLE DISPLAYS AND/OR REARRANGE THE STORE LAYOUT.VISION TO ACCURATELY READ LABELS, ASSIST CUSTOMERS, AND TASKS THAT REQUIRE ATTENTION TO DETAIL.ABILITY TO USE FINE MANIPULATION, AND GRASP WITH HANDS TO SORT AND ORGANIZE CLOTHING, EX. PLACE ON HANGERS, FOLDING, ORGANIZE IN COLOR/SIZE ORDER.\n\nPAY AND BENEFITS\n\nCOMPENSATION RANGE: $11.00 (OR MINIMUM WAGE) -$15.00 / HOUR FOR ALL STATES EXCEPT NEW YORK AND COLORADO, THE COMPENSATION IS $15.50/HOUR.401(K) WITH COMPANY MATCHEMPLOYEE ASSISTANCE PROGRAMEMPLOYEE DISCOUNTSFLEXIBLE SCHEDULE\n\nJOB DESCRIPTION: KONTOOR BRANDS IS AN EQUAL OPPORTUNITY EMPLOYER. EOE/AA/M/F/VET/DISABILITY\n\nWHY KONTOOR BRANDS?\n\nAT KONTOOR, WE OFFER A COMPREHENSIVE BENEFIT PACKAGE TO FIT YOUR LIFESTYLE AND OUR BENEFITS ARE CRAFTED WITH THE SAME CARE AS OUR PRODUCTS.\n\nWHEN OUR EMPLOYEES ARE HEALTHY, SECURE AND WELL, THEY BRING THEIR BEST SELVES TO WORK. KONTOOR BRANDS SUPPORTS YOU WITH A COMPETITIVE BENEFITS PROGRAM THAT PROVIDES CHOICE AND FLEXIBILITY TO MEET YOUR AND YOUR FAMILY’S NEEDS – NOW AND IN THE FUTURE. WE OFFER RESOURCES TO SUPPORT YOUR PHYSICAL, EMOTIONAL, SOCIAL AND FINANCIAL WELLBEING, PLUS BENEFITS LIKE DISCOUNTS ON OUR APPAREL. KONTOOR BRANDS ALSO PROVIDES FOUR WEEKS OF PAID PARENTAL LEAVE TO ELIGIBLE EMPLOYEES WHO ARE NEW PARENTS, FLEXIBLE FRIDAYS AND TUITION REIMBURSEMENT.\n\nOUR KONTOOR D&I MISSION\n\nAT KONTOOR, WE BELIEVE THAT D&I IS A KEY ENABLER TO A CULTURE THAT EMPOWERS US TO WORK WITH PASSION AND CONFIDENCE, SHAPING OUR BRAND AND FUTURE.\n\nOUR KONTOOR D&I COMMITMENT\n\nCREATE A GLOBAL WORKFORCE OF HIGH-PERFORMING TEAMS THAT BOTH UNLOCKS OUR INDIVIDUAL UNIQUENESS AND HARNESSES OUR COLLABORATIVE TALENTSENSURE AN EQUITABLE ENVIRONMENT THAT ATTRACTS & PROMOTES DIVERSE WORKFORCEFOSTER INCLUSIVITY, ENSURING EMPLOYEES FEEL THEY CAN BRING THEIR WHOLE SELVES TO WORK",
    "job_skill_set": [
      "customer service",
      "visual merchandising",
      "cash register operation",
      "technology use",
      "teamwork",
      "communication",
      "positive attitude",
      "flexibility",
      "problem solving",
      "creativity",
      "customer engagement",
      "adaptability",
      "office equipment operation",
      "manual labor",
      "lifting and carrying"
    ],
    "short_keywords": [
      "adaptability",
      "and",
      "associate",
      "attitude",
      "carrying",
      "cash",
      "communication",
      "creativity",
      "customer",
      "engagement",
      "equipment",
      "flexibility",
      "labor",
      "lifting",
      "manual",
      "marcos",
      "merchandising",
      "office",
      "operation",
      "positive",
      "problem",
      "pt",
      "register",
      "sales",
      "san",
      "service",
      "solving",
      "teamwork",
      "technology",
      "tx",
      "use",
      "visual"
    ]
  },
  {
    "job_id": "3902813407",
    "job_title": "Insurance Sales Agent",
    "category": "SALES",
    "job_description": "BANKERS LIFE® SEEKS PROFESSIONALS FOR A DYNAMIC HYBRID REMOTE WORK ENVIRONMENT. START YOUR INSURANCE AGENT CAREER AND EARN UP TO $5,000 IN BONUSES AND COMMISSIONS ALONE IN THE FIRST FOUR MONTHS. WE OFFER AWARD-WINNING TRAINING WITH THE OPTION FOR HYBRID WORK SCHEDULE. AS AN ENTRY LEVEL INSURANCE SALES AGENT, YOU WILL: SCHEDULE APPOINTMENTS TO ASSESS CLIENTS' FINANCIAL NEEDSPROVIDE EXPERT LIFE AND HEALTH INSURANCE RECOMMENDATIONSDELIVER EXCELLENT CUSTOMER SERVICE TO CLIENTS COMPENSATION: COMMISSION AND BONUS-BASED POSITIONFIRST-YEAR AGENTS TYPICALLY EARN $41,000 - $62,000 ON AVERAGENEW AGENTS CAN RECEIVE UP TO $12,000 IN PRODUCTION-BASED INCENTIVES IN THE FIRST YEARUP TO $5,000 BONUSES AVAILABLE IN THE FIRST FOUR MONTHSEXPERIENCED AGENTS EARN $100,000+ IN COMMISSIONS AND BONUSES SUPPORT FOR YOUR CAREER: FLEXIBLE WORK ENVIRONMENT AFTER COMPLETING TRAINING (4-12 WEEKS)SET YOUR OWN HOURS AND WORK ONSITE, IN THE FIELD, OR IN A BLENDED CAPACITYTRAINING PROVIDED BY SUCCESSFUL FIELD LEADERSPRE-LICENSING TRAINING PROVIDED FREE OF CHARGE; STATE EXAM FEES ARE THE INDIVIDUAL'S RESPONSIBILITYMANAGEMENT POSITIONS WITH BENEFITS AVAILABLE WITHIN LOCAL BRANCHESOUR ENTRY-LEVEL AGENTS COME FROM DIVERSE BACKGROUNDS AND DO NOT NEED PRIOR SALES EXPERIENCE WHAT WILL SET YOU APART: YOU HAVE A SALES-ORIENTED MINDSET AND WILLINGNESS TO CONNECT WITH CLIENTSYOU ARE PASSIONATE FOR BUILDING SALES RELATIONSHIPSYOU ARE GOAL-ORIENTED WITH A FOCUS ON SALES SUCCESSYOU HAVE EXCELLENT TIME MANAGEMENT AND ORGANIZATIONAL SKILLS  BANKERS LIFE®, A SUBSIDIARY OF CNO FINANCIAL, IS A FORTUNE 500 COMPANY WITH A STRONG COMMITMENT TO DIVERSITY AND INCLUSION. WE VALUE AN INCLUSIVE AND BELONGING ENVIRONMENT WHERE EVERYONE'S DIFFERENT VIEWPOINTS BRING NEW SUCCESSES! PLEASE VISIT OUR CAREER SITE TO LEARN MORE ABOUT OUR MISSION: HTTPS://CAREERSATBANKERSLIFE.COM",
    "job_skill_set": [
      "sales techniques",
      "customer service",
      "time management",
      "organizational skills",
      "communication",
      "goal-oriented",
      "relationship building",
      "adaptability",
      "teamwork",
      "insurance knowledge"
    ],
    "short_keywords": [
      "adaptability",
      "agent",
      "building",
      "communication",
      "customer",
      "goaloriented",
      "insurance",
      "knowledge",
      "management",
      "organizational",
      "relationship",
      "sales",
      "service",
      "skills",
      "teamwork",
      "techniques",
      "time"
    ]
  },
  {
    "job_id": "3903898507",
    "job_title": "Director, Inbound Sales",
    "category": "SALES",
    "job_description": "JOB SUMMARY\n\nTHE SPECTRUM INBOUND SALES DIRECTOR HAS TOTAL RESPONSIBILITY FOR DIRECTING INBOUND SALES CENTERS AS FAR AS PERFORMANCE TO BUDGET, STAFFING TO BUDGET, OBTAINMENT OF QUOTA, AND DEVELOPMENT OF THIS CHANNEL AS DETERMINED BY THE SENIOR LEADERSHIP TEAM. RESPONSIBLE FOR ASSIGNED REVENUE GROWTH TARGETS THROUGH CURRENT AND NEW CUSTOMERS. THIS POSITION IS RESPONSIBLE FOR AND OVERSEES THE SALES REPS, SUPERVISORS, AND MANAGERS.\n\nMAJOR DUTIES AND RESPONSIBILITIES\n\nACTIVELY AND CONSISTENTLY SUPPORT ALL EFFORTS TO SIMPLIFY AND ENHANCE THE CUSTOMER EXPERIENCE\n\nMOTIVATE AND DRIVE PERFORMANCE OF ALL THE CALL CENTER, AS WELL AS MAKE DECISIONS THAT ARE IN CHARTER’S BEST INTERESTS.\n\nDIRECT THE ATTAINMENT OF KEY PERFORMANCE INDICATORS INCLUDING SALES, REVENUE, CLOSE RATE, BUNDLE SELL-IN, PRODUCTIVITY, QUALITY, AND SERVICE LEVELS\n\nDIRECT THE BUDGET PROCESS INCLUDING QUOTA SETTING, ROLL UP OF QUOTAS TO SUPERVISORS AND MANAGERS, MANAGING DEPARTMENTAL EXPENDITURES AND STAYING WITHIN BUDGET GUIDELINES, AND RUNNING A FISCALLY RESPONSIBLE DIVISION.\n\nSPEARHEAD ONGOING DEVELOPMENT WITHIN ALL LEVELS OF THE ORGANIZATION.\n\nDIRECT THE DEVELOPMENT AND IMPLEMENTATION OF MARKET STRATEGIES TO GAIN NEW MARKET SHARE AND BE ABLE TO MAKE DECISIONS ON WHEN AND WHEN NOT TO TEST AND/OR CONTINUE AN INITIATIVE.\n\nENSURE THE INBOUND SALES ORGANIZATION IS IN COMPLIANCE WITH LAWS AND REGULATIONS RELATING TO CALL CENTER OPERATIONS\n\nAS THE BUSINESS GROWS, ASSIST EXECUTIVE LEADERSHIP IN DEVELOPING BUSINESS PLANS THAT INCLUDE CAPACITY PLANNING, TECHNOLOGICAL INFRASTRUCTURE DEVELOPMENT, PROCESS IMPROVEMENT, ETC.\n\nDIRECT AND RECOMMEND NECESSARY CORPORATE INITIATIVES AND/OR CHANGES NEEDED, TO SUPPORT DEPARTMENT GROWTH AND COMPLIANCE.\n\nCREATE A CULTURE TO IMPROVE SALES PERFORMANCE THROUGH BETTER PROCESSES, TECHNOLOGY AND METHODOLOGIES\n\nDEVELOP SOUND AND TIMELY BUSINESS PRACTICES TO DRIVE SHORT AND LONG TERM SALES PERFORMANCE.\n\nINTERFACE WITH OTHER DEPARTMENTS THROUGH WRITTEN AND VERBAL COMMUNICATIONS, SPECIFICALLY, BUT NOT LIMITED TO:\n\nMARKETING- WORK TO COORDINATE MARKETING ACTIVITY THAT WILL DRIVE INCREASED CALLS TO THE CENTERS WITHIN THE DESIRED AUDIENCE AND WITH RELEVANT AND TIMELY MESSAGING.TRAINING – INTERFACE TO IDENTIFY SALES SPECIALISTS AREAS FOR IMPROVEMENT AND COORDINATE ONGOING TRAINING INITIATIVES THAT WILL FOSTER CONTINUOUS IMPROVEMENT AND BE IN-LINE WITH LONG TERM STRATEGIES.BUSINESS ANALYSTS – COORDINATE AND DESIGN THE REPORTING NEEDED TO DIAGNOSE, IDENTIFY TRENDS AND READILY DASHBOARD THE STATUS TO YOUR LEADERSHIP TEAM.FIELD LEADERSHIP – COORDINATE EFFORTS AND PROCESS, TO INSURE CONSISTENCY AND BEST IN CLASS PROCESS ARE BEING LEVERAGED.OPERATIONS – WORK TO ENSURE ALL DEALS ARE MOVING EFFECTIVELY FROM ORDER TO CASH AS EFFICIENTLY AND EFFECTIVELY AS POSSIBLE. WORK TO MAKE CHANGES IN ANY AREA OF OPPORTUNITY IDENTIFIED, TO INSURE A POSITIVE CUSTOMER AND EMPLOYEE EXPERIENCE.COMPENSATION/INCENTIVES TEAMS – INTERFACE WITH FINANCIAL TEAMS TO CREATE COMPENSATION PLANS, INCENTIVES FOR MOTIVATION AND TO MANAGE AND MONITOR ON TARGET EARNINGS EXPECTATIONS.\n\nREQUIRED QUALIFICATIONS\n\nREQUIRED SKILLS/ABILITIES AND KNOWLEDGE\n\nDEMONSTRATED SALES APTITUDE WITH VERIFIABLE TRACK RECORD OF SUCCESS LEADING SALES OPERATIONS IN A CALL CENTER ENVIRONMENTMARKETING BACKGROUND IN A CALL CENTER ENVIRONMENTPROVEN SALES AND SERVICE PERFORMANCE IN FAST-PACED, ENTREPRENEURIAL ENVIRONMENTS, WITH DEMONSTRATED ABILITY TO BUILD TEAMS, ORGANIZATIONAL CAPABILITY, PROCESSES, AND REQUIRED TOOLS AND TECHNOLOGY SOLUTIONSDEEP UNDERSTANDING OF CALL CENTER BEST PRACTICES IN SELLING, SERVICE, AND PROFITABLE OPERATIONDEMONSTRATED WORKING KNOWLEDGE OF FINANCIAL MEASUREMENTS AND ANALYTICAL SKILLS AND ABILITY TO ANALYZE BUSINESS RESULTS AND IMPLEMENT STRATEGIES OR TACTICS REQUIRED TO OPTIMIZE/CORRECT BUSINESS PERFORMANCE.CREATIVE THINKER AND PROBLEM SOLVERDEMONSTRATED POWER POINT AND EXCEL SKILLS\n\nREQUIRED EDUCATION\n\nBACHELOR'S DEGREE IN MARKETING OR RELATED FIELD, OR EQUIVALENT EXPERIENCE\n\nREQUIRED RELATED WORK EXPERIENCE\n\n10+ YEARS: OVERALL BUSINESS EXPERIENCE7-10 YEARS: CALL CENTER LEADERSHIP7-10 YEARS: INBOUND SALES/MARKETING EXPERIENCE IN TELECOMMUNICATIONS7-10 YEARS: MANAGEMENT EXPERIENCE\n\nWORKING CONDITIONS\n\nOFFICE ENVIRONMENT\n\nTRAVEL AS REQUIRED BETWEEN THE EXISTING CENTERS, AS WELL AS VARIOUS CHARTER OFFICES\n\nCIB700 2024-30266 2024\n\nHERE, EMPLOYEES DON’T JUST HAVE JOBS, THEY BUILD CAREERS. THAT’S WHY WE BELIEVE IN OFFERING A COMPREHENSIVE PAY AND BENEFITS PACKAGE THAT REWARDS EMPLOYEES FOR THEIR CONTRIBUTIONS TO OUR SUCCESS, SUPPORTS ALL ASPECTS OF THEIR WELL-BEING, AND DELIVERS REAL VALUE AT EVERY STAGE OF LIFE.\n\nA QUALIFIED APPLICANT’S CRIMINAL HISTORY, IF ANY, WILL BE CONSIDERED IN A MANNER CONSISTENT WITH APPLICABLE LAWS, INCLUDING LOCAL ORDINANCES.\n\nGET TO KNOW US CHARTER COMMUNICATIONS IS KNOWN IN THE UNITED STATES BY OUR SPECTRUM BRANDS, INCLUDING: SPECTRUM INTERNET®, TV, MOBILE AND VOICE, SPECTRUM NETWORKS, SPECTRUM ENTERPRISE AND SPECTRUM REACH. WHEN YOU JOIN US, YOU’RE JOINING A STRONG COMMUNITY OF MORE THAN 100,000 INDIVIDUALS WORKING TOGETHER TO SERVE MORE THAN 32 MILLION CUSTOMERS IN 41 STATES AND KEEP THEM CONNECTED TO WHAT MATTERS MOST. WATCH THIS VIDEO TO LEARN MORE.\n\nWHO YOU ARE MATTERS HERE WE’RE COMMITTED TO GROWING A WORKFORCE THAT REFLECTS OUR COMMUNITIES, AND PROVIDING EQUAL OPPORTUNITIES FOR EMPLOYMENT AND ADVANCEMENT. EOE, INCLUDING DISABILITY/VETS. LEARN ABOUT OUR INCLUSIVE CULTURE.\n\n",
    "job_skill_set": [
      "sales operations",
      "call center management",
      "performance metrics",
      "process improvement",
      "team building",
      "marketing",
      "PowerPoint",
      "Excel",
      "leadership",
      "communication",
      "problem solving",
      "motivation",
      "creativity",
      "customer experience enhancement",
      "collaboration",
      "strategic thinking",
      "adaptability",
      "decision making",
      "budget management",
      "market strategy development",
      "financial analysis",
      "data analysis"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "budget",
      "building",
      "call",
      "center",
      "collaboration",
      "communication",
      "creativity",
      "customer",
      "data",
      "decision",
      "development",
      "director",
      "enhancement",
      "excel",
      "experience",
      "financial",
      "improvement",
      "inbound",
      "leadership",
      "making",
      "management",
      "market",
      "marketing",
      "metrics",
      "motivation",
      "operations",
      "performance",
      "powerpoint",
      "problem",
      "process",
      "sales",
      "solving",
      "strategic",
      "strategy",
      "team",
      "thinking"
    ]
  },
  {
    "job_id": "3902939942",
    "job_title": "Salesforce Marketing Cloud Administrator",
    "category": "SALES",
    "job_description": "MIOVISION IS A GLOBAL INDUSTRY LEADING COMPANY PROVIDING AGENCIES AND ORGANIZATIONS MODERN TOOLS TO IMPROVE TODAY’S TRAFFIC PROBLEMS. WE OFFER SOLUTIONS THAT COLLECT MULTIMODAL TRAFFIC DATA AND UNCOVER ACTIONABLE INSIGHTS, HELPING ORGANIZATIONS GET MORE OUT OF THEIR ROAD NETWORK. THE RESULT: STREETS CAPABLE OF MOVING MORE PEOPLE – SAFELY AND EFFICIENTLY – WHETHER THEY ARE IN A CAR, ON A BUS, ON A BIKE OR E-SCOOTER, OR WALKING. SINCE 2005, OUR SYSTEMS HAVE COUNTED OR ASSISTED MORE THAN THIRTY BILLION VEHICLES AROUND THE WORLD. WITH GLOBAL HEADQUARTERS IN KITCHENER, CANADA, AS WELL AS OPERATIONS IN GERMANY, SERBIA AND THE UNITED STATES. FOR MORE INFORMATION, VISIT MIOVISION.COM.\nPOSITION SUMMARY \nAS A MARKETING CLOUD ADMINISTRATOR, YOU WILL CONTRIBUTE TO THE ONGOING DEVELOPMENT OF OUR SALESFORCE INFRASTRUCTURE. THE SUCCESSFUL CANDIDATE WILL HAVE A PROVEN RECORD OF OPTIMIZING MARKETING CLOUD FUNCTIONALITY. YOU WILL BE RESPONSIBLE FOR DAY-TO-DAY SUPPORT, MAINTENANCE AND IMPROVEMENT OF THE PLATFORM WHICH IS USED TO SEND ALL COMMUNICATION TO COMPANY CONTACTS; INCLUDING MARKETING, SALES, AND FINANCE RELATED COMMUNICATION. YOU WILL WORK CLOSELY WITH THE MARKETING TEAM, INTERNAL BUSINESS ANALYSTS, AND TECHNICAL ARCHITECTS TO IDENTIFY, DEVELOP, AND DEPLOY NEW AND IMPROVED PROCESSES AND CAPABILITIES.\nKEY ACCOUNTABILITIES SERVE AS THE PRIMARY SALESFORCE MARKETING CLOUD ADMINISTRATOR.MAINTAIN CONTACT DATA BETWEEN MARKETING CLOUD AND SALESFORCE.PREPARE, TEST AND DEPLOY CAMPAIGNS UTILIZING EMAILS, WORKFLOWS, LANDING PAGES, AND FORMS.DESIGN, BUILD AND MAINTAIN CUSTOM APPLICATIONS, CONTENT BLOCKS AND JOURNEY BUILDER ACTIVITIES ON THE MARKETING CLOUD PLATFORM.DESIGN, BUILD AND MAINTAIN CUSTOMIZATIONS FOR INTEGRATING MARKETING CLOUD INTO OTHER BUSINESS APPLICATIONS.COLLABORATE WITH THE MARKETING TEAM ON ACCOUNT-BASED MARKETING STRATEGIES SUPPORTING OUR GTM MOTION.WORK WITH FUNCTIONAL BUSINESS LEADS TO DEFINE SUITABLE PROCESSES TO SUPPORT OPERATIONAL, ADMINISTRATIVE, AND CHANGE MANAGEMENT ACTIVITIES RELATED TO MARKETING CLOUD.ADHERE TO SUBSCRIBER DATA MANAGEMENT, REGIONAL PRIVACY LAWS AND ENABLE EMAIL SENDS WITHIN SUBSCRIBER DATA MANAGEMENT AND REGIONAL PRIVACY LAWS.DESIGN DASHBOARDS AND REPORTS TO ANALYZE EFFECTIVENESS OF CAMPAIGNS.DEVELOP TRAINING AND DOCUMENTATION TO ENABLE AND SUPPORT MARKETING TEAM ACTIVITIES WITHIN MARKETING CLOUD.\nSKILLS/QUALIFICATIONS3+ YEARS OF EXPERIENCE IN SALESFORCE MARKETING CLOUDCURRENT MARKETING CLOUD EMAIL SPECIALIST / MARKETING CLOUD ADMINISTRATOR CERTIFICATION PREFERREDPROFICIENT IN MARKETING CLOUD CONNECTEXPERIENCE WITH MARKETING CLOUD DATA MODELS, INCLUDING CONTACT MODEL, DATA VIEWS AND DATA EXTENSIONSKNOWLEDGE OF SALESFORCE SALES CLOUD DATA MODELS.PROVEN ABILITY TO DESIGN AND IMPLEMENT NEW PROCESSES AND FACILITATE USER ADOPTIONSTRONG UNDERSTANDING OF SALESFORCE MARKETING CLOUD BEST PRACTICES AND FUNCTIONALITYA DOCUMENTED HISTORY OF SUCCESSFULLY DRIVING PROJECTS TO COMPLETIONA DEMONSTRATED ABILITY TO UNDERSTAND AND ARTICULATE COMPLEX REQUIREMENTSPREVIOUS EXPERIENCE WORKING IN A SCRUM OR AGILE ENVIRONMENT PREFERREDEXPERIENCE IN PLANNING, SEGMENTATION, TARGETING, EXECUTION, AND ANALYSIS OF MARKETING CAMPAIGNSEXCELLENT PROJECT MANAGEMENT SKILLSDEMONSTRATED ABILITY TO MEET DEADLINES AND PRIORITIZE SIMULTANEOUS REQUESTSCREATIVE AND ANALYTICAL THINKER WITH STRONG PROBLEM-SOLVING SKILLSMUST DEMONSTRATE EXCEPTIONAL VERBAL AND WRITTEN COMMUNICATION SKILLSMUST DEMONSTRATE AN ABILITY TO COMMUNICATE EFFECTIVELY AT ALL LEVELS OF THE ORGANIZATIONABILITY TO ASSESS THE IMPACT OF NEW REQUIREMENTS ON MARKETING CLOUD AND ALL INTERCONNECTED APPLICATIONS, SYSTEMS AND PROCESSES\nADDITIONAL ASSETSWEB DEVELOPMENT (HTML, CSS, JAVASCRIPT)AMPSCRIPT AND SSJS SCRIPTING LANGUAGESMARKETING CLOUD SOAP AND REST APISADDITIONAL SALESFORCE PLATFORM CERTIFICATIONSEXPERIENCE WITH PROJECT MANAGEMENT TOOLS SUCH AS JIRA AND CONFLUENCEEXPERIENCE WITH BUILDING OR MAINTAINING INTEGRATIONS BETWEEN DIFFERENT BUSINESS SYSTEMS\nPERKS AND BENEFITSCOMPREHENSIVE HEALTH BENEFITS STARTING ON DAY ONERRSP MATCHING PLAN VARIABLE INCENTIVE PLAN MIO-DAYS: WE EXTEND ALL THREE-DAY WEEKENDS TO FOUR-DAYS AND PROVIDE A HOLIDAY SHUTDOWN IN DECEMBER VIRTUAL HEALTHCARE SERVICE PROVIDING EMPLOYEES AND THEIR FAMILIES ACCESS TO HEALTHCARE PROVIDERS 24/7INTERNET SUBSIDY AND A REMOTE WORK ALLOWANCE ENHANCED PATERNITY AND MATERNITY LEAVESUNLIMITED VACATION POLICYWELLNESS OFFERINGS (FITNESS, MINDFULNESS)",
    "job_skill_set": [
      "Project Management",
      "Communication",
      "Problem Solving",
      "Creativity",
      "Collaboration",
      "Deadline Management",
      "Salesforce Marketing Cloud",
      "Marketing Cloud Email Specialist Certification",
      "Marketing Cloud Connect",
      "Data Models",
      "HTML",
      "CSS",
      "JavaScript",
      "AMPScript",
      "SSJS",
      "SOAP APIs",
      "REST APIs",
      "Project Management Tools (JIRA, Confluence)",
      "Integrations",
      "Analytical Thinking",
      "User Adoption Facilitation",
      "Prioritization",
      "Agile Methodology"
    ],
    "short_keywords": [
      "administrator",
      "adoption",
      "agile",
      "ampscript",
      "analytical",
      "apis",
      "certification",
      "cloud",
      "collaboration",
      "communication",
      "confluence",
      "connect",
      "creativity",
      "css",
      "data",
      "deadline",
      "email",
      "facilitation",
      "html",
      "integrations",
      "javascript",
      "jira",
      "management",
      "marketing",
      "methodology",
      "models",
      "prioritization",
      "problem",
      "project",
      "rest",
      "sales",
      "salesforce",
      "soap",
      "solving",
      "specialist",
      "ssjs",
      "thinking",
      "tools",
      "user"
    ]
  },
  {
    "job_id": "3894565349",
    "job_title": "Wireless Sales Pro",
    "category": "SALES",
    "job_description": "GENERAL INFORMATION\n\nCOMPANY: PRE-US\n\nLOCATION: HOUSTON, TEXAS, 77015\n\nREF #: 20301\n\nFUNCTION: BRAND ADVOCACY & SALES\n\nEMPLOYMENT DURATION: PART-TIME\n\nDESCRIPTION AND REQUIREMENTS\n\nPREMIUM RETAIL SERVICES OPERATES WIRELESS LOCATIONS IN MORE THAN 1,200 WIRELESS RETAIL OUTLETS WITH A DEDICATED SALES TEAM OF MORE THAN 3,000 BRAND REPRESENTATIVES.\n\nAS ONE OF PREMIUM’S WIRELESS SALES PROS, YOUR SALES EFFORTS WILL CONNECT SHOPPERS WITH THE WIRELESS PRODUCTS THEY NEED. SALES PROS ARE THE GO-TO WIRELESS EXPERT FOR SHOPPERS, CLOSING SALES THROUGH HUSTLE, CREATIVITY, AND PROBLEM-SOLVING.\n\nWHAT’S IN IT FOR YOU?\n\nCOMPETITIVE BASE PAY WITH UNLIMITED EARNINGS POTENTIAL.FREEDOM TO USE YOUR AUTHENTIC SELLING STYLE.EXCITING OPPORTUNITIES FOR CAREER ADVANCEMENT.A CULTURE OF EXCELLENCE AND A TEAM INVESTED IN COACHING.HEALTH BENEFIT PLANS INCLUDING NO-COPAY TELEMEDICINE, REGARDLESS OF HOURS WORKED.\n\n\nWHAT WILL YOU DO?\n\nMEET OR EXCEED SALES GOALS BY EXECUTING NEW PHONE SALES, UPGRADES, AND ACCESSORY BUNDLING.PROACTIVELY START CONVERSATIONS WITH SHOPPERSEXPLAIN WIRELESS SOLUTIONS TO CUSTOMERS IN SIMPLE, EASY-TO-UNDERSTAND TERMS.RECOMMEND PERSONALIZED SOLUTIONS TO CUSTOMERS.TEACH CUSTOMERS HOW TO ENJOY THEIR NEW PRODUCTS THROUGH SUCCESSFUL SETUP AND ACTIVATION.KEEP WIRELESS DISPLAYS FULLY STOCKED AND FLAWLESS.\n\n\nHOW WILL YOU SUCCEED?\n\nDISPLAYING A HIGH-ENERGY PERSONALITY AND NATURAL ABILITY TO START CONVERSATIONS WITH SHOPPERS.DEMONSTRATING RESILIENCE AND RESOURCEFULNESS IN INTERCEPTING SHOPPERS IN A HIGH-TRAFFIC ENVIRONMENT.STAYING HUNGRY TO EXCEL IN AN UNCAPPED COMMISSION SALES ROLE.LIVING UP TO THE NAME PREMIUM BY PROVIDING FANTASTIC SERVICE AND DISPLAYING INTEGRITY.BEING ABLE TO STAND/MOVE AROUND FOR 8-10 HOURS SHIFTS.MAINTAINING FLEXIBILITY TO WORK DURING PEAK TIMES INCLUDING WEEKENDS, EVENINGS, AND SOME HOLIDAYS.\n\n\nPRIOR SALES EXPERIENCE OR EXISTING KNOWLEDGE OF THE WIRELESS CATEGORY IS NOT MANDATORY, BUT YOU MUST BE DRIVEN TO LEARN. WE’LL TEACH YOU EVERYTHING YOU NEED TO KNOW ABOUT WIRELESS PLANS, SERVICES, DEVICES, AND PROMOTIONS THROUGH ONGOING IN-STORE AND ONLINE TRAINING.\n\nSO, ARE YOU PREMIUM’S NEXT WIRELESS SALES PRO?\n\nSTILL NOT SURE ABOUT APPLYING? VISIT HTTPS://PREMIUMRETAIL.COM/WIRELESS/ FOR MORE INFO ABOUT THE WIRELESS TEAM.\n\nEQUAL OPPORTUNITY EMPLOYER (DISABLED, VETERAN) | UNDER APPLICABLE REQUIREMENTS, SUCH AS THE SAN FRANCISCO FCO AND THE LOS ANGELES FCHIO, WE CONSIDER FOR EMPLOYMENT QUALIFIED APPLICANTS WITH ARREST AND CONVICTION RECORDS OR CRIMINAL HISTORIES | E-VERIFY EMPLOYER\n\nPREMIUM, IN GOOD FAITH, BELIEVES THAT ANY POSTED RANGE OF COMPENSATION IS THE ACCURATE RANGE FOR THIS ROLE AT THE TIME OF THIS POSTING. PREMIUM MAY ULTIMATELY PAY MORE OR LESS THAN THE POSTED RANGE DEPENDING ON CANDIDATE QUALIFICATIONS AND LOCATIONS. THIS RANGE MAY BE MODIFIED IN THE FUTURE.\n\n\nPIPELINEDETAIL: 3490",
    "job_skill_set": [
      "sales",
      "customer service",
      "problem-solving",
      "communication",
      "creativity",
      "resilience",
      "flexibility",
      "teamwork",
      "high-energy personality",
      "wireless product knowledge",
      "product setup and activation",
      "inventory management"
    ],
    "short_keywords": [
      "activation",
      "and",
      "communication",
      "creativity",
      "customer",
      "flexibility",
      "highenergy",
      "inventory",
      "knowledge",
      "management",
      "personality",
      "pro",
      "problemsolving",
      "product",
      "resilience",
      "sales",
      "service",
      "setup",
      "teamwork",
      "wireless"
    ]
  },
  {
    "job_id": "3901957300",
    "job_title": "Area Sales Manager (Chattanooga Market)",
    "category": "SALES",
    "job_description": "***REQUIRED: CANDIDATES FOR THIS ROLE MUST LIVE OR RESIDE WITHIN 30 MINUTES OF THE CHATTANOOGA REGION TO BE CONSIDERED. (CHATTANOOGA, OOTELWAH, CLEVELAND)***\n\nWE DELIVER THE GOODS: \n\nCOMPETITIVE PAY AND BENEFITS, INCLUDING DAY 1 HEALTH & WELLNESS BENEFITS, EMPLOYEE STOCK PURCHASE PLAN, 401K EMPLOYER MATCHING, EDUCATION ASSISTANCE, PAID TIME OFF, AND MUCH MOREGROWTH OPPORTUNITIES PERFORMING ESSENTIAL WORK TO SUPPORT AMERICA’S FOOD DISTRIBUTION SYSTEMSAFE AND INCLUSIVE WORKING ENVIRONMENT, INCLUDING THE CULTURE OF REWARDS, RECOGNITION, AND RESPECT\n\nJOB SUMMARY:\n\nRESPONSIBLE FOR DEVELOPING INDEPENDENT ACCOUNT BUSINESS, EMPHASIZING OVERALL PROFITABILITY THROUGH NEW SALES AND ACCOUNT PENETRATION. PROMOTE AND SELL COMPANY-BRANDED PRODUCTS AND MEET BRAND SALES OBJECTIVES. MAY ALSO SUPPORT CUSTOMER SERVICE ACTIVITIES FOR REGIONAL AND/OR NATIONAL CHAIN CUSTOMERS, THEREBY INCREASING THE COMPANY'S VISIBILITY IN THE MARKETPLACE AND MAXIMIZING MARKET SHARE. FUNCTIONS AS A TEAM MEMBER WITHIN THE DEPARTMENT AND ORGANIZATION, AS REQUIRED, AND PERFORMS ANY DUTY ASSIGNED TO BEST SERVE THE COMPANY.\n\nJOB RESPONSIBILITIES:\n\nGENERATES ADDITIONAL BUSINESS BY ANALYZING SALES TERRITORY AND INDIVIDUAL CUSTOMERS; SAMPLES PRODUCTS WITH EXISTING AND POTENTIAL CUSTOMERS; PLANS GENERAL SALES STRATEGY, INCLUDING TIME AND TERRITORY MANAGEMENT; PLAN SALES APPROACH WITH INDIVIDUAL CUSTOMERS; AND CONDUCTS EFFECTIVE SALES PRESENTATIONS. GROWS SALES AND PROFIT MARGINS CONTINUOUSLY TO MEET ESTABLISHED SALES AND MARGIN GOALS. SETS UP NEW CUSTOMER ACCOUNTS BY DETERMINING PRICING; WORKS WITH THE CREDIT DEPARTMENT FOR INITIAL AUTHORIZATION; AND OTHER CENTER PERSONNEL FOR SCHEDULING ORDER-TAKING, DELIVERIES, ETC. PERFORMS INITIAL FOLLOW-UP WORK WITH CUSTOMERS TO ENSURE DELIVERY AND PRODUCT SATISFACTION. ENSURES CUSTOMER SATISFACTION BY PROVIDING AN EXEMPLARY LEVEL OF SERVICE. WORKS CLOSELY WITH OTHER CENTER PERSONNEL TO COORDINATE EFFORTS TO PREVENT AND RESOLVE CUSTOMER PROBLEMS. MAY BE PERSONALLY RESPONSIBLE FOR MAKING DELIVERIES IN EMERGENCIES. BUILDS ADDITIONAL BUSINESS WITH CURRENT CUSTOMERS THROUGH PRODUCT PENETRATION IN ORDER TO MAXIMIZE THE PROFITABILITY OF INDIVIDUAL ACCOUNTS. MINIMIZES ACCOUNTS RECEIVABLE PROBLEMS BY MONITORING ACCOUNTS FOR COMPLIANCE WITH CREDIT TERMS AND FOLLOWING UP ON ANY ISSUES. MAINTAINS AWARENESS OF PRICING TRENDS WITHIN SALES TERRITORY, PARTICULARLY MARKET-DRIVEN / COMMODITY PRODUCTS, TO ENSURE COMPETITIVE PRICING. PERFORMS OTHER RELATED DUTIES AS ASSIGNED. \n\nQUALIFICATIONSHIGH SCHOOL DIPLOMA/GED OR EQUIVALENT\n\n6-12 MONTHS SALES/MARKETING AND/OR RESTAURANT EXPERIENCE\n\nVALID DRIVERS LICENSE",
    "job_skill_set": [
      "sales",
      "customer service",
      "credit management",
      "communication",
      "teamwork",
      "problem solving",
      "time management",
      "customer satisfaction",
      "adaptability",
      "relationship building",
      "account management",
      "market analysis",
      "pricing strategy",
      "product knowledge",
      "territory management",
      "delivery logistics",
      "sales presentations"
    ],
    "short_keywords": [
      "account",
      "adaptability",
      "analysis",
      "area",
      "building",
      "chattanooga",
      "communication",
      "credit",
      "customer",
      "delivery",
      "knowledge",
      "logistics",
      "management",
      "manager",
      "market",
      "presentations",
      "pricing",
      "problem",
      "product",
      "relationship",
      "sales",
      "satisfaction",
      "service",
      "solving",
      "strategy",
      "teamwork",
      "territory",
      "time"
    ]
  },
  {
    "job_id": "3889443479",
    "job_title": "Sales Agent",
    "category": "SALES",
    "job_description": "WELCOME TO PRONTO INSURANCE, A FLOURISHING GENERAL AGENCY IN SOUTH TEXAS! SINCE 1997, WE'VE BEEN ON AN UNSTOPPABLE JOURNEY OF GROWTH, AND NOW, WITH OVER 200 CAPTIVE LOCATIONS IN TEXAS, CALIFORNIA, AND FLORIDA, OUR EXPANSION KNOWS NO BOUNDS. JOIN OUR TEAM AND BE PART OF THE DRIVING FORCE THAT MAKES PRONTO INSURANCE PRODUCTS A REALITY FOR ALL. TOGETHER, WE'LL REVOLUTIONIZE THE INSURANCE MARKET AND LEAVE AN INDELIBLE MARK ON THE INDUSTRY. DARE TO DREAM BIG AND EMBARK ON AN ADVENTURE FILLED WITH ENDLESS OPPORTUNITIES!\n\nWE BELIEVE THAT EVERY CANDIDATE BRINGS SOMETHING SPECIAL TO THE TABLE, INCLUDING YOU! SO, EVEN IF YOU FEEL THAT YOU’RE CLOSE BUT NOT AN EXACT MATCH, WE ENCOURAGE YOU TO APPLY.\n\nHOW YOU'LL MAKE AN IMPACT\n\nPRIMARILY FOCUSED ON INCREASING SALES FOR AGENCY. RESPONSIBLE FOR SELLING COMPANY PRODUCTS/SERVICES THROUGH RESELLERS/CHANNELS IN ASSIGNED TERRITORY. REPRESENTS THE COMPANY IN ALL ACTIVITIES ASSOCIATED WITH RESELLER/CHANNEL SUPPORT. MAINTAINS HEALTHY RELATIONSHIPS WITH CUSTOMERS AND ENSURE COMPLETE CUSTOMER SATISFACTION. CREATES CAMPAIGNS FOR AGENCY TO DRIVE REVENUE AND COORDINATE CUSTOMER APPRECIATIONS. ENSURES: COLD CALLS ARE BEING DONE ON APPLICATIONS GENERATED FROM EVENTS, ALL RENEWAL QUOTES ARE MADE AND ALL QUOTES ARE FOLLOWED UP, AND THAT GRASSROOTS MARKETING IS DONE ON A DAILY BASIS. MONITORS DAILY MARKETING ACTIVITIES BY ESTABLISHING AND MAINTAINING BUSINESS RELATIONSHIPS. ATTENDS SALES TRAININGS AS NEEDED. RESPONSIBLE FOR DEVELOPING SALES REPORTS AS NEEDED.\n\nABOUT YOU\n\nREQUIRED: HIGH SCHOOL DIPLOMA OR EQUIVALENT; MINIMUM 1 YEAR SALES EXPERIENCE. EMPLOYMENT IS CONTINGENT UPON GETTING THE P&C LICENSE WITHIN A 60-DAY PERIOD. EXCELLENT COMMUNICATION SKILLS BOTH ORAL AND WRITTEN. COMPUTER PROFICIENCY.\n\nPREFERRED: EXCELLENT BILINGUAL COMMUNICATIONS SKILLS IN ENGLISH AND SPANISH.\n\nBEHAVIORS: ACT INDEPENDENTLY WITH MINIMAL DIRECTION. STRONG INTERPERSONAL SKILLS.\n\nCOMPENSATION AND BENEFITS\n\nON TOP OF A COMPETITIVE SALARY, GREAT TEAMS AND EXCITING CAREER OPPORTUNITIES, WE ALSO OFFER A WIDE RANGE OF BENEFITS.\n\nBELOW ARE THE MINIMUM CORE BENEFITS YOU’LL GET, DEPENDING ON YOUR JOB LEVEL THESE BENEFITS MAY IMPROVE:\n\nMEDICAL/DENTAL/VISION PLANS, WHICH START FROM DAY ONE!LIFE AND ACCIDENT INSURANCE401(K) AND ROTH OPTIONSTAX-ADVANTAGED ACCOUNTS (HSA, FSA)EDUCATIONAL EXPENSE REIMBURSEMENTPAID PARENTAL LEAVE\n\nOTHER BENEFITS INCLUDE:\n\nDIGITAL MENTAL HEALTH SERVICES (TALKSPACE)FLEXIBLE WORK HOURS (AVAILABILITY VARIES BY OFFICE AND JOB FUNCTION) TRAINING PROGRAMSGALLAGHER THRIVE PROGRAM – ELEVATING YOUR HEALTH THROUGH CHALLENGES, WORKSHOPS AND DIGITAL FITNESS PROGRAMS FOR YOUR OVERALL WELLBEINGCHARITABLE MATCHING GIFT PROGRAMAND MORE... \n\nWE VALUE INCLUSION AND DIVERSITY\n\nCLICK HERE TO REVIEW OUR U.S. ELIGIBILITY REQUIREMENTS\n\nINCLUSION AND DIVERSITY (I&D) IS A CORE PART OF OUR BUSINESS, AND IT’S EMBEDDED INTO THE FABRIC OF OUR ORGANIZATION. FOR MORE THAN 95 YEARS, GALLAGHER HAS LED WITH A COMMITMENT TO SUSTAINABILITY AND TO SUPPORT THE COMMUNITIES WHERE WE LIVE AND WORK.\n\nGALLAGHER EMBRACES OUR EMPLOYEES’ DIVERSE IDENTITIES, EXPERIENCES AND TALENTS, ALLOWING US TO BETTER SERVE OUR CLIENTS AND COMMUNITIES. WE SEE INCLUSION AS A CONSCIOUS COMMITMENT AND DIVERSITY AS A VITAL STRENGTH. BY EMBRACING DIVERSITY IN ALL ITS FORMS, WE LIVE OUT THE GALLAGHER WAY TO ITS FULLEST.\n\nGALLAGHER BELIEVES THAT ALL PERSONS ARE ENTITLED TO EQUAL EMPLOYMENT OPPORTUNITY AND PROHIBITS ANY FORM OF DISCRIMINATION BY ITS MANAGERS, EMPLOYEES, VENDORS OR CUSTOMERS BASED ON RACE, COLOR, RELIGION, CREED, GENDER (INCLUDING PREGNANCY STATUS), SEXUAL ORIENTATION, GENDER IDENTITY (WHICH INCLUDES TRANSGENDER AND OTHER GENDER NON-CONFORMING INDIVIDUALS), GENDER EXPRESSION, HAIR EXPRESSION, MARITAL STATUS, PARENTAL STATUS, AGE, NATIONAL ORIGIN, ANCESTRY, DISABILITY, MEDICAL CONDITION, GENETIC INFORMATION, VETERAN OR MILITARY STATUS, CITIZENSHIP STATUS, OR ANY OTHER CHARACTERISTIC PROTECTED (HEREIN REFERRED TO AS “PROTECTED CHARACTERISTICS”) BY APPLICABLE FEDERAL, STATE, OR LOCAL LAWS.\n\nEQUAL EMPLOYMENT OPPORTUNITY WILL BE EXTENDED IN ALL ASPECTS OF THE EMPLOYER-EMPLOYEE RELATIONSHIP, INCLUDING, BUT NOT LIMITED TO, RECRUITMENT, HIRING, TRAINING, PROMOTION, TRANSFER, DEMOTION, COMPENSATION, BENEFITS, LAYOFF, AND TERMINATION. IN ADDITION, GALLAGHER WILL MAKE REASONABLE ACCOMMODATIONS TO KNOWN PHYSICAL OR MENTAL LIMITATIONS OF AN OTHERWISE QUALIFIED PERSON WITH A DISABILITY, UNLESS THE ACCOMMODATION WOULD IMPOSE AN UNDUE HARDSHIP ON THE OPERATION OF OUR BUSINESS.",
    "job_skill_set": [
      "sales",
      "customer relationship management",
      "computer proficiency",
      "bilingual communication",
      "sales reporting",
      "communication",
      "interpersonal skills",
      "independence",
      "teamwork",
      "problem solving",
      "cold calling",
      "marketing",
      "P&C license"
    ],
    "short_keywords": [
      "agent",
      "bilingual",
      "calling",
      "cold",
      "communication",
      "computer",
      "customer",
      "independence",
      "interpersonal",
      "license",
      "management",
      "marketing",
      "pc",
      "problem",
      "proficiency",
      "relationship",
      "reporting",
      "sales",
      "skills",
      "solving",
      "teamwork"
    ]
  },
  {
    "job_id": "3894550374",
    "job_title": "Inside Sales Rep II- REMOTE",
    "category": "SALES",
    "job_description": "JOIN A TEAM RECOGNIZED FOR LEADERSHIP, INNOVATION AND DIVERSITY\n\nRESPONSIBLE FOR DRIVING SALES FOR SPECIFIC CUSTOMER ACCOUNTS OR REGION. YOU WILL ACHIEVE INCREASED SALES TARGETS FROM EXISTING ACCOUNTS/CUSTOMERS ALIGNED WITH BUSINESS INITIATIVES. YOU WILL INCREASE SALES BY RECOMMENDING NEW PRODUCT OFFERINGS TO EXISTING CUSTOMERS. YOU WILL BE RESPONSIBLE FOR INCREASING THE CUSTOMER BASE AND INFLUENCE CROSS-FUNCTIONAL TEAMS TO ELIMINATE BARRIERS TO SALES SUCCESS. YOU WILL DRIVE NEW CUSTOMER LEADS TO OUTSIDE SALES. YOU WILL LIAISE WITH MULTIPLE FACTIONS TO HELP PREVENT AND RESOLVE CUSTOMER PROBLEMS. YOU WILL ANALYZE SALES STATISTICS AND BUSINESS NEEDS TO PROVIDE RECOMMENDATIONS TO CUSTOMERS AND STAKEHOLDERS.\n\nKEY RESPONSIBILITIES\n\nIDENTIFY OPPORTUNITIESPLAN ACCOUNTSNEGOTIATE AND CLOSEADMINISTRATE SALES CYCLEDELIVER VALUE PROPOSITION TO CUSTOMERSMANAGE SALES CYCLE MOMENTUMDELIVER COMMUNICATIONS TO CUSTOMERS\n\nWE VALUE\n\nADVANCED DEGREEKNOWLEDGE OF KEY SALES CONCEPTS, PRACTICES, AND PROCEDURESEXCELLENT COMMUNICATION SKILLSDEMONSTRATED ABILITY TO INFLUENCE AT VARYING LEVELS ACROSS THE ORGANIZATIONDEMONSTRATED ABILITY TO OPERATE INDEPENDENTLYABILITY TO USE EXPERIENCE TO APPROPRIATELY APPLY THE ESTABLISHED STANDARDSDEMONSTRATED ABILITY TO ATTAIN SALES QUOTAS/TARGETSPRIOR INDUSTRY EXPERIENCE\n\nADDITIONAL INFORMATION\n\nJOB ID: HRD228422CATEGORY: SALESLOCATION: 50 E ALGONQUIN RD,DES PLAINES,ILLINOIS,60017-5016,UNITED STATESNONEXEMPT\n\nGLOBAL (ALL)\n\nHONEYWELL IS AN EQUAL OPPORTUNITY EMPLOYER. QUALIFIED APPLICANTS WILL BE CONSIDERED WITHOUT REGARD TO AGE, RACE, CREED, COLOR, NATIONAL ORIGIN, ANCESTRY, MARITAL STATUS, AFFECTIONAL OR SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, DISABILITY, NATIONALITY, SEX, RELIGION, OR VETERAN STATUS.",
    "job_skill_set": [
      "sales",
      "negotiation",
      "customer relationship management",
      "sales analysis",
      "product knowledge",
      "account management",
      "industry experience",
      "communication",
      "influence",
      "independence",
      "problem solving",
      "team collaboration",
      "strategic thinking",
      "customer service orientation",
      "sales quotas attainment"
    ],
    "short_keywords": [
      "account",
      "analysis",
      "attainment",
      "collaboration",
      "communication",
      "customer",
      "experience",
      "ii",
      "independence",
      "industry",
      "influence",
      "inside",
      "knowledge",
      "management",
      "negotiation",
      "orientation",
      "problem",
      "product",
      "quotas",
      "relationship",
      "remote",
      "rep",
      "sales",
      "service",
      "solving",
      "strategic",
      "team",
      "thinking"
    ]
  },
  {
    "job_id": "3885867410",
    "job_title": "Sales Executive",
    "category": "SALES",
    "job_description": "INDUSTRY | SERVICES - BUSINESS SERVICESLOCATION | NYACK, NYSALARY | $75,000FIRST YEAR POTENTIAL | $125,000BENEFITS | HEALTH, 401KREFERENCE | 007940\nJOB SUMMARYONE OF THE LARGEST COMMERCIAL REAL ESTATE FIRMS IS LOOKING FOR A SALES EXECUTIVE FOR THEIR NY OFFICE. THIS POSITION WILL REQUIRE OVER 50% OVERNIGHT TRAVEL AND COMMUTABLE TO THEIR OFFICE TWICE A WEEK. QUALIFIED CANDIDATES WILL HAVE 3+ YEARS OF OUTSIDE HUNTING BUSINESS TO BUSINESS SALES IN SOFTWARE, HEALTHCARE, OR FINANCIAL INDUSTRIES. OFFERING A BASE SALARY WITH COMMISSION FOR A TOTAL PACKAGE OF $125K / YEAR IN YEAR ONE PLUS BENEFITS. IF YOU HAVE AN INTEREST IN COMMERCIAL REAL-ESTATE DON’T MISS THE BOAT APPLY TODAY! APPLY TODAY! EMAIL YOUR RESUME TO INFO@PORTERGROUP.COM",
    "job_skill_set": [
      "communication",
      "time management",
      "relationship building",
      "self-motivation",
      "adaptability",
      "business to business sales",
      "software sales",
      "healthcare sales",
      "financial sales",
      "overnight travel",
      "real estate knowledge",
      "negotiation"
    ],
    "short_keywords": [
      "adaptability",
      "building",
      "business",
      "communication",
      "estate",
      "executive",
      "financial",
      "healthcare",
      "knowledge",
      "management",
      "negotiation",
      "overnight",
      "real",
      "relationship",
      "sales",
      "selfmotivation",
      "software",
      "time",
      "to",
      "travel"
    ]
  },
  {
    "job_id": "3904428807",
    "job_title": "Sales Administrator",
    "category": "SALES",
    "job_description": "JOIN AN EXPANDING TEAM THAT IS LOOKING FOR A SALES ADMINISTRATOR TO SUPPORT IN THE DEVELOPMENT OF OUR EVER-GROWING BUSINESS! THE SUCCESSFUL CANDIDATE WILL BE AN EXTREMELY HIGH ENERGY, WELL-ORGANIZED TEAM PLAYER, WITH THE ABILITY TO JUGGLE MULTIPLE PROJECTS, WORKING CROSS-FUNCTIONALLY TO ENSURE QUALITY WORK IS BEING EXECUTED.\n\nWHAT YOU WILL DO\n\nMANAGE AND TRACK DEPARTMENT REQUESTS VIA SALESFORCE AND ESCALATE TO STAKEHOLDERS AS NEEDED. SUPPORT THE DEPARTMENT IN VENDOR RELATIONSHIP MANAGEMENT INCLUDING FOLLOW UP ON PROJECTS, INVOICES, AND PARTNERSHIPSMANAGE THE NEW CLIENT ON-BOARDING PROCESS INCLUDING INFORMATION COLLECTIONINTERFACE INTERNALLY AND EXTERNALLY WITH STAKEHOLDERS TO EXECUTE VARIOUS PROJECTS AS NEEDEDEVALUATE WASTE INFORMATION TO MAKE A WASTE DETERMINATION AND SUBMIT WASTE STREAM PROFILES INTO THE SYSTEM FOR APPROVALLEAD THE CUSTOMER RECERTIFICATION PROCESS AND MONITOR ANNIVERSARY DATESSUPPORT CUSTOMER SERVICE TEAM IN GENERAL HAZARDOUS WASTE REQUESTSLEAD SUBCONTRACTOR INVOICE PROCESSING\n\nREQUIREMENTS\n\nBACHELOR'S DEGREE IN APPROPRIATE FIELD OF STUDY OR EQUIVALENT WORK EXPERIENCE PREFERREDEXCELLENT INTERNAL COMMUNICATION SKILLSEXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLSSOLID ADMINISTRATION AND ORGANIZATIONAL SKILLS INCLUDING ATTENTION TO DETAIL AND MULTITASKING SKILLSSTRONG WORKING KNOWLEDGE OF MICROSOFT OFFICE - SPECIFICALLY EXCELA CAN-DO ATTITUDE – READY TO PICK UP ANYTHING THAT COMES THEIR WAY\n\nLEARN MORE ABOUT US AND OUR MISSION!\n\nDANIELS HEALTH & SHARPSMART IS AN EQUAL OPPORTUNITY EMPLOYER. IN ACCORDANCE WITH ANTI-DISCRIMINATION LAW, IT IS THE PURPOSE OF THIS POLICY TO EFFECTUATE THESE PRINCIPLES AND MANDATES. DANIELS HEALTH & SHARPSMART PROHIBIT DISCRIMINATION AND HARASSMENT OF ANY TYPE AND AFFORDS EQUAL EMPLOYMENT OPPORTUNITIES TO EMPLOYEES AND APPLICANTS WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, AGE, NATIONAL ORIGIN, DISABILITY STATUS, PROTECTED VETERAN STATUS, OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW. DANIELS HEALTH & SHARPSMART CONFORMS TO THE SPIRIT AS WELL AS TO THE LETTER OF ALL APPLICABLE LAWS AND REGULATIONS.",
    "job_skill_set": [
      "Microsoft Office",
      "Project management",
      "Communication",
      "Teamwork",
      "Organization",
      "Attention to detail",
      "Multitasking",
      "Can-do attitude",
      "Salesforce",
      "Excel",
      "Vendor relationship management",
      "Waste stream profiles"
    ],
    "short_keywords": [
      "administrator",
      "attention",
      "attitude",
      "cando",
      "communication",
      "detail",
      "excel",
      "management",
      "microsoft",
      "multitasking",
      "office",
      "organization",
      "profiles",
      "project",
      "relationship",
      "sales",
      "salesforce",
      "stream",
      "teamwork",
      "to",
      "vendor",
      "waste"
    ]
  },
  {
    "job_id": "3887494112",
    "job_title": "Sales Representative",
    "category": "SALES",
    "job_description": "COMPANY\n\nUS0027 SYSCO SYRACUSE, LLC\n\nZIP CODE\n\n14043\n\nEMPLOYMENT TYPE\n\nFULL TIME\n\nTRAVEL PERCENTAGE\n\nCOMPENSATION RANGE:\n\n$64,600.00 - $96,900.00\n\nTHE COMPENSATION RANGE PROVIDED IS IN COMPLIANCE WITH STATE SPECIFIC LAWS. FACTORS THAT MAY BE USED TO DETERMINE YOUR ACTUAL RATE OF PAY INCLUDE YOUR SPECIFIC SKILLS, YEARS OF EXPERIENCE AND OTHER FACTORS.\n\nBENEFITS INFORMATION\n\nFOR INFORMATION ON SYSCO’S BENEFITS, PLEASE VISIT HTTPS://SYSCOBENEFITS.COM\n\nARE YOU AN EXPERIENCED SALES PROFESSIONAL, RESTAURANT MANAGER, CULINARY MANAGER OR CHEF LOOKING FOR CAREER DEVELOPMENT OPPORTUNITIES? JOIN SYSCO’S WORLD CLASS SALES TEAM AND EXPLORE ALL THE BENEFITS AND PERKS.\n\nWHY YOU SHOULD JOIN OUR SALES TEAM\n\nCOMPETITIVE BASE SALARY, BONUS, PLUS PROMOTIONAL INCENTIVE OPPORTUNITIESCAR ALLOWANCE (MILEAGE REIMBURSEMENT FOR CANDIDATES IN CA) AND CELL PHONE PROVIDEDCAREER PATHING OPPORTUNITIES FOR BOTH ENTRY LEVEL, AND EXPERIENCED INDIVIDUALSOPPORTUNITY TO BE PART OF A PURPOSE DRIVEN ORGANIZATION THAT SUPPORTS COMMUNITIES AND ASSOCIATESSPECIALIZED SALES TRAININGINDIVIDUAL AS WELL AS TEAM-BASED SELLINGOPPORTUNITY TO LEARN DIFFERENT ETHNIC SEGMENTSMONTHLY AND ANNUAL SALES REWARDS AND RECOGNITIONROBUST BENEFITS PACKAGE INCLUDING AN EMPLOYEE STOCK PURCHASE PLAN, & 401(K) WITH AUTOMATIC MATCHING\n\nJOB SUMMARY\n\nTHIS IS AN OUTSIDE SALES POSITION RESPONSIBLE FOR PROMOTING THE COMPANY'S PRODUCTS AND SERVICES AND FOR BUILDING RELATIONSHIPS WITH NEW AND EXISTING ACCOUNTS. THE MAIN FOCUS IS TO HELP SYSCO CUSTOMERS SUCCEED WHILE ACHIEVING SALES AND PROFIT GOALS ESTABLISHED BY THE COMPANY. THIS POSITION MAY REQUIRE WORKING SOME NON-TRADITIONAL HOURS (EVENING, WEEKENDS, AND HOLIDAYS) TO SUCCESSFULLY MEET CUSTOMERS' NEEDS.\n\nRESPONSIBILITIES\n\nDEVELOP NEW BUSINESS, PENETRATE EXISTING ACCOUNTS, AND MINIMIZE LOST BUSINESS TO ACHIEVE PROFITABLE SALES GROWTH AND SPECIAL OBJECTIVES WITHIN ASSIGNED TERRITORY.SEEK AND QUALIFY PROSPECTS FOLLOWING COMPANY ACCOUNT STRATIFICATION GOALS.RESEARCH CUSTOMER BUSINESS NEEDS AND DEVELOPS A MIX OF PRODUCTS AND SERVICE TO MEET NEEDS.EVALUATE MARKET TRENDS AND RECOMMEND PRODUCTS TO CUSTOMERS, BASED ON BUSINESS NEEDS AND GOALS.BE INFORMED OF MARKET CONDITIONS, PRODUCT INNOVATIONS, AND COMPETITORS' PRODUCTS, PRICES, AND SALES; SHARE INFORMATION WITH CUSTOMERS AS PART OF VALUE-ADDED SERVICES PROVIDED.ANSWER CUSTOMERS' QUESTIONS ABOUT PRODUCTS, PRICES, AVAILABILITY, AND PRODUCT USE.PROVIDE PRODUCT INFORMATION AND PRACTICAL TRAINING TO CUSTOMER PERSONNEL.DRIVE PERSONAL VEHICLE TO CUSTOMER ACCOUNTS, CONVENTIONS, COMPANY MEETINGS, ETC.COMMUNICATE AND COLLECT ACCOUNTS RECEIVABLE AS NECESSARY, WORKING WITH THE CREDIT DEPARTMENT AND CLIENT; COLLECT ALL BALANCES DUE BASED ON APPROVED CREDIT TERMS.MANAGE DELIVERIES TO THE ROUTING SCHEDULE PUBLISHED BY THE TRANSPORTATION DEPARTMENT; TROUBLESHOOT ANY PROBLEMS THAT OCCUR DURING THE ORDER PROCESS (FOR EXAMPLE, OUT OF STOCK ITEMS, SPECIAL ORDER ITEMS, LOW INVENTORY, ETC.).PARTICIPATE IN COMPANY FUNCTIONS, PROMOTIONS, CUSTOMER VISITS, AND CUSTOMER EVENTS.ATTEND AND PARTICIPATE IN GENERAL SALES AND DISTRICT MEETINGS.ENGAGE IN ONGOING TRAINING SESSIONS.ASSIST WITH THE TRAINING OF NEW EMPLOYEES AS REQUESTED.REVIEW AND ANALYZE DAILY AND WEEKLY REPORTS SUCH AS SPECIAL-ORDER REQUESTS, CUSTOMER BID FILES, AND SALES/GROSS PROFIT MARGIN DATA.PERFORM ADMINISTRATIVE DUTIES, SUCH AS PREPARING SALES BUDGETS AND REPORTS, MAINTAINING SALES RECORDS, PROCESSING CREDITS, AND PICK-UP REQUESTS, PREPARING SALES QUOTES AND MENU SUGGESTIONS, AND FILING REPORTS.OTHER DUTIES MAY BE ASSIGNED.\n\nQUALIFICATIONS\n\nREQUIRED EDUCATION/EXPERIENCE\n\nBACHELOR'S DEGREE IN BUSINESS, SALES, MARKETING, HOSPITALITY, CULINARY ARTS OR RELATED DISCIPLINE OR HSD/GED AND 3 YEARS RESTAURANT MANAGEMENT, B2B OR OUTSIDE SALES EXPERIENCE, OR EQUIVALENT RELATABLE EXPERIENCE.\n\nPREFERRED QUALIFICATIONS\n\nBI-LINGUALRESTAURANT MANAGEMENT, FOODSERVICE OUTSIDE SALES, CHEF EXPERIENCE PREFERRED\n\nCERTIFICATES, LICENSES, AND REGISTRATIONS\n\nVALID DRIVER'S LICENSE WITH A \"CLEAN\" DRIVING RECORD (INCLUDING NO MULTIPLE DUIS WITHIN THE LAST 2 YEARS)CURRENT AUTOMOBILE INSURANCE WITH THE FOLLOWING LIMITS OF LIABILITY: BODILY INJURY - $100,000 EACH PERSON AND $300,000 EACH ACCIDENT; PROPERTY DAMAGE - $100,000 IS REQUIRED\n\nREQUIREMENT\n\nSUBMIT TO PRE-EMPLOYMENT TESTING (DRUG SCREEN, BACKGROUND CHECK).MUST SIGN SYSCO PROTECTIVE COVENANTS AGREEMENT.RESIDE OR WILLING TO RELOCATE TO THE GEOGRAPHICAL VICINITY OF TERRITORY.\n\nPROFESSIONAL SKILLS\n\nBASIC PC SKILLS AND PROFICIENCY WITH MS OFFICE.ABILITY TO READ, WRITE, SPEAK ENGLISH.\n\nCOMPETENCIES\n\nBUILDING TRUSTBUILDING CUSTOMER LOYALTYFOLLOW-UPSALES ABILITY / PERSUASIVENESSMANAGING WORKADAPTABILITYCOMMUNICATION\n\nOVERVIEW\n\nSYSCO IS THE GLOBAL LEADER IN FOODSERVICE DISTRIBUTION. WITH OVER 71,000 COLLEAGUES AND A FLEET OF OVER 13,000 VEHICLES, SYSCO OPERATES APPROXIMATELY 333 DISTRIBUTION FACILITIES WORLDWIDE AND SERVES MORE THAN 700,000 CUSTOMER LOCATIONS.\n\nWE OFFER OUR COLLEAGUES THE OPPORTUNITY TO GROW PERSONALLY AND PROFESSIONALLY, TO CONTRIBUTE TO THE SUCCESS OF A DYNAMIC ORGANIZATION, AND TO SERVE OTHERS IN A MANNER THAT EXCEEDS THEIR EXPECTATIONS. WE’RE LOOKING FOR TALENTED, HARD-WORKING INDIVIDUALS TO JOIN OUR TEAM. COME GROW WITH US AND LET US SHOW YOU WHY SYSCO IS AT THE HEART OF FOOD AND SERVICE.\n\nAFFIRMATIVE ACTION STATEMENT\n\nAPPLICANTS MUST BE CURRENTLY AUTHORIZED TO WORK IN THE UNITED STATES.\n\nWE ARE PROUD TO BE AN EQUAL OPPORTUNITY AND AFFIRMATIVE ACTION EMPLOYER, AND CONSIDER QUALIFIED APPLICANTS WITHOUT REGARD TO RACE, COLOR, CREED, RELIGION, ANCESTRY, NATIONAL ORIGIN, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, AGE, DISABILITY, VETERAN STATUS OR ANY OTHER PROTECTED FACTOR UNDER FEDERAL, STATE OR LOCAL LAW.\n\nTHIS OPPORTUNITY IS AVAILABLE THROUGH SYSCO CORPORATION, ITS SUBSIDIARIES AND AFFILIATES.",
    "job_skill_set": [
      "Sales",
      "Customer Relationship Management",
      "MS Office",
      "Culinary Knowledge",
      "Communication",
      "Building Trust",
      "Adaptability",
      "Teamwork",
      "Follow-up",
      "Problem Solving",
      "Time Management",
      "Market Research",
      "Product Knowledge",
      "B2B Sales",
      "Driving",
      "Restaurant Management",
      "Persuasiveness"
    ],
    "short_keywords": [
      "adaptability",
      "b2b",
      "building",
      "communication",
      "culinary",
      "customer",
      "driving",
      "followup",
      "knowledge",
      "management",
      "market",
      "ms",
      "office",
      "persuasiveness",
      "problem",
      "product",
      "relationship",
      "representative",
      "research",
      "restaurant",
      "sales",
      "solving",
      "teamwork",
      "time",
      "trust"
    ]
  },
  {
    "job_id": "3904960848",
    "job_title": "Sales Operations Senior Manager, Incentive Compensation Lead",
    "category": "SALES",
    "job_description": "HOW MIGHT YOU DEFY IMAGINATION?\n\nIF YOU FEEL LIKE YOURE PART OF SOMETHING BIGGER, ITS BECAUSE YOU ARE. AT AMGEN, OUR SHARED MISSIONTO SERVE PATIENTSDRIVES ALL THAT WE DO. IT IS KEY TO OUR BECOMING ONE OF THE WORLDS LEADING BIOTECHNOLOGY COMPANIES. WE ARE GLOBAL COLLABORATORS WHO ACHIEVE TOGETHERRESEARCHING, MANUFACTURING, AND DELIVERING EVER-BETTER PRODUCTS THAT REACH OVER 10 MILLION PATIENTS WORLDWIDE. ITS TIME FOR A CAREER YOU CAN BE PROUD OF.\n\nSALES OPERATIONS SENIOR MANAGER, INCENTIVE COMPENSATION LEAD\n\nLIVE\n\nWHAT YOU WILL DO\n\nLETS DO THIS. LETS CHANGE THE WORLD. IN THIS VITAL ROLE THE INCENTIVE COMPENSATION (IC) LEAD WILL BE RESPONSIBLE FOR DESIGNING FAIR AND ACCURATE INCENTIVE PLANS AND GOALS AND IMPLEMENTING THEM IN AN EFFECTIVE MANNER. THIS ROLE WILL ACT AS A STRATEGIC PARTNER WITH THE BUSINESS LEADERSHIP AND PROVIDE STRONG GUIDANCE AND RECOMMENDATIONS BASED ON ANALYTICS TO DESIGN FAIR AND ACCURATE INCENTIVE PLANS THAT ALIGN WITH CORPORATE OBJECTIVES IN A LEGAL AND COMPLIANT MANNER, AND TO MANAGE THE SYSTEMS AND PROCESSES TO ADMINISTER THESE PLANS.\n\nFLEXIBLE COMMUTER ROLE TO THOUSAND OAKS, CA, SAN FRANCISCO, CA, OR CHICAGO, IL AMGEN LOCATIONS. YOU WILL WORK ON-SITE A MINIMUM OF 2 DAYS A WEEK.\n\nWORK WITH IC DIRECTOR, SALES LEADERSHIP AND VENDOR PARTNERS TO DRIVE THE CREATION OF FAIR, ACCURATE AND MOTIVATING INCENTIVE PLANS, GOALS, AWARDS AND CONTESTS ALIGNED WITH CORPORATE OBJECTIVESWORK WITH HR, FINANCE, LEGAL AND COMPLIANCE (AND OTHER FUNCTIONS AS NEEDED) TO CONTINUE TO ENSURE THAT THE IC PLAN AND IC SOP IS IN ACCORDANCE WITH ALL AMGEN POLICIESMANAGE OVERALL IC PLAN ADMINISTRATION AND PAYOUTS IN A TIMELY MANNERMANAGE ROLLOUT OF IC PLANS TO FIELD IN ACCORDANCE WITH IC SOPCONTINUE TO MONITOR THE HEALTH OF THE IC PLAN THROUGH THE PLAN PERIOD THROUGH REGULAR HEALTH CHECK ANALYSESMAKE PRESENTATIONS RELATED TO THE IC PLANS AS NEEDED TO SALES LEADERSHIP AT HQ AS WELL AS DURING FIELD SALES MEETINGS AS NEEDEDRESOLVE FIELD QUERIES RELATED AROUND IC DATA AND PAYOUTS AS NEEDEDDEVELOP TRAINING MATERIALS FOR NEW FIELD PERSONNEL\n\n\nWIN\n\nWHAT WE EXPECT OF YOU\n\nWE ARE ALL DIFFERENT, YET WE ALL USE OUR UNIQUE CONTRIBUTIONS TO SERVE PATIENTS. THE INCENTIVE COMPENSATION PROFESSIONAL WE SEEK IS A COLLABORATOR WITH THESE QUALIFICATIONS.\n\nBASIC QUALIFICATIONS\n\nDOCTORATE DEGREE AND 2 YEARS OF FINANCE, SALES & MARKETING OPERATIONS AND/OR DATA ANALYTICS EXPERIENCE\n\nOR\n\nMASTERS DEGREE AND 4 YEARS OF FINANCE, SALES & MARKETING OPERATIONS AND/OR DATA ANALYTICS EXPERIENCE\n\nOR\n\nBACHELORS DEGREE AND 6 YEARS OF FINANCE, SALES & MARKETING OPERATIONS AND/OR DATA ANALYTICS EXPERIENCE\n\nOR\n\nASSOCIATES DEGREE AND 10 YEARS OF FINANCE, SALES & MARKETING OPERATIONS AND/OR DATA ANALYTICS EXPERIENCE\n\nOR\n\nHIGH SCHOOL DIPLOMA / GED AND 12 YEARS OF FINANCE, SALES & MARKETING OPERATIONS AND/OR DATA ANALYTICS EXPERIENCE\n\nPREFERRED QUALIFICATIONS\n\n3+ YEARS OF EXPERIENCE WITH IC DESIGN AND ADMINISTRATION, DATA MANAGEMENT, BUSINESS ANALYSIS, AND SOLUTION DESIGN/DEVELOPMENT7+ YEARS OF EXPERIENCE SOLVING BUSINESS PROBLEMS AND ANALYZING DATA5+ YEARS OF EXPERIENCE WORKING IN SALES OPERATIONS OR IC/BUSINESS ANALYTICS/INTELLIGENCE WITHIN THE PHARMACEUTICAL OR BIOTECH INDUSTRYDEEP KNOWLEDGE OF PHARMACEUTICAL DATA INCLUDING IMS DDD, XPONENT DATA, AND CHARGE BACK DATASTRONG ANALYTICAL SKILLS AND ATTENTION TO DETAIL WITH THE CAPABILITY TO APPROPRIATELY DEFINE ISSUES, QUESTIONS, AND DATA; TO COMPREHEND QUALITATIVE AND QUANTITATIVE METHODS TO PERFORM ACCURATE ANALYSISPROVEN EXPERIENCE, KNOWLEDGE, AND SKILLS RELATED TO DEFINING AND OPTIMIZING REPORTING AND ANALYTICAL NEEDS, DEPLOYING ACTION PLANS, AND DETERMINING FUTURE CAPABILITIESEXPERIENCE IN BEING COMFORTABLE WITH ENGAGING IN STRATEGIC DISCUSSIONS ABOUT BUSINESS DECISIONS RELATED TO IC WITH LEADERSHIP AND IN MAKING LEADERSHIP PRESENTATIONSEXPERTISE IN MICROSOFT PRODUCTS EXCEL, ACCESS, AND POWERPOINT\n\n\nTHRIVE\n\nWHAT YOU CAN EXPECT OF US\n\nAS WE WORK TO DEVELOP TREATMENTS THAT TAKE CARE OF OTHERS, WE ALSO WORK TO CARE FOR OUR TEAMMATES PROFESSIONAL AND PERSONAL GROWTH AND WELL-BEING.\n\nAMGEN OFFERS A TOTAL REWARDS PLAN COMPRISING HEALTH AND WELFARE PLANS FOR STAFF AND ELIGIBLE DEPENDENTS, FINANCIAL PLANS WITH OPPORTUNITIES TO SAVE TOWARDS RETIREMENT OR OTHER GOALS, WORK/LIFE BALANCE, AND CAREER DEVELOPMENT OPPORTUNITIES INCLUDING\n\nCOMPREHENSIVE EMPLOYEE BENEFITS PACKAGE, INCLUDING A RETIREMENT AND SAVINGS PLAN WITH GENEROUS COMPANY CONTRIBUTIONS, GROUP MEDICAL, DENTAL AND VISION COVERAGE, LIFE AND DISABILITY INSURANCE, AND FLEXIBLE SPENDING ACCOUNTS.A DISCRETIONARY ANNUAL BONUS PROGRAM, OR FOR FIELD SALES REPRESENTATIVES, A SALES-BASED INCENTIVE PLANSTOCK-BASED LONG-TERM INCENTIVESAWARD-WINNING TIME-OFF PLANS AND BI-ANNUAL COMPANY-WIDE SHUTDOWNSFLEXIBLE WORK MODELS, INCLUDING REMOTE WORK ARRANGEMENTS, WHERE POSSIBLE\n\n\nAPPLY NOW\n\nFOR A CAREER THAT DEFIES IMAGINATION\n\nOBJECTS IN YOUR FUTURE ARE CLOSER THAN THEY APPEAR. JOIN US.\n\nCAREERS.AMGEN.COM\n\nAMGEN IS AN EQUAL OPPORTUNITY EMPLOYER AND WILL CONSIDER YOU WITHOUT REGARD TO YOUR RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, NATIONAL ORIGIN, PROTECTED VETERAN STATUS, OR DISABILITY STATUS.\n\nWE WILL ENSURE THAT INDIVIDUALS WITH DISABILITIES ARE PROVIDED REASONABLE ACCOMMODATION TO PARTICIPATE IN THE JOB APPLICATION OR INTERVIEW PROCESS, TO PERFORM ESSENTIAL JOB FUNCTIONS, AND TO RECEIVE OTHER BENEFITS AND PRIVILEGES OF EMPLOYMENT. PLEASE CONTACT US TO REQUEST ACCOMMODATION.",
    "job_skill_set": [
      "data analytics",
      "business analysis",
      "reporting optimization",
      "data management",
      "collaboration",
      "communication",
      "problem solving",
      "attention to detail",
      "strategic thinking",
      "presentation skills",
      "training development",
      "incentive compensation design",
      "financial operations",
      "Microsoft Excel",
      "Microsoft Access",
      "Microsoft PowerPoint",
      "pharmaceutical data analysis"
    ],
    "short_keywords": [
      "access",
      "analysis",
      "analytics",
      "attention",
      "business",
      "collaboration",
      "communication",
      "compensation",
      "data",
      "design",
      "detail",
      "development",
      "excel",
      "financial",
      "incentive",
      "lead",
      "management",
      "manager",
      "microsoft",
      "operations",
      "optimization",
      "pharmaceutical",
      "powerpoint",
      "presentation",
      "problem",
      "reporting",
      "sales",
      "senior",
      "skills",
      "solving",
      "strategic",
      "thinking",
      "to",
      "training"
    ]
  },
  {
    "job_id": "3904721748",
    "job_title": "Sr. Specialist- Sales Enablement, Offers Commercialization",
    "category": "SALES",
    "job_description": "OUR PURPOSE\n\nWE WORK TO CONNECT AND POWER AN INCLUSIVE, DIGITAL ECONOMY THAT BENEFITS EVERYONE, EVERYWHERE BY MAKING TRANSACTIONS SAFE, SIMPLE, SMART AND ACCESSIBLE. USING SECURE DATA AND NETWORKS, PARTNERSHIPS AND PASSION, OUR INNOVATIONS AND SOLUTIONS HELP INDIVIDUALS, FINANCIAL INSTITUTIONS, GOVERNMENTS AND BUSINESSES REALIZE THEIR GREATEST POTENTIAL. OUR DECENCY QUOTIENT, OR DQ, DRIVES OUR CULTURE AND EVERYTHING WE DO INSIDE AND OUTSIDE OF OUR COMPANY. WE CULTIVATE A CULTURE OF INCLUSION FOR ALL EMPLOYEES THAT RESPECTS THEIR INDIVIDUAL STRENGTHS, VIEWS, AND EXPERIENCES. WE BELIEVE THAT OUR DIFFERENCES ENABLE US TO BE A BETTER TEAM – ONE THAT MAKES BETTER DECISIONS, DRIVES INNOVATION AND DELIVERS BETTER BUSINESS RESULTS.\n\nTITLE AND SUMMARY\n\nSR. SPECIALIST- SALES ENABLEMENT, OFFERS COMMERCIALIZATION\n\nMASTERCARD LOYALTY SOLUTIONS IS THE WORLD'S LARGEST LOYALTY COMPANY, A SERVICE DIVISION WITHIN MASTERCARD THAT PROVIDES REWARD PROGRAMS, OFFERS, AND BENEFITS TO BOTH FINANCIAL INSTITUTIONS AND MERCHANTS. WE MANAGE OVER 600 MILLION ACCOUNTS ON OUR LOYALTY SYSTEMS, SERVING OVER 2,000 GLOBAL CLIENTS. WE OFFER AN END-TO-END OUTSOURCED SERVICE AND ARE AT THE FOREFRONT OF NEXT-GENERATION LOYALTY SOLUTIONS, INCLUDING MERCHANT OFFERS, PAY WITH POINTS, PROMOTIONS, AND MORE. OUR GLOBAL TEAM CONSISTS OF 900 LOYALTY SPECIALISTS WORKING ACROSS THE WORLD, LEADING THE INTEGRATION OF LOYALTY WITH PAYMENTS.\n\nMERCHANT OFFERS IS FOCUSED ON DRIVING REVENUE THROUGH OUR PROPRIETARY PLATFORM AND MERCHANT NETWORK. WE ARE ON A TRANSFORMATIONAL JOURNEY, WITH AMBITIOUS GOALS AND IS CURRENTLY SEEKING A MANAGER, OFFERS COMMERCIALIZATION TO JOIN OUR PRODUCT ORGANIZATION AND BE ACCOUNTABLE FOR SALES ENABLEMENT, EXECUTIVE PRESENTATIONS BOTH INTERNALLY AND EXTERNALLY, AND HELP UNLOCK AND OPTIMIZE MERCHANT OFFERS. THIS LEADER WILL FOCUS ON COLLABORATING WITH KEY INTERNAL PARTNERS TO CREATE THE MERCHANT OFFERS VALUE STORY FIT FOR PROSPECTIVE CLIENTS/SEGMENT WHILE SUPPORTING THE VP, OFFERS COMMERCIALIZATION WITH PREPARATION OF INTERNAL AND EXTERNAL MATERIALS. THIS ROLE WILL BE RESPONSIBLE FOR MANAGING ALL MATERIALS TO ARM OUR BUSINESS DEVELOPMENT PARTNERS WITH SUCCESS INCLUDING DEMOS/WIREFRAMES, VALUE STORY, ACCESS TO CASE STUDIES, ETC. THE IDEAL CANDIDATE WILL HAVE A PROVEN TRACK RECORD COLLABORATING WITH PARTNERS AND DEVELOPING STRONG STRATEGY AND CONTENT MATERIALS FOR VARIOUS AUDIENCES.\n\nROLE\n\n WORKS ALONGSIDE VP, OFFERS COMMERCIALIZATION TO CREATE STRATEGIC PRESENTATIONS AND MATERIALS FOR SENIOR EXECUTIVES AND EXTERNAL FACING AUDIENCES FOCUSED ON VALUE STORY, MARKET OPPORTUNITY, RECOMMENDATIONS, ETC. LEADS ALL SALES ENABLEMENT CONTENT FOR THE OFFERS PROGRAM INCLUDING SALES MATERIAL CREATION, SEGMENT SALES-APPROACH AND MATERIALS, AND DEMOS/WIREFRAMES TO ARM BUSINESS DEVELOPMENT AND ACCOUNT LEADS PARTNERS CLOSELY WITH ANALYTICS TEAM TO DEVELOP CASE STUDIES FOR EXTERNAL FACING MATERIALS LEADS COMPETITIVE LANDSCAPE AND CONSUMER TRENDS/INSIGHTS AND WORKS ALONGSIDE REGIONAL PARTNERS TO ENSURE UP TO DATE COMPETITIVE INTEL FOR ONGOING USE PARTNERS WITH COMMUNICATIONS PARTNERS TO ENSURE SPEAKING NOTES ARE PREPARED AND DRAFTED FOR OFFERS PROGRAM MEDIA / EVENTS RESPONSIBLE FOR PARTNERING WITH MARKETING TO DEVELOP FOUNDATIONAL SALES MATERIALS, THOUGHT LEADERSHIP AND WHITE-PAPERS TO ADVANCE OFFERS PRESENCE EXTERNALLY RESPONSIBLE FOR MANAGING SALES ENABLEMENT REPOSITORY ON INTERNAL CHANNELS WORKS ALONGSIDE OFFERS MARKET ENABLEMENT TEAM TO ENSURE MARKETING OBJECTIVES ARE BEING DELIVERED TO SUPPORT ONGOING SALES WORKS ALONGSIDE OFFERS LEADERSHIP TEAM TO ENSURE COMMUNICATION CALENDARS IS UP TO DATE INCLUDING SPEAKING ENGAGEMENT AND CLIENT MEETINGS WORKS WITH OFFERS LEADERSHIP TEAM TO ENSURE MATERIALS ARE PREPARED AND FIT FOR EXTERNAL AUDIENCE PRIOR TO ALL SPEAKING ENGAGEMENTS, BOTH INTERNAL AND EXTERNAL WORKS ALONGSIDE DIRECTOR, OFFERS CONSUMER EXPERIENCE TO ACCURATE WIREFRAME/DEMOS OF LATEST CONSUMER EXPERIENCE\n\n\nABOUT YOU\n\n EXPERIENCE IN PRODUCT MARKETING OR PRODUCT DEVELOPMENT EXPERIENCE IN PARTNERING WITH COMMUNICATIONS / INVESTORS RELATION / PR EXPERIENCE IN STRATEGY AND CONTENT DEVELOPMENT RELATED TO TECHNOLOGY PRODUCTS STRONG COMPETENCY PREPARING COMPELLING PRESENTATION MATERIALS WITH STRONG ABILITY TO STORY TELL EXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS WITH THE ABILITY TO EFFECTIVELY COMMUNICATE WITH SENIOR-LEVEL EXECUTIVES INTERNALLY AND EXTERNALLY, STRONG PROFICIENCY/ADVANCED SKILLSET WITH MICROSOFT POWERPOINT (REQUIRED) AND WORKING KNOWLEDGE OF FIGMA AND PROTYPE CREATION (PREFERRED) BACKGROUND/EXPERIENCE WORKING IN B2B OR IN THE TECHNOLOGY / PAYMENTS INDUSTRY (PREFERRED) DEMONSTRATED ABILITY TO ACT WITH PERSISTENT AND RELENTLESS SENSE OF URGENCY COMFORTABLE WITH AMBIGUITY AND WORKING INDEPENDENTLY PROVEN ABILITY TO MANAGE MULTIPLE PROJECTS AT A TIME BACHELOR’S DEGREE REQUIRED SOME TRAVEL REQUIRED\n\n\nIN THE US, MASTERCARD IS AN INCLUSIVE EQUAL EMPLOYMENT OPPORTUNITY EMPLOYER THAT CONSIDERS APPLICANTS WITHOUT REGARD TO GENDER, GENDER IDENTITY, SEXUAL ORIENTATION, RACE, ETHNICITY, DISABLED OR VETERAN STATUS, OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW. IF YOU REQUIRE ACCOMMODATIONS OR ASSISTANCE TO COMPLETE THE ONLINE APPLICATION PROCESS, PLEASE CONTACT REASONABLE_ACCOMMODATION@MASTERCARD.COM AND IDENTIFY THE TYPE OF ACCOMMODATION OR ASSISTANCE YOU ARE REQUESTING. DO NOT INCLUDE ANY MEDICAL OR HEALTH INFORMATION IN THIS EMAIL. THE REASONABLE ACCOMMODATIONS TEAM WILL RESPOND TO YOUR EMAIL PROMPTLY.\n\nCORPORATE SECURITY RESPONSIBILITY\n\n ALL ACTIVITIES INVOLVING ACCESS TO MASTERCARD ASSETS, INFORMATION, AND NETWORKS COMES WITH AN INHERENT RISK TO THE ORGANIZATION AND, THEREFORE, IT IS EXPECTED THAT EVERY PERSON WORKING FOR, OR ON BEHALF OF, MASTERCARD IS RESPONSIBLE FOR INFORMATION SECURITY AND MUST:\n\nABIDE BY MASTERCARD’S SECURITY POLICIES AND PRACTICES;ENSURE THE CONFIDENTIALITY AND INTEGRITY OF THE INFORMATION BEING ACCESSED;REPORT ANY SUSPECTED INFORMATION SECURITY VIOLATION OR BREACH, ANDCOMPLETE ALL PERIODIC MANDATORY SECURITY TRAININGS IN ACCORDANCE WITH MASTERCARD’S GUIDELINES.\n\n\nIN LINE WITH MASTERCARD’S TOTAL COMPENSATION PHILOSOPHY AND ASSUMING THAT THE JOB WILL BE PERFORMED IN THE US, THE SUCCESSFUL CANDIDATE WILL BE OFFERED A COMPETITIVE BASE SALARY BASED ON LOCATION, EXPERIENCE AND OTHER QUALIFICATIONS FOR THE ROLE AND MAY BE ELIGIBLE FOR AN ANNUAL BONUS OR COMMISSIONS DEPENDING ON THE ROLE. MASTERCARD BENEFITS FOR FULL TIME (AND CERTAIN PART TIME) EMPLOYEES GENERALLY INCLUDE: INSURANCE (INCLUDING MEDICAL, PRESCRIPTION DRUG, DENTAL, VISION, DISABILITY, LIFE INSURANCE), FLEXIBLE SPENDING ACCOUNT AND HEALTH SAVINGS ACCOUNT, PAID LEAVES (INCLUDING 16 WEEKS NEW PARENT LEAVE, UP TO 20 PAID DAYS BEREAVEMENT LEAVE), 10 ANNUAL PAID SICK DAYS, 10 OR MORE ANNUAL PAID VACATION DAYS BASED ON LEVEL, 5 PERSONAL DAYS, 10 ANNUAL PAID U.S. OBSERVED HOLIDAYS, 401K WITH A BEST-IN-CLASS COMPANY MATCH, DEFERRED COMPENSATION FOR ELIGIBLE ROLES, FITNESS REIMBURSEMENT OR ON-SITE FITNESS FACILITIES, ELIGIBILITY FOR TUITION REIMBURSEMENT, GENDER-INCLUSIVE BENEFITS AND MANY MORE.",
    "job_skill_set": [
      "market analysis",
      "communication",
      "adaptability",
      "product marketing",
      "product development",
      "Microsoft PowerPoint",
      "Figma",
      "prototype creation",
      "sales material creation",
      "case studies development",
      "B2B experience",
      "technology industry knowledge",
      "payments industry knowledge",
      "storytelling",
      "collaboration",
      "project management",
      "urgency",
      "independence"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "b2b",
      "case",
      "collaboration",
      "commercialization",
      "communication",
      "creation",
      "development",
      "enablement",
      "experience",
      "figma",
      "independence",
      "industry",
      "knowledge",
      "management",
      "market",
      "marketing",
      "material",
      "microsoft",
      "offers",
      "payments",
      "powerpoint",
      "product",
      "project",
      "prototype",
      "sales",
      "specialist",
      "sr",
      "storytelling",
      "studies",
      "technology",
      "urgency"
    ]
  },
  {
    "job_id": "3902834363",
    "job_title": "Sales and Operations Management Trainee",
    "category": "SALES",
    "job_description": "POSITION SUMMARY:\n\nTAKE CHARGE. THINK FAST. MOVE FORWARD. AS A SALES AND OPERATIONS MANAGEMENT TRAINEE IN OUR FAST-PACED ENVIRONMENT, YOU WILL USE YOUR HARD-EARNED DEGREE TO RUN A BUSINESS AND QUICKLY SOLVE PROBLEMS FOR OUR CUSTOMERS – WHO WILL DEPEND ON YOU TO ACHIEVE SUCCESS.\n\nPENSKE WILL INTRODUCE YOU TO OUR SALES PROCESSES, LEADING-EDGE TECHNOLOGY AND WINNING COMPANY CULTURE THROUGH ONGOING TRAINING AND MENTORING TO HELP CULTIVATE THE SKILLS AND EXPERTISE YOU NEED TO SUCCEED IN ALL ASPECTS OF OUR BUSINESS: SALES, OPERATIONS, FINANCE, CUSTOMER SERVICE, TECHNOLOGY AND MORE. YOU’LL COLLABORATE WITH A HIGH-ENERGY, DRIVEN TEAM AS YOU BUILD A SOLID FOUNDATION IN SALES AND OPERATIONS. YOU’LL ENJOY FLEXIBLE SCHEDULES, EXCELLENT BENEFITS, ASSOCIATE INCENTIVES AND DISCOUNT PROGRAMS. YOU’LL BE ON THE FAST TRACK TO FURTHERING YOUR MANAGEMENT CAREER, WITH ADVANCEMENT OPPORTUNITIES AT HUNDREDS OF OUR LOCATIONS NATIONWIDE.\n\nWORK LOCATION: 3788 INTERSTATE PARK RD NORTH, RIVIERA BEACH, FL 33404\n\nWORK HOURS: WILLING AND ABLE TO WORK THE SHIFT ASSIGNED INCLUDING ROTATING SATURDAYS TO COMPLETE A 40-HOUR WORKWEEK\n\nA VALID AND ACTIVE FLDL IS REQUIRED\n\nMAJOR RESPONSIBILITIES:\n\n DEVELOP CONSUMER AND COMMERCIAL CUSTOMER SOLUTIONS TO LOCAL AND NATIONAL ACCOUNTS - INCLUDING MANY OF THE FORTUNE 500. MANAGE OUR LARGE INVENTORY OF WORLD CLASS AND NATIONALLY RECOGNIZED VEHICLES, BALANCING FLEET PRODUCTIVITY, PROFITABILITY AND CUSTOMER SATISFACTION IN A FAST-PACED AND DYNAMIC WORKSPACE GENERATE NEW BUSINESS LEADS AS WELL AS FOSTER EXISTING CUSTOMER RELATIONSHIPS ENSURE COMPLETE CUSTOMER SATISFACTION IN A FAST-PACED ENVIRONMENT.\n\nQUALIFICATIONS:\n\n BACHELOR’S DEGREE REQUIRED, PREFERRED CONCENTRATION IN BUSINESS OR MARKETING EFFECTIVE COMMUNICATION SKILLS, BOTH WRITTEN AND VERBAL INTERNSHIP OR RELATED WORK EXPERIENCE IN A CUSTOMER FACING ROLE PREFERRED RESULTS ORIENTED, ATTENTION TO DETAIL AND GOOD TIME MANAGEMENT SKILLS A VALID DRIVER’S LICENSE IS REQUIRED, AS IS THE ABILITY AND WILLINGNESS TO DRIVE OUR PENSKE VEHICLES, INCLUDING A 26’ BOX TRUCK. REGULAR, PREDICTABLE, FULL ATTENDANCE IS AN ESSENTIAL FUNCTION OF THE JOB. WILLINGNESS TO TRAVEL AS NECESSARY WITHIN THE DISTRICT (CUSTOMERS YARDS, CLOSE GEOGRAPHICAL AREA AND TRAINING SITES), WORK THE REQUIRED SCHEDULE, WORK AT THE SPECIFIC LOCATION REQUIRED, COMPLETE PENSKE EMPLOYMENT APPLICATION, SUBMIT TO A BACKGROUND INVESTIGATION (TO INCLUDE PAST EMPLOYMENT, EDUCATION, AND CRIMINAL HISTORY) AND DRUG SCREENING ARE REQUIRED.\n\nTHIS POSITION IS REGULATED BY THE DEPARTMENT OF TRANSPORTATION OR DESIGNATED AS SAFETY SENSITIVE BY THE COMPANY, AND THE ABILITY TO WORK IN A CONSTANT STATE OF ALERTNESS AND IN A SAFE MANNER IS REQUIRED. ASSOCIATES MUST HAVE THE ABILITY TO ACCEPT RESPONSIBILITY FOR THEIR OWN SAFETY, AS WELL AS THE SAFETY OF OTHERS.\n\nPHYSICAL REQUIREMENTS:\n\nTHE PHYSICAL AND MENTAL DEMANDS DESCRIBED HERE ARE REPRESENTATIVE OF THOSE THAT MUST BE MET BY AN ASSOCIATE TO SUCCESSFULLY PERFORM THE ESSENTIAL FUNCTIONS OF THIS JOB. REASONABLE ACCOMMODATIONS MAY BE MADE TO ENABLE INDIVIDUALS WITH DISABILITIES TO PERFORM THE ESSENTIAL FUNCTIONS.THE ASSOCIATE WILL BE REQUIRED TO: READ; COMMUNICATE VERBALLY AND/OR IN WRITTEN FORM; REMEMBER AND ANALYZE CERTAIN INFORMATION; AND REMEMBER AND UNDERSTAND CERTAIN INSTRUCTIONS OR GUIDELINES.WHILE PERFORMING THE DUTIES OF THIS JOB, THE ASSOCIATE MAY BE REQUIRED TO STAND, WALK, AND SIT. THE ASSOCIATE IS FREQUENTLY REQUIRED TO USE HANDS TO TOUCH, HANDLE, AND FEEL, AND TO REACH WITH HANDS AND ARMS. THE ASSOCIATE MUST BE ABLE TO OCCASIONALLY LIFT AND/OR MOVE UP TO 25LBS/12KG.SPECIFIC VISION ABILITIES REQUIRED BY THIS JOB INCLUDE CLOSE VISION, DISTANCE VISION, PERIPHERAL VISION, DEPTH PERCEPTION AND THE ABILITY TO ADJUST FOCUS.\n\nPENSKE IS AN EQUAL OPPORTUNITY EMPLOYER.\n\nJOB CATEGORY: MANAGEMENT TRAINEE\n\nJOB FAMILY: OPERATIONS\n\nADDRESS: 3788 INTERSTATE PARK RD N\n\nPRIMARY LOCATION: US-FL-RIVIERA BEACH\n\nEMPLOYER: PENSKE TRUCK LEASING CO., L.P.\n\nREQ ID: 2405033",
    "job_skill_set": [
      "business management",
      "customer service",
      "sales processes",
      "time management",
      "communication",
      "problem solving",
      "attention to detail",
      "team collaboration",
      "results oriented",
      "adaptability",
      "customer relationship management",
      "inventory management",
      "data analysis",
      "valid driver's license"
    ],
    "short_keywords": [
      "adaptability",
      "analysis",
      "and",
      "attention",
      "business",
      "collaboration",
      "communication",
      "customer",
      "data",
      "detail",
      "drivers",
      "inventory",
      "license",
      "management",
      "operations",
      "oriented",
      "problem",
      "processes",
      "relationship",
      "results",
      "sales",
      "service",
      "solving",
      "team",
      "time",
      "to",
      "trainee",
      "valid"
    ]
  },
  {
    "job_id": "3887875011",
    "job_title": "Full Time Sales Lead - Pandora at Mall of America",
    "category": "SALES",
    "job_description": "AS THE LARGEST JEWELLERY COMPANY IN THE WORLD, WE GIVE A VOICE TO MILLIONS OF PEOPLE’S LOVE EVERY DAY. OUR BEAUTIFUL PRODUCTS EMPOWER PEOPLE ALL AROUND THE WORLD TO EXPRESS THEMSELVES. WE ARE PROUD TO BE PART OF THEIR STORIES AND THE MOST IMPORTANT MOMENTS IN THEIR LIVES.\n\nWHERE ORIGINAL THINKING IS WELCOMED, AND CAN TURN INTO POSITIVE IMPACT IN A HEARTBEAT, WE CAN DREAM BIG, DARE TO ACT, AND DELIVER WITH CARE AND PASSION. AT PANDORA WHERE YOU CAN EACH CRAFT FAR MORE THAN JUST AN INCREDIBLE CAREER.\n\n ABOUT THE TEAM: \n\nTHE SALES LEAD WILL BE THE ULTIMATE PANDORA FAN. AS A SALES LEAD, YOU WILL FULLY IMMERSE YOURSELF IN OUR BRAND, CULTURE, AND PRODUCT, TAKING IMMENSE PRIDE IN DELIVERING EXCEPTIONAL CUSTOMER EXPERIENCES. THIS ROLE WILL PROVIDE SUPPORT TO THE BOTH THE MANAGERS AND SALES ASSOCIATES WHICH IS I NSTRUMENTAL TO THE DELIVERY OF OUR SUCCESS IN-STORE.\n\nPLEASE NOTE, THIS JOB WILL REQUIRE THE COMPLETION OF AN ASSESSMENT THAT WILL BE EMAILED TO YOU UPON SUBMITTAL OF THE APPLICATION. \n\n\n OUR SALES LEADS SHINE BY: \n\n DARE TO EMBRACE THE STORE CULTURE FILLED WITH PASSION FOR OUR BRAND, WHERE TEAM MEMBERS SHINE AS EXTRAORDINARY BRAND AMBASSADORS.  MAINTAIN A HIGH-PERFORMANCE SELLING ENVIRONMENT THAT CREATES MOMENTS AND EXCEEDS SHOPPER EXPECTATIONS, DELIVERING UNFORGETTABLE EXPERIENCES EVERY TIME.  EMBODY OUR BRAND PHILOSOPHY ENSURING THAT EVERY GUEST INTERACTION REFLECTS OUR CORE VALUES AND LEAVES A LASTING IMPRESSION.  EMBRACE THE OPPORTUNITIES AND SOAR BEYOND COMMERCIAL TARGETS AND KPI EXPECTATIONS, SETTING NEW RECORDS AND ACHIEVING REMARKABLE SUCCESS.  CRAFT A LOYAL CUSTOMER BASE THROUGH ENGAGING WITH OUR VALUED CLIENTS, BUILDING GENUINE CONNECTIONS, AND FOSTERING LONG-LASTING RELATIONSHIPS.  DREAM TO COACH AND INSPIRE THE SALES TEAM, FOSTERING A SENSE OF ACCOUNTABILITY FOR BOTH YOURS AND THE OVERALL STORE PERFORMANCE BY PROVIDING REAL-TIME FEEDBACK AND GUIDANCE TO EMPOWER YOUR TEAM IN ACHIEVING THEIR KPI GOALS. \n\n\n CRAFT YOUR CAREER WITH US IF YOU HAVE   : \n\n YOU CAN DEMONSTRATE YOU’RE A RESULTS-ORIENTED SELLER WITH AT LEAST 2 YEARS OF EXPERIENCE IN A HIGH-PERFORMANCE SELLING ENVIRONMENT  YOU HAVE DEVELOPED A SENSE OF CARE IN YOUR COMMUNICATION SKILLS BOTH WRITTEN AND VERBAL. YOU KNOW HOW TO CHARM AND CAPTIVATE AN AUDIENCE WITH THE ABILITY TO CONNECT WITH PEOPLE AT ALL LEVELS OF THE ORGANIZATION.  YOUR BUSINESS ACUMEN IS SHARPER THAN A DIAMOND , COUPLED WITH YOUR ANALYTICAL THINKING THAT CAN SHOW AND DELIVER POSITIVE RESULTS.  YOU'RE A MASTER OF TIME MANAGEMENT, EFFORTLESSLY SETTING AND ADJUSTING PRIORITIES WHILE DELEGATING TASKS LIKE A PRO.  KNOWLEDGE OF MICROSOFT OFFICE 365 SUITE, KWI, POS SYSTEMS, AND EVEN APPLICANT TRACKING SYSTEMS IS WHERE YOU SHINE  YOU ARE AT LEAST 18 YEARS OR OLDER AND CAN PROVIDE PROOF OF IDENTIFY AND ELIGIBILITY TO WORK  DREAM AND EMBRACE THE ADVENTURE! A FLEXIBLE WORK SCHEDULE THAT INCLUDES NIGHTS, WEEKENDS, AND HOLIDAYS IS ALL PART OF THE EXCITEMENT. THIS CAN INCLUDE STANDING FOR EXTENDED PERIODS \n\n\n OUR BENEFITS: \n\n WE DARE! WE OFFER ROBUST COMPENSATION PACKAGE INCLUDING BASE + COMMISSION OR BONUS’S  WE CARE! PANDORA OFFERS EXTENSIVE BENEFITS INCLUDING MEDICAL, DENTAL, VISION, FLEXIBLE SPENDING ACCOUNTS, COMMUTER SPENDING ACCOUNTS, SHORT/LONG TERM DISABILITY, BASIC LIFE AND AD&D, ANNIVERSARY GIFT CARDS, RECOGNITION PROGRAM AND PRODUCT DISCOUNTS!  WE DREAM! PANDORA IS FOSTERING GROWTH AND CRAFTING OPPORTUNITIES TO SUPPORT THE BUSINESS NEEDS WHICH LEARNING AND DEVELOPMENT PROGRAMS, CONTINUOUS FEEDBACK, LINKEDIN LEARNING AND MORE \n\n\n ABOUT PANDORA: \n\nPANDORA DESIGNS, MANUFACTURES, AND MARKETS HAND-FINISHED JEWELLERY MADE FROM HIGH-QUALITY MATERIALS AT AFFORDABLE PRICES. PANDORA JEWELLERY IS SOLD IN MORE THAN 100 COUNTRIES THROUGH 6,800 POINTS OF SALE, INCLUDING MORE THAN 2,700 CONCEPT STORES.\n\nHEADQUARTERED IN COPENHAGEN, DENMARK, PANDORA EMPLOYS 27,000 PEOPLE WORLDWIDE AND CRAFTS ITS JEWELLERY AT TWO LEED CERTIFIED FACILITIES IN THAILAND USING MAINLY RECYCLED SILVER AND GOLD. THE COMPANY PLANS TO BE CARBON NEUTRAL BY 2025 AND HAS JOINED THE SCIENCE BASED TARGETS INITIATIVE TO REDUCE EMISSIONS ACROSS ITS FULL VALUE CHAIN. PANDORA IS LISTED ON THE NASDAQ COPENHAGEN STOCK EXCHANGE AND GENERATED A REVENUE OF DKK 23.4 BILLION IN 2021.\n\nPANDORA’S RECRUITMENT PROCEDURES ARE DESIGNED TO BE TRANSPARENT AND CLEAR FOR ALL CANDIDATES. THIS HELPS US ENSURE THAT APPLICANTS ARE PROVIDED WITH A FAIR AND EQUAL OPPORTUNITY TO DEMONSTRATE THEIR COMPETENCIES AND SKILLS BY REMOVING BLOCKING FACTORS, POSSIBLE BIASES, AND RISKS OF DISCRIMINATION. WE ENCOURAGE EVERYONE APPLYING TO OUR VACANCIES TO REFRAIN FROM ADDING IDENTITY-RELATED ELEMENTS SUCH AS A PHOTO, MARITAL STATUS AND AGE.\n\n ABOUT PANDORA NAM: \n\nTHE PANDORA TEAM IN THE USA CONSISTS OF MORE THAN 115 EMPLOYEES WORKING AT THE HUB OFFICE IN BALTIMORE, MARYLAND, MORE THAN 80 IN OUR LOGISTICS CENTER IN COLUMBIA, MARYLAND, AN ADDITIONAL 100 IN FIELD POSITIONS, AND MORE THAN 3,900 IN OUR OWNED AND OPERATED STORES. WE HAVE ALSO RECENTLY OPENED AN OFFICE IN NEW YORK CITY IN THE HEART OF TIMES SQUARE AND ARE ACTIVELY BUILDING OUT THIS TEAM WITH THE BEST TALENT IN THE MARKET.\n\nTODAY, THE USA IS PANDORA’S SINGLE LARGEST MARKET. THE PANDORA NORTH AMERICAN REGION ENCOMPASSES OVER 1,400 POINTS OF SALE, INCLUDING OVER 420 CONCEPT STORES, WITH MORE THAN 150 BEING OWNED AND OPERATED BY PANDORA.",
    "job_skill_set": [
      "sales experience",
      "customer service",
      "Microsoft Office 365",
      "analytical thinking",
      "time management",
      "communication",
      "teamwork",
      "leadership",
      "relationship building",
      "problem solving",
      "adaptability",
      "passion for brand",
      "results-oriented",
      "POS systems",
      "KWI",
      "applicant tracking systems"
    ],
    "short_keywords": [
      "365",
      "adaptability",
      "america",
      "analytical",
      "applicant",
      "at",
      "brand",
      "building",
      "communication",
      "customer",
      "experience",
      "for",
      "full",
      "kwi",
      "lead",
      "leadership",
      "mall",
      "management",
      "microsoft",
      "of",
      "office",
      "pandora",
      "passion",
      "pos",
      "problem",
      "relationship",
      "resultsoriented",
      "sales",
      "service",
      "solving",
      "systems",
      "teamwork",
      "thinking",
      "time",
      "tracking"
    ]
  },
  {
    "job_id": "3902735430",
    "job_title": "PT Sales Associate",
    "category": "SALES",
    "job_description": "JOB DETAILS\n\nJOB LOCATION\n\nLENOX - ATLANTA, GA\n\nPOSITION TYPE\n\nPART TIME\n\nEDUCATION LEVEL\n\nHIGH SCHOOL\n\nSALARY RANGE\n\n$15.00 - $16.00\n\nTRAVEL PERCENTAGE\n\nNEGLIGIBLE\n\nJOB SHIFT\n\nANY\n\nJOB CATEGORY\n\nSALES\n\nDESCRIPTION\n\nWE LOVE THAT YOU ARE INTERESTED IN LEARNING MORE ABOUT THIS ROLE AND WHAT MAKES LOVESAC UNIQUE!\n\nWHO WE ARE? HERE AT LOVESAC, OUR LOVESAC FAMILY IS COMPRISED OF A DIVERSE TEAM WHO EXEMPLIFY THE FOLLOWING VALUES:\n\n CORE VALUES: TOP AMBITION, WILLING TO SWEEP FLOORS, GRIT  ASPIRATIONAL VALUES: CUSTOMER CENTRICITY, ONLY A PLAYERS, EXECUTIONAL EXCELLENCE, CONSCIOUSNESS  TABLE-STAKES VALUES: POSITIVE, PASSIONATE, COLLABORATIVE, FLEXIBLE, SELF-STARTING, SELF-AWARE, CANDID, EMPATHETIC, INCLUSIVE, INSATIABLE LEARNERS \n\nWE ARE COMMITTED TO WORKING AND SUCCEEDING BY INCORPORATING OUR GUIDING PRINCIPLES INTO EVERY ASPECT OF OUR BUSINESS:\n\nWE CAN ALL WIN TOGETHER\n\nWE DO AS WE SAY\n\nDO LESS AND DO BEST\n\nWE’RE BORROWING THIS EARTH FROM OUR CHILDREN\n\nLOVE MATTERS\n\nWE OFFER OUR PART TIME ASSOCIATES\n\n FLEXIBLE HOURS  PAID TIME OFF & HOLIDAY PAY  SALES INCENTIVE PROGRAMS  401K MATCHING CONTRIBUTION  HEALTH PLAN DISCOUNT  EMPLOYEE ASSISTANCE PROGRAM  FINANCIAL WELLNESS TOOLS  ASSOCIATE DISCOUNTS  PET INSURANCE \n\nASSOCIATES WILL BE ELIGIBLE TO RECEIVE UP TO 26 HOURS OF PAID TIME OFF WITHIN OUR FISCAL CALENDAR YEAR. THEY WILL BE PAID 1 1/2 TIMES THEIR REGULAR RATE FOR ANY HOURS WORKED OVER 40 HOURS IN A WORK WEEK. IN ADDITION, THEY WILL BE ELIGIBLE TO RECEIVE 1 1/2 TIMES THEIR REGULAR RATE FOR ANY HOURS WORKED ON COMPANY RECOGNIZED HOLIDAYS. ELIGIBILITY AND TERMS FOR ALL BENEFITS LISTED ARE AS OUTLINED IN LOVESAC’S POLICY AND PLAN DOCUMENTS.\n\nOUR PURPOSE\n\nAT LOVESAC, WE ARE COMMITTED TO BRINGING TOTAL COMFORT TO MILLIONS OF HOMES. THAT MEANS HAVING FURNITURE THAT CAN EVOLVE ALONG WITH THEM AS LIFE UNFOLDS.\n\nFROM SACTIONALS THE WORLDS MOST ADAPTABLE COUCH, TO SACS THE WORLDS MOST COMFORTABLE SEAT, LOVESAC PRODUCTS PROVIDE PEACE OF MIND WHERE OTHERS CANNOT. OUR PRODUCTS CAN ADAPT TO FIT ALMOST ANY SPACE AND STYLE AND LOOK LIKE NEW FOREVER. THIS ENABLES A NEW WAY OF LIVING, WHERE PEOPLE CAN CONTINUE TO INVEST IN, ADD TO, AND EVOLVE THEIR FURNITURE INSTEAD OF ADDING IT TO THE LANDFILL WHICH IS GOOD FOR FAMILIES AND OUR ENVIRONMENT.\n\nWHAT WE BELIEVE\n\nLOVE. IT IS THE NAME WE LIVE UP TO. WE CHAMPION BUILDING MEANINGFUL RELATIONSHIPS AS WE FOSTER A CULTURE THAT EMBRACES AND CELEBRATES THE EXPERIENCES, BELIEFS, BACKGROUNDS, EXPERTISE, TALENT, AND INDIVIDUALITY OF EVERYONE. WE PURPOSEFULLY AND MEANINGFULLY WEAVE DEI INTO EVERY ASPECT OF OUR BUSINESS. WE SEEK TO PROMOTE LOVE, INCLUSION, AND HAPPINESS IN ALL THAT WE DO. #LOVEMATTERS\n\nTHE ROLE\n\nCURRENTLY, WE ARE SEEKING TO HIRE A SALES ASSOCIATE WHO WILL HAVE A PASSION FOR OUR PRODUCTS AND OUR CUSTOMERS, CREATING A UNIQUE EXPERIENCE FOR THEM. YOU WILL IDENTIFY THE CUSTOMERS NEEDS THROUGH UTILIZATION OF THE LOVESAC PROPRIETARY SELLING PROCESS THROUGH DEMONSTRATING, QUOTING AND CLOSING SALES, PROVIDING A CUSTOMIZED SHOPPING EXPERIENCE.\n\nSUMMARY OF KEY JOB RESPONSIBILITIES\n\n RESPONSIBLE TO MEET OR EXCEED ALL GOALS AND KEY PERFORMANCE INDICATORS (KPIS).  UTILIZE LOVESACS PROPRIETARY SELLING PROCESS, PROVIDING EACH CUSTOMER WITH OUTSTANDING SERVICE BY GREETING AND ACKNOWLEDGING EVERY CUSTOMER, DEMONSTRATING ALL PRODUCTS, MAINTAINING OUTSTANDING STANDARDS, COMPREHENSIVE KNOWLEDGE OF THE ENTIRE PRODUCT LINE AND BY APPLYING COMMON SENSE AND GOOD TASTE AT ALL TIMES.  OFFER ADDITIONAL FINANCING OPTIONS TO THE CUSTOMER INCLUDING BUT NOT LIMITED TO LOVESAC CREDIT CARD AND SECONDARY FINANCING PROGRAMS, ETC.  CONSISTENTLY EDUCATE CLIENTS OF CURRENT PROMOTIONAL OFFERINGS AND PRODUCTS WHILE MAINTAINING KNOWLEDGE OF CURRENT PROMOTIONAL OFFERINGS AND PRODUCTS.  MAINTAIN INVENTORY INTEGRITY AND ACCURACY PROTECTING COMPANY ASSETS AT ALL TIMES.  ASSISTS IN THE EXECUTION OF ANY PROMOTIONAL CAMPAIGNS, INCLUDING PRODUCT PLACEMENT AND MARKETING UPDATES PURSUANT TO COMPANY STANDARDS.  PARTNER WITH STORE MANAGEMENT TO ENSURES THAT ALL CUSTOMER SERVICE ISSUES ARE RESOLVED, AND ENHANCE ALL ASPECTS OF CUSTOMER SERVICE, INCLUDING ORDER MANAGEMENT.  PARTICIPATE IN ENSURING THAT STORE STANDARDS ARE MAINTAINED (I.E., MERCHANDISING, MARKETING, STORE CLEANLINESS, APPROPRIATE FLOOR REPLENISHMENT, BACKROOM ORGANIZATION, SAFETY, ETC.) IN ACCORDANCE WITH COMPANY OPERATING POLICIES AND PROCEDURES.  MAINTAIN INVENTORY INTEGRITY THROUGH ACCURATE PROCESSING OF ALL POS TRANSACTIONS (I.E., SALES, RETURNS AND EXCHANGES) PROVIDING ACCURATE INFORMATION TO CLIENTS.  MAINTAIN A CALM DEMEANOR AND MANAGE ISSUES PROFESSIONALLY AND RESPECTFULLY IN ACCORDANCE WITH OUR COMPANY STANDARDS.  ACT WITH INTEGRITY AND TRUST, MODELING BEHAVIOR THAT RESPECTS OUR EMPLOYEES, PEERS AND CUSTOMERS IN ACCORDANCE WITH THE CORE VALUES OF OUR COMPANY.  PERFORM ANY OTHER DUTIES AS REQUESTED BY MANAGEMENT. \n\nQUALIFICATIONS\n\nREQUIREMENTS & QUALIFICATIONS:\n\n MINIMUM OF 1-2 YEARS OF RELATED SALES EXPERIENCE.  MUST BE RESULTS DRIVEN AND UTILIZE KNOWLEDGE TO MEET OR EXCEED KPIS AND GOALS.  MUST HAVE PROVEN TIME MANAGEMENT SKILLS AND QUICKLY ADAPTS TO A CHANGING BUSINESS ENVIRONMENT.  ABLE TO PRIORITIZE RESPONSIBILITIES WITH THE APPROPRIATE LEVEL OF URGENCY, ABLE TO LISTEN AND CAN USE THIS INFORMATION TO SOLVE PROBLEMS, ANTICIPATE ISSUES AND MAKE CORRECT DECISIONS BASED ON A VARIETY OF SITUATIONS.  MUST TAKE ACCOUNTABILITY AND RESPONSIBILITY FOR YOUR ACTIONS.  MUST HAVE THE ABILITY TO MANAGE MULTIPLE PROJECTS SIMULTANEOUSLY WHILE MEETING DEADLINES CONSISTENTLY.  MUST HAVE SUPERIOR COMMUNICATION SKILLS; VERBAL, WRITTEN AND INTERPERSONAL SKILLS; ABLE TO LISTEN EFFECTIVELY TO SOLVE PROBLEMS, ANTICIPATE ISSUES AND MAKE EFFECTIVE DECISIONS.  DEMONSTRATES STRONG ANALYTICAL, MATHEMATICAL, AND PROBLEM-SOLVING SKILLS.  MAINTAINS THE HIGHEST LEVEL OF CUSTOMER SERVICE, CREATING SOLUTIONS AND EXPERIENCES THAT DRIVE BUSINESS RESULTS AND ENGAGEMENT WITH THE BRAND.  MUST WORK COLLABORATIVELY WITH FELLOW EMPLOYEES, TREATING ALL CLIENTS, BOTH INTERNAL AND EXTERNAL WITH DIGNITY AND RESPECT AT ALL TIMES.  PROFICIENCY REQUIRED IN MICROSOFT OFFICE: WORD, EXCEL & POWERPOINT.  MUST COMPLY WITH THE STANDARDS, POLICIES AND PROCEDURES OUTLINED IN THE LOVESAC EMPLOYEE HANDBOOK.  MUST BE CAPABLE OF USING AND OPERATING ALL EQUIPMENT AS REQUIRED, INCLUDING BUT NOT LIMITED TO: IPAD, LAPTOP, ETC. BE ABLE TO MOVE OBJECTS (INCLUDING MEDIUM TO LARGE FURNITURE ITEMS UP TO 75 POUNDS) FROM A LOWER TO A HIGHER POSITION OR HORIZONTALLY FROM POSITION-TO-POSITION OR BE ABLE TO ASSEMBLE FURNITURE WHILE WORKING ON THE SELLING FLOOR OR IN OUR WAREHOUSE.  MUST BE ABLE TO TRAVEL, AS REQUIRED BY THE COMPANY IN ITS SOLE DISCRETION, FOR OCCASIONAL MEETINGS AND CONFERENCES USING VARIOUS FORMS OF TRANSPORTATION.  CONSISTENT ABILITY TO WORK BOTH OFFSITE AND REPORT INTO DESIGNATED TOUCHPOINT, OR CORPORATE HEADQUARTERS AS REQUIRED AND IN ACCORDANCE WITH LOVESAC POLICIES, CDC AND STATE GUIDELINES.  SUPPORT LOVESAC VENDORS AS NEEDED WITH LOCAL OFFSITE EVENTS. \n\nOUR RETAIL TOUCHPOINTS, INCLUDING OUR WEBSITE, ARE OPEN SEVEN DAYS A WEEK AND REQUIRE MORNING, EVENING, WEEKEND AND HOLIDAY AVAILABILITY.\n\nASSOCIATE PAY WILL VARY BASED ON FACTORS SUCH AS QUALIFICATIONS, EXPERIENCE, SKILL LEVEL AND COMPETENCIES.\n\nLOVESAC IS AN EQUAL OPPORTUNITY EMPLOYER AND CONSIDERS ALL APPLICANTS FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGIOUS CREED, ANCESTRY, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY AND/OR EXPRESSION, PREGNANCY, AGE, NATIONAL ORIGIN, MARITAL STATUS, DISABILITY, MILITARY STATUS, GENETIC INFORMATION OR ANY OTHER CHARACTERISTIC PROTECTED BY APPLICABLE LAW.",
    "job_skill_set": [
      "sales experience",
      "customer service",
      "analytical skills",
      "problem-solving",
      "communication",
      "teamwork",
      "listening",
      "collaboration",
      "Microsoft Office",
      "mathematical skills",
      "inventory management",
      "POS transactions",
      "furniture assembly",
      "time management",
      "adaptability",
      "accountability",
      "flexibility",
      "empathy",
      "self-awareness"
    ],
    "short_keywords": [
      "accountability",
      "adaptability",
      "analytical",
      "assembly",
      "associate",
      "collaboration",
      "communication",
      "customer",
      "empathy",
      "experience",
      "flexibility",
      "furniture",
      "inventory",
      "listening",
      "management",
      "mathematical",
      "microsoft",
      "office",
      "pos",
      "problemsolving",
      "pt",
      "sales",
      "selfawareness",
      "service",
      "skills",
      "teamwork",
      "time",
      "transactions"
    ]
  },
  {
    "job_id": "3905239527",
    "job_title": "Mobile Equine Sales Director",
    "category": "SALES",
    "job_description": "WEBSITE: WWW.GONATURALBEDDING.COM \nJOB DESCRIPTION:WE ARE SEEKING A HIGHLY MOTIVATED AND EXPERIENCED MOBILE EQUINE SALES DIRECTOR TO BECOME AN INTEGRAL PART OF OUR SALES & MARKETING TEAM AND LEAD OUR ON-THE-GROUND SALES EFFORTS ACROSS VARIOUS HORSE SHOW LOCATIONS IN THE UNITED STATES. YOU WILL BE RESPONSIBLE FOR SELLING OUR PRIMARY PRODUCT, A HIGH-END, SUSTAINABLE ANIMAL BEDDING, TO DRIVE COMPANY REVENUE WHILE WORKING CLOSELY WITH OUR LEADERSHIP TEAM AND VP OF SALES & MARKETING. \nEQUESTRIAN EXPERIENCE IS REQUIRED.\nRESPONSIBILITIES INCLUDE:SOURCE, ENGAGE, AND MAINTAIN RELATIONSHIPS WITH KEY CUSTOMERSIDENTIFY CUSTOMER NEEDS AND EXPLAIN PRODUCT SERVICES AND BENEFITS TO CUSTOMERSENTER AND PROCESS CUSTOMER ORDERSINVESTIGATE AND RESOLVE CUSTOMER COMPLAINTSCOORDINATE FREIGHT LOGISTICS WITH OUR SALES & MARKETING TEAM AND OUR FREIGHT PARTNERSMANAGE COLLECTION ON CUSTOMER ACCOUNTS\nJOB REQUIREMENTS:18+ YEARS OLD WITH A VALID DRIVER'S LICENSEPREVIOUS EXPERIENCE IN SALES, CUSTOMER SERVICEEQUESTRIAN EXPERIENCE (SHOW EXPERIENCE PREFERRED BUT NOT REQUIRED)ABILITY TO THRIVE IN A FAST-PACED ENVIRONMENTABILITY TO BUILD RAPPORT WITH CUSTOMERSEXCELLENT WRITTEN AND VERBAL COMMUNICATION SKILLSKNOWLEDGE OF THE EQUINE INDUSTRYBE ABLE TO LIFT 50 POUNDS AND BE ON YOUR FEET FOR EXTENDED PERIOD OF TIMEKNOWLEDGE OF MICROSOFT OFFICE SUITESELF-MOTIVATED AND HARD WORKINGEXPERIENCE IN HUNTER / JUMPER, DRESSAGE, POLO, OR RACING IS IDEALVET TECHS, RECENT GRADS, GROOMS OR TACK STORE ASSOCIATES STRONGLY ENCOURAGED TO APPLY\nBENEFITS:FLEXIBLE SCHEDULESUPPLEMENTAL COMMISSION PAYTRAVEL ARRANGEMENTS ARE PROVIDED AND PAID FOR BY THE COMPANYIF YOU ENJOY THE SHOW CIRCUIT, MEETING NEW FRIENDS, AND EXPLORING NEW LOCATIONS, THIS JOB IS FOR YOU!",
    "job_skill_set": [
      "sales",
      "customer service",
      "Microsoft Office Suite",
      "order processing",
      "relationship management",
      "communication",
      "self-motivation",
      "rapport building",
      "problem solving",
      "adaptability",
      "teamwork",
      "equine industry knowledge",
      "logistics coordination",
      "physical stamina (lifting 50 pounds)"
    ],
    "short_keywords": [
      "50",
      "adaptability",
      "building",
      "communication",
      "coordination",
      "customer",
      "director",
      "equine",
      "industry",
      "knowledge",
      "lifting",
      "logistics",
      "management",
      "microsoft",
      "mobile",
      "office",
      "order",
      "physical",
      "pounds",
      "problem",
      "processing",
      "rapport",
      "relationship",
      "sales",
      "selfmotivation",
      "service",
      "solving",
      "stamina",
      "suite",
      "teamwork"
    ]
  },
  {
    "job_id": "3894547269",
    "job_title": "Associate Director, Sales Development, SMB",
    "category": "SALES",
    "job_description": "WHO WE ARE IS WHAT WE DO.\n\nDEEL AND OUR FAMILY OF GROWING COMPANIES ARE MADE UP OF GLOBAL TEAMS DEDICATED TO HELPING BUSINESSES HIRE ANYONE, ANYWHERE, EASILY.\n\nTHE TEAM COMPRISES OVER THREE THOUSAND SELF-DRIVEN INDIVIDUALS SPANNING OVER 100 COUNTRIES, AND OUR UNIFIED YET DIVERSE CULTURE KEEPS US CONTINUALLY LEARNING AND INNOVATING THE PLATFORM AND PRODUCTS FOR CUSTOMERS.\n\nCOMPANIES SHOULD BE ABLE TO HIRE THE BEST TALENT ANYWHERE IN THE WORLD, SO WE ARE BUILDING THE BEST PLATFORM TO MAKE THAT A REALITY. OUR MARKET-LEADING TECHNOLOGY, EXPERTISE, AND GLOBAL TEAM ARE CRUCIAL TO THE PLATFORM’S SUCCESS. WE DELIVER THE BEST PRODUCTS AND FEATURES IN OUR SPACE, ENABLING MILLIONS OF JOBS WORLDWIDE AND CONNECTING THE GLOBAL WORKFORCE WITH THE BEST COMPANIES AND OPPORTUNITIES.\n\nWHY SHOULD YOU BE PART OF OUR SUCCESS STORY?\n\nA 30-MILE HIRING RADIUS SHOULD NO LONGER DICTATE HOW COMPANIES HIRE BECAUSE EXCEPTIONAL TALENT LIVES EVERYWHERE. DEEL SEES A WORLD WITHOUT HIRING BORDERS AND ENDLESS TALENT THAT PAIRS PERFECT CANDIDATES WITH GREAT COMPANIES.\n\nWE OFFER GLOBAL TEAMS ALL THE TOOLS THEY NEED TO HIRE, ONBOARD, MANAGE, PAY, AND SCALE AT FULL SPEED. WE AIM TO FOSTER A DIVERSE GLOBAL ECONOMY BY BUILDING A GENERATIONAL PLATFORM THAT SEAMLESSLY CONNECTS COMPANIES WITH TALENT WORLDWIDE.\n\nAFTER OUR SUCCESSFUL SERIES D IN 2021, WE RAISED ANOTHER $50M IN 2023, DOUBLING OUR VALUATION TO $12B. THERE’S NEVER BEEN A MORE EXCITING TIME TO JOIN DEEL — THE INTERNATIONAL PAYROLL AND COMPLIANCE MARKET LEADER.\n\nWHAT WE’RE LOOKING FOR:\n\nAS THE ASSOCIATE DIRECTOR OF SALES DEVELOPMENT, YOU'LL MANAGE A TEAM OF HIGH-PERFORMING MANAGERS AND TEAM MEMBERS FOCUSED ON OUR SMALL-MEDIUM SIZED BUSINESS SEGMENT. YOU WILL BE RESPONSIBLE FOR DRIVING REVENUE AND CUSTOMER ACQUISITION ACROSS THESE SEGMENTS IN A MEANINGFUL WAY, AS WELL AS COACHING TEAM MEMBERS TO IMPROVE THE QUALITY OF THE PIPELINES DRIVEN BY THE SDR ORGANIZATION. THE SALES DEVELOPMENT TEAM IS THE FIRST INTERACTION WITH PROSPECTIVE DEEL CUSTOMERS AND IS KEY TO THE SUCCESS OF DEEL. YOU'LL BE RESPONSIBLE FOR BUILDING AN OVERALL SALES DEVELOPMENT STRATEGY FOR THESE SEGMENTS, AS WELL AS DEVELOPING, TRAINING AND HIRING HIGHLY DRIVEN AND ENTHUSIASTIC TEAM MEMBERS AT BOTH THE MANAGEMENT AND INDIVIDUAL CONTRIBUTOR LEVEL.\n\nKEY RESPONSIBILITIES:\n\nTRACK SALES TEAM METRICS AND REPORT DATA TO SENIOR LEADERSHIP ON A REGULAR BASIS.DRIVE QUOTA ACHIEVEMENT OF SDR TEAM BY FOCUSING ON QUALITY ACROSS SMALL-MEDIUM ACCOUNTS. PARTNER ACROSS SALES MANAGEMENT AND DEMAND GENERATION TO DEVELOP AND EXECUTE A SUCCESSFUL GTM STRATEGY.DEVELOP AND ITERATE AN OUTBOUND METHODOLOGY TO INCREASE CONVERSION RATES.IDENTIFY AND DEVELOP IMPROVEMENTS IN THE AREAS OF PROCESS, EFFICIENCY AND PRODUCTIVITY.ONGOING HIRING, MENTORING, AND DEVELOPMENT OF BOTH THE SDR TEAM AND SDR MANAGERS.EMBODY COMPANY CULTURE AND MAINTAIN HIGH SALES EMPLOYEE ENGAGEMENT.\n\n\nMINIMUM QUALIFICATIONS:\n\nMINIMUM 5+ YEARS EXPERIENCE MANAGING SDR TEAMS. 10+ YEARS OF TOTAL WORK EXPERIENCE.EXPERIENCE IN SECOND-LINE MANAGEMENT. EXPERIENCE MANAGING AN SDR TEAM OF 30+.HAVE WORKED AT A HIGH GROWTH TECH COMPANY THAT SELLS INTO SMALL-MEDIUM SIZE COMPANIES.YOU USE DATA AND ANALYTICS TO DRIVE YOUR DECISION MAKING PROCESS, IDENTIFY AREAS FOR IMPROVEMENT, AND TRACK PROGRESS.EXPERIENCE HIRING AND MANAGING A WORLD CLASS TEAM.\n\n\nTOTAL REWARDS\n\nOUR WORKFORCE DESERVES FAIR AND COMPETITIVE PAY THAT MEETS THEM WHERE THEY ARE. WITH SCALABLE BENEFITS, REWARDS, AND PERKS, OUR TOTAL REWARDS PROGRAMS REFLECT OUR COMMITMENT TO INCLUSIVITY AND ACCESS FOR ALL.\n\nSOME THINGS YOU’LL ENJOY\n\nPROVIDED COMPUTER EQUIPMENT TAILORED TO YOUR ROLESTOCK GRANT OPPORTUNITIES DEPENDENT ON YOUR ROLE, EMPLOYMENT STATUS AND LOCATIONADDITIONAL PERKS AND BENEFITS BASED ON YOUR EMPLOYMENT STATUS AND COUNTRYTHE FLEXIBILITY OF REMOTE WORK, INCLUDING WEWORK ACCESS WHERE AVAILABLE\n\n\nAT DEEL, WE’RE AN EQUAL-OPPORTUNITY EMPLOYER THAT VALUES DIVERSITY AND POSITIVELY ENCOURAGE APPLICATIONS FROM SUITABLY QUALIFIED AND ELIGIBLE CANDIDATES REGARDLESS OF RACE, RELIGION, SEX, NATIONAL ORIGIN, GENDER, SEXUAL ORIENTATION, AGE, MARITAL STATUS, VETERAN STATUS, DISABILITY STATUS, PREGNANCY OR MATERNITY OR OTHER APPLICABLE LEGALLY PROTECTED CHARACTERISTICS.\n\nUNLESS OTHERWISE AGREED, WE WILL COMMUNICATE WITH JOB APPLICANTS USING DEEL-SPECIFIC EMAILS, WHICH INCLUDE @DEEL.COM AND OTHER ACQUIRED COMPANY EMAILS LIKE @PAYSPACE.COM AND @PAYGROUP.COM. YOU CAN VIEW THE MOST UP-TO-DATE JOB LISTINGS AT DEEL BY VISITING OUR CAREERS PAGE.",
    "job_skill_set": [
      "Sales Development",
      "Team Management",
      "Customer Acquisition",
      "Sales Metrics Tracking",
      "Hiring and Training",
      "Leadership",
      "Communication",
      "Problem Solving",
      "Adaptability",
      "Collaboration",
      "Cultural Fit",
      "Data Analytics",
      "GTM Strategy",
      "Outbound Methodology",
      "Coaching",
      "Engagement"
    ],
    "short_keywords": [
      "acquisition",
      "adaptability",
      "analytics",
      "and",
      "associate",
      "coaching",
      "collaboration",
      "communication",
      "cultural",
      "customer",
      "data",
      "development",
      "director",
      "engagement",
      "fit",
      "gtm",
      "hiring",
      "leadership",
      "management",
      "methodology",
      "metrics",
      "outbound",
      "problem",
      "sales",
      "smb",
      "solving",
      "strategy",
      "team",
      "tracking",
      "training"
    ]
  },
  {
    "job_id": "3905833500",
    "job_title": "Sales And Marketing Representative",
    "category": "SALES",
    "job_description": "WE ARE SEEKING A SALES AND MARKETING REPRESENTATIVE TO JOIN OUR TEAM! YOU WILL BE RESPONSIBLE FOR SELLING AND UPGRADING SERVICES ON BEHALF OF THE CLIENTS WE REPRESENT.\nRESPONSIBILITIES:· GROW CLIENT REVENUE WITH NEW AND EXISTING CLIENTS· CREATE AND DELIVER SALES PRESENTATIONS TO CLIENTS· COLLABORATE WITH MARKETING ON LEAD QUALITY AND CONVERSION· ANSWER CUSTOMER INQUIRIES IN A TIMELY AND PROFESSIONAL MANNER· ORGANIZE CLIENT CORRESPONDENCE AND PAPERWORK\nQUALIFICATIONS:· PREVIOUS EXPERIENCE IN SALES, ADVERTISEMENT, OR OTHER RELATED FIELD· STRONG NEGOTIATION SKILLS· ABILITY TO BUILD RAPPORT WITH CLIENTS· EFFECTIVE VERBAL AND WRITTEN COMMUNICATION SKILLS· ABILITY TO THRIVE IN FAST-PACED ENVIRONMENT \nTHIS IS AN ENTRY LEVEL ROLE. NO EXPERIENCE IS NECESSARY. WE WILL PROVIDE TRAINING.",
    "job_skill_set": [
      "sales",
      "marketing",
      "negotiation",
      "customer service",
      "communication",
      "teamwork",
      "time management",
      "adaptability",
      "relationship building",
      "presentation"
    ],
    "short_keywords": [
      "adaptability",
      "and",
      "building",
      "communication",
      "customer",
      "management",
      "marketing",
      "negotiation",
      "presentation",
      "relationship",
      "representative",
      "sales",
      "service",
      "teamwork",
      "time"
    ]
  },
  {
    "job_id": "3902779776",
    "job_title": "Digital & Visitor Media Sales Executive",
    "category": "SALES",
    "job_description": "COMPANY OVERVIEW:\nPACIFIC MEDIA GROUP (PMG) IS A DYNAMIC AND INNOVATIVE MEDIA COMPANY COMMITTED TO DELIVERING CUTTING-EDGE ADVERTISING SOLUTIONS. AS WE EXPAND OUR TEAM, WE ARE SEEKING A RESULTS-DRIVEN DIGITAL & VISITOR MEDIA SALES EXECUTIVE TO CONTRIBUTE TO OUR GROWTH ACROSS HAWAI’I. THE IDEAL CANDIDATE WILL POSSESS A POSITIVE, CAN-DO ATTITUDE, RELIABLE, PUNCTUAL, ENERGETIC AND DETAIL-ORIENTED ALL WHILE EMBODYING THE ALOHA SPIRIT, WHICH WILL ALIGN SUCCESSFULLY IN THE ORGANIZATION.\n\nRESPONSIBILITIES:\nOUTREACH & PROSPECTING:PROSPECT AND ACQUIRE NEW CLIENTS THROUGH TARGETED OUTREACH, NETWORKING, AND OTHER SALES STRATEGIES.DEVELOP AND MAINTAIN RELATIONSHIPS WITH CLIENTS, UNDERSTANDING THEIR NEEDS AND ENSURING SATISFACTION FOR LONG TERM SUCCESS.\nSALES PRESENTATIONS:CONDUCT PERSUASIVE AND COMPELLING SALES PRESENTATIONS TO SHOWCASE PMG'S ADVERTISING SOLUTIONS.CLEARLY ARTICULATE THE VALUE PROPOSITION OF OUR PRODUCTS AND TAILOR PRESENTATIONS TO MEET THE SPECIFIC NEEDS OF CLIENTS.\nTRAVEL AND IN-PERSON MEETINGS:ENGAGE IN SALES ACTIVITIES, TRAVELING TO MEET CLIENTS IN PERSON, CONDUCTING B2B SALES, BUILDING RAPPORT AND TRUST THROUGH FACE-TO-FACE INTERACTIONS WHILE PROMOTING AND SELLING PMG MEDIA PRODUCTS WITHIN HAWAIʻI.ATTEND INDUSTRY EVENTS AND CONFERENCES TO NETWORK AND GENERATE NEW BUSINESS OPPORTUNITIES.\nSALES STRATEGIES:DEVELOP AND IMPLEMENT EFFECTIVE SALES STRATEGIES TO ACHIEVE AND EXCEED SALES TARGETS.STAY INFORMED ABOUT INDUSTRY TRENDS, MARKET CONDITIONS, AND COMPETITOR ACTIVITIES TO ADJUST STRATEGIES ACCORDINGLY.\nCREATIVITY & LISTENING:CREATE CUSTOMIZED MARKETING SOLUTIONS TAILORED TO THE SPECIFIC REQUIREMENTS OF CLIENTS.DEMONSTRATE CREATIVE THINKING AND INGENUITY IN DEVELOPING ADVERTISING STRATEGIES.\n\nQUALIFICATIONS:PROVEN EXPERIENCE IN B2B MEDIA SALES REPRESENTATIVE OR IN A SIMILAR ROLE.EXCELLENT LISTENING SKILLS TO UNDERSTAND THE VARIOUS NEEDS OF BUSINESSES.STRONG COMMUNICATION AND INTERPERSONAL SKILLS, WITH THE ABILITY TO INFLUENCE SALES TARGETS.ABILITY TO TRAVEL AS NEEDED FOR CLIENT MEETINGS AND EVENTS.PROACTIVE AND SELF-MOTIVATED WITH A RESULTS-ORIENTED MINDSET.FAMILIARITY WITH ADVERTISING AND MEDIA INDUSTRY TRENDS.KNOWLEDGE OF EXPERIENCE IN B2B SALES IS ADVANTAGEOUS.\n\nREQUIREMENTS:MUST CURRENTLY RESIDE IN HAWAIʻIBACHELOR’S DEGREE IN BUSINESS, MARKETING, OR A RELATED FIELD (PREFERRED).5 YEARS OF SUCCESSFUL B2B SALES EXPERIENCE.PROFICIENT IN USING CRM SOFTWARE AND OTHER SALES TOOLS.VALID HAWAI’I DRIVER'S LICENSE AND RELIABLE TRANSPORTATION.\n\nCOMPENSATION:COMPETITIVE GUARANTEED COMPENSATION PLUS COMMISSION $60,000-$80,000/PER YEAR DOE. EARNING POTENTIAL OF $150K+/YEAR. PAID MEDICAL, DENTAL & VISIONPAID VACATION AND PAID SICK LEAVE401(K) AFTER 1 YEAR OF EMPLOYMENT\nHOW TO APPLY:INTERESTED CANDIDATES SHOULD SUBMIT THEIR RESUME AND A COVER LETTER DETAILING THEIR RELEVANT EXPERIENCE TO TAIJAHARA@PMGHAWAII.COM.",
    "job_skill_set": [
      "B2B sales",
      "sales strategies",
      "client relationship management",
      "communication",
      "interpersonal skills",
      "listening",
      "self-motivation",
      "results-oriented mindset",
      "reliability",
      "detail-oriented",
      "positive attitude",
      "CRM software",
      "advertising solutions",
      "market analysis",
      "presentation skills",
      "networking",
      "creativity",
      "punctuality"
    ],
    "short_keywords": [
      "advertising",
      "analysis",
      "attitude",
      "b2b",
      "client",
      "communication",
      "creativity",
      "crm",
      "detailoriented",
      "digital",
      "executive",
      "interpersonal",
      "listening",
      "management",
      "market",
      "media",
      "mindset",
      "networking",
      "positive",
      "presentation",
      "punctuality",
      "relationship",
      "reliability",
      "resultsoriented",
      "sales",
      "selfmotivation",
      "skills",
      "software",
      "solutions",
      "strategies",
      "visitor"
    ]
  },
  {
    "job_id": "3904088803",
    "job_title": "Territory Sales Manager",
    "category": "SALES",
    "job_description": "JOB OPPORTUNITY: TERRITORY SALES MANAGERARE YOU AN EXPERIENCED SALES PROFESSIONAL LOOKING FOR AN EXCITING OPPORTUNITY TO DRIVE BUSINESS GROWTH IN THE NORTH CENTRAL US? MY CLIENT IS CURRENTLY SEEKING A TALENTED TERRITORY SALES MANAGER TO JOIN THEIR TEAM AND SPEARHEAD THE EXPANSION OF THEIR WIRELESS MODULE & SOM/SBC BUSINESS.YOU WILL BE RESPONSIBLE FOR DEVELOPING AND EXECUTING STRATEGIC PLANS TO ENHANCE SALES PIPELINE AND REVENUE GENERATION WITHIN THE DESIGNATED REGION. THIS ROLE ENTAILS CLOSE COLLABORATION WITH DISTRIBUTORS AND INTERNAL SALES TEAMS TO GAIN INSIGHTS INTO CUSTOMER NEEDS AND PROPOSE TAILORED SOLUTIONS. ADDITIONALLY, YOU WILL ARTICULATE THE VALUE PROPOSITION OF THE PRODUCTS, IDENTIFY GROWTH OPPORTUNITIES, AND WORK CLOSELY WITH PRODUCT MANAGEMENT AND ENGINEERING TEAMS TO PROVIDE CUSTOMIZED RECOMMENDATIONS. TRAINING AND SUPPORT FOR DISTRIBUTORS AND SILICON PARTNERS, ALONG WITH THE PREPARATION AND DELIVERY OF COMPELLING PRODUCT PRESENTATIONS, ARE ALSO KEY ASPECTS OF THE ROLE. FURTHERMORE, YOU WILL PARTNER WITH CUSTOMERS AND DISTRIBUTORS TO DEVELOP REVENUE FORECASTS AND TRACK PERFORMANCE, WHILE ENSURING ACCURATE RECORD-KEEPING IN OUR CRM SYSTEM TO EFFECTIVELY MANAGE LEADS, OPPORTUNITIES, AND ACCOUNTS. REQUIREMENTS:STRONG TECHNICAL ACUMEN WITH THE ABILITY TO LEARN AND UNDERSTAND COMPLEX PRODUCTS.EXCELLENT COMMUNICATION AND INTERPERSONAL SKILLS.DETAIL-ORIENTED WITH STRONG ORGANIZATIONAL ABILITIES.PROVEN TRACK RECORD IN SALES, PREFERABLY IN THE SEMICONDUCTOR OR ELECTRONICS INDUSTRY.EXPERIENCE WORKING WITH ELECTRONICS DISTRIBUTORS IS A PLUS.PROFICIENCY IN CRM SYSTEMS, SUCH AS SALESFORCE, IS DESIRABLE.WILLINGNESS TO TRAVEL UP TO 50% WITHIN THE ASSIGNED TERRITORY. EDUCATION/EXPERIENCE:BACHELOR'S DEGREE PREFERRED; RELEVANT WORK EXPERIENCE WILL ALSO BE CONSIDERED.MINIMUM OF 5 YEARS OF EXPERIENCE IN SALES.BACKGROUND IN ENGINEERING OR RELATED FIELDS IS ADVANTAGEOUS. IF YOU'RE READY TO TAKE ON A NEW CHALLENGE AND MAKE AN IMPACT IN A DYNAMIC INDUSTRY, I WANT TO HEAR FROM YOU! APPLY NOW TO JOIN THIS EXCITING TEAM AS A TERRITORY SALES MANAGER AND DRIVE SUCCESS IN THE NORTH CENTRAL US MARKET.",
    "job_skill_set": [
      "sales",
      "organizational skills",
      "collaboration",
      "communication",
      "interpersonal skills",
      "detail-oriented",
      "problem solving",
      "adaptability",
      "teamwork",
      "customer focus",
      "CRM systems",
      "technical acumen",
      "product presentations",
      "revenue forecasting",
      "electronic industry knowledge"
    ],
    "short_keywords": [
      "acumen",
      "adaptability",
      "collaboration",
      "communication",
      "crm",
      "customer",
      "detailoriented",
      "electronic",
      "focus",
      "forecasting",
      "industry",
      "interpersonal",
      "knowledge",
      "manager",
      "organizational",
      "presentations",
      "problem",
      "product",
      "revenue",
      "sales",
      "skills",
      "solving",
      "systems",
      "teamwork",
      "technical",
      "territory"
    ]
  },
  {
    "job_id": "3894619450",
    "job_title": "Call Center Sales Retention Rep (Bilingual Spanish) - $18 per Hour Plus Commission & Incentives",
    "category": "SALES",
    "job_description": "OUR AGENTS EARN AN HOURLY BASE PAY OF $18.00 ALONG WITH LUCRATIVE COMMISSION AND INCENTIVES FOR A TARGET HOURLY EARNINGS OF $25.00/HOUR OR $52,018 ANNUALLY. TOP PERFORMERS CAN EARN $70,800, PLUS INCENTIVES. YOU MAY ALSO QUALIFY FOR FREE INTERNET, TV AND PHONE SERVICES (RESTRICTIONS DO APPLY).\n\nJOB SUMMARY\n\nTHE RESIDENTIAL RETENTION REPRESENTATIVE MAXIMIZES OPPORTUNITIES TO RETAIN EXISTING CUSTOMERS FROM DISCONNECTING WHILE RETAINING AND UPSELLING CORE PRODUCTS I.E. VIDEO, DATA AND PHONE. EXECUTE RETENTION STRATEGY THAT STRIKES BALANCE BETWEEN SAVING CUSTOMERS AND RETAINING REVENUE.\n\nMAJOR DUTIES AND RESPONSIBILITIES\n\nACTIVELY AND CONSISTENTLY SUPPORT ALL EFFORTS TO SIMPLIFY AND ENHANCE THE CUSTOMER EXPERIENCE.ESTABLISH AND MAINTAIN A HIGH LEVEL OF CUSTOMER SATISFACTION, PROFESSIONALISM, AND COURTESY IN ALL RETENTION TRANSACTIONS.CONSISTENTLY MEET OR EXCEED WEEKLY AND MONTHLY RETENTION ACTIVITY GOALS BY UTILIZING SOUND TELEPHONE BASED CUSTOMER SAVE TECHNIQUES.RESPOND TO INBOUND RETENTION CALLS PROMPTLY AND EFFICIENTLY AS OUTLINED BY THE REQUIRED CALL HANDLING METRICS TO INCLUDE PRODUCTIVE TIME, SCHEDULE ADHERENCE, HANDLE TIME, AFTER CALL WORK, ETC.ANSWER QUESTIONS PERTAINING TO BILLING INQUIRIES, PRICING AND PACKAGING OF PRODUCTS AND SERVICE, AND SERVICE COMPLAINTS.ABILITY TO LEARN AND MASTER ORDER PROCESSING WITHIN THE BILLING SYSTEM REGARDING ALL ASPECTS OF RETAINED ACCOUNTS, NEW SALES ORDER ENTRY, ACCOUNT LOOKUP, AND OTHER TOOLS AND FUNCTIONS AS THEY RELATE TO THE RETENTION FUNCTION.HAVE A FULL UNDERSTANDING OF AND CONSISTENTLY DEMONSTRATE PROFICIENCY AT EXPLAINING ALL PRODUCTS AND SERVICES TO EXISTING CUSTOMERS IN AN EFFORT TO RE-SELL AND RETAIN.ACQUIRE AND DEMONSTRATE THOROUGH KNOWLEDGE OF COMPETITORS’ PRICING, PACKAGING, AND PRODUCTS IN AN EFFORT TO DISCUSS SIDE BY SIDE COMPARISONS OF CHARTER’S AND COMPETITORS’ PRODUCTS AND SERVICES.PERFORM OTHER DUTIES AS REQUESTED BY SUPERVISOR.\n\nREQUIRED QUALIFICATIONS\n\nREQUIRED SKILLS/ABILITIES AND KNOWLEDGE\n\nABILITY TO READ, WRITE, SPEAK AND UNDERSTAND ENGLISHDEMONSTRATED WORKING KNOWLEDGE OF CABLE COMMUNICATIONS PRODUCTS AND SERVICES TO INCLUDE VIDEO (TV), DATA (INTERNET) AND VOICE (TELEPHONE)ABILITY TO WORK VARIABLE HOURS; MAY INCLUDE WEEKENDS, HOLIDAYS, AND SPLIT DAYS OFFBILINGUAL: SPANISH REQUIRED\n\nREQUIRED EDUCATION\n\nHIGH SCHOOL DIPLOMA OR EQUIVALENT\n\nPREFERRED QUALIFICATIONS\n\nPREFERRED RELATED WORK EXPERIENCE AND NUMBER OF YEARS\n\nCALL CENTER EXPERIENCE IN THE AREAS OF CUSTOMER SERVICE AND/OR PHONE SALES, OR EQUIVALENT EXPERIENCE - 2+\n\nWORKING CONDITIONS\n\nOFFICE ENVIRONMENT\n\nAPPLY NOW, CONNECT A FRIEND TO THIS OPPORTUNITY OR SIGN UP FOR JOB ALERTS!\n\nCRT110 2024-32052 2024\n\nHERE, EMPLOYEES DON’T JUST HAVE JOBS, THEY BUILD CAREERS. THAT’S WHY WE BELIEVE IN OFFERING A COMPREHENSIVE PAY AND BENEFITS PACKAGE THAT REWARDS EMPLOYEES FOR THEIR CONTRIBUTIONS TO OUR SUCCESS, SUPPORTS ALL ASPECTS OF THEIR WELL-BEING, AND DELIVERS REAL VALUE AT EVERY STAGE OF LIFE.\n\nA QUALIFIED APPLICANT’S CRIMINAL HISTORY, IF ANY, WILL BE CONSIDERED IN A MANNER CONSISTENT WITH APPLICABLE LAWS, INCLUDING LOCAL ORDINANCES.\n\nGET TO KNOW US CHARTER COMMUNICATIONS IS KNOWN IN THE UNITED STATES BY OUR SPECTRUM BRANDS, INCLUDING: SPECTRUM INTERNET®, TV, MOBILE AND VOICE, SPECTRUM NETWORKS, SPECTRUM ENTERPRISE AND SPECTRUM REACH. WHEN YOU JOIN US, YOU’RE JOINING A STRONG COMMUNITY OF MORE THAN 100,000 INDIVIDUALS WORKING TOGETHER TO SERVE MORE THAN 32 MILLION CUSTOMERS IN 41 STATES AND KEEP THEM CONNECTED TO WHAT MATTERS MOST. WATCH THIS VIDEO TO LEARN MORE.\n\nWHO YOU ARE MATTERS HERE WE’RE COMMITTED TO GROWING A WORKFORCE THAT REFLECTS OUR COMMUNITIES, AND PROVIDING EQUAL OPPORTUNITIES FOR EMPLOYMENT AND ADVANCEMENT. EOE, INCLUDING DISABILITY/VETS. LEARN ABOUT OUR INCLUSIVE CULTURE.",
    "job_skill_set": [
      "customer service",
      "order processing",
      "communication",
      "problem solving",
      "customer satisfaction",
      "professionalism",
      "adaptability",
      "teamwork",
      "time management",
      "bilingual Spanish",
      "phone sales",
      "cable communications products",
      "billing system",
      "product knowledge",
      "competitor analysis"
    ],
    "short_keywords": [
      "18",
      "adaptability",
      "analysis",
      "bilingual",
      "billing",
      "cable",
      "call",
      "center",
      "commission",
      "communication",
      "communications",
      "competitor",
      "customer",
      "hour",
      "incentives",
      "knowledge",
      "management",
      "order",
      "per",
      "phone",
      "plus",
      "problem",
      "processing",
      "product",
      "products",
      "professionalism",
      "rep",
      "retention",
      "sales",
      "satisfaction",
      "service",
      "solving",
      "spanish",
      "system",
      "teamwork",
      "time"
    ]
  },
  {
    "job_id": "3902954784",
    "job_title": "Inside Sales Representative",
    "category": "SALES",
    "job_description": "INSIDE SALES REPRESENTATIVE FORT WORTH, TEXAS, UNITED STATES · CLIENT SERVICES COME WORK FOR US!JOIN OUR GROWING TEAM OF EXPERTS DEDICATED TO HELPING CLIENTS SIMPLIFY AND STRENGTHEN THEIR MARKETING EFFORTS.XPRESSDOCS IS LOOKING FOR AN INSIDE SALES REPRESENTATIVE (PENETRATION) TO JOIN OUR TEAM. IN THIS ROLE YOU WILL BE RESPONSIBLE FOR UNDERSTANDING OUR CUSTOMERS’ NEEDS AND REQUIREMENTS IN ORDER TO EFFECTIVELY PRESENT AND DEMONSTRATE OUR PRODUCTS AND SERVICES. IN THIS POSITION, YOU WILL:CONDUCT OUTBOUND CALLS TO POTENTIAL CUSTOMERS TO GENERATE NEW BUSINESS OPPORTUNITIES.UNDERSTAND CUSTOMER NEEDS AND EFFECTIVELY PRESENT AND DEMONSTRATE XPRESSDOCS PRODUCTS AND SERVICES. STAY INFORMED ABOUT INDUSTRY TRENDS, MARKET CONDITIONS, AND COMPETITORS TO EFFECTIVELY POSITION OUR OFFERINGS.STAY INFORMED ABOUT OUT PRODUCTS AND SERVICES TO EFFECTIVELY COMMUNICATE THEIR VALUE PROPOSITIONS TO CLIENTSUTILIZE CRM SOFTWARE TO TRACK AND MANAGE CUSTOMER INTERACTIONS, SALES LEADS, AND OPPORTUNITIES. \nYOU’LL THRIVE IN THIS ROLE IF YOU:HAVE A PROVEN TRACK RECORD IN INSIDE SALES. HAVE A MINDSET THAT IS RESULTS-DRIVEN WITH A FOCUS ON ACHIEVING AND EXCEEDING SALES TARGETS.ARE PROFICIENT WITH CORPORATE PRODUCTIVITY AND WEB PRESENTATION TOOLS. HAVE EXPERIENCE WORKING WITH HUBSPOT, MICROSOFT DYNAMICS, OR SIMILAR CRM.POSSESS EXCELLENT COMMUNICATION AND INTERPERSONAL SKILLS.A CONSCIOUS AND DETAIL ORIENTATED WAY OF THINKING. YOU MUST BE ORGANIZED AND SELF-MOTIVATED.HAVE STRONG NEGOTIATION AND PERSUASION SKILLS. HAVE THE ABILITY TO WORK INDEPENDENTLY AND COLLABORATIVELY IN A TEAM ENVIRONMENT. EXCELLENT ORGANIZATIONAL/FOLLOW-UP SKILLS TO OVERSEE MULTIPLE PROJECTS.EXPERIENCE AND KNOWLEDGE OF THE MARKETING AND SALES PROCESS.ABILITY TO SIT AT A DESK UP TO 80% OF THE TIME.ABILITY TO STAND AND WALK UP TO 20% OF THE TIME.ABILITY TO BE CONFINED IN A SMALL AREA; SUCH AS A CUBICAL.WHAT WE OFFER:AN ENVIRONMENT THAT PRIORITIZES BALANCE BETWEEN WORK AND FAMILY. OUR COMPREHENSIVE BENEFITS PACKAGE AND WORKPLACE OPPORTUNITIES INCLUDE:COLLABORATE WITH AN UPBEAT TEAM OF TECHIES, CREATIVES, AND SPECIALISTS…WHO ACTUALLY LIKE WHAT THEY DO. ENJOY OUR MODERN, SECURE AND CENTRALLY LOCATED OFFICE IN FORT WORTHFLEXIBLE WORK FROM HOME OPTIONSCOFFEE BAR AND WELLNESS ROOMSDENTAL, VISION, DISABILITY, AND LIFE INSURANCEWITH COMPANY MATCHINGHOLIDAYS, VACATION, AND PERSONAL TIMEREIMBURSEMENTAWARDS PROGRAMDEDICATED SOCIAL PLATFORM FOR PEER, WORK ANNIVERSARY AND BIRTHDAY RECOGNITION\nWHO WE AREA MARKETING/PRINT/TECHNOLOGY COMPANY WITH MORE THAN 20 YEARS OF EXPERIENCE HELPING SOME OF TODAY’S TOP COMPANIES SIMPLIFY AND STRENGTHEN THEIR MARKETING. WE PROVIDE CUTTING-EDGE BUT ACCESSIBLE MARKETING TECHNOLOGY, PRODUCE HIGH-QUALITY MARKETING MATERIALS, AND CREATE WORLD-CLASS CUSTOMER EXPERIENCES. WE TAKE OUR SOLUTIONS SERIOUSLY, BUT WE DON’T TAKE OURSELVES SERIOUSLY.TO LEARN MORE ABOUT WHAT WE DO AND WHO WE SERVE, VISIT WWW.XPRESSDOCS.COM.XPRESSDOCS PROVIDES EQUAL EMPLOYMENT OPPORTUNITIES TO ALL EMPLOYEES AND APPLICANTS FOR EMPLOYMENT AND PROHIBITS DISCRIMINATION AND HARASSMENT OF ANY TYPE WITHOUT REGARD TO RACE, COLOR, RELIGION, AGE, SEX, NATIONAL ORIGIN, DISABILITY STATUS, GENETICS, PROTECTED VETERAN STATUS, SEXUAL ORIENTATION, GENDER IDENTITY OR EXPRESSION, OR ANY OTHER CHARACTERISTIC PROTECTED BY FEDERAL, STATE OR LOCAL LAWS.",
    "job_skill_set": [
      "CRM software",
      "sales",
      "negotiation",
      "marketing knowledge",
      "customer interaction tracking",
      "communication",
      "interpersonal skills",
      "self-motivation",
      "organization",
      "teamwork",
      "detail-oriented",
      "results-driven",
      "collaboration",
      "presentation tools",
      "Microsoft Dynamics",
      "HubSpot"
    ],
    "short_keywords": [
      "collaboration",
      "communication",
      "crm",
      "customer",
      "detailoriented",
      "dynamics",
      "hubspot",
      "inside",
      "interaction",
      "interpersonal",
      "knowledge",
      "marketing",
      "microsoft",
      "negotiation",
      "organization",
      "presentation",
      "representative",
      "resultsdriven",
      "sales",
      "selfmotivation",
      "skills",
      "software",
      "teamwork",
      "tools",
      "tracking"
    ]
  },
  {
    "job_id": "3906231285",
    "job_title": "Sales Manager",
    "category": "SALES",
    "job_description": "SALARY RANGE: ROUGHLY $80,000-150,000+ ANNUALLY BASED ON YOUR INDIVIDUAL SALES AND TEAM PERFORMANCE!\n\nOUR CLIENT, AN AUTHORITY IN THE ROOFING BUSINESS, HAS BEEN SERVING CUSTOMERS SINCE 2017 IN RESIDENTIAL AND COMMERCIAL ROOFING, GUTTERS, SKYLIGHTS, AND METAL ROOFING INSTALLATION AND REPAIR. HEADQUARTERED IN DODGE CITY, KS, THEY HAVE GROWN TO 10 NEW LOCATIONS AND LOOKING TO EXPAND. THEY ARE SEEKING A SALES MANAGER TO OPEN AND LEAD THEIR NEW LOCATION IN BENTONVILLE, ARKANSAS.\n\nRESPONSIBILITIES: MANAGE ROOFING PROJECTS FROM START TO FINISH FROM SALES AND INSURANCE CLAIMS TO PROJECT MANAGEMENT/INSTALLATION LEAD SALES STAFF AND LABOR CREW SUPERVISE JOB SITES AND CREWS THROUGHOUT THE INSTALLATION/PRODUCTION PROCESS OVERSEE ALL SALES ACTIVITIES INCLUDING CANVASSING, SETTING UP APPOINTMENTS, PRESENTATIONS, AND CLOSING SALES/SIGNING CONTRACTS. RUN APPOINTMENTS/CONSULTATIONS THROUGHOUT THE WEEK. PERFORM ESTIMATES AND INSPECTIONS ORDERING MATERIALS, COMPLETING MATERIAL ORDER SHEET COMPLETE LABOR SHEETS FOR YOUR CREW STARTING THE INSURANCE CLAIM, READING INSURANCE SCOPES, INVOICING, AND COLLECTING PAYMENT PROVIDE THE UTMOST CUSTOMER SERVICE TO NEW AND EXISTING CUSTOMERS TRACK SALES AND PROJECTS IN OUR CRM ACCULYNX UPHOLD THE COMPANY’S CORE VALUES REQUIREMENTS: 2+ YEARS OF RESIDENTIAL ROOFING SALES AND INSTALLATION EXPERIENCE HAVE A VALID DRIVER'S LICENSE AND VEHICLE FOR ATTENDING SALES APPOINTMENTS AND JOB SITES MUST BE WILLING TO WORK MONDAY TO SATURDAY MUST BE ABLE TO PASS A BACKGROUND CHECK ABILITY AND WILLINGNESS TO TRAVEL LOCALLY (ROUGHLY 2 HOURS WITHIN YOUR AREA) COMMITS 10-12 HOURS PER DAY TOWARD THEIR OWN SUCCESS MONEY-MOTIVATED AND SELF-MOTIVATED WITH STRONG CUSTOMER SERVICE SKILLS HONESTY AND PROFESSIONALISM CAN LIFT UP TO 70 LBS AS NEEDED (BUILDING MATERIALS)\n\nCANDIDATES WITH EXPERIENCE IN THESE ROLES ARE GREAT FITS FOR THIS JOB:\n\nROOFING SALES/PRODUCTION LEADERS, ROOFING PRODUCTION MANAGERS, ROOFING INSTALLATION MANAGERS, ROOFING PROJECT MANAGERS, ROOFING FIELD MANAGERS, ETC.\n\n",
    "job_skill_set": [
      "sales management",
      "customer service",
      "contract negotiation",
      "team leadership",
      "self-motivation",
      "communication",
      "problem solving",
      "professionalism",
      "time management",
      "adaptability",
      "customer relationship management",
      "motivation",
      "project management",
      "CRM software (AccuLynx)",
      "insurance claims processing",
      "roofing installation",
      "estimating and inspections",
      "material ordering",
      "honesty"
    ],
    "short_keywords": [
      "acculynx",
      "adaptability",
      "and",
      "claims",
      "communication",
      "contract",
      "crm",
      "customer",
      "estimating",
      "honesty",
      "inspections",
      "installation",
      "insurance",
      "leadership",
      "management",
      "manager",
      "material",
      "motivation",
      "negotiation",
      "ordering",
      "problem",
      "processing",
      "professionalism",
      "project",
      "relationship",
      "roofing",
      "sales",
      "selfmotivation",
      "service",
      "software",
      "solving",
      "team",
      "time"
    ]
  },
  {
    "job_id": "3895213851",
    "job_title": "Technology Sales Representative",
    "category": "SALES",
    "job_description": "OVERVIEW\n\nARE YOU PASSIONATE ABOUT TECHNOLOGY? DO YOU SEE YOURSELF SOLVING BUSINESS CHALLENGES WITH CUSTOMERS? ARE YOU SEEKING A COMPANY WHERE YOU CAN LEARN AND GROW?\n\nJOIN US AT KONICA MINOLTA BUSINESS SOLUTIONS AS A TECHNOLOGY SALES REPRESENTATIVE!\n\nWE PARTNER WITH CLIENTS TO DESIGN THE FUTURE OF WORK BY IMPROVING THEIR CYBER SECURITY, OPTIMIZING CLOUD DATA FUNCTIONALITY, OFFERING MANAGED PRINT, IT AND AUTOMATION SERVICES, DESIGNING VIDEO SECURITY SYSTEMS, AND SO MUCH MORE! THIS IS A GREAT OPPORTUNITY TO LEARN ABOUT TECHNOLOGY, COMMUNICATE WITH CUSTOMERS, AND BEGIN YOUR SALES CAREER WITH AN INDUSTRY LEADER IN DIGITAL TRANSFORMATION. WE ARE HIRING MOTIVATED PEOPLE TO HELP US CHAMPION OUR TECHNOLOGY PRODUCTS AND SOLUTIONS TO CURRENT AND FUTURE CLIENTS.\n\nRESPONSIBILITIES\n\nWHAT YOU’LL DO AS A TECHNOLOGY SALES REPRESENTATIVE:\n\nLEARN ABOUT OUR PRODUCTS, SOLUTIONS, AND NEW TECHNOLOGIES EVERYDAY RESEARCH, DEVELOP SALES OPPORTUNITIES, AND MANAGE A PIPELINE OF POTENTIAL ACCOUNTS ENGAGE WITH CURRENT AND POTENTIAL CLIENTS THROUGH CALLS, EMAILS, AND SOCIAL MEDIA TO SCHEDULE APPOINTMENTS AND CONDUCT IN-PERSON DISCOVERY MEETINGS, PRESENTATIONS AND DEMONSTRATIONS LEAD STRATEGIC CONVERSATIONS WITH BUSINESS OWNERS, EXECUTIVES, AND OTHERS IN TARGET ACCOUNTS TO UNCOVER THEIR BUSINESS CHALLENGES AND ORGANIZATIONAL NEEDS TO GENERATE OPPORTUNITIES AND CREATE PROPOSALS FOR NEW REVENUE STREAMS. FOCUS ON OPTIMAL CUSTOMER EXPERIENCE THROUGHOUT THE SALES CYCLE THROUGH POST SALE SUPPORT WORK WITH A TEAM OF TECHNOLOGY SUBJECT MATTER EXPERTS TO ENRICH YOUR SKILLS AND LEARN TO CONNECT WITH CUSTOMERS TO HELP THEM ACHIEVE SUCCESS. CONTRIBUTE TO INDIVIDUAL AND TEAM REVENUE, CORPORATE CULTURE, AND BRAND IMAGE BY CONSISTENTLY ACHIEVING DAILY ACTIVITY GOALS. APPLY LEARNED SKILLS AND KNOWLEDGE TO DEVELOP YOUR CAREER WITH KONICA MINOLTA. \n\nWHAT WE OFFER\n\nCONSISTENT TRAINING ON CURRENT AND UPCOMING TECHNOLOGY PRODUCT & SERVICE OFFERINGS TAKE CHARGE OF YOUR EARNINGS THROUGH A BASE SALARY AND UNCAPPED COMMISSION STRUCTURE AN INCLUSIVE AND FLEXIBLE WORKPLACE ENVIRONMENT THAT HIGHLY VALUES SHARING OF NEW PERSPECTIVES OPPORTUNITIES TO EARN TRIPS TO THE NAPA VALLEY AND OTHER GREAT LOCATIONS THROUGH OUR BLUE DIAMOND CLUB FOR SALES ACHIEVEMENT. OUR 2023 TRIP WILL BE TO HAWAII! COMPREHENSIVE BENEFITS PACKAGE INCLUDING PAID HOLIDAYS, VACATION, MEDICAL/DENTAL, AND EMPLOYEE ASSISTANCE PROGRAMS. TUITION REIMBURSEMENT PROGRAM TO HELP YOU GROW YOUR CAREER AT KONICA MINOLTA \n\nQUALIFICATIONS\n\nMINIMUM QUALIFICATIONS:\n\n0-2 YEARS OF BUSINESS-TO-BUSINESS SALES OR CUSTOMER-FACING EXPERIENCE, BACHELOR’S DEGREE PREFERRED PASSION AND APTITUDE TO LEARN A VARIETY OF TECHNOLOGY PRODUCTS AND SERVICES DEMONSTRATED SUCCESS PERSUADING OTHERS TO CONSIDER NEW IDEAS AND TAKE ACTION \n\nABOUT US\n\nABOUT KONICA MINOLTA\n\nKONICA MINOLTA’S JOURNEY STARTED 150 YEARS AGO, WITH A VISION TO SEE AND DO THINGS DIFFERENTLY. WE INNOVATE FOR THE GOOD OF SOCIETY AND THE WORLD. THE SAME PURPOSE THAT KEPT US MOVING THEN, KEEPS US MOVING NOW. KONICA MINOLTA BUSINESS SOLUTIONS U.S.A., INC. IS RESHAPING AND REVOLUTIONIZING THE WORKPLACE TO ACHIEVE TRUE CONNECTIVITY THROUGH THE INTELLIGENT CONNECTED WORKPLACE. THE COMPANY GUIDES AND SUPPORTS ITS CLIENTS’ DIGITAL TRANSFORMATION THROUGH ITS EXPANSIVE OFFICE TECHNOLOGY PORTFOLIO, INCLUDING IT SERVICES (ALL COVERED), INTELLIGENT INFORMATION MANAGEMENT, MANAGED PRINT SERVICES AND INDUSTRIAL AND COMMERCIAL PRINT SOLUTIONS. KONICA MINOLTA HAS BEEN INCLUDED ON CRN’S MSP 500 LIST NINE TIMES AND THE WORLD TECHNOLOGY AWARDS NAMED THE COMPANY A FINALIST IN THE IT SOFTWARE CATEGORY. KONICA MINOLTA HAS BEEN RECOGNIZED AS THE #1 BRAND FOR CUSTOMER LOYALTY IN THE MFP OFFICE COPIER MARKET BY BRAND KEYS FOR SIXTEEN CONSECUTIVE YEARS, AND IS PROUD TO BE RANKED ON THE FORBES 2021 AMERICA’S BEST-IN-STATE EMPLOYERS LIST. THE COMPANY RECEIVED KEYPOINT INTELLIGENCE’S BLI 2021 A3 LINE OF THE YEAR AWARD AND BLI 2021-2023 MOST COLOR CONSISTENT A3 BRAND AWARD FOR ITS BIZHUB I-SERIES. KONICA MINOLTA, INC. HAS BEEN NAMED TO THE DOW JONES SUSTAINABILITY WORLD INDEX FOR NINE CONSECUTIVE YEARS AND HAS SPENT SIX YEARS ON THE GLOBAL 100 MOST SUSTAINABLE CORPORATIONS IN THE WORLD LIST. KONICA MINOLTA PARTNERS WITH ITS CLIENTS TO GIVE SHAPE TO IDEAS AND WORKS TO BRING VALUE TO OUR SOCIETY. FOR MORE INFORMATION, PLEASE VISIT US ONLINE AND FOLLOW KONICA MINOLTA ON FACEBOOK, YOUTUBE, LINKEDIN AND TWITTER.\n\nEOE STATEMENT\n\nKONICA MINOLTA IS AN EQUAL OPPORTUNITY AND AFFIRMATIVE ACTION EMPLOYER. WE CONSIDER ALL QUALIFIED APPLICANTS FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, CREED, NATIONAL ORIGIN, SEX, PREGNANCY, AGE, SEXUAL ORIENTATION, TRANSGENDER STATUS, GENDER IDENTITY, DISABILITY, ALIENAGE OR CITIZENSHIP STATUS, MARITAL STATUS OR PARTNERSHIP STATUS, GENETIC INFORMATION, VETERAN STATUS OR ANY OTHER CHARACTERISTIC PROTECTED UNDER APPLICABLE LAW.",
    "job_skill_set": [
      "customer engagement",
      "communication",
      "problem solving",
      "teamwork",
      "adaptability",
      "customer experience focus",
      "motivation",
      "learning aptitude",
      "technology sales",
      "business-to-business sales",
      "pipeline management",
      "product knowledge",
      "cyber security",
      "cloud data functionality",
      "managed print services",
      "IT services",
      "video security systems",
      "automation services",
      "sales presentations",
      "proposal creation",
      "persuasion"
    ],
    "short_keywords": [
      "adaptability",
      "aptitude",
      "automation",
      "businesstobusiness",
      "cloud",
      "communication",
      "creation",
      "customer",
      "cyber",
      "data",
      "engagement",
      "experience",
      "focus",
      "functionality",
      "it",
      "knowledge",
      "learning",
      "managed",
      "management",
      "motivation",
      "persuasion",
      "pipeline",
      "presentations",
      "print",
      "problem",
      "product",
      "proposal",
      "representative",
      "sales",
      "security",
      "services",
      "solving",
      "systems",
      "teamwork",
      "technology",
      "video"
    ]
  },
  {
    "job_id": "3903444840",
    "job_title": "Insurance Sales Agent - Bloomington, IL",
    "category": "SALES",
    "job_description": "IT’S A GREAT TIME TO JOIN AAA THE AUTO CLUB GROUP!\n\nJOIN THE TEAM COMMITTED TO DRIVING YOUR CAREER FORWARD\n\nJOB TYPE:\n\nFULL TIME\n\nEXEMPT/NON EXEMPT:\n\nHOURLY\n\nJOB DESCRIPTION:\n\nWHY CHOOSE A CAREER WITH THE AAA THE AUTO CLUB GROUP (ACG)\n\nESTABLISHED BRAND THAT HAS BEEN AROUND FOR OVER 100 YEARS. OUR MEMBERS KNOW AND TRUST US!BRANCH OFFICES PRESENT A UNIQUE DYNAMIC FOR SELLINGWALK-IN TRAFFIC ALSO PROVIDES THE CHANCE FOR SELLING OPPORTUNITIES DAILYFIELD AGENTS RECEIVE 100% BACKING FROM ONE OF AMERICA’S MOST TRUSTED BRANDS TO INCLUDE PAID TRAININGLEADS, LEADS, LEADS – COMPANY PROVIDED LEADS AS WELL AS THE OPPORTUNITY TO SELL TO THE EXISTING MEMBERSHIP BASEOFFICES HOUSE TRAVEL, MEMBERSHIP, AND LIFE SALES STAFF\n\n\nEXCELLENT OPPORTUNITIES TO BUILD A CAREER PATH:\n\nPURSUE CORPORATE LEADERSHIP ROLES IN THE DISTRIBUTION CHANNEL OR ELSEWHERE IN THE ORGANIZATION, SUCH AS:\n\nFIELD SALES LEADERSHIPLEARNING & DEVELOPMENTUNDERWRITINGCLAIMSPRICING & PRODUCT DEVELOPMENTMARKETING\n\n\nA DAY IN THE LIFE OF A SALES & SERVICE REPRESENTATIVE (SSR)\n\nTHE AUTO CLUB GROUP IS SEEKING PROSPECTIVE SALES & SERVICE REPRESENTATIVES WHO CAN GENERATE NEW SALES, RETAIN EXISTING MEMBERS AND GROW ACG’S OVERALL BOOK OF BUSINESS THROUGH OUR MULTIPLE PRODUCT OFFERINGS. YOU WILL BE CHALLENGED TO DRIVE NEW BUSINESS WITH COMPETITIVE PRODUCTS AND HELP RETAIN THE AUTO CLUB GROUPS 14+ MILLION MEMBERS\n\nUSES SALES TECHNIQUES AND STRONG PRODUCT KNOWLEDGE TO IDENTIFY CUSTOMER-SPECIFIC NEEDS TO GENERATE NEW SALES, RETAIN EXISTING INSUREDS AND GROW OUR OVERALL INSURANCE BOOK OF BUSINESSEFFECTIVELY OVERCOMES OBJECTIONS TO CLOSE THE SALE AND/OR RETAIN THE INSUREDWORK TO MEET OR EXCEED TARGETS AS DEFINED IN THE SALES INCENTIVE PLAN AND AS ASSIGNED BY THE INSURANCE AGENT’S MANAGERCONDUCT INSURANCE REVIEW FOR CLIENTS TO IDENTIFY A RANGE OF SUITABLE PRODUCTSUSE PROVIDED TOOLS AND APPLICABLE UNDERWRITING GUIDELINES TO ASSESS RISK, RECOMMEND APPROPRIATE PRODUCTS AND RELATED COVERAGE, QUOTE, BIND AND ISSUE POLICIESENGAGE IN MARKET-BASED INTERACTIONS, AT BUSINESS ESTABLISHMENTS AND OTHER CONVENIENT LOCATIONS, TO SOLICIT NEW BUSINESS, CREATE AND EXPAND BUSINESS NETWORKS AND BUILD RAPPORT CRITICAL TO ESTABLISHING CUSTOMER SATISFACTION, LOYALTY AND AFFINITY TO THE AAA BRANDRESPOND TO CUSTOMER INQUIRIES AND REQUESTS RELATING TO INSURANCE, MEMBERSHIP AND FINANCIAL PRODUCTS\n\n\nWHAT IT’S LIKE TO WORK FOR THE AUTO CLUB GROUP:\n\nSERVE OUR MEMBERS BY MAKING THEIR SATISFACTION OUR HIGHEST PRIORITYDO WHAT’S RIGHT BY SUSTAINING AN OPEN, HONEST AND ETHICAL WORK ENVIRONMENTLEAD IN EVERYTHING WE DO BY OFFERING BEST-IN-CLASS PRODUCTS, BENEFITS AND SERVICESACG VALUES OUR EMPLOYEES BY SEEKING THE BEST TALENT, REWARDING HIGH PERFORMANCE AND HOLDING OURSELVES ACCOUNTABLE\n\n\nHOW WE REWARD OUR EMPLOYEES\n\nAVERAGE EARNINGS $57,000- $76,000\n\nA COMPETITIVE HOURLY RATE OF $18.19 - $28.30 PLUS COMMISSIONS AND OTHER INCENTIVES\n\nACG OFFERS EXCELLENT AND COMPREHENSIVE BENEFITS PACKAGES:\n\nMEDICAL, DENTAL AND VISION BENEFITS401K WITH A MATCH, RETIREMENT ACCOUNTPAID PARENTAL LEAVE AND ADOPTION ASSISTANCEPAID TIME OFF (PTO), COMPANY PAID HOLIDAYS, CEO DAYS, AND FLOATING HOLIDAYSPAID VOLUNTEER DAY ANNUALLYTUITION ASSISTANCE PROGRAM, PROFESSIONAL CERTIFICATION REIMBURSEMENT PROGRAM AND OTHER PROFESSIONAL DEVELOPMENT OPPORTUNITIESAAA MEMBERSHIPDISCOUNTS, PERKS, AND REWARDS AND MUCH MORE\n\n\nWE ARE LOOKING FOR CANDIDATES WHO\n\nREQUIRED QUALIFICATIONS:\n\nCURRENT PROPERTY & CASUALTY INSURANCE LICENSECURRENT LIFE INSURANCE SALES LICENSEVALID DRIVER’S LICENSE – WITH SATISFACTORY MVRMUST QUALIFY, OBTAIN, AND MAINTAIN ALL APPLICABLE STATE LICENSES AND APPOINTMENTS REQUIRED FOR SELLING AND/OR SERVICING AUTO CLUB GROUP MEMBERSHIP PRODUCTS AND AAA LIFE INSURANCEOBTAIN HEALTH AND ACCIDENT LICENSES AND APPOINTMENTS WHERE APPLICABLE AS DEEMED NECESSARY AND WITHIN A TIME FRAME ESTABLISHED BY THE BUSINESS UNIT\n\n\nEDUCATION\n\nHIGH SCHOOL DIPLOMA OR EQUIVALENT\n\n\nWORK EXPERIENCE\n\n1+ YEAR(S) OF CUSTOMER-FACING EXPERIENCE IN A FAST-PACED, COMPUTER-AUTOMATED, BUSINESS ENVIRONMENT (I.E. FINANCIAL/BANKING)\n\n\nSUCCESSFUL CANDIDATES WILL POSSESS:\n\nSTRONG SALES SKILLS WITH A HISTORY OF EFFECTIVELY DEVELOPING, TRACKING, FOLLOWING UP ON AND CLOSING LEADSADVANCED CONSULTATIVE SELLING TECHNIQUES UTILIZING THOROUGH PRODUCT KNOWLEDGESTRONG PHONE SALES AND PROSPECTING SKILLSEXCELLENT VERBAL AND WRITTEN COMMUNICATION SKILLS COMBINED WITH STRONG CUSTOMER FOCUSAMBITION, MOTIVATION AND DRIVEKNOWLEDGE OF DESKTOP SYSTEMS INCLUDING, BUT NOT LIMITED TO, MICROSOFT OFFICE SOFTWARE APPLICATIONSEXCELLENT LISTENING SKILLS AND ABILITY TO UNDERSTAND CUSTOMER NEEDS\n\n\nWORK ENVIRONMENT\n\nTHIS IS AN IN-OFFICE POSITION. EMPLOYEES WILL SERVICE ACG MEMBERS IN-PERSON AND ARE BASED ON SITE IN AN ACG BRANCH FACILITY.\n\nWHO WE ARE\n\nBECOME A PART OF SOMETHING BIGGER.\n\nTHE AUTO CLUB GROUP (ACG) PROVIDES MEMBERSHIP, TRAVEL, INSURANCE, AND FINANCIAL SERVICE OFFERINGS TO APPROXIMATELY 14+ MILLION MEMBERS AND CUSTOMERS ACROSS 14 STATES AND 2 U.S. TERRITORIES THROUGH AAA, MEEMIC, AND FREMONT BRANDS. ACG BELONGS TO THE NATIONAL AAA FEDERATION AND IS THE SECOND LARGEST AAA CLUB IN NORTH AMERICA.\n\nBY CONTINUING TO INVEST IN MORE ADVANCED TECHNOLOGY, PURSUING INNOVATIVE PRODUCTS, AND HIRING A HIGHLY SKILLED WORKFORCE, AAA CONTINUES TO BUILD UPON ITS HERITAGE OF PROVIDING QUALITY SERVICE AND HELPING OUR MEMBERS ENJOY LIFE’S JOURNEY THROUGH INSURANCE, TRAVEL, FINANCIAL SERVICES, AND ROADSIDE ASSISTANCE.\n\nAND WHEN YOU JOIN OUR TEAM, ONE OF THE FIRST THINGS YOU’LL NOTICE IS THAT SAME, WHOLE-HEARTED, ENTHUSIASTIC ADVOCACY FOR EACH OTHER.\n\nWE HAVE POSITIONS AVAILABLE FOR EVERY WALK OF LIFE! AAA PRIDES ITSELF ON CREATING AN INCLUSIVE AND WELCOMING ENVIRONMENT OF DIVERSE BACKGROUNDS, EXPERIENCES, AND VIEWPOINTS, REALIZING OUR DIFFERENCES MAKE US STRONGER.\n\nTO LEARN MORE ABOUT AAA THE AUTO CLUB GROUP VISIT WWW.AAA.COM\n\nIMPORTANT NOTE:\n\nACG’S COMPENSATION PHILOSOPHY IS TO PROVIDE A MARKET-COMPETITIVE STRUCTURE OF FAIR, EQUITABLE AND PERFORMANCE-BASED PAY TO ATTRACT AND RETAIN EXCELLENT TALENT THAT WILL ENABLE ACG TO MEET ITS SHORT AND LONG-TERM GOALS. ACG UTILIZES A GEOGRAPHIC PAY DIFFERENTIAL AS PART OF THE BASE SALARY COMPENSATION PROGRAM. PAY RANGES OUTLINED IN THIS POSTING ARE BASED ON THE VARIOUS RANGES WITHIN THE GEOGRAPHIC AREAS WHICH ACG OPERATES. SALARY AT TIME OF OFFER IS DETERMINED BASED ON THESE AND OTHER FACTORS AS ASSOCIATED WITH THE JOB AND JOB LEVEL.\n\nTHE ABOVE STATEMENTS DESCRIBE THE PRINCIPAL AND ESSENTIAL FUNCTIONS, BUT NOT ALL FUNCTIONS THAT MAY BE INHERENT IN THE JOB. THIS JOB REQUIRES THE ABILITY TO PERFORM DUTIES CONTAINED IN THE JOB DESCRIPTION FOR THIS POSITION, INCLUDING, BUT NOT LIMITED TO, THE ABOVE REQUIREMENTS. REASONABLE ACCOMMODATIONS WILL BE MADE FOR OTHERWISE QUALIFIED APPLICANTS, AS NEEDED, TO ENABLE THEM TO FULFILL THESE REQUIREMENTS.\n\nTHE AUTO CLUB GROUP, AND ALL ITS AFFILIATED COMPANIES, IS AN EQUAL OPPORTUNITY/AFFIRMATIVE ACTION EMPLOYER. ALL QUALIFIED APPLICANTS WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, GENDER IDENTITY, SEXUAL ORIENTATION, NATIONAL ORIGIN, DISABILITY OR PROTECTED VETERAN STATUS.\n\nREGULAR AND RELIABLE ATTENDANCE IS ESSENTIAL FOR THE FUNCTION OF THIS JOB.\n\nAAA THE AUTO CLUB GROUP IS COMMITTED TO PROVIDING A SAFE WORKPLACE. EVERY APPLICANT OFFERED EMPLOYMENT WITHIN THE AUTO CLUB GROUP WILL BE REQUIRED TO CONSENT TO A BACKGROUND AND DRUG SCREEN BASED ON THE REQUIREMENTS OF THE POSITION.\n\n",
    "job_skill_set": [
      "Sales Techniques",
      "Product Knowledge",
      "Microsoft Office",
      "Communication",
      "Customer Focus",
      "Sales Skills",
      "Listening Skills",
      "Motivation",
      "Teamwork",
      "Problem Solving",
      "Property & Casualty Insurance License",
      "Life Insurance Sales License",
      "Health and Accident Licenses",
      "Customer Relationship Management (CRM) Software"
    ],
    "short_keywords": [
      "accident",
      "agent",
      "and",
      "bloomington",
      "casualty",
      "communication",
      "crm",
      "customer",
      "focus",
      "health",
      "il",
      "insurance",
      "knowledge",
      "license",
      "licenses",
      "life",
      "listening",
      "management",
      "microsoft",
      "motivation",
      "office",
      "problem",
      "product",
      "property",
      "relationship",
      "sales",
      "skills",
      "software",
      "solving",
      "teamwork",
      "techniques"
    ]
  },
  {
    "job_id": "3904366782",
    "job_title": "Retail Sales Manager",
    "category": "SALES",
    "job_description": "7167 - SALT LAKE CITY - 11213 S JORDAN GTWY, SOUTH JORDAN, UTAH, 84095 CARMAX, THE WAY YOUR CAREER SHOULD BE!\n\nINSPIRE EXCEPTIONAL PERFORMANCE\n\nAT CARMAX, WE ATTRIBUTE OUR SUCCESS TO PUTTING PEOPLE FIRST. AS A SALES MANAGER AT CARMAX, YOU WILL PROVIDE STORE ASSOCIATES WITH THE SUPPORT AND MOTIVATION THEY NEED TO FOCUS ON THEIR CUSTOMERS. YOUR LEADERSHIP WILL ENCOURAGE YOUR TEAM TO DO THEIR BEST AND DRIVE SALES FOR YOUR LOCATION. IT IS OUR ASSOCIATES LIKE YOU THAT HAVE HELPED MAKE US ONE OF THE NATION’S LARGEST RETAILER OF USED CARS. IF YOU KNOW HOW TO ACHIEVE RESULTS BY COACHING AND DEVELOPING OTHER PEOPLE, WE’LL GIVE YOU ALL THE OPPORTUNITIES YOU NEED TO BUILD AN OUTSTANDING AND REWARDING CAREER IN OUR FAST-GROWING BUSINESS.\n\nWHAT YOU WILL DO – ESSENTIAL RESPONSIBILITIES\n\nLEAD A COMMISSIONED TEAM AND WORK ALONGSIDE OTHER SALES MANAGERS TO ACHIEVE STRONG SALES RESULTS FOR YOUR LOCATIONRECOGNIZE THE SKILLS AND GOALS OF EACH OF YOUR TEAM MEMBERS AND WORK WITH THEM TO BUILD A DEVELOPMENT PLANANALYZE AND TRACK SALES PERFORMANCE TO MEET TARGETSSOLVE PROBLEMS AND LOOK FOR NEW OPPORTUNITIES TO ENSURE OUR CUSTOMERS RECEIVE THE BEST POSSIBLE EXPERIENCE\n\nWHEN YOUR TEAM SUCCEEDS, YOU SUCCEED\n\nSALES MANAGERS AT CARMAX COME FROM MANY DIFFERENT BACKGROUNDS BUT THEY ALL SHARE OUR COMMITMENT TO ACHIEVING RESULTS THROUGH OUR PEOPLE-FIRST MENTALITY. WE’LL BUILD ON YOUR EXPERIENCE WITH SIX TO NINE MONTHS OF SALES MANAGER TRAINING. YOU WILL LEARN IN STORE AND THROUGH BUSINESS ROTATIONS, WORKING ALONGSIDE SALES CONSULTANTS AND MORE EXPERIENCED MANAGERS BEFORE TAKING ON YOUR OWN TEAM. WE’RE LOOKING FOR OUTSTANDING COMMUNICATORS WITH LEADERSHIP AND INTERPERSONAL SKILLS, WHO HAVE PROVEN THEIR ABILITY TO MANAGE SALES METRICS AND SALES PEOPLE AND WHO WANT TO SHARE IN THE SUCCESS OF A GROUND-BREAKING RETAIL BUSINESS.\n\nQUALIFICATIONS AND REQUIREMENTS\n\n AT LEAST THREE YEARS OF MANAGEMENT EXPERIENCE; EXPERIENCE IN A SALES ENVIRONMENT IS PREFERRED EXECUTE LONG- AND SHORT-TERM SALES STRATEGIESEXPERIENCE IN ESTABLISHING ACTION PLANS TO DRIVE PERFORMANCE OF SALESCOMMUNICATE CLEARLY AND EFFECTIVELYMOTIVATE, INSPIRE AND GET BUY-IN FROM OTHERSFLEXIBILITY TO PROVIDE COVER FOR STORE OPENING HOURS, INCLUDING EVENINGS AND WEEKENDS\n\nABOUT CARMAX\n\nCARMAX DISRUPTED THE AUTO INDUSTRY BY DELIVERING THE HONEST, TRANSPARENT AND HIGH-INTEGRITY EXPERIENCE CUSTOMERS WANT AND DESERVE. THIS INNOVATIVE THINKING AROUND THE WAY CARS ARE BOUGHT AND SOLD HAS HELPED US BECOME THE NATION’S LARGEST RETAILER OF USED CARS, WITH OVER 200 LOCATIONS NATIONWIDE.\n\nOUR AMAZING TEAM OF MORE THAN 25,000 ASSOCIATES WORK TOGETHER TO DELIVER ICONIC CUSTOMER EXPERIENCES. ALONG THE WAY, WE HELP EVERY ASSOCIATE GROW THEIR CAREER AND ACHIEVE THEIR BEST, AT WORK AND IN THEIR COMMUNITY. WE ARE RECOGNIZED FOR OUR COMMITMENT TO TRAINING AND DIVERSITY AND ARE ONE OF THE FORTUNE 100 BEST COMPANIES TO WORK FOR®.\n\nCARMAX IS AN EQUAL OPPORTUNITY EMPLOYER, AND ALL QUALIFIED CANDIDATES WILL RECEIVE CONSIDERATION FOR EMPLOYMENT WITHOUT REGARD TO RACE, COLOR, RELIGION, SEX, SEXUAL ORIENTATION, GENDER IDENTITY, GENETIC INFORMATION, NATIONAL ORIGIN, PROTECTED VETERAN STATUS, DISABILITY STATUS, OR ANY OTHER CHARACTERISTIC PROTECTED BY LAW.\n\nUPON AN APPLICANT'S REQUEST, CARMAX WILL CONSIDER REASONABLE ACCOMMODATION TO COMPLETE THE CARMAX JOB APPLICATION .",
    "job_skill_set": [
      "customer experience enhancement",
      "communication",
      "interpersonal skills",
      "problem solving",
      "flexibility",
      "sales management",
      "sales strategy execution",
      "performance analysis",
      "action plan development",
      "leadership",
      "motivation"
    ],
    "short_keywords": [
      "action",
      "analysis",
      "communication",
      "customer",
      "development",
      "enhancement",
      "execution",
      "experience",
      "flexibility",
      "interpersonal",
      "leadership",
      "management",
      "manager",
      "motivation",
      "performance",
      "plan",
      "problem",
      "retail",
      "sales",
      "skills",
      "solving",
      "strategy"
    ]
  },
  {
    "job_id": "3898160265",
    "job_title": "Sales Operations Manager",
    "category": "SALES",
    "job_description": "JOB PURPOSE: THE SALES OPERATIONS MANAGER PROVIDES SUPPORT FOR SPECIFIC BASE OF ACCOUNTS IN COLLABORATION WITH ACCOUNT EXECUTIVES. THIS POSITION SUPPORTS ACCOUNTS IN A WAY THAT MEETS CUSTOMER CARE STANDARDS AND ALLOWS ACCOUNT EXECUTIVE TO FOCUS ON REVENUE-GENERATING ACTIVITIES. SALES OPERATIONS MANAGERS ARE ESSENTIAL TO PROACTIVELY EDUCATING, SUPPORTING, AND LEADING CUSTOMERS THROUGH THEIR JOURNEY IN TECHNOLOGY. THIS PROACTIVE APPROACH HELPS ENSURE CUSTOMER SUCCESS LEVERAGING ALTAFIBER SOLUTIONS, WHILE PROMOTING THE LIKELIHOOD OF A LONG AND MUTUALLY BENEFICIAL BUSINESS PARTNERSHIP.  ESSENTIAL FUNCTIONS: MANAGING THE DAY-TO-DAY OPERATIONS REQUESTS OF CUSTOMERS INCLUDING GENERAL ACCOUNT INFORMATION, BILLING, TECHNICAL ISSUES, ETC.BUILDING A PROACTIVE PLAN TO INFLUENCE THE CUSTOMER BASE IN A THOUGHTFUL AND RELEVANT MANNER CULTIVATING SUCCESSES AND DEEPENING VENDOR- CUSTOMER RELATIONSHIPSOPERATIONALLY SUPPORTING A TEAM OF SALES REPS AND SALES MANAGER BY MANAGING TASKS AND MEETING DEADLINES SET BY SALES REPS AND SALES MANAGERINTERFACE WITH SALES REPS AND MANAGER TO ADDRESS SUPPORT OR ADMINISTRATIVE ISSUES, INCLUDING SERVICE SUMMARIES, INSTALLATION, BILLING QUESTIONS, HANDLING OUTAGES, ETC.MEET WITH MANAGER/TEAM/COACHING AND DEVELOPMENT; WORKING EFFECTIVELY WITH SUPPORT GROUPS; MAINTAINING TIMELY AND ACCURATE INFORMATION INTO SALESFORCE EDUCATION: FOUR YEARS OF COLLEGE RESULTING IN A BACHELOR'S DEGREE OR EQUIVALENT RELEVANT WORK EXPERIENCE: 3 TO 5 YEARS IN RELATED FIELD SPECIAL KNOWLEDGE, SKILLS AND ABILITIES: CREATIVE RESOURCEFULNESSCOMPLEX PROBLEM SOLVINGPHONE SKILLS, KNOWLEDGE OF ALTAFIBER SYSTEMS, AND COMMUNICATION SKILLSINHERENT ABILITY TO CLOSE SALES/NEGOTIATION SKILLS/PHONE SALES SKILLSMUST HAVE ATTENTION TO DETAIL AND BUSINESS/PROFESSIONAL WRITING SKILLSWORKING KNOWLEDGE OF MICROSOFT OFFICEABILITY TO WORK SUCCESSFULLY IN A TEAM ENVIRONMENTHONESTY & PROFESSIONALISMSENSE OF URGENCYTIME MANAGEMENT SKILLSABILITY TO LEARN AND ADAPT TO COACHING & DIRECTION SUPERVISORY RESPONSIBILITY:  THIS POSITION DOES NOT HAVE ANY SUPERVISORY RESPONSIBILITIES\nALTAFIBER:WE WERE MADE AWARE OF AN EMPLOYMENT SCAM IN WHICH A THIRD-PARTY IS CREATING FALSE COMMUNICATIONS UNDER THE ALTAFIBER NAME. WE WANT TO REITERATE THAT ALTAFIBER NEVER SEEKS PAYMENT FROM JOB APPLICANTS AND ONLY REACHES OUT FROM @ALTAFIBER.COM EMAIL ADDRESSES. WE ARE ENCOURAGING APPLICANTS TO APPLY THROUGH OUR WEBSITE AT ALTAFIBER CAREERS FOR ADDED SECURITY.",
    "job_skill_set": [
      "Microsoft Office",
      "Negotiation Skills",
      "Phone Sales Skills",
      "Attention to Detail",
      "Communication",
      "Problem Solving",
      "Teamwork",
      "Time Management",
      "Adaptability",
      "Professionalism",
      "Customer Relationship Management",
      "Creativity",
      "Salesforce",
      "Technical Support",
      "Billing Management"
    ],
    "short_keywords": [
      "adaptability",
      "attention",
      "billing",
      "communication",
      "creativity",
      "customer",
      "detail",
      "management",
      "manager",
      "microsoft",
      "negotiation",
      "office",
      "operations",
      "phone",
      "problem",
      "professionalism",
      "relationship",
      "sales",
      "salesforce",
      "skills",
      "solving",
      "support",
      "teamwork",
      "technical",
      "time",
      "to"
    ]
  }
]